{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "This part of the City/Outer Sunset does not have Viet eateries with banh cuon (rice rolls filled with ground pork and mushroom). While not the best, this place is decent and it's worth repeat visits. Even my folks liked their version and that's coming from an old world palate. The banh cuon cha lua (fancy pork roll) is the way to go.\n\nYou can get banh uot instead as it doesn't have fillings. However, banh uot allows you to include sides; besides cha lua you may add charbroiled pork, shredded pork skin, roast pork, have it vegetarian, etc. Their other items such as Bun Thit Nuong was okay - too much lemongrass in the pork marinade. Goi Ga (chicken salad with cabbage) is bland and needs a lot of nuoc mam.\n\nThe place is a hole in the wall but there are limited seating inside, maybe for half a dozen eaters. People getting to-go orders is more common. Note cash only, and you may order through the yelp app. They close a bit too early at 6pm.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "I have been coming here for more than 10 years, and I still highly recommend it. It is more authentic and tasty than anything you'll find in downtown or non-Asian areas of the city.\n\nI usually get their chicken sandwich, and it does not disappoint! Their other sandwiches are equally as good. Whatever ingredients they put in it makes it taste great! You need to eat it right away because the warmly toasted bread makes a big difference. I haven't found another place in the city as good as them yet.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "I love this place! Ever since I was young my grandma and my cousins would take me here. I lived in Vegas so every time I came to visit SF I had to come here. The ladies are really sweet and they always remember me even if I haven't been in for a whole year. The banh mi are delicious. I know their bread can be a little tough sometimes but is it really a banh mi if it doesn't have that crunch and chew??", "author": "Nina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Oops, Que Huong. Sorry you got lost in the shuffle. That might be how you feel sitting on Irving, among dozens of mom-and-pop Chinese restaurants, but it's okay. I know you're here.\n\nInstead of venturing out for delicious but pricey banh mi out in FiDi, as I'm apt to do, I come here for packed and tasty sandwiches. Fun fact: banh mi is much more popular among Vietnamese American communities than it is in Vietnam. You can take the colonialism out of Asia, but you can't take the resentment out, that's for sure.\n\nHistorical tidbit aside, I come here for their cha lua and nem nuong. They have other classics, like xiu mai and bo kho, and non-sandwich dishes like banh cuon and bun thit nuong. Although it's still expensive compared to a Lee's Sandwiches in San Jose, I think this is as good as it gets. Emily T. mentioned that this was her childhood haunt, and I totally see why. The prices are affordable, hovering around $6 for a sandwich that comes packed with pickled veggies and meat, and there's loads of Chinese and Vietnamese customers streaming in. If you want jalapeños, you'll have to ask, but they don't cost extra. \n\nThe kicker is the kewpie mayo/butter they smear on the inside. If it's anything they don't skimp on, it's that. I love getting globs of super soft, creamy butter oozing out as I squish it down. When you choose to add pate, as I always do, they also layer it on thick. They use the well-spiced good stuff -- not too salty, but very much so the liver we love and adore. These both make the bread, which often errs on the side of 'scrape-your-gums' crusty, much more palatable.\n\nGet your dessert fix here, too. They have lots of traditional drinks and desserts, meaning that you can get your che ba mau and soybean milk here. I've seen people order fruit milkshakes as well, although I never have.\n\nThere's limited seating, so I'd take it to-go and sit in your car, which is inevitably parked in a spot just off Irving that's about a foot too short for your trunk. I promise you that no matter where you're eating it, though, it's downright delicious.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "Bought their special Bánh mi and it was ok. The meat is cut up too big for my liking. I prefer it shredded. I couldn't really taste anything. Not even the pate didn't really make a difference. The bread was good. Toasty and a bit crunchy. There was no jalapeño and no daicon. The flavors didn't come through for me. I still prefer Lynda's sandwich all the way In Westminster. Heard she has one in San Jose too.", "author": "NkaujLig Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "New feature! You can order pickup thru yelp!!!! That's what I did today and paid in cash because I don't like using my credit card at mom and pop stores, you can pay using your credit card or PayPal through yelp which I'm sure you can't do in-person.\n\nI don't have a usual at this place but the majority of sandwiches I get are BBQ pork or combo. Occasionally I'll get meatball or BBQ beef. They're all good and it's a bit more expensive than going to Oakland or tenderloin but it's a lot closer to me. I especially like taking these sandwiches to the airport because I ain't paying $15 for a mediocre sandwich there...these sandwiches are good for picnics, snacks, and add one of their drinks and you've got one of the best meals in town for less than $10!!!!", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "This is a good spot to pick up some Vietnamese food, whether it be sandwiches or one of their many noodle and rice dishes.  While I find that they are a bit on the expensive side when compared to the sandwiches I can get in the Tenderloin or the South Bay, it's still a pretty good deal overall.  While the noodle dishes don't compare to those served at a sit down restaurant, I think it's okay for a deli.\n\nIt's never been crowded when I visit and the service is rather prompt.  Cash only.  There is limited seating inside but I've always taken my food to go.  The place is pretty clean and spacious.  Parking is relatively easy when it's not the lunch rush on a weekday or weekend.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-07", "description": "I didn't start loving bahn mi until I found this place.  Now I come here and order two sandwiches (one for immediate consumption and one to save - even hours later it's still good) because I can't decide which I love more, the combination or the bbq pork.  My whole family asks for a bahn mi whenever I go here so I've started to order ahead through Yelp.  The ladies running the shop and making the sandwiches are friendly and make awesome food.  I've always wanted to try their other food, but haven't had a chance yet.", "author": "Joanne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "Cash only. I was surprised to learn that the folks working here speak Cantonese! Tasty sandwiches and popular - there was a queue when I arrived on a Saturday afternoon. We got a couple roast pork banh mi sandwiches and they were very satisfying for our hike in the Marin headlands. Note, by default the sandwiches don't come with jalapeno so make sure you ask. The seeds are left on the peppers so they were pretty spicy. Overall the sandwiches could use more pickled veggies and cilantro but would come back again.", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "4 stars for the BBQ Pork, 1-2 stars for the other banh mi's I tried. I saw the sign for Que Huong while walking around Irving Street, and decided to stop by to try out their banh mi. They were pretty busy around noon on a Sunday, and it took them a while to make our order, so I'd definitely follow other Yelper's advice to call your order in ahead of time. You also might have a better chance of them making your sandwich correctly- they forgot the pate on one of my sandwiches, and forgot to give us jalapenos :( I ended up trying:\n\n-#4 Roast Pork Sandwich ($4.50, https://www.yelp.com/user_local_photos?select=NaESQiaFTD4xl9FKcFlg2A&userid=76vIFZcC7owykCBjMfGVXg): Not very good- the pork was dry and bland Skip!\n-#14 Pan Fried BBQ Chicken Sandwich ($4.50, https://www.yelp.com/user_local_photos?select=2f_YZliShq-JFnOklKu_rQ&userid=76vIFZcC7owykCBjMfGVXg): Also not very good- they left the skin on the chicken, but it wasn't crispy so just squishy and fatty. The chicken was also really bland- skip!\n-#13 BBQ Pork Sandwich ($5, https://www.yelp.com/user_local_photos?select=1lWnI_GL2PP-gGrxzISf9A&userid=76vIFZcC7owykCBjMfGVXg): YUM, this is definitely the sandwich to get here! They have vats of this pre-cooked, and it must be one of their more popular sandwiches. This version of pork sandwich has great flavor, and I loved the sear on the pork- a must try for pork lovers!\n\nI wish I had kept my original order for a Fancy Pork sandwich instead of swapping to the chicken last minute, and I'll have to come back to give that a try. I liked their pickled vegetables and mayo, and the bread was solid (although I wish the crust wasn't quite as crunchy). Hopefully I'll have a chance to try their pate the next time around. Parking in this area is always crazy, but there are street parking spots available.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "This is my favorite deli to get coconut milk with grass jelly. I crave this drink all the time. They also make one with red bean and assorted fruit jellies. The last time we were here, the owner made us a fresh batch.", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Amazing authentic Viet food! I've been trying to find a place that makes banh cuon, banh beo, banh Cong, etc in SF, but have had little luck until now. Will go here all the time now! The people are nice and the place is cute and clean! Love it!!!", "author": "Kim P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Nothing special about this Vietnamese sandwich shop. Called in to order a sandwich since I was in a hurry. 25 minutes later, the sandwich was still not ready...\n\nThe sandwich itself was just okay. The meat tastes off and the color looks odd. Probably because it wasn't fresh. \n\nOverall, I would not coming back again.", "author": "Brenda H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "I have no clue why this place is so highly rated, seriously makes me wonder if Yelp reviews are like Amazon reviews where ppl get paid/bribed to leave positive ones. Well this one's legit:\n\nI'm revieweing their banh mi. Price is high for the amount and quality of food you get, bread is rock hard and literally cuts the inside of my gums every time. Just some pickled carrots, literally no sauce, and a singles trip of cilantro. I can make better at home, for cheaper.\n\nGuess next time I'll have to order to-go from one of the nearby Viet restaurants, because this banh mi was seriously disappointing.\n\nAlso, they charge tax on cold food taken out, which technically in California law you can't do. Kinda shady but I'll give 'em a break maybe they don't know the rules...", "author": "Conscious C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "I have like a tofu dish with cold white noodles I forgot what it was called but it was so good and they had a bunch of cool drinks and deserts I loved it the only complaint is I didn't really have a ton of tofu and I didn't really eat the weird black stuff cuz it looked weird lol but other then that it was delicious the sauce was so good it was amazing", "author": "Blank Spaces S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "This spot totally used to be my jam for banh mi sandwiches in the city...but as many others have said, their quality and consistency has significantly declined. And in addition to that, the prices have increased. What? Why? How? \n\nI only eat fish cake banh mi sandwiches, and this is one of the few places in the city that has them. The size of their sandwich is decent and the quality of the fish cake is pretty good, but the bread (the last few times I've gone) has been a major hit or miss. ALSO - they use the same tongs to pick up the pork/assorted meats as they do for the veggies. I JUST noticed that in my last visit. Being a pescetarian, that freaks me out a bit. Stomach-ache ensued?\n\nWhat is happening? Why is the bread either almost stale tasting or fresh? How can you be charging $5+ for an inconsistent sandwich?\n\nIt makes me very sad to give this place 3 stars, whereas in the past, it would've been a 4-5 stars. Here's to hoping you can turn it around!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "They open pretty early. Nice and friendly employees. Coffees are strong, sandwiches are wonderful(should eat it soon cause the bread will get soggy)", "author": "Jack W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-15", "description": "Food is the worse, no more customer service. Sandwich doesn't taste like before any more.  I used to come to this place for years since they had only half size space.  Since they expanded the next door, all downhill from there.  Food is nasty, sandwich is chewe and they even charge on everything even ice.  Sugar can with no ice double price.  Not even that, the choppy lazy has the worse customer service, she gave me the bad attitude when I wanted to buy sugar can without ice and asked about the price.  Bad ,bad attitude , degenerate food and services.  \n\nNever come back again.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "Wth happened to my fav banh mi joint?!  I bought two cold noodle dishes and their fish sauce was sweeter than my boba! Gross!  The only flavor was super sweet.  , along with the marination of the pork.  \n‍ This place has really gone down hill.  So sad.  This was my fav local Mom and pop viet deli.  \n\nNow I understand why they don't have 4 stars on yelp any more.", "author": "hannah t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-15", "description": "Lots of banh mi to choose from, with my favorites being the combination pork sandwich as well as the meatball sandwich. There are also other offerings like noodles, rolls, rice plates, and even bubble tea.\n\nAs for the banh mi, I found them to be pretty decent. They are deceivingly large until you realize that you're getting a relatively large baguette with not much in the way of fillings inside. It's all tasty enough, but just a wee bit spendy given what you get, especially compared with other places throughout the city.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "Worst Ban Mi in SF!!! The bbq pork ban mi was too sweet. And the bbq chicken was bland. Worst of all the bread was stiff and there was no jalapeños! Wtf??", "author": "Jojo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-06", "description": "Pretty good spot for viet sandwich. Come here whenever I'm in the neighborhood. Their sandwiches are pretty filling. One of the few places that open early for breakfast. Open at 8am. Downside is cash only.", "author": "La G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Their sandwiches are simple, yet are satisfying. They're pretty cheap for the sandwich you get. They do pack in the meat, which is good to me. Sure they're a little small, but it is only $5.50 for the BBQ pork banh mi. That is the sandwich I always get. It's definitely worth the low price. You'd be getting a good deal on a good sandwich. What's not to like?", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "I've been ordering and eating their #1 vietnamese sandwich since my junior year of high school. \n\n-The ingredients they use are fresh and delicious. I love the quality of the bread they use, not too hard or soft. Unlike other sandwich places, they don't pile the sandwich with pickled daikons, carrots, and cilantro; everything is in moderation. The pâté, meat, and mayo are my other favorite ingredients they use!\n\n-Calling ahead to place your order is really reliable and efficient. I used to literally come into the store to order and had to wait in the crowded area, while they made other customers' sandwiches. The ladies who work here are really smart because every time I come to pick up my order, they know which one is mine since they can recognize my voice on the phone. \n\nThis is one of my go-to vietnamese sandwich places, and they never disappoint. Although prices have increased from the past, the quality always makes it worth for me to keep coming back. It's really convenient for me to buy boba and then pick up my sandwich on that street. I would highly recommend ordering the #1 or bbq chicken or pork sandwich!", "author": "Erica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-29", "description": "My purpose for coming here was that I was in the area and happened to see that there was no line!\n\nI frequent this area enough to be familiar with most of the businesses but I apparently never noticed this deli. After I had stopped by the bank I was passing by and saw the menu in the wind. The menu looked BOMB! They have a lot of stuff here. There is a lot to choose from so definitely take your time. It took maybe 5 minutes for me to decide what I wanted once I went inside. I eventually ordered the Bun Chia Gio Thit Nuong, yeah boy!!!\n\nAfter I placed my order I took my seat at one of the stools. As I sat and waited for my food I noticed that this place is fairly nice for being so small. There are maybe 8 stools for seating and two bars for placing your food. It is very clean as well. There are flat screens here that provide a slideshow of the menu items, that always helps. There is also a cooler near the entrance for those who want tapioca and other sweet treats as well as drinks.\n\nThe service here is really quick and efficient and that goes a long way with me. \n\nThe meal was FANTASTIC. I having been to other Vietnamese restaurants I have never had a take out meal be so GOOD! The meal was filling and AMPLE! Ample meaning that there were enough portions of everything to fill my stomach and appetite. Good choices made all around in regards to coming here and meal selection. \n\nHands down one of the best locations to get some good Vietnamese food. Whether it be a sandwich steamed rich noodles, or rice plate. This places gets the job done the right way. Quality food and god eatz! \n\nThis place really eatzme.\n\n#getitalready", "author": "Robert F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-28", "description": "In the past year I've been here three times . I used to love the place but something  changed . Besides the price going up I've noticed that the food here is less fresh . The past three times I went here I ended up with major stomach aches . The meat color is different and it's such a bummer to see where this place is headed .", "author": "Toan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "This place is pretty awesome!\nIf you're craving a banh mi and are in the sunset this is definitely the spot.  For under 5 bucks you'll get a good size sandwich that is full of flavor.\n\nToday I tried the bbq pork banh mi and boy was it good, one of the reviewers complained about the carrots being cut too thin and the cucumber too thick, even though I have to agree with that, this place definitely earns 4 stars in my book.  There was a line when I came, however it moved pretty quickly.\n\nThis place is definitely great for lunch, if you're trying to grab a bite on the go or even if you're just craving a banh mi.  I'm not a banh mi connoisseur however it doesn't take one to figure out this place is legit.  I just wish I would've asked for pate on my sandwich, that's all!", "author": "Josh Giosue D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-13", "description": "Ordered a shredded pork sandwich to go. When I got home, I was mortified when I opened it up to find TRIPE inside!!! No shredded pork at all! WTF?? the ones they were making when I was placing my order looked tasty but I'm so grossed out I will never get anything here again. I'm traumatized because tripe disgusts me and that is not what was listed on the menu. GROSS", "author": "Maxine E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "I grew up on Vietnamese sandwiches from Que Huong and it continues to be my favorite spot even after testing the waters in the OC and San Jose. The combo banh mi with specialty pork and pate is my go-to, but I also enjoy the BBQ chicken sandwich as well. \n\nThe lines can get long during lunch time, so I highly recommend phoning in your order first. \n\n*It's cash only here, but almost all the major banks can be found on Irving St.", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "I was craving Vietnamese sandwiches for lunch, so the roommate and I ordered delivery on Sunday, July 19th around 1pm.  We placed an order through Eat24 since we had a $2 off weekend promo code. Prices below are what we paid using Eat24.\n\n13. Banh mi thit nuong ($5): bbq pork sandwich, with jalapenos\n14. Banh mi ga nuong ($5): pan fried bbq chicken sandwich, add Pate (+$0.50), with jalapenos\n20. Banh mi bo kho ($8): beef stew soup with bread sandwich\n26. Goi cuon ($5.50): cold spring shrimp roll (2)\n51. Bun cha gio thit nuong ($8.25): egg rolls and bbq pork with cold rice noodles\n108. Sinh to dau ($4): strawberry milk shake\n\nNot sure if they give you jalapenos on sandwiches for delivery, but we noted we wanted jalapenos as indicated in all the reviews. Thanks Yelp as I would have been bummed without jalapenos. I got the chicken banh mi, add pate. The chicken was good, but there was very little pate. It didn't really add the creaminess to the sandwich that I wanted. I also got the spring roll which was okay. Since it was room temp, the wrapper was a little hard which made the texture a little chewier than I wanted. The strawberry shake hit the spot but was a touch too sweet for me. The roommate got the rest of the dishes. He enjoyed the beef stew. I loved the bread as it had a great crustiness.\n\nSince we ordered through Eat24, there was $5 delivery charge and a $0.10 SF bag fee. Not bad as I crave Vietnamese sandwiches a lot and am often super lazy. Will definitely hit them up the next time a craving hits!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "Seriously the worst banh mi I've ever had in San Francisco. The meat is fatty, tasteless, and doesn't even look real. There are far better places that use quality ingredients for the same price. Hopefully this place get it together.", "author": "Conrad L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "Service with a smile but then again, I'd be smiling too if I charged over $5 for a Vietnamese sandwhich. \n\nHalfway through, the BBQ chicken started getting soggy. Opened it up and staring at me was this huge piece of fat. If you're going to overcharge me, at least take a moment to cut out the lard. \n\n4 people working at this place? Hardly seems necessary. The person I handed my money to another worker an arm's length away to get change? Seriously? With limited space and limited funds, you guys might want to make better use of your staff. \n\nI guess we're paying for it. At these new prices, I'd rather stop by Subway and use my \"buy one 6\", get another free with a purchase of a drink\" coupon. \n\nNotice that all the 5 star reviews (which I still question) are from last year. Im far from a foodie, but man if you really have this a 5-star even back in the day when it was decent, you really gotta try some other places. Even if you don't have a car or scooter, take a moment to bus somewhere and taste some real quality. It'll be worth your $2.25. \n\nA lot has changed. Happy new year! Let's charge you another dollar. \n\nWouldn't be a problem if they're raising from possible rent increases, but quality has come down and I can't get over that they left me that clump of lard (see photo). There's minimal cost in the labor to skip the fat fellas. \n\nUsed to like this place but recipe has changed on the meat, free glob of fat and fewer bills in my pocket after stopping by here has me looking elsewhere. \n\nSo many other choices out there. No reason to come to this place anymore. Very disappointing. I usually root for the underdog small mom and pops but they messed this one up pretty bad.", "author": "Brian Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Been going here for 5+ years. My wife has been going here since middle school.\n\nNumber 13, grilled pork sandwich. The BEST damn banh mi in the city, hands down. No other place comes close.\n\nSad that I don't even know the name of the place before I Yelped it. When I tell my wife \"Let's get banh mi\" she knows exactly which place we're going. \n\nMy wife says the sandwiches used to be super cheap back in the day, like $3 cheap. But of course, there's this thing called inflation and increased cost of business. Honestly don't know how much a banh mi costs here, maybe close to $6 now. I don't really care though, I'd pay up to $10 for one. Much better than Lous, subway, little luca's etc. My favorite sandwich in general.\n\nSome tips:\n- If you want peppers, you need to tell them. They exclude them on default, but do not charge additional. \n- You pay AFTER you receive your order.\n- My wife prefers less sauce. I can't eat it this way though. Just know this is an option.\n- Limited seating. But it's almost always available. Not a great place for big groups.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "#34 I was looking around for the place that I always used to go to in high school. I think this is it because the workers were still the same. \n\nIf I had to pick a favorite banh mi place, it would definitely be this or Little Saigon in TL. This place has a better baguette, though. It tastes just as it did several years ago. If you let it sit a little, the bread will soak up the juices making it a bit soft. The chicken is microwaved prior to being put in the sandwich. Idk how I feel about that. All sandwiches come with jalapeno so make sure you tell them to take it off if you dont like spice. However, my boyfriend said it wasnt that spicy. \n\nThe banh mi's are $5. $1 more since high school. The guy working in the back was great. He got my order correct even though it was confusing.", "author": "Kirstie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "I came here with my friends after school yesterday, I ordered the #1 Combination pork sandwich and the sugar cane juice. The sandwich tastes really good. I think this is the BEST sandwich I've tired in the city, LOL. Definitely will come back again with all my friends. The price is average, not that expensive compare to the other vietnamese sandwich. Also, people who work there are SO SO SO nice and they care about what customers want. \nDefinitely a tasty, satisfying meal, and I'll be back soon!", "author": "Janice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "If you love vegetables, garlic, and perfectly toasted French bread, get the \"fresh vegetable sandwich\" (menu item 9, I think).\n\nAt $5 it is possibly the best value Vegetarian lunch in San Francisco. \n\nMy gluten-free wife really enjoyed the vegetable tofu spring roll.", "author": "George K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Very small establishment but has a few seating. I love the window seats where I can sit and enjoy my eats while people staring- a favorite thing I like to do. \nI have ordered the following: \n#6- pork with pate Bahn mi. Really tasty! I've had quite a few Bahn mi sandwiches from other establishments and this place is tops. Love the pate. \n#70-house special chicken rice plate. Very good portions and the chicken was delicious. Very 5-spice like. \nAlmond jello - like it !\nGrass jelly with coconut milk - yum!!- not too sweet and goes well with the grass jelly. \nI will definitely be a regular here!", "author": "William Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "I have lived in the neighborhood my entire life and have been coming here for quite some time. It only dawned on me today the name changed. This explains a lot. It was great when it was Irving Street Cafe. The quality of everything has gone down since the name change and expansion. They use a lot of fillers in their items now and started charging more on top of that. The sandwiches are ok, but they don't bother to cut off the fat which isn't very appetizing when you get a mouth full of rubbery fat. I'll be taking my business to Yum Yum Sushi House across the street now that they have reopened.", "author": "Adelina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "The business hours at 8:00 am to 6:30 pm . There are a lot of delicious desserts and meals such as the BBQ chicken sandwich, BBQ pork sandwich, and Banh Beo.  The staff at the counter is also really sweet and nice.", "author": "Jimson Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "Just had the worst bbq pork vermicelli. The grilled meat was not fresh, full of fat and hard, certainly few days old.  Banh-wich on Taraval has much better Vietnamese sandwiches than Que Huong! It was my first and last time there.", "author": "Ha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "I love this little deli. Bahn Mi (se Asian sandwiches in French baguettes) are a bit of an obsession for me. Que Huong does not disappoint, and it may be my favorite deli on this side of town. Bread is fresh and crusty, the veggies sweet and sour, perf curly balancing the fine meats, pate, even eggs. Lots of tea drinks, their Thai iced tea is a lively dark color, and lightened/sweetened the traditional way with sweetened condensed milk, not sugar and half and half. It's so much better. The place is small and you can miss it walking by, but don't!", "author": "Scott B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-17", "description": "I usually like buying sandwiches here! But today July 19,2017 I found one white hair in the sandwich as I look at it more there one more in my sandwich! I am so grossed out! There no words to explain how I feel about eating the sandwich!!!", "author": "Marie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Mmmm a BBQ Pork Sandwich for just under $5. I had half for snack one day and dinner the next day because I like saving it for an extra meal. I have no complaints at all about the sandwich. It's just good. This is the place most people I know go to for Viet sandwiches in the Sunset. But then again most of the people I know are people who went to Lincoln so Irving is like home for us alums. \n\nDon't forget--CASH ONLY!", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Clean, fast and so good\n\nBBQ pork is the best. Very flavorful and not fatty at all. \n\n$4 for a big and meaty sandwich? U can't beat that\n\n:)\n\nCash only", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "Looking for a good banh mi on Irving? I find myself here several times a week. Mostly due to the good price and the broad selection. I always tend to get the #6, which is the fancy pork. Their summer rolls are pretty good, along with their desserts. I went here for my last lunch in SF (I'll be away for two months), and I bought a banh mi, a bag of chips, and a drink for under $10. It's also nice because there's a decent seating area and a bunch of dessert and boba places for after.\n\nThe staff are pretty friendly and they tend to put quite a bit into their sandwiches. With almost everything on the menu less than $5.00, you're getting a pretty good portion at an awesome price!\n\nFood: 9/10\nStaff: 8/10\nAtmosphere: 9/10\nOverall: 8.7/10", "author": "Evan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Friendly and efficient staff. Definitely love the BBQ pork and combo and fancy pork.\n\nI suggest calling in to order before picking it up before because they usually take a few minutes to make the sandwich\n\nThis place also has a small seating area and a selection of desserts and beverages!", "author": "Kevin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "One of my favorite Vietnamese sandwich/deli places to go to. The sandwiches are made to order and I love their spring rolls and fresh spring rolls. Their selection of Vietnamese desserts are awesome. The staff are nice and make sure that your food is the way you like it. Love this place !", "author": "Angie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Yum, yum, yum!\n\nGrowing out in the Sunset, I always came here for Vietnamese sandwiches.  Since then, their prices have gone up, but the quality is still great.  All the sandwiches are great and fresh.  :)", "author": "E G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "I've picked up a bahn mi on several occasions and I'm never disappointed. I usually get BBQ pork with pate, and I'm not complaining at the generous spread of pate slathered on that warm, flaky, and yummy baguette. \n\nService is friendly and quick and food quality is above average compared to other bahn mi places around the city. And I've tried MANY. This joint leaves me impressed and nourished. Good work Que Huong -- you never disappoint and you always make me feel that the $5.98 was well worth it.", "author": "Cameron M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-02", "description": "Went by this place when it was named Irving street cafe.  It has a new name and a different look.  However, it has the SAME employees AND menu.  The prices went up for the same dishes AND service.\n\nWith that said this review is for 3 visits I did in the past when it was named Irving street cafe.  On 3 different visits I ordered takeout that was a rice based dish.  On those 3 visits spread across a span of a year I was told that they had no rice.  WTH... an Asian resturant that ran out of rice.  \n\nAs for the sandwiches, it's hit or miss.  \n\nSince there are sooooo many places on Irving street for veitnamese sandwiches, be happy and go else where with your $.", "author": "Guest U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-07", "description": "I love their redesign! I'm just glad that this Vietnamese joint is here to stay despite the ever-changing whirlwind of \"trendy\" fast food options that cycle in and out on the same block. The sandwiches are still as good as ever, and I really like the huge illustrated menus they have posted everywhere now. There's always a really nice helping of julienned pickled vegetables in each sandwich, and I appreciate their prompt no-nonsense service. \n\nNOTE FOR JALAPENO LOVERS: They had a little handwritten notice up that I missed on my latest visit, but they apparently no longer include jalapenos by default. They're still free! - but you have to request them when you order. Good to know for the future!", "author": "Delia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "I got the BBQ pork banh mi sandwich & my friend got the mixed pork banh mi sandwich. We both agreed that although both were good, the BBQ pork was better. It was juicy and tender and delicious!", "author": "Xe X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-26", "description": "I use to go to the previously named Irving Cafe and Deli and it was long overdue for another visit. It's been so long that they've remodeled and changed their name! One thing that still hasn't change is they're CASH ONLY still... So go to the nearby bank ATM. Wells Fargo, Chase, Bank of America and US Bank are all within 1-4 blocks.\n\nSandwiches and rice noodles are always my fave here. This time around, I was looking forward to grabbing dinner here after work... Thought about it all day. I decided to call in an order for pickup and try something different and heard great things about. I called in three orders of the rice noodle rolls to bring home for the group. But I guess they didn't hear me say \"rolls\" and gave me rice noodles instead. Since I was already home, I wasn't going to drive back so I was ok eating it.  As I was eating... there was a piece of hair on one of the fancy pork. As I continued eating... There was another piece in between the other porks. :( all in all, hair doesn't bother me too much because it happens sometimes. It was just a bummer that I was looking forward to eating rolls all day and ended up getting the wrong order and had hair in it. I'll keep it at 3 stars for now.", "author": "Nancy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-22", "description": "Their combination sandwich was very flavorful.  Their meatball sandwich was okay because the meatball tasted a bit on the bland side.  I would go back for the combination sandwich.  I also tried their BBQ chicken rice. One word to describe it: awful.  The chicken tasted old and stale. Can't believe they actually sold that to me.  Don't waste money on that plate.", "author": "Susan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "This place reminds me of Little Paris, the banh mi place that used to be on Clement way back in the day. Why did they ever close??\n\nAnyway, even though all their desserts evoke childhood memories, I've only ever gotten the #1- banh mi dac biet. I do ask them to go easy on the butter, though. It's too much when I watch them put it on. They also have bottled soymilk!", "author": "Leslie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "Good for a quick bite to go.\n\nBahn Mi Combo was a little sparse, but hit the spot.\n\nShrimp Summer Rolls had a great little peanut sauce that was not too thick.", "author": "Dean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Yum Yum, the service good, people who work there smile a lot and very nice to customers.", "author": "Jjinyan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "cheaper than a few other Vietnamese sandwiches, but not by much. I LOVE this place. It's always busy when I go, but they are LIGHTING fast. Cash only.\n\n\nI wish they delivered to my house!", "author": "Sweets N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "A tasteful sandwich with a drink for under ten bucks... 4/5 BBQ pork is my favorite. I need to try the rest of the menu  though   the only down side is the bread is a bit rough to eat every day. (Not old bread hard, just try it and you'll know what I mean). The people are always smiling as well so its good vibes all alround!", "author": "Mitch J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-22", "description": "I came here with a friend because she told me their baguettes are perfectly toasted. I ordered Dac Biet and she ordered Thit Nuong. I bit into the bread and it was so stale and old that I could barely break it away and chew it. I tried my friend's sandwich and her bread was not as stale as mine. \n\nI went over to the counter and asked the woman to replace the sandwich because the bread was stale and was very hard to chew. I even spoke in a low voice to not bring attention in front of their customers. The woman snapped at me and said they toast each baguette fresh before they serve it. I reiterated that it was impossible to chew! She then agreed to replace it but had the meanest glare on her face and continued to complain to her coworkers about it in Chinese in front of me, which is my second language. \n\nI took one bite of the new sandwich and decided to throw the whole thing away. The Thit Nguoi (pork cold cuts) were cut very thickly - most people cut it thinly for the best taste, no one wants a big piece of fat in every chew, the pickled carrots were tiny shreds and not the generous size for added crunch, cucumbers were also very thick which gave it a watered down flavor, and lastly, the jalapenos were turning orange which means they were too ripe.\n\nI don't normally pick at the tiny details and describe every little thing but I don't think this place is good for an authentic Vietnamese banh mi - especially Dac Biet (puts it to shame).", "author": "Briget P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "This place is good for cheap and filling banh mi. While their sandwiches aren't 5 stars, the service is super speedy and I'm always left happy after eating! The combination pork sandwich (#1) is pretty good and contains a good amount of pork, pate, and more. Jalapeños are available by request!", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Banh Uot is filling w/ lots of veggies. Sandwiches are around $4.50-$5. They also have desserts in the fridge. Sit down area is clean.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "great, cheap banh mi! i've had the combo pork and pate and both were well-toasted, generous, neither too dry nor soggy, and prepared very quickly (less than 4 minutes total)--perfect take-out. it is very small and essentially just a store front with no bathroom so I would not plan to eat here. also very close to iTea!", "author": "Cailin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "The employees here seemed nice here but unfortunately I have to give this place a low value and rating for their drinks. Just ordered a Thai iced tea. I watched him make it and he filled up the cup maybe 35% full with tea and condensed milk. I figured a little low but he must be going to add another liquid. Instead he adds two heaping spoonfuls of ice into the cup. $3.82 for barely a third of a cup of liquid. I commented on how that was a lot of ice and he said would you like less? It's not that I necessarily don't want ice- I'd like the liquid beverage that I just paid for. I should have spoken up but seriously? The cup wasn't even full with the ice. I finished it in a few sips. Won't be back. Im including a picture in the gallery.", "author": "Katie A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-17", "description": "was grazing my way through irving street and stopped in to try a xiu mai ban mi.  \n\ni've eaten ban mi's all over sf and oakland.  this place was the worst i've had in \nthe bay area.\n\nthe pickled vegetables had no taste, no bite whatsoever.  where did they come\nup with their recipe?  do they just cut some carrots and radish and throw it in \nthe sandwich?  there was no flavor at all.  \n\ni hate it when a place tries to capitalize on a fad/trend and they don't make any \neffort at all except to take your money.  (see also ramen joints and dumpling \nplaces in sf/oak).  \n\nthe xiu mai had no taste either.  this meat ball is all about the seasoning.  if you\nhave no seasoning, this is ground pork.\n\nplease vote with your pocketbook and try to influence this place to care about\nwhat they serve...", "author": "C C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Tried the #6 (special pork combination sandwich w/ pate) and my uncle had the #70 (special chicken plate over rice). We also had the coconut milk drinks with grass jelly. \n\nThis place exceeded my expectations: good pricing, amazing food. So much variety in food and desserts.\n\nThe sandwich tasted like my childhood. The pate was spot on and the flavors were great.   It was all very filling! Plus the coconut drink was a refreshing side.\n\nJust a note, this place can get crowded at times but they're pretty quick. \n\nWould be back!", "author": "Guilliana J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "CASH ONLY!\n\nThis is a great place for banh mi (vietnamese sandwiches) besides Saigon Sandwich in the tenderloin.\n\nThey use to be a smaller spot and called Irving Deli and Cafe but decided to make their place bigger and changed their name to Que Huong in the past 2 years. \n\nIts the best place for banh mi in the sunset district. They have also advance their menu to include more items and also uped their price a bit but still very reasonably affordable.\n\nMy favorite banh mi are the fancy pork with pate, grilled chicken and their combination. I also have cravings for vietnamese spring rolls and they pre make them now so theres no wait for them. They also make very good banh out (rice rolls with fancy pork) They're still my favorite place to order that dish.\n\nThey now have more in door seating for customers to sit down and enjoy their meal. \n\nTip: Whether you need to order one sandwich or many, you can always just phone in an order ahead of time since sometimes there could be a wait when you arrive.", "author": "Joanne K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Pretty solid place. The have a good variety of snacks and food to go. Most famous for their Banh Mi though. \n\nI remember when I was like 8, my mom used to work at a hair salon close by and I'd walk here to order the Banh Mi bread toasted with just butter. Maybe that is how I got fat and belly rolls now? Oh well. No ragrets!\n\nI came here the other day and noticed the prices gone up but quality is still as good as it was when I was 8 years old. Now I'm 19... So much nostalgia. But yes, would definitely recommend it's a solid place to stop by to grab and go food.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-03", "description": "You poor, poor things. \n\nIf you rated this place 5 stars, I'd have to question your taste in food. \n\nThe first time I ate here I had \n11) Shredded Pork Sandwich\n-SO DISGUSTING. The pork didn't even taste like pork. I couldn't take a second bite. \n33) Sticky rice with sausage \n+ well, you can't really mess up lup cheong and rice \n37) Roast chicken wings\n-SO DISGUSTING. a wet, soy sauce drenched mess. \n\nI bought a mango pudding, but as I opened up the container, I saw mold growing. YUCK. MOLD. Partake of the containers in the fridge at your own risk. I would suggest putting dates on there. \n\nI really love banh mi so I decided to give them another try. Today I got \n\n4) Roast pork sandwich \n-Carrots were too thin\n-Cucumber was too thick \n-Meat was too thick and over salted\n+Bread was good \n\nAll in all, THIS PLACE WAS GROSS and had really crappy viet food. Very poor execution. \n\nIf you're looking for banh mi, go to Dinosaurs on Market St. Read the reviews, look at the pictures, and please raise your standards.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Did this place change of ownership? I swear that it used to be much better before. Today I ordered a grilled pork sandwich. First of all, the bread tasted stale. It no longer has that nice crunch but rather, it was dense and not \"springy\" at all.  The grilled pork was dry and tough. It was nicely marinated but I got very thirsty after eating it. Overall it was very disappointing. This was my favourite place and default go-to place to Vietnamese sandwiches. But now I really have to reconsider my choice. Too bad!", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "By far the most delicious banh mi I had. Live the pork, love the chicken. They put everything in it tho, not sparing any part of the meat. So chicken has skin and pork has a lot of fat, but it's a flavor burst. \nChicken curry with bread is delicious too. Burst of flavors. Haven't tried any of there teas or deserts, but worth a try I'm sure.", "author": "Nayiri H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "Que Huong seemingly is a take out counter with seating by the side.\n\neats: combo banh mi (4)\n-baguette is heated but all the meats within are cold\n--nothing tasty, bland, not a good value\n2.5 stars\n\ncrumbs;\n-everyone speaks chinese here, there goes the neighbor......\n-quick service, pay when served.\n-line forms instantly near 12.\n-", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Found this neighborhood gem before heading over to Outside Lands. Most of the banh mi sandwiches were about $4-4.50. Wow! That's super cheap! I loved the BBQ pork I ordered; it was so tender, juicy, and every bite felt like a love affair with that soft french roll. I don't think I've encountered another Vietnamese deli that I've enjoyed more than this one - this includes the Nom Nom truck.\n\nI didn't order any, but the spring and egg rolls seemed pricey at 2 for $5. Maybe they're huge? (That's what she said....)\n\nBe very specific about your condiments, you might have to repeat yourself a few times. My friend asked for extra spicy but only got a mild sandwich while I had to remind them 4 times not to put mayo on mine.\n\nNext time I need a quick meal or to pack a sandwich for Golden Gate Park, I'll be heading back here. Oh look, Now & Zen is just around the corner :)", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "UPDATING REVIEW TO NEW BUSINESS PAGE:\n\nthey make the BEST vietnamese sandwich. i always order the banh mi dac biet (combination) with extra pate. $4 is kind of expensive for a vietnamese sandwhich but when it tastes this good its worth it. i always order the banh cuon cha lua as well. my friends in fairfield love this place. they always ask me to bring them home some sandwiches when i go to sf.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "0 stars!! Place went downhill!! The bread was not even crunchy and they barely put any thing in the sandwich!! Sorry but you guys were better a couple years ago!!", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "You do not need to go to the tenderloin or san jose for great viet sandwiches. Love it!", "author": "amanda t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Imperial rolls and meatball sandwich is always my favorite from this place and I will order the same things every time if I go there.", "author": "Kitty L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Whenever I'm craving a vietnamese sandwich Que Huong is my go to! I always order the chicken sandwich and it never fails to satisfy my craving! (If you prefer a spicy sandwich you'll have to ask them to add the jalapeños, but they are free!) Parking is a little harder to find because it's on irving, but visiting Que Huong is definitely worth it! It's affordable authentic vietnamese food!", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "They raised their prices in May by $0.50 for each sandwich, but I still come, primarily for the convenience. I also think they do a killer job with their pate and their fried spring rolls are done correctly using rice paper as opposed to egg roll wrapping.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-21", "description": "One of the best Vietnamese sandwich shops in the city. $4.80 for most of their sandwiches isn't too bad, but the prices have gone up over the last couple of years. Definitely still going back here even with the price increases. Love getting the Fancy pork with pate sandwich. This place can get pretty busy and parking is pretty hard, but worth it for a good meal.", "author": "Courtney D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "This is the new and improved Irving Cafe & Deli (literally moved right next door). Obviously parking is still horrendous but now the space is larger and more clean. There is a counter to sit against the window so you can people watch and there are two tables inside as well. \n\nMy order:\nBanh Mi Thit Nuong: Charbroiled BBQ Pork Sandwich\nNuoc mia (fresh sugarcane juice)\nChe Sam Bo Luong: Seaweed, logan and dried dates \n\nCrunchy bread and tender meat. Nuoc mia definitely satisfied my craving for it. Wished the che had white fungus in it but still good. \n\nCash only", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Small little shack, but they make the food in front of you. Had a combination pork sandwich and BBQ pork sandwich. Think the BBQ pork one was better but both are good and for a decent price ($5 each)", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "Best place in the sunset to satisfy those banh mi and cha gio cravings. i know you get them too!\n\nI stick to my usuals: #1 pork combo ($4) and imperial rolls (3 rolls for $5). They have indoor seating now so you can enjoy your meal at the bar tables.  \n\nPrice is reasonable, service is quick, and the food never fails you. What more can you ask for?", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-23", "description": "Update: ordered again from them. Garlic, garlic, garlic OVERKILL. Breathing it out after eating here. Don't go for any job interviews or dates the day after eating here, that's for sure.\n\n---////Got lunch delivery for the first time. Delivery fee was $3. Driver was very nice. However, I specifically requested jalapeno peppers be added to the sandwiches. They did not add them. Boo. Also, beware, their food is reallllllly garlicky. Both the noodle dish and sandwich that I ate was laden with garlic. Wow, good thing I don't have a date tonight. I am breathing out garlic. The taro tapioca dessert I got was good though. I think I will just stick to their desserts.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "My go to place for banh mi now!\n\nI got the combination pork sandwich and oh my gosh... I've never had a banh mi that was sooo good. However, I'm usually used to the mediocre ones from Chinatown. The bread is not too chewy nor dry. It's not so thick that you can barely get your mouth around it either. It has the right amount of crisp and crunch on the outside when you first bite into your sandwich. It's also soft on the inside because they spread the pate and mayonnaise all the way to the edges of the bread and drizzle soy sauce on top. They also give you just the right amount of meat where you're not left with just veggies at the end. It's quite affordable; $4 plus tax for one sandwich.\n\nKeep in mind:\n1.) Jalapeños are free with your sandwich upon request\n2.) CASH ONLY!!!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-07", "description": "I was in the area grocery shopping at 22nd & Irving for my fresh vegetables and fruits for the week and decided to pick up some banh mi's for the family.  Bad decision!  This was probably the worst banh mi I've ever had.  The pork slices in my sandwich were so fatty and looked disgusting.  \n\nNot the best quality meat I've seen.  Even if they trimmed the fat off, the meat would still taste bad.  When I got home, I pulled the sandwich apart, placed the best meat sections back in the sandwich (about 1/8 of the meat that was in the sandwich). I even had to add my own jalepeno (none was in the sandwich), cilantro and pickled veggies when I got home, because the sandwich was skimping.  After all this, the sandwich tasted much better (except for the  hard pieces of meat I bit into, which I had to pull out - I think the tough meat was from them microwaving the meat before they put it in the sandwich).  \n\nI grew up on Vietnamese food, been to Vietnam and enjoyed banh mi there.  I didn't enjoy this one at all.", "author": "michele g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Got the pulled pork sandwich. Fast and efficient service!  The sand which was a bit dry but tasted pretty good!!!", "author": "Kristine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "3,5 Stars, but I'm feeling generous.\nPro:\nRecommended \nNo.1 - Combo Pork\nNo.13 - BBQ Pork\n- Affordable sandwich\n\nCons:\n- They can improved a bit about their food sanitation. I found \"something\" that look like a part of scrubbing sponge near my sandwich. Doesn't matter, just chucked that portion off.\n- The spring roll is fresh, but doesn't come with shredded pork (disappointing) and the dipping sauce can improve.", "author": "Icey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "I have been going to this place for almost a decade. \nVietnamese sandwich and ice coffee is my favorite.", "author": "Mikey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Irving Cafe is now down a few buildings and in a bigger location but I felt like it was an awkward set up / space. The food is still the same and still good. Kind of pricey, did the prices go up or is it just me? I spent $10 on a sandwich and egg rolls. Food is consistent but if the prices keep going up, I'll have to find another spot to get viet sandwiches.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "I had just left Children's Playground with my kiddo when the hunger pangs struck.  Since we were driving by Irving, I decided to stop off and get a sandwich to eat.  After circling for some parking, I got a spot. \nThis place is small so it's more of a take-out spot.  However, there are a few bar stools for one to sit at.  The ladies behind the counter were nice and helpful.  Their menu is quite extensive and had various vegetarian options.  \nTheir sandwiches were delicious!  I also love their vietnamese desserts from the fridge.  \nDespite the parking situation (it is Irving after all), this place is awesome!", "author": "Serena L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "Stopped by Que Huong for a bbq chicken banh mi sandwich over the weekend. The space itself is clean and there are some places to sit if you're stopping for a quick bite. The sandwich came out to $4.90. The bread came warm and crunchy. They have a pretty extensive vietnamese menu which included a lot of sandwiches and snacks all around $5.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-08", "description": "I have been there several times for their sandwiches and a drink with sweet beans. I think the foods are awesome. But, I give three stars for their service. I would go there more often if they are more friendly. No greeting, no smiles, no thank yous. I feel a bit uncomfortable going  there. Perhaps lot of Vietnamese people are that way?", "author": "Mary M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-02", "description": "We stumbled into Que Huong on a Saturday around 9:30a.m. kind of by accident.  We were driving thru SF on our way out of town and I was looking for places that sold bubble tea (boba) that wouldn't be too far out of the way off of 19th Ave.  I looked on Yelp and found TeaWay on Irving at 21st Ave, and it was the ONLY place advertised as being open at that hour.  SO - we ventured to TeaWay only to find IT closed and the tiny deli next door open.  I peeked in, and after looking at their drink menu, I was convinced they sold boba, so we ordered a banh mi and spring rolls and I ordered the fresh watermelon with boba.  \"We don't have boba here.\"  ugh. \n\nAND they don't take plastic.  Husband had to go to Wells Fargo 2 blocks down the street.  \n\nHow was the food?  I LOVED the spring rolls.  They put BASIL in them!  Wow.  What a lovely burst of flavor and an unexpected change of pace!  The (get this) pan-fried bbq chicken banh mi was just ok.  Tell me, though... how would one define \"pan-fried bbq\"?  Is it pan fried and then put on a grill?  Or grilled THEN fried?  At any rate, for all that cooking prep, I'd expect a little more flavor.  The chicken was bland and uninteresting.\n\nThe bread was definitely on the older side.  I saw the lady pick up a roll and question if she should use it.  She shrugged her shoulders and started slicing it in half.  steeeeeRIKE.\n\nWe were able to watch them prepare their banh mi varieties for the day, so when we unwrapped our sandwich (in the car, long gone at this point), we were very disappointed to see that they did not put any pate on ours, as they had on EVERY other sandwich we watched them make.  boo.\n\nThat aside, the sandwich was difficult to eat because the cucumbers were cut so thick, as were the carrots.  And there was no extra sauce/flavor on the sandwich to make me go WOW.  I honestly don't think there was even a jalapeno!\n\nHere's what I'll say about the sandwich:  My husband and I shared HALF of the banh mi, and never went back for the rest.  It was $4.  I'm not one who enjoys saying \"Ah, just toss it in the trash! It was only $4!\" because I really hate wasting food.  But - it was only $4, and it was worth about $2.\n\nIf you read other reviews about this place and their lackluster customer service, we experienced THE exact same thing.  Don't expect niceties.  Don't expect idle conversation while the lady makes your sandwich.  Just go in, order, pay cash and go.\n\nI am very curious to know what the deal was w/ TeaWay next door.  Incorrect business hour information on their yelp page probably...   Boba will just have to wait.", "author": "Stephanie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-01", "description": "Tried this banh mi joint since the one next door is gone? The Irving deli is gone. :( \n\nThis place is alright. Clean and bright.  $4 for a chua lua pate sandwich. Wish they gave you more pickled daikon and carrots.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "I really like their Banh Mi Dac Biet (number 1 on the menu).\n\nThey have limited seating if you want to sit and grab a bite to eat.", "author": "Lily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "I've been here several times for lunch with mixed feelings.  Every time I come, I leave regretting it because of the horrible service.  I often walk into the shop and stand right in front of the lady at the counter, yet it takes forever for them to acknowledge me.  And when they do, it doesn't even seem like they're paying attention or want your business.  \n\nHowever they are quick in putting the sandwiches together, and despite leaving in a bad mood, I take a bite into the sandwich and I remember why I keep going back.  The meat is flavorful and the bread is AMAZING.  It's nice and toasty on the outside and soft on the inside, just the way I like it.\n\nOverall, it's a good place for a quick, relatively cheap lunch but minus 1 star for the service.  To be fair, this does seem to be a place catering to the Asian population, so i guess the service is standard.", "author": "C L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "I come here whenever I am craving their Vietnamese Sandwiches.  My favorite here is their combination pork and whenever I am in the mood, I get the shrimp spring rolls or their cold noodles with bbq pork.  The bread here is always toasted to a great consistency with it being crispy on the outside and soft in the inside.  Meat is always juicy and great with flavor.  They have me coming back whenever I am craving something quick and easy.  You can always call ahead of time so that you don't have to wait to have your order made!  The do have a small dining area off to the side if you want to sit down and eat.  I usually just order it to go.", "author": "Teresa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "*Note* This is still Irving Cafe & Deli! They just changed the name and moved literally right next door to their old location.\n\nThey should probably put a sign up, because I sadly assumed that my favorite banh mi spot was closed forever until I started walking down the street and noticed their newer and more spacious location. Their sandwiches are so good and cheap! I've also tried a chicken salad and it's basically banh mi in salad form and I liked that too! Best place for Vietnamese sandwiches. At least in this part of the city!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "Can't wrong with #1 combination pork banh mi! Banh mi is my default when I have no idea what I want to eat for lunch on a late afternoon Sunday. \n\nThe bread is perfectly toasted. However, there is one problem I have with eating these sandwiches - I always end up scraping the inside top of my mouth. I hope I'm not the only one that has this problem. \n\nSince this place is located on Irving street. Finding parking is extremely difficult.", "author": "Andrew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-16", "description": "Banh mi joints are always nice--cheap and filling sandwiches for when you're in a rush. While they have more than just banh mi, I didn't try anything else this time. That said, for less than $5 that sandwich was stuffed and delicious. The bread was layered with liver, and it was filled with a generous serving of meat and veggies, as well as the supplemental flavors of cilantro and jalepeno. I look forward to trying them again another time for sure (maybe even their drinks--cane juice!).", "author": "Tony D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "First!!!!\nThey actually moved from next door and used to be the Irving cafe and deli. They have really good sandwiches and our favorite BBQ chicken banh mi. And its a great price too. The chicken is very tasty and they always make the bread nice and crispy.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "This is a five star review for the bahn mi sandwiches.  The best.  They get the bread right, and anil the classics every time.  Roast pork my Favoite.  Space is small, but well kept, some counter seating, but most business is to go.  Ladies behind counter are the best.", "author": "Darin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-31", "description": "We craved banh cuon so the bestie and I drove out to Irving to try this new place out. We both ordered the banh cuon and the banh beo. Never have I spent $8-9 for either dish TO-GO before... So it should have been amazing right? Nope! We were underwhelmed. It did not taste fresh and the nuoc mam sauce was all wrong... Just salty. The veggies were cut all wrong and lazily. Also, while waiting for our order, I noticed some type of noodle (banh uot?) was being microwaved to order for another customer. Another no-no. Will not be returning.", "author": "Neeners H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "This spot is the same as Irving Café and Deli just moved next door (as the other reviews pointed out). Out of the top rated Vietnamese sandwich spots in the city (such as Dinosaur or Saigon Sandwiches) I believe this one is the best. \n\nAll their meats are really tasty and juicy and their bread is delicious with a great chewy and aromatic flavor. However, sometimes the quality of the sandwich depends on the person making it. Sometimes the meat can be dry (not sure why) and not enough spread is used. But that is a rare occasion. \n\nWhile the prices have gone up 50¢ in the past year or so it's still affordable and with the new space they have more seating.", "author": "Jack S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-25", "description": "Sorry to say that this is not the same place that it was before they moved into their renovated location. \n\nPrices are up a bit and that would be fine with me, if the quality were the same. \n\nThe bread seems different - not as good.  They didn't heat my bread like they use to - was I supposed to ask?  And, there was no sauce or spread on my sandwich.  Again, was I supposed to ask? \n\nNothing special anymore.  Probably won't be back...", "author": "Steve L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "I ordered the bbq chicken banh mi with extra pate and jalapenos ... OH MY GOSH! Just typing this review is making me drool; I think I might have to go get it after work this evening. Yums......", "author": "V M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "We went to Que Huong Vietnamese Deli last weekend for lunch. I ordered the tofu veggie sandwich and my wife ordered the chicken sandwich. Both were pretty big and tasted very good! We also ordered sticky rice with mango, but it was only okay.\n\nThe sandwiches were very good and the prices were great! I would definitely return!\n\nOverall grade:  A", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "This is one of the best banh mi shops in San Francisco! My personal favorite orders are the #1 combination pork, bbq-pork, and pan-fried bbq chicken sandwiches. What sets this place apart from your usual Vietnamese sandwich joint is how they handle the bread and the meat. The bread is always toasted to a perfect crisp on the outside and chewy in the middle! The meat, especially the bbq chicken, is surprisingly tender, juicy, and sweet. The sandwiches are perfect for lunch since the size is not too big or too small. These little details definitely separate this shop from a place like Lee's sandwiches and make the extra dollar or two worth the admission price. \n\nIf your looking for something more filling, you can't go wrong with the bbq pork or pan fried bbq-chicken vermicelli orders with imperial rolls. Its a tad more expensive (about $7), but that's the usual price for vermicelli. The fish sauce is totally different from other Vietnamese restaurants in that its sweeter and has a kick that compliments the meats and noodles deliciously well! Of course this is Irving so bad parking is to be expected...\n\nUseful Tip: You can order through the phone and pick up from there if you are in a hurry. Oh yeah, ONLY CASH.", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "I used to love this place. I would even drive out for it but it's been a hit or miss lately. I always order the BBQ pork sandwich because it is one of the best in sf in my opinion. However, it's like they got lazy and left all the excess fat on the pork. Majority of my sandwich was pork fat. I had to pretty much dissect my sandwich to remove all the fat from it. Sigh after that the sandwich was pretty flat. Better luck next time..", "author": "Cori N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-08", "description": "I'm from the east bay and we have plenty of better places to go get a Vietnamese sandwich... The sandwiches here are small , over priced, to hard , not that great .. I guess if you want a quick simple sandwich this is the spot", "author": "Amai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "FANTASTIC health ratings!!!\n\nThe pork in the BBQ pork sandwich is quite fatty. I enjoy this decadent sandwich, but if you prefer lean meat, you may wish to try the Roast Pork sandwich, which seems to be slices of pork shoulder or pork loin with a sprinkling of fried garlic (yum).\n\nI always order without mayo.\n\nThe baguette is nice and crunchy on the outside.\n\nHard to beat the price (lunch for $5). Cash only.", "author": "I Like T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-03", "description": "Love this place... Great lunch spot, fast and yummy sandwiches for awesome price!  Cash only just like most places in the city.", "author": "Yas J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-16", "description": "Maybe it's because we ordered online, but this goes down as one of the worst Bahn Mi I've had. I had asked for it to be hot and spicy. What I received was cold and mayo laden. There was a paltry amount of ground pork a slab of pate and the bread was stale. To make matters worse, I think I got food poisoning. I would never return.", "author": "Randall K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Quick, cheap, fresh, and delicious vietnamese sandwiches. I normally am not a Banh Mi guy, but after my girlfriend recommended this place I have to admit, after trying this place out, I've started to have cravings for it. This is a great place to stop by and grab something light, yet filling to go. I'd recommend the #1 and #4 sandwiches. Oh, and also remember to ask for jalapenos when you order!", "author": "Jefferson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-29", "description": "Wow. The place is small--maybe new? The ingredients for the sandwiches and rolls are fresh and delicious. The sticky rice is served hot and fresh too. Not much more to say than that! Can't wait to try the other dishes.", "author": "Ali A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "This place will always be close to my heart.  I consider it to be the undisputed champion of Vietnamese sandwiches in the Outer Sunset.  Que Huong used to be even more hole in the wall than it is now, operating a few stores down from their current location in what could only be described as a shoebox.  However in a shocking twist of fate they were evicted, leading to the scariest 30 seconds of my life when one Saturday morning, as I approached my favorite sandwich spot eager to taste that sweet Vietnamese nectar on my tongue, I placed my hand on the usually wide-open door and found it to be locked and bolted! Empty, cold, cleaned-out. I hadn't even been given a chance to say goodbye.  My one true love was dead.  I almost flung myself into traffic right then and there.  But luckily I didn't because miraculously they rented out a new location on the same block and were open for business that day!!  I saw to my delighted surprise that their new place was even roomier (now with tables for customers!), a testament to their success.  I ordered my sub and let the juices run down my chin.  Chewing and weeping, I thanked the sandwich lady and skipped down the middle of the street as a double rainbow lit up the sky.  I tell you, unidentifiable mechanically-separated mystery pork has never tasted as good as it did that day.\n\nThe cuisine at Que Huong is hand-crafted by two sweaty women who work the counter without a break from dawn to dusk.  They are ultra-efficient sandwich-making machines!  Each sandwich has it's own magic flavor, but all come on a freshly-toasted french baguette.  Que Huong's baguettes are crunchier than Eternal Springs', and a bit smaller.  However the sandwiches are always packed with meat.  Each sandwich also comes with a cucumber spear and shredded carrots soaked in what must be crack cocaine because I am so fucking addicted to it.  In fact I always order extra veggies on my sandwich at Que Huong, guaranteeing that I will get not one but two cucumber spears and a heaping spoonful of their pickled carrots in secret yum sauce. Warning: I think this place also uses straight up butter as a spread.  So if you're looking to lose weight, stop reading now.\n\nSo you're at Que Huong and you're ready to go to flavor country?  Let's discuss some options. The king of all Viet subs is the pork combo, and QH's combo sub is OF THE GODS.  Layer upon layer of thick juicy salty meat.  I can't tell you what kind of pork they use, because like all Vietnamese sandwich meat it is largely unidentifiable. I CAN tell you however that it is damn yummy.  Mixed into the combo you may find some kind of pork cake, as well as some kind of pork with a perfect ring of fat around it, and of course the aptly-named \"fancy pork\". Together this blend is a cacophony of flavor, very meaty.  After all these years, the pork combo is still my favorite, my go-to.  Looking to branch out a bit?  Try option two: the pate sandwich.  This is not for beginners.  It is only (ready for this?) pate and veggies (and hella butter).  If you've never tried Vietnamese pate, I recommend ordering the combo sub, then take your finger and rub along the inside of the bread (just shove it right into your sandwich... that's right, just like that, that's good).  See that dark paste all over your finger, lick it.  Your welcome.  Now imagine a sandwich FILLED with that shit.  I love that sandwich, like sexually.  Warning, if you eat the entire thing in one sitting you may feel icky (that's a lot of pate you're eating).  Another option (here's a curveball): the vegetarian sandwich.  I know what you're thinking: \"Why would I ever eat a vegetarian sandwich?? What do you think I am, some sort of vegan hippie scum???\"  No no, calm down, it's not like that.  This sandwich is still super unhealthy so we're good!  The veggies are dripping in grease (despite the prominently displayed \"No Grease\" sign hanging behind the counter).  The sandwich, though lacking pate, is bursting forth with hot salty mushrooms, squashes, other stuff, fried tofu, and all the other accoutrements.  Trust me, it's legit.  A great alternative if you're not feeling pork but you still want to eat a pound of butter.\n\nThere are of course other great things on the menu.  All the pork dishes (with the exception of shredded pork) are absolutely delectable.  Try the roast pork, bbq chicken, anything really it's all good.  Finish it off by popping next door to Tea Way or Quickly for some boba (Quickly is excellent as you know, but Tea Way lets you scoop your own boba!).  Overall I give the Sunset Viet sub experience a 4.5 out of 5. If it wasn't for the questionable quality of the meat, this place would be a perfect 5!", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-08", "description": "Haven't been here since high school and now the tiny shop is twice the size as it use to be. Wanted a banh mi and this was the only spot in the area that I knew had good bread. Other places that I've tried around the neighborhood had bread so hard it'd stab my gums. I ordered a bbq pork and chicken sandwich to split with my sister and a combo pork and nem chua for the bf. The bbq chicken and bbq pork were mediocre. I wish they'd trim off the excess pork fat. My bf wasn't so fond of the place either. The nem chua was not worth it's price. Our total came out to 22$ for 3 sandwiches, the nem chua, and a grass jelly drink. The sandwiches were 4$ each so I'm assuming the nem chua was 9$ for ten pieces.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-17", "description": "As you can see from my other reviews I am not a critical person and usually don't bother writing bad reviews. The sandwiches were ok certainly not as good as http://www.yelp.com/biz/dinosaurs-2-san-francisco which is close enough that I would certainly go there instead.\n    I would have given then 3 stars but the service was horrible. A large lady behind the counter was really rude to me. After I ordered I asked if I could pay now and she told me \"you have to wait\" even though other people were paying after they ordered, which is pretty standard as I am sure you know. I specifically asked for jalapenos on our sandwiches which she forgot to tell the person making the sandwich. I said \"did you put the jalapenos on and she rolled her eyes\" and \"said can  put them on the side\" I said \"no, I don't like to waste plastic and I asked you to pu them on before\" the person making the sandwhich said the \"the sandwiches are already made\" \" I repeated \"I asked for the jalapenos when I ordered\" then they sighed and put them on. Is it really that hard not to be an asshole when a restaurant has just opened and making first impressions. Needless to say I won't be giving them my business.", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-03", "description": "I used to really like the sandwiches here until I discovered some of the sandwich shops in the Tenderloin.  Now I only get the banh uot and occasionally a taro sago.  The sandwiches are still good, but not as good as the ones in the Tenderloin.  I personally think that they don't put enough veggies.  A viet sandwich is all about the pickled veggies, and there is barely any in there; many 20 strands of carrots at most.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "I love the banh mi here. Crisp bread, fresh, hot ingredients, a perfect cucumber and sprig of cilantro. It's fantastic, fast, and reasonably priced. My only complaint is that this spot isn't open more often.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "When it was named Irving Cafe and Deli, the bread was thinner and crispier. Did they change the bread? The french baguette is really chewy now. My jaw still hurts from chewing on it. I've been here for years. The #1 Banh Mi Dac Biet (Combination) is now $5, still cheaper than Dinosaurs. Their Vietnamese coffee is good.It's still cash only. Never tried their desserts, so I can't comment on it.", "author": "bob k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "i love their sandwiches. they have raised prices (now $5), so a bit pricy for the sandwiches.  i gave 4 stars because if the price.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "#52 Banh Cuon - steamed rice rolls with fancy pork, it's the best ever! I don't get why payment isn't taken right after ordering.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "I've been going to this place since they were at a different location a couple of stores down. I must say they have definitely been making their sandwiches smaller by the year. But that is not why I'm giving them a 2 star rating. I got the BBQ pork sandwich. I like to have meat on my sandwich while I eat it. I had to take off 60% of the \"meat\" on it because most of it was either slimy white pork fat or impossible-to-chew cartilage that I was not about to try and swallow. I was pissed. It took me like 5 minutes to pick out all the lean parts of the pork.. Never going there again. $5 for 4 inches of bread, some carrot strings and 2 bites of edible meat? I'll pass.", "author": "Antonio J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Your authentic Viet subs kick ass!  I enjoy stopping by your shop from from time to time.  There's always customers waiting in line.  The shop is clean.  The staffs are nice, and they offer great services.  Thanks!", "author": "Dan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "Nasty sandwich. Nasty. Nasty. Nasty. Don't like to give a bad review but the sandwich here is nasty nasty nasty. One damn nasty sandwich. Nasty!!!", "author": "JT T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "My favorite banh mi place in the city! Super easy, reliable, and cheap!", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "As other Yelpers mentioned its Irving Cafe and Deli that was next door. Check out those yelp reviews as the food is a thumbs up! I get my Vietnamese sando fix here, chicken salad is bomb, and the rice roll things are awesome!", "author": "Julie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Best Vietnamese sandwich in town! We come here pretty often and they are always consistent with their food. The bread is crunchy on the outside and soft and warm on the inside. I've  also ordered the imperial rolls before and these were delicious. There are always other people waiting and ordering food but the women make a point of getting orders to their customers quickly.", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "What is life? After you try this place, there's no going back to regular sandwiches. The sandwiches are made by the gods themselves. Four dollars for pure bliss; now that's what I would call a good deal. It's really speedy, and you can see the ladies making it right in front of you (so you can see what they put into your sandwich). \nLet's start off with the banh mi. The best one that everyone gets is the BBQ pork, which is one of the best foods I'd ever had (basically, it's now a staple in my fridge). The meat is super seasoned and tender, and the bread is crisp, yet oh-so-soft on the inside, basically a bite of heaven. The veggies they put inside taste super fresh and the sauce they put over the sandwich is really tasty. I like to add pate for $0.50, because it takes the sandwich to a whole different level, and it mixes nicely with the juices of the pork. \nAnother great dish is the steamed rice noodles with BBQ chicken. Of course there is pork, too, but I prefer having a variety of meats, once in a while. I really enjoy this dish because it's piping hot when you get it and the sauce is really something- it's not like other sauces, a little bit sweeter and milder. When you mix the veggies, noodles, and sauce together, the flavors work together in perfect harmony. Oh my god. So good. \nThis is definitely the place to go for deli-style Vietnamese food. It's cheap, fast, and purely delicious.", "author": "Juli E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "I love the banh mi here. I usually get the combo pork or meatball or the cooked veggie. Recently, I noticed that they have one with a fried egg. I haven't tried it yet, but it looks really good.", "author": "Emily H."}
