{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "This cafe holds a special place in my heart because of what it represented to me not too long ago: a place to escape the hellish marriage I found myself in a little over a decade back. I used to go there and get chocolate skinny cow shakes and read a book, or sometimes just get a coffee and people watch on Polk. Sadly, the skinny cow shakes are long gone and the menu has become more vegetarian and environmentally friendly but that's San Francisco for you. Still, the interior is a comfortable space and it IS nice that tasty sandwiches can be purchased now.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "The food here is very good. The staff is friendly. The location is great. The space itself is excellent, with plenty of seating and electrical outlets. \n\nHowever, I could not get the wifi to work. I struggled with it for an hour, and the staff was unable to help me. My laptop generally has no problems connecting anywhere else, and I was able to connect through my phone's data connection, although that is a less than optimal solution. Having come here specifically to get some work done, the non-functional wifi was a dealbreaker. \n\nIt appears that I was the only one having problems with the wifi, so it is possible that whatever the issue is it was unique to me. At other cafes in the past when I had problems the barista offered to reset the router, which usually fixed things.", "author": "John C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-13", "description": "Watch your belongings closely here! Tuesday July 10 at 4 PM my wallet was stolen from my backpack that was hung on the back of my chair. I was sitting at the bar seating near the front counter. The guy sitting behind me quickly unzipped and reached in the backpack. I realized what had happened when I got up to leave and noticed my backpack was wide open and my wallet was gone.\n\nYes, I realize I should have been more aware (I was focused on my computer). The management and employees there also need to be more aware and kick out the homeless/junkies/pick-pockets that just wander in and loiter around the cafe unchecked and free to steal from the customers. They really need to hire a security guard.\n\nDescription of the thief is: African American Male, 45 to 55 Years Old, 6ft + Tall, Baseball Cap, Oversized Sport Coat and Khaki Baggy Pants.\n\nThe cafe manager said the security video camera captured the moment of the theft, but he couldn't see the guy's face clearly. I remember him sitting behind me and I thought he looked homeless, but also thought he was harmless. Man was I wrong. He's likely a pro street-thief.\n\nSit here at your own risk. On second thought, just go somewhere else. This cafe is definitely Not Safe and Sketchy AF!", "author": "Dan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "This place use to be great. Im giving it this review because one of the workers had the nerve to tell me that seating outdoors is for customers only. I was a customer there,meanwhile some guy that is clearly not a customer just sat down to use the WiFi, the worker ignores him. I ask the worker why stop at me? I told him that was fuc%$d up and he has the nerve to get offended. So for that reason I give it a crappy review!", "author": "Shaun Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-25", "description": "Was denied service at 9:30pm, listed closing time is 11pm. This was a frequent stop-off during work for me but not anytime soon.", "author": "Sean E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "We were looking for wifi and found this place. The sandwich and hot chocolate are surprisingly good. Not many people here in the evening and the space is perfect for working or studying.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "There's some vibe on this place that is not doing it for me. This place is part of my neighborhood they try so many different thing to attract people but is usually empty with the exemption on weekends when is packed of homeless. The staff is not doing it for me at all yes they're friendly but something about them is just not right. Today was the 3rd time on 3 years that I stopped here I gave it a last chance and again, something it's just not worth it about Quetzal... let me not forget that Quetzal it's Mexican mystical animal and this place has nothing Mexican at all... don't waste your time here.", "author": "Lola P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "This place is awesome! My friend and I needed a chill coffee shop with free WiFi for an afternoon of cranking work out on our laptops. We had great natural sunlight, a huge table, and friendly staff taking care of us. We got some chai lattes then transitioned to some wine as work began to get the best of us. Super chill place to work/drink/eat alone or with friends, SF needs more like it!!", "author": "johnna m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "If you ever find yourself taking a loved one to the Eye Surgery Center on Post Street and are need of drink and snack, Quetzal Cafe is down the block on Polk St. It's safe 10:00am. People here are young and old working on their computers and talking on their phone as well as visiting! The toasted sesame bagel with lox and cream cheese was delicious and soy chai was enjoyable!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Came here for the first time for lunch. Ordered a burrito for here. Sat and waited for my food. My lunch hr was up so I went up to ask for my food to go instead and they were confused. Not a good first impression here.", "author": "Zenas S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "There a no computers here. False advertising. They said for 2 years there have been no computers. Disappointed they still advertise as a place where you could come to use the Internet and display pictures of computers on this yelp page.", "author": "Joseph W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-13", "description": "Weak coffee, weak service, overpriced food. There are better businesses to support in the neighborhood. Even the Peet's up the street is a better place", "author": "Peter J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "If variety is the spice of life, Quetzal Internet Cafe is a spicy place.  Breakfast, bagels, lattes, smoothies, crepes, and so on.  Beer, wine and mimosas for the afternoon.  Happy hour prices!\nI had a latte and a toasted bagel with cream cheese that were reasonably priced, of solid quality and served quickly.\n\nNow the decor is not spicy.  If you are coming to get work done and/or hook up to the net, this is your man.  If you are looking for art on the walls, no.  The place has the feel of a cafe bogged onto the side of the student union building at a state college.  Lots of exposed cinder block, multi-level seating with long tables to fit a crowd or to spread out. They should paint the walls with a Mayan motif to match the name.  This average Joe will be back as it serves quickly with solid food and drink.", "author": "Derald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Have tried so far only a Nutella crepe but it was well and quickly made as well as quiet delish!!! Asked for extra Nutella (you know that one time you treat your self for breakfast !) and they have accommodated the request for no addition charge. Pretty awesome!\nThe two ladies taking orders/cashier were kind, smiley and attentive. The guy whom made my crepe did a good , fast job too.\nOverall very satisfied with the experience!\nI paid 6.19 $ including taxes and tips. Nutella crepe it self is only 4.95 , differently from their neighbors usury Oh la la crepe whatever, charging almost 10 dollars for a freaking crepe! By the way are they out of their mind or whatttt???! Will just never step in there. Its really not about the $$$, I am not cheap over good food but it is a matter of principal. Cause com'on a crepe almost 10$?!? Well they can keep it. \nBut back to the Quetzal cafe'!\n Sensation My 4.95$ with extra Nutella crepe was accompanied but free fresh fruit. Yep yep! How awesome is that?!\nWill be looking forward to come back for another items. I spot veggie bagels for also 4.95 ( I think) which will come with cream cheese , fresh tomatoes,cucumber and avocado !! Yum yum, tummy fun fun\nOh and they serve organic, fair trade coffee too!!!\nPosting along my crepe pic, some menu pics as well!\nIf you haven't yet Try this place , well give it a shot. It is well deserved.", "author": "Hosna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "We found this place just walking by and decided to stop and I'm glad we did . They have very good,  my husband and I got sandwiches and they were really good.  They have free WiFi and serve alcohol.  We liked it so much we ate there twice.  I would definitely recommend it  !", "author": "Tanisha H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-19", "description": "Ordered UberEats and it was awful!!! All of my food  and drinks had been tampered with. Matcha latte came half empty, smoothies looked like someone took some gulps out of it, and at that point, I didn't trust any of the food to even touch it. Please next time properly seal the food and drinks especially with shady UberEats drivers who always arrive high and do not take proper care of the food and drinks during delivery.", "author": "Holly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-14", "description": "This place is really nice on the inside. It's clean, spacious and has that modern hostel feel. \nThe woman at the register was really friendly which is always a plus. \n\nThey offer wifi and have places to charge your computer, and they also offer Ethernet cables which I thought was really cool. \n\nI ordered a veggie melt from them which was pretty good, but also really hard to mess up. \n\nI also ordered an iced \"matcha\" latte. I put it in quotes because it was everything you don't want your matcha latte to be. \n\nShe used either half and half or heavy cream. Which is fine, but dear god I was hoping there'd be matcha in it. The faint matcha flavor was so nonexistent I was shocked it even had matcha in it. \nIt literally felt like I was drinking iced half and half. Never again. \n\nAside from the matcha latte this place is a good place to work and have a light lunch.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-18", "description": "Was looking for a spot to grab a light lunch and some coffee with a friend. Found this spot and it was pretty good. \nI got the chicken caesar salad sandwich and my friend got the turkey club. (Each were about $8-9)\nChicken sandwich was good-although they put too much chicken. Was hard to even bite the sandwich as it was so tall and big. Once you take some of the chicken out, it's not a bad sandwich. The chicken they use is some precut/pre cooked chicken. Probably the frozen stuff. Little bland. Nothing gourmet about it. However, they use great focaccia bread! Super yummy bread and a nice little caesar dressing on it to make it flavorful. \n\nCan't comment on the turkey club that my friend got since I didn't try it. She liked it and it looked like an average turkey sandwich you would order. \n\nThe place is nice and big and we didn't have any trouble finding seats on a rainy Sunday afternoon. They have a ton of options for food and lots of coffee and tea choices too!\n\nNice spot to stop in at, grab a snack, drink and work if you need-seems like everyone was on a laptop.", "author": "Milena R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-03", "description": "They take forever to get you your food. Simple items take forever. So if you go in to get something easy prepare for a long wait.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "Quetzal's kind of a weird spot, with some interesting clientele... but holy balls do they have fast wifi. Plus their coffee's decent and they're open late.\n\nI wouldn't go out of my way to cowork here, but if you're in the neighborhood it's a good place to get things done.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-08", "description": "We went here for dinner. Ordered the rice crispy treat and brownie. The presentation was great. The wrapping was supreme. Buttt the rice crispy treat had a low m&m count. The brownie was less then moist. I decided to rate this place because they do offer internet.", "author": "Nelly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "I ordered a breakfast sandwich and large coffee.  Nice staff and quick service.  I didn't use WiFi but I saw lots of people surfing the internet.\n\nLots of seating and the area is safe even though it's near Tenderloin.", "author": "Wing W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Went here today to set up my new tablet and have a craft beer. Never did get to use the internet. They have this weird procedure where you need to text the word DESK to a number, wait for a code (which never worked), download an app called \"Vinmo\" first and \"chip in\" $3 for each hour you're on. Every coffee shop I've ever been in just get the password and you're good to go.\nOn the plus side the food looked and smelled good, lots of room, bright and airy with outdoor seating if you prefer. Glass of Sierra Nevada pale ale was $7.07. Little steep I think.", "author": "Tony F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "I was in San Francisco for the AVP tournament by the Golden Gate Bridge, and this place was an absolute find! The coffee is great, the crepes are incredible, and their breakfast sandwiches and burritos are everything you'd want on a weekend. \nAlso: They have an excellent beer selection. \nPricing is great, food is great, and more importantly, the coffee and the beer are great. \nThe interior, too, is clean, the staff nice, and the vibe wonderful.\nFive stars.\nFeel free to see more of my writing at papercourts.com.", "author": "Travis M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-04", "description": "Just got in to use the restroom. Bad to buy a bottle of water for that. The restrooms are smelling, filthy and dirty.", "author": "Yarin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Updated review. \n\nThey are so much better. Quick, precise and helpful. They seem to always be smiling and happy to help. I have never complained about the quality of food, it is all good, but the service was bad. I now have been in enough times and have had great interactions that I would recommend this place to all. \n\nGood job guys, way to step it up.", "author": "Timothy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-26", "description": "Waited 15 min to get two quesadillas.  Neither had cheese, but were very messy, cold and not tasty - as we discovered after leaving the restaurant.  Should never have tipped!  We threw away the food.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-05", "description": "I'm only going to address the cafe as I experience it and remember it.  It used to be classier.  In the past, customers had a chance at real dining.  A waiter came to your table to serve water, gave you a menu, and took your order.  Today, the service is cafeteria style.  You stand in line and place your order with a cashier (if he or she is paying you any attention; otherwise, you have to call the cashier to attention or wait).  A service boy brings you your order and quickly disappears.  Receiving your order does not take long.  \n\nThe seating arrangement in the cafe is lousy.  Sunshine and its heat really burn up the place, keeping it overly warm when it's not winter, and the shades and windows look like they once belonged to Ms. Haversham's home from Charles Dickens's \"Great Expectations\" -- old, worn, and in disrepair, and the cement floors and metallic walkways turn the place into a noisy echo chamber.  \n\nWhy does a customer have to hear the prolonged, loud stomping of feet when a man or woman exits the bathroom two tiers up and walks all the way down the metal walkway and out the door?  \n\nIn the back area of this large restaurant, laptop-using students or computer nerds who have no intention of making their stay brief occupy the most comfortable and shaded spots available.  The rest of the seating area in the back is ablaze in bright sunlight with excessive heat such that even if you manage to endure the waiting period seated here waiting for your order, you will have to listen to the incessant chatter and monologizing of at least one or two of San Francisco's priceless, mental hospital escapees who also have no intention of making their stay brief.  Listening to whatever others cloistered in the back chatter loudly on their cell phones is no better treat.\n\nThe men's bathroom looks like a smudgy highway restroom at any anonymous gas station.  It used to be only customers used these facilities -- if the cashier gave you a key.  Today anybody can walk in and out -- without even being a customer, and that's the reason for the dark and smudgy way it looks.\n\nThe middle area where seating is close to the food bar so you can see the service boy exiting the kitchen with your order is often crowded as well, but it is an area that welcomes the less talkative and noisy.  There are holes in the long dining tables where your Internet connection goes.  Without a computer, you feel like you're just dining in a place that's like a garage that makes certain technicians happy to be there when they're there, but makes no sense to anyone else.  The holes don't have covers.  I guess the owner stopped replacing the stolen ones.\n\nLastly, there's the music that comes over the intercom.  The restaurant goes out of its way to appeal to young people, youth who view themselves as hip, as cool.  I listened to so much music from the Sixties on my first visit there that the songs forced me to relive my entire late adolescence and early twenties -- from Cat Stevens to Mick Jagger over and over again.  The second time I dined at Quetzal the music was of the type called world music with some sort of jazz-fusion spin to it.  Again, because the restaurant is an echo chamber, even low volume music makes you feel you're inside a large stadium with speakers going full blast.  \n\nIt never used to be like this.  The music used to be quieter and always tasteful and instrumental if a little boring.  You could eat in peace and be in your own world, not the world the service personnel chooses randomly for you.\n\nThe best part of Quetzal, however, is the food.  A lot of five-star reviewers speak of Quetzal's food.  I agree.  I have ordered the Cobb Salad over and over again, either to go or \"for here.\"  It is absolutely healthy and delicious and there is artistry in its design or presentation.   It makes me happy just to look at it.  Under 10 dollars, this salad is a real bargain.  (But once I order coffee and pay the tax and the tip, the meal comes to $15.  That's a bit pricey.)  And, I think, the price is definitely worth the value you get.  I've checked out all the other restaurants in the neighborhood offering large salads or the famous Cobb Salad, and nowhere are you going to find in lower or upper Polk or lower Nob Hill such abundance at so low a cost as you find at Quetzal.  That's why I keep going.  The salad is good for me, filling and delicious, and the price, considering the competition, is completely reasonable, aka a real bargain.\n\nI also recommend take-out.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "I wouldn't call this the best coffee or the nicest looking coffeeshop, but it has a good amount positives to make it a solid cafe. It has an extraordinary amount of workspace and the internet is blazing fast. Not to mention the variety of items in the menu puts it well above most minimalist cafes around the area which brings me to my next statement. As I mentioned before, I wouldn't call the \"coffee\" a masterpiece or anything nor do they have the best pastries, so don't come here if those things are important to you, come here if you have a big group, want ample space to relax, or need the connection speed for work/school. And while you're here, take advantage of the food menu as well.", "author": "Timothy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-16", "description": "Best place in the city for a cafe au le. Service of food items is slow but the coffee is worth the wait. The staff is always attentive and courteous which more than makes up for the slow food service. This is a great spot to work away from the office if you need a break or change of scenery.", "author": "Lyndsay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "This place is incredible. Great food, coffee, wifi, service and space. Stop here to eat especially for breakfast (all day) and organic coffee at fantastic prices! It's an internet café so take advantage of the strong, free wifi.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Here's what I look for in TRUE internet cafes from #1 MOST IMPORTANT TO #6 LEAST IMPORTANT:\n1. BEING ABLE TO download THE INTERNET at a high rate, continuously\n2. LOTS OF OUTLETS\n3. SPACIOUS-lots of room so you can work in a private space without bumping into others\n4. COMFORTABLE-has lots of little private tables with maybe some couches, sofas.  One thing I hate is those large rectangular sharing tables with benches where everyone is very near each other, side to side with each other\n5. LONG OPEN HOURS\n5. REST ROOMS-more than 1 or 2 stalls-Quetzal has a separation of men/women's bathrooms with at least 3 stalls for the women's bathroom(including a large stall for the handicapped)\n6. COFFEE/FOOD-lastly, decent to good food at not too high prices--they serve frittatas, english muffin breakfasts, all kinds of healthy smoothies, delicious pastries & sandwiches\n\nThere are also tables outside the cafe if you'd rather enjoy the sun.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-09", "description": "I wish I read the reviews before I came here. I had to use the restroom but I had to buy something in order to do so. Silly me, I decided to get an egg breakfast and added bacon for $2. It was disgusting. My eggs were cold, like they were made earlier, my bacon was definitely microwaved, and the hash browns seemed like mashed school tater tots. Also, the bathroom seemed really sketchy and wasn't well lit. 2 stars only because the place looks nice, there's plenty of outlets, and strong wifi.", "author": "T. O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "The food is mediocre, and the service is slow.  The whole place is poorly managed, disorganized and their employees speak English poorly.  That's probably why they got our orders--both of them--wrong.  How do you screw up an egg and cheese breakfast sandwich?  The place itself is a little weird.\n\nUPDATE:  It has been about an hour since we ate here, and I have a horrible stomach ache.  Thanks, Quetzal, for whatever rubbish you try to pass along as food.  Try getting someone with actual cooking experience and buy better quality ingredients.", "author": "Amy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-19", "description": "Finding serenity from the madness of Polk is easy at Quetzal. The free WiFi is a huge plus for those of us who enjoy people watching and surfing the internet at the same time and the drinks aren't half bad. For those of you wondering, a quetzal is the national bird of Guatemala. No, I don't see a correlation either.\n\nFirst timers might be initially confused when entering: does one sit down and establish a spot or order from the counter first? I can never decide. Judging by the other confused looks of patrons coming in, it's clear I'm not the only one. \n\nTo ensure the staff I'm not here just to leech WiFi, I order something at the counter first and then pick my spot for the next hour or three. My spot will almost always be an area that has an outlet. Thankfully, there are plenty in every direction. If you choose to sit along the back wall (facing the front), then be prepared to share outlets.\n\nWhen it comes to ordering something, I stick with drinks. Coffee / tea is available for caffeine chasers, but the smoothies keep me satisfied. A power shake with a little blackberry keeps me hydrated, even if it's not my favorite flavor in the world. In the 1st world, these are hardly problems.\n\nNot feeling like any of the above? Shoot for their beer on tap. Nothing like sucking down a frosty one during the warmer months and surfing a little internet. Oh and they have a real happy hour deal ($3 on tap!), which goes until close. \n\nThen there is the food. I can't seem to stomach anything beyond breakfast. The smoked salmon scramble is among the only winners of the bunch, not be outdone from a slew of super subpar items that include: nachos, quesadillas, club sandwiches, pizzas, and salads. Save for a slice of quiche, pie, or something in their pastry lineup, but even those feel a tad overpriced.\n\nLastly, the internet connection I've experienced has been stellar so far. There have been some quips about low quality internet, but unless good luck has been on my side, I haven't had to deal with any slow speeds at all. If anything, it's the one thing that keeps me coming back.", "author": "Jando S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "GO HERE!!!!!!!!\n\nI go here every day on my way to work. I walk up from Civic Center every day and this spot is the perfect place on the way into the office! Esam is an extremely kind and generous owner/employee. For example, I ordered a chocolate croissant one day before realizing I didn't have the cash to cover it and after telling him this, he comped it for me!!", "author": "Aghlab Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-26", "description": "It's a fine place to work for a few hours - drinks are reasonably priced and decent. Wifi is strong, outlets are everywhere, and there's no lack of seating. Employees are friendly. Never come here for the food, though. Every dish I've ordered tastes like it was made yesterday in a microwave.\n\nCoffee inexplicably tastes like chimneys.", "author": "Derek R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "I've been here before the staff is mildly friendly sometimes there's a language barrier which has the cashier asking me to repeat myself multiple times, that can be annoying but i can handle all that. The prices are pretty pricey. Today I got 2 pastries for a little under $7. Wow, OK so they look trendy, place is always clean I get it all. What I don't get it how 1 of my pastries taste like sour mold and smells like mold. I discovered it by not smelling it first but simply putting it in my mouth, chewing and instantly tasting sour mold almost warm...disgusting. At my job ( a nearby restaurant) I literally spit it out into my hand in front of people....it was that bad....so I take it back seeing how I spent near 4 dollars for it and the girl tells me. \"No it csnt be we just got those in this morning.\" So now I'm lying? I ask her to smell it I tell her to even taste it she continues to defend her pastry claiming \"she'll show me the invoice from this morning .\" I told her i didn't care if they received it aa I Walked in the store its rotten. She offers me another one....it's 5pm I've been at work all day I don't want  a pastry anymore I'm no longer hungry haven't been since chewing mold...I ask for a manager she goes in the back for 2 seconds and returns with \"he's not here anymore.\" I took my pastry back and will be returning tonight to see if he's there. She kept saying \"we just  got them in..\" Like I'm gonna be like \"Oh you did? Then me and  my coworkers who I made all taste a cheezit size piece of it were all making it up for $4\n\n\nUpdate: yesterday in waking by cause I literally live on the same block as this place . And she stops me from inside and says \"hey! I just wanted to say that I'm really sorry about what happened.\" The sound of her voice was sincere made me kinda feel bad for getting mad thst one day. She says \"i can give you  a refund no problem.\" I smile and say \"yes please that's all I wanted\" She proclaims she offered me either a refund or a new pastry which doesn't make sense because why would I take my pastry back and why would I get so upset if she was offered what I came back to do? But for the sake of letting it go and moving on I said \"well either way thank you very much I truly appreciate this.\" She says \"I'm really sorry that happened\" I say, \"me too I was having the worst day so I'm sorry too\" walked out feeling very pleased \n\nOh ya and also went on to tell me how they no longer do business with that company that made me he pastry  which tells me I was right and they must of had", "author": "Paul S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "Came here on a whim bc I needed my afternoon coffee fix and something quick to consume. Ordered an iced coffee and a breakfast smoothie. McDonald's coffee would have tasted better. The coffee tasted so old. The breakfast smoothie was horrible I could only drink 1/8 of it. I ended up throwing it away. It was gritty and I could taste whatever protein powder they put in it. It was a waste of roughly $12, I pretty much threw both away because it was that bad.", "author": "Mary Ann B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "After a special meal with an old friend I saw this place on the way back to the parking garage. The organic fresh roasted coffee is what drew me in. The inside is nice and spacious. Plenty of seating and tables for study or work. They carry some nice local cookies/pastries.\n\nI tried the Americano. It was pricey (SF after all) and disappointing. Seemed weak. Ironically, didn't hold a candle for the Americano I had from Medleno's that very morning and it was nearly twice as much. \n\nI still give them 3 stars because it would be a great place to hang out.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-16", "description": "If you want to witness a microcosm of how basic communications skills have deteriorated irrevocably in modern society, come view the field of laptoppers at Quetzal. This is far less a coffeehouse for social mingling and more solitary confinement for those who want to be left alone staring at their screens. There were quite a few such people there, but I find it difficult to tag them as customers since I didn't see any evidence of food or even drink next to their self-imposed work stations. It just never appears to me that the staff there is clamping down on enforcing table turnover so that the rest of us could eat and chat.\n\nAh well, I have to concede \"Internet\" is in the name. That's probably the main reason I'm not tempted to have a full-fledged meal here. I end up here to have a $3.50 cup of coffee or tea after a meal with maybe a similarly premium-priced slice of pie like the one in the photo I provided (Blueberry Tart...good from what I recall). The staff doesn't appear to be pushing the food much despite what looks to be a robust menu of items in their online food menu. I didn't even know you could get breakfast here. I think the recent addition of the sidewalk parklet definitely helps open up the space, a good thing as I felt like I was in the library otherwise. Shhh...\n\nCOFFEE/TEA - 3 stars...quietly sipping, blisteringly hot\nAMBIANCE - 3 stars...a large library with no books\nSERVICE - 2.5 stars...unobtrusive, I guess\nTOTAL - 3 stars...bring your laptop and leave me alone", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-31", "description": "Tried this past twice, because wanted to give them a benefit of the doubt. But both times warranted a bad review. \n\nBoth times purchased a pitcher of mimosas for $25. Already feel like it is a bad price, but even worse is that both times the pitcher was only 2/3 filled and not much champagne. Was practically drinking orange juice. \n\nFree wifi but it is consistently slow and have to ask to reset often. Bathrooms are terribly unkempt and without toilet paper. Service is poor. Not returning for a third time.", "author": "Will H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "Decent place for coffee or a beer and free internet:-) pretty good spot to get away fr hustle", "author": "Lesley F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-22", "description": "I've been going to this place for years because the coffee is good. I also get some pastries, but lately they've been selling day old stale tasting pastries for full price. I've also been there for lunch 3 times and the sandwiches are dreary. The last sandwich I ordered was a turkey sandwich. The turkey meat was grayish-greenish and slimy. This was less than appetizing and made me sick even though I picked the meat out after the first bite. (See photo) Also a little over priced... almost $6 for a crepe.\n\nThe bathroom is often dirty, and tables sticky. There are always people smoking outside, smoke coming in the doorway.", "author": "tiger M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-20", "description": "Bad customer service. Just went in to try and order food and a drink as the cashier wanted to keep counting and recounting her tips and ignore me. I tried to order several times and she paid me no attention.", "author": "Derek B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "The food is top notch, they get the details right that would be so easy for an average place to skip. It's like whoever is back there is genuinely thinking about how to make each dish as good as it can be for the person that's going to eat it. Portions are big, the cheese on my egg sandwich was fully melted and fully covered the egg and bacon below it, the slices of lox for my bagel and lox that I've also tried were thicker than I've ever seen, and the onion and tomato was placed under the lox so it was easy to cut and eat by hand without them falling off. The bagel was perfectly toasted, no burned spots but a nice dark, crisp toast all over.\n\nIt's also a great place to work, tons of seating, bar height and table height, good spots to people watch or just hide in a corner. Outlets all over, wireless is very good, and I've never been pestered about how long I stay. Outdoor seating in the parklet makes for a nice spot to take a lunch break with a cold beer. They put the tables and chairs out each morning and wipe them down so it's always clean despite on a somewhat busy and dirty part of Polk St.\n\nFair warning, this place can sometimes attract an interesting, probably homeless crowd, service can be somewhat inconsistent as it seems like the staff turns over quite a bit, and I've never been in when it was especially crowded so service could suffer during those times. The counters, tables, chairs are a bit rough around the edges, like they were built in someone's workshop as opposed to professionally constructed, but that's not a big deal, just makes it look a bit shabby.", "author": "Richard A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-27", "description": "Mocha is not good. They ask for a tip but then require you to go back and forth to get your coffee. Food is way overpriced. Small burrito for 9 bucks. Never coming back. Apparently the owner likes to message you on yelp, talking shit. Fuck this place.", "author": "Erick R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-26", "description": "The coffee was ok 3 star out of 5. Customer service was HORRIBLE. the Asian B at the registrar was not helpful, friendly, or welcoming.\n\nShe gave a stinky face when my partner asked to use the restroom before ordering.... then asked me if my animal was a service dog, when i showed her her badge, the Asian B said, You don't have to show me, we work on the  honor system.   Well Asian B start trying to work on the Customer Service skills, be welcoming and friendly... NOT COLD and JUDGING \n\nWe had our coffee and pastry spending just under 20.00  should not have left the 1$ tip for that crappy attitdue... ALSO you FLY/NAT infested Pastry rack looks good but work on the FLYS and NATS  \n\nmy apricot pastry was OK, as a chef, and pastry chef I did not expect to get diarrhea immediately after having their coffee and pastry, likely the cheep lard used in the pastry.\n\nYUCK  WONT BE BACK   AFTER YEARS of LIVING IN SF coming back To Quetzal should have been nostalgic for a few reasons  HOWEVER NONE of that nostalgia lives at Quetzal it is an empty shell of a memory of good times and good coffee...", "author": "Pedro Proz P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Great place to work out of for a few hours or so - coffee, huge space, many outlets, plentiful seating, and nice staff.", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "I was in here on a Wednesday morning when a disgruntled transient came in screaming and throwing items off the counter toward the barista. She handled the situation with calm assertiveness and poise as she, another young gentleman, and several regular customers helped escort all patrons outside to safety while the police arrived. When it was safe to come back inside, she had my order ready and a smile back on her face. \n\nI don't come here often, but I am certain I will make this place a regular habit from now on. The smoothies are amazing, the food is great, staff is professional and kind, and the wifi is FREEEEE! 5 Stars.", "author": "Teresa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Watched the Brazil World Cup with one of the games versus the US and it was surely rowdy that time of day at this cafe located on Polk street!\n\nBars next door and cafés around the area were surely packed that day as well!\n\nThis cafe is a chill one after the game has been played on TV!  They serve up the usual cafe snacks and coffee while offering up complimentary Wi-Fi!\n\nAdequate seating with plugs around!  Doable place!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "Need to do some training on espresso drinks. Come here frequently when I get haircuts across the street and every time, regrettably, is disappointing...\n\nCan't comment on the other menu items.", "author": "Noah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "I'm not sure this should be called a \"cafe\" it should be called Internet plus expensive mediocre food? \n\nThe staff should smile and be a tad more helpful if I'm spending 8 dollars on a cup of tea and fruit.\n\nThe plus side is there are a ton of outlets and seats; so if you're anti social it's a good place to study or work for hours.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Excellent food and customer service. It is like a Statbucks but with more food and less expensive.", "author": "Luis P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Once every few weeks, a couple of my coworkers and I would come here on Tuesdays after work for their happy hours on beer. We love how the bench area outside is always vacant for us to chill and smoke cigarettes freely.\n\nI've never tried anything else so I can't complain. This place isn't your usual happy hour bar type environment but I give it 5 stars cause it's perfect for a few people like us :)", "author": "Sharmaine M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-20", "description": "So waiting for my hair cut at people's decided to go get a coffee. I'm alone and I just want to grab a latte while I wait. Nice people very patient, but this is why I won't go here again. Coffee is pretty tasty, but I can't stand to pay for something for nothing. No one these days carries cash. I have a card as does the rest of the 2017 world uses for even minor things like $5 coffee. It's a business but when u nickel and dime it's not cute. Someone coming in and supporting your business and purchasing your goods or service is enough.... there are plenty of other places out there now. Why do you charge people a transaction fee for something less than $5? Plus when I upgraded to the $4.75 I'm ok with the additional .25 add on to make my transaction $5, but what I'm not ok with is the additional .50...... I'm confused why this place is charging .50 transaction fees. The credit card company's charging u those fees are the convenience of doing business. It doesn't matter how low my transaction is. Ok end of rant. If you go to this place bring cash is the advice given....", "author": "Troy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-08", "description": "Extremely slow service. For a sandwich you can wait up to 20-25 min! This place has a lot of potential but right now it's really slimy and dirty and not taken care of. They have some weird huge handicap ramps in the middle of the place which take up almost half the space. I like their veggie melt panini but I do agree with other reviews- it is way overpriced.", "author": "Ana V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-19", "description": "Great place to study since the place is overflowing with sockets so you can charge all your devices. They have good food at a decent price, very nice staff and they play good music. also a lot of different types of chairs and table settings so you can choose depending on what you need to do. I definitely will try to go here as much as I can!", "author": "Camilla E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "With the Tenderloin quickly becoming the trendyloin I would have to say that Quextal needs to step up their game.  \n\nLarge space for getting your work on but the coffee itself needs it's own pick-me-up.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "I was a regular customer before the management change. The place was great,clean, good service, free trade coffee and a great coffee menu, that was all made well.  \nThe new owners changed the menu, for better or worse. The coffee is not as good and the place is a mess. The service also bad. \nbased on my last visit and the poor service I received, I will not go bad. Lucky for me I can pick 5 other places to go to in the area.", "author": "Bob b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-18", "description": "We had a miscommunication with our order, and ended up getting the wrong item twice. It was not a big deal and I politely let the employees know of the mixup, and they were very defensive and adamant that I was the one who made a mistake. Overall, my experience here was defined by poor service, a long wait, and the wrong food.", "author": "Kartik S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "Knowing you're staying in the Tenderloin you wouldn't expect much variety when it comes to nice coffee shops where you actually want to sit down and have a sip. Queztal is a beautiful exception here - I was pleasently surprised by both the athmosphere and the large selection of tea, different sorts of organic coffee, and sandwiches. \n\nMostly I have to agree with my fellow Yelper Ed, although sometimes I'm the \"bring your laptop and leave me alone\" type of guy. To my excuse, getting some work done just feels better when you have friendly faces around rather than sitting in a small, depressive hotel room. \n\ncoffee - 4 stars (fair trade, great tea selection, sandwiches and beverages available too)\nambiance - 4 stars (relatively spacious, Mac equipment (note: Internet cafe), lots of tables and seating)\nservice - 3 stars (nice and friendly)", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-12", "description": "I ordered the Waffles and I got an Eggo Waffle that was more than disappointing.  It also took like 20 minutes for them to bring it out, I guess they had to defrost it.  Then to make matters worse there was a few hopped up hobos that showed up and sat down next to my girlfriend and I and were selling/ buying stolen cellphone. The coffee was very meh too.  So go here if your in the market for a stolen cell phone from a crack head and you want an Eggo waffle and a bad coffee for 12 bucks.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-10", "description": "I wish I could rate this place 5 but no way to do it, although I got chance to meet with the owner one time had some talk, he is a great guy.!  But I never see him there, it s basicly the employee running the business,interacting with the customers.. I been coming here for at least 5 years now, seen many employees coming and going, but I think this new girl is worst of all, happy looking but unhappy..\n  I think she said her name was Alice but sound was like saying Ellis, she looked mexican, she was short, looked like at least 250 lb , she had big hands, probably ready to knock down any man with one punch.! She also had a big mouth,\n  Here how it did go on...,,\n  On Friday around noon time I walk in and sign her, said hey could you buzz the bathroom door for me, \nShe looked at me and said restroom is for the customers only, I said I m a customer, ( damn it I just need to use the bathroom first, wash my hands face before I get my tea and some food)  she took a little pause then I said I m a regular one, then she said I never seen you before.. so what is that mean I said, no bathroom?? She said no..  \n  Hell a pissed off walk ed outside and keep looking for  another place to settle down for little while..\nI walk towards to the water and just a couple blocks ahead fond my new spot, a new cafe that specialized on japonese food and drink called  sage cafe..\n   But still would like to be able to go these place as well, when she is out of pic, and give this place, rating it deserves..", "author": "Wolfy E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-29", "description": "Snobbish service but good crepe and latte so I'm ok with that. Wifi is good too perfect for waiting and killing time", "author": "Noel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Great cafe with great internet. Stopped in here to get a bite while waiting for my haircut and the only complaint I have is how it smells outside. Definitely try it out if you need a place to hang out or study!", "author": "Bahram A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-09", "description": "This was the only place we could find that had bottomless mimosas during a weekday. For roughly $14, we got all the mimosas we wanted. The staff was polite except for the one comment, \"it's too early to drink\" from a guy who came to the front from the kitchen. My friend and I had 2 of their nutella crepes and they were delicious. Laid back atmosphere, nothing fancy. Not your typical brunch spot, but it worked!", "author": "Krystal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "This is my local coffee shop that I frequent at least once a week. I work in the area and its a good place to stop for a good cup of coffee, a smoothie or something to eat. I prefer to support local coffee shops than Starbucks and other chains. \n\nQuetzal is very big and has a lot to offer. They have an outdoor seating section with really nice new benches. Many table options inside as well, even a computer station area if you need to use a computer. No annoying loud music playing which is nice so you can concentrate on your own things. \n\nTheir food is really good, a bit pricy but you get for what you are paying for. I have personally dealt with all of the employees there and they are all really great and kind. This is for people that have a laid back attitude if you are a Type A personality I suggest you stick to the run of the mill chain coffee places.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-21", "description": "Frustrating \"internet\" cafe -- no frieakin' internet! The three of us near where I am sitting are getting no internet access. I come because so close to home and a nice space to have a bite and do some work. But can't work; plenty other places to grab a snack *and* get internet. Will I be back. Dangit, probably yes. But I won't be happy.\n\nDon't come if you plan to rely on internet access!!!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "Wifi, open late, food, relaxed vibes... This is my ideal cafe. The barista is really nice as well.", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "99.9999% sure our eggs were cooked in the microwave!? Gross. \n\nThe internet wasn't working... when we asked about it, the workers behind the counter could have cared less (despite even in the name it's labeled an internet cafe!?)", "author": "Kali L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "I came into Quetzal today and wasn't sure what I wanted to drink. After telling the girl at the counter that I wanted something hot, sweet and full of caffeine, she recommended an almond mocha and I LOVED it. Sometimes when you ask employees for recommendations they act annoyed or like you asked them to do complex algebra. This lady was really nice and came up with a great suggestion. I received my drink from the friendly barista, took a sip and the cashier was nice enough to ask if I liked her recommendation. \n\nBeing there reminded me that I had went in 6 months ago and had such a nice experience that I had meant to write a review and never did. I had the egg and cheese sandwich on foccacia bread that came with a side of fruit (see picture). Everyone at the time was very nice and the guy that brought me my food had gone out of his way to do something for me although I can  no longer remember what it was.\n\nI was surprised to see so many negative reviews from the last few months on here. If you're thinking twice about checking out Quetzal because of those bad reviews, I say ignore the negative nancys and give it a try. It's only coffee. It's not like you're risking the pink slip on your car by trying the place out. I have had nothing but good service and good coffee/food here.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "I was looking for a place to grab a coffee on Polk and found this really nice place! I had a latte and was just perfect : smooth , right temperature: milk wasn't  burnt but it was hot enough. I hate when they make coffee tepid. Surprised by the quality of their coffee, I decided to stay and have something to eat, I was in a hurry so I quickly chose pesto chicken crepe.  Boy! It was delicious and the crepe is huge! I really liked the chicken ,and pesto had delicate but strong flavor.  I am so picky about pesto and I like mine to be perfect and that is how I feel about this one, just perfect taste and texture! Also the price is really amazing! If I am not mistaken it was around 7 bucks ! I never can find a good lunch for under 10! I really really recommend this place! Didn't have time to see the whole menu.   But will be back!", "author": "Gulya B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-03", "description": "The service was painfully slow, and then the two people at the counter completely disregarded my concern when I realized that a man came in from the street and stole my wallet from my purse (other eyewitnesses noticed the suspicious activity, but we didn't realize what happened until the wallet - and the person - were long gone). I notified the staff and they didn't respond with any concern or help whatsoever. \n\nI don't blame the business for the criminal activity, but I was really disheartened to see their lack of regard for customers. We were waiting nearly 30 minutes for salads, which is when this occurred, and then the staff did not offer to help, call authorities, or look for the person who came into the restaurant and took my property from my purse. Very disappointed :(\n\n(And yes, the police are now involved... the person has attempted to break into my bank accounts and other accounts for the past several weeks). \n\nGuard your stuff if you go there. And plan to sit around waiting for a long time.", "author": "Jax R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-21", "description": "While the staff is nice, the internet is spotty and the food is embarrassingly awful for the price. The nachos were basically just tortilla chips with cheese on them and lazily dabbled sour cream. Where are the beans? Don't get me started on how bad their quesadillas are. These guys should really just give up on the whole psuedo-mexican food thing. They suck at it.\n\nThat being said, they have beer and 2 hour wifi. Take it for what you will but don't spend any money on the food. Trust me.", "author": "Nichole A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-05", "description": "I work in coffee shops a lot and I get really annoyed when I spend one hour settling in a place having my coffee, struggling to connect for half an hour and having to leave all frustrated to find a new coffee shop with WiFi. If you are in the same situation, I hope this review helps you avoid this place at the first stage. Here is why:\n\nThe toilets were really dirty as if they haven't been cleaned for a while, I mean days. The atmosphere is boring and it just feels like there is no love put in for the place at all in terms of design, cleanliness...It is indeed an internet coffee with computers and the internet stopped working after half an hour and the staff was not helpful and friendly. They gave me a new ticket to join the network while my browser was not even starting.", "author": "Duygu G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-12", "description": "I'm going to give Quetzal a 3.5. They have great drinks and smoothies, but their prices are high, and food prep slow. I'm also not a huge fan of the 2 hour wi-fi limit (get your username and password from the register before sitting down to work).\n\nS loves their protein/workout shakes, but they run him $7 every time he hits the gym. Some of the power smoothies look like swamp water and taste like grass - I don't get the appeal, but he sure does chug them after boxing class!", "author": "Alison C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-14", "description": "Call it a 'first world' problem if you will (I do), but one of THE most annoying situations I can find myself in is entering a cafe with a huge Internet sign on the front, only to find that it is the worst internet I've experienced either in the first or third world.  Seriously.  \n\nYou must get a ticket when you purchase, yet there's no sign at the register that informs you of this.  So I go back to ask for a ticket.  He says he needs to get some.  I wait nearly five minutes and then go back to the counter to ask for a ticket -- which the cashier cheerfully handed over.  I sign on and I can't get anything done with the signal apart from deleting unwanted emails.  Really??  And forget about streaming a video (though that's a rare occurrence for me when I'm trying to GET SOME WORK DONE FOR PETE'S SAKE) cause the service tells you straight up -- that won't happen. \n\nThe manager (owner?) seemed less than mildly interested in trying to fix the connection (if that's even possible).    And when I politely said I had to go, he didn't even acknowledge me.  I will never return and strongly advise selecting another of the many cafes in the area.\n\nAnd Quetzal, tisk-tisk for the false advertising.  An internet cafe, you are not.", "author": "Sarah N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-01", "description": "They're mean and really  rip customers off.\n\nWow - what a mean-spirited rip-off business.  Went there late a.m. 10/1/2013.\n\nFirstly, they are insanely expensive.  A sandwich is $12 and a burrito is $15!!!!  Ok, fine.  That's their right, obviously.\n\nI am a vegan.  I asked for no cheese and no cream cheese in my veggie sandwich.  Could they put a bit of avacado instead?  \"That'll be extra\".  What?  for a $12 sandwich?  That's not reasonable.  Work with me here, especially if you're gouging me for a meagre veggie sandwich.\n\nLater:  Do you have any water? \"Yes, bottled only - $2\".  No water jug?  After I spent all that on food and coffee?  Wow.  Not coming back here.\n\nThere's an ok coffee place with internet on Pine and Polk.  Going there,  Join me.", "author": "Jed S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-12", "description": "Apparently under new management, this place has good intentions but need some serious help with thier staff. Starting with basic training. They all are pretty clueless. There are four girls and a child standing around without any experience.regrettably, I ordered a crêpe. The girl who tried making it had obviously never been trained in crêpe  making. It was a total disaster, shredded and destroyed, she had to throw it away.  Instead of making another one I asked for my money back. Most places would've offered something in return as an apology, perhaps some coffee or something else on the house... they did not offer anything. It's pretty embarrassing watching them try to figure out how to make a A latte and a coffee house, or food without any training.  Think of the Three Stooges but all girls!\nPerhaps the owners will read this review and start training their staff before putting them in front of customers. If you charge money for something you should offer some kind of professional service or product. Maybe we'll stop by in six months to see what you have come up with. Because honestly the ambience is great for working on your computer, and having some food and drink and some nice music. But at this stage bring your own food and drink!", "author": "Cerraeh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "This is my first time here, just ordered and a white mocha and bagel with hummus. The white mocha is absolutely delicious, just the way coffee should taste like. The bagel just tasted like a bagel, nothing special. They also serve beer and wine, a coffee shop that serves beer and wine, I am in. \n\nThey also have free wifi for 2 hours, and then you have to order another cup of coffee, which I would have no problem with doing. Wifi is quite fast as well. They also have 9-10 iMacs for those unfortunate few that don't have a laptop. \n\nThe place does have a warehouse feel, not the normal cozy coffee shop, but I got no problem with it if the coffee is good, and it is Great. Do yourself a favor and order the white mocha and satisfy your taste buds with what coffee should taste like.", "author": "Anuj C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-10", "description": "I'd rather relieve myself in the alley outside than ever step foot in Quetzal's restroom again. They say you can tell the cleanliness of a restaurant's kitchen by looking at how clean they keep their restrooms.  If this is true, I should be spitting out the bagel I was forced to bring home and eat because I couldn't use Quetzal's restroom. \n\nWhy couldn't I use it? Well, because there was a big, hairy-legged man crapping in what used to be the womens' restroom but is now faux-unisex. One restroom with two filthy stalls and UNLOCKABLE. Apparently there is \"construction\" going on in the mens' room so they just made the womens an unlockable unisex batheroom. My guess is that it's been \"under construction\" for months. No signs, no aplogies. Just a chaotic, dingy, FILTHY mess. No soap, an array of dirty of paper towels on the floor.  On top of all of that, there is the inhumane process of having to ask the cashier to buzz you into that pit any time you need to use it. I'd put up with that if the bathrooms were private and not festering with bacteria.\n\nAnd the cherry on top? A grumpy, non-smiling cashier who clearly hates working there as much as I hated being there this morning.  \n\nQuetzal, invest in improving the environment for your customers who are paying quite decently for your food and drink. I highly doubt your restrooms even comply with code. \n\nIf you're craving the adventure of travel to a developing country, but don't have the time or funds, take a whirl through Quetzal's one and only bathroom. You won't be disappointed.", "author": "Nette J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "Solid coffeehouse. You know, as opposed to all all the liquid coffeehouses out there.\n\nIn all seriousness though, this coffee shop has a lot going for it:\n- Large menu that includes smoothies and all sorts of bites\n- Spacious seating area with some outdoor spots\n- Old-school Mac-only workstations, what whaaat?\n- Plugs galore\n- Free 2-hour Wifi with purchase code - you sneaky bastards...\n\nThe lighting is plentiful and ambient. A pleasure to work and hang out here when I'm headed the tender direction.\n\n---\n\nDistinguishing factor: The tea bags are as hipster as you can imagine. They come in a freestanding brown filter bag--very fresh and organic. Get large bowl of tea to complement the hipsterness.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-03", "description": "This place treats everyone who comes in like a criminal. Apparently, they attract a lot of the \"street folk\" but that's no excuse to presume anyone who comes in is guilty.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-27", "description": "I have been planning to come here for the longest time after hearing about their wifi connection, organic coffee, excellent macaroons and coffee cake. I finally brought my friend David N. here for a visit this afternoon. \n\nAmbiance and Service: I was so excited when I finally made my way here. The interior was slick colorful with shades of upbeat yellow and soothing orange to compliment plenty of nice looking plants. Initially I wanted to add this cafe to my regular line up of places to hang out, but my experience turned out sour and disappointing. While I was actively looking to find their macaroons and coffee cake which they later told me they had ran out, their male servers were very rude and impatient. One of them became very upset with me when I was in the process of choosing my drink, and rather than helping me with an introduction with what was good here, he stood there looking annoyed. The nice female server had to calm him down and made some suggestions which I thought was helpful.\n\nDessert and Drink: I thought her recommended mixed fruit pie was solid, but the iced soy mocha was not well made at all. The drink was culminated by un-dissolved chocolate powder clumped at the bottom like a landfill that prompted a rough grainy finish. In retrospect, these alternative desserts along with the poor service were not enough to dissuade my disappointment for missing out on the two things I came for, the macaroons and coffee cake.\n\nWifi:  Contrary to Neil S. and Kristine W's reviews, their internet was not free during my visit, but 16 cents per minute according to their staff. As soon as that was said, I realized that I really don't have a purpose for being here so decided to pack up my laptop and quickly made my exit. \n\nWhat a waste of time and effort! Contrary to other reviews, my visit was stressful and unpleasant. I won't be going out of my way to come here again.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Nice quaint coffee place. \n\nStraight up you get what you ask for. No frills or fluff or bs.", "author": "One L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-23", "description": "For years, I was a regular at Quetzal, but since new management took over, I can no longer recommend it.\n\nIt's no longer clean (the restrooms, in particular, are quite unpleasant). The food is not nearly as tasty. The prices have gone up. And the staff are far less friendly. Too bad.", "author": "Solange M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-05", "description": "This place is dirty, dirty, dirty. It's seating was set up by someone who either doesn't care, does t know how to do it, or both. Why would you ask the customer if it's for here or to go if you don't want the them to stay? I made the mistake of saying \"for here\". An unkempt messy haired individual served me a colder attitude than my strawberry & Nutella crepe was. It was in a to go container and the utensils I was given were so cheap and flimsy, they were literally unusable. I called \"excuse me!\" To catch the servers attention and he look at me, smiled, then walked away. I walked over to him and I politely asked for a normal set of utensils. I explained that the ones given to me were terrible and he smiled again saying \"I know\". RUDE!!", "author": "Jackie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-22", "description": "Back in January, they had this great, yummy smoked salmon with fried egg sandwich with a side of fruit. I went back today and it wasn't on the menu anymore. So sad!! :(:(:( So they recommended this salmon burger ($12) which is actually pretty good but its not the same. \n\nI'll definitely be back to try their other breakfast items tho. Everything looks so tempting. Their items are a little on the pricey side but at least its worth it every once in awhile.\n\nThey have a patio/seating space that used to be a parking space so its great spot to sit down and enjoy a cup of coffee.", "author": "Jean T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "I've been here several times and with each time I enjoy this place more and more. I love their crapes and my husband is a fun of sandwiches! During the day you can enjoy tasty cup of coffee or tea and a bit later in a day you can relax with glass of wine or a beer. Selection is pretty good as well. They have indoor and outdoor seats which is perfect with the kind of weather we experiencing now. Perfect place to study  or meet with a friends for a brunch. Oh and they have a TV so you can follow your team (go Giants) :) And of course the people who work here make this place special. Always friendly and helpful!", "author": "Anastasia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-24", "description": "Quetzal is relatively close to where I'm currently staying, so I'm bound to wind up in there again, at least in passing.  But, by and large, this place is not all that great.\n\nI first visited Quetzal in March of 2012 during a visit to San Francisco.  I stopped in to get a smoothie (the vegan and non-vegan options were great) and use their internet.  Over the course of my week long visit I stopped in there one more time and had a pleasant experience with both the staff and their product.  I thought the place was great.\n\nFast forward 9 months and I've officially moved to San Francisco.  One of my first stops was, of course, Quetzal.  I'm an avid coffee drinker and I often telecommute for work, so a favorite local coffee spot is a nice thing to have.  However, in the interim since I had last been there, something seems to have gone to shit.  \n\nWhile their drinks have remained great, their customer service had taken a serious nose dive.  They close at random times, don't keep regular business hours, and routinely made me wait for my drink while they prepared an easier one for someone standing in line behind me.  That, and their buzz-you-into-the-bathroom set up is just ridiculous.  I know they must get a lot of non-paying walk-ins trying to use the bathroom, so I get putting some kind of lock on it, but that just isn't working out.  Also, whoever is buzzing them in from the counter is often mumbling under their breath while they do it.  \n\nI've always enjoyed the beer they have on tap there and their abundant supply of electrical outlets near their tables, but I don't know that I ever see myself returning.", "author": "Mario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "I've come here a few times a week to get research done as I settle into San Francisco. It offers a great combo: music, tasty lattes, better food than you would except for a cafe, and WiFi that actually works! Keep it up, Quetzal. :)", "author": "Aisha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-20", "description": "I came late at night as my hotel up the road was noisy and very uninteresting. The place is big, serves a good variety of drinks, but the telly was on all the time and I found that somewhat annoying. Great place if you can work with the telly in the background. The tea and hot chocolate we had were good.", "author": "Tatiana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "Large place with nice outdoor seating. Only problem is the legion of homeless people that squat here with ease.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-26", "description": "Language problem communication; don't understand half of the order. The food is ok. It looks nicer than it is.", "author": "Vincent S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "I really try to support local businesses in the area instead of going to the big guys like Starbucks and Peet's but, this trip was not good.  I came in and order a beverage which was fine.  Later, I went to the counter to order food and waited at least 10 minutes because someone was on the phone and doing something to the register. Your paying customers should always come first.  Put the person on the phone on hold and conduct their business after your customers have been taken care of.  I couldn't tell if they were putting in a supply order or what.  I finally order a Zesty Burrito.  It was brought out to me and looked okay at first.  I was brought condiments that were almost empty.  Fill your ketchup, salt, and pepper etc.  This is such an easy fix.  I came in the morning so there is no excuse to give me empty ketchup bottles and not wipe off he tops. Next, I notice my burrito is missing 3 of the 9 ingredients.  When I return to the counter, the cashier argues with me that it is only one missing ingredient.  Well, why is it missing anything in the first place.  The cashier clearly does not know how to deal with customers.  The cook came out and didn't seem to say much.  Either he doesn't know the menu, or he was making it the way he wanted. I then point out the ingredients on the signs behind them on the huge billboard.  He realizes there is stuff missing and tells me they are out of the beans, but they can add avocado and the salsa.  Well, should't you tell me before I order that you are out of something?  It happens.  Restaurants run out of things but, be up front and don't serve me something I ordered with three things missing after I pay for something.  Then, I decided that after this guy argued with me, I don't want to reorder, they seemed to be irritated that I wanted my money back.  Honestly, I just didn't want the cook to spit in my food.  It wasn't until another person (from the back) came out that there was an actual apology given to me.  This is service 101 people.  If you screw up just apologize and move on but don't argue, then get an attitude because I asked for my money back.  If you are out of something just tell me and be honest.  I was polite and told them I would try them again but, I'll only be ordering drinks from now on.", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "I really like this cafe. There are a lot of tables (that are cleaned regularly), their tea is delicious and well-priced, the staff is nice, it's relatively quiet, they take credit cards and don't have some irritating minimum purchase amount, they have free wi-fi, and they're open relatively late. What's not to like?\n\nNext time I have a long stint of working from home, this will be the place I go to get some work done and get out of the house.", "author": "Dani D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "Quetzal serves both delicious coffee and great sandwiches, and sells reasonably priced coffee (buy a pound and they'll give you a free coffee as part of the bargain).  Street side seating is abundant and in this particular neighborhood there is plenty to watch and ponder, as you might guess.  Free wifi inside and out  is also a nice plus, but if the weather doesn't accommodate, there is ample seating inside.  \n\n(Just don't ask me where the quetzal name comes from ... there wasn't much Mexican about this place!)", "author": "Vince V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-16", "description": "All you need to know: Breakfast pizza. Seriously. \n\nEggs, lox on a soft pizza bread. Heaven. \n\nSee: http://flickr.com/photos/calmenda/2268913183/\n\nLauren hates lox and this thing was awesome. It was only $7 and could easily feed two. Her fritata was also huge. I would definitely suggest sharing. \n\nThe space is nice and the staff were very friendly. I was going to share my smoothie and he offered to give us two cups, which I thought was a nice gesture. \n\nI think they're going for the whole andean / \"we do fair trade\" theme. It's a great roomy space. They also have free wi-fi and computers that you can use. \n\nThere is NO doubt that I will be going back .", "author": "Carlos A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "Excellent breakfast for a quick bite in the morning. Open on MLK Day, definitely a plus! Service is friendly!", "author": "Robert G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "So disturbed, had to write a review. Came here just to check the place out. Had decent yelp reviews so thought would give it a try. Whiles settling my things down--went up to ask for wi-fi and was told \"No.\" I get that I have to buy something first--but talk about very poor customer service! Definitely won't be coming back here again. Thankfully other cafes in area to check out. Also--couldn't help but include--I'm an African American female and wondered if this came into play...sad.", "author": "Madeline N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-02", "description": "Bought a sloppy job chicken sandwich and a whole salad plus a medium iced tea for $24 dollars?! \n\nI can make that sandwich better; in fact, I know and can and will. Idk if the dudes working that time were just too lazy to make a decent and respectable chicken sandwich on a Friday night, but I bought those sammiches at 9 pm. You usually go out at 11 ish on a Friday night in sf, so they have no reason to be so butthurt that they don't put any effort in making me a sammich.\n\nHell, I work in a cafe, and our prices are 1/3-2/3 of their prices, and our food is crafted better.", "author": "Colleen J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-12", "description": "The staff here are so basic... I just can't with them! My order is always wrong, the baristas are always clueless and/or rude, and they always screw up my change (like, always... are they intentionally trying to steal from customers?). Every. Single. Time. I really, really, tried to like this place - it's a great spot, physically. \nAfter my last trip, the service was so awful I vowed never to come back, but I have a soft spot to local coffee shops and thought I'd give them one last try. It just reminded me how much I hate this place. My order was screwed up (yet again), they tried to gyp me on my change (yet again) and then acted like giving me their internet password was giving me the codes for a nuclear weapon (again). I seriously think you have to be demonstrably stupid to be hired here. \nI've learned my lesson this time. I'll never go back. Which is a shame - such a nice space gone to waste.", "author": "Adam R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "Well... I used to like it here. Lots of space, lots of outlets. Perfect place to get work done on my laptop between clients. Wayne, the previous manager always called out to me by first name and new my order instantly. He kept the register well stocked with dollar coins so when my meter card ran out, (because of course Polk street still hasn't updated the parking meters) I could count on being able to keep the meter maid at bay. It was a great haven. \nThat was then, this is now. I've come here since the new management took over and the guy barely remembers me. The \"free wifi\" boots you off after about 30 seconds. I've wasted an hour here on three separate occasions trying to get online. Feel like a sucker at this point. Classic case of losing good business through incompetent management. Not coming here again. Brewing my coffee at home, and taking my internet needs to the place up the block. If you like being ignored and trying in vain to get wifi, by all means, hit this place up. Otherwise, there's like a thousand better places on Polk St.", "author": "Albert I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-12", "description": "I used to like the Quetzal, it used to be a busy place but if you look at their photos, they show the food, but, their prices are exuberantly high now.  They've always been a bit higher then any other coffee place around. Would you pay $18.50 for a vegetarian burrito. Watching a ball game the owner who is probably Muslim or Arab, comes in and shuts the game on to put on the music from where he comes. This tells you where his priorities are at, definitely,  not with his customers.  Too bad it was a good place before, not any longer!", "author": "George T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-01", "description": "The weather is gorgeous, I'm certainly not going to stay inside. One of those rare days the heat arrives early making you want to do anything as long as it's outdoors. I head to Quetzal for this exact reason, with outdoor tables, a little pie and a pot of tea ought to be just perfect. \n\nMy order is ready and I realize I can't possibly carry pie, tea pot, mug and silverware all in one trip. I figure to drop the pie off outside and run back in for the tea, I'll be gone all of 20 seconds, my pie will surely be safe. I glance left and right, no one heading my pie's direction, now is the chance. Back in a flash yet sure enough I return to find a man sitting at my table, hovering over my pie.\n\n\"Is this your pie?\" he asks. \"Indeed it is and I have to admit I'm quite impressed, I was gone 15 seconds. Were you hiding behind a car or something? Maybe a convicted pie stalker?\"\n\n\"Man... I was about to tear that pie UP. I was waitin', but man you had about 30 more seconds, no lie.\" Customers at another table found it rather amusing.\n\nOff he jogs, thankfully my pie untouched. I pour a cup of perfectly steeped organic hojicha and settle in to relax, alternating between Pandora stations, a little 60s Reggae and then some Chet Baker. A police officer rides by on a bike, where was he to serve and protect my pie? Even a stolen slice of pie wouldn't have ruined the beautiful day, it's the most relaxed I've been in weeks. \n\nI love places like Quetzal for these unique yet restful days. A classy cafe, catering with teas and vegan pie as well as standard coffee and breakfast fare. Things of the Nob Hill type, yet a location still complete with the colorful and always exciting passersby from the Tenderloin. The staff here are chatty and friendly, and should I be a little more wise I'm positive they'd assist me with extra hands so I need not leave my delicious pie unsupervised. \n\nI sat outside for an hour or two, just enjoying life. Well, enjoying life along with the pie and tea to be precise. My visit ended with the approach of a man, a touch dirty and I'm certain he's going to ask for change. I explain I have no cash and his face shows shock, it turns out he merely wanted to show me a magic trick. I have to say sleight of hand or not I was impressed, and with a tip of the hat he was on his way. A perfect end to a perfect visit, a unique experience all thanks to Quetzal.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-02", "description": "What is the tip for? They ask for a tip on the screen during the check out process,  I tipped 20% when I ordered.  What a waste of money.  I ordered a burrito and a latte for breakfast.  They brought me the burrito after 10 minutes but still no coffee.   Hello! It's 8am, where's my coffee? That should have been first priority.  I went back to the counter after my food was delivered and had to ask for it again  and take it to the table myself only to discover that it is cold.   The burrito was very watery and left a pool of tomato juice dripping out the bottom.   No hotsauce on the tables and none to even offer except for some crappy sauce she poured me out of a bulk jug from the food supply warehouse.  Hello!? You are serving burritos and hash Browns for breakfast and you don't have Tobacco or Cholula?? This place needs a new manager to come in and fix up the problems because it is a great space in a great location,  but the service is lacking,  a lot.", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-16", "description": "Sitting at Quetzal using the internet and it freezes - seems like it's been hacked (I've been hacked  before).  I ask the older, ponytailed guy behind the counter for help and he comes over.  I explain the situation and he just smirks and says that problem is between me and the computer.  Seriously?!?  Passwords and private information have been typed into this machine and not only could he care less but he doesn't even TRY to help.  I live around the corner and just started coming here (while my hacked computer is being fixed) but I will never come back again! This place sucks!", "author": "Q M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "On this visit I had no issues with the Internet. And they're now playing 80s hits with no ads. Awesome :)", "author": "Harry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-24", "description": "Iced Americano, super legit.  And for $2, can't really beat it.  You'll notice immediately that they make em right, because they lightly pour the espresso over the ice, not drop it in.  The result is this nice caramel creamy layer on top. YUM!!!  Also, it's probably the biggest americano I've seen for $2...\nOn another visit, my friends and I consumed a pitcher of sangria.  They claimed its pretty strong and is made using the same recipe as cha cha cha (whatever that means...)  It wasn't bad, but seemed more like just red wine and simple syrup.\nI'd like to come back to try some of their real food, but I'd suggest passing on the blueberry muffins.  They look good, but only tastes ok, if even that.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Friendly nice, big, breakfast creps looks so good! Good for study. Not good for dates ;)", "author": "Seda G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "Wow, a cafe that got it ALL right.\n\nFree WIFI - with PLENTY of outlets\nGood lighting\nLarge, comfortable seating with large tables/ workspaces\nLong line of iMacs if you're not a laptop person\nReasonable prices\nLarge selection of teas (sorted by caffeine amount in bags or pots)\nFrequent buyers club-- 10% off purchase when you sign up, then a discount after every $12 spent\nVegan friendly with baked goods, soy options\nFast friendly service\nClean restrooms \nUnobtrusive background music\nAccept Visa or Mastercard\nLarge selection of good quality cafe food if you need more than a snack (with plenty of vegan/ vegetarian options! yes!)\nLocal coffee\n\nLove this place. Wish there was one in the East Bay too! :)", "author": "Debora L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-18", "description": "All life is change and Quetzal has changed too much, and I still give glory to the Messenger Alah\nThey forgot their innate goodness, the women workers are not appreciated as much as before and LBGTQ people well you go and decide for your selves.  Yet if you have lived in this neighborhood for over 40 years, like me and you go in and get sad.\n\nPeace and All Good", "author": "Timoty G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-12", "description": "Quetzal used to be a good place to spend some time on the Internet, but it seems to have gone downhill recently. New management? The music is now too loud to concentrate. The \"freshly squeezed\" orange juice used to be just that, now it's been sitting in the fridge cabinet long enough for the pulp to be a separate layer. The outside seats seem to be new, so new when we visited that the varnish hadn't dried properly. There need to be more power receptacles, although this is a common problem with Internet cafes. On the plus side the staff were friendly and helpful, the food adequate and the coffee is good by SF standards. And there's always a seat. Needs improvement.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-12", "description": "http://www.quetzal.org\n\nI had coffee at this store. It was good coffee, grimey store, food blah! I tried to order from their website and call them. You cannot reach this store via phone and my order of coffee has been stuck on processing over two weeks. I wrote emails, no response. Seriously, take your useless website down.", "author": "ANESA B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-14", "description": "It's really disrespectful & demeaning to joke about homelessness with all your blind privilege. To say on your image of the out door seating \" bums dominating the outdoor seating\" is beyond horrible in so many ways.", "author": "Concerned Community Member C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "I can't Quet you Quetzal....\n\nA friend recommended this place to me today and I am glad he did.  Great menu, eclectic drinks and friendly staff.  This is my idea of what a coffee shop should be...minus the occasional Megan's Law internet user.\n\nGreat selection of teas and I will definitely try the food next time.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "This is a nice local cafe with good coffee and great service. Most guests seem to go here for using their computers or for studying, so I wouldn't say its the good-to-café if you wanna socialize. Opening hours are quite good, they close ~10pm. So I usually end up going here when other cafes nearby have closed, and I need to get some work done.\nThe only drawback is that the Internet connection seem to be kinda slow, so go somewhere else if speed is important to you.", "author": "Niklas A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "Great food selection but REALLY slow for hot prepared foods, so don't try to order that on the go! \n\nWish they didn't have the pesky 2 hour limit for internet - no other cafe does it! Seating is also really uncomfortable though the Macs for public use are convenient.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-21", "description": "This is a really nice, local cafe with a ton of seating and big windows for plenty of natural light. There's also seating outside on the sidewalk if you want to soak up some sunshine. The savory crepes are crisp and tasty, and the coffee is decent. I like it for the space more than the food, especially as a place to work and write.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "My personal Yelping philosophy is that five star ratings don't mean that whatever is the most expensive version of whatever it is you're talking about. To me, each of those precious stars twinkling scarlet and orange in the Yelpiverse reflects how perfectly a business captures its purpose.\n\nExample: Sticky counters at a dive bar = bonus star; sticky counters at a Michelin rated restaurant = minus star(s); sticky counters at a strip club = par for the course.\n\nThis brings me to Quetzal, which completely satisfies what it sets out to be and therefore deserves five stars.\n\n1. pretty good coffee (fair trade, organic, decently made, delicious even)\n2. Lots of plugs! Nothing worse than going to a coffee shop with ample seats, tasty drinks, generous free wifi and only two plugs. *shakes fist* You know who you are.\n3. Lots of room. I hate the vulture culture that develops in coffee shops with limited seating. You know, the old scan the room and swoop at the first sign of fresh meat (or an about-to-be-open seat).\n4. computers for people without laptops (you have to pay of course)\n5. Open pretty late\n\nAnd you can people watch if you need a mental break. Neat exposed concrete at some points. This is my new I need to get out of the house to work on stuff oasis. Also, one of my delights is learning the new wifi password. It changes every day. Examples of some I have gotten: verisimilitude and existential.\n\nI believe they also serve beer for when you have really had enough of whatever crap you're working on. Man... that is priceless.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "I love this cafe! It has very unique drinks and food. Pleasant background music and nice atmosphere. The staff is very friendly and... cute ;) \n\nMake sure you try Moan-A-Latte! My favorite!!! :)", "author": "Vitåliiå V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Nice baristas, chill environment for bringing your laptop (free WIFI) or getting some reading done, and awesome coffee. I love strong coffee, and they use 2 shots of espresso for their small, so i was pretty satisfied with my latte. Their cookies are really good, they even heated it up for us so that the chocolate was gooey to perfection. Found my new go-to coffee shop!", "author": "Angela K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-14", "description": "Terrible service, dirty dining room, ok quality and price. I ordered eggs and waited nearly a half hour for them to come. There was hardly anyone else there this Sunday. (Maybe that should have been a sign?) When I went to check the counter person gave me some attitude and discovered the order had \"just been finished.\" Maybe all the dirty, empty tables meant they just had a rush and the rest of the staff were taking a break? I live in this neighborhood and have been looking for a good breakfast place to frequent. Quetzal is not it.", "author": "Greg J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-01", "description": "Every time I come in theres a lovely crew working, and I get my bagel(s) and coffee fast and it's delicious. Definitely sign up for a customer number I always get some sweet deal. They're awesome and will always come back. \n ps\nMona has worked there for as long as Ive been coming, always has a smile on her face and does some pretty bomb foam art. \nThanks Quetzal for making my day", "author": "Chauntae M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "Great breakfast burrito. Very filling and delicious. A little pricier than I expected though ~$14", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Like a lot of people on a weekday I was looking for a spot to park to get some work done all day. This place was a dream come true...for the first 45 minutes. And then they turned on the big screen tv and played some soccer game at full volume. I thought the only did that at bars? Will not be going back.", "author": "Jeannie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-28", "description": "Ehhhhh.  You are better off going to any other cafe in the city.\n\nThe food here is overpriced and extremely poor.  Their $12+ salads taste like they are made from all canned ingredients.\n\nTheir coffee is poor as well.  I am not a coffee connoisseur by any means, but I know for a fact that the coffee I had here today was the worst coffee experience of my life.\n\nThey make you pay for internet.  Yeah, you have to buy their overpriced food and drinks for their internet that cuts out frequently.\n\nIt's cold as hell in here and it's like 75 degrees outside and all the doors are open.  I don't know how they manage this one, but I'm not surprised.\n\nIf you want an amazing cafe a few blocks away, give Angel Cafe a try.", "author": "Javin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-21", "description": "Don't drink the coffee.  Free trade my ass.  If you want a good cup of coffee, dont come here!", "author": "John T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-08", "description": "Computer table is filthy and wi-fi\nslow and sporadic.  I prefer better\nservice than a smile from the barista.  \nExpect to buy an item every 2 hours to have WiFi.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Great place to come in for a Latte. They are best served for inside instead of to in take-away cups. My favourite Barista works here - Mona. I have been coming to Quetzal since moving to SF in 2011. Its gone through changes. I have always loved their coffees & their internet wifi is super fast and convenient! I really like the plants inside and the garden/patio piece that has been built outside. The owners have changed and Im not sure that I would keep coming here if it weren't for Mona and her beautiful coffees. But this is a convenient place to pop in for coffee or tea if you live in Nob Hill, TL, or close to Polk Street! Lots of seating, I have eaten here a few times, nothing memorable about the food. But this place is decent when you want something that is an alternative to Starbucks, Peets, La Boulange, etc... oh & of course they've always had lightning fast Wifi to boot.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "I went here today and had one of the worst customer experiences Ive had in a long time.\n\nAround 3 pm I was meeting a random person here for a craigslist transaction. Not wanting to seem rude (and being thirsty), I ordered a smoothie. I told the guy twice what I wanted (a medium \"wayne\"), we get to the register and the guy says \"Large wayne right?\" in one of those phony cute upsale suggestion voices. I didnt find it cute at all as im not trying to spend 10 bucks on a smoothie, I gave him my order twice and he's just playing stupid games and wasting my time. As I was paying another guy chimes in with \"Wayne likes to be well tipped\" in a really douchy tone...i guess my dollar tip wasnt enough. After I got my drink, I realized he had charged me for two. I went back to the counter where another medium smoothie sat. I told him Id been overcharged, he countered with \"Your friend ordered one.\". As I wasnt in line with anyone that would be impossible and I told him as much. After 30 seconds of more ridiculousness, he told me he'd give me a refund but he himself would have to pay for the extra mystery upsell smoothie. Was it supposed to be like a guilt trip or something? Im not certain but I collected my money and left, never to return to this place. The worst part is the stupid smoothie I bought tasted as bland as could be...I gave it to a homeless guy who took a drink, spat it out and threw the remainder against the side of Hemlock.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-09", "description": "(See pics)\n\nI was recommended to this place from a few folks who also frequent Caffe Roma. Takes one to know one!\n\nThey have a fantastic selection of coffee, smoothies, iced drinks, a good selection of hot and cold sandwiches, soup and salad, pizza and an attractive selection cakes including Hungarian Coffee cake, almond plum cakes, etc. etc.\n\nI came here around 5-ish pm to have my brunch and had the Randy Baby (chicken breast and turkey with Jack cheese and a side salad) and a Caramel Latte. I picked the food because I know a Randy who is very cool! Good food and very filling. The coffee was impressive.\n\nReally glad to find a cafe with a strip of electrical outlets along the bench with pretty good wifi!! It's a fantastic place to do work on their sizable tables and very background style music. People over there are friendly and relaxed.\n\nIt would be so easy to sit here, eat and work all day!", "author": "T L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-25", "description": "For me, Quetzal is the cafe equivalent of a bad boyfriend that you keep finding reasons to go back to when you know you shouldn't because it'll just end badly.\n\nI live and work very close to this spot, and a friend of mine raved about the food and coffee and internet. So I checked it out the first time, and got a bagel with hummus, tomato, and cucumber. I could only get half of it down, that hummus quite frankly tasted and looked like baby poop. I've worked in the food service industry a lot so I really try not to knock stuff that harsh, but I'm Greek and that hummus made me one sad Hellenic.\n\nAlso: $4 for a maybe-12-oz cup of fresh-squeezed OJ? Suck it, that is not cool.\n\nSo why did I go back? Because I realized they have a wider menu than the baby poo hummus, I always like to give places a second chance, and I'm an orange juice snob and haven't found another outlet for fresh-squeezed in my new 'hood yet.\n\nGot the Quetzal frittata the second time and it was actually really good, just HUGE. HUGE! The size of the plate! Luckily, I love giving my leftovers away to homeless people, and this one was very well received; I found the to-go box totally empty on a curb an hour after I gave it away. Still felt robbed (EVERYTHING is stupid overpriced), especially while I sipped my OJ extra slow to try to make the $4 last.\n\nThen I needed to use a computer since my laptop bought the farm, and so back to Quetzal I went, because I was hungry too and figured hey, two birds with one stone. Decided to try the cobb salad this time and asked about the public computers....they're 16 cents a minute. 16 cents a minute? Who the hell came up with that? That is such a random amount to me. And why, when all of your food and drink are overpriced out the a*s, would you still be charging on public computers when you're a 20 minute walk from the main public library? So I just sadly paid $17 for a salad and my OJ (yes, you heard me) and did the research that preceeded my computer use. The dressing on the salad was way too thick and intense, I frankly couldn't finish it, not even half, and I wasn't even about to give it to a homeless person because it seemed mean.\n\nThe one thing I will give Quetzal is they have a very nice sitting area and lots of windows, and I dig that. Also, some of their employees are super nice. But then there's this one chick with black hair who is seriosly rude as sh*t, she's been there the past two times I went and if she's in there next time I seriously will go somewhere else. I like the older guy and the younger blond dude, but that chick with the black hair, man....not cool.\n\nSo basically, I will probably go back to Quetzal, but I'm really going to try not to for a while because quite frankly I can't afford them. And there's plenty of better coffee shops in the Tenderloin that don't make you feel like you've just been backhanded across the face after you pay.", "author": "Kyveli S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "Edited Review: Gave this place another chance. . . and things have certainly change for the better. Very happy now.  :D", "author": "Audrey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-02", "description": "As far as internet cafes go, it's middle of the road. As with almost every establishment in SF (especially Nob Hill), it is overpriced. However, the staff is very friendly and accommodating. The wifi is regularly down though, which can be a problem. The food is okay. Not the best.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-04", "description": "Stopped into Quetzal recently for a caffeine fix and quick lunch after a long flight into the city.   The place seemed nice enough as I had been there a few years earlier.  Their blended beverages are good and fit the bill.  The Near Death and Heaven were both well made and were quite the pick up needed to get thru the afternoon.  \n\nWe also got a Hummus sandwich which came with a side salad to split.  When the staff delivered the sandwich, he realized we were going to share and said he'd be right back with another plate - but never returned.  The Hummus sandwich was good enough and the salad was a nice blend.  Cheers.", "author": "G M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-22", "description": "Def my favorite neighborhood coffee shop! They have freshly squeezed orange juice that is amazing too!", "author": "Jared L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "I've only been working in the area for about a week and a half and I've already become a patron of Quetzal 3 times!! I am absolutely in love with their Chai Soy Latte - so creamy with the right amount of sweetness and spice. It is a perfect pick me up during my breaks. \n\nI also tried their veggie sandwich- generously stuffed with artichoke hearts, lettuce, and sun dried tomatoes on a soft focaccia bread- comes with a side salad. Though on the expensive side (came out to $9) for a vegetarian sandwich it packed flavored punch! \n\nThe pastries do not look that appetizing though, they look as if they've been sitting there for quite awhile, sadly begging for some hungry desperate soul to purchase them. \n\nI haven't gotten a chance to stay and enjoy the space, but it seems like a great place to get some work on or read the newspaper. Outside they line the sidewalk with seats, I love the additional colorful \"patio\" that extends out into the street! \n\n*Definitely sign up for a \"customer number\" if you plan to come here a lot, they keep track of how many times you come here and give you customer rewards!!", "author": "Eva H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "Quetzel is a little bit of a walk from my place but I used to come here a lot. Mostly, for the smoothies and shakes. Yummy and healthy!\n\nThe breakfast pizza w/ lox and eggs was really good too.  They have wifi too. \n\nIt's a win-win!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-10", "description": "Pretty overpriced, same as other places within this area. I got the Quetzal sandwich and it was ok. The bread was a bit soggy and tasted weird, everything inside it was good. The coffee was decent as well but nothing over the top. I haven't tried the sweets and it seems like they have a variety so might try those next time. The crepes sound really good.", "author": "Marlo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-22", "description": "OK so this place is cool because it has a lot of space, Internet and some cool art on the walls-- but it is a rip off. The staff is nice but the few times I've been here they have been really slow and unaware of the menu.\n\nThe coffee is good, but it cost me nearly $6 for a large iced chai with a shot of espresso (dirty chai) ? It also cost me $10 for one of the worst 8inch pizza's I have ever had. I like to $1 Tostino pizzas I used to eat in college better. It wasn't cooked all the way, the ingredients I can promise aren't fresh or organic like the menu promised, and to top it off they don't even have parmesan cheese. NO PARMESAN cheese and you're trying to sell me a $10 little pizza that contains the worst tasting sauce and cheese I have experienced in awhile. \n\nEnough said. Don't eat here if you're poor, nothing is under $10 unless you want a cup of soup or a cookie. Also, don't get the pizza but perhaps other menu items are better.", "author": "Krista N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-23", "description": "Spacious, offers decent coffee, good beer deals on tap, and curb side patio seating...that's all I can say positively. Otherwise, WiFi did not work although it was free. There was a group of flies congregating around the front door and register. An exterminator was working on site midday. The bathroom, which is not in line of sight of the register counter, must be unlocked from the register. This required two trips on a double-level ramp to let the cashier know the door wasn't open. (To be fair, she had a line of people and she was serving alone.) But the bathrooms themselves were disgusting - smelling of wet dog, cold, damp, dark (the second light bulb was out), then i found a lady camping out in a stall, changing, with the door open. The venue is huge, but if you're in here during the day you'll be blinded by the sun that comes in: There's only one working sunshade  blocking a window with no sun; the window with sun had no shade to make room for a neon beer sign. This place also has an identity crisis - it's an internet cafe, turned brunch restaurant, turned sports bar. I'm never visiting again.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-29", "description": "Quetzal is either, a ramp to the restroom, converted into a coffee shop. Or it is a small business seriously screwed over by the American Disabilities Act.\n\nQuetzal has hands down, the best setup for laptop usage on Polk street. A nice environment, and okay music. Until the night when they blast it. Yet the coffee and serving setup is a bid awkward, where people pay, receive drinks, and cream and sugar their coffee in the same tight spot.\n\nStaff is friendly, even when you have to ask them to buzz you into the bathroom constantly. \n\nThis business is a complete anomaly. Sometimes I feel they are actively trying to get rid of customers. The reason why I say this, when it is cold out, they are blowing the fans with the door open. They use a software called Antemedia to regulate their internet users. I understand a business point to do so, and I do not mind buying something every couple hours. Seriously this software is a disaster, and the main reason why I stopped frequenting this place. When you cannot log in, or you get consistent messages telling you, your password is invalid. Free Wi-Fi (is pointless if you cannot use it.\n\nAlso avoid the carrot cake.", "author": "Mark Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "Pros\nIced Americano was good.\nOutdoor seating and sports television without the expectation of getting drunk\n\n\nCons\nSalmon burger was disappointing only because I paid for and they didn't have avocado (told me when they delivered the sando)\nInternet not accessible wirelessly for me and other patrons.\n\n\n.", "author": "Andres G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "After our breakfast, niece and I walked around the dirty strip of Polk St. and landed at one of many coffee shops, but one of my favorite on that area and street. \n\nI was first introduced to the café's White Mocha by a yelper when I was still learning how to yelp. Now that yelper is at the very end of my friend's list and I hope she is doing well. \n\nNormally, I would infrequently drink a White Mocha. But we had an abrupt thirst for that White Mocha and every coffee shop has their own version and ways of brewing the popular espresso drink. But here, all the coffee and espresso drinks are made from organic fair-ground blend. \n\nI bought a White Mocha and Niece opted for the Caramel Mocha. For $3.80 each, the barista grinds the freshest beans to prepare our respected beverages. Both of our 16oz drinks also comes with \"mountain-size\" heaping of fattening whipped cream, and her caramel mocha comes with a drizzle of the caramel on top of the clouded cream. Her drink can be mistaken for a gourmet dessert from a fancy restaurant. When we first sip our drinks, we get a piece of whipped cream from our beverage on the tip of our nose (sorry, no pictures). We also split a Blueberry Scone for $2.25. I'm also not a scone-guy, but that pastry was surprisingly very moist and show no taste of aridity. We enjoyed our treat in the lounge area with comfortable sofas and lounge chairs.\n\nCredit cards are accepted here. And being an internet café, they do have Wi-Fi access (duh!) with both Apple and Internet Explorer. They also have a frequent buyer's card: buy 10 drinks, get the 11th free!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-27", "description": "Amour \n\nMy coffee lover in the guise of a large white paper cup filled to the brim with something strong, hot and steaming.  \n\nWhen I'm in this neighborhood, which is almost every weekend, I find the intimate urge to step in to this cute slightly Bohemian (think Au Coquelet in Berkeley) Internet cafe for my orgasmic shot of the day.  It has gotten to the point where the barista's glazed look takes on a slight sparkle of recognition whenever I order my double cap.  Add in the occasional slice of chocolate pound cake or the banana strawberry strudel.....\n\nIn addition to offering a warm environment for street escapees, the establishment is quiet and serves to a variety of folk plugged in the virtual world as well as their iPods.  Buy your stuff and everyone leaves you alone.  I've purchased several pounds of the caffeinated love potion here and it leaves a a scented reminder in my car of those recent trysts.\n\nIn addition, I'd like to extend my thanks to W for introducing me to this place, because now I will hit this place even during a massive downpour for my fix.\n\nLiquid affairs.  \n\nLes dangereux  ;o)", "author": "Miika M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-22", "description": "You haven't experienced shaky tables unless you have been to Quetzal. \n\nYou have been warned, bearer of full cups without a lid.\n\nCoffee's decent though, though their latte could be a tad hotter.\n\nDidn't try their WiFi - I prefer to actually talk to friends at a coffee shop. \n\nNovel idea, I know. Try it out some time.", "author": "Roland A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-16", "description": "I've been coming here for years and have enjoyed using the \"park bench\" area that was a new addition in the last few years, in addition to the regular tables and chairs against the side of the building. Twice in the last week, I have attempted to use the outdoor seating, but there was leftover plates of food and filth all over the tables and pidgeons hovering over the area to consume the leftovers and generally wreaking havoc with the consumables. I made an attempt on my own to clean up the mess the first time, and told the staff that I was aware that they could be busy, but that they needed to keep tabs on this as this presented a health hazard, especially with pidgeon feces on the chairs and tables. Apologies were exchanged by one of the female staff members, but no one came out to clean the areas. Today (monday), I was here again, and wanted to have a beverage, but the tables were all filthy and there was the usual plates and cutlery and glasses sitting on tables for a long period of time, and pidgeons converging on leftover crepes and salmon. It was disgusting. The straw that \"broke the proverbial camel's back\" was that one of the pidgeon's defecated on my arm and my leg as I was trying to shoo them away from the area. They tend to lurk above in the girders and wait for leftover food to be left by previous customers. This establishment never seems to clean the tables or make a vigil of clearing them. It's disgusting and the health department should be contacted..", "author": "Timothy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-09", "description": "I only had their sandwich once and it was very yummy!\n\nTheir iced coffees WITH whipped cream are the highlight of my school days. My school is just across the alley and I come here often. My favorites are the iced vanilla mocha and the chocolate overload. their hot chocolates are great too. Quetzal increased my the caffeine tolerance. Starbuck's coffee pales compared to this place. Their whip cream, I find, more sweeter and thicker (the best!)", "author": "Alisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-18", "description": "Food is good. A large group of us came in and the servers got overwhelmed and became disorganized. Take a deep breath people! There are only 10 of us, ordering smoothies, salads, burritos, crepes, and then needing extra plates, to know where coffee cream is... You know, normal stuff. The servers are happy again now that we are eating. The owners should bring a couple of tour busses through here to get these people trained.", "author": "Naomi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "Good selection of teas, and the outlets are plentiful. I've also met some fairly interesting people in passing there.\n\nWould be five stars if Wi-Fi wasn't limited to 2 hours.", "author": "Irene M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "I've, once again, gave the relatively new MGMT at Quetzal another try. And, yet again, I was charged a completely different (and more expensive) price for the same friggin' order. Also, from another new employee (amongst the constantly rotating staff) I receive \"attitude\" when I question pricing. Consistency is key for both repeat customers and those who choose not to return. And, after over ten years of enjoying this location, I will NOT be returning.", "author": "F. W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-07", "description": "Trying to be productive on a Saturday night is just ridiculous...especially on Polk st.  This place didn't make it any better.  When Michele C and I headed here on a Saturday night in attempts to be productive and knock some homework out so we could spend all day Sunday drinking, acting silly and irresponsible, it was absolutely counteractive.  \n\nBesides the wi-fi not working, the red velvet cake made me sick and had me running to the nasty bathroom.  To top it off some crazy guy sat down next to us and drove me and his date nuts by talking loudly about how awesome he is with a horrendous hyena laugh, when really he was just too blind to see his date could care less. \n\nWe shoulda been at the bar across the street like regular folk.  So much for being productive on Saturday night.  It just doesn't work for me.  I belong at the bar or on the dance floor! \n\nWhile the staff were super nice and the space is cool it was frustrating not being able to connect to the Internet at an Internet cafe.  We wasted so much time just trying to get on and stay connected. \n\nEh I'll take it as a sign to never try and be productive on a Saturday night again!  If Michele C suggests so, I'll remind her of this night and easily convince her were better off at the bar.", "author": "Michele O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-11", "description": "Good things about this place are the coffee and the amble amounts of seating.  The service is usually spot on and very friendly.  However, they do get a little rattled when busy.  The wifi has worked every time I've needed, although you do need to buy food or drinks.\n\nMain reason I give it a 2 stars is because of the cleanliness.  It might be because I go there after the lunch crowd, but all the seating is disarrayed and the tables are filthy.  Also, get ready to protect your food from flies (I hope they're not fleas).  If they paid more attention to cleanliness, I would have no objection given Quetzal a 4 stars.", "author": "JM T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "First of all, I love this place. It is so convenient to everything. They have so many different options for drinks and smoothies and fresh juices. Delicious! Mostly I stop in here for a quick beer to unwind after a long day at work. The staff is completely helpful and friendly. I've never had to wait very long for anything either. \nTheir hot tea is delicious. Not pre bagged, it's loose leaf. So tasty! I've only eaten a few things here mostly pastries/bagels but everything was what I expected it to be. I mean you have to try pretty hard to screw up a blueberry muffin. \nI'm here at least twice a week. It's a great place to relax and read a book or surf the web.", "author": "Victoria V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-13", "description": "Yep, it's done-zo for Quetzal.  The food, service, and overall feeling of the place have completely changed.  I stopped by just to see if anything's changed back, but as I sit in the back of the place the thermometer reads 83 degrees, the tables are all covered in a film and haven't been bussed since this morning (by the now fly covered omelet leftovers on the table next to me).  The guy serving was nice, but overall whoever owns this place has completely left what used to be one of the best coffee shops in the city to slide into the abyss.  Maybe having 1 employee will remain profitable, but there are plenty of other great spots to visit.", "author": "Trifectaus J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "I've only been here for smoothies.\nSo happy to know there is a smoothie place so close to my place. That takes cards and friendly service (no thank you H2O cafe). \nEveryone here seems to genuinely love their job. There are regulars I see every morning when I walk my dog,  sitting outside talking about politics or the newest book they read whilst sipping their coffee.\n\nI have no problem with this place. And I see signs that they make food late at night. Sounds good to me.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "A Lower Polk students' dream cafe. The only coffee shop in the area with such a relaxed and generous layout; more windows than wall, spacious seating and tables, a gazillion outlets, healthy plants, and  lighting that's neither too bright or too dim. Quetzal has a lovely openness feeling that you don't often find in San Francisco, yet alone cafes.  The coffee and service is just as impressive AND they stay open until 10pm.", "author": "Miss K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "Bad. Why bad? Try no wifi -- no matter how many times I tried. Add dirty toilets to the mix. Combine that with rather surly staff who were not interested in the customers, over-priced lackluster food items, and a generally unpleasant atmosphere, and 'bad' seems rather a tame epithet. And yet it needn't be so. The location is good, the place has great light, it's roomy and potentially comfortable. But the whole venue needs attention. Badly. I also see some really disturbing comments posted yesterday alleging violence. I won't be back.", "author": "stuart t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "I only ever stop in for a cup of coffee to go, then I'm out.  But it's a delicious cup.  Fair trade, organic, and it rivals Blue Bottle with its deliciousness.\n\nIt's a bit too far a walk from my place to be a regular, but whenever I'm near, I almost always stop in for a quick cup.  So good, and not too expensive at that :)\n\nThere's a Peet's & Starbucks a block up on Van Ness, skip them and head to Quetzal.  You'll be all the better for it.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-30", "description": "We came here to kill time before a show nearby at the regency ballroom . The cashier was awful and unfriendly and could not answer a simple question snot portion size of the quesadilla that were about to order. She was on her phone the entire time we were there . I asked if I could could use the bathroom... She has to buzz me in . When I got inside I went to use the larger stall but it had crap speared on the toilet seat and 0 toilet paper. When I went to use the other stall the toilet seat looked disgusting but I had to go so I decided to suffer through it and squat . The faulty door did not lock as other users had commented . Since the toilet seat was so disgusting I was mainly focused on squaring and not touching anything when the faulty door swung forward and knocked me hard in the face . Within just a few minutes my noise started turning blue and swollen. Awful place with poor service, standards .. Oh and the quesadilla we ordered.. We left 2/3 of it on the plate because our overall experience was so bad we really couldn't fathom stomaching the food . I never take the time to write these reviews but my busted nose and I needed to express how awful this place was .", "author": "Schroeder M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "Dear Quetzal: I see that you are rating yourself with 5 stars while also being equally shady with Yelp attempting to remove my review. I AM WITHIN THE YELP GUIDLINES. I WITNESSED THIS INCIDENT FIRST HAND! STOP BEING SHADY & SUCH A DESPICABLE BUSINESS & CLEAN UP YOUR EMPLOYEES, NOT YOUR YELP REVIEWS! MY REVIEW STILL STANDS:  My friend & I witnessed a male employee of Quetzal beat a homeless girl down in the street last month, while their douchey patrons stood by & just watched it happen. He delivered a few hard blows to her face & head & then after throwing her down on the ground, kicked her in the ribs, back & head multiple times. The girl didn't even try to defend herself. My friend & I called the police, since nobody else seemed to have the decency to care about the small girl crumpled on the ground. Once they arrived a female employee of Quetzal who resembled a gremlin, tried to justify the public beating claiming it was self defense. Right. She told us to go home & then threatened to beat our asses too. My friend is blatantly 5 months pregnant. Keep it classy Quetzal, you belong in the Tenderloin.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-22", "description": "Artsy cafe that's grossly understaffed for it's size. Food takes an outrageously long time, even when it's dead slow on a Saturday. The quality of the food itself is not bad, but not great either, and is grossly over-priced. The outdoor parklet which should be an asset quickly becomes another negative as  panhandlers are almost guaranteed to come bother you for money, or plop down at the next table over and smoke cigarettes.", "author": "Jon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-28", "description": "With the exception of the computers and the high prices, this place reminds me of my days post-college, when I used to frequent Au Coquelet.\n\nI had 40 minutes to kill until work started. I came in, thinking I could eat in with a quick bagel (with lox and cream cheese) and coffee. I bit my tongue at the price, but hoped the food would be worth the price.\n\nIf you're eating in, you get a stanchion and someone will be out with your food as you sit in the back seating area. While waiting for my food, I took a brief look at the rows of computers. I was impressed that they had Macs and large screens. I think this may have been the first time I've stepped foot in an internet cafe in the US. \n\nThere were at least 4 other groups/people who were already seated, waiting for their food, too. After a good 25 minutes, they brought all the food out at the same time. If I had been seated earlier, I would have been livid that they didn't bring my food out earlier. Because it did seem like they waited until everyone's food was prepared before they took them out.\n\nSo, with only 15 minutes left, I scarfed down my food. The lox was so delicious, as was the coffee. Had I known service would be this bad, I would have made arrangements to come in earlier. This is the type of food that I would linger for, especially since the seating was near lots of windows.\n\nIf I'm ever in the area again, I would come back. However, I will make sure I have at least an hour's time.", "author": "Ruiqiu K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-18", "description": "My girlfriend and I managed to kill seven flies during our time here. Won't be coming back.", "author": "James G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "DRINK:\nCoffee\n\n\nSERVICE:\nOrder pickup at counter. At least they open pretty late til 2am Sat\n\n\nATMOSPHERE:\nKinda cool. Interesting black and white movies played on flat screens and on a big projector in the back wall. Interior kinda reminds me of a Panera Bread or something, except it's dim.. and has a few artworks displayed on the walls. Has wifi, but not free. They give you a log in for 2 hours per purchase. Bathroom requires to be buzzed in. Lots of outlets on the bench seating though. But yeah, not ideal work environment for small bladdz like me.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-13", "description": "What I remember from my first visit a few months back:\n\n- The guy sitting next to me having an outside voice video conference with someone. Inane subject matter suggested it could have been via chatroulette. So annoying I glared and said something, which was not well received. Teenagers these days.\n\n- Free computers to use, which was awesome when my laptop battery died. Plus it meant moving away from chatroulette guy.\n\n- Something called the sludge cup which combined a clever name with an awesome amount of caffeine.\n\n- An outstanding waffle topped with granola (which might be why it was outstanding)\n\n- An excellent veggie on chiabbata \n\nAnd what I definitely remember from my second visit yesterday:\n\n- See No Evil smoothie, jam packed with fruits and antioxidant boosts that was perfect for a warm summer day.\n\nAll in all a bit expensive, but worth it, as I was impressed with everything (except chatroulette guy).", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "interesting people watching spot, literally any-kind of.  \ncool spot though. They have  a parklett in front which is cool.", "author": "Lyra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-03", "description": "Interesting seating arrangement. iMac area is pretty neat. 2 hour wifi isn't that hot though I assume you can buy more.  Tuna Melt was fancier than the average coffee shop, served with arugula and daikon slaw.  Hot baristas.  Topped off with a bit of SFPD action outside.  Love the looseleaf tea.  Open \"late.\"  This is the real SF.", "author": "Eric J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-10", "description": "This is one of my favorite hang out coffee place but lately the operation is really getting terrible. What I mean is the way they conduct the cleaning while the customers are still in the cafe. It's not a pleasant smell when you sit there while the cleaning solution is permeated into your nose.\n\nOther than that, the service at the counter is exceptional. I will rate this a 2 star until they stop mopping or cleaning the place while the customers are drinking their coffee.", "author": "Dennis P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-26", "description": "Lots of bells and whistles distract from the coffee.\n\nThis place is a full-service coffee shop. It's a little too eager to please. Coffee, ice cream novelties, computers, ethernet ports, and beer.\n\nI just want good coffee and a little quiet to collect my thoughts. This is a bit much.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-01", "description": "Fairly big cafe with free wi-fi and a bunch of somewhat old iMacs for you to use. They have your usual bunch of lunch items, smoothies, coffees, and hot beverages. They have two flat screen tvs that run music videos and other strange images. In the back they have a really big projector set up. It's weird that they have all these visuals but they seem to run random uninteresting videos.\n\nThe lighting is rather poor the evening I came. Sure a lot of people will be on the computers or on their own devices but if you're a book reader you'd be best off going somewhere else.\n\nThe bathroom is only available by contacting the cashier who will buzz you in. You won't realize that you need to contact the cashier until you walk all the way up an inclined ramp. Can't they simply put a sign at the start of the ramp? Plus having customers buzz-in to get to the bathrooms makes the place feel like a prison. It's not like the bathrooms are super clean or luxurious either.\n\nMy drink was decent. I'm not sure I'd come back unless I needed to use a computer really bad.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "My GF loves this place, she makes me walk all the way over to Quetzal to bring her back mocha. I don't like doing it, but sometimes a girl just has to suck it up and take one for the team.\n\nHonestly, I don't even like mochas, but I love the ones from Quetzal. They also serve fair-trade coffee and they are also vegetarian friendly. Service is friendly, and they probably offer one of the best spots in the city for WI-FI. The menu looks appetizing, but a bit too expensive for my taste.", "author": "emily g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-09", "description": "A really nice neighborhood coffee shop in the heart of San Francisco.  They make a fine mocha and the apple pie was excellent.  A few tables out front provide a great place to sit down and people watch and chat.", "author": "Terry F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-16", "description": "My friend really likes coming here after her Spanish class, so after stopping and City Light Bookstore she asked we come here to read.\n\nOur cashier was perfectly friendly, once we started talking to him...no greeting...but he definitely took care of us the rest of the time. I had the Queztal sandwich - meh - and The Larkin shake, which was good but could really go without the banana. In fact, this was the one thing that bugged me about their smoothe offerings, is that all of them included banana. Call me weird, I know, but the one things I love about Blenders and Jamba is that they manage to make thick smoothes without the nasty banana. \n\nThey offered tones of iMacs to surf the web on and there were lots of people play Scrabble and reading. Very quiet overall, a good place for reading and relaxing. \n\n-1 for the bathrooms. Absolutely disgusting and you have to wait to be buzzed in. Boo\n-1 for the floors that needed to be swept, the dirty napkin I got with my silverware all wrapped up in, and the not so fabulous sandwich.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "I liked this place. We ordered a vegetarian pesto pizza and it was ok. fresh ingredients, but kinda oily and thick crust, but I think that's how it's supposed to be. and i ordered a Quetzal smoothie, which was a heavy with the pizza, but yummy. nice, overall. will try something new next time.", "author": "Afshan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "What can I say; this place is really great. I don't think I can get a better glass of water anywhere else. The glasses are clear and so is the water. But it is not just how transparent the water is but also how good it is. I also enjoy their bathrooms. The first time I asked to be buzzed in, I was a little hesitant because, as you know, all bathrooms are haunted. But once I went in and unzipped my pants I felt emotionally relieved. I laughed for hours. It was great!", "author": "Roberto B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "The owner was pretty nice to me here, he let me stay without ordering anything to check my computer. Which is nice, and of course ultimately you probably will (order something), so I didn't feel bad about it. He said I could stay indefinitely. He seemed like a good man. The prices were high for me, but the attitude was right so I could feel comfortable and respected. I definitely recommend the place.", "author": "Georgina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-09", "description": "You know what? I had never been there before and I was desperate one day when I was away from my computer and needed to get a coffee and an email sent off stat!!! I did a quick 'Internet cafe' search based on fellow yelpers and decided that this place seemed worthy. I was very pleasantly surprised. It is bigger than I had expected and the people were very nice. The design is quite upbeat and I do like the bi -level feel to this place. Plus the Internet/computer rates were very reasonable- I only needed to use email but I would definitely come here to lounge about and fritter away the hours doodling or yelping.\nps: I had a big soft  warm choco chip cookie there and it was Dee-lish!!\nRating: Would definitely go back", "author": "Ms. P S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "Free WiFi, outdoor seating, ample indoor seating, fair trade coffee, really good smoked salmon breakfast pizza, omelets, soups, salads and sandwiches. Doesn't hurt that I can practically see them from my window. They have beer and wine which I've yet to try. Don't think there's refills on coffee but not sure. Really convenient neighborhood spot, plus it starts with a Q ;)", "author": "Faina G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-30", "description": "Service after 5pm is below average at best. The cashier couldn't answer basic questions about items on the menu and no one ended up making my sandwich after ordering. Had to ask the manager to check on my order.", "author": "Corey J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "Awesome staff - very friendly, coffee is pretty good. I usually get an iced coffee and peanut butter bagel. Great place to study. Never gets crowded. Sandwiches are delicious as well.", "author": "Yelperrr M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-01", "description": "Worst customer experience ever! When I was here yesterday my sandwich was served on wheat bread. I came back today expecting the same thing, however, it was served on thick focaccia. I politely sent it back, requesting wheat. My server got very frustrated with me and told me they were out of wheat.  \"Ok I said. I'd like to pay to order something else.\"  He threw his hands up at me and stormed off. I consider myself pretty tolerant having worked in the restaurant business myself, but this was pretty inexcusable. If I am paying $10 for a sandwich, I expect a little more in the service department. Maybe I caught someone on an off day, but I won't be back.", "author": "A J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-15", "description": "I've tried this place four times now, and I really wanted to like it.  Lots of light, internet, coffee, wine and beer, pretty big menu -- what's not to love?\n\nThe experience in the mornings is ok.  So-so espresso, pretty good food, and the service was adequate both mornings I went.\n\nEvenings are a different story.  The wait staff I encountered were rude both times; although there are signs advertising \"open late night\", they closed the kitchen at 9 the first time I went and the whole thing closed at 10.  \"We're open late on weekends,\" they said.  Ok, noted.\n\nPlus, I had arrived at 7:45, so in order to get my last 15 minutes of internet from 9:45 to 10:00, I had to buy something else, which I then had to chug before they closed.  I get why they don't let you sit on your computer forever without buying anything, but it doesn't always work as intended -- or maybe in their view, it does.\n\nI tried again on a weekend evening, and I asked what time they closed.  \"10:00\" was the answer.  Really?  Maybe they should take down the sign saying open late night.  \n\nI didn't say anything though, went ahead and ordered, and when I tried to pay, they told me they don't take a credit card after 7 p.m.  \n\nOh sweet Jesus.  Seriously?  So I should go to an ATM and pay $5 in fees for the privilege of having a beer there?  No, no, no and no.  I canceled the order and left.  \n\nThis is a good example of how small business owners can send their places downhill by making a few bad rules and hiring a few bad staff people.  \n\nI would give this place a pass if I were you.", "author": "R -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "Whenever I go into the city to take my daughter on an outing, we go here. We've met my parents a couple of times. I love the fact that I can charge my iPhone while I'm there. When I'm out and about all day in the city, listening to my iPod or Pandora on my iPhone, the battery definitely dwindles. I also like the atmosphere in the place. I grew up in the city, and I will always feel happy in a place like that.", "author": "Atlanta K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "I used to come here back in the day (read:  last fall), and it was pretty chill.  While the music wasn't rad (lazy ambient electronicamy thing), the hot drinks were cheap, and you could chill out and do work in the back for a few hours.  Plus, they were open late.  I then moved to the Mission, haven't been here since until tonight.\n\nThe drinks are still cheap, but now you just can't just do the latter anymore.  They've instigated a really stupid \"two-hours-per-purchase\" policy for WiFi.  Now don't get me wrong, leechers are a big issue at any cafe with WiFi.  But cafes can handle this A LOT  better than a hotel-style wifi system:  Throttling P2P traffic (not actually hard if you understand basic router mechanics), daily password change that requires purchase (which they were doing for the most part anyway, except during the World Series).  This is like the whole Clipper transfer problem:  Such rigidity is not cool.  We freelancers who can only really work in coffee shops and cafes would rather follow our unwritten laws to maintain a degree of modicum than be told what our limits are.\n\nI almost feel like that, since they've installed the draft beer back in November, they've started catering to the urban yuppie scum bar crowd that takes over Polk Street on weekend nights (the same crowd that got rubbed out of SoMa and the Marina by the irresponsible suburban shit that comes in every weekend and wrecks the City).  And if that's your game, just get rid of the cafe in your name and change it to bar.  At least you'd be honest.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-10", "description": "Incredibly dissatisfied by the internet service here, it's spotty and works slowly...", "author": "Tyrone T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "I never fret when I lose internet connection at my apartment: it's just another great opportunity to go grab a mocha at Quetzal. I wouldn't call their staff \"rude\" at all: they're polite and they answer all my questions. Do you want good coffee from your barista or a hug? They're busy, yeah, but just tell them you need more time to think, if you're not ready. The cappuccino is good and potent, the chai is sweet and boxed, lackluster. They do the mocha best, especially if you sit in - it's kind of gritty and dark, packs a whollop. I made the mistake of having two, one day, and went through the roof, hands shaking, talking in tongues. The sludge cup is also fantastic - basically a red eye (cup of drip with a shot of espresso. One large coffee is plenty, especially if you tack on another shot, which I usually do.\n\nThat, and their daily internet passwords are funny and sometimes oddly relevant to the day's news event.", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "Their coffee is one of the best in town. They have my favorite beer on tap also. The staff are very friendly and nice. I enjoy it every time!", "author": "Sina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "This is one of my favorite coffee shops in this area of SF.  They have a great selection of coffees, a small selection of beer and wine, decadent pastries, and good sandwiches.  Other pros include free wi-fi, a TON of seating and tables, good service, and great hours.  I spent a good 3 hours here enjoying the sunlight, catching up on my reading, and people watching.  I enjoyed every single minute of it.  \n\nThe only weird thing was that you need to get buzzed in to use their bathrooms, and the walk there is long because their ramp to the bathroom winds around.  So from the time you tell the cashier to buzz you in to the time you get to the bathroom door, the cashier might have already hit the buzzer and you might not have made it to the door, which means you have to go back down the ramp to tell the cashier again and run to the door again, hoping to make the buzz!  (Written from experience!)\n\nEither way, a definite must go!", "author": "Tram T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "I had one of their ice cream drink but the drink and pastries list is pretty long. \nThe service is good and it's a clean location.\nThere are outlets to charge your laptop everywhere and Internet is FREE.", "author": "Christian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "Hazelnut hot chocolate.\n\nI think flavored hot chocolate is my new thing after Cocola (Stonestown Mall) introduced me to their Banana hot chocolate...mmm!\n\nQuetzal is a cool, chilled place for yummy treats!\n\nHidden treasures in the TL is always cool!", "author": "Jay C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-16", "description": "I decided to try this cafe out for a lunch and work spot - I was extremely disappointed on all counts. The wifi took several tries to find the network and authenticate using a password an employee printed for me. After connecting, it was terribly unstable, it would disconnect after a few minutes and require me to turn off my network and then turn it back on - over and over again, impossible to get any work done. The food wasn't terrible over-all, but they did serve pretty stale bread with a salad and didn't seem to have clean mugs and utensils. There were also small flies that were a lot more into my food than I was. When I tried to get help with the wifi from the manager (or owner?), he was extremely unhelpful - he seemed annoyed that I was asking and kept saying the wifi was working for him. I really don't understand why this cafe is called an \"internet cafe\" and how it has good reviews. Will definitely not be returning.", "author": "Mandy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-26", "description": "I like the food. Some great healthy salads (veggie tofu is great!), the blt is awesome if you are in the mood for a sandwich ...a unique take on the blt...yum...the atmosphere of Quetzal is cool...Great cafe to bring your laptop and do some work or homework....The place is great overall but when ordering for a pick up order make sure to check and make sure they made your dish correctly...There were a few incidences where the salad was not made the same each time, they forgot avacado, didn't grill the bread etc. Rare but it is worth it to just double check. Customer service is great so I give this four stars.", "author": "S.E. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-06", "description": "The first time I came here was probably a year ago. This is a dicey neighborhood by day, so imagine what happens at night. Polk Street, while safe if you're north of California, becomes progessively seedier as you wade south of the California Street sign...so be careful.\n\nWarnings aside, this place has good coffee and plenty of natural light. One thing I love is that there are power strips attached to the chairs against the walls. Brilliant idea for people who need to charge their laptop. And phone. And headset. And second phone. And camcorder. You think I'm joking but you could power a village in Asia with the plugs here.\n\nThe tables are a bit crowded here, but that was my only complaint. Never tried the internet here or the computers, but rumor has it that the wifi is free. Sounds good to me!", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "I \"discovered\" (meaning I walked past it last night and noticed it for the first time) this place last night on my way to my new found obsession--pho at Pho Vietnam. \n\nThe good:\n++ The décor = industrial meets vibrant latin influence. Tons of potted plants. Natural light. Immaculate, yet warm. \n++ Pretty huge menu--drinks and foods. \n++ The place is big enough for you to feel comfortable sitting here for hours w/ one drink. It's seriously feels like a restaurant. \n++ FREE and FAST WI-FI! They also have a row of iMacs for public use as well--FANCY!\n++ LOTS of power outlets! Hooray!\n++ Friendly staff\n\nThe bad:\n-- Pretty pricey--a pot of tea cost me ~$5-6. Food = sandwiches, brekkie foods, and salads will run you ~$7-10 . Smoothies and shakes ~$5.\n-- The bathrooms--they have to buzz you in (no bueno for someone like me, who pees a lot in general).\n\nMami like!", "author": "Kristine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "Ah Quetzal.\n\nI would not describe myself as a coffee person and I am pretty utilitarian when it comes to drinking it. It has caffeine, it's warm, and it gets the job done. However, Quetzal's coffee is an exception, it's more than just another hit of caffeine and is actually quite nice.\n\nThe service is pretty much efficient and to the point, although every now and then I get to have some fun banter with clever coffee girl that keeps me sharp in the morning. It's a good thing. \n\nThey have a frequent buyers club and for every $12 you spend, you get a coupon which reads:\n\nSEXY SEXY SEXY SEXY $1 OFF COUPON SEXY SEXY SEXY SEXY\n\nWhich needless to say, is pretty good. \n\nThe buyer club comes with a discount as well, I think its something like 15% off. So my large coffee comes to $2.14 instead of $2.37. That's almost a whole quarter! But, over the thousand coffees some people order a year, that can reach about $250.\n\nI have yet to try the food, but it always looks decent. They also serve beer, have wi-fi, and won't bother you if you stay there for hours, which makes this a good place.", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-06", "description": "This place seems like it has a good vibe, but I was just getting some things to go and I felt that the service was just so iffy. I was ready to order and the guy kept skipping over me and letting others interrupt us. The cashier was in a mood that can only be described as bitchy. And if he wants to use the bitchy attitude towards me, go for it. I won't be coming  back.\n\nEven if the chocolate cheesecake made my fat cry in happiness.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "Quick friendly service. Delicious coffee. I spent a week in San Francisco and this was my 1st stop of the day every day. Close to my hotel and better than running to Starbucks or Peets around the corner. \nToo bad it took me til the day before I was leaving to discover their \"Death Wish\" \nYummy chocolately coffee goodness!!!", "author": "Sheri K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "My boyfriend and I have been in here fairly late in the evening to get our evening wind-down/warm-up drinks, but I'd never been in during the day until today.\n\nMy company's un-air-conditioned office is pretty hard to work in during this little heat wave, so they've told us to seek out cool air in coffee shops around the city. Quetzal was my choice, and I'm loving it.\n\nIt's bright, lively and friendly in here - the male barista is quick to take everyone's order and hasn't stopped smiling. And he makes a freaking awesome quetzal latte - I don't know what's in it but I don't really care.\n\nThe wifi is free with purchase, and I've been here 3 hours now with no one bugging me to buy anything beyond that first latte. The music is pretty chill and the place is teeming with locals (the aforementioned barista knows all their drinks), as well as a few relaxed tourists, undoubtedly from the Holiday Inn nearby. Overall, it's very relaxed.\n\nI haven't had any of the food, but a couple of British ladies ordered scrambled eggs which looked amazing, bright and fluffy, and smelled delicious.\n\nWifi strength seems great, plenty of power outlets and wired connections if needed as well.\n\nLove it here! I wish I could work here every day!", "author": "Jess H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "Sunday breakfast time! I'm such a foodie. It was cold and windy but I still wanted to sit outside and enjoy their \"patio\" The staff here is too cute! They are all very nice and attentive. \n\nCoffee ( def needed it)\nEgg/Tofu sandwich-the egg was almost like a soft boiled. It was really good and the tofu combined made it even better. Fruit was exceptionally fresh. Pineapples my fav!", "author": "Lola D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-24", "description": "If you want a good place to read or study and are only getting a coffee this place is perfect. If you want to eat and are complaining about recession prices then there are plenty of food parlors on this street.\n\nThe place is clean (although a little dark for night readers) and the staff is always nice (the owner could smile more)\n\nI don't know why other reviewers are complaining. Would you rather study in one of those 24 hr donut spots? Come on this place far superior than many other cafes that I frequent and they have made attempts at staying open beyond 10 PM which is nice.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "I think Quetzal smells funny.\n\nAnd it's not a funny smell that you can't stop smelling. It's a funny smell that you don't want to smell anymore. Maybe it's just me, but I have smelly issues. Not with myself, of course! \n\nOther than that though, this place is pretty cool. They have computers you can use, even though most of the people who frequent the place probably bring their own computers. The pastries aren't bad. I think I've had something similar to an apple danish. They also have smoothies (YUM!), sodas, and alcohol. The workers are all pretty nice too.\n\nThis place is a one stop shop. You can even stock up on your South American cultural clothing if it suits your fancy, although I'm pretty sure all of those garments have been hanging up on the walls for a while....", "author": "Maureen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "This is the coffee shop around the corner from my work and I visit regularly. I enjoy their many coffee options but rarely eat more than a pastry or a bagel. I tried a breakfast burrito and for 11 dollars was severely disappointed. The eggs looked like egg beaters , had no seasoning and were watery. The burrito was dripping. Despite this snafu, the bagels are good and so are the pastries. Mona , their mainstay barista and basically the assistant manager is always a joy. She Is the reason most people come . Give her a promotion already.", "author": "bradley z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "This is such a cute coffee shop and not over priced (which is a big deal in SFO)! They have quite a selection of teas and a friendly staff. They don't have many pastries but they do prepare food so there are more options. There is quite a bit of seating and there are plugs all over the room to plug in your laptop. The staff is friendly and gives this place a local feel.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-28", "description": "This place looked like it had a lot of potential. But like the prideful Icarus aiming for the sun, this place got burned by their attempt at greatness, and by burned, i mean crisp like the piece of macaroni that falls into the flame when your are cooking mac and cheese, and you cant pull it out till you're done cause you dont wanna stop cooking midway through to save one stupid macaroni.\n\nIts time again people for A. B.'s top five list; Quetzal edition. \n\n1. Do you like cookies? Of course you do, who doesnt like cookies? I'll tell you who, Quetzal. Why? I'll keep telling you. Cookies are one of natures most magical treats, and as such they deserve to be kept in good condition for gastronomical pleasure. Quetzal sadly keeps them in a un-airconditioned box on the counter which gets blasted by the sun all day. So when you get that awesome sounding oatmeal choco chip delish mish. What you get is a rock hard rock of rockiness. And it costs you 2.50. Yup 2.50. For a cookie???????? WTF.\n\n2. onto the food in general. this place tries to bring you the exotic hoity toity fair of an upscale \"progressive\" cafe, and thats all nice and swell, but now when a fucking bagel with cream cheese costs you 3.50, and a salad plate out of a safeway package costs 10 bucks. I mean cmon, if you make this shit from hand, then sure. But dont bend me over for shit you just stick in the microwave and sever on oversized plates. \n\n3. WIFI, we all know im a stickler for wifi, and thats mostly because the tech is so cheap at this point it should be free anywhere in the city (see Seoul, korea) let alone in a cafe. BUT NO! Quetzal makes you pay for the overdone priviledge of wifi, and not only that, they give you a 2 hour limit. So if your right in the middle of something important online and you hit that 2 hour mark, so sorry my dear fellow, you gotta go buy another 2.50 rock to get another crack at it. \n\n4. Atmosphere. Nice and bright ill give em that, but chilly as my uncle vanili. maybe they should have spent less on all these fucking imacs and a little more on some insulation. \n\n5. Flies. They're annoying right? of course they're fucking annoying, their called flies for a reason fool. And Quetzal has tons of these bad ass winged mofos flying around your dome like it was made out of a poop sandwhich ( not good for the self-esteem, ill tell you that much). I dont know whether they have pools of stagnant water in the back attracting these fuckers (health code violation), or whether the snootyness of all these fucking imacs is stinking up this place and attracting these critters, but either way it aint pleasant. \n\nThere you go, my fellow city dwellers. Another installment of A. B.'s top 5 guides of the good and the bad in our mother and protector, old SF.", "author": "A B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-10", "description": "A coffee shop, also serves beer and wine. They have 15 or 16 draft beers. $2.95 during happy hours. There is a park-let outside the store. You can sit outside when it is warm. It is an internet cafe, not only you can use their wifi. They also provided half dozen of Apple computers for customers to use. I came here for breakfast. Food and coffee is OK, not so impressive.", "author": "Emmy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "We go here all the time for breakfast. Lots of seating area, very casual and really nice people working there. They also have a set of computers (I've never used them) as well as WiFi. I'm honestly not sure if the WiFi is free or not, but I suspect it is for anyone who is eating/drinking there. You definitely have to pay (by the minute) for the computer usage.\n\nTheir menu has lots of omelettes, frittatas, oatmeal, yogurt, bagels and other bakery items for breakfast as well as salads and sandwiches galore for lunch and beyond; great coffee and also some unique and delicious smoothies. Try the \"Quetzal Frittata\" or the \"Turkish Breakfast\" - yummy!", "author": "Maren P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-24", "description": "The idea for the cafe is essentially this: let's cater to both the hippie-earthy crowd and the healthy-foodies by selling baroque smoothies with amazonian powders as well as handmade gifts from underprivileged communities in other continents. \n\nHere's why it doesn't work: first, the music.  Oh, god, the music.  Where do they dig up this stuff?  Every song consists of a singer moaning vowels, an indigenous instrument or two, and some synthetic string-chords plunked down in Garage Band.  Many artists are played in the course of a day, perhaps, but they all stick to this theme.  I know saying it's Enya-like is a cliche; but all cliches conceal vital truths.  You can't get work done with that shit. \n\nSecondly, the prices.  This cafe's location is borderline Tender.  Yet the prices are certifiably Nob Hill.  The crowd is neither--a combination of lawyers, silicons and hostel tourists.\n\nOkay, if you're wealthy and new-age, frequent Cafe Gratitude and think \"compassionate capitalism\" is a real phrase, you'll go apeshit for Quetzal.  And admittedly, their Chai milkshake is the bomb-dizzle.  But as a workplace for an atheist skeptic, Quetzal is less than stellar. \n\n(And, if you do the math, you'd only have to buy about 5 smoothies before it becomes more cost-effective to just purchase a blender and some raw ingredients.)", "author": "Guy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "This place was pretty handy for getting some work done.  They don't have their nomad plans anymore, so you're on the hook every two hours for Internet, but it could be worse.  Coffee, beer, pastries, it's pretty nice!", "author": "Francis U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-26", "description": "Quetzal provides a good space for meeting friends with free wi-fi, lots of seats, a complete booze and food menu and, yes, even coffee. And though that $1.60 bagel just barely hit the spot, Quetzal offered me something more important: a lesson in modern society...\n\n*talking with a friend about Noise Pop when a guy from another table suddenly leans over*\n\nGuy: Say, are you a registered voter in San Francisco?\n\nMe: Yeah... (wrong answer)\n\nGuy: Great, what district are you in?\n\nMe: Uh... (think fast, Keane)... Alameda?\n\nGuy: Oh, okay. \n\n*pulls out another clipboard* \n\nGuy: Would you like to sign a-\n\nMe: NO.\n\n*he walks away, but leaves his phone on the table and it starts ringing loudly*\n\n...\n\n*second LOUDER phone rings behind me*\n\nGirl: ...on MySpace... should I message him? No, on MySpace... On MySpace... Sorry... I'm in a cafe.. I'M IN A CAFE... Should I send it to him? ShouldISendItToHim?! HAHAHAHAHAHA! Oh my God... *sigh* Little boys... He's cute. This boy is 19. That's so wrong...\n\nI totally agree.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-24", "description": "I get on the phone with my buddy from Brazil and he's like, where are you?\n\nI'm like, \"Pretty much where you'd expect.  In a coffee shop with hemp sweaters they're selling and a bunch of organic food and free trade coffee and tofu burgers.\"\n\n\"It's what you get when you live in that damn city so full of hippies.\"\n\nAll stereotypes aside, they are a nice outfit that sells generous buckets of coffee that look like cups and well crafted entrees. The prices don't exactly fill me with love for all mankind, but the decor and well-mannered staff more than makes up for it.\n\nLittle did they know I spent the entire day in their hippie shop studying finance so I can widen the wealth disparity between myself and everybody else.  \n\nIrony is my religion.", "author": "Cassio P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-06", "description": "Pros: internet is fast (must purchase something to use it), plenty of chairs and tables for students to study, bathroom is spacious, offer rental computers, electrical plug at virtually every table\n\nCons: food/drinks/coffee is a little pricy!", "author": "Princess N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-19", "description": "LINGUISTICS AND LANGUAGE FAMILY HISTORY 201\n\nIt's common knowledge that a \"quetzal\" is a bird with resplendent plumage found in Central America.  Etymologically, it means \"large, brilliant feathers\" and derives from the Nahuatl language of the Uto-Aztecan language family.  \n\nIn the Indo-European lanuguages, however, \"quetzal\" means \"blueberry scone drier than the ass nuggets from a constipated shitter.\"\n\nAnd that ends today's lesson.", "author": "d s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-11", "description": "The coffee is very good, big selection of loose leaf tea that comes in nice iron teapots, good beers and wine, wonderful cakes and deserts, FREE WIFI, lots of electrical outlets and nice and friendly staff. One of my favorite coffee/temporary daytime office in the city.\n\nIt can be very packed during lunch hours, but generally quiet and nice place to work during the day. The lunch selection is not too bad either.", "author": "Nilesh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-16", "description": "So far they serve the BEST mocha I've ever had. \n\nLove the pumpkin pie too. \n\nYou can browse the internet cause they have 3 Macs I think or you can bring your laptop and work on your projects quietly while sipping Mochas. Love, Love this place. \nThe coffee is a little bit expensive but it's worth it!", "author": "Miss C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-30", "description": "During finals this was my second home... and they took DAMNED good care of me. I became a frequent buyer member, and almost every day, I got a dollar off what I ordered; a good perk for many days of stressful crunch-time.\n\nThe coffee is so good, and the chamomile tea is even better - the best. I never even liked chamomile tea before I tried it here while coming down off WAY too much coffee. \nThe muffins are surprisingly good. I always think of muffins as greasy or dry and as a precursor to an unsettled stomach but these are homemade with organic, high quality ingredients. They're not too sweet and they are MOIST, like cake, almost. The muffins were a lovely find. \nThe veggie bagel is such a good deal for lunch. It's truly filling. It's around $5 or $6. They give you a plate with avocado, cream cheese, cucumber, sun dried tomatoes, regular tomatoes, olives, onions etc. and your toasted organic bagel so you can build it the way you like; it's genius!\n\nThey also get extra bonus points for their free WiFi and for the good grades that I got on my term papers written at Quetzal. Oh , AND their printer has saved my a$$ sooo many times. \n\nLoveLoveLove", "author": "Shanna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-11", "description": "I echo what everyone else said.\n\nPros: Free WiFi\nFriendly Staff (they don't bug you even if you hang out there for several hours)\nGood Healthy Food (good portion size)\nSupports going green and other good causes (like Viv)\n\nCons: A bit pricey (perhaps not as bad if you are a frequent club member)\nlocation (being an out of towner, you need to happen to be in that area)\n\nOverall - a solid place to kill some time or to chill w/ some friends", "author": "Neil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-28", "description": "Socially conscious internet cafe in seedy neighborhood = Quetzal.\n\nI'm a big fan of this place because: it's huge, has lots of light, offers an array of drinks, snacks and foods, has ample seating, lots of outlets and free internet. Did I just score on the cafe hunt? Sweet.\n\nCan't really complain about the place because it really does offer a very convenient and conduce working environment. It's very clean and for the most part, people's conversations are kept to a low whisper. They also don't have an overly loud or annoying soundtrack playing in the background which is clutch.", "author": "Jonny Bobby G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-12", "description": "This coffee shop is  the closest place to my apartment to get really good, fair trade organic coffee. I can't recommend any other drinks or food, but they definitely have a big selection of espresso, tea, smoothies and pastries. They also have pretty adequate out-door seating and free wi-fi. \n\nThe staff is so rude, however. I've discovered they seem better later in the day, and are a little worse in the morning. There is a middle-aged man who works here who is very friendly, but everyone else (who is under 30) has a serious attitude. They rush you through your order, and usually seem annoyed by you. They have a points system where you tell them your phone number and once you spend $12 you get a free drink or something. However, every time I'm here I feel so rushed by the staff that I never even mention it, because surely that will irritate them more. I've been here several times for take-out coffee, so this is an impression I've been given many times.\n\nI want to love this place, and I do enjoy the coffee. The cafe itself is cute so you want to like the ambiance, but the employees make it an always awkward experience.", "author": "Anne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-02", "description": "Boy have i been missing out....I've lived 1 block away from this place for over a year and didnt try this cafe til a month ago!\n\nWhen it comes to what i need from a cafe, Quetzal has all the essentials:\n--plenty of space and light\n--neighborly and unpretentious atmosphere\n--good (organic) coffee\n--free and fast internet\n--lots of power outlets\n--good and mellow music\n--open late (10pm!!)\n\nCute tidbits: \n-They have cute passwords of the day that makes you feel in the know.  It disgustingly gloomy outside today, so the password is \"sunshine.\"  sweet irony.\n-Regulars are assigned a customer code.  Mention it when you order and get $1 off every $12 you spend\n\nFor a person with ADD tendencies, it says a lot that a cafe has the conducive environment to let me get things done.  It's just the right amount of music and company, without the disruption of loud steamers and shouting of orders being ready. \n\n\nSo grateful I am to have found this place that as soon as got settled into Quetzal today, i hopped on yelp to give it a well deserve 5 stars :).", "author": "Kendra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-18", "description": "The ultimate Internet cafe and one of the oldest (10-12 years at least), everything perfectly tuned for serious computing.  Wifi is free, fast and encrypted (they change the password everyday).  Coffee is excellent.  Decor is warm, dark, industrial, modern, Latin, like flowing low hills dominated by a vast wheelchair ramp that snakes past tall banana trees in the multilevel dining room.  Atmospheric music at perfect volume.\n\nAll this PLUS beer and wine, vast (for a coffeehouse) menu of sandwiches, fritatas, pizza, hot and cold sandwiches, and smoothies, and a line of nice handmade Bolivian alpaca vests.\n\nIt's a Mac shop through and through but they'll still let you in if you have a PC.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Came here to upload an important file, and it would get 5 stars if the upload speeds were faster. Speed test on wifi: http://www.speedtest.net/result/823798251.png\n\nGreat place to come for computer use. Lots of space, well-lit, open layout. Lots of outlets for laptops, free wifi with purchase (password changes daily), and half a dozen Macs available for a small per minute fee.\n\nPleasantly surprised by the loose-leaf tea selection. My white tea was just over $2 and was pretty good.", "author": "Todd I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-15", "description": "Beautiful place, UGLY people. After working for about 45 minutes and ordering food and drink twice in that time, the music was cranked to a level we couldn't even shout above. This is an Internet cafe. Three sets of people were working, including my friend and I. She went up to the counter and politely requested the volume be turned down to the previous level, which had been fine. The female worker walked over and turned it down. Immediately a man came out from the kitchen and turned it back up. My friend walked back up and repeated the request; she turned it down again -- when a SECOND man came out, scolded her for doing so and headed for the volume. The female worker pointed to my friend (also a woman) and started to relay, very meekly, the request, and he looked right at my lovely, kind friend and mocked, \"Who? Her? Oh yeah, I heard it,\" and cranked the volume up double the unacceptable level. \"You can go outside if you want quiet\" he sneered. My friend and I chose to leave, and the two men laughed as we did, while the female worker cringed. Clearly they are used to bossing women around and being crazy rude for fun. We had been nothing but nice, quiet customers with a perfectly reasonable, polite request. It was clear that not only do they not give a damn about their customers; they actively hate them. NEVER GOING AGAIN, which is a shame since my friend lives close by, and we'd work there often otherwise.", "author": "Melanie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-12", "description": "I would give Quetzal a better rating, but Robert (or \"Bubble,\" as my coworkers and I used to call him) is always miserable to have to interact with. \n\nHe's moody and snide, and is the kind of person that will say something to try and make you sound stupid, but it won't be grounded in anything. His sense of sarcasm is pretty generic - he's the kind of person who will say \"I dunno, can you?\" If you ask \"Can I get a latte, please?\" And he'll be morose the whole time, like he hates hearing people ask for coffees. \n\nI think their coffee is pretty good, their blended smoothie drinks and desserts are good, and the other people who work there, especially the two owners, are friendly. It's also clean. I haven't tried their food.\n\nBut if you walk in and see a pout, a bowl-cut, a spiky belt, and platform shoes, then be prepared - you're about to talk to Bubble, and he doesn't like you!", "author": "Heidi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "Add-ons/enhancers for their smoothes:\n\nflax seed oil\nspinach \nice cream", "author": "Lijia X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-01", "description": "What an awesome coffee shop! Extensive menus, great food, friendly staff, lots of space, and awesome fresh squeezed juices! This place made my morning.", "author": "Iris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-19", "description": "I'm still trying to figure out how they fit my four dollar and fifty-cent 20 oz. smoothie into a 12 oz. cup.  Maybe it has something to do with the 8 oz. of smoothie that was leftover in the blender...", "author": "Laurence W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-24", "description": "After going to Quetzal for years and years I realized the staff would just never thaw and give me a friendly hello, unless the exceptionally nice owners were there. And for some reason they did away with table service several years ago, which was strange. So... it is what it is. \n\nThe food is great for cafe food but I just wouldn't describe it as homey or cozy, and the plethora of people alone there on their computers make the atmosphere unappealing (to me). But they are an internet cafe, and that's how internet cafes are hmm? \n\nHowever, it's a great place to have a little meeting or grab a bite with a friend, or have a coffee date.  The food and coffee are high quality. Their veggie melt sandwich with artichoke hearts is one of my favorite sandwiches in the city, and they serve a nice salad with all their sandwiches. It's pretty expensive, but they uphold their good quality albeit with a somehow very impersonal atmosphere.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-22", "description": "Enough of the petty complaints you whiners. This is probably the most solid, clean and extensive internet cafe you'll be able to find in the city. Full Apple iMac bar for those without their systems. Lots of nooks for tackling work or just being in your own space.\n\nConsidering it's in the pocket of Polk in between Bush and Geary, would give it even more stars for having such a full capacity of engaging people -- on a Monday night.\n\nSolid food all around and reasonable prices. Great cafe menu and drink options for all ages. Fair trade products, responsibly sourced coffee. Nice to have a tribute to the Quetzal as well. We've always had a great experience with the staff here, so I am guessing the complaining visitors are as peculiar as their reviews.", "author": "Tanya P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-05", "description": "3 1/2 Stars\n\nConvenient and semi-nearby, I come here pretty often to read/study/do my laptop thing here.\n\n\nPROS:\n\n-Their Chicken Cesear Salad is the bomb diggity\n-Free Wi-Fi!\n-There's a huge selection of drinks. They even have yummy ice cream blends!\n-Super nice MACs are available if you need computer access.\n-There's lots of seating w/ tons of discreet outlets to hook up your laptop. (Major Plus!)\n-Most attentive coffee shop service yet. They bring your drinks/food out & the manager helps you out if you have a question/prob.\n\nCONS:\n\n-A little drafty w/ its high ceilings & industrial-like ramp. The place could be much cozier.\n-A bit on the pricier side\n-Neglected bathrooms. I understand why they've gotta do the whole bathroom buzz-in thing to keep out the crazies, but it's a major pain in the butt.\n\n\nOverall, Quetzal caters to pretty much everything I need to get the job done- a place that will always have seating for me, a nearby outlet, wireless, & a variety of snacks to keep me satisfied. I just wish it were a little more comfortable.\n\nNOTE: Beware that this is not a social meet-up spot. This is more of a \"get your shit done here\" kinda place.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-02", "description": "After a long day of legal terminology and heels, the last thing I want to do is sit in a coffee shop with Indian music blasting so loud it'll make your ears bleed. To make matters worse, the  40 yr. old barista was playing DJ, and kept alternating from one horrible style of music to the next. I was thrilled his next musical selection was some type of hippie/ disco, which I'm sure reminded the guy of his psychedelic tie-dye  and \"sticking it to the man\" past. With watered down chai's and slow wifi, this place deserves one star, but I'm feeling generous.", "author": "Gabriella C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Good place for coffee, but not a relaxing spot.  A lot of foot traffic and a lot of people parked at tables with their laptops. Anyway, friendly staff and a good cappuccino.", "author": "Scot W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-08", "description": "I'm not sure how people \"work\" from Cafes.\nI literally lost my office at the end of February. \nMy new one won't be ready until the end of this month.\nSo except when I go in and carve out some room at Jill K.'s desk so she can have the honor of staring up my nostrils, I work from home.\nAnd as lovely as home is, its kind of dark and uninspiring plus some food is constantly calling me to eat it or some dish to wash it.\nIt's a demanding kitchen.\nSo you'd think I could go to an Internet cafe and get things done.\nI've tried it and I just don't get it.\nHow do you get anything done?\n\nQuetzal is the perfect example of this situation.\nDiscounting the heat, as I went on the hottest day of 2007 to date for a meeting where this place was like the inside of a pizza oven, I don't see how anything gets done.\nIt appears people are working but that also includes them working in groups, talking loudly and endlessly on their cellphones where they disclose an enormous amounts of corporate and personal secrets.\nIf you thought Microsoft's plan to take over Yahoo! was big news, you won't believe what I heard at the table next to me while I was fanning myself while the person across the table from me was spewing I don't know what but what I had come to this cafe to meet about.  \n\nWho could pay attention?  There was so much going on and if it wasn't the patrons, it was the vroom vroom of the blender, 2 or 3 going at a time to make the smoothies.  Granted on a hot day everyone was reaching for their healthy smoothies, I did and I appreciated the opportunity to go vegan with my smoothie which I did not or go with a protein, which I did.  The smoothie itself was tasty.\nI have to say, I make better smoothies though.  And for a cafe, I mean a professional place that makes smoothie, I was surprised that they have less luck than me at keeping the seeds to a minimum. \n\nSeeds?  Yes, you see it is far better to have berries than bananas when you are reaching for fruit, less sugar and all but when you mash the berries, oh there goes those little, crunchy, not terribly tasty seeds.  At home the seeds tend to gather at the bottom, here they seemed like they were all throughout the drink.  \n\nThe place is terrifically designed that looks like they could trade out for a nice bar or club at night.  The bathroom on the other hand~~~danger Will Robinson!~~~~~it's some elaborate \"barista will buzz you in\" set up but apparently the barista buzzed someone in who vomited at some point in the day because though there was no evidence of it the place just reeked of it.  Smell aside, it resembled a fast food bathroom on Route 5.  No one gets in here much to clean.\n\nWhich makes me wonder even more, how could you work here?", "author": "Sean S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-13", "description": "Gluten-UNfriendly place. The counter person didn't know what gluten entails, so she asked the owner, who had no idea and stated that only ingredients on the menu was in the food.\nSo I switched the Cheddar with Mozzarella, and the owner asked me about it to explain to him what cheeses were safe etc. After explaining for a bit he didn't really get it and kind of brushed it off and I was starting to get annoyed.\nMy coffee was alright. \nOf course, my Frittata came with an English Muffin... haha, really?  After already explaining that I was allergic to gluten and couldn't have wheat, rye, or barley products. My friend takes the english muffin back and the manager just laughs. I mean yea, they made a mistake and could have apologized, but I don't understand what was so funny.\nBesides my frittata had traces of Mozzarella, and of course a little later I had allergic reactions and my lip swell up, it wasn't pretty. It definitely is close to my friend's place, but next time I will just order a boiled egg, to definitely be safe, as they don't take orders very well here. They couldn't do anything wrong, or contaminate my food with sprinkles of gluten.", "author": "Dat P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-11", "description": "I use to be customer #7, lived exactly one block away, my apartment number was 7....and then I moved with my stupid ex- boyfriend of 7+ years.  Granted we only moved a couple of blocks away, but for one reason or other we just couldn't get our asses for our morning cup of joe.  Actually  I could get me ass there, but his was rather fat and lazy so...you get the point.\n\nAnywho, Quetzal's has the best coffee around.  Now I don't go in there as often as I used to, but every time I do I realize the only thing I miss in the past 7 years is there coffee.  Next time I go in I'm buying a bag to bring home.  Oh yeah and they have internet access :)", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-04", "description": "Update: the 2 hour time limit on wifi can be annoying and is a questionable strategy overall...most cafes don't do this.", "author": "Karl P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-06", "description": "Great coffee, and their breakfast foods are delicious if a little pricey.  The ambiance has shifted to more of a bar or club feel.  It's a little cramped.", "author": "Nicolas B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "I found this place after parking in the Polk & Bush garage.  The coffee is great.  I had the caramel macchiato.  I ordered a blueberry bagel with cream cheese and wasn't terribly impressed. It was pretty mediocre compared to Noah's bagels. Next time, I'll order one of their delicious looking pastries.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "One of the best ginger cookies I've tried and definitely the best rice tea!", "author": "Ira E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-11", "description": "Their coffee (and when I say coffee I mean froo froo espresso beverages) is some of the best in the city  (its so weird to me how many coffee shops in SF make such awful lattes).\n\nThey have this sandwich called the Quetzal club which is $10.  Now, I've barely gotten used to a sandwich costing $7 but somehow I come here with my last grubby little $10 bill and get that sandwich and am HAPPY.\n\nTheir smoothies actually taste like fruit which puts them one up on Jamba Juice.\n\nDo not be afraid of this place with its odd architecture, elaborate bathroom rituals and hulking computer section.  Just eat and/or drink.    Its good.  I promise.", "author": "Flemm F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-19", "description": "Things I love about Quetzal:  \n\n1) Fantastical caramel lattes with just the right amount of foam on top\n\n2) Located around the corner from my ridiculously unpredictable job which has driven me to consume ungodly amounts of caffeine\n\n3) Joining their frequent buyer club means getting a $1 coupon everytime you spend some undetermined sum.  It's actually not undetermined.  I'm pretty sure its determined.  I just don't know it.  I do know it makes me really happy when the guy ringing me up says, \"Oh!  And you've got a coupon today!\"  Yay for me!  But that's not even the best part.  The best part is that the coupon says \"thank you thank you\" along the top and \"sexy sexy sexy\" along the bottom.  I mean, who doesn't want to be told they're sexy?  And not just once, but three times!  \n\nThings I hate about Quetzal:\n\n1) Serves crazy expensive food that I can't afford because I work with homeless teenagers and which leads me to \n\n2) The fact that I have to walk by 10 of my clients hanging out on the corner smoking a joint on my way to get my own fix\n\n3) You have to be buzzed into the bathroom like they're afraid that you could be a cracked out junkie looking for a quiet place to take a hit.  Which is probably exactly what happened in order for them to take such precautions.  And it was probably one of my clients.  Sigh.", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-07", "description": "I'd only ever gone in this place for coffee.  Mocha to be exact.  YUM.\n\nTheir mocha is the best I've ever tasted in the city.  My BF and I used to go to Brain Wash, Peet's, even Starbucks on the way to work for coffee, but finally tried Quetzal and haven't changed since.  Their coffee, mochas, lattes are made to absolute perfection, plus they're nice and HOT...just the way I like it.\n\nAside from the amazing coffee, my mom was visiting awhile back.  She had couple hours before she had to leave for her flight.  We went to Quetzal for some coffees.  I was hungry all of a sudden.  And I've had their croissants and muffins before (very good) but I needed something more substantial.  I read over the menu and decided the fruit and pancakes with walnuts sounded yummy.\n\nWow I was soooo impressed when they brought it to our table.  Tons of gorgeous delicious fruit piled on top of soft pancakes sprinkled with walnuts and an optional very very light syrup to use.  It was so good.  \n\nI'm dreaming about it now... *drool*\n\nAnyway, the owner is the nicest man you'll ever meet.  They actually care about their service and know almost all their customers by name if not by their \"usual\" drink order.\n\nSimply the best.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "Good music, super easy internet access, lots of room to spread out, and if you are not so lucky, the occasional guy asking you if he has B.O even though he does not - which makes for really awkward conversation opener.\n\nSlightly great smoothies too!\n\nOverall, this place will get me by while I await for ATT to install interwebs in my apartment. Bring it on.", "author": "Julie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-22", "description": "This is too bad. I buy a gift card for 30bucks from it and after just couple of times they always said can not work any more .now I have 20$ in the card and can not get them back. Everytime they said next time or their boss is not here , etc bs stuff. Can someone help me how to get my money back?", "author": "Yong Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "I loved the Greek breakfast sandwich: very tasty and using good/safe produce (organic eggs). \n\nThey also sell organic coffees.\n\nNice spot and nice people too.", "author": "Laurent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-08", "description": "Great place to work, save for the occasional city noises (bear in mind that firetrucks going by sound a lot louder in the summer, when they open the windows to the sidewalk seating!).  Bring a pair of headphones and you're set.\n\nWifi is free with a purchase, and you won't get that \"I just paid $3.75 for a stale cookie when all I really wanted was the wifi\" feeling.  Their sandwiches are excellent and they make neat-o frozen fruit \"smoothie\" type drinks.\n\nThe place has power running throughout, on built-in power strips by all of the tables, so you won't be forced to stalk 'certain' tables with AC outlets nearby. Every seat has several outlets close by, so you can charge your laptop, phone, etc. at the same time- a nice touch!\n\nMost folks seemed to be using the wifi, but there were a couple of routers stocked with RJ45 cables  in sight for those without wireless capability.  There were also about a dozen imacs lined up for those without a computer.  You can print too- very convenient for printing out those last minute boarding passes!\n\nThe chairs could be a little more comfortable, but I guess that's nit-picking a bit.  Overall it was an excellent experience.  I'll be back!", "author": "Greg G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-03", "description": "Feeling sluggish?  Large au Lait and a Whole Wheat Sesame Bagel with Veggie Cream Cheese Spread.\r\n\r\nFeeling indulgent?  Mocha and an Apricot Scone.\r\n\r\nFeeling deficient?  Fear No Evil Smoothie (OJ, Banana, Blueberry, Strawberry, Wheatgrass, Spirulina, Echinacea, Siberian Ginseng, Quetzal's Boost).\r\n\r\nNo matter how I wake up feeling, Quetzal has what I need to get me off to a good start in the morning, and sometimes for a pick-me-up in the afternoon.  What makes it special for me is that Wayne is one of the nicest guys in this city and he always remembers my name and usual order in a way that makes me think that I have temporarily landed in Lake Wobegon.  Gosh, I like that feeling.  \r\n\r\nAll coffee is Organic Free Trade, roasted on the premises, so you can feel good about that, too.  \r\n\r\nQuetzal offers salads and sandwiches for lunch, which are good but on the expensive side, so I usually make this my regular stop for breakfast instead.\r\n\r\nIn my fantasy life, I go to Quetzal, pick out a a sunny spot, surf the net and write reviews all day.  It's a place to hang out and take things slowly - however, they handle the morning crowds with ease.  Which ever speed your day is set on, a visit to Quetzal is a fine way to get going.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-10", "description": "I've been coming for a while so far good service. The staff were great.  5 star service. But lately it's gone down hill.  The last time I was there I was next in line and the people behind me were waited on before me. The girl at the register didn't even look at me. She was busy with the register for about 5 minutes. So, that said 1 star.", "author": "Seth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "Where else in the area can you be guaranteed a cafe with a nice big table, some cool music for you, wiFi, and if you stay til lunch, a gourmet sandwich?  The tables are large enough for all your books, or for\nplaying board games (unlike the small circular tables at other cafes).\nThe music is also pretty cool, although often they play the same thing over and over again.  Usually it's OK, except one time when they were playing some Yanni-style music over and over and I nearly walked out.\nThe chicken breast sandwich is scrumptious, served on pita bread, real cloth napkins, heavy silverware, and a healthy salad. $10 is a decent price for that.  There are some problems--for example, to use the bathroom you have to grab the attention of a counterperson. 90% of the time this works, the other 10% it's a drag, because you have to walk back down the ramp to the front,etc. But at least this keeps the bums out of the bathrooms, which is pretty clean (but not up to my gf standards).\nOne night, this horrendous grinding noise started about 6pm. It was their \"roaster\" and it was very disruptive. It went on and on, and after 40 min we asked how long it was going to take, and they said a couple more hours.  ?? We left. Sometimes the place is too hot or too cold, too dim or too bright, and the wait staff is either spot-on, or dim bulbs.\nBut you can't beat the spacious atmosphere, elbow room, decent coffee and usually cool music.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-27", "description": "This is a really nice coffee shop.  I just got a standard coffee when I went there, and it was good.  It's very clean and airy inside.  The coffee is fair trade and stuff too,   ...man.*\n\nI would go there more often, but Cup-a-Joe is closer to my apartment AND serves beer!\n\n*I could go on and on about this, but \"fair-trade\" is not really a good idea economically.  But you hippies wouldn't listen to me anyway.", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-21", "description": "The only reason that I come here is because it's on my way and it has a printer. I don't know what the problem is but one of the Baristas consistently ignores me, generally condescends to me and always makes me feel unwelcome. The others are fine. I was in the front of the line and I tried to order and she asks for the order of the person behind me.\n\nThe Internet seems to have a strict filter on, I can understand not wanting users to be I don't know, watching porn or something, but it filtered out some websites that really weren't necessary.", "author": "K J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-05", "description": "love to come here and spend a day to do work or have serious concentration.\n\nDone it twice thus far but warning that it DOES get busy quickly. and fairly hot if you sit near the windows on a nice day.\n\nThey've got a nice arrange of drinks/foods (pretty good price, food's a little more expensive for what it is)\n\nFree internet as long as you buy something, password changes daily...just ask one of the workers/cashiers", "author": "Jung-Ah Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-27", "description": "Great place to grab a coffee or beer before a concert at the Regency.  Coffee's good, beer's cheap, free wifi with purchase.  Bathroom is annoying to get to and have opened for you.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-18", "description": "Oh hello new coffee shop friend. You are my new home. Upon initial inspection it was a bit mid-nineties New Age-y for my taste with a highly structured chair arrangement, world music (a bit fuzzy, but if I remember right, yes),  Latin American native clothes for sale, and  one curt employee who seems to always be there. (Heidi G. below this post used the right word, \"snide\")\n   I then had their tea, and oh it is amazing. I can drink it all day. Earl Grey by the way. In the pot.  I never pay more than five bucks with enough bagels and tea to make great progress with whatever my shenanigans are for the moment. Also, stable internet, and good people. And that guy, upon further goings to,  I think he's just like that. Really good art in the back.", "author": "Christian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "Been going here for over a decade.  Great quirky place.  I only wish they had better selection of tea.", "author": "Kanai K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-30", "description": "Queztal is hands-down the best place to get work done on your laptop while being comfortable. It has the best layout for computer work: large tables and counters, power outlets galore and even wired access in some spots!\n\nThe coffee is good, the atmosphere is good, the music is not too loud, the staff is friendly, they have beer, and the beer is cheap, they have some food.\n\nOnly downsides: To far from mass transit and no real lunch food selections, ust baked goods.", "author": "Steven P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-12", "description": "I love that I have this place to go to everyday on  my lunch break. The coffee,  smoothies, food, and staff are great! I have been going here nearly everyday Monday through Friday for the past 3 years. I am always welcomed by name, mainly by the owner Wayne and Gaspar. \nThey are very accommodating, if there aren't enough table outside to sit and eat your food, before you can ask they are right beyond you with a table and chairs, amazing service. \nThey have Mac's available to use with printing behind the counter safe to be picked up when you are done. The ambiance if very nice with music that reminds me of my traveling days. \nGreat place, great coffee!", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-08", "description": "Here is my bad first experience at this place.\nI always make it a point to write a review if I have an unusually bad experience at a place.\n\nI just moved to the lower nob hill area and I walk to work near civic center everyday.\nI always get coffee at a place close to my work [Emily's near Polk and Turk] and I always get a small coffee in a medium cup since I need a bit more cream than others and I don't like to keep dumping\ncoffee in the garbage to make space for cream.\n\nSince this place is on my way and never been here, decided to get coffee from here one day.\nI asked the guy taking orders for a small coffee in a medium cup. He gave me just that.\nThen when I was paying, the dark, curly-haired woman at the cashier told me the price for a medium coffee. I told her I am only getting a small in a medium cup thinking that she just saw my cup and\ncharging me medium. She tells me that she is going to charge me for a medium because I am going to use more cream. WOW! that was kind of shocking. Never heard of such thing anywhere. It's like\ncharging you for large fries when you get a small one because you use more ketchup than the other person. Looks like she would rather have me waste the coffee by dumping it and make space for the cream.\n\nObviously I did not like the way she treated me, so told her I don't want the coffee, walked to the new coffee shop that opened at Geary and Polk.\nAsked him for medium in a large cup. He gave me that and said he'll only charge me for a small cup since their cup size is smaller than other places. I gave him an extra tip and walked away as a happy customer.\n\nThis place definitely needs to hire some people with business skills, especially in this economy.", "author": "luvmunky B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-31", "description": "This is probably one of the best, most reliable internet cafes I've been to.\n\nEncrypted, fast wifi, good eats and delicious coffee and they're open until 10!  I have started frequenting this place so much I think the staff might recognize me now and that always makes me feel like a big dork.\n\nOne less star because their food is mad pricey, yo!  I mean, I get it...it's organic and quality and that's cool but like, sometimes it'd be nice to go in there and not end up spending $15 on a sandwich and a drink.\n\nStill, it's worth it to me because the perks outweigh the cons.\n\nAlso, I just love getting lost in thought while I gaze at those little woven ponchos along the wall.", "author": "Carla C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-25", "description": "I don't end up in here often enough but I do have to say that the Quetzal Mocha (I think it's off the menu at this point) was my favourite of them all. It was definitely something I'd treat myself to once in a while but it was good. Kind of sugary but not overly so. Service is prompt and it's a great place to run into if you're somehow without the Internet (as I was for a bit) but aside from that, there wasn't much that differentiates it from a Starbucks.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-15", "description": "My husband and I have been to Quetzal many times for breakfast, on mornings where we wanted to spend time with our laptops. We were big fans at first, also the loyalty program sounded really good, until I started asking for the receipt and saw that they often tried to over charge us. So the 1 USD payback that you get is only just to make you feel good, as you pay more when they charge you the wrong price. \nAt first, they were really friendly too, that was early 2007, but then a new guy started there and he has this slight arrogance about him that i don't like. \nThe food is decent and the wifi is free but since it's not the coziest place in the world and the servers got less friendly and more arrogant, we hardly come here any more.\nI have to mention their fruit smoothies though, which are great. You can get them to go, so no worries ;)", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-05", "description": "I tried to give this place a chance, but each time I have been there it's been an exercise of irritation.  The food is pretty good but it takes FOREVER to get your food. 90% of the people in this cafe are there for pay-by-the-minute computers. So I have no idea why it takes so long to get fed. Oh, wait, there's only like 2 people working there. Annoying. I won't be going there again, at least not for food.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-30", "description": "over priced, poorly run and OSHA violations all over the place. employees, please wash your hands when coming in from a cigarette break and then proceeding to prepare customer food/beverages in front of them.", "author": "Claire M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-18", "description": "Reasonably priced, great staff/service and good food and tea.", "author": "Jimmy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-21", "description": "this is my favorite coffee shop in SF. I always get to meet cool people here and the employees are very nice. Although everything is a little bit expensive than other cafes, I like the taste and strength of their organic coffee. The service can be slow at times but 4 stars for the cute handsome employee with really striking eyes... ;-p", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-07", "description": "Mmmmmm iced coffee.  Mmmmmm FREE iced coffee courtesy of my new little brother/best unemployed buddy Adam M.  Mmmmmm flirty counter staff.\nOUCH!  Those are some expensive eats.  I think I'll pass there and stick with the coffee.  The coffee happens to be free trade which will make some of you feel good and others of you (like me) only care in so much that it also tastes good.  And \"no\" you don't get a tax write off.  I asked.", "author": "Jill D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "Something is amiss in coffeeland... it goes by the name of Quetzal. I drink here somewhat regularly, but there is a undertone here that I can't quite get my hands around. Is it the fact that the place resides in the belly of a new just add water insta-building? Is it the odd footprint of the joint? Is it the need to be buzzed into the bathroom gig? It's probably just the location, it's age, and layout that steals a little from the heart and soul cause it's not Cuppa Joe, but it serves a better espresso.\n\nPluses (is that a word?): good espresso drinks, friendly/cool/laid-back staff, eclectic crowd, free wireless, fairly clean, Apple loyalty, hours. Minuses: strange vibe that lives in the walls, food prices.", "author": "Rob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-15", "description": "Get there early on the weekends, cuz it fills up quickly after 10am.\n\nGreat speciality coffees and breakfast selections, even for a vegan...like my kid.\n\nRelaxing atmosphere.  I never feel rushed.", "author": "Maggie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Possibly the best bbq chicken sandwich in SF!  A little pricey, though it does include a good, fresh and organic side salad. \nStaff is always very friendly and their \"frequent flyer\" discount program shows that they aim to please.", "author": "KT F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-22", "description": "Good coffee. Somebody once stared at me through the window for a long, long time, which was weird. They don't make you feel like you have to leave and the food is actually pretty good. I sort of hate that you have to be buzzed into the bathrooms and the place isn't quite cozy, but I would go back.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-22", "description": "Some people may think I'm a wee bit dull, I suppose my cafe au lait is up there with boring compared to the excitement of Quetzal's menu. The menu seemed stacked with interesting coffee drinks and yummy smoothies just as the walls are stacked with interesting pieces of international items for sale. The ambiance is equal parts cafe, wifi office for those office-less and yard sale all rolled into one. I, for one, prefer the first and that is why I check out Quetzals.", "author": "Vee B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-06", "description": "Man it is relaxing in there!!! Yummy chocolate cake, also love the  art, hehehehe", "author": "Mia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-30", "description": "Considering this is on the lower end of Polk with lots of filth in the area, it is amazingly a  good environment. It does not get the creeps and freaks that It's a Grind gets, however, it has one every now and them....afterall I am there.\nI will say he choice of Asian eye candy is very good, simply because it seems a lot of Japanese live nearby and go in there. They are the hottest of the hot when it comes to Asians, the Japanese certainly put all other Asians to shame....looks, dress, intelligence, man they are so hot.\nNow Quetzal the advantage is the bathroom is locked and in the back upstairs so you have to get buzzed in.  That eliminates the homeless from showering and bathing in there as well as leaving gifts on the floor for next patron to happily find.\nThe selection of food and drinks is plentiful, although I have never ate there just drink my tea.\nAlso they have Apple computers for those to use for a small fee. It is not a bad vibe at all, the kid behind the counter, his name is I think Robert, can come across with tude but does not mean anything by it, just his nature. I will give this place a solid thumbs up, service, ambiance, and of course eye candy", "author": "Kenn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-06", "description": "We were coming from the bar (good thing they sell beer)\n\nI had a salmon and brie sandwich that was fantastic!", "author": "Danielle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-09", "description": "I was just here w/ a friend for coffee & dessert today, after having had Thai food for lunch...It's an awesome place to hang out!! I'd highly recommend this place!", "author": "Annette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-23", "description": "This is my new favorite coffee shop. From the exterior, the shop may appear  small, but I was plesantly surprised to discover the amount of room and space inside. The servers are always friendly and helpful. I never had a problem looking for seating and the background music is not loud or distracting. It is perfect for a coffee date or even to study. \n\nDuring the day, the sunlight floods through the window so it gives it a warm feeling. Cakes, bagels, coffee, & ice tea are all delicious. I had one of their salads and it was huge, but delicious. It's the best when you eat something light and yet it is so filling.The best part is they offer free wi-fi and there are plenty of electric sockets for the wi-fi junkies. \n\nOverall, I love this place so much better than The Grove which is more for hanging out and people watching, but too noisy for me. One final note, the hours of operation are excellent and you never get distracted except for occasional study sessions where people sitting next to you are mediating. Personally, I find that interesting and highly entertaining.", "author": "Sophie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-25", "description": "This is my current favorite coffee shop in the city. Friendly staff, lots of seating, though it can get pretty full, and awesome weird smoothies. I usually  splurge for a muffin or pie, sometime I hope to come by and try their lunch and breakfast.\n\nOn a good day, you can also sit outside. There are bike racks visible from the window, so you can keep an eye on your ride if you decided to bike and not park in the huge parking garage above the coffee shop.\n\nThe encrypted wifi works pretty well, but I've hit some dead spots and had to move around until I could find signal. Beware of the encryption key they give you: make sure they write it down. I was told the day's word was \"albatross\" , but they had spelled it as \"albatrose\" in the wifi router. That was a head scratcher for a few minutes!", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-19", "description": "For a few short weeks Quetzal was my local cafe and I made enough use of it to sign up for the \"frequent buyer\" thing, but not long enough to reap it's rewards.  You sign up with your phone number and are given a four digit code (the end of your telly #) to tell the cashier whenever you buy a drink, and somewhere - magically - a team of Quetzal elves calculates your running total and you're awarded a free drink.  I don't know if you get  a coupon in the mail or if you're surprised with a \"This one's on the house, ma'am.\"  Sadly, I didn't live in the Tenderloin long enough to find out...\n\nThat said, Quetzal is a lovely place to get some work done.  As said before, they have free wifi (be sure to ask the barista for the password, which changes regularly - though not daily, as they insist.)  There are lots of tables and outlets and most customers have a laptop in tow.  I never drank the coffee, but the chai was good and their smoothies are pretty rocking.  They also serve wine & beer.\n\nThe sandwiches and salads are good but expensive for their size - most near $10.  The sandwiches come with a mixed green salad and house dressing, which is tasty but will stay on your breath for hours - beware!", "author": "Holly B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-12", "description": "There has been an addition of lots of tables, counters, stools, etc. The end result is less USABLE seating.  It is almost a health hazard finding a seat.  You may have to walk on tables to get to your seat.\n\nREPEAT seating area is a health hazard.\n\nA parklet has been added outside in front.\n\nLots of different kinds of beers on tap at very good prices.\n\nBathroom access was a BIG problem, but the bathroom has been unlocked now for several weeks. THANK-YOU BATHROOM GOD.\n\nThe pastries when fresh are good.  The cakes and pies dry out once the first slice is taken so the remaining servings are kind of dry.  Often the muffins are dry.\n\nCookies go fast and are very good.  Not sure about the vegan cookies, some love and so don't love.\n\nBagels are very good with many different toppings.\n\nLots of fantastic coffee and non-coffee smoothies. You will have to open your wallet WIDE for the smoothies.", "author": "DAVID R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-16", "description": "Yummy soy chai latte for good studying time.", "author": "kate w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-21", "description": "Like it quite a bit and it's spacious enough that you can usually be assured a seat.  The coffee is pretty good, especially in the fanciful coffee concoctions that come in big sippy mugs.\n\nI dock it a star mainly because it's in a dicey area of Polk Gulch so the foot traffic can be a bit on the confrontational side.  I've had to dodge a few unsavory characters which is tricky when you are on a low tank of caffeine.\n\nAlso the service can be painfully slow when busy - this place is best hit when there is no line queued up.\n\nAlso, access to the bathroom is a bit challenging in that you must ask the staff to buzz you in, so must make a mad dash to the door then.", "author": "Femita J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "Food (Food) : **** (4)\nDesserts : *** (3)\nCoffee, Coffee-like-drinks : **** (4)\nSmoothies : **** (4) (I heart smoothies)\nService : **** (4)\nLocation : ***** (5)\n\nI don't know how to be more upfront about this, but do not go to their bathroom. I suppose there's a reason they have this li'l clickety system of selectively letting selective people in to the selective bathroom. But if you absolutely have to go, hold you breath, do you business and run out.\n\n\"ai\"", "author": "Anand I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-24", "description": "Decent coffee. Friendly-enough staff.  Sometimes, a little over-friendly, if you know what I mean.  But, I love that frequent buyer number thing and that the coupons say, \"sexy, sexy, sexy\" or maybe it is just my coupons that say that.  Hey-yo!  \n\nDownsides: It's not the hang out and be seen kind of place.  The atmosphere is a bit cold for me for me so I don't like staying there.  Takes forever to get your bagel to go and they never have anything but weird bagel flavors left on the weekends past 10am.  Tried the waffle and it sucked. Bland, chewy, ugh!", "author": "MakeUp M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "I come to Quetzal a lot.  Why? Well, usually I'll be somewhere around Market & Van Ness when I decide that I'm really hungry.  My next thought is \"Hey Polk street is right there! There's lots of places to eat on Polk Street.\" This is true, but not really true in the Tenderloin/close to Market section of Polk.  So I end up walking all the way up Polk St. until I get to Quetzal, at which point I'm so hungry all of there food tastes amazing.  Now, it might not taste as amazing if you haven't just walked 20+ blocks to get there, but I couldn't tell you.\n\nUsually I enjoy a toasted bagel with cream cheese and raspberry preserves because it's only $2.00 and it's fast and filling.  Their Chai ice cream smoothies are really really good too. \n\nThe staff is super nice and eager to serve, and they might let you use their computers without paying if you're nice.", "author": "Maia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-10", "description": "They have some of the biggest, freshest salads in the area. The randy baby sandwich is awesome as well. Kind of expensive until you get the food...then its all good. Their smoothies are pretty cheap, filling and delicious. For their coffee, I really appreciate that they have soy milk out so you dont have to feel like the pretentious dick asking for it. \nooooooh and their cookies are super yummy and the girl behind the counter is super sweet.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-29", "description": "I wandered into this industrial-chic cafe after dropping off my City Car Share jalopy in the adjacent garage. The barista/cashier was super-friendly and made me my non-fat chai latte with a smile on her face. The chai itself was way too sweet for my liking (nobody can beat Peet's), but it was nice to check out someplace different. Tons of space for WiFi users and lingering chatterers. I fell under neither category, so drank my tea and split. Interesting joint.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "(The review begins with the requisite pointless bit of Yelp review dialogue that shows how far I have to go as a humorist)\n \n  Scene:  Quetzal Coffee Shop.\n\n  Man at the Table Next to Me:  Boy, I sure like drinking coffee!\n\n  Eric:  Could you keep it down, guy?\n\n  Man at the Table Next to Me:  Excuse me, I have to answer my ringing cellular phone and talk loudly about personal things.  Rest assured, my speech will be filled with profanities, as I am completely unaware of the elderly women sitting at the table next to mine who probably aren't too jazzed about starting their Sunday mornings hearing a stream of obscenities.\n\n  Eric (to audience):  That's okay, I was going to leave anyway.  (exit stage left)\n---------\n\n  While I am bugged by the constant din of people in public on their damn phones who seem completely oblivious to humanity(because I am secretly an old man), I can't say much of anything negative about Quetzal's, which expertly serves up slightly more than the average coffee shop (or cafe, whichever sounds more pretentious).\n\n  The main draw for me here is the atmosphere, which is conducive to an atmosphere slightly slower than the average coffee shop bustle.  They offer internet at several computers, which seems  generous. \n\n  On the negative side, they get my order wrong sometimes.  And I don't even order the silly complex stuff, just normal coffee or a bagel.  But I don't fault them, I'd do a much worse job.\n\n  This is a good place to unwind or wait for the mental blocks to dissipate.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "Hadn't been there for years but was pleasantly surprised by how well it's kept. Great for a bite and a caffeine selections. Nice art and great environment in general. Included wifi is fast. You can work done if you don't get distracted by awesome people-watching in large front windows to a flavorful Street.", "author": "Julia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "This place is pretty great because a) it's organic coffee b) it's huge c) the menu has a wide array of snacks and sweets and d) it's open pretty late.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "A reasonably quiet,  well-light place to snarf wifi, over-caffeinate, and watch the world go by.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-21", "description": "1.  It's way to pricey!  I ordered a bagel with cream cheese and ham and orange juice.  Total price: $12.00   That's astronomically high!\n\n2.  Great internet BUT you are only limited to 2 hours and then it cuts you off.  I always thought that a cafe should always offer free unlimited internet access.\n\n3.  Food is good but I've had better.\n\nI give it a 2.  Lower your prices and offer longer time limits on the internet and I just MAY go back.", "author": "Santiago M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-02", "description": "This is my favorite coffee shop in San Francisco!  The coffee is more expensive than most places but that's because its organic & free trade. \n\nIf you like soy milk, I suggest ordering a medium soy mocha.  Delicious!  \n\nThe employees are so nice too.  They go above and beyond most places to treat the regulars well.\n\nOne negative, when there is a line, it can take a little while to get in and out.  But Quetzal coffee drinks make it more than worth the wait.", "author": "Freaky P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-15", "description": "Latte was good and baked goods were too. House coffee was very weak and needed a shot of espresso to wake it up. Atmosphere was okay but crowded bulky tables made it feel cafe-like. Nice unique offering make this a 3 star for me--good selection of baked goods, iMacs available for free (about 12 of them set up in a separate area), nice unique music, although it was a tad too loud for my liking. Staff was not overly friendly or on the ball.", "author": "Juanita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-08", "description": "Great beverages, food and atmosphere. Good internet connection (with purchase). New extended evening hours that make it a great place to hang out late!\n\nI LOVE this place!", "author": "Briana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-07", "description": "I f'ing love this place now.  They just changed their hours, open until 2:30am... and they have beer.  I usually have tea here after eating dinner.  Now I finally have a good noisy place to concentrate when I have a lot of work to catch up on.  Honestly, I haven't tried the coffee yet but I'm sure it's fine.  Their beans are fair trade and I try and support socially conscious businesses so its a win win all around.", "author": "Nathan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-01", "description": "Quetzal's location on Polk street, between Bush and Sutter, works out great for me since I live within a few blocks, The Cafe takes up a sizable portion of the block, which allows for a respectable amount of outdoor seating. The interior has depth, delineated by ramps and the segmented  public computer section, and plenty of seating as you make your way from the front counter to the back of the Cafe. Quetzal also benefits from an abundance of daylight, which is a plus since I prefer natural lighting whenever possible. At night, the interior lighting allows for reading or studying and is not overly luminous for those who enjoy subtlety.\n\nAlthough I haven't deviated from the standard coffee and tea drinks, Quetzal has a wide selection of pastries, some of which are vegan, and sandwiches. The service I've experienced at Quetzal has always been friendly with a keen sense for efficiency. I once paid for a coffee and received exact change for my $5 bill before I even handed the cashier the money.\n\nFor being located on a bustling street, Quetzal is a great place to stop by if you're looking to find a place to study, enjoy some organic fair-trade coffee, or access the Internets.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-30", "description": "better than Starbucks, better than Peet's, before than your local coffee houses...with it's fantastic staff, delicious coffe drinks, yummy shakes and fantastic food - Quetzal is my favorite place to meet friends, have lunch or catch up reading my newspaper.\n\nWish there would be more locations. 2 thumbs up! Keep up the good work.", "author": "Kimberly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-11", "description": "Awesome cafe. Excellent friendly service, great tasting coffee and cool atmosphere. The place to be on polk street", "author": "Kalen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-31", "description": "Quetzal is one of my favorite places.  The coffee is excellent.  And I've lived off their Meaty Fritata's (My spelling is probably off on that one, but the food is  worth walking in the rain for. )\n\nI've never had a coffee shop, before now, that offered to hold a croissant just for me for my Sunday fix.", "author": "Nikki P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "The lounge was a bit cramped. But there are plenty of power outlets. Purchase required for Wifi access code.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-28", "description": "Quetzal is one of my favorite cafes in the city. The staff make a mean latte and the food is always fresh, delicious, and with big portions. They offer a huge range of awesome vegan baked goods that would impress even the most staunch butter-lovers. \n\nI think my favorite part of this place is how warm it feels inside. Polk street doesn't usually feel \"homey\" but this cafe does. \n\nThe only downside of the place is that sometimes the staff play mariachi music for hours on end. Not the most relaxing choice of tunes...", "author": "Laura K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-09", "description": "New to the city...and without internet, Quetzal is open late (2:30am on Sat) with decent wifi and workspace included with a latte. What more do you need? :)", "author": "Raul R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-30", "description": "Our experience was limited (a drip coffee to go), but we could tell this was THE coffee shop in the area. It had a great atmosphere, a friendly staff, and a ton of beverage options. You could tell that a lot of the people who were plopped down and surfing the web were regulars. If we ever stay in this part of town again, we'll definitely be back.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "Apparently, internet cafe coffee shops in the middle of the day are the new singles bars for the un- and underemployed.  Who knew?  Needless to say, I was quite pleased to discover this, and the house chardonnay is not too bad.", "author": "Mason G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-10", "description": "I have been going to Quetzal for the past month, because I am prepping for major exam. This place seemed like a good fit with many outlets, a lot of available tables,  and unlimited internet with a purchase.\nLately I noticed service in this place has been worsening every time I visit this place. \n\nStaff is just not nice to you, Internet is now limited to 2 hours per purchase, (basically buy more, or get out of here policy) the food is still ok but definently overpriced.\n\nFor a person like me, who needs to spend about 5 hours in this place at a time, the new Internet policy is a major drawback, I don't mind paying for food and drinks when I'm there, but I don't want to be forced to do it every 2 hours.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "This is my fav place to study. They have awesome soup, sandwiches, and friendly staff!", "author": "Kissy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "Great place, good food. They just need to learn how to make a decent mimosa. I got (and watched one being made). It's predominately orange juice.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-05", "description": "some interesting menu items and solid coffee products.  i cannot give them a preferable rating because the use of internet is convoluted and asinine.  you have to be able to provide them with your MAC address and then they go into the back and register this MAC address with their router.  then you have to reboot.  this is a stupid process and can be more efficient.  this is a HUGE pain in the ass when there are customers waiting for service because the same person who is running the register has to do this for you and if you run into any problems you are looking at 20-30 minutes just to get online.  after you have paid for it.  \n\nit's ok if you are just going for a bite and some coffee but don't expect to get online or be productive here.", "author": "W G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-07", "description": "I have been coming to Quetzal for twelve years & it never gets old.  Yes, they have amazing vegan pies, cookies, etc and their espresso is delicious, but what really keeps me coming back is Wayne & his wonderful crew.   They know their regulars by name and remember our orders before we say them.  Not only is the service amazing, but the internet access with ample seating and electrical plugs is a plus.  I could sit here for hours with my laptop (& I do).  Quetzal provides a comfortable, friendly space whether I want to focus for hours on work, or hang with friends.  Oh, & the Happy Hour is nice:)", "author": "Deb Doran D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-28", "description": "Sometimes this place feels more like a library than a cafe.  Most of the people are quietly reading or studying or doing whatever it is they're doing on their laptops.  It's a great coffee shop though.  The drinks are good, service is polite, and it never gets too crowded.  I usually come here when I need to study and I usually get a lot done.", "author": "Dinesh M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "Quetzal Internet Cafe has a pretty nice setup but there are a few things that if changed would make this a 5 star joint in my book. It is sometimes kind of loud in here. It's not that there is the mumblings of a lot of people but that you can really hear other people's conversations from across the room. One group of people speaking at normal conversation level seems to echo. They might invest in sound absorbers, which if correctly hung from the ceilings and critical corners, would absorb much of the ambient noise. \nThe second thing is it's a bit awkward having to order, receive and prepare your coffee right at the register. I get conscious of the people behind me waiting and feel pressure to quickly get on with it. \nOtherwise, I think this place is great and I'll probably keep coming back when I'm in this neighborhood to work for a few hours on my laptop. \nThe coffee is good! Food is pretty good. Sandwiches might be overpriced but the pizza isn't a bad value.\nRight-o", "author": "jason h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-30", "description": "My close friend went to Quetzal to use their computers and ordered a bagel w/ salmon and cream cheese. The salmon had this oily glaze over it and looked funny but she ate it anyway cause she was starving. That night she started to get sick and vomit. The next day she was really sick and went to the emergency room at the hospital. NEVER EVER order food from this place. Beware!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "I had no idea this place existed! We were just looking for a quick post gym bite and at first I thought this was strictly a coffee and pastries place but boy does this place have an extended menu. They even have something called a Turkish breakfast which I was intrigued by! Got the homemade cashew granola with non fat yogurt which was tasty and fiancee got the bagel. Service was quick and prices reasonable. Definitely a good experience!", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "I have been coming to this place since I moved to the city. Totally cool people, made friends with a couple of the guys that work there right off. They are huge and the ceilings are really high, Very nice environment to work in. I have sat in there all day drinking coffee, eating great food, and working on the Internet. Try them out.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-29", "description": "The coffee is very good, good breakfast and lunch selection, the guys that work there are GREAT and so nice and friendly, Thanks Quetzal for wake me up every morning.......mmmm also every afternoon zzzzz....just one suggestion when you guys will have Colombian Coffee?", "author": "Carlos E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-06", "description": "i really like quetzal.\n\ni have only actually eaten here once properly -- i had a gigantic amazing sandwich on fresh ciabatta with crisp greens and zingy sauce.  as a frequenter of this place, i have seen a lot of the food come out to other people which makes me really excited about trying their pizza and some of their breakfast sandwiches (this one guy got this amazing thing that looked like a mix of eggs benedict and an open-faced sandwich)!\n\ni come here often for coffee, hot chocolate and relaxing.  every time, everyone has been exceedingly helpful.  they also have a frequent buyer club which saves you 10% if you are a loyal customer. :)\n\nfree wifi.  macs with internet access. \nfood is a tad pricey for me, but it's definitely tasty.\nnice ambiance, plenty of seating, lots of outlets.\nsolid 4 stars.", "author": "Lily B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-07", "description": "Cool little place. Went there for a quick snack and was very intrigued by the selection of munch-ables and delights. They had food fit for everyone from the picky (like me) to the vegan. Grabbed myself an apple cinnamon muffin and a chai latte. YUM! Will definitely check it out again.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-29", "description": "There employees have 8 hour day plus no lunches or breaks. That's an outrage! Not to mention illegal. I'd have to see a major change in that department before I put a dime of my money in their register.", "author": "chad l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-11", "description": "This place is great! Stumbled in here after trying to go to Leland (they are remodeling, open again tomorrow I think). Anyway, Quetzal is laid back, plenty of room, places for plugging in computers, free wifi, a discount club for regulars and good, prompt service. I've just had the drinks but the sandwiches look really delicious.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-13", "description": "Lovely coffee and nice atmosphere. Good to work here I imagine if you are looking for internet cafes.", "author": "james j."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-03", "description": "This is a cool 'net cafe on Polk--friendly staff, excellent organic/fair trade coffee, and plenty of seating.  They offer a decent food menu, as well.  It's never too busy inside, so it's just the perfect atmosphere to get your work done, read a book, or have a chat over a cup of joe.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-05", "description": "Organic, fair-trade, and delicious vegetarian options are all over their menu. Great location and lots of space inside to sit back, chat, or get some extra work done online. Their internet connection is nice and strong throughout the whole location - my first choice for logging on away from home.", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-10", "description": "This place is good for coffee. This place is good for free internet with your own laptop. This place costs like 10 cents per minute if you use there computers. The pastries are pretty good as well. My friends who are internet cafe users don't like that they have a password that changes daily. I guess they feel guilty for getting the password and not buying something. Some how I always going to this place on those days that there are festivals and I've been day drinking...Thanks Quetzal!", "author": "Stafford J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-02", "description": "I came here when I first got to SF 6 months ago, and still haven't found a cup of cafe mocha any better than the one I had here.", "author": "Deanna C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-13", "description": "I used to study here with my ex... A few things that come to mind: the tables were semi-wobbly, the seats seemed lower than the tables, and the Internet was super spotty... The most annoying thing: little flies that would buzz around our coffee and water. \n\nSeems a bit fishy, no? Nowadays, I only come here if I'm desperate for somewhere to study.", "author": "Travel Swagger R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "This is one of my favorites.  I used to haunt this place frequently when I lived over in Russian Hill/ Nob Hill.  The coffee is great with nice sizes.  I'm particularly fond that they actually give you real, solid mugs for your Joe.  I hate it when those cookie-cutter places only give you paper cups whether you're staying or going...but I digress.\nThe ambiance is roomy and airy with outside and inside seating available and plenty of interesting foot traffic.  A decent WiFi awaits among the plants in this industrial meets Andean-colored decor.  With plenty of wireless for all (there are even some switches to plug into for the net 1.0  types that are still among us- so options are aplenty!!) and plenty of plugs, so you won't be left hangin' when the music stops.\nThe food is very good whether you're in the mood for a tasty sandwich  (love the Quetzal club and Randy-baby),  a hefty smoothie that packs a punch with all the health-club trimmings, or just something sweet.  \nI also like the frequent buyer club they offer.  Anyway, enough reading of this review - go and put it to your own caffeine-cravin' palette!", "author": "Adam F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-04", "description": "Fair trade organic coffee that still tastes delicious?  I'm for it.  Granted, I'm no coffee connoisseur, but Quetzal has not disappointed.  They have a wide variety of coffee drinks and smoothies and a large tea selection.  I haven't had many meals there, but the pastries are delicious (I recommend the lemon poppyseed muffin smothered in frosting).  The ambiance is not incredible, but since it's an internet cafe I tend to have a fleeting feeling of being in another country every time I walk in, and I like that.  Oh, and I've joined the frequent buyer program.  I have no idea how it works, but every once in awhile I get a coupon!", "author": "Christina D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-20", "description": "I was here on Friday, 8/18/06 to meet my date. The white chocolate mocha with thick whip cream is the best. So far, their coffee has a strong chocolate taste. Boy, I thought Starbucks and Peets are on top of my list. Quetzal, you guys really rocks with white chocolate mocha. Keep up the good work, I will come back more and more.", "author": "Linh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-12", "description": "If you need a place to study, this is a very good option. Lots of good-sized tables, sufficiently spaced apart, offer enough privacy and quiet to get some work done. In fact, when I went there, most of the tables had only one occupant and a laptop. If you don't want to bring your laptop, there are nice apple computers - lots and lots of them - that you can rent. \n\nI got iced macchiato and a cookie - didn't like them. The drink was too sweet, and the cookie was a joke and tasted old. So 3 stars for giving a good study place, but no star for the food. (There's a huge menu though, so I might just have tried the wrong choices on the menu.)", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "It is just the perfect distance away from Alliance Francaise and they are super quick so I can grab my mocha and GIGANTOR sized croissant (quite tasty, FYI) and run back to the courtyard to laze in the sun during my mid-morning lesson break.  I do love the cafe at La Cave, but admittedly, I need to get up  and stretch my legs after sitting through the first part of my lesson.", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-15", "description": "This place is okay. I don't care for the breakfast here. It's under seasoned, and the eggs don't taste like eggs. The price is a bit high as well. The desserts are better, but not the best. Although, I do like the drinks they serve here. I haven't tried the lunch here yet.  The staff is friendly, and this place is convenient for a hang out spot with their free wifi. Dog friendly since they have outdoor seating :)", "author": "Mina P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-30", "description": "The new guy with  the dark hair has an attitude up the a**.  perhaps he is not comfortable yet with his gayness???  Who knows but if I see him at the counter I won't go in.\n\n\n\nThe years are showing in this place, could be a bit cleaner, it is always COLD in here and the glare from the sunlight makes it difficult sometimes to see my laptop screen.\n\nLots of scetchy Polk street types here with the occassional lost tourist.\n\nOne time this 2o something chick sat next to me and took out her cell phone and proceeded to yack away very loudly like she was the only person in the cafe.  I asked her to please take it somewhere else or outside and she went into a frenzy.  This is the type of customer you will run into often here so beware of that.\n\nLastly why they keep the bathroom locked I will never understand.  If you want to go you have to ask one of the employees behind the counter to buzz you in.  So if there is a line and they are busy you have to wait.", "author": "t c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-28", "description": "One of my favoriate coffee shops in the city tucked away behind trees and whose sign is unfortunately obscured.  I love the Indonesian/Southeast Asian decor and merchandise, the mellow clientele, and the cool dark ambiance. They have free wireless and Macs for you to use while you gaze outside onto Polk street pedestrians. I'm a fan of the smoothies... albiet they are extremely overpriced.  The all organic coffee I have yet to discover.  I recommend this place for those art students looking to sketch at the corner coffee shop or anti-starbucks coffee drinkers looking to hang out.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-02", "description": "Superb internet coffee shop. Spacious, strong coffee, enough outlets to satisfy even the most hard-core peripheral junk. Music is not too loud or obtrusive, super-friendly staff, great food (loved their selection of power breakfast), and clean. In short, your ideal office-for-one-day.", "author": "Steven D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-13", "description": "the cafe itself doesn't suck, but the layout and the ambiance don't give me a cozy, welcoming feeling. it feels cramped, but not in a cute, French way. it just has bad Feng Shui. come to think of it, i actually like the entrance the best. (3)\n\ntheir food selection seems to be pretty good. (4)\n\nthe WiFi is free, but unfortunately the speed was abysmal the day i was there: 691/302 (1)\n\none of the better points is that they made an effort to put power everywhere. you'll find power strips below the benches - a very nice touch. also, i've always gotten great service there from the staff. (+1)\n\nso, as part of my search to find a great cafe in which to work, i give Quetzal a 3 star rating.", "author": "FrOg SoU P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "Great place for caffeine and non caffeine beverages. Friendly staff and free WiFi makes this place one of my favorite neighborhood cafes. Glad to know too the they support fair trade business practice.", "author": "Pres L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "I'm lost on the name, but the place is chill.  Large space with plenty of room to sit and work.  Coffee is really good, and food is decent.   Free wifi makes my work happen.   Dig it.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-10", "description": "Love the tuna and capers samich here...It's what I usually get. The place is usually busy into the evening hours with patrons on their lap tops. Staff is friendly and the service is quick.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-06", "description": "I really like this cafe here.  Very different vibe to it than your average Starbucks.  Don't get me wrong, Starbucks is great for your everyday grab and go, but this cafe offers a little more ambience for say, a nice lazy afternoon chat over some good food too.  their sandwiches are a bit pricey but really good.  they have these really sinfully good chocolate/mocha shakes that they whip up too.  Very big selection of coffees and teas with daily specials posted.  Service is a bit lacking but doesn't really matter to me. im just there to drink my coffee and use the internet.  id recommend this place for an after dinner coffee place.  it's kinda in a sketchy location but s'all good.", "author": "Peggy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-23", "description": "I L-O-V-E this cafe! The staff is friendly and courteous...the atmosphere is fantastic. I am happy that my apartment is nearby. Best matte latte ever! When I'm feeling blue Quetzal provides that pick-me-up that I require.", "author": "Sherie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-16", "description": "This is a great place to drink coffee & surf the internet.  I have never had problems using my wireless laptop there but my friend has gone a couple times and the internet has been down.  I like their smoothies & pastries but sometimes the service is a little off.", "author": "Mahogany G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-23", "description": "All I needed for internet access to my laptop was one of those cord thingies- and it was free.  They are generous with their servings, but I'd rather go across the street for food than pay their high prices.  The art is interesting- and so is the artist- who spends most of his days in the coffee shop.  Don't plan on getting any studying done if you happen to meet him.", "author": "CAKE E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-29", "description": "It's been said but let me reiterate: free wifi, outlets galore, space, caffeine, and nice staff. Also, close to the Wholefoods with my favorite salad bar. I think I might stay here until I finish my dissertation.", "author": "Jen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-03", "description": "Love this place! It's a regular place I patron, usually after going to the gym. Their lox and bagel plate is fresh and filling, and their orange juice and coffee hits the spot. The fish has not been fresh once in I'd say two years, but that still keeps me bringing myself and friends back for more. It's the perfect spot for coffee and chatting, or just being along reading a book or magazine. The waffles with fresh fruit are quite good too.", "author": "David G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-28", "description": "Good bites and coffee -- although the prices are starting to get a little steep for what you get. Simple breakfast food. Health conscious?...Order the 8 egg whites scramble breakfast. One of the few clean and cozy coffee places on Polk. The staff is friendly, cheerful, and can't be blamed for the prices.", "author": "Dan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "We were walking around looking for breakfast when the \"Organic Coffee\" sign in the window lured us in. I was sold upon seeing the breakfast pizza on the menu - scrambled eggs with dill sauce, topped with lox. It was massive - I only managed to eat half of it, even though it was delicious. \n\nThe frittata was just okay, but smothered in a pretty good guacamole, so it'll be pardoned.\n\nI'm still coming back the next time I'm in SF. Their Shakes menu looked divine.", "author": "Ngoc H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-13", "description": "Their internet won't let you connect to Meebo.com.  They won't let you stream KQED too, sigh.  How does a free-trade coffee house justify restricting their companies internet?", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-24", "description": "I have been to Quetzal possibly 50 times and have nothing but good to say.  It is located very conveniently on Polk street and has lots of outdoor tables which are very popular.  The location layout is long, narrow and sits on a low hill.  The interior has three levels that start with the cafe/ordering station, a little higher is the Mac stations and the final area is sitting area for laptop users and others.  The coffee is great and the staff are very friendly and always quick to help.  I have had many of their pies, etc. and they are always great.  Many of the inside guests are wi-fi users and the place is always busy.  It does quite well as a casual cafe and I see many people eat entrees compared to coffee places.  I recommend it fully.", "author": "Cush D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-04-12", "description": "Very good coffee drinks!!! They roast it there. Location is not good for tourists - locals only dude. There is wifi, but with charge.", "author": "ji k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-16", "description": "I love the coffee here, too bad the service is wishy washy...I guess I have been spoiled by starbucks great service. I also filled out info to get a special # and never received it...I guess they threw my info in the garbage.", "author": "Dee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-03", "description": "Great coffee, great atmosphere and run by some cool people! We spend Sunday after workout hanging out here. The staff is very attentive and friendly, and everything on the menu has been great.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-23", "description": "Its quetzal time on saturdays at 3PM - thats when all the french students at alliance have their break...including me ;) I know their coffee is good and strong...but their hot chocolate is incredible. Some whipped cream on top and I am riding the sugar high for the second part of my class.... Their smoothies are very good too and the cakes and cookies, macaroons, muffins and bagels are always fresh and tasty!! The staff is friendly and remembers your order from a week agao...Awesome", "author": "Conny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-26", "description": "I manage an apartment building just 1/2 block from Quetzal. I love  stopping in for a great cup of coffee and my favorite healthy, high protein breakfast--their Power Fritatta. An all-egg whites baked fluffy treat with tomatoes, cheese, and spinach. Amazing. This place has a neighborly and unpretentious offering of fair trade organic coffee, calm yet fun atmosphere, friendly staff, killer foccocia, garden-fresh salads, and they even have vegan desserts along side other yummy sweet treats. Go for the food and hang out for the atmosphere.", "author": "Sutter House A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-30", "description": "J says:  I take classes at the alliance francaise around the corner and this is the perfect place to stop by for a coffee break or for lunch.  You can sit all day and work there and no one will come bother you.  Service is friendly and pretty quick.  The salads come in large portions but are on the pricey side (cobb salad $12).  The lattes are ok, same price as starbucks.", "author": "Jen Ken H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-04", "description": "Oh, this is so much more than an internet cafe.  The coffee is roasted on site, the salads and sandwiches are to \"live for.\"  Soak in the international flavor of the crowd and consider the central american arts and crafts while sipping a Morrocan mint tea, or a perfect macchiato.", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "Pricey, but they have CLOTH napkins: And portions are the size of your head. Good food, good smoothies...I had a warm, sunlit table by the window in which to bask and enjoy my meal, in the midst of a hectic workday.", "author": "Jo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "I like this place, it has a nice product mix. They've got a little bit of everything, all the basics of a cafe plus computers,retail, beer, gallery space, and potential for some really awesome movie nights (screen projector).  I enjoy having choices, and this place definitely has something for everyone in the group. It's a nice study/hangout/chill spot. free wi-fi. $4 beers on tap. The owner was working when I went in last friday night, really nice guy, he's the older fella. Chat him up if you see him!", "author": "AA B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-21", "description": "I really like this place, good coffee, I want to try them all. Also the people who work there are pretty nice.", "author": "Aidan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2004-11-14", "description": "Best coffee in the city.  Nice atmosphere, but seats aren't too comfy, and the location isn't superb.  Food is good, but a bit pricey for the overall laid back scene.", "author": "Brent H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-21", "description": "It's a nice place to go any time of day.  They have a good tea selection, and their coffee is really good too.  If you have a sweet tooth, defnitely go for the toffee coffee cake.  It's mm mm good.  Make sure ya get it heated because it tastes even better warm.", "author": "Miss T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-08", "description": "This is a great place to see all the eclectic people of San Francisco. Its in my hood and I love to sit outside and be entertained by all the varietals of humanity that wander about Polk Street.  The coffee and food is always fresh and the staff are always friendly. This is a great place to chill.  I only wish they left there outdoor seating available late into the evening.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-19", "description": "Quetzal is a good spot if you have a lot of work to do, want coffee, and need a place to spread out your papers, books, and computer. The atmosphere is mellow enough to get work done, the tables are good sized, and there are plenty of outlets to plug in your computer.  The coffee's decent and the salads are good, but avoid the pizzas (think soggy crust, sauce and toppings with no taste, and some kind of not-so-great cheese slopped on there). I guess cafes aren't the best place to order pizza though.  The cakes aren't so great either (they taste like they came from costco or something). Oh, and minus one star for the not so friendly service (is it that hard to say hello and smile??) and the fact that you have to walk up to the front to ask them to buzz you into the bathroom in the back everytime you have to go...", "author": "SL N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "This place serves up original drinks and warm food, but it's so dark!  I come here for the wifi but to compensate for their floor to ceiling windows facing the sun, they have the shades down for the most part which is tires your eyes if you have to be on a laptop for more than an hour.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-20", "description": "Hip, cool and great food. Eclectic ambiance with decent service. Gotta love the fact that you can pop in, get an awesome REAL latte and use the internet at the crossroads of town.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-05", "description": "This place is so much better than Starbucks or Peet's that you won't go back to them once you try it.  The coffee has a much deeper flavor and a real mule kick.  I get a mix of decaf--delicious and full full bodied--and regular (a boatload of caffeine)  If I drank straight regular, I'd take one sip, fly out the door and slam into the shopping cart of one of the Polk Street homeless.   If I drank their espresso, I'd be permanently on their ceiling.  All this for $1.45 or, if you want a day's worth of java, $1.65.\n\nNice scene in Quetzal's and outside--at the tables on the street it's mainly aging Queens, and inside it's hip people at computers.  And gorgeous hemp South American sweaters hanging on the walls.\n\nThe toilets are very clean but you have to get the counter guy to buzz you in.  BTW the counter guys are helpful but not chatty--they are usually too busy serving the line of Polk Street types waiting for  their coffees.\n\nSo, give this place a try.  If you're a regular, they take the last four numbers of your phone number and after ten cups--not all on the same day, I hope--you get a freebie.  Believe me, after ten cups, you have earned that freebie.   This coffee is so strong that it keeps your eyes permanently open.   And it's so much better than Red Bull and those poisonous drinks that rot your intestines and eat your stomach lining.  Who drinks that swill??????\n\nP.S. Notice that I haven't mentioned the Fair Trade aspect of Quetzal's.  That's between you and your political conscience.  I don't drink their coffee because I want to save the world, I just like the taste, flavor, and price.", "author": "Murray S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-30", "description": "Nice place to people watch while you're having coffee outside, but I have had better brewed coffee.  Staff were somewhat surly....", "author": "Norman B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-10", "description": "I really like Quetzal because of their studious atmosphere and the Carmel Macchiatos ( the best  in Sf so far, but I just moved here so I am not sure how much that counts :P). It's a little chilly inside at times (but then again I am often cold), and the restrooms are not the best, however, it's a great place to get your work/study done. I would not recommend using their internet computers because they are slow and expensive, but they do provide free wifi. You have to ask the staff for a password, which changes daily.  The food is quite good but pricey for a coffee shop. Overall, a great place to get your work done!", "author": "Natalia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-02", "description": "My first review, ever, so here goes. I was in Quetzal towards the end of last February & I got on one of their I-Macs. I was on for a couple of hours, then paid for my time. The total seemed a little high so I mentioned this to the cashier. He said that I was on the computer for 2 hrs & 40 minutes. I knew for a fact that I was logged on from 8:12 to 10:12 exactly. Making it 2 hrs. even. I told him this, & he said that there was nothing he could do. I then went to the manager & told him the situation. He looked into their computer records & decided that even though the cashier had made a mistake, he was going to give me \"the benefit of the doubt\" & refund a mere $5, even though at 16 cents a minute a 40 minute discrepency would amount to $6.40. This all may not seem like much, but the experience really soured me on the whole place. I was talked down to & treated as if I was trying to cheat the system. They have good food & a great ambiance, but keep track of your minutes if you use their desktops.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "One of my favorite coffee shops for getting some work done--solid lattes, lots of choices for food, and friendly service. I've never had trouble finding a table, the wifi is reliable, and outlets are abundant.", "author": "Katherine N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-11", "description": "am i the only person who thinks this place is expensive?  its $10 for a smallish sandwich and a tiny salad.  i was stil hungry so i went back and got a vegan oatmeal chocolate chip cookie.  mmm.  $2.74.  one cookie.", "author": "pete c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "this place is awesome. love the smoked salmon platter. great beer and wine selection. always a place to sit inside and out and theres a public parklet on the other side of the sidewalk if all the outside tables are taken up.  hard to stray to any other of polk streets awesome cafe when this place has got so much to offer", "author": "Liz R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-12", "description": "This is my go to place when I need to focus on my school work, in a relaxed, quiet environment, and perhaps grab a beverage. The staff is very warm and welcoming. I think that their smoothies are a little pricey and aren't the tastiest but they have plenty of other options. I will be back to Quetzal tonight to study for my finals. To get the key for the wireless network you must make a purchase.", "author": "kevin g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "Good spot for a first date.  Spacious, well-decorated, wi-fi.  Wasn't too crowded in late afternoon on a weekday.  Friendly/flirty staff.  Yummy-looking baked goods, I'll have to go back for some of those.  Cocoa was delicious.  And environmentally and socially concerned, yay!", "author": "D G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-12", "description": "Great service and dependability.  A place I wouldn't mind going to everyday.", "author": "Violet B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-08", "description": "i am at quetzal every single day. yes- they know me and ask if i'm ordering the usual when i walk in the door- which is an aspect i could take or leave. sometimes coffee shop employees are WAY too friendly and i am a big fan of feeling anonymous, but they're good people in there, so i'm tolerant.\nsome times we grab coffee to go and sometimes we sit at the tables out front- i usually prefer the former. one cannot sit outside without being constantly harassed by the neighborhood ya-hoos for cigarettes or a light or change- it's infuriating. \nthe coffee is damn good. great even. it's organic and exquisitely made. perfect temperatures, foam quality, and espresso pulls. it is without question the highlight and only reason to go.\ni guess i dig the pastries- they're humongous. i don't know if i've ever finished a muffin or a scone. and they're not sticky skanky sweet like at corporate places. \nall in all-\ngreat coffee. not a place to kick it.", "author": "gertie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-08-22", "description": "When you need a place to sit and work all day, this is it.  You may have to go to the counter to order but no one will bother you for hanging out for hours.  Food is fresh stuff - healthy but also tasty and appealing.  For those like me who don't drink coffee, a real find - an extensive TEA menu!  I also like the imported handi-craft goods for sale - fun to look at even if you don't buy.", "author": "Lynne H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-05", "description": "Yes, this place is big so it is not difficult to find a place to sit. The downside though is that it's maybe too big because it did remind me of a library. The menu is good and so was the coffee. The place is comfortable but lacks some warmth", "author": "sonali p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-29", "description": "great place to study, if you like the cafe feeling. the hot sandwich's rock my sandwich world. they are delicious, and all come with a small mixed green salad with raspberry vinaigrette dressing. mmm you gotta go here!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-30", "description": "this place is always bright, clean, and half empty (i mean half full).  i feel good drinking the fair trade coffee there.  i love how this is in the part of town that's FAR FAR FAR away from the tourists.  it's not easily accessible for others except if you live in the hood.  AWESOME.   (i am just being nasty.  the 1, 3, and 19 drop you off right at the corner).", "author": "Arthemis G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-15", "description": "they have free wifi and plenty of routers to plug into.  they have breakfast and protein shakes.  which makes it a perfect place for me to get work done.", "author": "Alan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-11", "description": "good food, lot of choices!  The veggie cheddar melt was awesome. A bit pricey and over-crowded, however definitely worth it. Free wifi is always a plus.", "author": "Beena A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-01", "description": "went there today after looking at some scary apartments for rent in the tendernob. it was nice to climb out of graffiti-land and suddenly find ourselves at such a cute clean cafe. i had an apricot scone. it was surprisingly dense and tasty without being loud in a buttery or sugary way. shanghai smoothie had a really nice fresh strawberry taste, but the texture was a little weird, almost slimy. coffee unremarkable. and it was kind of annoying trying to find a table-- the place wasn't busy but almost every empty table was covered in dirty plates and mugs, and the dirty dishware was still sitting out when we left half an hour later.", "author": "Dana D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-11", "description": "I could not believe that after YEARS of being a loyal customer I went in to the cafe last nite to ask for a small coffee and if it could please be put in a large coffee mug. I was told that can not do that, and they charge by the cup! I get this if the cup is paper and is counted in inventory, however it was for there, so it would of just been a coffee mug. Also I was kicked out of the WiFi WHICH is not longer FREE, 2 times in less than an hour. The staff is no longer happy and fun, but under the thumb of a greedy money driven partner that has destroyed the atmosphere there. The place is no longer clean, especially at nite! or the partner is doing sometype of work inside the cafe, painting tables, or some other lighting, or something, it just no longer is a calm relaxing place to enjoy one another get work or homework done, which I find so sad, another place destroyed by greed, and LACK of customer service at its finest. Also the quality of the food has really dropped, that is if they remember to place the order, or if you can get anyone to help you after 9pm, usually the staff is cut by that time, leaving you wonder if they are even open, because no one is at the counter. I'm so sad to see a great place go to shit, that's the reason there is no more Memphis Quetzal. Lucky us got that partner, dude this is not Memphis it's San Francisco - we support our locals with respect, as they should treat us, Starbucks is looking great and tasting better every day I don't return to your establishment.", "author": "liza m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "Great coffee, friendly and efficient service. Could be a better lay out for sitting in. Tables are very close together. I usually get mine to go though so am pretty happy!", "author": "Paul R."}
