{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-23", "description": "Favorite seafood place hands down! We got there at 4pm for HH and it's 50% off wine and $1.50 oysters. Matthew was shucking oysters and gave us the lowdown on each, which really made the experience special and felt like we were \"oyster tasting.\" We also got the mixed mussels and clam in white wine broth with their amazing bread and were so happy. Really cute place that reminds me of a beach town restaurant. \n\nAlso, they have funnel cake for dessert. So cool! Will definitely come again.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "There is a popular Crepevine-like place across the street. For about the same price, you can eat at Red Hill Station and have a very nice meal with excellent service in a stylish dining room. Is there really any doubt about where you want to go?\n\nTwo of us split a hamburger, which comes with a salad (we had Ceasar) AND fries, onion ring and fried dill pickle. And before all that we were given fluffy and delicious bread with olive oil and vinegar and some probably house-made green olives. \n\nThe burger came on a homemade brioche bun. I am such a sucker for house-made bread. Sooo good.\n\nThe server split plates for us (without us asking and no charge) which was really nice of him. The portion size was huge- we couldn't finish our split meal!\n\nMy only (minor) complaint is that the kitchen was pretty slow, but I wasn't in a hurry.", "author": "El B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Two words...hidden gem! \n\nI never really walked around Bernal Heights and it's small local neighborhood. It's not huge, I mean it's at most 5 or 6 blocks but the quality of restaurants and local bodegas are awesome! A friend took me here the other day since we were in the neighborhood and recommended we stop here for happy hour. Well they have $1.50 oysters during HH and I'm NEVER saying no to that. \n\nSo normally, HH oysters anywhere else whatever the house has on stock. Any other specific oyster is  normal price. Red Hill is $1.50 on any of the oysters on their menu. This includes Kushi, Kumomoto and other beautiful seafood gems they have on stock. Yea.....that's unheard of! We ordered a dozen for sure! \n\nTurns out their menu is off the charts good! All their seafood items looked great such as the squid salad and the trout tartare! We made friends to the table next to us and the lady was so sweet she gave us a taste of the squid salad! Definitely need to order that next time! Also, all their pasta is handmade fresh daily and we ordered the carbonara. Normally I don't care for cream sauces but this one was light and not too filling. The bacon they add to it cuts thru the cream with a bit of saltiness and crunch which was a good addition. \n\nThere are other restaurants in the area that I want to try but this place hit all the marks on the menu offerings. Yes, I'll be back! Small place that does it right!", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Found this little gem via Yelp (of course)\n\nThe service is great here. The staff was so helpful and very hospitable especially when they knew we were from out of town and it was our first time. \n\nHH starts @ 3pm and we arrived just at 3pm so it was perfect. Those $1.50 oysters and 6 dollar glasses of wine really hit the spot. \n\nThis was our first time and last (for a while) so we had to go big or go home. You have to get their mini clam chowder pot pies. I love the pastry puff with the steaming clam chowder. It was the perfect size as well. We shared their carbonara. Cream sauce was a little bland, you just have to eat the bacon with every bite to get that kick of taste. It was still good! Also definitely big enough to share. \n\nWould recommend and would def come back for HH if I'm ever in the Bay Area again.", "author": "Brittney T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Pretty good. \n\nI like their happy hour. It's 3-6pm, 1.50 an oyster and I think half off wine and beer. The oysters are pretty good. \n\nThe hot pot pie clam chowder tho! That ish is bombdiggity. It was a highly rated item on yelp and I can see why! It did take a long time for it to come out but it was good. The dough was buttery, airy and flakey(in a good way). The soup actually had a decent amount of clams and the creaminess was perfect for me. I don't like it when it's too thick but this was just right. However, I did notice it was slightly on the salty side but I didn't mind that too much. I'd still come back and get this again and again.", "author": "Ngoc P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Delicious place for food! \n\nThis restaurant is small and adorable. The breeze comes in very nicely and makes the experience even more enjoyable. \n\nWe all ordered pastas for lunch and they all tasted amazing (pesto, vongole fettucelle, and carbonara). \n\nI would definitely recommend this restaurant again. Pasta noodles were well made and all the ingredients are very fresh. Clams were awesome and super fat.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "Very expensive, oysters didn't seem fresh. Well, only the ones from Washington, the rest were fine. It was painfully quiet and the service was awkward. No one asked how my meal was... because no one really cared. \nI won't be back.", "author": "Pepper P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Saturday, March 31st, 2018: National Oysters on the Half Shell Day\n\nSince my group of four loves celebrating national food days, we decided to take part in oysters! I did a Yelp search for oyster happy hours and found Red Hill Station. (Wasn't sure if there were going to be any as it was a Saturday.) We headed over and arrived around 4:45pm. We didn't have a reservation, but they had a table avail if we promised to be done by 6pm. This was just a post lunch (or brunch) / pre dinner snack, so we said yes!\n\nThey offer Happy Hour Daily, 3pm - 6pm. The specials are $1.50 oysters and 1/2 off all beer and wine on tap. The oyster selections for that day were: Shigoku, WA; Kusshi, WA; Miyagi, CA; BeauSoleil, NB. We decided to start with two dozen of all varieties. I can't recall which ones were which, but I typically like the smaller oysters the best so our last dozen were just those. In the end, we got 3 dozen HH oysters ($54).\n\nFor drinks, I decided to get beer. We had been drinking all day and it seemed like the easiest thing to drink. I wanted something light, so I went for the beer from Headlands Brewing Co, California ($4). Not sure which beer it was as they have a rotating selection on tap, but it checked the box in terms of the type of beer I wanted. I actually ended up having two pints as everyone else was nursing their one drink. The rest in our party got the following: Triennes 2016 Rose, Provence, France ($6); Giornata 2015 Sangiovese Blend, Paso Robles, California ($6); Marin Brewing Company, Point Reyes Porter ($4).\n\nThe table next to us got something fried (which smelled amazing), so we decided to order a Side of Onion Rings ($7). This was the last day of my deep fried food ban, so I couldn't try them. They did give us complimentary Olives which I had a few of. Very tasty. I think I was the only one eating them.\n\nGood place for oyster HH with wine and beer. Great specials! This place is tiny, so make sure to make a reservation if you plan on going. It may be a wait without one. We just got lucky that day. I guess oyster and us were meant to be.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "A solid seafood place. We started with the red trout tartare, which came with some chip type thing (although based on the menu, I was expecting more of a crostini type thing). The trout was  fresh, soft, and had some nice acidity, but was a little more of a ceviche than a tartare.  We also ordered the clam chowder pot pie and the sausage and clam pasta.  The clam chowder was solid and creamy, and the poufed pastry top was phenomenal. The pasta was rich and heavy- the sausage had a nice kick to it, but the flavors slightly overwhelmed the clam and pasta. In retrospect, our eyes were a little larger than our stomachs, and we probably would've been ok with two dishes. Overall though, everything was delicious and I definitely want to come back and try some of the other dishes.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "Great place for fresh seafood.\n\nCiopinno - 5/5. My favorite thing on the menu. All of the seafood was cooked well and had just the right textures: the mussels and clams were soft without being too chewy, the shrimp was separated pan fried and had a light springyness to it, and the fish was very soft and buttery. Best cioppino I've had yet (granted I've only had this two or three times before), and would be my go to thing here.\n\nOyster dozen - 5/5. This came in four different varieties, and all of them had nice contrasting textures. Everything was fresh, and it came with three different sauces so you could put whatever you want on it.\n\nBaked Cod - 5/5. Fish was baked just right, and had the same soft and buttery texture as the cioppino. Veggies were solid as well.\n\nNew England Chowder Pot Pie - 4/5. The pot pie makes perfect sense with the chowder, but the soup was unfortunately a little bit too salty for my tastes. Tons of clams!", "author": "Nevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Randomly came across this place on a Saturday night and it did not disappoint. About a 45 minute wait for two which wasnt too bad considering we didn't make reservations. Not much waiting space inside so you'll be stuck sitting outside in the cold if you don't have a reservation. Good for a date night or special occasion. \n\nVery fresh and flavorful seafood. Order the clam chowder pot pie, chefs choice oysters (we sampled three varieties & it seems they rotate) and an order of mussels. The Pesto fettuccine with scallops - one of the specials at the time - was also delicious. Scallops were perfectly seared and the pasta was all homemade. Great execution and overall dining experience.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "We were in the mood for seafood and found this place via Yelp reviews.  It definitely lived up to its reputation.  The food was incredible.  There were 7 of us and we shared the Red Hill Special seafood tower, and the mussels with chorizo - both of which we all would highly recommend again.  I also ordered the pasta with andouille sausage and clams - I was pleasantly surprised with the presentation and the flavor which exceeded my expectations.   For dessert, we tried one of everything and passed it around.  The dark chocolate dessert was my favorite - and paired well with the Barbara on tap which we ordered by the carafe.  It was a very fun and memorable night - and a shout out to our server Brian who was awesome and gave great service to our group.", "author": "Jaime N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-20", "description": "I didn't eat there, so I can't say anything about the service or interior, but the one food that I did eat was okay.  I had the Pesto Pasta with Shrimp.  The sauce was fine, but the nuts that was mixed in with the pasta didn't really do anything for me.  I think it was there to give a little textural change, but it did nothing to enhance the flavor of the dish.  Definitely should have ordered a more seafoody dish since that is what the place is known for.  If you want to come here, recommend that you don't come for the pasta and eat seafood instead.", "author": "Arianna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Made reservations for 7pm on a Friday night very easily. Called in the night before...doesn't look like they have a reservation system in place...so you gotta call them! They play it old school here, people.\n\nAnywho, small and cute date night or small group dinner spot (I'd say 4 or less). This place is known for seafood, and it was seafood we got. At a glance, there were so many good options that we decided to go share everything. \n\nPot pie? Check (got the mini)! Pan seared fish? Check check (seasonal trout, not salmon). Mussel app? Checkkk (dip the bread! DELISH). Andddd pesto shrimp fettuccine - your guess? Yup, check. Pasta was perfectly al dente. But the star of the show? Seriously, their homemade bread. Seriously. It was SO good. Asked for it a few times...plus they also gave complimentary homemade(?), homegrown(?) green olives. Well marinated and delightful to start the meal with. \n\nAll the food was topped with a carafe of sauvigion blanc, at the recommendation of our waiter. Didn't taste that great at first sip, but amazingly got better as I began to eat all the dishes. So, in the end, well played, waiter friend. \n\nSo why 4 stars? Man, parking sucks. In the middle of Bernal and parking is a bit of a nightmare. The doors kept open the whole dinner time and let's be real, it's cold af in SF. But would I come back? Abso-freakin-lutely.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Bacon  carbonara and $1.50 3p-6p special oysters is good. Chowder pie is ok and no on the trout tartare . Service is ok, hit or miss.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "Pretty good. Great deal for oysters! We got two rounds of oysters. Daily happy hour was great! Totally worth it. Small restaurant and the service was alright. I think our waiter was new to the role. I would definitely come back for the oysters.", "author": "Brittney P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "This is a great place for seafood, I love their oyster happy hour. But the real star of the show is their homemade bread. It has a texture unlike any bread that I've had before. It was dense and airy, with a powdery exterior that felt like the extra flour on mochi. They include a dipping tray of olives and oil and balsamic alongside it. The bread is the perfect conduit to these delicious accompaniments. Did I mention I love olives? If you're still reading this review, let me just finish and say Red Hill Station is a solid spot and if you ask for more bread, they'll gladly give it.", "author": "Alton Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Menu is a bit limited, but from making reservations to eating AMAZING. The staff was nice! Food was exceptional RED MEAT TROUT YUMMY YUMMY. But pesto pasta  completely over dressed toooooooooo much oil. But my boyfriend would never complain. Must visit! I will return. Suggest bring your own wine especially if your an experienced drinker. Great for couples nite out! Can't wait to try more. Thank you!", "author": "Tippy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "So awesome. What an absolutely great find.\n\nSnuck in here with four of us for dinner and couldn't have been happier to find a spot. Really enjoyed some oysters as well as the hamachi crudo. Really enjoyed the mussels as well. Kids even had a really incredible burger.\n\nThis place is so sweet with great service and incredible ambience. Will be back again and again.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "I was specifically looking for oysters on a Saturday around lunch time and Red Hill Station popped up in my Yelp search. They do have a daily happy hour from 3 to 6pm where oysters are $1.50 each but I couldn't wait as I've been craving oysters for weeks now. \n\nWhen we walked into the restaurant, the first thing I smelled with oysters - that briny sea smell so I knew we were in the right place. \n\nWe ordered a dozen oysters and they were perfectly chilled, so fresh and salty, and came with good ol' mignonette and cocktail horseradish sauces. I also tried the Bay Shrimp Salad and these shrimp were also very fresh and it was a heart salad with the avocado with a hint of bitterness from the grapefruit. Their burger was surprisingly good. It's a thick patty of angus beef and it's just amazing with the house made brioche bun. I recommend adding an egg. \n\nService was casual yet very friendly. Our food took a bit longer to come out considering we were 1 of 2 tables in the restaurant when we ordered and the first table was already dining, almost finished with their food.\n\nNonetheless I just saw some Yelp photos of the Calamari Caesar Salad which looks amazing. I'll be back to try it!", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "I'm really wrestling with how many stars to give RHS. Part of me wants to go with 2 just to keep the crowds down because THIS PLACE WAS AMAZING. Seriously. The only thing I would have done differently was to go in at 3 pm to catch their amazing happy hour specials on oysters and beverages. Live and learn.\n\nThe oysters were fresh, great and the sauces provided were wonderful. Lori got a whole crab with drawn butter that was perfect. My crocette was eggy, cheesy perfection and the salad that came with it was not some thrown together side salad. It was nuanced and sang in my mouth. All this with a beautiful white wine that brought it all together.\n\nAs other reviewers have mentioned, the marinated olives and bread they bring you on arrival are perfect. \n\nThe service was friendly and enthusiastic. I felt like I was a guest in someone's home. \n\nSo, yes. 5 stars and we will be back as often as possible. Lori and I agreed this place was a real find in this charming neighborhood.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Great food. We had the pasta with shrimp and another pasta with bacon bits. Really tasty. Also got the trout and mashed potatoes it was decent.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Ahhh Finally got to try this place! There's usually a wait, but when we went for happy hour on Monday, we didn't have to wait. \n\nAmbiance: casual\nHappy hour: 1/2 off draft beers $1.50 oysters \nService: excellent \nPrice: reasonable \nFavorite: Grilled Calamari Salad\n\nI definitely need to go back. Can't wait to try their carbonara", "author": "Gwen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "My friend who lives in Bernal was nice enough to share this secret with me. I LOVE Red Hill!! We go almost weekly. The staff is so great. I'm greeted with a hug when I get there. The food is fresh and delicious. I highly recommend anything raw followed by the chowder pot pie...UGH! craving it right now! Highly recommended and great for a Sunday brunch with a carafe of wine.", "author": "Bjorn P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-09", "description": "Such a bummer. Came here crossed the city just for the restaurant. They should write it in here that - only accepts reservation", "author": "Min T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "Oyster selection is good and fresh and, best of all, clean! Love the green olives and bread they start you with..\n\nGot the hamachi tartare to start (I loveeeee hamachi) which was good, but with very strong basil. Personally not a fan of the cracker/chips they give you with the tartare though - they're not crispy and light. More like a dense cracker.\n \nThe pastas were delicious. They totally satisfied the craving my roommate and I had. Nicely al dente and made right in front of our eyes (since we sat at the bar facing the kitchen). The clams in my pasta were perfect - they also don't hold back on the seafood portions which is great.\n\nWould recommend as an easy, quaint restaurant. Nothing too fancy or complicated. Intimate and cozy.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "I haven't been to a good place like this since I left Canada. The service is very nice and the waitresses are very patient. The food is exactly how I imagined them to be, only better. They give you 3 kinds of sauce for your oysters. Their burger is a classic order that is just perfect. I recommend going during their happy hour from 3 to 6 to try more stuff at a lower price.", "author": "Kalin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "The only reason I rated 5 stars is there is no 6! Got lucky with 2 of the 4 bar seats without a reservation, but will make one next time. Everything about this place is wonderful and I believe Matthew really is the Rockefeller of oysters. Bravo Red Hill...Bravo!", "author": "Ken M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Excellent happy hour with $1.50 oysters from 3-6pm daily. You get a selection of four different oysters at the happy hour price. Oysters are fresh and delicious. Our server really delved into explaining each varietal and flavor profile which I appreciated. $6 glasses of wine on happy hour are also an added bonus. Although the happy hour is limited to oysters and wine/beer, everything else as well made for a wonderful experience - friendly service, a delicious clam chowder pot pie which I highly recommend and no wait. This may be our go to oyster happy hour...it's different from Bar Crudo, but the oysters are definitely on par, plus no wait!", "author": "Aleyna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "5/5: food quality, location, interior design, clean restroom.\n\nPricey however please do not let that keep you from dining at this wonderful, tasty restaurant.", "author": "Kamonica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Matthew is outstanding!  He is so knowledgeable about the oysters, not just the type, but what combination of condiments would bring out the flavors and the order to eat the variations so that we get the most out of the meal.  Thank you Matthew!\n\nQuality of the oysters and food were excellent.  This place is a gem and definitely worth a night out.", "author": "Kim P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Came here two nights ago for dinner. I was eager to try this place for a long time. I made reservations and we got a table for two. The place is cozy and well lit on the main drag in bernal heights. The vibe was bright, fresh and clean. The staff was really friendly and let me and my friend catch up before pushing us to order. We shared the mixed dozen oysters. They were really fresh and tasty. Then I got the mussels in the white wine sauce. The bowl was huge and the broth was delicious. They really hit the spot and left me feeling quite full. I tried a bite of my friends burger. The meat was good, the bun was soft potato bread with sesame seeds on top. I finished with a glass of Porto which was fantastic, sweet and tangy. Overall it was a good meal. I will most likely be back.", "author": "Anne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I am so happy that I was able to try Red Hill Station for my birthday dinner! From beginning to end, it was a delightful experience! We arrived early so we were able to take advantage of their happy hour wine and beer on tap. Benjamin, our server, was such a doll! He went out of his way to get our party started!! We also were able to take advantage of the happy hour oysters, which were delicious and beautifully presented. After more than two dozen oysters, we ordered a salad and some fries to snack on. My daughter eats a vegan diet, and the chef went above and beyond in preparing her a delicious pasta dish that she said was one of the best meals she ever had!! I sincerely appreciated the chef's efforts to be creative, as well as Benjamin's thoughtful attitude in making sure she was accommodated. I ordered the clam chowder pot pie and it was so delicious!!! Definitely, a must try if you go here! I saw they had a mini version, but I wanted leftovers and was not disappointed when I ordered the full size--it was a very generous portion!  Benjamin brought out two mason jars (with a candle) for my birthday dessert and both were delicious--a creme brulee and an amazing fudge cake concoction! \n\nI just moved to this neighborhood, so I will definitely be back!! Great food, great happy hour, and most of all great service makes it all worthwhile!! Thanks, Benjamin!", "author": "Sheila K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "I've been coming for dinner ever since it opened.   Food is on point with all the freshest seafood offerings every time i come.   Awesome friendly staff.  A true neighborhood gem!", "author": "Cesar L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-30", "description": "PROS:\n* Great service from the staff, very attentive and friendly\n\n*Cute place and nice decor\n\n* Fettucine w/ Manila Clams in white wine butter sauce: This was my favorite dish and all the flavors complimented each other  very well. \n\n*Cioppino: I really liked this dish too, they were not stingy with their seafod. The mussels and clams were plump and meaty, and it also included alaskan cod, which was a nice touch. The soup was more on the saucy side and tasted quite similar to a marinara pasta sauce\n\nCONS:\n*Sometimes cozy means you're sitting too close to other patrons and can hear every single part of their conversation. \n\n*It was nearly impossible to get a hold of them to make a reservation. It took us 4 phone calls w/messages and 1 email. Go figure. Didn't help that when we finally got a real person to respond, she sounded annoyed. \n\nOverall, their dishes were good, not great. I wouldnt mind coming back to try their other dishes, but I'm also not in a hurry.", "author": "Ivy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-24", "description": "I don't give one star reviews to restaurants lightly. I'm a former floor sommelier and know what goes into dinner service BUT this was special.\n\nI went in last Friday for my brothers birthday. We had my two young kids with us so we had reserved the back room months in advance. We even called and confirmed earlier in the day and told them we would get there a bit early for our 7pm reservation.\n\nWe get there at 645 and the room isn't empty (fair enough) but when we ask if it will be ready at 7 we get an answer of \"they could be in there all night.\"\n\nThis was bad enough but they didn't apologize they were very matter of fact. Another table in the main room gets set up (I wanted to leave as my kids are small and I don't want to ruin other diners meals if they act up) and right before we sit there the room empties and we get offered that. So I take my kids back outside for 10 min as they set it up.\n\nWe get in there (30 min late) and are ready to eat. The waiter seems nice we get some wine and order. Things seem to be going up then IT happens. A cockroach runs across our table and my wife lets out a shriek.\n\nWe look in the corner and see a second one.\n\nWe tell the waiter and he says \"where did it come from?\" \nand \"I'll tell the manager\"\n\nNo manager came. No one checked in after that and everyone was done. We left full plates and got out of there. I had to hang my head into the kitchen to get my check. \n\nI would have made a fuss then but my brother was really bummed that his former favorite restaurant was such a shit show that I didn't want to exasperate the situation.\n\nGood news is the pizza place next door was open so we didn't starve!!", "author": "Dave D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "I was on the border of 4 or 5 stars.\nI ordered their trout dish.\n\nAlmost immediately some olives and bread made their way to my table. I don't generally like olives but the olives that were served were excellent. The bread was some of the best restaurant bread I've had.\n\nThe trout dish itself was great. The fish was cooked perfectly, and the veggies were all delicious, but I definitely wish that it had some kind of sauce or a bit more spice especially with the mashed potatoes.", "author": "Lars Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Fabulous in every way!!!!\nWe loved it!\nService \nFood\nAtmosphere \nEverything!!!!\nWe found it on YElp and it lived up to the other reviews!\nWe will be back for sure!!!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Very cute and intimate place serving fresh seafood :-)\n\nRed Hill Station is a great casual restaurant that delivers with their food.  The open kitchen allows diners to see the skilled cooks prepare delicious meals with the various live seafood\n\nWe ordered the Red Hill Special along with the steamed mussels/clams in garlic white wine broth\n\nRed Hill Special - Oysters, ceviche, tartare, dungeness crab, and shrimp.... special indeed.  Every seafood was extremely refreshing... the oysters with the perfect brininess and sweetness.... the ceviche with the right amount of citrus and acid.... the dungeness crab with the perfect doneness\n\nMussels/Clams - I'm not a huge mussels guy but i might be a convert.  Paired with the extremely flavorful broth, the mussels were pretty stellar and actually took center stage compared to the clams\n\nRed Hill Station, i had a great first meal during my trip to SFO... i'll be back to try your desserts :-)", "author": "Peter H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Unbelievably good!! I've from Albany NY and in my travels, occasionally I'm pleasantly surprised by food that's really special. This is one of those times. Hands down, this was one of the best meal I've 'ever' had. I kid you not. Delicious, unique and a great presentation. The staff was knowledgeable and attentive.\n\nTraveling on bus and having caught the fog blowing over the hills at sunset from Burnel Hill (don't miss the short hike up!) I found this packed local joint 2 blocks from my Airbnb accommodations (373 Moultrie Street, San Francisco, CA 94110 - which was terrific). I started with a half order of their Monterey calamari salad and having happened upon a seat facing the kitchen, I watched 2 chefs work in perfect choreography, intent while smiling, they enjoyed their work. I'm use to calamari, deep fried, no garnish but a lemon, usually overcooked. I'd watched the chef gingerly flipping and tending to several rolled up pieces of something... over a high flame skillet and then realized ... they were cooking my calamari! Delicious and on an elegant bed of greens, terrific. \n\nI sampled four oysters from different parts of the world. Catch these at happy hour and they're just $1.50 each, I paid $2.50 each. They tasted smooth and creamy.\n\nFor dinner I had the Alaskan True Cod, it flaked apart beautifully and was served over delicious mashed potatoes with the slightest hint of nutmeg, and a unique blend of exceptionally flavorful vegetables. Absolutely delicious!!\n\nFor dessert I had a funnel cake with fresh strawberries blueberries and homemade whipped cream. \n\nAnd after that gastronomical eat festival I walked up to the top of Burnel Hill Park and spotted a coyote perfectly silhouetted along the ridge line. What a night.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "Excellent neighborhood restaurant. Great seafood and pasta. Service is spectacular. Try the carbanara. Bacon and seafood. Winnet", "author": "Eileen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "The carbonara is excellent. New fave neighborhood restaurant. I'm determined to make their oyster Happy Hour soon!", "author": "Deirdre G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "If I have the option to give a restaurant 6 stars it will be this place. A friend of mine who used to live in the neighborhood took me to this restaurant. The staff is just amazing, the nicest people, amazing service. We ordered the octopus salad to start with, I will eat that any day, everyday. I ordered the pesto pasta with scallop, it was delicious. The home made pesto was made with perfection, the toasted almond was just the right amount and the consistency and the pasta was on point. Now that you think I already have multiple foodchasm, I tried my friend's order which is the chorizo mussels, Oh my gay! I can tell you right now that you want to order that dish, i am about to go to bed and dream about it.", "author": "Naoufel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "My husband and I were strolling down Cortland, hungry, on a Saturday afternoon and came upon this place. We initially eyed the burger but then two patrons passed us on their way out saying how good the seafood is. Seafood, it is! We shared some delicious oyster, my husband got their fettuccelle with scallops and I got their cod tacos. \n\nEverything was super fresh! I liked my husband's pasta a little more than the fish tacos, but both were good. The scallops were beautifully cooked and the pasta with pesto was really well done (and we just returned from Italy). The cod itself was really fresh and well prepared; the salad with grapefruit had a really nice dressing. I was a little less enthused by the rest of the taco, but still ate it all!\n\nYou can tell a lot of care goes into the dishes, so I look forward to trying more!", "author": "Lily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "Fantastic all around! The food and the vibe. \nFresh oysters were delicious. We took the halibut salad but swapped out the fish with the seared calamari. So goooood! We also took the halibut fillet main dish which came with creamy corn and an amazing mint sauce(in the photo). So fresh! \n\nThey have a daily happy hour from 3-6pm which we have yet to try! \n\nPrices aren't too bad, a bit expensive but the portions are fairly large and the food is great! \n\nRecommended!", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Great oysters, delicious pot pie, funny and charming servers, this is my go to seafood spot!", "author": "Byron A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "We love red hill station! It's a cozy spot with excellent food. It's a casual restaurant with great ambiance. Beware that it can be quite loud inside. Also, it's an open kitchen so wear your machine washables!\n\nMost notable are the oysters, which are only $1.50 during HH (3-6 pm). The halibut was perfectly cooked and was accompanied by an assortment of seasonable summer veggies. We also ordered the fettuccine with clams, Boston clam chowder pie and the burger, which came with salad and fries. All great!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "Very nice restaurant with friendly staff who provide tasty seafood dishes and good Italian red wine.  The onion rings, trout, shrimp salad, and fish tacos are very good.  If it's your birthday they will not do anything, but ask if you want to buy a desert dish.", "author": "Thomas P. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Dining in Bernal Heights has always been a hidden gem to bypass the hustle and long queues of other SF joints, and this new restaurant is a fantastic quaint seafood addition to San Francisco, that competes with the best of them. \n\nWe made reservations 3 hours in advance with no issues and street parking was readily available in the hilly neighborhood. We were welcomed with a farmhouse meets oyster bar, a very intimate and welcoming appeal to your senses. Not overly noisy, so really nice to have a one-on-one conversation with your date/ group. Staff was 5 stars and super attentive without being bothersome. Olives and a heaping portion of bread was quickly dropped off with our red house wine creatively served in an Erlenmeyer flask as a carafe surrogate. \n\nWith a simple daily menu, we were out to try out their oysters and anchovy salad for starters and my SO chose the tuna linguini while I selected the oyster pot pie. Oysters were fresh and refreshing. Anchovy salad was our favourite due to the crisp texture, not overly batter fried, combined with a hint of lemon/pesto that perfectly complements the greens. In line with the American way, we wanted seconds and thirds.  \n\nOur entrees were served within a few minutes after wrapping up the appetizer. My SO's entree was the tuna linguini which was surprisingly delivered with a heaping portion of mussels and calimari. The pasta was cooked perfectly that embraced the seafood essence with delectable capers. Serving size was perfect for one. My oyster pot pie presented itself as a seafood chowder of sorts with a pastry puff/ slice of bacon pleasantly on top. It was rich and creamy, and delicious. Definitely on my list of favourite places in the city and I am looking forward to coming back over and over to fill up on my seafood cravings. The perfect date night place.", "author": "Pamela B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I've been here multiple times and this place NEVER disappoints!  Their seafood and produce is always fresh and well made.  The service is great and the ambiance is cozy.  Even the bread and olives they put out before your meal is delicious!   I highly recommend this restaurant and have referred many clients while in the area.  Reserve a table in advance, if possible, since the restaurant is VERY small and seating is limited.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "This was a last minute decision on our way bay to Fresno, and I'm so glad we found it. The food was superb & it was happy hour, so the oysters were half off, along with a delicious carafe of wine. All in all a great find & I hope we get to come back soon.", "author": "Leah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Such amazing experience! The food was delish! The server was over the top, welcoming and very polite. Truly a Jem! Thank you guys for everything I will be back for the amazing food and omg the pot pie and thank you for the bread!", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Holy moly this is a MUST MUST MUST if you're in Bernal. Our family of 4 ( parents and 6 yr old and 12 year old )  had an amazing dining experience here. Wine was affordable, food was out of this world while being totally down to earth . Staff was stellar and you must ask for the red room that overlooks the kitchen working if you have foodie kids. \n\nLoved our server too. She was so sweet.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Called to make reservations for 2 on Saturday and the guy who answered the phone was kind enough to inform me about 1/2 off oysters til 6pm - thanks to him my friend and I came in at 530 and were able to have tons of oysters at 1/2 price. The free olives and bread they provide after you are seated were super yummy also. \n\nMy friend got the oyster pot pie - she liked it but it was a little heavy for her, she wished she had ordered the mini. I got the trout with the almond sage butter sauce mashed potatoes and veggies - SO good! Great portion size as well, neither of us were able to finish our meal and we didn't have room for dessert. \n\nOverall, great experience - only downside was parking in this neighborhood is a little difficult. Otherwise, definitely recommend!", "author": "Nadia I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-11", "description": "Cute, intimate restaurant in Bernal Heights that serves awesome seafood that comes as fresh as if the sea offered it. A group of friends and i went without a reservation at 6:30 PM and got seated almost immediately, right before the rush. I happened to be dining with some heavy spenders (to which I most definitely am not) so we ended up getting the Red Hill Special, and let me tell you, that was delicious! \n\nThe Red Hill special came with a dozen oysters, four had caviar on it, dungeness crab legs, and three kinds of fish mixes (yellow tail ceviche, little bay shrimps, and tuna tartare), with different sauces to eat with it (mignonette and cocktail). The oysters were amazing, and I really loved the ceviche, which had a good balance of the acidity. We added the 500ml of white wine, a Bokisch 2015 Alvaro from Lodi, which was a good wine to pair with all the seafood. \n\nIn addition to the Red Hill Special, the group ordered the Boston Clam Chowder pot pie (yummy!), the baked fillet (good but I was more focused on the special), and one of each of the dessert offerings- the creme brulee, chocolate pot de creme, and funnel cake. I didn't really like the funnel cake, the creme brulee was pretty standard, and the pot de creme was really rich! \n\nWill definitely come back to try out the cioppino, but the red hill special was super yummy! Try to make a reservation to be sure you get in, theres bread and olive oil and olives at the beginning too!", "author": "Larissa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Service is great as well as the mussels and oysters. But I didn't eat the fish I got coz it was bland. Nice presentation though.", "author": "Sherry C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "One Star because they weren't able to honor the reservations I made the Friday nite before. A second star for the hostess because she was quite pleasant. Just sorry that she was put in a bind. \n\nI called on Friday to make reservations for Saturday nite at 7:30 for two people. My boyfriend had raved about this place after seeing it on Check Please. Took him over an hour to get to the spot from Oakland in bad bridge traffic. \n\nWe arrived on time and waited for half an hour and still didn't get seated for our reserved table. We ended up leaving. And even after my BF mentioned to the hostess that we decided to go elsewhere, it didn't sound like our reserved table was going to open up any time soon. And in her defense she was apologetic. But who knows how much longer we would have waited had we stayed. \n\nIt's reasonable to wait for a reserved table at a popular restaurant for 10-15 minutes. But having to wait for a reserved table for half an hour or more is beyond unacceptable.  It's poor management of the reservations process. And it's just bad business. \n\nI've been to plenty of restaurants in the city-- large group, table for two, reserved by phone-- where the hostess will inform me and or the large walk-in group that tables are reserved and that their time is limited. The majority of patrons are fine with that because they've been informed ahead of time and are mindful of the time. \n\nThe hostess was very courteous, gave us regular updates and served me a great cup of coffee and even offered a blanket while we waited outside. Yes it was quite chilly outside. I realize it wasn't her fault that the bday group monopolized a bunch of tables that were reserved. But still it's just not right to have patrons who planned ahead and reserved a table wait so long. It's simply poor planning and mgmt of the reservations process and walk-in patrons. \n\nThe restaurant website does say that they keep some tables open for walk-ins. However, I'm not so sure that system works given the capacity and popularity of the place. \n\nSo if the restaurant can't honor advance reservations they need to get rid of the option or simply better manage the process. They've been operating long enough to have a solid system in place and to mitigate these type of situations.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "Food is very good, but seems a bit overpriced, even for SF. 2 pieces of fish and chips for $18??? Really??", "author": "M P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "This is a small neighborhood type restaurant with very little ambiance, if that matters to you, and really good food.  Lots of families walking by on a Friday night with some stopping in to eat.  Parking can be a bit tricky as the streets are pretty narrow.\n\nThere's a strong seafood \"scent\" in the place, and that is clearly the main menu item.  We did not try the oysters that everyone else seemed to be having, but they looked good.  We started with salads - the Caesar (ok) and the Bay Shrimp salad (excellent - with a nice marinade on the shrimp, slices of grapefruit, etc. and a large portion}.  Three of our group had the cod baked with lemon and thyme.  Fish was flaky and fresh, but there was a bit too much crumb/butter topping.  Lots of mashed potato and a random vegetable.  I had the fresh crab - delicious.  Cracked and partially cleaned in a bowl that allowed lots of room for digging out out all that good stuff.   Accompanied by lemon and butter - doesn't get much better.  Nothing came with it in terms of veggies, so I was glad I had had the salad.  Bread was excellent and we love our bread.  We had a lovely bottle of Sancerre with the meal.\n\nService was friendly and attentive after an early rough moment (which we could not figure out).  All in all, a really good place for a meal if you're looking for casual, low key but good food.", "author": "Karne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "Can't recommend this place enough. We got the chorizo steamer with muscles, 18 oysters, and tartare. All of it was excellent. The wait staff was very friendly and the proseco good. The complimentary sourdough bread and olives were great too! We are visiting San Fransisco for just 4 days and may go back!", "author": "Hari S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "I usually don't like going out for pasta or seafood because I feel like it is overpriced for something I can either make at home or get for cheaper and better at a Chinese restaurant (I really only like cooked fish at Chinese restaurants). But, I had a really good dinner experience here! We shared the clams and mussels appetizer, and of course had to keep asking for more bread to soak up that delicious broth. I had the vongole, and despite having filled up on bread, finished my entire plate because it was just SO good. So many clams and there was some sort of bread crumb or crunchy topping on the pasta that just added the perfect touch. Even though it was expensive at $24, the quality was definitely there and you do get a hefty portion of noodles and clams. I had a bite of my friend's carbonara, and while the noodles were good, I wasn't a fan of the bacon which was too soft and fatty.\n\nThis is a great place for a date or a small group looking for a nicer meal. Even though it's advertised as a seafood restaurant, definitely go for one of the pastas!", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-20", "description": "Posting this while waiting for the check.\nIt's 2/20/2017 at around 1pm 4people order 3 burgers and 1 egg/chorizo taco plate. \n\nWe waited 30 mins for 3 burger which were all over salted. We provided feedback to the wait staff and did get comp'd for all three burgers. \n\nReason for the 3 stars was cause of the wait and when we provided feedback to the lady her response was a surprising \"well I didn't make the food\".... Shame", "author": "Gary C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "Primarily this review is for their awesome HH. The portions, quality and overall good vibe this HH gives off in spades make it a must try. Beer/Wine Half price, $1.5 Oysters, delicious bread...I literally need nothing else. If you're WFH or just down to relax with friends over good food and drink, this is your place.", "author": "Darin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-10", "description": "What a gem! We had a friend from London in town and had taken him for dinner at a loud and trendy restaurant place in North Beach the night before: no bueno. For the second evening we were determined to go to a place that feels more San Francisco to us and so we spent some time browsing on Yelp...looking for a place that ticked the following boxes: neighborhoody, casual, intimate, inventive food and reasonable prices. That's when we stumbled upon Red Hill Station.\n\nWhen we arrived the staff greeted us warmly. We didn't have a reservation but since it was early (6pm), we got seated straight away...phew! I liked that you could see into the kitchen were the cooks were swinging flaming pans: that promised to be good. I ordered the calamari caesar and the cod tacos. The former was absolutely delicious and the latter was nice, yet was a bit messy overall. My dining companions ordered the Vongole and the halibut, respectively. We drank local beer from the tap, which was nice and unpretentious. \n\nOverall, this place was exactly what we were looking for and it left our visitor with the right impression of San Francisco!", "author": "Uli B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-22", "description": "The reason for the one star review is that I was just charged $26 for 11 mussels. My husband ordered the cod and it was cheaper and came with more. I think it's absurd to charge 26 bucks + tax   and at least not tell ppl what to expect. It appears as a main - but for sure leaving here hungry. Our waitress was really nice and asked if I wanted to order anything else- and the answer is yes, but guess what I don't want to pay another 15 or 30 dollars so our bill ends up being crazy. \n\nWould have loved if they offered to do anything for the confusion but no they didn't. I get it it's San Francisco but come on we're not all rich. Really leaving here disappointed but more than anything leaving hungry. I could have had a steak dinner for $26 dollars.", "author": "Vanessa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "If you're in Bernal Heights (hidden San Francisco area  with great views from Bernal Heights Park and cool random shops on Cortland Avenue), then Red Hill Station a great place to eat a late lunch--its open all day. Absolutely fantastic pasta : Andouille sausage, Manila clams, white wine, garlic, lemon, herbs , huge portions that you can easily split. Great seafood, small space with good service.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "+ nice ambiance\n+ happy hours on weekends between 4-6pm ($1.50 oysters)\n+ clam chowder pot pie - the dough was soft yet crispy; the clam chowder was super good; I still think that $18 is a lot of a bowl of chowder with a piece of dough layered on top - but it was very good\n+ Dungeness crab - a bit overpriced but the crab had a ton of meet", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "I have found my monthly seafood spot, and fortunately a short drive away.\n\nMy brunch date had cancelled so reached out to my backup buddy plan. Offered him something in Noe Valley (Basic) or something in Bernal Heights. We were both ready to rock Bernal Heights, and even though I'm down the road, sadly haven't explored this area enough. And even though I'm closer, he got there early.\n\nThe place is cute - a main dining area with about 8 tables, 4+ on each wall, and even a private dining room upstairs. The kitchen is visible the to the whole restaurant, and you can see and tell everything is made to order.\n\nMy buddy and I wanted to try everything, and we used the couple sitting next to us for advice. I mean, I love seafood pasta, the shrimp melt sounded good, and even the fish and chips have good reviews. As two hungry men, we decided to just share everything and had no major complaints.\n\n-Red Trout Tartare: this came out more like a ceviche, lemon juice and oil, all. But it was a lot of trout and was absolutely delicious. Would definitely get this again.\n-Monterrey Bay Squid Salad: to explain how good this was, the last couple to come in both got one for themselves. Grilled and seasoned perfectly, the squidlets and meat were great. Again, must get.\n-Clam Chowder Pot Pie. This was the weakest of the three dishes, but was still good. Also took the longest time, so clearly was made to order. See, for me clam chowder has to pass the spoon test - you put your spoon straight in, and if it stays standing up, you have a real chowdah! This was a watery broth, and with the pie crush, was probably the sweetest clam chowder I've had. But there were good pieces of clam inside.\n\nThere was more I'd love to try, like the cioppino, the pastas, and even the mussels. They also do dessert, but we were pretty full at that point.\n\nI'd also like to point out that the staff were wonderful. The waiter genuinely came across as loving his job, and trying to get the best meal to his customers. He constantly kept us updated on the status of our food, and was willing to answer any questions we had. It also wasn't badly priced - between these three plates, split ticket was around $30. For all the seafood, and being full, was well worth it.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Truly quintessential San Francisco!  In the midst of too many restaurants becoming part of a large corporate plan or top spots being monopolized by the homogenized food industry this is truly a breath of fresh air and a bite of heaven.  Just an original neighborhood joint staffed by people who love what they do and it shows.  Honestly one of the best meals in a long time.  We had very simple dishes but that were masterfully prepared. Ciopino where nothing was over cooked and the tomato base was bursting with fresh flavor in every bite. Scallops perfectly grilled and fresh on top of house made fettuccine and fresh pesto sauce.   If you are in the mood to experience what San Francisco used to be like try these guys, you will not be disappointed !", "author": "BGinLove B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "My rating is actually 2.5, but bumped it\nUp to 3 stars. This place was featured on a PBS show and it looked promising. The service was decent and somewhat acceptable considering how busy this place was. I ordered the Caesar salad with grilled calamari and had high expectations. I was let down. The portion of calamari was very meager. The quality of the romaine and the dressing was on par. Had the calamari avoided being charred. Husband had the shrimp sandwich (not the menu name) and it consisted of a weird sweet bun and small Bay shrimp. The only thing memorable were the olives and bread they offer prior to the meal. It was quite the trek to this place and parking was not a breeze. The streets are small and people drive recklessly so be forewarned. We were so disappointed as we had high expectation as they were featured on Bay Area, Check Please. Perhaps it was an off day. Can't say I'd give it another try.", "author": "Lynn E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Wanted to try something new for lunch and was at my parents place visiting, so yelped and found this place.  Rating and pictures looked fabulous so gave it a try.  Food was amazing; ordered the steamers (clams in garlic wine and lemon), vongole (fresh fettuccine with clams, garlic, wine, butter, small hint of creme), and a small clam chowder pot pie (clam chowder baked in a pot pie shell).  The clams were of a good size and fresh as heck.  The steamers dish, which is enough for 2-4 depending on how much other things you order, had an amazing garlic wine lemony broth - sweetness of the clams with refreshing lemon juice.  The vongole' s pasta noodles were freshly made and had good texture, and the clam chowder was tasty BUT wish they'd toast the pot pie shell a bit more.  Info said that the place was good for kids, but probably 2-3 year olds and up, since space was a bit cramped.  Overall a good solid 4!!!", "author": "Raymond F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Just found this recently in Cortlandia and love love love it. Seafood pot pie was excellent, raw oysters impeccable. Sat at the counter and happy I did, the tables seemed like they could be a bit close together.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-21", "description": "Red Hill Station was a straight-up bad lunch.  We were a table of 4 people: two of us ordered the \"Oyster Pot Pie\" ($20); one ordered the fish tacos; the other ordered the \"Lemon Thyme Cod\", and asked for it to be made gluten-free.\n\nThe worst crime:  the \"oyster\" pot pies... mine contained 1/2 of one oyster (cut into two teeny pieces); the other diner's contained one single full oyster (cut into 2 pieces).  They arrive looking wonderful, with crispy browned puff pastry, but when you cut open the pastry, you find a thin, watery cream-based soup (homemade at least) with chiffonaded leeks and cubed potatoes -- and VIRTUALLY NO OYSTERS!  I'm not sure why they couldn't have thickened the mixture with a simple roux, and I'm absolutely mystified as to why an \"oyster pot pie\" for $20 didn't contain at least 3 or 4 oysters!\n\nThe second issue:  the \"lemon thyme\" cod...when we asked our server if the dish could be made gluten free, he said that they would leave off the bread crumb coating on the fish.  I said, \"But you'll include the lemon and the thyme?\", to which he said \"yes\".  When the dish arrived, it was a piece of plain UNSALTED/UNPEPPERED boiled cod with no lemon or thyme.  My companion had to ask for salt and pepper, because unseasoned fish is unpalatable.  It is beyond me why they couldn't have seared the fish with a little thyme, S&P, and lemon rind; gluten free should not have to be \"flavor free\"!\n\nThe fourth diner had the fish tacos, and said that they were \"good\" but unremarkable.\n\nCome on, Red Hill Station -- surely you could do better than that!!!", "author": "N W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-21", "description": "The food was very good--except the burnt funnel cake.  But the services was horrific.  One person's dinner came out with the appetizer. They forgot one person's soup.  \n\nThey were totally disorganized and inattentive.  There were plenty of servers and staff but they were not paying attention to their jobs or didn't know what their jobs were.  We weren't in a hurry and had a good time but for the price I wouldn't come back due to the atrocious service.  It was like how I remember the crappy pizza joint staffed with inexperienced high school and college students back when I was an adolescent.  No one was in charge and it had an air of chaos and unprofessionalism. It's a shame, really.", "author": "Jules a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Very nice neighborhood place. There is a variety of seafood and a few other non-fish choices. I liked my philly cheese steak.", "author": "Irma P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "The pesto pasta with prawns is the best on the menu! \n\nAlso try the carbonara dish. Fresh and creamy. \n\nI'd pass on the chowder sampler...looked good but it was a bit salty.", "author": "Cindy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Hands down deserving of a 5/5 star review rating. I came here on a Sunday night and was seated immediately. Our waiter Luke was down to earth and super helpful with helping us decide what to order. We were served complimentary olives (highly addictive - marinated and boiled  daily), fresh bread and balsamic etc. \n\nThe menu had a ton of great options but we opted for the pesto almond pasta with shrimp and the clam chowder pot pie - BOTH extremely delicious. \n\nHighly recommend this spot for a date night! \n\nCheers!", "author": "Sederic G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "If you like oysters, go here. Happy hour 5-7, $1.50 each. They bring warm olives and bread. They have 4 varieties tonight, 2 local, 1 Canadian, 1 New Zealand.  Amazing!!!", "author": "Dusty B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-17", "description": "Wow. You turn up on a Sunday night over an hour before they're scheduled to close and they harass to to order your dinner before you've even picked up the menu, because it's slow and they want to leave.\n\nWelcome to Red Hill Station. Enjoy your dinner.\n\nAnd THEN AS I LEFT,\n\nA server started mouthing off.  His name was Tony. He had nothing to do with my dinner what so ever.\n\nAnd he wouldn't back down. It felt very ugly and I left. Even one of the staff had to physically restrain him. I'm not making this up.\n\nI'm no victim here, but I don't understand how this guy felt so entitled to verbally abuse me considering him and I had had no actual dialogue prior to that. \n\nTo their credit, they saw some of the ugliness and were embarrassed, and offered to refund my dinner. \n\nThat's why they get 2 stars.\n\nTony yelled something about my having a bad day, but nothing was further from the truth. I took myself out to dinner to celebrate a significant event today.", "author": "JH M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Solid seafood place in bernal. Perfect for a weekend brunch with a glass of rose and the NYT, preferable the wedding section. Did I say that out loud? Delicious oyster platter, cioppino, puff pastry pot pie. How can you go wrong with puff pastry. Get the mini if you just want a taste. Cutest thing ever. \n\nWe did ask if they had uni, which would have totally made our day, and made sense since it's a seafood place. Puzzlingly, NO UNI. We may be a little obsessed with Uni (see other reviews) but we think this is an area where maybe the management could consider augmenting the menu =).", "author": "Aman H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Ordered the halibut and oysters. They oysters are fresh and halibut is tasty. I felt hungry after few hours and It would be great if the halibut is little bit larger.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "Dinner review. \n\nFried night smelt - 3/5\nCalamari salad - 4/5\nChowder pot pie - 3/5\nPork pot pie - 4/5\nBeef pot pie - 4/5\nPot de creme - 2/5\nMushroom creme brulee - 4/5\n\nOverall, \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "Food was delicious and fresh, and seasonal. Servings are a good portion and not overly expensive. The bread before the meal served with extra virgin olive oil and balsamic vinegar we're amazing. I would also recommend the pot pies the come regular size or mini I got the clam chowder pot pie and it was better then what I have tried at fisherman wharf . It is a very small restaurant maybe 8 tables I recommend getting a reservation if you plan on going at night", "author": "Anthony U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "The clam chowder pot pie was nice and piping hot albeit a bit on the watery side. For the price, I'd say it is quite a steep $19 before tax and tip. A small side salad came with it but it was undressed and comprised of a just small handful of leafy greens. There was free bread and olives but I had to grab a burger elsewhere to finally feel full. Perhaps serve a clam chowder bowl pot pie and charge half the price or offer a bigger portion of salad with more than just greens? \n\nMy friend got the trio of pot pie and I felt a little ripped off for her. Get the whole rather than 3 little pies. Needless to say, my friend was mighty hungry after we left and headed to find more food. \n\nI may come back for happy hour to give this place another chance. I wanted to love this place and I'm glad I finally had a chance to check it out.", "author": "W A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "7 years in SF and one of the best meals I've ever had! Highly recommend. Get the halibut!", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-05", "description": "First time here, we enjoyed the place.  Nice menu options.  Good prices.  Good value for what you get.  We shared the shrimp stuff avocado.  It was very good.  Then shared a mini oyster pot pie, again very tasty.  Sort of an oyster stew with pastry.  I had the steam clams.  I see mussels on the menu in SF all the time, but rarely steamed clams.  They were very tasty, if perhaps cooked a minute too long.  Broth was great.  They have very good bread here to dunk in the broth.  A small, but reasonably priced wine list.  We'll be back.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Great stop on our trip to SanFran. A great neighborhood restaurant with high quality food and excellent staff. If you like oysters on the half shell there are several different varieties to try and they will provide you with a good description of the differences. The Oyster Shooters are unique and AMAZING, a must-try. The Hanger Steak was sust succulent and cooked to perfection. Even the bread is to die for. There was a slight wait to be seated (which is a favorable sign to us) and the couple minutes were well worth it. Great selection of wines. Red Hill is off the beaten tourist routes but easy to get to by Uber. It was off the charts as far as we were concerned, a true culinary gem.", "author": "Dan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Great little neighborhood seafood spot. Seated quickly on a Thursday early happy hour. Oysters were great and only a buck fifty each. Cioppino for two was huge, and broth was delicious.  The only drawback was the bread.  It was good, but a little heavy for seafood. I think \"wheaty\" was the term I used, rather than sourdough or rustic Italian which I would expect in SF.  I will go back for sure.", "author": "Andy O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Very disappointed with our meal tonight. Server was great, nice guy, attentive and friendly. We started with the calamari salad that was good so we were excited for our main courses. The mussels and clams was all broth and not very tasty, only about 7 mussels and a few clams in a huge bowl and not cheap. The cod was good, but tiny served with mashed potatoes that were tasteless. There was no presence of a manager and noticed guests waiting at the door while sever/ hotess was looking at her phone. \nWe tell our server and he felt badly and bought our dessert.\nWe won't be back, sad because we live close by.", "author": "Ana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "Delicious! Highly recommend to anyone who loves seafood.  Loved the cold crab, oysters and the clams. We hit during happy hour on a Sunday and enjoyed half priced oysters and draft wine! Highly recommend to others--went with my mom but would be great in a small group. Funnel cake and chocolate creme were amazing!  Perfect ending for the meal.", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "This place stole my heart. Set in an intimate cozy setting, you feel like your in someone's kitchen. The food was so fresh I could swear I saw it glimmer.\nAll that said, the staff... I've never felt more welcome or taken care of. The servers Julianna and Justin felt like old friends who want to feed you and listen to your stories. If I lived here, I would be a regular for sure. Thank you Red Mill Station, you made my weekend!", "author": "Ameana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "We had a wonderful meal! The pot de créeme will knock your socks off! Jack the waiter was pretty cool.", "author": "Jay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-25", "description": "It was really busy and the service was super slow when I went on a Thursday around 7pm. We didn't get served for almost an hour it felt like. At least they eventually gave us bread. \n\nOtherwise, the food was good. We had the mixed dozen oysters on a half shell and those were delicious. The varieties and freshness of the oysters was so amazing. The Alaskan cod was alright, not too amazing. The andouille sausage linguini was so good though! Definitely get be linguines. We also had the mussels and clams in the wine broth. Seafood was super fresh! \n\nAlthough the service wasn't too great that day, I can forgive because the food quality is good for the higher price you pay.", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "Tried this place for the first time and it didn't disappoint one bit! Went in on a Sunday evening without a reservation and had to wait about 20 minutes. Everyone coming in had a rezzie, so I think that's the way to go in this tiny restaurant. Service was great and food was too. The menu on the website had more options than the actual menu, so note that if you look online, it's just a sample menu. This is a wonderful neighborhood gem and I'm so glad we stumbled on it!", "author": "R S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "I came with my mom and siblings. The service was definitely nice. If I could give service a 5 star, I would, but overall I'll have to give a 3 because the food wasn't that great. We ordered a dozen oysters and received 6 oysters that were decently sized and 6 tiny oysters the size of a penny! Some were nasty tasting.. We also ordered 6 oyster shooters that were pretty decent. I asked for no cilantro and the server was very nice about it. We also ordered the clam chowder pot pie and loved it, the linguine with clams was sooo salty (and I'm thankful for the servers for refilling water constantly) and the noodles were hard and chewy, and the linguine pasta almond pesto was meh. \n\nWould I recommend? No.\nWould I come for the service? Yes. \nWould I come again for the food? No.", "author": "Beverly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "The oysters are incredibly fresh and clam chowder pot pie is amazing!!! Definitely recommend for happy hour 3-6 PM!", "author": "Kora L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-28", "description": "It seems like a nice and cozy place, but unfortunately both me and my friend got food poisoning after eating here. We shared oysters and then main dishes were different, so oysters are the suspect. Hugely disappointed.", "author": "Onur S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Bumped into this whole in the wall place in Bernal Heights. Everything was amazing about it, the decor, the service and the food. I wish I could have tried everything on the menu. Reasonably priced for a seafood place and the food was delicious. Definitely will come back again!\n\nI highly recommend the grilled calamari salad, the clam chowder pot pie, the cioppino, and the clam and sausage linguine dish.", "author": "Jeffrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "We love this place! We went this past Saturday for the 3rd time and again it was delicious.  This time we brought my parents and they also raved about it. We got the mussels, clam pot pie, carbonara pasta and the burger......yummm!\n\nThe service is always on par and quality of the food is wonderful.  \n\nI cannot wait to come back...again!", "author": "Maryn R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "The food is great.  What is not so great is the service and the uncomfortable seats.  The staff could be warmer and a little more sociable.  This is an intimate  neighborhood restaurant, after all.\n\nIt would be great if they changed the chairs.  It takes away from the dining experience when one is uncomfortable.", "author": "Emilia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Grilled calamari caesar salad 5/5\nI could eat so many of these... but sadly they are $19 :( \n\nNo matter... it's worth every penny, for succulent calamari on a bed of crisp romaine spears. The caesar flavor is mild. It's rich and hearty because of the small colorful cuts of calamari grilled with some amazing buttery rub, and the dressing adds a refreshing, lemony kick!\n\nThis place is a gem. Great oysters, food, wine, beers on tap, and a quaint, home-y fine-dining feel.\n\nI will be back for Kusshis, PEIs, and any other Canadian oysters I can get my hands on.", "author": "Fiona Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "This place never disappoints. I can say never because I live two blocks away. They have a great happy hour of oysters and wine. Their greens are uniquely flavorful (not the standard store bought greens). The fish is fresh and cooked to perfection. The bread is fresh baked. The olives are warm and delightful. You literally can't go wrong with anything on the menu.", "author": "Whitney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Wow. This place really rocks. Blown away by the Red Hill Special. Left me dreaming of Balthazar in NYC but I'm here in SF in my own neighborhood!  I hear the happy hour is amazing- next my list of things to try. Service excellent, wine excellent. Such a nice environment too. My new favorite in the hood.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "Red Hill Station has become one of my favorite restaurants in San Francisco. I've been here twice so far and can't wait to go back!\n\nThe restaurant itself is pretty small but cozy. There are tables in the front and bar seating along the open kitchen. I believe there are also some tables in the back of the restaurant for private parties.\n\nFor appetizers, I've tried the Red Trout Tartare and the Bay Shrimp Stuffed Artichoke. The tartare was more like a ceviche, which wasn't big deal. The taste was simple, but still good and refreshing. It was great that they were pretty generous with amount of fish they put in. The bay shrimp appetizer on the other hand, was really small for $16. It was a refreshing dish also, but it wasn't anything special.\n\nFor entrees, I've tried the Monterey Calamari Grilled Salad, Toasted Almond Pesto Linguini with Gulf Prawns, and Vongole Manilla Clams Linguini. I've gotten the calamari salad during both visits, because it's that good. The salad itself was very refreshing with ingredients of beets and grapefruit. The calamari was seasoned and grilled to perfection. The pesto pasta was the best I've ever had! Usually pesto pastas lack flavor, but this one was excellent. There was a great amount of sauce and the prawns were also seasoned and cooked perfectly. The clam pasta was my favorite out of everything! The linguini was cooked al dente and the sauce was nothing short of amazing. They were generous with the clams, and everything tasted really fresh.\n\nFor dessert, we got the Candy Cap Creme Brulee. It was small, but really good. It is a little sweeter than the usual creme brulee, but we didn't mind. If you're looking for something sweet at the end of the meal, that's the option to go with.\n\nService was great both times I've come. They checked up on us during each dish to make sure we're enjoying everything.\n\nOverall, this is just an all around great restaurant! You won't be disappointed in anything you order. If I could give this place more than 5 stars, I would! I will be recommending this place to every seafood lover I know.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Can't write enough goods things about it. Every crumb they make is so delicious and the staff couldn't be nicer. Don't accept the free bread! It's too good and appetite killer. The Caesar salad is divine. The tuna melt is heavenly. The almond pesto so good. And I'm still full from getting the cippino last year.", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "HORRIBLE! The worst cioppino I've ever been served. We shared the \"double\" portion. $72 for about 10 mussels, about 10 clams (some unopened), a piece of fish and 4 shrimp, with a ton of onions filling the bowl. NO CRAB!!!!!!!!!!! Menu promised crab but NONE in the bowl. Easily the worst and most overpriced dish I've been served in years. The salad with calamari was good, wish that was all we ordered. Salad w/ calamari, above mentioned cioppino, one glass of wine and one beer. $150 out the door. ONE HUNDRED AND FIFTY DOLLARS! Easily the most disappointing meal I've ever had in San Francisco (I've lived here 20 years). Service was poor, never refilled water and never came back to see how we were doing. I feel completely ripped off and utterly disappointed. AVOID!! NEVER AGAIN!!!!", "author": "mark f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Came here for a birthday dinner and was pleasantly surprised. This is a small restaurant that serves amazing pot pies. We ordered the seafood tower, clam chowder pot pie and oyster pot pie. The seafood tower is really fresh and the pot pies are comforting when eating it on a cold night. I like the location of this restaurant because it's not really in the city. It feels like it's nestled in a quiet neighborhood.", "author": "Jeffery S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "A good atmosphere restaurant. Phenomenal service. Prompt seating. Greeted by the server as soon as I walked in, they seem to know who I was and led me to the table right away. I was 10 minutes early for my 8:15 reservation too. Nice to see they saved a table knowing you would show up. Some restaurants may tell you that they are running late even though you had a reservation which is obviously annoying. So this was just an incredibly smooth start.\n\nAnd that's not all. We found a parking space right by the restaurant. This never happens in North Beach, SoMa, Nob Hill, Russian Hill, Marina, the Mission or Richmond. Just can't happen. Imagine that. Saturday evening, prime dining time, and viola, stars aligned and there we were.\n\nThe restaurant is quaint, stylish, cute and inviting. I liked that. Every restaurant so far in Bernal just felt that way. It's a very welcoming sight. We need more of that. \n\nSince I eat out practically ever night, and some weekends and lunches too, it's important to find those restaurants that created a right ambience that makes you want to come back to. Like Blue Plate or Front Porch. I already like this restaurant before setting my foot in.\n\nThe white pots hanging by the kitchen were neat. Turned out they serve their famous fish stew in. Friendly staff come by very quickly to chat with us. Asked what was popular and she recommended a few things. \n\nIt's important to pause here and note my companion choice of the night. N is French. As French as one can get without getting on my nerves. Our unique sense of humor come out together when we are together. Some people may think we are juvenile but when it comes to dining partners, N is as good as it gets. He knows his wine. He knows what goes with what. He is also disciplined like a French to not ever over order. I prefer him ordering because like a typical Chinese (well, I'm mostly Chinese as I recently learned on 23andme and bunch of other stuff), my eyes are bigger than my stomach and if it was left to me, the entire menu would be ordered. So I let him.\n\nFor that evening, he chose the monterey squid salad, which was supposed to be good. And mussels. The lady said the magic word of moules. What kind of French does not like moules? The kind that is NOT French of course. Wine pairing of the night was a light red N selected. I asked for coffee as I had started the day early with yoga, cycling, and attending an afternoon party. Surprisingly, the coffee was delicious. It's hard to imagine a restaurant serves coffee well when their main thing is seafood, but for reasons unclear, this was one cup of exceptional coffee. \n\nStaff came with green olive in sort of fish flavored sauce as a complimentary dipping sauce. Then the sourdough bread. Then the squid salad, tender and fresh local squid served on a bed of organic greens and grilled asparagus tip. \n\nMussel dish is not just filled with mussels but with sausage, served in a huge pot filled with steamy spicy and creamy broth, but not so creamy that you don't want to drink it. Nothing like drinking warm creamy broth on a windy evening makes one want to sing happy notes after, which, coincidently, was where we were headed after: a private saloon open mic party nearby.\n\nThe meal was thoroughly satisfying. For two people, one salad and one entree to share was more than enough, especially if you couple it with a glass of wine or two. \n\nThe fish stew looked exceptional actually besides what we ordered. The service was fantastic, easy parking, and the on time seating made it even more appealing.\n\nA great restaurant to come and hang out with your favorite bud.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Always fresh, delicious food, friendly, non-pretentious service.  My favorite neighborhood place. Very few places have good cioppino and they make one delicious one - every time! They also very accommodating if we sometimes  show up without reservations. Highly recommend it.", "author": "Ausra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "Oysters, house made pasta and the bread all very delicious. Biggest problem is the portions are quite small compared to what you pay.", "author": "Maleah A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "All I can say they are truly not allergy friendly. My husband had a special ate quickly since everything I am allergic to even the almond bread. He felt super bad. I asked for a lemonade and they gave me a soda.", "author": "Colleen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Yum! My husband and I went there last Friday and had everything. This place is great, definitely a great neighborhood find. Clam chowder pot pie and  a glass of rose, perfect!", "author": "Maria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "The space is very cute and it's in a nice Bernal Heights neighborhood. It was not super busy on a Tuesday. Igor when we showed up. Service was slow but pleasant. \n\nOur wine was served lukewarm and that was the only Sauvignon blanc that they had. Other than that everything was tasty. We loved their seafood soup which was delightful and really hearty and comforting. We also did their fried fish which was lovely and fresh. \n\nI would recommend going there and ordering some of their pot pies as well.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-06", "description": "I really wanted to like this place. Cute decor (although...see picture) and interesting menu. \n\nI got the mussels and my companion ordered the burger. 15 bucks and it comes with fries. My companion said the burger was meh.\nMy advice to the chef. Go down the street to Vega. Order the mussels. That is what mussels should taste like. Your broth is not quite  like gourmet hot dog water but it's too close for me. I wanted to like you but you make it difficult. Also, please advise your staff not to sit next to a couple who may be on a date and then proceed to make 25 phone calls confirming reservations.", "author": "Carla G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-26", "description": "Some things are just too good to be true:\n\n(1) A hot guy with brains and personality.\n(2) A hot girl with brains and personality. \n(3) A Bernal Heights restaurant with an overall 4.5 star rating: Red Hill Station.\n\nWhy?\n\nIt's all subjective. \n\nMr. NSS always tells me, \"Do you think Channing Tatum and Megan Fox are casted for their awesome, Oscar worthy acting ability?\" I don't know what he's talking about...Tatum's \"performance\" in Magic Mike was Oscar worthy in my book. *Cue in Ginuwine's Pony*\n\nWith the exception of Ichi, I've never been impressed with any of the restaurants in Bernal Heights which is a shame since I live nearby. I bookmarked Red Hill Station when they first opened in June 2014 but wanted to see how the reviews were before paying a visit. They maintained quite stellar ratings and it was close by to where both my gf and I live so we thought, now was the time to give them a shot. \n\nSorry but after dining there, I don't understand the hype over Red Hill Station. It's overrated; the food is mediocre at best and the service is disorganized.\n\nAfter our waitress recommended the Carbonara ($16.95), my gf and I split that as a starter: http://bit.ly/1zmDAaI. The pasta was perfectly al-dente and the carbonara was rich and creamy. I liked the addition of breadcrumbs for a nice textural contrast. Usually carbonara is made with diced bacon or pancetta but oddly, the bacon here was in strips, making it difficult to eat. \n\nHere's where things went downhill... \n\nKnowing that the owners are Anchor Oyster Bar alums, I was most excited for the Cioppino which was available in half and whole orders. The waitress said that, a \"whole\" order comes with a whole crab while a \"half\" order comes with half a crab. We ordered a whole to share as our main ($35.95): http://bit.ly/1BcgqWF. We were baffled when a huge platter was set on our small table with a bunch of mussels and two dinky pieces of crab. My gf has a fish allergy so they kindly left out the cod.\n\nWe alerted one of the staff who turned out to be the owner. We thought maybe they made a mistake in the kitchen and told her we ordered a \"whole\". She apologized for our server's miscommunication and said, \"That's how the cioppino is served here...without crab legs.\" My gf and I sat there really confused because I was 100% certain that I had seen crab legs and claws served in the cioppino pics posted on their Yelp page. I then asked, \"So the restaurant charges for a 'whole' crab but only give customers two pieces?\" She looked as confused was we were and offered to take it off our bill which was a nice gesture. She added that if we wanted a whole crab, then we could have ordered the Crab with white wine sauce. We would have but that wasn't on the menu we were given: http://bit.ly/13JL52W. \n\nAside from the missing crab pieces, the cioppino was sorely disappointing and not even in the same league as Anchor Oyster Bar. The mussels were meaty and tender but the broth/sauce was nothing more than canned tomatoes with herbs throw in as garnish. It was devoid of any flavor whatsoever. This was NOT a cioppino but rather a mussel tomato stew garnished with crab that ended having one tablespoon worth of meat. \n\nService was disorganized and confusing. We were seated by a male staff member who we thought was our waiter. When other tables who came after us started ordering (we were first to arrive), a female server came over to us and said, \"Oh you guys never ordered?\" =/ Nope. She was really nice though. We were there for dinner but the menus said, \"lunch\". My gf and I then were given dessert menus...from different seasons. The cioppino was still on the bill and we had to alert the owner to take it off. \n\nPreviously Tinderbox Restaurant that shuttered in 2008, I'm not a fan of current cramped and loud space. The tables are small and too close for comfort with (guy next to us almost accidentally knocked over our plates). Additionally, the serving platters are too clunky and it was annoying having to play table Tetris. Not the best place for an intimate date because of the poor acoustics.\n\nMediocre dinner and lackluster service aside, with the kind gesture to comp the cioppino dish, I was going to give Red Hill Station 3 stars. That's until, I went home and saw the following which confirmed my initial thought and contradicted what the owner had told us:\n\nhttp://bit.ly/1AS3A1O\n\nAdmittedly, I may have beer goggles on half the time but that is crab claws and crab legs no?!?\n\nNot cool, Red Hill Station.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "We had our latest dinner club here and it was a greta pick.  Red Hill Station is a small spot but they had a little somewhat private room above the main dining area.  It was perfect for our group as we had 8 people.  Their beer and wine selections were good and we definitely took advantage of them.\n\nWe started with the tartare (really good), calamari salad (decent), fries, and oysters.  Everything was really good and were good portion sizes.  For my main meal I went with the recommended Carbonara and it was excellent.  It was a lot but I devoured the whole thing.\n\nFor dessert we shared the creme brulee and pot de creme.  Both were good but not a must have.\n\nGreat intimate spot in Bernal with great food.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "Overall, Red Hill is an above average, neighborhood restaurant. I appreciated the on time seating, friendly service, and fresh food. I loved the private table we had reserved at the back of the restaurant - it was a cozy booth with a window to the kitchen. I would not encourage walk ins because the restaurant is small and pretty popular.\n\nThe key to a good experience at Red Hill is ordering the right dishes - I loved my first experience but thought the second visit was average. You MUST order the mushroom creme brûlée if it's still on the menu! I was unimpressed by their supposedly famous pot pies (too heavy and salty) and ceviche, and would discourage you from the garlic cod. I would come back to try their the mussels, linguini vongole, or Caesar salads. \n\n* Complimentary bread and olives: Huge meaty green olives and bread served with olive oil and balsamic. I thought it was a nice way to start but the bread could be fresher. \n* Scallop Ceviche - 2.5 stars: This was one small, but beautifully presented, overly salty scallop.\n* Tuna tartare - 3.5 stars: The tuna tartare was much better than the ceviche, it was good but standard.\n* Sampler of Pot Pies - 3 stars: Clam chowder (standard), bolognese (too salty - least favorite), and pork shoulder (tasted like Moroccan lamb seasoning). Overall it's a cool and unique idea but I wasn't a fan. If I had to pick, I would order the pork shoulder.\n* Garlic Cod - 2.5 stars: Overcooked and dry, not a fan of the sauce. \n* Linguini Carbonara - 2.5 stars: would return for other pastas but the carbonara is way too rich and reminded me of the Lean Cuisine carbonara sauce. Pasta not made in house. \n* Funnel cake - 3.5 stars: good, but standard. \n* Lacey strawberry - 3.5 stars: good, kind of light. \n* Mushroom Creme Brûlée - 5 stars: Surprising favorite with a strong mushroom flavor only when you first taste it. Weird but good!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "We came in here a couple of weeks ago for the the first time. Although parking is not the easiest in the area it was well worth hunting for a spot!  The food was delicious all around from appetizers to fish!  Very fresh and well prepared entrees.  The wine list was small but well chosen. Overall the service was excellent and attentive.   We had one issue with either an order did not get put in or the kitchen missed it, but our server was very apologetic and comped the dish because it arrived so late.  I think so many of us  get so demanding and expect perfect service all the time, but we all make mistakes (don't we), but  I judge how you handle them in the end.   We will be back for sure.", "author": "C W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "The boy and I decided to go here for our belated Valentine's Day dinner and he really wanted to get ciopinno. It is a very small restaurant and when we arrived it was full so we left our cell number and they said it would probably be around 30 minutes and they would text us when a table was ready so we found a nearby bar and waited with a drink.  After about 35 minutes, we walked back even though we hadn't heard anything.  The host came out and apologized for the wait and offered me a blanket and gave us a drink menu.  He brought me a glass of wine and the blanket since there is no seating area to wait inside.  He continued to check on us (so nice!) and eventually we got a table looking into the kitchen which was a great view.  \n\nHe got the ciopinno and I got fettucini with andoiulle sausage and clams.  For our wait, the host gave us two oyster shooters on the house.  The food was so fresh, well seasoned and tasted amazing.  Our waitress was very nice and attentive.  The entire experience was great and we would definitely return.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "One of my favorite restaurants in the city. Food has the perfect amount of seasoning and is delicious. Well worth the trip into Bernal!", "author": "Dee K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "Perfect meal, from the service to all of the dishes. Great seafood options with a lot of depth of flavor.", "author": "Avi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "We've been to Red Hill Station a number of times and it's always wonderful. The seafood is unbelievably fresh and pristine -- and delicious! -- and the atmosphere and service are lovely. My only wish is that it wasn't so loud in there. Maybe some fabric on the walls or ceiling to absorb some of the conversational din? I would eat there every week if I could!", "author": "Caroline P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-22", "description": "Took my husband's family (7 of us) to this restaurant with good expectations based on the yelp reviews. It was his birthday lunch and I wanted to show his family visiting from southern CA an enjoyable time. They were excited about eating some great sf cioppino based on their delicious past experiences. I dine out with friends and family for the combination of good ambiance, good food, and good service, so here is my, and I speak for our family, review of our experience.\n\nFood: \nLinguine with clams ($24)- so salty that our grandma had to pour water over it. Use more water and lemon when working with clams... it's naturally really salty. \n\nSalad with octopus ($22) - good dressing. Octopus was salty too... :( \n\nHangar steak ($32) probably the best thing we had. There were 5 thin slices of steak and 2 Brussels sprouts but they were perfectly cooked.\n\nCioppino ($70) - cold, took 1.5 hours, and it was not up to par with anchor oyster bar. If you know it will take a long time for cioppino, set upfront expectations and maybe show some sincere care for the people who are staring quietly at the kitchen window anticipating the hot cioppino to come out. Maybe come by and say \"sorry for the wait\" and it will take x more minutes... even if it's and estimate.\n\nService: I have lived in the Bay Area for 5 years, and I never felt so much cold shouldering and discrimination from an sf restaurant. I hate speculating this as the case but I felt like we didn't even get one warm thank you or sincere \"how is everything.\" I asked politely \"do you know how much longer the cioppino will take\" and I would get a snarky \"we have a lot of people today so yeah...\" I realized how much attitude really impacts diners' experiences at that moment because that whole meal became a huge waste of time and money. \n\nWe we the only Asian family in the establishment... but I'm not going to assume racial prejudice. We felt it based on how we were treated compared to every other table, so I'll leave it at that.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "This a new top-5 place to eat in the city for me. Incredible food, fast service, reasonable prices. 10/10 will return", "author": "Spencer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "3.5 stars. \n\nThe first time (2016) we came here for lunch I loved it and the second time (2018) it was so so. \n\nFirst time: fresh seafood. The fried smelt was very fresh and balanced, without extra grease and fishi-ness that often come with fried fish. and the calamari was magnificent - just the right texture, quite a platter with other complementary greens, etc. \n\nI would not order the cioppino, a bit too sweet and thick for my taste, even though the ingredients are quite fresh. there are better ones in the city elsewhere.  the portions are quite large (if you do decide to go with cioppino, the half portion is enough to share.\n\nCute casual and neighborhood place - worth checking out. The chef came from Anchor Oyster bar.\n\nThe second time (2018) when I returned for dinner, we ordered the salmon and a side of scallops. Both are decent (not stellar) but I got some allergic rash from the food - may want to be more careful of what you order here.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Seafood here is pretty darn fresh. Ordered the pacific oyster pot pie - astoundingly light and flaky that really dips well with the chowder. Also tried the cioppino - very tomato-ey. I really liked the shrimp, but unfortunately they ran out of clams, so substituted a bunch of mussels. The dungeness crab was good, but tasted a little over-steamed or something. The cod was kind of blah. It's pretty windy on the small first floor; if you're lucky, try sitting at the cozy second floor table, which has a view of the kitchen.", "author": "Gerald C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Pretty legit brunch, a bit pricey for dinner. With big open windows, this is a nice place to enjoy the Sunday morning sunshine in Bernal Heights! \n\nThe brunch menu is pretty small, but there were quality options! I got the eggs en cocotte. Each thing on my plate was really yummy--candied bacon, egg dish, even the toast. The eggs got a little too cheesy for me after a while though, so it was nice to have the other things on the plate to balance it out. \n\nMy boyfriend got the steak and egg sandwich, and the bites I had were so flavorful--the steak was cooked just right, the bread was really soft, and on both plates, the side salad was surprisingly tasty. I normally forget about salads, but this one had big chunks of fresh grapefruit and I ate the whole thing. \n\nOnly complaint was that there was a bit of a wait. For the small bunch of people in there with us, our plate took about 25 mins to get out to us. But we were seated right away!", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "My husband scouted this place out on one of his many sources. Made reservations for our date night Saturday at 7, easy street parking. \nThe place is small and cozy, and has a really nice esthetic comfort feeling when you sit down.\nWe were seating right away by the front door and we did love looking out the window watching the world go by. Though, their door tends to stay a tad open as people enter and being SF the draft coming in if your the person with their back to the door can be a bit annoying. Good thing my hubby has a long arm to reach behind him to continually close it.\n\nWe started with a meatball appetizer in a lovely tomato sauce, mmmmm so good and save your sauce to dip your bread in too good to waste a drop! \nOh and they serve you to start with some of my favorite, Castelvetrano mixed with garlic and olive oil eat all of these!\n\nMy husband had a mussel and Porkbelly dish which he thoroughly enjoyed, I went for what I smelled the minute we opened the door and walked in: Fish and chips! It really was a toss up between that and the salmon which equally sounded fabulous. But I kept thinking of when I walked in and how delicious and enticing that fish and chips smelled..... done and done.\nAnd I wasn't disappointed! Crispy and the fish perfect and moist inside, serve with these  crispy matchstick style fries. Really loved it, only thing that didn't do anything for me was their take on coleslaw, it just had an odd flavor. I did give it two tries, but just wasn't my cup of tea. \nWe finished our feast off with Chocolate Pot o' creme. Oh so rich and silky smooth. Glad we shared.\nRolled ourselves back to the car.", "author": "Susan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "This was our second time here and our experience is consistently wonderful food and service at this small Bernal Heights gem. Hanger Steak and Trout Almondine entrées were our selections on NYE despite availability of excellent  prix fixe menu options with wine pairings. Chocolate Pot du Crème topped with fresh whipped cream and cocoa dust is an awesome desert. Though their coffee options are very limited, the house brewed regular coffee is delicious.", "author": "Scott C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "OMG. Came here once and I already can't wait to go back. \n\nWent here on a Friday around 6pm and got lucky since we didn't have to wait. The restaurant is pretty small. We ordered the Bay Shrimp Stuffed Artichoke which was refreshing but small. I would say it was nothing special and you can definitely skip that dish. Now, onto the dish that I have been dreaming about eating again, the Vongole Manilla Clams Linguini! The pasta and the sauce were cooked to perfection. After every bite, I just kept on saying \"Omg this is so good\". The Candy Cap Creme Brûlée was also amazing. Probably the best creme brûlée I've ever had. A little bit on the sweeter side, but I love my sweets. Service was great! The only problem I had was that the food did take a little long to come.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Our meal was lovely and DELICIOUS! Thank you soooo much for taking such good of care of the 4 of us. We had a terrific time! We ordered the oyster shooter appetizer and I was very reluctant because I don't like oysters because of the texture but those shooters were AMAZING! We each got something different so everyone could try it . Everything was soooo flavorful. The restaurant was packed but I can imagine that it always is. Mike, our server, was terrific! He was such a sweetheart. He was busy, we could tell, but every time he came to our table he treated us like we were the only people he was serving that evening. We are definitely going back!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-18", "description": "In this city of casual bites and gourmet new American eats, it can be tough to navigate the waters of quality against a tide of shuddering mediocrity.\n\nMake no mistake, Red Hill Station is part of that tide.\n\nOn a Saturday I arrived and was seated quickly and comfortably by the pleasant staff.  This turned out to be the best part of the meal.\n\nI asked about the delicious sounding linguine dishes, probably lured in by their minimal ingredients (dreaming of actual authentic Italian pasta...) and fancy price tags. Sad to hear, not fresh pasta.\n\nI ordered their eponymous burger, rare. \nIn my optimism I ordered an oyster shooter also.\n\nWhat arrived was more cheese than burger, and certainly not rare.\n\nNow I don't discount a meal for a delicate cooking miss, i.e. Rare vs med rare. So that's not it. But if only you could have seen this slapdash ensemble.\n\nHave you noticed the oyster shooter was missed?\n\nAnd the misery of desiccated fries accompanying the main course. Sorry red hill, I do not love paying $20 on a burger paired with Heinz. \n\nWith a minor nudge, the oyster was remembered and created. And by that time they even offered it gratis. So basically this place when barely busy can't make a single oyster.\n\nIn any case let's summarize.\n\n- food is not delicious or fresh. i.e. no real chef\n\n- clearly cuts all corners (poor burger, Heinz?)\n\n- run by amateurs who give away oysters.\n\n\n\nIf I didn't have this hangover I wouldn't have finished even a bite. Time to get ice cream.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-19", "description": "went here cuz i saw it oh an episode of Check Please..  unfortunately didnt realize the episode was from 2015..  what a difference time makes.  you'd think it would get better but  surprise..  disappointment.\n\ni went there for the fish and chips cuz the reviewers all raved about it, one saying the portion was large (3 pieces of cod)!!!  well, despite the $18 price tag for it, i ordered it, and when it came,  to my surprise, the portion that was huge was the chips (thin fries and not the large style country \"chips\" you'd think came with it)  and, lo and behold,  not 3 pieces of fish, just 2!!!  for $18 !!!!\n\nwell, since there was no turning back the clock i tried the fish (note, they were not large thickly cut pieces,  but rather thin and two pieces no longer than maybe 5 inches each.   i expected the firm resilient but moist texture of a good codfish, but this was not that..  it was on the softer side, giving me question,  cod??  can't be sure.  \n\nguess i should be more careful next time and get an updated review before trying it out.", "author": "dee c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "Ugh. Been coming to RedHill the past few years every so often when craving solid seafood. WAS my fav restaurant back when they had true thin shoestring fries and Oregon bay shrimp... Unfortunately had one of the worst $22 vongole clam pasta dishes recently there. No flavor, all clams were over steamed/out of shell and rubbery, and the broth had been reduced to a gel like consistency that wasn't worth 2 bites. I think because I used to love this place so much I'm extra bummed... please don't lose your edge red hill!", "author": "Grace M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "The hubby and I decided to try something different for our anniversary.  We had not planned anything.  We decided to try Red Hill Station.  \n\nWAIT TIME:\nThere was about a 15-20 minute wait, which wasn't too bad.  The group of 3 that arrived right after us was told the wait would be 30 minutes...so it's very dependent on how many people decide to go on any given night.  The restaurant is small and pretty much full the entire time we were there.  I recommend reservations, especially if there are more than 2 people in your party.  \n\nFOOD:\nWe started off sharing a glass of French white wine (can't remember the name) which was excellent.\nHanger steak with vegetables: both the steak and the vegetables were delicious.\nAndouille sausage and clam pasta with garlic lemon sauce.  That was FANTASTIC!  It was very lemony.  Even my husband thought it was fantastic.  \nWe had the funnel cake with blueberries and strawberries and decaf coffee.  Funnel cake was not quite as crunchy on the outside as I like, but it was delicious and not too sweet.  The coffee was strong, just the way I like it.\n\nAMBIANCE & NOISE:\ncasual and not too loud.\n\nSERVICE:\nOur waitress was pleasant and helpful in explaining the items on the menu that I was not familiar with.\n\nI will DEFINITELY go back!", "author": "Jane T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "I loved Red Hill Station.  And I definitely see what the buzz is about.\n\nEverything we ordered was great.  Friendly and helpful staff. The place is small so the tables are close together which is a down side, but we went early, just as they opened, so we didn't have to wait or fight the crowd.  In fact, we had the whole place to ourselves so neither were we bothered by the closeness of the tables.\n\nWe had:\n\n+FISH N CHIPS (5/5) - Best F+C I've had in recent memory.  Perfect batter, perfect fry, perfect texture of fish. Heaven.\n\n+CALAMARI CAESAR (4/5) - Delicious.  We shared it.\n\n+PESTO PRAWN - (4/5) - Nicely put together.  Loved the pesto.  So many restaurants overdo the salt, but this one was balanced just right!\n\nThis is a restaurant that I wish was in my neighborhood.  This would be a once-a-week stop for me.  Kudos to the chef.  Out of the way for us, but I will definitely go out of my way to get to Red Hill.", "author": "Darien R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "This was our first time at this fantastic neighborhood restaurant. The food was delicious (caesar salad with calamari, pasta with clams, perfectly cooked halibut,) great and affordable wines, amazing homemade bread and fantastic service. (Juliana is awesome!) The funnel cake topped with whipped cream and berries for dessert was unbelievably good. Can't wait to go back!", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Walked in for Sunday brunch/lunch. We had cioppino and pot pie (oyster/bacon/leek), and finished with candy cap mushroom crepe brûlée - all were exceptional.  Service was knowledgeable, friendly, and attentive.  First time - definitely not last!", "author": "Monique Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Almost everything was perfect. Amazing food and great service. What a gem. The clams, mussels, hamachi, bread, and olives were all superb. With some tasty beers to boot.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Best meal we had in San Fran. The calamari Cesar salad was so freaking good, I started tearing up. The fish and chips were great as well. And you start with some house made bread and olives. Such a great find. Plus you're in bernal heights so go climb up the hill, eat here, and finish with a cocktail down the road at Holy Water.", "author": "Kaitlyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-02", "description": "I was exploring SF with my friends when this restaurant shows up on Yelp. 4 and a half stars, why not try it out? \nWe got the Cabenera Linguine and I think the grilled hanger steak, forgot what it was called but it was the only steak dish on there. \nCabenera Linguine - it was okay, kind of dry. I could tell if I wasn't sharing it with my friends I would've gotten sick of it quick.\nSteak - Really good, but pricey. I do recommend getting this dish though. The meat was medium - medium rare, but it was super juicy and tender. It came with a bunch of different veggies and their special sauce I really enjoyed. PS: they don't have A1 sauce.\nService & ambience - This is a very small place, kind of hipster. Everyone is really nice, but the service is really slow.\nOverall, 3 stars for good food but overpriced. Worth a try, but I wouldn't come back.", "author": "Yvon D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Such a delightful place with beautiful delicious food. Great menu simple yet offering a diverse array of seafood specialties. They have burger dish and non seafood and kids menu. Quick and friendly service. We sat at the bar facing the kitchen! The best view in the restaurant for me and my husband. The kitchen team is so very young (19 and 20 yr old with such impressive culinary talents and expertise) so talented! So much fun watching them prepare all the delicious meals! We lucked out - Thursday night no reservations and got a seat right away - 630ish. We shared the hamachi salad it was like buttah mealtime in our mouths- fresh great size hamachi slices!!!! I ordered the linguine with andouille sausage and clams. The sauce was so delicious and the dish was cooked to absolute perfection! Husband ordered the skirt steak and prawns and he devoured it! Again cooked to absolute perfection!!! Highly recommend and this is definitely one of my favorites in the city!!!", "author": "June R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-31", "description": "At the risk of sounding like a real estate listing, this quaint Bernal Heights eatery bears a resemblance to my childhood home; details as simple as moulding and a door frame sparked nostalgia for that time in my life. \n\nA few ingredients were noticeably missing from our plates -- a pinch of salt & a dash of creativity would've enlivened dinner. We ordered: \n-- a side of fries: enough thin, limp fries to feed six.\n-- artichoke stuffed with bay shrimp: as our waitress promised, shrimp were not fishy tasting, very mild actually. I don't think any part of this appetizer was seasoned. \n-- halibut: this had a nice salty-sweet brown butter sauce. The fish itself was firm & mild, which obviously I like, but not a tastebud pleaser on its own. His steak dish had the exact same components as my fish one: potatoes, Brussel sprouts, red pepper, nothing to differentiate one dish from the other. \n\nFrom crudo-type appetizers to pastas, Red Hill Station highlights seafood in all areas of its concise menu. The neighborhoody atmosphere, the familiar interior & layout, friendly waitresses -- all elements that make me want to return...if only they'd wave their magic wand to bring their flavors to life.", "author": "Fancypants X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "I really wanted to like this place as my gf's hubby is a foodie, and their previous dinner here was great.  My gf couldn't say enough of the linguine. \n\nFour for lunch yesterday at 12:15pm.  One table of two already seated.\n\nOur server was prompt to take our drink orders, then starters and lunch entrees.\n\nI ordered a cup of coffee.  Served in a cute cup and saucer.\n\nWe each ordered two sweet water oysters from Hog Island.  Very fresh.  Served on an iced paella skillet.\n\nI decided on the Alaskan true cod fish and chips.  In my mind I'm picturing steak type fries.  My entree comes and the cod is atop a huge basket of skinny brown colored wimpy fries.  Ugh.  Not at all to my liking.  The cod is very good.  Nice and crispy coated.\n\nImprovement needed - service was very very slow.  We got the oysters in reasonable amount of time.  Then it was wait, wait, wait.  Maybe 15-20 minutes.  And I had to request a coffee refill.  \n\n3.5 overall stars as service was very slow and my fries were inedible. \n\nAs we left the restaurant was 80% capacity.\n\nI'm reluctant to give it another try as I would need to cross town to come.  But one of my friend's monterey grilled squid salad looked so delish.  She cleaned her plate.\n\n$30 p/p inc tax & tip.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "OK so I won't be going there on a regular basis because it is on the pricey side.  That said there are a few places I don't mind splurging a little because the food is excellent.  Red Hill Station is one of them.  We made a reservation on a weekday eve so didn't have to wait.  The three of us had a great experience from start to finish (we decided to share everything): they gave us olives and bread to nibble on while we waited for our food.  The bread was warm and delicious and the olives were out of this world.  Then we had:\n\n*Amazing calamari salad\n*The best fish & chips in San Francisco\n*Beautiful and delectable salmon in flaky pastry cone crust with vegetables, magical...\n\nI hope you get a chance to try it.\n\nOh I almost forgot to mention the great service we had: our waitress was so sweet and efficient, we even got extra olives :)\n\nGoodness", "author": "Monkey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "What a wonderful restaurant. Delicious food and wine, great service, and a lovely location. Fresh baked bread straight out of the oven and warm olives were a nice touch. We'll be back!", "author": "Emma A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "This place is perfection. Vibe is on the quiet side, non pretentious. Oysters = well-shucked and delish. Albacore tartare = want to eat it forever. Linguine alla vongole = incredible flavors of lemon and sea, al dente, soooo goood. Service was a little slow, but with all this great food and company, who cares?", "author": "Sara B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-03", "description": "I hate being lied to...especially when there's proof...\n\nAfter having Red Hill Station bookmarked for several months, my girlfriend and I decided to give them a try.  I hear they can get busy so I made a reservation on Opentable.  \n\nFor an appetizer, we decided to split the carbonara ($16.95).  The waitress' recommendation was amazing!  The sauce was creamy and topped with bacon and breadcrumbs.  Splitting the dish is recommended.  The size was perfect as a starter and the sauce would've been too rich to eat as an entree.\n\nFor our entree, we were both interested in the cioppino.  Being that I'm allergic to fish, I had ask if they use a fish stock before we ordered it.  Our waitress went to the kitchen and came back to inform us that they use tomato sauce and chicken broth and they would be able to leave out the cod to accommodate my allergy.  We went with a whole order ($35.95) for the whole crab (opposed to $23.95 for half a crab).  \n\nWhen the cioppino came, it was in a huge platter, but something was wrong.  There were two tiny pieces of crab.  My friend and I had blank stares on our faces wondering where the rest of it was.  We spoke to who we appeared to be the owner or manager who said that's how their cioppino is usually served.  She informed us that \"whole\" and \"half\" on the menu meant the size of the order, not the amount of crab.  We let her know that our waitress had told the other table that it meant a half or whole crab.  She was apologetic and mentioned she would take the cioppino off the bill which I thought was a nice gesture.  Seriously though, I would NOT pay $36 for what appeared to be half of a crab body chopped in half, mussels, and what tasted like canned tomato sauce...and what do they do with the rest of the crab?!  The dish is skimped on the seafood and consisted mostly of tomatoes.  Not worth ordering.\n\nMy girlfriend was convinced she saw crab legs.  When we got home, she texted me a picture of what she found on Yelp...cioppino with crab legs and all.  Please don't lie, especially when there's proof on the internet.  \n\nWHAT TO KNOW:\n*Menu changes especially desserts with seasonal fruit\n*Tables are tiny.  If we were the first party dining, why would you seat the next group who walked in right next to us instead of spacing parties out!?\n*They don't pay attention to their menus.  Not sure if they used the same menu for both lunch and dinner, but our menus said \"lunch\".  When we got dessert menus, one of us got a menu with pear desserts, the other with mixed berry desserts.  The pear menu was old...\n*Metered street parking which was easy to find on a weeknight", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "I'd suggest this place as a textbook example of a perfect Californian / San Franciscan neighborhood gem. Great fresh seafood, relaxing and non-stressful setting, great price. I love bringing out of towners here.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-28", "description": "Lively little place with a good-humored staff & hefty portions.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Everything was great and we felt just like we were at home. Good was so fresh and delicious. My husband who hates going out loved this place, though he was disappointed they don't serve iced tea. Great neighborhood spot!", "author": "Liz F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "Best place for oysters and service in SF! Hit up the oyster happy hour. Staff are friendly and prompt. Service exceptional. Food quality , superb.", "author": "Shaun Monica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Yum yum yum. Best meal we've had since we arrived in the States. I had a super rich but delicious linguine carbonara with just the right amount of chilli flakes and maple bacon (*drool*) and he had a fresh spring salad with grapefruit, fresh greens, peppers and the most delicious, fresh chargrilled calamari ever. Yummo. \n\nAdded in a crisp glass of rose for $10 and a lovely 21st amendment beer for $5 and we had a perfect late night meal to welcome us to San Fran. Not cheap though - all up including gratuity was around $65", "author": "Gemma H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Took my impossible to please father to this spot, and neither of us left disappointed. Well managed, good value, lots of attention to detail. The pot pie flight was a treat, and my trout and veggies were beautifully prepared. Deserving of its high rating here. Happy hour, 3-6 PM, gets you cheap oysters and drinks. Beware reviews from yelp accounts with internet photos and only one review.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "I hesitate to give four stars, but I really can't put my finger on why I initially thought the place deserved three, except that the service seems a bit forced. The food definitely is four stars, and the ambiance is good for dining alone for lunch. I didn't wait long for my orders because I dined during a slow time.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "Outstanding (and somewhat unusual) food!!  I had a fish dinner, and crab and salad.  Great service, too.  I didn't give 5 stars simply because the place is kind of plain;  not elegant.  And for the $$$, I'd prefer some elegance.  Maybe I'm old-fashioned... but it was indeed very delicious.  Hats off to the chef!   :-)", "author": "Fred Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "I love to eat. This place I could eat at daly. It was my first time and the cod was done perfectly. Great find, I will be back.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "This place was amazing! Great food, coming back!! Wonderful service, great oysters. Fish cooked to perfection, let the waiters choose for you!", "author": "Diana X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "This is a really cute neighborhood spot!  Get a table by the window and watch people of Bernal Heights go about their business...\n\nThe caesar salad with grilled calamari has got to be one of the very best things I've ever eaten...in fact, I ordered TWO!  I shared the first one with my family but the second was all for me.  We also had oysters on the half shell, clam chowder, mini pot pie, and carbonara.  Everything was cooked to perfection but what really stood out was the delicious light broth in the clam chowder...yes, I did say broth, not the thick heavy white creamy soup.  And I love the fact that they used a mixture of shellfish.  The pot pie was insanely yummy.  Now, I am not a fan of carbonara but we ordered it for my husband.  I really liked how they made it and would definitely order it (from Red Hill only) again...that says it all.  \n\nGo eat there everyone...not to be missed!", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "We discovered this location after seeing a review on Check Please! Bay Area. Both my wife and I had the mussels with chorizo broth which was absolutely awesome, and others nearby had various other seafood dishes that made my mouth water while we waited for ours. The staff were super friendly and attentive as well.\n\nWe would both recommend this place and plan to come back whenever we are in the neighborhood!", "author": "Erich N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Had a wonderful meal here with a friend. Other restaurants in the area were over an hour wait on Thursday evening but we were able to get in quickly. \n\nThe bread service was delicious with olives and roasted garlic. \n\nWe shared the tuna tartare but I really wish u could have had it to myself. \n\nWe ordered the fish tacos because SF. they did not disappoint. The fish was meaty and cooked excellently. Well balanced flavors and very filling. \n\nWe probably went overboard when we went for the special. A whole crab in warm buttery garlic broth. Fingerling potatoes and half an artichoke made this dish spectacular.  I wanted to have the broth to go. \n\nService was lovely and friendly. I'll definitely be back.", "author": "Robert D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "I stopped by and had a Caesar Salad with Calamari and it was deliscious!  The calamari was grilled and served warm in a bed of romaine lettuce.  Dressing was excellent with crunchy bits sprinkled all over.  Great contrast of having warm calamari with cold salad.  Great portion.  Was worth coming here from the east bay.   I highly recommend this place if you are in the city looking for a local restaurant in the Bernal Heights area.  Mike was my server and he was excellent.  He checked in on me and filled my half full glass each every time he came by.  Friendly staff, excellent food and reasonably priced.  I met Amy and she was super nice as well.", "author": "Larry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "My Sweetie and I just discovered Red Hill Station. Having just returned from a long trip outside the USA I was hankering for a delicious American meal, and RHS delivered. I had the delish fish tacos, house Pinot at happy hour, my sweetie had oysters which he praised and devoured in seconds. His main course was pasta with clams and we both loved it. Homemade bread was wow. The whole thing was a great new find which I know will be one of our Go-to eateries! PS ask for the green and red salsa with the tacos, it doesn't come with it, but it makes it!", "author": "Bridget K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "So good. Delicious halibut. Great service. Really enjoyed the oysters and wonderful white wine - like a sancere but something else recommended by our excellent server.", "author": "Seth B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "horrible service. Waiters are lazy and don't have exact time of when things will be done. Worst experience of my life. don't waste your time if they are busy. will not take care of you.", "author": "Mecedes G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "No waiting. The service is very friendly. Love their bread! Salad was very yummy. I didn't really care for my main entree not sure how to explain it. Funnel cake was also super good. Might not come back next time. But a great experience.", "author": "Jennie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "This is my second visit to this restaurant. \n\nAnd I am coming from Rockford, Illinois to eat there.\n\nWhenever I have a friend or colleague come out to the Bay Area, I make sure to direct them to this restaurant. Taylor and Amy have gone to great lengths to make this restaurant a premiere place to eat.\n\nI was never a fan of calamari unless it was deep fried. Taylor has added it to the Caesar Salad and it is fantastic. \n\nI also tonight had a staple of the restaurant - the fish and chips. So many fries and two huge pieces of cod. Both excellent. And make sure you eat the slaw because that isn't just colorful garnish. \n\nDessert - the creme brule - was also phenomenal.\n\nMake reservations well in advance. Do not pass this place up!", "author": "James O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Nice place in a new, one-block gourmet strip near Gen Park. Two-level effect with a nice stairway down the middle. Copper-sheathed tables (warmer than it sounds). Service is friendly and likes to chat when it's not too busy.\n\nThe flight of meat pies is as good as it sounds. They make to order, and the pies are wonderful. The oyster pie had a little too much tarragon, but just a little: do not omit the tarragon! The beef pie was, well, rich and full and wonderful. The clam chowder pie was, for being white clam chowder, really fantastic.\n\nWe ordered the calamari salad due to other reviewers, and they are right: it is great. Tender squid, fresh greens. Dessert is good, and it's easy to eat too much (i.e. all of it). Bread pudding neither soupy nor dry.", "author": "Richard H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-14", "description": "You must have the calamari salad. The best I've ever tasted.  Five plus stars. The other seafood was four stars.  Dessert three stars (bizarre funnel cake apple concoction). Service was excellent and very friendly!", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Excellent food and seafood and appetizers. Good service. A very enjoyable dining experience, did not disappoint unusual for this fussy couple.", "author": "m j l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "Yeah, it's great and seafood focused.  Get the oysters (steamboat FTW), the calamari salad (not fried, but tender and delicious), or the \"red meat trout\" (which is salmon-like and delicious, especially when served seared with brown butter and pan-fried sage).", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "OMG, what a cute little charming place in Bernal Heights!  This two months old seafood-centric place is brought to you by two Anchor Oyster Bar alums.  Since I love all kinds of seafood, I am always on the lookout for new seafood restaurants.  So, on this Thursday night, I dragged Mr. J out to get a head start on the weekend.\n\nRed Hill Station offers a small intimate menu because it changes daily.  Mr. J and I got 3 appetizers, 2 entrees and 1 dessert.  I can't believe I forgot to order the oysters.  D'oh!  I was sad because they ran out of the black cod.\n\nThings we had:\n\n--- Caesar with fresh seasonal Oregon Bay shrimp - The light and tangy made to order Caesar dressing was in perfect harmony with the romaine and shrimp.  I am not a big fan of these tiny Bay shrimp because they are normally 'fishy', but not these ones!\n\n--- Fried local fresh anchovies with pesto di limone - Just one word, ah-mazing!  This got to be my favorite dish for the night since I am still raving about it!  They weren't kidding when they said the anchovies are lightly breaded.  The breading was so thin that you don't even notice yet still added that extra texture.  I dislike overly breaded things and this is not one of them.  The pesto and the white sauce goes swimmingly with the anchovies.\n\n--- Wild Ft. Bragg King salmon tartare with chives and red onion, crostini, micro arugula - Another light and refreshing dish.  The cracked black pepper on the toasted crostini was a great touch.\n\n--- Grilled fresh Monterey calamari with roasted white peach and black fig vinaigrette, summer roasted cherry tomato and vegetable salad - Wow, it was beautifully presented and perfectly grilled.  Yumm...\n\n--- Torchino pasta with cove mussels, savory clams, corona beans, fresh garlic, white wine, oregano, parsley, Italian sausage, pangrattata - This was probably my least favorite dish for the night, it was a bit 'too busy'.  I think it would be a better dish if the pasta was more al dente and the beans were taken out.\n\n--- Lace cookies and cream, organic blueberries, strawberries - We were so full already but we had to try dessert.  Thankfully, this dessert was very light and not too sweet to wrap our night up.\n\nEveryone at the restaurant were so friendly and attentive.  Everything were reasonably priced and their portion sizes were very generous.  Couple little friendly suggestions though...  It would be nice if the windows can open up.  It can get a little stuffy in there.  Also, maybe get some black linen napkins as well.  I was wearing black and the white linen napkin shedded tons of lint on me.  Not a super big deal.  Mr. J and I will definitely be coming back for more!", "author": "Kay Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "This place is amazing. Good food, good wine. The servers were extremely accommodating even though we weren't aware that they take reservations. We waited for over 20mins but they kept apologizing and provided us a table to sit with bread while we waited after we decided to have take out instead. Definitely recommend this place to anyone. Make sure you make a reservation!", "author": "Er Wynn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-23", "description": "My wife talked me into going there. It was good and we knew what to order before we got there. Seafood salad and fish n chips. Why this combo? No reason. First, the salad - A blob of soggy greens surrounded by grilled seafood, which wasn't bad. But, for 20 big ones, can't my greens at least stand firm for the first few minutes instead of lying there in an overly absorbed in an olive oil lump? I guess not. The fish in chips were...well, at least the fish, was excellent. The chips? I believe they ran the fries thru the ocean before settling in the bowl. Man, talk about salty. I thought a slightly less dash or two would do. Over all, not bad, not great. The City is full of haunts just like this....", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "First off we are super excited to have a seafood themed restaurant in Bernal. We went over for grand opening last night.\n\nWe were seated relatively promptly for our 8pm reservation. The place was packed and I'm glad we made a ressie before hand. We got some oysters to start us off. (Very fresh!) Couple glasses of wine and some beer. Ceasar salad with bay shrimp shared with the table (delicious!) And we all had the sea trout with browned butter, asparagus, carrots, fingerling potatoes, topped with some crunchy almond! *sooo good!*\n\nToo bad we were so stuffed, otherwise we would have the dessert, mission pie with Mitchell ice cream. \n\nI'm excited about this new addition to our neighborhood. Can't wait for them to expand the menu and some happy hour offering!", "author": "Winnie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "This review is overdue.  I've been to Red Hill Station four times now, and it does not fail.  Oysters fresh, amazing, briny; the shooters (and I'm not usually a loaded oyster eater hahaha) make the oysters even greater.  The cioppino is also spectacular--my friend and I shared a large and were more than satisfied.  Bernal is low-key, so parking isn't the hassle it can be other places.  I'm pretty burned out on the SF restaurant scene, but I can't say enough about this place--I'll keep coming back.", "author": "Kennau K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-05", "description": "Not good enough.  Not particularly comfortable, very noisy, extremely mediocre (is that an oxymoron?) food, lifeless service.  The lighting was broken and so were all the beer taps.  And expensive.  I came here once before and thought it was a sweet little scene.  Maybe the A-team had tonight off, but this was very disappointing and I won't be back.  Too bad, but there are much better options at these prices...", "author": "Sammy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Best seafood place in the city. everything was FRESH and delicious.   The clams, oysters, cod and halibut were ordered and I don't know how they do it but they must have  a fish whisperer chef to prepare it so well.", "author": "mary g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "this place is ALWAYS GREAT!!  the food, service and ambience are PERFECT.  We ordered the hanger steak (really was cooked perfectly and the sides were all tasty as well,  the almond pesto wit prawns was nicely creamy and a unique blend of tastes done so well  the beers on tap offer a fine selection, the deserts that we ordered were fantastic the chocolate pot de creme super yummy the candy cap mushroom desert was a  unique savory and not overly sweet desert.  All in all a really good local restaurant and away from all the tourist hang outs,  still a unique spot in San Francisco", "author": "Tim R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "Been going there on a regular basis, today I was waiting for a table for one and the waiter decided to give it to the straight couple who came after me.   Last time I will support this place.", "author": "Susanne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "This is a transcendent food experience. If you are looking for a place to quickly shove familiar food into your face do not come here. If you are looking to enjoy delicious food carefully crafted to be both artful and homey at the same time this is the place. \nEvery time I have been here I have received excellent service, and been treated to food that is simultaneously surprising and comforting.  This is a difficult feat to pull off.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Yummy! This place fills up quickly. Our waiter was friendly and upbeat in spite of how crowded it got. The oysters he chose were great and my linguini delicious !! Excellent service and food and cool space", "author": "Cecilia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Red Hill Station is a hit! Neighborhood gem. We adored our meal in every way. First. Staff responsiveness & service are outstanding. They know their stuff & are really happy to have you. Each course was a dream version of the particular dish- the shrimp in avocado salad? Devine interpretation. The lamb chops? To die for. The chicken pot pie with filo dough crust that was crispy & chewy at the same time??? And went on forever??? With chicken & veggies in a light savory creamy chicken stock? Well, let's just say it was The Platonic ideal of 'Chicken Pot Pie'. When we thought 'things cannot get any better than this', we got our dessert of chocolate pots de creme. Mon Dieu! Over the top!! What a fantastic restaurant. Can't wait to go back when we're in Bernal again.", "author": "Lin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "This little secluded spot is awesome. Awesome! I got the pot pie sampler: one was clam chowder, the second was oysters, and the third was like a pork shoulder barbecue. It was essentially three of my favorite foods served inside of one of my other favorite foods. \n\nThe crust was flakey and light, flavorful and fantastic. The fillers were inventive and tasty and just sooo good. \n\nThe waitress was sweet and attentive as well, and it was one of those great restaurants where you don't have to shout to hear each other. I had a great time!!", "author": "Medina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Genuinely a fantastic place. Went here tonight for a friend's birthday and we had the private room in the back. The food was amazing - best mussels I've ever had (and I've had a lot!) And the funnel cake dessert was great too. Plus amazing wine (petit bourgeois sauvignon blanc). Chris was our server and was fantastic - attentive enough without being too much. The whole evening was excellent. Despite living way across the city from this neighborhood, I will be back!", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "Everything was awesome. Had oysters (fanny bay, Idk how to spell them but they were big and delicious) and a burger. Burger is on the small side for 16 dollars but it was quality and came with a deep fried pickle (a first for me). Blood orange soda was a good choice too. \n\nBrass tables and mason jars for water...all around a cool little spot. My only complaint was the music from the kitchen bleeding into the floor music. Server was nice and attentive though.\n\nDefinitely a great Bernal heights eatery. Fully recommend.", "author": "Cooper L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Amazing place with frequent menu changes. This place is really delicious. Can't go wrong with anything on the menu.", "author": "Joaquin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Before writing this review, I scrolled through the previous reviews and was a bit miffed at the *10%\" of bad/displeased reviews. I tend to be one of the harder to please especially for these types of finer dining establishments but was AMAZED by the food here.\n\nWe started with the Cesar Salad with calamari and it is the best salad I've had period. The waiter highly recommended it so we had very high expectations which were easily surpassed. The dressing is apparently made individually for each salad and they apply the dressing and Parmesan to each leaf of lettuce individually before stacking it back together. Instead of hard croutons, they do this crumb topping which is tastier and easier to eat. The calamari was as tender as it was flavorful and deserves it's on paragraph.\n\nThe wife ordered the Vongole with clams which came out perfectly al dente. I ordered the cod which came on a bed of corn/bacon and it was an awesome dish as well. I wish I could describe these better but you'll just have to try yourself. \n\nFor dessert, we got a mushroom cap creme brulee...yea....weird right???? It was fukin awesome too! So much so I ALMOST ordered a second but the pinch of my belt reminded me to refrain.\n\nI'm going back this weekend and hope to repeat the experience again! This has become one of my top nom ethnic favorite restaurants in SF hands down.", "author": "Mike H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "Too high a price for the money, fish is not tasty, don't know what happened to the food they once did, before the fish was delicious.", "author": "Viviana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Just enjoyed an amazing dinner at Red Hill Station. Four of us with different entrees\nand each one was amazing. \nWill recommend to all our friends who visit SF\nComing back to the city in March and will definitely revisit.\nThank you", "author": "Jack B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "I love this place, great food, great service and it's right in my hood local.  Happy Hour specials are a delight!", "author": "SF L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-10", "description": "The preparations sound good and the ingredients are good quality and fresh, but the flavors are just lackluster. I've had the carbonara, the fish & chips, the ceasar salad...maybe I'm just ordering the wrong things. If you mild subtle flavors to punches of vivid flavors, this is the place for you.", "author": "Marina N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "We came on a Sunday night so the restaurant wasn't busy. Even just with the two of us, they let us sit at the large table upstairs with a window facing the kitchen. It was quieter upstairs since we had the whole room to ourselves, and we got to see the hustle and bustle in the kitchen, so we really appreciated the staff for letting us do so. \n\nFor starter, we had the fried smelt with pesto and Caesar salad with calamari. Boy, were they good! The pesto really cut the fishiness of the smelt along with a side salad as a palate cleanser. The calamari was piping hot when it came out, very peppery and juicy, with good texture. They did an excellent job with the calamari. The main course was clams with wine sauce. The clams were fresh and the wine sauce was a delicious broth with butter, thyme, lemon and some bits of garlic. I wanted to pick up the pan and just drink the broth by itself. Our dessert chocolate pot de creme was rich and decadent with chocolate and light and fluffy with the whipped cream on top. The bit of almond extract in it made it a little different from other pot de creme I usually get. \n\nEverything was delicious and the staffs were friendly and attentive. Thank you for a fabulous meal and we will definitely be back!", "author": "Sunny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "A neighborhood joint focusing all things seafood, this is a great place to share a meal with friends. The prices are higher than neighborhood joints of yore but the big portions make up for that. This is food you will want to share. Rather than everything being two bite \"tapas\" the salads are large enough to be meals themselves.\n\nThis is not fancy food, this is very basic but delicious seafood staples. The menu is not huge and if you aren't a seafood or fish fan do not come here. Ordering a salad and an entree is more than enough food for  two people.\n\nBeing gluttons we ordered too much food. They had four choices of oysters from Marin and Washington State and we got 8 at $2.50 each. They were large and fresh served with a simple mignonette.\n\nThen we had the stuffed artichoke with bay shrimp. There was good portion of shrimp and the sauce, fresh beans and beet was a great addition but the artichoke leaves were a bit tough. Would probably skip this dish again.\n\nOur salad  was Baby greens with lardon, fried soft boiled egg, burrata, radish, red pepper, asparagus for $13. The portion was large, the scotch egg was great, the lardon was actually just strips of bacon rather than lardons. It was a very satisfying salad.\n\nWe finished with Cod Fish and Chips, slaw, lemon aioli, fries. two pieces of cod that were crisp outside and tender inside but the batter could have used some salt.\n\nWe didn't have a reservation so sat at small counter that sits 4. There is a private dining room up a short flight of stairs. The bathrooms are no wheelchair accessible up a flight of 4 stairs and very tiny. Service was friendly and casual. The menu on the website is out of date. \n\nAll in a good neighborhood seafood place.", "author": "DeathandFood H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-10", "description": "When a new place opens in your hood and everyone you don't know (because they're from other neighborhoods) shows up there to chow down, you can assume the chef has a good history. This one does, but The Missus and I waited because this place is always slammed.\n\nWe got them on Mothers' Day between the rushes. Oeufs en crocotte are basically frittatas, right? Nope. They are richer here, with yolks just slightly overdone, but considering we ordered them ay 2 p.m., not unexpected.\n\nThey have generous but not-too-big portions. The fish tacos were flaky and lovely. The slaw in the tacos was no-vinegar purple grace. \n\nAnd the waiter was perfectly non-obsequious. The elevated back room is quaint but not twee, and has better acoustics than the main floor. If you don't have a wait, go.", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "We love both the brunch and the dinner menu here. The seafood is super fresh and everything I've ordered has been delicious.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "So apparently this place does take reservations and if you show up in person then those online reservations bump you down. We were told it would be an hour wait...an hour and a half later I check with the hostess and she tells me they received two new reservations so ours was pushed back. How is an online reservation worth more than an in-person reservation?? What a dump.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "I'm a Bernal Hill local and am thrilled to have such a wonderful restaurant close to home! I've been to Red Hill Station several times, and on each occasion the food was excellent and our server, Jenny (who waited on us two times), was super friendly, efficient, and always at hand when we needed something. I can't say enough good things about Red Hill so I will simply continue to show my appreciation by eating there regularly!", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "This was our go to dinner spot in SF... we would drive from the sunset every week or two for a night at Red Hill Station.. Why? The food is local, fresh, unbelievably light and creative. The prices were SO reasonable for the quality of food. The menu was always changing with such interesting items that were always truly incredible. I've never had such fresh fish in my life. My boyfriends family from the South Of France came with us one night while visiting, and they were a hard crowd to please, and man  oh man, every single one of them were raving about this place. Truly one of the gems of SF and as a foodie, I would go as far to say it is one of the top 3 restaurants in the bay area. \n\nHIGHLY HIGHLY HIGHLY Recommend! I've never been disappointed with the service, the simple and cozy decor and most of all by the incredible food!", "author": "Lucy O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-07", "description": "SCAM RIPOFF! CRAB SEASON CLOSED! That's what we were told at least. \"There will be no crab in your stew because the crab season is done.\" We came here especially to have the cioppino and I am so disappointed! It's unreal that we paid more than $120 for tomato soup with a TON of clams and mussels. There was a playing card size fish chunk and about a handful of fresh oregano s well as a small slice of garlic bread. All of the flavors were great but slightly spicy for some. Personally I prefer oregano to be taken off of the woody branches. There's nothing quite like eating a few weeds with every bite.  That might work on the tourists but you should really watch out who you lie to about the food you serve. You might just lie to the wrong person who actually has a fishing license and goes for crab.", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "The FOOD was amazing!!!!! This will be my first stop for sure for fish and chips! I do have to note that the service was extremely bad.  We ordered another plate and she didn't place the order...we needed malt vinegar, we had to get up and ask, we needed salt, we had to get up and ask while she was on her phone and also eating her dinner.  I understand bad service when you're busy, but it wasn't and when we had to continually get up, our waitress was eating carrots and texting on her phone. Nonetheless, the food was so fricking so good we tipped over 20% and was happy when we left --- great quality great food!  A must ----", "author": "Honest Ratings D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Hi:  I'm lucky enough to spend a couple of months in San Francisco each year. One of my first stops is Red Hill Station. The food is excellent. My favorites are the hanger steak with shrimp and fresh veggies and the vongole. Not much for desserts BUT the pot of chocolate and the crem brûlée are exceptional! It is a tiny place so go off hours or call for a reservation     .", "author": "Donna M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-22", "description": "This is my second time trying this place, and both times I've been disappointed. It's unfortunate as I love seafood and live in the neighborhood. \n\nService: The service was extremely slow both visits. The waitress also had inaccurate information about wait time. She said ten minutes, but we ended up waiting over 30. We were seated in this awkward bar area in front of kitchen where I could barely get into my seat because it was so close to the couple next to us (and I'm not a big person). The waitress didn't have enough space to even place the dishes in front of us - she has to slide them down the bar, which was a bit strange. We didn't get any food besides bread until 50 minutes after we were seated. We ordered oysters, and those didn't come until our entrees were ready. \n\nFood: The food wasn't bad but nothing stood out. Some was over-salted, and other items were under-seasoned.\n\nHighlight: The helper/bus person was really professional and took up most of the slack of the waiters. He came to check on us often and kept a really positive attitude servicing all of the tables that night. I even saw him help with shucking the oysters after the waiter was completely failing (waiter was basically stabbing the oysters and seemed like he had never done it before although he was there the first time I visited).\n\nOverall underwhelmed with the experience. The place isn't expensive, but totally not worth it for the quality of food or service.", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "We've been here three times and the end result is: INCONSISTENT!\n\nSome days, your cioppino comes with crab legs...some days, it doesn't.\n\nSome days, you get bread and olives...some days, you have to request them.\n\nSome days, your food comes out in a timely fashion...some days, you may wait as long as 45 minutes.\n\nAll days, the waitstaff are incredibly slow and don't seem to care about the customers -- unless their buddies come in, which makes service grind to a halt.\n\nIt wasn't until the couple next to us informed our group that Taylor, the owner/chef, decided to go from working all opening hours to just 3-4 nights a week, that we figured out the dirty secret.  The other days, the scrubs working in the kitchen are just horrible and don't care about the food they are plating.\n\nIf you want to open your own restaurant, the business is tough with horrible hours -- and you need to be there EVERY DAY at least for the first year.\n\nTHE SECRET: Phone ahead and find out if Taylor is cooking that day.  If not, RUN AWAY!", "author": "Louis A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Wow!  Just wow!  Came here with friends and trust their choices.  This place hit it right on every note.  Maybe because I had not read anything about this place, nor seen it featured in Check Please.  Lots of seafood and fish to choose, either tartare, grilled, with linguine or in a cioppino.  Dishes are seasonal.  My halibut was served with a bagnet vert, heirloom tomatoes and kumquats.  The cioppino all about the sauce, rich and savory with lots of bread for soaking.  We finished with a pot de creme and the desert special, coronets filled with cream and zabaglione.  The latter definitely worth saving room for.", "author": "Kristin U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-14", "description": "Overpriced small portions in a pretentious atmosphere with unacceptably slow service. My wife and I agree that they must not have put in our orders for a good 25 minutes after we ordered. I don't get it, we arrived and the place was basically empty today. We ordered our food and an orange juice, the waiter brings us 3 olives (seriously three olives between two people. wtf) to tide us over and a half full glass of orange juice. We proceed to wait well over 30 minutes for an ahi tuna salad and a stuffed artichoke, neither requiring extensive prep.\n\nBy the time the food arrived we were on our second plate of 3 olives, my wife had long ago finished the juice and the waiter had finally offered to bring us a plate of bread. A $50 lunch bill for two simple dishes including a forgettable $20 lunch ahi tuna salad with a meager portion of ahi. I was halfway through the salad when our waiter offered pepper for the salad. Un-freaking-believable. \n\nYet another overpriced restaurant in SF that walks the trendy high-class walk but and fails to deliver on it's end of the deal. There are too many of these pretentious crap restaurants in this city, I will not be returning to this one.", "author": "Adam G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "What a delicious experience. The Ceviche was to die for. And I'm always down for good cod!\n\nIt's an intimate yet simple place that offers\nA very high end experience in a casual setting. \n\nNot to mention close to home so that is awesome!", "author": "James V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "Sunday, I checked out this little Bernal gem... FINALLY. \nFirst off, the second we walked in, the energy from our server, Chris, was welcoming and straight up poppin! He was great. He was able to answer all my seafood questions and accomadated our needs before we even had to ask. He was always one step ahead of us! My only regret was not listening to him when he recommended we order a carafe instead of glasses of wine. Shame on us.  ALWAYS TRUST YOUR SERVER PEOPLE. :)\n\nThe atmosphere was bright and very San Francisco. \n\nWe enjoyed two of each oyster; AMAZING and shucked properly. No grit at all. The price shocked me. So INEXPENSIVE. \nThe mussels with sausage, in a  lime broth with cream and cilantro...THE BEST. \nThe dungeness crab sandwich and the salad that came with, also  mouthwatering!\n\nI am a Bernal neighbor and the hours, staff, menu and decor of this place fit all my wants out of a dining experience. \n\nTwo thumbs up!!!!!!!!!", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "We went for Valentine's Day dinner. Reservation for 7:30, got there at 7:35, and as suspected, had to wait about 15 minutes from that point for our table. We have never been able to get seated on time, I wish they would figure out a system for this. In any case, the gentleman offered to open our bottle of wine but we didn't want to open the bottle for dinner while we were standing awkwardly between the beer on tap and a couple having their dinner. We thought we would start with something else first. He gave us the drink menu and asked what we would like. We each got a glass of prosecco and patiently waited for our table to open up. Two appetizers, entrees, and a dessert later, we are brought the bill. We were charged $14 for the prosecco. It's not a HUGE deal, but when we have to wait yet again for a reserved table, it just doesn't rub us the right way to be charged for drinks that we are offered. The three other times this happened, we were kindly offered a drink on the house. \n\nTo end on a positive note, the food is delicious as always. I think they can work on improving a few things though.", "author": "Sofia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "Food was quite delicious, three starts for feeling a little crammed at the small table for two, that gets immediately overwhelmed with just two serving plates.", "author": "I S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "I've been to Red Hill Station twice now. The ambiance are cozy and friendly, and the space very open and intimate. The staff was courteous and friendly each time, they made great recommendations and knew the menu well.  They specialize in fish and have a limited and low-risk selection (cod, salmon, mussels).  The flavor combinations were remarkable, well researched, but not earth shattering.  There could have been more effort on the vegetable and accoutrements selection.  A great place for a comfortable and cozy family dinner.  Bread was great and their honey balsamic dressing a treat.", "author": "Stefan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Great salads and super friendly staff :) I had the grilled tuna and it was spectacular. They have good drinks and they do brunch :3", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "One of my friends took us (birthday girls) here and it came highly recommended from someone who knew the owner. I'm always game at visiting new places and I haven't really ventured out to Bernal Heights before.  And of course, we had a reason to celebrate.\n\nIt was a small intimate place, already buzzing busy early on a Friday night.  So make sure you have reservations.  And note that they close early at 10 pm.\n\nWe were greeted with a friendly smile and our server was awesome.\n\nOne mishap was when we were being sitted - they tried to sit all 5 of us at a table for 4 by the window.  We clearly will not fit.  One of my friends had to sit with no table access while we wait for them to figure out our sitting situation.  Luckily, the table next to us were done and we were able to combine tables and had the room we needed.  And the wait for our food is really long.  That was almost annoying at the beginning but it all worked out at the end.\n\nI had the carbonara.  This dish is heavy with a really creamy sauce.  The pasta was lined with bacon bits and bacon at the bottom, so it can get salty.  But since I like white sauce and salty and bacon, this dish was right for me.  The service size was decent too.  My other friends ordered the mussel soap and that dish was really well done as well.  The base tasted like a spicy curry soap - it was great!\n\nWe all enjoyed our dishes and the restaurant.  This will be a good date place for sure although bringing the kids here is okay too.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "Some the kindest service and the most delicious tuna salad I've had! Very chill at 11AM with brunch and pear champagne drinks. They did a feat job on food, atmosphere, and present service :)", "author": "Jesse H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-22", "description": "Delicious!!!! I wish I took photos of our dishes, but we ate everything: the shrimp melt, cioppino, chocolate pudding, and mushroom crème brule. The service was equally outstanding.", "author": "Sasha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "The food here is unreal.\n\nThe oysters are so, so fresh and come with this crazy delicious dipping sauce. The grilled calamari salad was pretty sensational, too.\n\nBut it was the linguini vongole with clams, lemon, parsley and pangrattato that blew my mind. I absolutely adore pasta with a bit of crunch and acidity, so this dish checked all the boxes. \n\nMy little sister also ordered the funnel cake for dessert and it was super fun and not too sweet. Highly recommend this to share with a group.\n\nI dock a star because it was super loud on a Tuesday evening (which made intimate conversation a bit challenging) and also because the service was a bit off. We had to wait around to catch our waitress's attention several times (for wine, for an additional glass, for water, for our bill, etc), plus she spoke extra, extra slowly to my parents who speak perfect English -- it was rather offputting.\n\nOther than that the ambiance and the adorable neighborhood make Red Hill Station a win! They just need some time to work out the kinks.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "What a wonderful new discovery in Bernal Heights:\n\nWe walked in no reservation, got two spots on counter facing the kitchen:\nThere is nothing better than seeing your kitchen crew smiling, and having fun while they cook up the goods:\n\nHad amazingly fresh chucked Oysters on the half shell, mignonette ( do we have to stop at one dozen?)\nAlaskan True Cod fish with  the tastiest roasted vegetables on side \nOf course they do offer the traditional  garlic white wine sauce, but why not try something you don't see often:\nMussless with chorizo cream sauce with freshly baked bread on side, they should hand you a couple of straws the sauce is that good.  \n\nSuch a sweet place!", "author": "Sofia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-01", "description": "i came here for dinner a few wks ago, and i thought it was ok.  while waiting for the rest of our party to arrive, three of us sat there, and no one came by to take drink orders for quite a while.  \n\nwe ordered a bunch of food to share, and i thought the grilled calamari salad was good, as was the fish and chips.  the cioppino was a bit too chunky for me, and i felt like i was eating seafood w/ tomato sauce rather than a soup.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-02", "description": "WHAT IS ALL THE FUSS ABOUT?\n\nPLEASE TELL ME.\n\nThis place looked just perfect walking by, and I couldn't wait to try it. I made my honey take me here for cleaning his house, which is steps away. Each dust bunny and wall wipe was one step closer to the amazing-looking menu that made me salivate.\n\nThen we get there at 8 for our 8 reservation. It's SRO, and the place is tiny. We're asked if we would like some wine while we wait \"outside\" and we agreed to the wine, but taking it outside felt awkward because we were pretty sure that's illegal. So we awkwardly clutched our glasses of unknown-priced prosecco with our butts in other clients' faces hoping to be seated soon.\n\nAt 8:25, thankfully we were finally seated for our 8, because I was about to chew my own arm off. When I said \"OK\" to \"how are you?\" and was greeted with the third degree on why only okay, I mentioned the time. We were told this was \"San Francisco standard\" and basically felt like we had a mini-lecture about why no SF resident should expect to be seated right at their reservation time. While I totally accept that all kinds of things are out of their control, what could have hurt about a simple apology?\n\nGeez.\n\nSo, that's part of the service problem. The rest of the service problem is the long wait in between questions and answers, starters and mains...we waited so long for everything I felt more like a prisoner than a guest. Also apparently the wine fridge was on the fritz so we were not presented with a wine list in print, just verbal, with no prices. It's one thing to roll the dice on a $9 glass of wine, but we had no idea whether that meant $9, $11, $14....? So that was weird too. The cooler going out was beyond their control but not being able to give prices was not.\n\nOh yes, and let's not forget that the dude in the apron and striped pants (head chef, yes?) was hanging out with customers for 20 of those 25 minutes in the dining room and NOT cooking. Could that have been the reason for the terrible kitchen timing with everything? Are you a chef or a host? Pick, because you can't do both.\n\nSo, the food. We were pleased to find they could make the Caesar dressing vegetarian, and the Caesar was tasty and unique (crispy crumbs, no croutons) and worth $10. I ordered the cod, and my honey ordered the farro dish. Lo and behold, we got the exact same thing, only mine had cod for an extra $6, and he had slightly more veggies. Farro in brodo and summer veggies. It was good, but exactly what I'd throw together at home after a trip to Monterey Market and Monterey Fish Market. Exactly. \n\nI felt like I was paying to eat in my own living room. I could have grilled that squash and steamed those beans. I could also import special Italian farro. I go to restaurants to eat what I can't make or don't have time to make, so I feel kinda shorted when I'm handed Le Boring. I have the patent on Le Boring already.\n\nThey clearly were aware of how terrible they timing and everything was; they comped all our wine (4 glasses). Because of that generosity I might go back. But I won't drag my sweetie to Le Boring, which is all they have for vegetarians.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "So so good for seafood. I love they change their menus often and stay close to what's available seasonally. Their oysters are always so fresh and so good. Their calamari salad is to die for every time and last night I just tried the yellow tail tartar and it was so good as well.\n\nThe place is very low key but the food and service are excellent.", "author": "Nga P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-05", "description": "This place is new, and it shows great promise but definitely needs polishing around the edges. Overall, the food was *very* good, but not consistent. Some of the dishes were out-of-this-world delicious, but others were not quite right. \n\nThe complimentary garlicky olives served with bread were flavorful and probably are house-made. We started with a plate of oysters that were as fresh and tasty as any in the city, served with a good quantity of nice, tart mignonette. An appetizer of fried local anchovies with pesto and arugula was a great combination of flavors, but it didn't quite come off right: there was way too much pesto on the plate, and way too much dressing on the arugula; the dish was still tasty because of the fresh and perfectly cooked anchovies, but I don't think we'd order it again. As a main, my husband had a linguine with mixed shellfish, and this dish was perfect in every way -- pasta just al dente, seafood cooked just right, in a rich broth that exploded with flavor -- good enough all by itself to justify a return visit. I had ling cod in almond butter with roasted potato and vegetables; the cod was fantastic, perfectly cooked with just the right amount of sweet almond butter and toasted almonds to perfect the flavors. A single large fingerling potato was perfectly roasted. The other vegetables, though, were not right. I like my vegetables crisp, but the green beans were almost raw; by contrast the roast squash was falling apart and mushy from being roasted too long. \n\nThe service was very friendly and helpful, but the coordination with the kitchen needs work. At a certain point, it seemed like the kitchen had finished cooking pasta, and so pasta dishes were served to one table after another. It was at least another five minutes before fish dishes started to come out of the kitchen and get served. The result was that, if everyone at your table ordered pasta, then you all got served at once; but if one of you ordered fish and the other ordered pasta, there was a long delay. This is not OK; in a restaurant at this level, the whole table needs to be served at the same time.  \n\nThe ambience and décor are Bernal Heights casual, but the prices are not. Dinner was $100 for two, not including wine.  \n\nWe loved some of the dishes so much that we will definitely go back, and would love to have a successful seafood place in Bernal. But we do hope to see them iron out some of the kinks that were so noticeable on our first visit. \n\nWe say 3 stars now, but with clear potential to reach 4 or 5 with a bit more polish.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "I've only been there on weekends for lunch/brunch, but I LOVE this place. Food is amazing, staff is awesome, all in all one of my favorite places in SF. A bit on the pricey side, but you get incredibly fresh and high quality seafood, which makes it totally worth it.\n\nFood / Drink: \n- Mussels to die for\n- Whole crab is beautifully served and oh so tasty\n- Grilled squid was light and delicious Mediterranean style \n- Great wine list (love the Sancerre)\n- Bread was sooo gooood \n\nService:\n- fantastic every time, friendly and fun staff\n- friends were late and they gave us a free appetizer", "author": "Shaelyne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "I love it. All the food has amazing rich flavor. You have to be a seafood lover to come here! (Actually that's a lie because I came here with a vegetarian and they did everything off-menu and made her the most incredible pesto pasta).\n\nLove the oysters, the presentation, and the service. They will accommodate you and are very kind.\n\nThe space is kind of small, so it's best to make a reservation in order to get seated.", "author": "Carleen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "I was very pleased to discover this hidden gem. The restaurant isn't easy to spot - even if you're looking for it - due to its unpretentious exterior.\n\nThe menu is simple (which I love) yet sufficiently  diverse. I had the pesto linguine w prawns; it was delicious, balanced, and the portion size was perfect: not too big not too small. The one imperfection is that the dish was excessively oily, but not enough to detract from how tasty it was regardless.\n\nService was on point: friendly and professional. The interior is cute/cozy with an open kitchen. Loved this place, will definitely return.", "author": "Sergey P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-07", "description": "Well, it's a seafood place, right? And they serve oysters on Cortland which is nice. But when I asked the waiter to tell me about the oysters, he was seriously caught off guard. He was clueless and could only tell me about their sizes. He was a little absent too.\n\nRegarding the restaurant, the food is decent but a bit heavy handed. The tuna tartare was tasty but it was more of a ceviche and had way too much basil and olive oil.\n\nHey, get an awning. You're hard to find when driving through busy Cortland!", "author": "Rude G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "LOVE IT!! ALL MY STARS! The service and atmosphere are amazing, and the food is the best in bernal. i love it all the time.", "author": "Jorge C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-02", "description": "I like the idea of a neighborhood seafood joint that we can walk to on a whim or planned night out. Red hill station started off strong with great service and a deft hand in the kitchen. Lately and especially tonight, the wheels seem to be coming off. The kitchen lacked an executive chef and was a skeleton crew of young, eager and hardworking sous chefs. One man on sate', one salad prep and one other misc pair of hands. \n\nI ordered the Cioppino and the wife 1/2 crab sauté in garlic and butter. We were sitting at the bar so I had a birds eye view of the kitchen. I watched as my dish was basically completed and set on the back burner as my wife's dish was behind in the order of things. It sat there for 15 minutes at least. The dish looked and tasted thrown together. Crab was robbed of any sweetness and prawns were dry and mealy. Remaining stew was a little bitter. \n\nThe crab dish, having been cooked and served in the proper order had a better balance of flavors. \n\nThe two waitresses were overwhelmed and service was lacking. No busboy on staff. The check was set down before our plates were cleared. \n\nI don't fault a single person there as all we're doing the best they could, but the result was less than stellar. \n\nHang in there Red Hill Station.", "author": "Tony t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Small place with a lot of heart. Our server was Carlos. He was awesome! Food was excellent. My hubby, kids and I walked in off the street on a Tuesday evening and were immediately sat in the private room! I had the basil roasted almond pesto with prawns! Food came out quickly and was full of flavor! I would come back again in a heartbeat!", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "I come here once a week for lunch. I love the calamari salad and linguini dishes.\nFood is good and fresh. Service is nice and friendly. Lovely neighborhood. I always find parking near by.", "author": "Missy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "I've eaten at RHS twice since their recent opening and it's been consistently mouth-watering across the board.\n\nBernal Heights is lucky to have these guys in the hood, and judging by the fact that it is packed in there every time I walk by, they're here to stay.\n\nYou can easily make a reservation on their website, which I highly recommend. Service and atmosphere are really fantastic. You get that warm neighborhood vibe the moment you step inside and despite being busy, the servers are more than happy to chat with you about the specifics of any of the dishes.\n\nAll the seafood is top top shelf, so its totally worth channeling that couple from \"Portlandia\" and asking where a specific item comes from (asking for your fish's name might be pushing it but that's up to you). It's nice to know that there is thought and intention put into sourcing the highest quality ingredients.\n\nThat same attention to detail was evident in the preparation of every dish I've had there as well. The menu changes daily, so trip number two ended up being just as exciting as the first time.\n\nOne item I hope is always on the menu (I had it both times) is the fried anchovies with pesto. Seriously. So. Good...\n\nOther than that, the oysters are an obvious hit, as well as the pasta/seafood dishes. The one I had recently was a linguine with clams, muscles and tuna. Yes please more please.\n\nAll in all it's everything I love about dining out -- thoughtful, delicious food and warm, welcoming service.\n\nI will definitely be back again. And again. (And again.)", "author": "Dan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "I love this place . I can eat here every day. I love the calamari salad, seafood pasta and everything else. I love the location and usually you don't have to wait for hours to get a table.", "author": "Sal R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "I found this place on yelp and was intrigued because of the high reviews. I was in the mood for seafood and in the spirit of making me happy my boyfriend agreed to come here.\n\nWe made a reservation on open table and were seated after a couple minutes of waiting. We ordered the oysters on the half shell, and shared the bay shrimp Caesar salad as appetizers and they were awesome! Although they could do us a favor by bringing out the Caesar salad cut up (it's pretty inconvenient cutting up whole romaine lettuce leaves covered in slippery Caesar dressing), it was tasty and we devoured it all.\n\nThe problem I had was when it came to the entrees. My boyfriend ordered the fish and chips, and I ordered the king salmon. One big problem - MY FOOD NEVER CAME. Like ever. Once my boyfriend got his food, the waiter told me mine would be out shortly. So I was patient. Then he came back and said that my food was getting plated, 15 minutes later. Although I told my boyfriend to eat, he was hesitant to do so because I didn't have my food - and it was my idea to come here! I started getting LIVID and come to find out that my food was plated for a to-go order, and was not even close to being ready.\n\nWe were planning to go out after, as it was a Saturday night and when they asked me if I wanted the order to-go, I said no. The moment had passed, and our date was ruined! \n\nHowever, they acknowledged their mistake and comped the entire meal, which was very gracious. I don't know what went on in the kitchen, but the table next to us let us know that it's not typical of this establishment and urged us to give it another try. We left a tip for the nice waiter and the fact that they didn't hesitate to comp, but I'd much rather spend my money somewhere knowing I'll actually get a plate of food.", "author": "Jasmine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-24", "description": "An outstanding addition to Bernal Heights.  I had the pleasure of having lunch there earlier today.\n\nThe amuse bouche consisted of a few olives in a warmed lemon - olive oil with minced capers and anchovies.  Absolutely delicious.  The bread was a yeasty, whole-wheat bread with a perfect crumb and crust.  \nI had the Caesar Salad with Grilled Calamari.  It was the best salad, let alone caesar salad, I have had in my life.  The lemony-garlic olive oil dressing was perfect - the calamari was grilled amazingly tender - the romaine perfectly crisp - and the crumpled croutons a lovely touch.\nDelightful and helpful staff.\nAfter leaving was queried on the street about my experience and I raved about my meal.  I had to return shortly to pick up something left behind and saw the person lunching contentedly on Linguine Vongole.  Definitely spread the word!", "author": "Terry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "My older son had a school activity in this neighborhood and that's how we ended up in this restaurant. I ordered the clam linguine which was delicious! They were very generous with their clams and the taste totally hit the spot. The mister ordered the fish and steak tacos. I didn't find that mix well. I really shouldn't even give that dish a review since I only took a bite. Did I mention my clam linguine was divine? They also have a kids' menu!\nAnyway, the complimentary bread (served with olive oil and basalmic) and olives were a big bonus. The bread was super fresh. It helped calm us down a bit when we had to wait 35 minutes for the food to come. That's why I took away the star because the loooong wait. The service was friendly. After a while, our server wasn't as welcoming as he came to us 3 times to let us know our food is almost ready...and almost ready...and almost here, but it didn't come until 35 minutes later. After a while, I started to get annoyed because the wait was absurd. What was weird was the table who sat down 15 mins later, got the food the same time we did. \nBesides the long wait for the food (but since it was good, I won't complain too much), everything about this place was great.", "author": "Em T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "What a great find!  Fish n chips and a burger were the best we've ever had.  Fresh, tasty and a fabulous environment!  We are soooo coming back again !", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "I finally got to try Red Hill Station and it did not disappoint.\n\nI went with three of my friends so that we could try a little bit of everything.\n\nWhen we first got there our table was not ready so they took my phone number and told us that they would call us when it was ready and that because of our wait we would get a drink on them. Love the proactive way of addressing the issue and it wasn't even their fault the table wasn't ready, the people that had it before us were gabbing away and took longer then expected.\n\nHonestly at this moment I forgot exactly what we had but we ended up ordering two appetizers (oysters on the half shell and fried anchovies), entrees (2 fish dishes and 2 pasta dishes), and two desserts plus we went through two bottles of wine and an extra glass of draft wine while we were waiting for our second bottle to chill.\n\nEverything was delicious, the food was timely, the service was pleasant, though it did take a bit to get our glasses refilled (wine and water). But overall it was a fabulous dinner.", "author": "PaPai X. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "A great addition to Bernal Heights. The seafood is fresh and prepared perfectly. The oysters selection were terrific.", "author": "Robert O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-25", "description": "Not sure why Susan B gave it four stars before trashing the fish and chips! My girlfriend ate there and, knowing her British boyfriends love of his national dish, took me there the next weekend. Her son and his pal came along; the friend could barely eat the fish! The \"chips\" (French fries; too skinny to be called chips) were overcooked and lacked flavour. The fish was I a very greasy batter.\nAbsolutely no way she and I will ever eat here again, which is too bad because its in her 'hood (Bernal Heights)", "author": "Michael A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "Such fresh oysters - and the sauce that come with it makes them so amazing! \n\nCame here for a late lunch with husband and our little toddler. We made a reservation but ended up getting there early. The place is small with about 8 tables at the most. Luckily it wasn't full so they were able to accommodate even though we were early. \n\nI ordered the crab roll and it was very good. The salad was very fresh too. Husband ordered the calamari salad and it was very fresh and not overpowering with any strong flavors. \n\nMinus one star because some of the mason jars they use for water cups were not clean..  And the food is on the pricier side.", "author": "Sera P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "Interesting concept of food - seafood more in particular. Enjoyed almost everything! We had shrimp cocktail, baked sea bass, beef bourguignon and pasta with bacon. Delicious! It will be great if the restaurant can be more creative with the naming of the dishes because they are quite different from what people have in mind about beef bourguignon or shrimp cocktail.", "author": "Yina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Came here during the day and it wasn't very busy. We started with the monterey calamari salad and caesar salad. The salads were fresh and the calamari was perfectly grilled, where the calamari is still tender and juicy with a hint of smoke. Then we went onto the cioppino, crab sandwich, manila clam linguine, and fish and chips. I really enjoyed the cioppino and linguine. They're loaded with flavor and ingredients. I slopped up the sauce with the table bread. We even had to ask for more bread. The crab sandwich was also loaded with crab and the bread was soft and a little toasted.\nI do agree the service was slow. It was basically just 2 people for this small area, but half the time they were missing.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "If I was one of the the raters at Michelin, and found myself in the outer limits of downtown San Francisco (ie, Bernal Heights), Red Hill Station and its chef, Taylor Pedersen, would wind up with a star or two. It's that good.\n\nThree of us went there to celebrate a birthday, and we walked away totally amazed and satisfied with the experience: the food, the wine, the ambiance, the service (Aura is lovely and wonderful!) was perfect. From the raw oyster tray to the marinated anchovies to the Ceasar salad, to the grilled calamari, sand dabs special, and oyster pot pie (in an amazing broth!) it was superb.\n\nIn addition because it was a birthday, the celebrant was presented with desert gratis. A lovely touch. We'll all be back over and over again.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Great time with 4 friends catching up. Super cozy little spot with excellent seafood and wine on tap. We were floored by the excellent mussels w/ chorizo -- scooping the broth up with bread till the last drop. The calamari salad is also an extra entree. Absolutely required eating in Bernal!", "author": "J M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "The place is not that big, so it is better to make reservation. I love the salmon appetizer , and the creamy pasta is also good.", "author": "Bonnie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Don't read into the four stars, this is as good a restaurant as you can find - inventive and delicious cuisine, attentive and personal service, great ambience, cozy, everything works, and a destination if you love seafood. The highlight for me what is perhaps a misnamed \"oyster pot pie\" -- I would go back just for this: a smooth, creamy chowder of oysters and potatoes topped with a delicate pastry puff with caramelized bacon and micro greens. The calamari salad with roasted figs, peppers and summer squash is also a winner. Don't leave without sampling their pot de creme for dessert - simple and yummy. What a great find!", "author": "Albert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-22", "description": "What an amazing new gem in our neighborhood! Fresh bright flavors in a seafood-centric menu! \nWe can't wait to go back!", "author": "elisa g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-24", "description": "Red Hill Station is a pain for me to get to.  Starting from the Presidio, I might as well be going to Napa or the East Bay considering travel time.  But never mind that, the place is popular with locals as person after person who came in was known to and received a hug from the chef.  My server was OK, and that is something considering that the place is relatively new.\n\nI started with a Caesar salad with bay shrimp.  One thing that the restaurant should clarify on the menu is that there is a surcharge for the shrimp.  Nevertheless, the serving size was huge, the romaine and shrimp were fresh, and while at first blush I thought the dressing was going to be too oily, it was pretty much spot on.  A very good plate of food.\n\nAn appetizer of sausage meatballs was nice enough.  What made the dish was the bright tomato sauce that surrounded the meatballs.  While the meatballs were obviously house made they were overshadowed by the fresh sauce.  \n\nMy main of fish and chips was a case of too much of a pretty good thing.  The potato sticks were a bit overcooked and somewhat hard to get from the bowl to my mouth.  The black cod was obviously fresh but played second fiddle to a coating of perfectly fried crust that was a bit too ample.  The crust could also have used just a bit of seasoning.  The slaw that came with the fish was akin to sauerkraut but wasn't sufficiently astringent to go with the fried food.\n\nI should comment that my salad and main would have constituted a very ample meal by themselves.  So be aware that Red Hill Station is very generous with their portioning.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "- food: quality ingredients that tasted fresh\n- atmosphere: cozy but comfortable\n- staff: very accommodating but slow service\n- price: a little pricey, but good-sized portions\n\nadditional info:\n- bring a bigger group for the party room that has a window to the kitchen and its own Sonos\n- several good options on the kids menu", "author": "J. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "Where do I start! This place is one of the best. I have eaten here several times with different groups and on a date and each time I left so satisfied. \n\nI really love their space in the corner for larger groups. Plus could the owners be any nicer?!", "author": "Jourdain D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Great neighborhood seafood restaurant with a few plates suitable for vegetarians all creatively presented and full of fresh delicious ingredients. Had the Candy Cap Mushroom Creme Brûlée was tasty and unique dish great service will definitely be coming back!!!!", "author": "Maria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Fabulous food, and even better service.\nI've dined at red hill twice in the last month, once for lunch and once for dinner.\nLunch was delicious, service was good.\nDinner was super yummy and the service (I think our server's name was chris) was superb. Chris dealt with my less-than-pleasant child like a fricken saint, bless him!\nThe super yummy food is high on flavor and seasoning--not bland/ subtle fare. \nGreat neighborhoody spot for a good meal.", "author": "Rahna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "I really enjoyed their Caprese salad. I had a pasta from here that was also very good. Everything was fresh and delicious.", "author": "Sheena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "fantastic food, friendly staff, nice place. All the fish pastas are great. Fish Tacos are also great. Oysters. Salads. If you like fish I know very few other places in SF that will make you equally happy.", "author": "Fred A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "I've been here multiple times and had an excellent meal every time. Food is to die for and staff is excellent. Highly recommend!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Such a lovely restaurant. I enjoyed the food, the ambiance, and the waitstaff. I went for my birthday dinner at a friends referral. I had oysters, garlicy lemony pasta with clams, and a lovely glass of wine. My friend had a lovely dish of trout with grilled vegetables. OH and we had the pot de creme for dessert which was fantastic. A+", "author": "Dana H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-03", "description": "I've had dinner here once before and enjoyed it very much. We ordered oysters on the half shell to start. They were fresh and delicious and reasonably priced at $2.50 each. We shared the calamari salad, also very fresh, beautifully played and cooked. I ordered the whole fish, this evening broiled mackerel, unfortunately the fish was over cooked and dry. Service was knowledgeable, friendly and well versed about the menu", "author": "Monika F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Congrats Amy, just watched the reviews from Check Please, everything they said is true. You have a great place and we love that we live up the street from you. Love the crab sauté. Thank you again. Joy/Frankie.", "author": "Joy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Really enjoyed dinner here last night. Had one of the most delicious ciopinnos that I have ever had. All the seafood was cooked perfectly and the broth was rich in flavor. I sipped every last drop. Very affordable dinner for two. Definitely coming back to try more dishes.", "author": "Don M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Great food! Happy to see this place open in bernal. We visited on opening day and enjoyed the shrimp salad and salmon. We'll be back for sure.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-02", "description": "Everything was very fresh. It tasted like they made things fresh from their garden. We will definitely be back.", "author": "Paul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "My dinner at Red Hill Station last evening was delicious!\nEverything was incredibly fresh .  Our group tasted many things, anchovies, oysters, clams, Cesar salad, pasta, we were happy with everything.  The chef's choices of flavors are simultaneously exciting and comforting.  The decor is elegant and the staff is friendly and helpful.   I will be back often.  \nI wish I could give it 10 stars!", "author": "Ena D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Best food I've had in a long time! Service wasn't super fast, but I prefer it that way, I personally don't like feeling like I'm being rushed to order, eat and leave as soon as I finish. We ordered mussels in wine sauce and Caesar salad for appetizers, both were great and big enough to share between 5 of us. We all got something different for our main course. Calamari salad, mackerel, trout and cod. All dishes had beautiful presentation, and all were delicious. If I had to rank them trout was the best. We finished with desserts and tea. We got one of each and were not disappointed, everything was delicious, but Zabaione was something out of this world entirely. Will definitely be back for more.", "author": "Lotta F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "The anchovies are delicious and they came with a pesto sauce on the side and a delicious little green salad. The fish and chips came with copious amounts of slender (sometimes soggy) fries. I was quite happy with my fish until I noticed that my neighbor had three pieces instead of my two. However it was very, very fresh and the batter was excellent. The service was OK. The bus person took care of us while the waiter came in at the end to ensure that our meal was good. We had to wait for our entrees because every table ordered at once. That was fine to know. It's OK to wait if you are given a head's up. However, I got my fish and chips about five minutes before the baked fish. I didn't like that part. I would definitely return to check out something that's not deep fried. It all smelled wonderful.", "author": "Susan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Really terrific dining experience.  Every dish was either really good or outstanding.  No disappointments.  The carbonara linguine was a standout. Mussels were among the best I've had. Beer and wine on tap at good prices.  Overall value was excellent.  Cute place, great service.  Big hit. Will be back!", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "We went here for breakfast. 3 of us had eggs in cocoette (which we had been told was amazing). All 3 turned out very different. Mine was good and very liquidy (which I think is how it's supposed to be), another was drier and the third was completely dry.  It was also supposed to have candied bacon which none of them had. I was fine with it but my friend was disappointed. Overall, I'd definitely go back. Hopefully they were having an off day.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-10", "description": "The food is all fresh, unique, beautifully presented and the staff is very welcoming and helpful.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Very very nice sea food dishes! We had shrimp melt, beer battered cod & chips, & a wonderfully tender grilled calamari Cesar salad. Will be back again for sure!", "author": "Amen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Love the food here. Such a cute and romantic restaurant. Call ahead to get your name on a wait list.", "author": "Natalia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-24", "description": "We reserve on OpenTable for Saturday 7:30 PM. We show up 7:46PM.\n\nWaiter sees us and after a few minutes welcomes us. Goes to the back (reminiscence of car dealership, hmmmm) to talk with the boss. Comes back to tell us that they gave the table away after 15 min. Which is a lie because the folks at what should have been our table were comfortably seated with filled glasses when we arrived.\n\nWe asked if they called us. Nope. Not \"No sorry\" just \"No\". \n\nThen Mr. Waiter tells us it will be \"just  few minutes\". So we wait a few minutes. Did I mention that we were there with our 5-yr old who was getting really hungry by then? A few minutes passed. We ask again. Mr. waiter talks to Mme. Boss. Now, Mme Boss comes over (we are close to sealing the deal!). Tells us they don't call when folks are late. Clear attitude telling us \"I am the Boss, my way or the Freeway\". Now it will be 15 minutes: look at this table, the people are \"almost finished\". Riiiight, like they are not in the middle of enjoying their desert having a fine time and wanting to extend said fine time.\n\nDear Red Hill, You could cook the most amazing food on the planet but with that attitude, you won't get my business. You need to call before giving a table away. That is what every restaurant does.\n\nBad place for kids BTW.", "author": "NoName M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Delicious lunch at Red Hill Station today.  The seafood was fresh and delicious and the vinaigrette on the salads was marvelous.  But what we hoped would be a quick lunch turned into an ordeal when it took over 40 minutes to get our meal! And we were the first and only customers in the door at noon.  Go for the food, but go when you have plenty of time to spare.", "author": "Donna L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-18", "description": "Disappointing. We checked in just before 7pm on a Friday evening and were told they would text to let us know our table was ready in about 40 mins. No problem, we say! Went down the street to the wine bar (great!) and about 50 mins later (7.50pm) noticed no text message. We were on a schedule due to childcare so the hubby popped back down only to find out the hostess had messed up. A table was given to us then promptly taken away because another guest kicked off due to the same situation. Needless to say 15 mins later (8.05pm) we got our table. Offered free glass of wine, which was a nice gesture. Before we ordered we told the waiter we needed to be gone by just after 9.00 - sure no problem, they say. Our dinner finally arrived at 8.45pm. Burger (so small it was more bun than burger) and fish and chips which were meh. Definitely not worth the wait!! Not sure we'll give it another try.... It may just have been an off night for their hostess which impacted the kitchen, but ultimately left us feeling rushed and dissatisfied with our meal and overall experience.", "author": "Denise P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-03", "description": "Food and service was excellent,  prices too steep for what it is. Fish was so fresh got the fish tacos and fish  and chips, also a bottle of wine.  The 2 dishes over $20 each, it's should be $15.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "Not the Best Fish-n-Chips I've ever had in my life. Don't get me wrong; I was hoping they would be the Best Fish-n-Chips I've ever had. A friend told me they would be. Oddly, everything else went according to plan: not a problem parking nearby, waitstaff and other patrons were delightful, the mushroom creme brulee was very tasty. My two dining companions and I put all our eggs in one basket and ordered the fish-n-chips all around. Wish we had been a bit more creative and shared multiple dishes, as there are several other things on the menu that I'd like to try in the future.", "author": "Rick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "Delicious, fresh, high quality seafood!   Pleasant, friendly staff and a light and airy atmosphere.  Already thinking about my next visit.  I had the cod tacos.  The plate comes with THREE generous tacos filled with perfectly cooked cod, a yummy red cabbage slaw and crema.  A lovely green salad with a honey balsamic dressing with beets, peas and radishes on the side.  My coworker had the calamari salad and loved it so much, he told the chef personally.  yum yum!", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "We had the chef Taylor put together a sort of tasting menu for our table, and each dish was excellent. Words can't do our meal justice. Service was amazing too. The chef highlights seafood, with a modern creative twist.\nWe started with a tuna tartar, the best I've ever had -- the tuna fresh and buttery, the seasoning savory, pungent and delicious.\nWe then shared a caeser salad, followed by mussels in a lime cream broth with chorizo. Our final seafood dish was a very buttery local sea bass I believe. The wines we tried were interesting as well. Don't miss dessert at this restaurant either! The candy cap creme brulee, chocolate pot de creme, and funnel cake believe it or not, were absolutely delicious. Nothing was left on our plates, and not because the portions were small! (We took a long walk around Bernal afterwards as a digestive.) We are lucky to live in a city with such choices and such talented chefs, but this place is really special. I don't live in this neighborhood, but I'll be back.", "author": "Meredith G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-31", "description": "Go here, it's amazing.  We wandered in early one evening and weren't sure what to expect.  The staff was friendly and then the food came and it was delicious.  We had some oysters which which some of the best I've had (better than Zuni, yup I said it.) and then I departed from the seafood theme and had a great chicken dish as a main.  The wine selection was limited but excellent.  The best part was when the bill came, very reasonable dinner out for that level of quality and service.  Although I had been lamenting the loss of Liberty Cafe to the neighborhood, I found a much better repacement.", "author": "Ava M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "My wife and I made a trip out here. I have never been to the Bernal Heights area. In my younger days, I would always pass by on the 14 Mission bus and I always wondered what was on that east side of Mission Street. We ended up parking in the neighborhood since there was a bunch of construction zones on Cortland. They have some small one lane streets that are two way to traffic in Bernal Heights. On Courtland Street, the neighborhood businesses seem untouched by time. It reminded me of Mission Street and Geneva Ave about twenty years ago. \nThe service was pretty good at Red Hill.  I had the steelhead trout for lunch. The trout was great. It had a slight burnt flavor on some bites but I think that was the way it was supposed to be. Usually the sides, vegetable and sometimes the potatoes are an afterthought. But the vegetable were great as was the potatoes.\nMy wife got the pot pie sampler, which consisted of a mini oyster pot pie, beef pot pie and clam pot pie. The oyster turned out to be the tastiest followed by the oyster and then the beef. If you get the pot pie, I would say go for the sampler. I think it called Pot Pie Flight. The waitress pointed the sampler to my wife and we are glad that she did.\nAs I walked back to the car on the hill, I could see Lowes on Bayshore Blvd. Give this place try. It is tucked away in a neighborhood that is still untouched by time.", "author": "Cat F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "Trout and tuna tartare was so good!  Oh my gosh!  I ordered another bit of the trout for my take-home meal!  Was delicious with the crostini bread!  This place is gggrrrreat!  I had the pasta pomodora  for dinner, no regrets although the trip home took way too long and I finished the trout quickly as possible.  I was very satisfied!", "author": "Katrina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-05", "description": "Four of us are at red hill last night. For starters, we ordered the big carafe of wine. While it's pretty overpriced, at $50, it beat buying wine by the glass. The big carafe should have been priced at about $35-40! \nWe ordered 12 oysters. They were super fresh. The sweetwaters were superb, while the other variety was totally flavorless. Strongly recommend that you try one of each variety before placing a larger order. The cippino was quite lovely, but remarkably void of much fish or crab. It's a large pan of tomato sauce with minor amounts of fish. Luckily, You can easily fillup on good bread. Nice, small portions for the price, and beware inconsistency in the fresh oysters", "author": "Geoff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Still lusting after their preparation of calamari nearly a week later - it's going to be hard to match that in my new hometown. Their other preparations of fish have also been very creative and delicious. They immediately showed up with crayons and a coloring book when my wife and I came with our daughter, and squeezed us in for a quick meal, in spite of an upcoming reservation. Ignore the silly review that says they're too friendly - one of the joys of coming to restaurants in Bernal is the friendly small-town feel in big SF. And an extra star for holding on to my credit card for several days after I'd forgotten it there - thanks so much!", "author": "Chris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "Red Hill station!! What can I say?  The best meal of the trip. Started with 5 different varieties of oysters and clams to boot. Then came the steamed mussels in cream and chili broth!! WOW. The Caesar salad with Creek shrimp was stellar with light dressing and crunchy lettuce. The fresh fresh fresh Ah I tar tar was delectable.  My entree was the linguini with mussels and clams in white wine and tarragon!!! The house red wine warmed the heart as well as delighting the pallette. What a feast!! Finished with an incredible chocolate pot De creme!! It's worth the trip from anywhere . Always fresh new menu daily. Taylor is at the top of his craft. The staff fully knowledgeable.  Did not want to leave", "author": "Poggi P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-09", "description": "Oh, Red Hill Station. I wanted to like you, I really did. You're so close and convenient! I heard such good things! But my cod was merely passable, not remarkable, and the experience was ruined by two things:\n\n(1) Being seated right next to a glass door that sticks - which customers would, naturally, open every two minutes and blast me with the chilly evening Bernal winds and leave ajar, never noticing, forcing me to close it again and again so I didn't freeze.\n\n(2) The positively ear-splitting volume, which is already common enough in SF restaurants (and some customers are getting quite sick of that, thank you), but which was even more pronounced here, and augmented by the boisterous talk of other tables and the frequent CLANG of utensils being thrown in the kitchen, effectively making conversation impossible.\n\nI might give you another chance when you fix that door. Seriously. That really ruined the whole night.", "author": "Bill P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "Atmosphere and food were both fantastic. I definitely recommend this place.", "author": "Melanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "I love this place , the food , the people and staff . I can not wait to come back again soon .", "author": "Matthew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Red Hill is the new \"hot\" addition to the neighborhood, and after finally getting a reservation and going in for dinner a few days ago, I can understand why. The food gets 5 stars, but they lose one star because the service was a bit spotty. Everything we ate was delicious -- especially the calamari salad, linguine with pesto, and the steamed mussels + clams + pork belly. The calamari salad was a great, surprising combination of calamari, arugula, and roasted figs. The broth in the mussels + clams + pork belly dish was some of the best I've ever had in a dish like that, and it went really well with the crusty bread they brought. We also started with oysters, which tasted very fresh. The Calm Cove oysters from Washington were HUGE!\n\nHowever, there were a couple of periods during the meal where we had trouble getting our server's attention, such as when we wanted to order more drinks and at the end of the meal when we couldn't get the check and then when we couldn't get her to take our credit card for awhile. I thought the pacing was a little bit off, as we waited a long time between our appetizers and our entrees, and our waitress forgot the side of french fries we ordered. By the time we realized that they were not coming, we were too far into our entrees to remind her. It didn't show up on the bill, so I'm assuming she forgot. She repeated our order to us when we ordered, but she didn't write anything down when she took our order -- that was sort of a bummer. I'll definitely give them a pass on the service issues since they're so new, especially since the food was so good. I look forward to going back again once I can get another table!", "author": "Pilan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "Great neighborhood place for lunch or dinner! We celebrated my dad's bday and were so happy to see oyster pot pie on the menu -his favorite!  All the pot pies were so tasty and the crust was tender and flaky. The only one that didn't hit the mark was the pulled pork since it was more of an Asian curry flavor and the anise was too strong. The calamari salad was delicious and my mom enjoyed the lamb shank. When both parents are happy with their meals, we know the restaurant is a keeper!  Service was excellent as well!", "author": "tina l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "Was driving through Bernal Heights and found this place on Yelp. What a great find. The four of us all immensely enjoyed our meals. I had three different varieties of oysters for an appetizer followed by steamed clams in white wine with tomatoes. My partners in crime had: hangar steak & prawns, the cod dish and shrimp/avocado salad (we also had a uniquely boozy tiramisu for desert). All were delicious. Can't recommend this neighborhood gourmet gem enough.", "author": "Bob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Six of us went to Red Hill Station this weekend and sat in the little room above the kitchen. It was a perfect spot to get the vibe of the restaurant without too much noise. \nAnd the food was incrediblel!  We started with a platter of oysters which were super fresh, followed by  fried smelt and tuna tartare, both of which were perfectly done and served. The tuna tartare, in particularly, had an amazing dipping sauce. The main courses were just as fresh and delicious.  My ling cod tacos were tasty as could be and came with an arugula salad.  One of our party had the short ribs and that was also cooked to perfection. So Taylor, the chef, can do more than just seafood.  They do it all very, very well. I'm not a big dessert person, but the funnel cake is pretty special, not too sweet and melts in your mouth. One last note: the portions are generous and you leave feeling very well satisfied at this amazing new restaurant in Bernal.", "author": "Suhl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "My friend and I tried Red Hill Station for brunch after hearing good reviews from a bartender at the Latin America Club. \n\nThe brunch menu is fairly small but you can also order lunch if you want. We asked the server what her favorites were and we ordered French Toast and Eggs en Cocette. \nBoth were great but the French Toast was fantastic, it might be the best I've ever had. Truly delicious. Service was professional and friendly. The prices are higher than most brunch spots but are reasonable for the excellent food. \n\nI'll definitely be back to try lunch and dinner. This is a great addition to Bernal.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "It was our friend's birthday and there were 8 of us. We ordered almost everything on the menu. The linguini vongole, my favorite dish, was a hit. Other yummy dishes were the calamari salad and mussel. Definitely, I will come back to try other dishes.", "author": "Meo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "My bf and I had dinner here on what was, I believe, still their soft opening. It was terrific! We got there after 9 (had done happy hour in the Castro with friends that went a little later than we thought it would). \nWe were greeted warmly at the door by Tamara (I hope that was her name!). While we waited for a table she poured us two glasses of a crisp, tasty white wine and chatted us up about the new restaurant. \nWe got a table quickly and though the menu was slim-- it only had two entrees-- it looked creative and inventive. Unfort they were out of the trout but we ordered the tuna carpaccio which was a nicely generous portion and delish. The ceasar-- oh my stars-- heavenly. A heaping pile of seasoned bay shrimp in top! I'll be back just for that alone. Since there was no trout our only option was the skirt steak with baby carrots and small potatoes. Again another winner and large portion. \nI have to say, it might have been a soft opening but they woo'd us pretty hard. Friendly and warm and delicious. And btw the chef/owner is quite dashing. I can't wait to see how they evolve from here!", "author": "Rob W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "I admit to using forgoing the eateries in my neighborhood - like for the last 15 years, ThenRed Hill Station comes along to change my mind, I at tented a private event there and dreaded a canned meal. Surprise!nMy salmon was expertly prepared (as in not overcooked) and served with forbidden rice and delicious miso flavors. Oyster were ultra fresh, Wine on tap program is solid. The service was stellar and I cannot wait to come back - am now going to contact them about hosting my own private event there.", "author": "CJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Super cute neighborhood restaurant.  Our waiter was super great.  The food was superb!  Everything we ordered was out of this world.  If I could have gotten away with licking my plate, I would have done so!  Go!!!!", "author": "Ginger J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "The service was top notch and the food....the food. I can't stop thinking about the caesar salad. The brown butter trout was beyond amazing, all elements perfectly cooked. But, I'm officially obsessed with the caesar salad, which now rivals Zuni's, in my book. It comes with bay shrimp, delicious bread crumbs, and the perfect amount of parsley, which really brightens the flavors. \n\nWine and beer are on tap. Prices are a steal for the quality. I'm so excited to see where Red Hill Station goes from here! I'll be back, with my kids, too. (It's family friendly!)", "author": "Deborah N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "As a culinary school graduate, I'm a big skeptic when I go to restaurants. I typically hate spending money making food that I could do better ...haha. But I must say that Red Hill Station was the exception. The food was outstanding! The artichoke stuffed with bay shrimp was perfection . The Caesar salad. .. done everywhere was one f the best I've ever had. The food the chef used showed high quality ingredients and produced a perfect blend off chic yet classic. Plating was beautiful as well. All in all, I would highly recommend this to my friends.", "author": "Patricia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "My girlfriend and I were looking for some good seafood and we found it! Off the beaten path in bernal heights is this hidden gem. We had the pleasure of sitting at the bar which overlooks the kitchen. It was such a blast to see how they make these delicious meals. We had the oysters, fried anchovies and the cod with mashed potatoes. All dishes were really tasty, and hardy. I highly recommend this place if you are looking for a nice date spot or some good seafood.", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "Went here for the first time tonight and I plan on coming fairly often. I had a delicious salmon dish with asparagus and fingerling potatoes and my wife had a yummy halibut. We started off with a few oysters each which were all quite good as well. Split a crème brulet and walked out happy.\n\nThe space itself is small but gets good light. Brought a 7-month-old baby and the staff was friendly as he babbled. Not a cheap meal (90 bucks after tip) but very good value. All of the ingredients were high quality and they were very-well prepared. Probably the best meal that I've had on Cortland.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Excellent food, everything was perfectly cooked and the dishes were well balanced. The staff was wonderful. Everyone was pleasant and accommodating. Our waiter was perfect, there is no other word for it. He appeared when we needed him and I never once thought \"it would be nice to have our waiter for X\", he gave us time to decide what we wanted, was helpful with the options, picked up on our cues instantly, and didn't feel the need to hover as some otherwise excellent waiters do. \n\nOverall it was a wonderful experience and I would recommend them to anyone.", "author": "Caleb S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "Perfectly prepared seafood, big portions, and beyond tasty.  We had fresh oysters, sauteed clams, fries, and trout tartare.  Our waiter was adorable, really sweet, and very attentive.  I honestly can't understand why some of the other reviewers are complaining.  I loved everything about Red Hill Station and it is hands down one of my favorite restaurants in SF.  \n\nTip: Sit at the bar facing the kitchen - fun views!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Went there on soft opening night . The trout and steak were amazing. Really liked the casual neighborhood vibe. Simple menu makes it easy to order. It's all about the food...quality and good portions! Hope they continue to do great food.", "author": "Odnit D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-23", "description": "Had the pleasure of eating here earlier. Cool little spot, nice ambiance, very cozy. Bathroom was very clean and had fresh towels to dry my hands. Food was great, probably the best cioppino I've ever had. Definitely will be back again", "author": "Benjamin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "I had the bay shrimp melt, and it was fantastic. The service was amazing. We were lucky to go there during their off hours, when the restaurant isn't too full, because we like to eat early. My friends had the fish tacos. Everyone left without a single complaint. Our waitress was the best. She was attentive to our table and fun and friendly. We will definitely be going back.", "author": "Shannon P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-26", "description": "I have only been to this restaurant once, on September 5th.  I really wanted to enjoy this relatively new place, that is nearby where I live.  Unfortunately, I was disappointed, especially considering how highly rated it is on Yelp.\nThe service was so bad, it was hard to appreciate the food.  There are too service errors to list, but here are a few.\nNew waitress which is OK, but the poor girl had absolutely no support from other staff members.  She could not identify the appetizers from the entrees.  She was unfamiliar with the portion sizes and had no recommendations on the food.  Isn't the service staff supposed to have a pre-dinner sit down and become familiar with the menu?\nThe appetizers/entrees were staggered when brought out from the kitchen, not presented simultaneously.  Had to sit and watch my partner eat, while waiting for my food to arrive.\nWhen dishes were finished, it took a long time to have the plates cleared.\nBut, the staff were nice.\nAnother group that had dinner on the same evening also said the service was severely lacking.\nServices lapses happen.  But introducing a new waitress on a Friday night without support?  Mis-communication between the kitchen and servers in such a small place?\nNeeds work.", "author": "Reg R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "We were really looking forward to trying out this new gem and it exceeded our expectations which were high and hopeful. The oyster menu was amazing, great little wine selection that paired with the menu and so many entrees that sounded delightful. We had the king salmon with stuffed squash blossoms and the gazpacho with bay shrimp. Both were really well plated, sized, and tasty. The desert was a closer for both of us. Highly recommend this charming non pretentious but tasty sea joint.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-18", "description": "Really yummy! Please don't leave without trying the calamari salad. I'm sitting here thinking about ordering another one, it was that good.", "author": "Naomi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "Loved everything about this place.\n\nThe food was fantastic, and the staff were warm and welcoming. It felt totally natural to give my server a hug on the way out. Awesome.", "author": "Vicki H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "I have eaten at RHS several times since they opened a couple months ago.  What a great addition to the neighborhood! It is billed as a Seafood restaurant, and the seafood is definitely top notch - so fresh and perfectly seasoned and cooked! But it is so much more!  I have also had a delicious vegan gluten free corn chowder AND and incredibly delicious and oh so warming bison stew. The menu changes daily and it's always exciting to see what's new.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Red Hill Station was a great experience from start to finish.  We were a group of 5 and were seated in the Station's very private dining room with a view over the kitchen.  It was the perfect space.  We hadn't reserved it, because we didn't know it existed!\n\nThe service was patient and expert every step of the way, including advice on wines.  While the wine and beer list is short, there's good variety to match every dish and taste.\n\nMany of the dishes were unique and amazing.  We all loved the Caesar salad, the calamari salad, grilled sardines, flat iron steak, and wild salmon.  The desserts are fantastic.\n\nGet here before the crowds find it.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Everything about the eve was superb  .The reservation was on time , the ambience and the service great and the food unbelievably tasty . The Cesar Salad was perfect  . The Halibut cooked just perfect and with delicious veggies .We will be regulars at this Restaurant .", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Brown butter Seatrout with toasted almonds was Out of this world - Fantamaglorious! We are so lucky to have this new eatery and brilliant chef in our neighborhood.", "author": "Banker W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "We really liked this place. Three of us went, thus tripling our tasting opportunities. \n\nFor starters, I had fried anchovies, which must have been fried very hot and very quickly as they were crispy, delicate, and light--oh, and delicious. They were obviously fresh and had come out of the bay--or wherever anchovies live--that morning.  My dining companions had a prosciutto plate and the caesar salad (sans bay shrimp), both of which were very good.  [small note on the caesar: the dressing tends to the lemony and we decided that the shrimp must be the perfect accompaniment. Next time, we'll follow the recommendations of others and get it with the shrimp].\n\nFor entrees, we had trout;  fettuccini with clams, spagna beans, and andouille sausage; and bison stew.  All were quite good.  The trout was cooked to perfection and everything on the plate was a delight: the potatoes, which often just fill a plate, were tasty and even the fried sage leaves were more than just a garnish.   The bison stew was the kind of dish that you think about days, even weeks later on those cold-ish foggy nights in winter (or summer) when a stew would be perfect.\n\nThe creme brûlée for dessert was very good, but hands-down favorite was the deconstructed hostess cup cake.\n\nBefore dining here, I read the 4-5 star reviews and wondered if the ratings were high because the place is new and all the reviewers were probably friends. Whether that's true or not, the reviews are well earned!\n\nIn sum, we liked this restaurant.  A lot.  The food is fabulous, the staff is friendly and competent. All-in-all a wonderful dining experience.", "author": "Diner S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "I had dinner with a friend on a weekend evening.  Service was super friendly and helpful.  We opted for the \"wine on tap\" sangiovese which was good for the price.  Starter was a dozen oysters, which were tasty though a few of them were three-bite monsters which I don't find that enjoyable.  Mains were salmon and calamari, both of which were tasty. The only reason I am not giving 5 stars is for the layout - the tables are really packed in tightly together, and if you have someone in the table next to you who is talking loud (like we did), it can detract from the otherwise great experience.", "author": "Russ P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "Attended the soft opening, oysters+wine, very impressed by the decor and warm atmosphere. Attended the full launch-- sold!  Service is cozy, atmosphere is festive yet intimate.  Great place to celebrate with friends.", "author": "Obhi H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-10", "description": "Very pleased.....! butter oysters, calamari salad, sturgeon fish, and the funnel cake!  YUM!", "author": "Handan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "Excellent.  Ordered a simple Ceasar salad to feel better about eating fish and chips, and it was the best Ceasars salad I ever had.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "This place is a bit funky, which my wife found charming.  But you're not coming for the atmosphere.  The food is really good.  We are fond of calamari and have tried lots of restaurants and lots of recipes.  The whole squid is fried without batter.  It's spicy and tender and delicious.  The clams with sausage was really good, in fact, judging by everyone's expressions all the food is excellent.", "author": "FC S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Went here with a few friends for the first time. It's small, but a cute place. The service was good through out our time there. The calamari salad was tasty and the fish and chips were pretty good. I ordered the black cod and my husband ordered the linguine. The black cod was fresh and it melted in my mouth(though I will attribute that to a lot of butter used in the prep:). The linguine on the other hand was mouth watering. The meat balls and the sauce were delicious. The don't have a huge wine selection which would have made the experience even better. But over all a cute, delicious neighborhood restaurant.", "author": "Chet L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "We saw this as a Hot and New place on Yelp and decided to make a reservation for 9 here. A server had called from this restaurant to warn us that the table they had available may not fit 9 as well but we were willing to try for such a large party! We tried most of the menu between all of us and the highlights were the bay shrimp ceasar salad, black cod fish & chips, veggie pasta, and oyster pot pie. The seafood was very fresh and tasty. We ordered 2 dishes of a meat pasta that we were particular fans of - too much garlic got in the way of tasting the overall flavor of the dish. Other than that, the meal was presented well and super fresh. I would definitely return again!", "author": "Yi-Fang T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "What a wonderful European feel, local, fresh, neighborhood, welcoming.\nThe food was delicious, my 11 year said \"I had never had such a fantastic crab sandwich, can we please go back for my birthday.\"\nService was impeccable, Taylor and Amy you are doing a amazing job.\nIt's hard running a restaurant. We will gladly drive up from Half Moon Bay for a night at Red Hill Station", "author": "joyce o."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "a quaint and delicious spot in the adorable neighborhood of bernal heights. the atmosphere is a relaxed beachy vibe that pairs perfectly with a seafood focused menu. i had a robust flat iron steak salad that harnessed flavors of morocco.. my dining partner had a delicately seasoned halibut paired with roasted veggies and smooth mashed potatoes. i enjoyed the sampling of potatoes so much, i had to order a side of my own!\n\nunfortunately we did not save room for dessert but will partake next time. i can't wait to book my next party in the private dining room space that overlooks the kitchen. \n\na great, new addition to the neighborhood. i see only great things to come as the menu expands to showcase the best products available to us.", "author": "CTP p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "The place just opened up and has started out with a bang. I had the tuna tartar as an appetizer and the linguine with seafood as an entree and both were stellar.", "author": "Jean P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "My wife and I recently had an excellent dining experience at Red Hill.  First of all the atmosphere was awesome, friendly & intimate.  All dishes were innovative and to die for, particularly the calamari salad, and the hanger steak.  The seafood was \"fresh off the boat\".  Great service !  Bravo!", "author": "Mark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Wow. I am hard-pressed to give away this gem of a restaurant.  When great people serve great food in a great neighborhood, what's not to love? (Only the difficulty getting in I guess!)  Our meal was one we never wanted to end.  Inventive food (gorgeous seafood!) with lovely presentation ... just wonderful!", "author": "Alexandre P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "yum yum yum!!! had the grilled calamari caesar and it was amazing!! there was so much calamari and it was cooked absolutely perfectly. the salad part was whole romain leaves and a warm dressing with crunchy breadcrumbs. loved it so much i came back by myself for just that. so good!!", "author": "Miss T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "My friend and I tried Red Hill Station during our vacation in San Francisco. It's in a quirky little neighborhood way, way off the beaten path for typical San Francisco tourists but it had been recommended to me by a friend. We had a wonderful dinner! Not much to choose from as far as appetizers, but the entrées were wonderful. They seem to change daily. My braised short ribs fell apart at the touch but were so juicy. Desserts to die for. It's A very small place, which lends to the quality of the food and service. The staff was knowledgeable and friendly without being over-the-top. Minor negatives- The wine by the glass seemed a little pricey in comparison to the reasonably priced entrées (they had a small but lovely selection), and I am over mason jar water glasses. Worth the cab fare from Nob Hill!", "author": "Lisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "I've been to Redhill Station 3 times.  First time, food was great, but, since they had just opened, the timing was off and the menu was very difficult to read.  But, the food brought us back.  Next two times were really pleasurable.  A big bowl of Mussels, the Caesar salad, and the Pasta Carbonara was all we needed (along with the house Sauvignon Blanc). Amazing!  We'll be back. They're on the way to five stars for sure!", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Had lunch with friends.  Ordered Caesar with octopus.  The best!  Just enough amount of tang/salt and octopus was so tender.  I recommend this new place to anyone who ask me for a small, intimate and good food restaurant.", "author": "Leilani I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Very good service, we both liked our food a lot. Good portions, and some interesting dishes. I liked the calamari caesar salad a lot, and my fish was cooked well too. Will definitely go back.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "Hip yet comfortable family friendly local restaurant.  What else can I say?  Flavorful seafood dishes await you.  Wines served in beakers.  Crayons and cards for the youngsters.  Tasty and fresh.  Enjoy people!", "author": "Average Jo E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "Delicious. Fabulous service. Beautiful decor. Wonderful dinner. Great beer on tap, super yummy and fresh oysters, to die for ceasar salad, amazing meaty sardines and tasty root veggies and trout. Would order everything again!!  Can't wait to go back and try other things on the menu. Love the quaint neighborhood feel!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "This restaurant is outstanding. The food is amazing!!! They delivered warm olives as soon as I sat down. I had the red trout cooked perfectly, topped with a sage butter and walnuts. Yum! Accompanied by asparagus, crooked neck squash, beets and roasted potatoes. The Oysters are the freshest in SAn Francisco. It was all gluten free (I have celiac). They really understood my food allergy and made it so easy to order. I will be back many times. Service is great too.\nI could eat here everyday. Next time I will have the grilled calamari salad and steak with beets and masked potatoes. Or maybe I will have the clams, muscles and sausage.", "author": "Daune F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "love the sardine salad for lunch -\nsubstantial & tasty.\nthe service there is also a cut above -\nwould definitely go back.", "author": "Kim Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Took my visiting mom here, along with my two very young kids. They had coloring books for the kids and sat us in a private room overlooking the kitchen. Very good food. We came for an early dinner without reservations and didn't have to wait at all.", "author": "Leigh C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "Delicious late lunch! Had great assortment of very fresh oysters; a must if you love oysters. Generous portion of cod, perfectly prepared--enjoyed every tender, flavorful bite. My friend had the whole Dungeness crab, a large crab served in sublime broth. Service was attentive. Classic, welcoming SF neighborhood feel with custom touches, including beautifully carved benches. Looking forward to returning.", "author": "Kelly E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "A friend recommended this place for a special dinner to celebrate our anniversary.  We were very happy with the recommendation.  The food was very good, the menu unique, the atmosphere unpretentious, and the service friendly.  We had a really enjoyable dinner and now we can recommend this place too.", "author": "N M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Sunday evening family dinner; 2 adults-2 kids(6yrs.) and no reservation. \nI would recommend calling for a reservation, although our wait was minimal and the staff was very hospitable while we waited, it's a very busy place.  \nDinner selections: (they mentioned the menu changes nightly)\nAnchovy app.\nFish and Chips\nPot Pie\nSand Dabs\nboth Desserts\n\nEVERY bite of every dish was amazing!!!  Fresh, flavorful, balanced, beautifully  presented and nice size portions.  All the staff were smiling, kind and everything came out in a timely manner.\n\nThe details of the decor and serving dishes won my heart!!! Copper,wood and marble with a warm eclectic finish, well done!!!\n\nCONGRATULATIONS  and welcome to the neighborhood!!!!  Can't wait to return soon.", "author": "Kate T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "I went in there around 9:30 on a Saturday night after having heard from a friend that this new restaurant was worth checking out.  The restaurant was about half full, although the waitress told us that it had been packed most of the evening.  We started off with a dozen oysters and a couple of glasses of Sauvignon Blanc.  The oysters were delicious, which was not surprising given that this place advertises as an oyster bar, but the wine was also quite good.  It came out of a tap (which I have not seen very often) and was crisp and well structured - obviously selected by someone who knew about quality wines.\n\nMy boyfriend and I shared the black cod, which was baked and sprinkled with toasted almonds and crispy sage leaves.  The cod was probably the best cod I have ever had: buttery and tender, yet still firm, and the sage and almonds added a lovely delicate flavor.  It also came with a grilled white peach, which is in season right now and very sweet.  Sides included roast potatoes and squash. The dish was generous in portion and quite reasonably priced for the quality.  \n\nThe chef/owner (who is a handsome Sicilian man who used to cook at Anchor Oyster Bar) came out and chatted with us for a while, since we wound up being the last customers in the restaurant.  He was quite funny and warm, and made us feel well taken care of.  He told us about the process of fixing up the restaurant and it sounded like quite a barn-raising - the previous owners had left it in shambles so they pulled together a big team of friends to help clean and remodel it on a shoe-string budget!     \n\nThis restaurant has just opened up and has apparently generated quite a buzz already.  I'd recommend making reservations in advance, although they do have tables reserved for walk-in.", "author": "Meg S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-06", "description": "Two friends and I had snacks here this evening. We were not terribly impressed. Very limited wine and beer selection. The wines weren't necessarily the best matches for seafood, especially oysters. \nThe oyster selection was decent - 4 types. Amply chilled. $2.50 a piece is good compared to some other spots in SF. We split a dozen and were aiiight on the oysters. \nThe fried anchovies were perfectly battered and salted. Small portion. Pesto was way too oily and too much for the fish. The dish was garnished with butter lettuce. \nCalamari salad.  Calamari was overcooked. Slim portion. The supporting salad players were tasty. The salad contained butter leaf lettuce which ended-up being a theme in 3 of our dishes. \nThe clam crudo and fritter. Butter lettuce! The fritter component was good - the raw clams - they were overly cured or something. Too chewy. \nI was Ok with the casual decor but the prices were far from casual. Pretty spendy for small portions and subpar fare. \nService was awkward. \nI might go back - just for oysters and some wine on tap. Try some other stuff after they get their sea legs. \nWe opted not to try other dishes and went elsewhere for part deux of dinner.....", "author": "Carson R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-15", "description": "It really pains me to write a negative review for this place, since it was some of the best seafood I have ever had, but that's exactly why I feel this review carries so much weight - the owners need to know how abysmal my service was last night so that they can fix it and have a successful business in the ever competitive San Francisco food scene.\nShall we begin?\nThe night started with me arriving for my reservation. I told waitress 1 (shorter, medium length hair) my name and that I had a reservation for 2. She walks off to check, and doesn't reappear. A bit later, after seeing me just standing around, waitress 2 (taller, younger, very short hair) asks if I have a reservation, I say yes, and she promptly seats my girlfriend and I. Why waitress 1 didn't do that and where she went is beyond me. \nNext we sit down and place a bottle of wine I had brought on the table. Waitress 1 comes by, asks if we wanted the bottle opened - I said yes - then takes the bottle and disappears into the back. This is a huge faux pas. Now I don't need a song and dance with cork smelling and the sort, but you never ever take someone's bottle out of sight, then return with it opened. She could have done literally anything to it (the big concern is she pours it out, then refills the bottle with something else - that's why it is such poor etiquette to take the bottle out of sight like that). The wine tasted how it was supposed to (ie not doctored), but it's still should not have been done.\nWe place our orders all at once, oysters, app, 2 entres and eagerly wait for our food - the entire menu sounded great! \nFirst to arrive was the anchovies, the dish is a grill so they were cooked. I don't know who messed up the timing, the kitchen or the waitress, but you shouldn't serve a cooked dish (or really any dish) before oysters. It just didn't make sense. Then, when we were still eating the anchovies, she arrived with our oysters. This crowded out table and made us rush through the anchovies. She could have waited until we had finished one dish, before bringing out the next. \nLater my calamari arrived, but our table hadn't been bussed so waitress 1 took our side plates and utensils to bring out clean ones. So I had my calamari sitting in front of me with no way to eat it. It was actually kind-of comical. Later she returns and gives me a fork and a knife and my girlfriend just a fork. I had calamari she ordered cod. If anything the lone knife should've been given to her. \nWe then sat waiting for the second dish - I don't like to eat before the whole party gets their food. We waited about 5 mins before jointly deciding that my food was getting cold. Then we started to share my dish when waitress 1 promises that the cod is on it's way. We stop sharing and continue to wait. Probably another 10 mins went by and my girlfriend insisted I eat. I did, the food was completely cold by that point. Around the time I finished my dish the cod arrived.\nI sat politely and waited while my girlfriend ate her dish (a very odd situation, hard to make conversation while someone's eating and I had nothing to eat myself). Waitress 1 comes over and apologizes saying the cod is on the house. She then asked if we wanted dessert, and when I say everything on the menu looked good I mean everything including all the desserts, but we declined because we were positive it would be screwed up in some way. \nWaitress 1 brings our check and takes a card. She then returns later with a receipt sleeve. We open it to find just one receipt. No card, no signable receipt. We both just started laughing. It was almost like we were being punk'd or something. Waitress 2 later arrives with the card and we sign and go.\nRed hill really needs to work on its timing. The food was stellar, and I would like to one day return, but so many things went wrong. Please fix - the only reason this isn't a 1 star review is due to the quality of the food and the fact that they comped a dish.", "author": "Philip B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-21", "description": "I've been a fan of Chef Taylor for years and when I heard he was opening his own restaurant I was super excited.   It was the second night the restaurant was open and it was buzzing!   The decor of the restaurant was cozy and warm and the staff very friendly.   For a restaurant newly opened the front of house staff was efficient, friendly, and very accomodating.    I had the Ceasar Salad and the halibut with tarragon, asparagus, shiitake mushrooms with fingerling potatoes and walnuts.     The Ceasar was yummy as other reviews have stated.   Chef Taylor use vegetables very nicely in his dishes.  The halibut was perfectly cooked and the walnuts added a nice texture to the dish.   I live in Santa Monica and visit SF from time to time and look forward to coming back next time I am in town! Big 5 star review!!   If you live in Bernal you are lucky!  If you aren't in Bernal, now you have one more reason to visit this cool neighborhood!  Check it out!", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "This place is amazing, great food matched with fantastic service.  I am not a fan of long winded reviews so I will keep it short - try this place now before it becomes the next NOPA", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "It is a great little place and unexpectedly good too, yet not terribly exciting. I'd definitely return to try a few more items from the menu.", "author": "Mehmet G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-07", "description": "Wow what a treat!  We were strolling along Cortland Ave. deciding where to eat when we walked by this gem!  Saw the fish stew on the menu and I was sold. I was not disappointed either. My wife and I ordered the fish stew, fried smelt, and a side of french fries.  We were so amazed with the depth of the flavors of our dishes that we couldn't stop talking about it when we got home.  Prices are reasonable, our waitress was super awesome, service was super attentive, cute little restaurant, wine list was good with generous pour, and most importantly the FOOD!  We most definitely will be coming here again!", "author": "Kristin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "Celebrated a graduation lunch there last month - May. We were a party of 9 and was placed in their separate dining area. We got to the restaurant a little earlier than the reserved time and were comfortably showed to our seating area. The food was delicious - ceviche appetizer, seafood pasta, fish & chips,  and crunchy fried pickles, to name some of what we ordered. They provided us with tastes of the beverages, we were contemplating on ordering. We never felt rushed and the serving staff, checked back with us enough, to make the whole lunch experience there super enjoyable. We had a GREAT TIME!!", "author": "LaFlor B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "We shared the fried sardines & had the lamb chops & a carbonara & also shared a pot-de-crème for dessert. Everything was delicious. The waiter was pleasant & helpful. Can't wait to return!", "author": "Jorge Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "What a wonderful place!  Would love to have quality, reasonably priced dining like this in close proximity to my neighborhood.  The waitstaff was friendly and pleasant and knowledgable but did not \"hover\" or try to speed you up.  The food was outrageous good, and portions more than adequate.  And why pay big name prices at the big name places when you can eat here - better food, smaller price.  Go and enjoy.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Congrats Amy and Taylor! The place is fantastic and the food is phenomenal!  We will definitely be back for more!!!!!", "author": "Adonica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "I had a really nice Valentine dinner at the Red Hill Station... I was a little nervous going there since some people complained on the Yelp bible ;) of not enough seafood in cioppino and too much noise in the room etc... but I ended up pleasantly surprised... It wasn't noisy at all; we were able to have an intimate conversation, lots of elbow space and the decor was charming without trying too hard. If I ever had any doubts about oysters, I have made my mind that night... I love them; good oysters really transport you to the beach and it is like having ocean in your mouth... in a good way ;)\nI had a trout for the main course and even though it was a relatively a simple rustic dish, I must admit it was delicious... you can't go wrong with sage pecan butter, you simply can't... \nMy husband was a little less excited about his carbonara; he complained it had too much bacon in it... he left half of the bacon on the plate... it was a heavy dose of bacon, that's for sure... I guess there is such a thing as too much of a good thing ;)\nThe bread, olive oil and balsamic, olives were all delicious. So was the desert: lace cookies with berries and whipped cream... simple but oh, so tasty... a big portion as well... :)\nI was very happy with my wine as well: a delicate French white...unfortunately half way through it, I ended up knocking my glass over and breaking it... :9  ...the waiter was very gracious about the clean up... he brought me another glass but at the end of the night my husband did get charged for it... it was a $15 glass of wine and even though I admit it was my fault, I hoped it would not show up on our bill... I did some research on it when I came home and it seems that opinions are split, even though most restaurant owners seem to believe that a good restaurant will absorb the breakage cost... It isn't really about the money but I feel it would be a nice gesture if it had been on the house. \nEither way, I will be back for the oysters and another glass of that overpriced French white ;)", "author": "ania w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "We had a lovely prix-fixe Valentine's Day meal last night. The food was delicious and the service was also very good. We opted for wine pairings and we delighted with the expert doing the pouring as well as the wines. The portions were generous. The only downfall was that the desserts were not up to the level of the rest of the meal, with too much alcohol in the zabaglione and a tough density to the creme brûlée. We will be back, however, and look forward to trying out the regular menu.", "author": "Rachele F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "ummm, where to start? red hill station is such a great addition to the neighborhood. the staff is kind, on it and super accommodating. the chef will always make a special vegan meal request. every time i eat here, IT IS DELICIOUS. all my family and friends LOVE the seafood. the servings are generous, the food is underpriced and the quality is clearly excellent. can you tell i'm a fan...?", "author": "joey e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Amazing.  Delicious, heartbreakingly good food. Beautiful presentation. Warm, neighborhood vibe. Exquisite seafood. Superb oysters. And awesome desserts! There is magic here.", "author": "Jolie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "The seafood was so fresh. The service was excellent and the ambience was great. The crab was devine.", "author": "Mark C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This place is fabulous. The ambiance is great, I loved our waiter, very nice and his suggestions were spot on. Wine was very good. I had the oysters, AMAZING, mussels  were delicious and so the was shrimp Caesar. Will be back!", "author": "Claire R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Caesar salad with bay shrimp is one of the best I've ever had. Here's a tip- ask for the dressing on the side. It allows you to see how gorgeous it is! It's so good you'll want to keep it for dipping. Grilled calamari with figs was scrumptious although they could put less dressing on the greens. Trout with almonds was perfectly cooked and served with seasonal vegetables and brown butter sauce. Oysters were served beautifully in what looked like a very large vintage french tureen. Bread is wonderful- be sure to ask for it as it is served with a small bowl of olives in what tasted like a olive oil, chopped garlic, and red pepper mix. Didn't stay for dessert because I'm not a fan of Mission Pie but I know others love it. So glad Red Hill is finally here! Also, don't hesitate to take your vegan or vegetarian friends here- they have a pasta and vegan option!", "author": "Micah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "Excellent food, super nice owners. Great addition to the neighborhood. Make sure to get the pot de creme!", "author": "Milodaman Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "Love this new addition to Bernal! Everything was fresh and delicious.  The fried anchovies were my favorite!  The folks working there are great and very accommodating to my gluten sensitivity.  Hoping there will be more gluten free dessert options in the future :)", "author": "Francine T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-22", "description": "This is a good neighborhood option. Nice fish and seafood presentations, simple and straightforward, very friendly and accommodating service.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Gourmet served with with a friendly vibe at decent prices. New favorite spot in Bernal!", "author": "Al K."}
