{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Two words describe this place perfectly:\nSimply decadent!!\nThe wine list is impressive \nThe service is exemplary \nThe food is Uber delicious\nDo not skip the epic cookies!!!!!!", "author": "Randy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "We enjoyed a nice, low-key, leisurely brunch here. Their Banana Foster French Toast was AMAZING! \n\nWe made Sunday brunch reservations here, but it seems to be one of the few places in Hayes Valley that didn't necessitate it. It's probably because it's in the more residential area (though only a few blocks from Patricia's Green). At 10:30 am, there was just one other party here.", "author": "Cece Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Yum! My extended family and I dined here Friday evening with a reservation for my dear cousin's post-wedding meal. Service was superb and the food was delicious for the most part. I enjoyed my paella, but it definitely wasn't as good as paella's that I get at actual Spanish eateries. Food highlights included the poke appetizer special and the brie appetizer. My husband loved his pork chop entree. Our cocktails were delicious as well! I had the Rosette and most people had the blood orange margarita. \n\nI would definitely recommend this place for your special occasion or date night. They were accommodating to children as well.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-30", "description": "Food was ok, nothing special. Nothing was very flavorful.\nService was ok. Atmosphere was pretty cute and cozy.\nThere's so many great food options in SF, especially in Hayes Valley, so I wouldn't go back.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "We came here on the hunt for a good steak and were extremely pleased. Started with the escargot and it was incredible. My boyfriend and I both got the ribeye for $39. This is one of the best steaks I've ever had! It came with a light gravy that is more of a broth, alongside some green beans and scallop potato casserole! Everything was perfect. I couldn't have asked for a better experience. Our total Bill was around $150 for two entrees, an app, a bottle of wine and an espresso. I hope this place sticks around and I can visit next time I'm in town!", "author": "Alli E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "I'm jealous of all who have written 5 star reviews.  You must have had delicious dinners.  I most assuredly did not.\n\nSaturday March 24, 2018, 5:30pm.  3 of us arrive for our reservation.  Greeted warmly by both the barman and the hostess / server.  Sat promptly.  Service throughout the meal was timely, poised and professional.\n\nStarted with the salmon terrine.  It was smooth, creamy and tasty.  3 toast points with slightly pickled onions, fennel and capers on the side.\n\nMy coq au vin was no more than faintly spiced stewed chicken.  Just boring, bordering on awful.  Thigh & leg sitting on a small bed of linguine that was \"dressed\" in a watery sauce of chicken broth.  3 halves of baby carrots completed the plate.  My wife had the grilled fish fillet.  It was not watery, but it was by no means a delicious meal.\n\nObviously, someone important was missing from the kitchen this night.  I walked in hungry.  Walked out feeling rather disgusted, like they took advantage of me.\n\nFor $180 total, we did order a $45 bottle of wine (complete rip-off, it costs $15 at my local wine shop), this meal was one of the worst I've had in months.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Another great find!\nThank you yelp for sending me suggestions, and this was one of them.\n4 of us went here last night for dinner.\nI did not expect this place to be so small and cozy, but this place truly looks like a French bistro, not too many tables, perfect setting, great service and a brilliant manager who was friendly and help us with any questions we had.\nFood is great. Big portions, very well presented.\nEndive salad that I had, was probably the best I ever had in the US. Scallops, salmon, and filet mignon were done to perfection. \nGreat selection of wines, and if you are not sure what to pick, ask the owner, he is really knowledgeable and will pick the right one for your taste.\nAll together great food and great experience that we had here.\nDefinitely coming back!", "author": "Bianca G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "Been here several times now, love the bone marrow. Services always great.  Only reason gave 3* this time because food were not that great last week.  The escargot were as if forgotten to season. Foie gras was good, scallops in the risotto was good but the risotto has some separation, the liquid, not like a creamy sauce but rather like steam liquid sitting.  The beef tartar was also a bit blend and also a bit rough, may be missing an egg or something.  May be chef went vacation.  They look great in the picture too! I am sure it's just one-off, usually everything outstanding ...", "author": "CAScuba Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "Here's what I look for each year, when planning holiday brunch for myself and a gaggle of friends:\n\n*  Must be in San Francisco, must accept reservations, and the food must be well-reviewed. \n\nHere's what I hope for each year when planning holiday brunch for myself and a gaggle of friends:\n\n* A place that seats us before our whole party arrives (friends coming from the East Bay are notoriously late);\n\n* A place that doesn't rush us to order;\n\n*  A place that doesn't pressure us to turn the table; and\n\n*  Food that delivers on the promise.\n\nIn advance, I always know whether I can get what I need but getting what I hope for is an unknown.  Revelry Bistro delivered everything I needed and hoped for which leads me to say if you're looking for a great place for brunch with a large group of friends (or even a small group), Revelry should be high on your list.  \n\nThe round table reserved for my party of six was perfect: not too close to the front or the back, out of any draft, and both cosy and warm.  It provided the intimacy needed for a good session of catching up.\n\nOur server offered drinks (Bellinis, Mimosas, and Bubbles) with no pressure to order and even once our whole party was seated, there was no urgency to move us along.  Can I tell you how much we appreciated this?  Excellent service is always welcome.  \n\nOur food, when we finally did order, hit the spot perfectly.  We had begun with fabulous a la carte biscuits, raved over by all, then moved onto a Bananas Foster French Toast to be shared by the 6 of us.  As entrees, we sampled Eggs Benedict (Classic Benedict,  Salmon Benedict), Croque Monsieur, and Duck Confit Salad.  Brunch dishes average about $15 apiece and all were tasty and satisfying.\n\nRevelry's owner worked for many years at Bistro Central Parc, and just like there, a quality product is delivered.  If we as a group had a single niggle with the menu it was only that it featured no omelets, focusing almost exclusively on Benedicts as the eggy brunch fare.  Still, we weren't complaining.  The food was good. \n\nRevelry Bistro is located in Hayes Valley, close to the uber-popular restaurants lining Hayes Street, but far enough from those that you would have to know of it to run across it.  Now that you do, you should make brunch plans.\n\nAt the risk of arriving next holiday season only to find the place packed and turning tables at a fast clip, I offer up this recommendation.  It's a very sweet place, with delicious food and a relaxed - dare I say European - attitude that's easy to enjoy.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "Came by here for a double date. The service was perfect both before seating and during the meal. The food was very well done and enjoyable. Some good wines on the list as well. Cost was high, but expected.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Came here to meet a friend for brunch and totally adored my experience. The service was pleasant and prompt, the ambience was friendly and clean, the structure reminded me of a true French diner that you might find when touring Paris. \n\nI started with a soylatte, standard with solid espresso and decent foam. Next we had mimosas which were perfectly balanced with fresh orange juice and crisp champagne. For my meal I modified the beet salad to include goat cheese and a poached egg. Something in the dish tasted like truffle though I'm not sure what. There was a healthy portion of beets, delicious pistachios and tender gem lettuce. \n\nI expect a vegan would struggle with the menu but can definitely modify to discover a delightful, delicious meal. My only change would have been to redirect the sunlight as we sat outside in the shade but otherwise a great experience.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Really good appetizers. Bone marrow is super delicious also the cauliflower. \nWe had the steak and veggie dish. It was pretty good. Good meat. But Medium rare was too rare. \nNice and cozy place. Nice wine. \nNice people. \nWe will go back for sure. I will order more appetizers.", "author": "Hani G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-25", "description": "After my first visit to Revelry, I was so pleased to find a sweet little French Bistro in SF.  So pleased that I promised my husband that I would take him there on our next trip into the City.  At that first visit, our group of 4 ladies seriously enjoyed everything we ordered.  So, as promised, I made reservations for hubby and I to dine there before a music event close by at SF Jazz Center.  \n\nWe had a very pleasant greeting by the restaurant staff and were seated right away.  We sat upstairs at a long farm table, sort of reminiscent of a country French restaurant.  Service was quick, and after letting our server know that we had limited time, service was even that much more efficient.  \n\nWe ordered a bottle of French Burgogne (aka Pinot Noir) at $45.00 a bottle.  That was the first disappointment.  Not a great choice for the wine list, sour cherries and absolutely tart with no taste of fruit at all.  Tasted nothing like the bargain Burgogne wines I had throughout France.  Next came the salmon terrine.  This was a nice presentation of a good size piece of terrine.  Definitely enough for 3 people as an appetizer.  It came with pickled onions and capers and toast points.  \n\nI ordered the Sautéed Striped Bass, which came with some roasted veggies and a very light and mild sauce.  Most of the fish was cooked through, except one corner was completely raw and I couldn't eat all of it plus the skin was not crispy at all.  Kind of soggy skin. The real disaster of the evening was the so called \"Coq au Vin\".  Now most everyone knows this is a very classic French stew, that consists of chicken well seasoned and marinated overnight in red wine, then sautéed for a nice crust and then stewed with mushrooms and pearl onions.  I have made this dish several times over the years and if prepared correctly is simply divine.  What was served to my husband and our other dining companion was a tragedy!  Very bland stewed chicken, slightly overcooked, served on a bed of linguini noodles that had something like chicken broth on the bottom of the bowl.  The chicken was so bland and it was almost like it was steamed.  The skin was rubbery as well.  This entrée was not Coq au Vin!!!  It was really a horribly prepared entrée.  \n\nI can only assume that something was way off in the kitchen.  Maybe the head chef had the night off?   So for $183 with tip for 3 people, this was such a disappointing meal and experience.  And so embarrassing for me after I had just raved about this cute bistro.  I will not embarrass myself again.  That's it, I won't be back.", "author": "Barbara S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "the food was actually really good. I believe They swap out the menu on a daily basis, looking forward to visiting again.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "I was also here on Saturday, March 24 ~5 PM and enjoyed a fantastic meal with a group of 8. First and foremost, as it appears to be a hot topic... I ordered the Coq Au Vin, and thought it was delicious. The only thing left on my plate was a bone or two. It is a fairly simple dish, but quite flavorful!\n\nWe started with baked brie and salad. The baked brie appetizer was so fantastic. It comes with roasted garlic which pretty much melts onto the crostini. Just delectable! \n\nThe only hiccup of the night occurred with the delivery of my salad. I was curious about the \"apple gastrique\" on the Endive Salad, and our server (who is slightly reminiscent of chef Robert Irvine) gave a description that ultimately led to me ordering this dish. \n\nWhen the food runner arrived with the Duck Confit salad, I let him know that this was not what I ordered. Moments later our server came over, with the sent-back salad and menu in hand. He handed me the menu, and pointed to the salad section, \"remember when we talked about the apple gastrique...\" He was actually trying to show me that I was wrong, with the plate in hand!  Fortunately, the menu did not lie, and he quickly realized and fixed his mistake. The salad was great, but I have literally never had a server bring a over menu and the incorrect plate to try to prove that I am wrong. Unreal.\n\nWhile the rest of the group enjoyed some fine wines, I was pleased to discover a delicious IPA on tap from 101 North Brewing. It was fantastic! \n\nLastly, I just wanted to give a shoutout to a member of the team named Chris. While he was not our primary server, he was extremely helpful and professional and added to our memorable experience. We'll definitely be back!", "author": "Alex E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "Went on a Sunday to celebrate a birthday. Being a Sunday, the place wasn't busy. \nThe atmosphere was  cozy, charming and inviting. Sylvania was attentive and a gracious host. \nWe had various apps and entrees. And although the food was good, there wasn't anything that really stood out for us other than dessert which we devoured in the blink of an eye. \nParking is a challenge but where is it isn't.", "author": "Jay F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "This place was a fine. The service is great and the food was amazing. Our drinks were never empty the server made wonderful recommendations food came out quick and was very very tasty. It is now my go-to restaurant for out-of-town folks", "author": "sean d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Really fantastic French bistro. Favorites: seared foie gras (need to call in advance to confirm availability), bone marrow, Brussels sprout salad, steak. Everything we had, though, was good. My only wish (not a complaint) is for better bread. Service was excellent. Will be back!", "author": "Musetta S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "We had a reservation for 2 on a Saturday night and we got a table in the back.\n\nWe shared a salad with duck confit, goat cheese and pears to start. It was good and fresh.\nThey also brought us baguette with butter. It wasn't the freshest but close enough to what I like.\nI got the vegetable gnocchi and my boyfriend got the steak. Those entrees were amazing! Great portion, amazing ingredients. \nThe gnocchi were really good and the peas and mushrooms crunchy and fresh. I enjoyed every bite of it!\nThe steak was delicious, perfectly cooked, with potatoes and green beans. It could have had more sauce though.\n\nI am big on dessert so we got the chocolate cake with coconut ice cream and the crème brûlée. Both were big and really good!\n\nWe had a great time at Revelry! Thank you to the owners and staff!", "author": "Coralie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I sat at the bar as the tables filled in from 630-7p. It feels like a French bistro. Jazzy music, warm chatter and extraordinarily personable service. I had the snapper and it didn't disappoint. And those wasabi scented mashed potatoes....so simple, and so perfect a combination it brings this dish into a  dimension that only dreams are made of. They hit every mark. The epitome of a corner bistro.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "Revelry is a cute neighborhood bistro located near the heart of Hayes Valley. My girl friends and I made reservations for one of our weekend brunches, upon getting there around 12:30 on a Sunday there were still several tables available. The menu was a little shorter than I expected with some appetizer options (including duck confit salad), the brunch egg courses were all eggs Benedict so as someone who can't do brunch without eggs I went for the Revelry Benedict. It came with side salad, potatoes, and Dungeness crab meat, but overall I found it to be just ok, not very memorable in my opinion. Maybe we should have gotten the Banana Foster French Toast or some other plates to share but we were too full to do so. Service was also kind of lukewarm, especially for a not too busy morning, but maybe it's just the French bistro let's be tres cool kind of style. The dinner menu looked like it had much more variety guess I'll come back again to check it out!", "author": "Johanne L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-10", "description": "So disappointed with my birthday dinner here. Not sure if someone had called out sick, But they appeared super understaffed. Our server was also greeting guests, clearing plates, and tending bar. We wouldn't have cared too much, except the food was also not great. We had a crudo that was decent, as was the risotto, but the cut of beef on the steak was not very good. Overall we did not enjoy the experience and would not come back.", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "Charming spot in a great neighborhood but sadly, those were the highlights of our meal.\nThe service is attentive but most dishes we had were just ok on taste. Good presentation though.\nAll in all, for the price one could do much better in this area.", "author": "AL K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "Merci tres beaucoup to everyone at Revelry Bistro for bestowing upon us such a fine dining experience for my friends 22nd birthday. \n\nI've been really into French cuisine lately, so when the gf asked me for help for a place to hold her birthday dinner, I was quick to bring up the name Revelry Bistro! Tried making a reservation through OpenTable and Yelp but they were completely booked for Friday night on April 21. So I privately messaged the establishment and within an half an hour, owner Brad responded and helped us secure a reservation for 8! Woo hoo! \n\nAt first glance, I mistaken Revelry for a tiny corner coffee shop but after we entered, we were led to the back room with this beautifully set-up table spaciously fit for our party of 8. Vibe was very welcoming and friendly. Decor was pretty with the lights semi dimmed and real fresh flowers as their center piece. Pretty romantic and cute !\n\nOur waitress was Silvana and from the get go, she had on friendly smile. She gave us plenty of time to settle in as the rest of our party arrived then she explained to us the specials. \n\nSMALL BITES:\n- Escargots ($12): six pieces of escargots in shells stuffed with parsley, garlic, and oil. (3/5)\n\nSPECIALS: \n- Scallop Sashimi ($16.50): scallops were pretty fresh topped with cucumbers and black tobiko. This dish impressed the bf and I. Definitely didn't expect the taste. (4.5/5)\n- Alaskan Halibut Ceviche ($16): small portioned for the price. The Ceviche consisted of cubed-sized halibut, avocados, onions, tomato, cilantro, etc. Paired with some chips. It was pretty average... (3/5)\n\nFROM THE OVEN: \n- Bone Marrow ($14): one of my most favorite dishes of the night! The marrow was hot with drippings. Texture was fatty and literally disintegrated in my mouth! Spread on these crispy bread chips with the complementary tomato jam was delicious!! Definitely a must get (4.5/5)\n\nENTREES:\n- King Salmon ($28): New Zealand king salmon on top of wasabi mash potatoes with some asparagus. Salmon was cooked perfectly: soft, moist, and juicy on the inside and crusty on the outside. Paired with the wasabi mash was VERY appetizing... the mash was simply something I've never tried before! very unique in taste. Asparagus were a bit too mush and I couldn't bite them apart. (4.5/5).\n- Mushroom Risotto ($24): well.... this entree was a bit disappointing. The shiitake and oyster mushrooms were super tasty and flavorful but the risotto was like a glob of tasteless mushy rice. (3/5)\n- Filet Mignon ($34): majority of everyone in our table got this. The filet mignon was cooked perfectly medium rare as requested. Paired with these potatoes and green beans gave a healthy finishing touch. Some even added the Seared Fois Gras for an additional $25 (4/5) \n\nOur overall experience was very pleasurable and satisfying. Service was very attentive. Silvana checked in with us frequently and came to us in a timely matter such as when we finished our bottle of wine or for water refills. She was nice and polite as was the other staff. I loved how they cleared our table often and gave us new utensils!! The staff were also very spirited and cheerful when they brought in our cake to sing happy birthday to my friend. There was a cakecage fee of $24 ($3pp). \n\nIn total, our bill was ~$736 for 8 people with 20% gratuity. Bout $92 pp. We all left stuffed, satisfied, and still complimenting about the food!! Thank you Brad and staff of Revelry Bistro!", "author": "Anissa D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "I was scrolling through FB and recognized this guy under the \"People you may know\". I was racking my brain trying to remember where I know him from. And, then a light bulb went off: OH, HIM. \n\nSorry to disappoint you but it's not a walk of shame story...\n\nYears ago, we had gone on a first date at a very casual chain restaurant and when the bill came (counter service), he just stood there and didn't even offer to pay for his half. \n\nMind you, it was at was at Fuddruckers. What are we - 12?! At the time, we were both in our mid-20s and employed. Then, he was texting throughout dinner. \n\nNo surprise, we never spoke to each again. \n\nNow, if the date was at Revelry Bistro, then it would make for a juicy walk of shame story (Hi, dad....just kidding!). \n\nIf you're looking to really impress a date, then look no further than Revelry Bistro. It's a charming French Bistro that's warm and cozy but casual enough so you don't look like you're trying too hard (to get laid).  \n\nJerome who runs the FOH is an absolute charmer and can totally be your wingman...because that French accent. You may remember him from Bistro Central Parc and he never forgets a face. It's been years since I've seen him and he welcomed my friend and I with open arms. \n\nFor dinner, they have a standing menu with fresh oysters, crudos, cheese boards, charcuterie, and salads. Their entrée menu changes daily but if you've been to Bistro Central Parc, then you know that the Tournedos Rossini: Filet Mignon topped w/ seared foie gras is the dish to order. They have it here too! Beer and wine only. \n\n(Please excuse the bad food pics, it was dark.)\n\nWe started with Roasted Bone Marrow ($14): http://bit.ly/2oJlCmo which was rich, unctuous, and sinfully delicious. You can rarely go wrong with beef butter and there was no shortage of marrow in the bones. The accompanying tomato jam added just the right amount of acidity to balance the richness. \n\nFor one of our shared mains, we ordered the Slow Roasted Porchetta w/ brown butter flageolet beans, broccolini, arugula pesto ($28): http://bit.ly/2py1eom. The porchetta's skin was perfectly crispy with a good crackling crunch. The meat in the center was really dry though. The flageolet beans were hearty and comforting, and reminded me of a cassoulet.\n\nThe Filet Mignon w/ seared foie gras, black truffle butter, haricot vert, roasted marble potatoes, port reduction ($59): http://bit.ly/2okkWml didn't disappoint one bit. The filet mignon was cooked medium rare as requested. The crown of foie gras added a luxurious richness to the tender filet mignon. The black truffle butter and port reduction provided a good balance of rich earthiness and tang. Both the marble potatoes and haricot verts were perfectly cooked and had a good bite to them. \n\nFor dessert, we shared the Crème Brulee ($9): http://bit.ly/2pdUxec and the Profiteroles w/ vanilla ice cream, chocolate sauce, almonds ($9): http://bit.ly/2ok4kv8 which were a bit underwhelming. The crème brulee wasn't fully set in the middle (runny) and the ice cream in the profiteroles was icy. \n\nService was friendly and polite, and our server made a great beer recommendation (Scrimshaw Plisner). Food service was leisurely but without long lags. Tiny gripe, my water glass was left empty for a while and several people had passed by without noticing. \n\nRevelry Bistro is a great date place and they have one large table in the back for a large party (~10 people). Weather permitting, they also have outdoor seating so you can dine with your furbaby. \n\nParking is easy (no meters) if you have earlier dinner reservations, otherwise, allot 10-15 minutes to look for parking. There's no nearby parking lots. \n\nCan't wait to return to Revelry Bistro with my date...the four legged one that doesn't talk back and likes to sniff butts.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "A good ambience restaurant with good food!\n\n* * * EXPERIENCE * * *\nMade a reservation for three on a Friday night. Upon arrival, we entered the restaurant and it was kind of a bar area, and there was only one staff there. He was busy taking others orders and we stood there for a few minutes before he had time getting us. Fortunately the services after that was pretty attentive.\n\nWe went up half floor to another seating area for the dinner. We had three people but was arranged to sit at a square table and wasn't very big so it was kind of cramp. But that's okay, we were not planning a big feast anyway.\n\nThey do have some pretty interesting wine collection. We got a half bottle of Chateauneuf-du-Pape which was one that I have always been wanting to try, but it fell short to my expectation. It wasn't too well-balanced, with the alcohol standing out, overshadowing other elements of the wine. We also got some half glasses afterwards and those were pretty good.\n\n* * * FOOD * * *\nEscargot: A-\nThe garlic and green onion they used to marinate the escargot really brought out the flavor of the meat. There were 6 pieces but unfortunately one of them was empty inside. We talked to our waitress and she was kind enough to get us one replacement. \n\nFrog Leg: B+\nNot that it was bad, just nothing surprising. It's fried, and the meat was towards the dry side.\n\nReddish: B+\nIt was basically just some raw reddish with salt on it. After eating escargot and frog leg, the reddish did refresh my appetite to prepare for the main course.\n\nKing Salmon: A-\nThe salmon was marinated very well, and it was baked+fried and the moisture was completely kept inside the salmon meat. This dish also came with asparagus and mashed potato, both were very nice.\n\nWith it's good ambience, this place is a perfect restaurant for a romance date night.", "author": "Simon C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-22", "description": "I changed my reservation from La Folie to try out this new French restaurant in Hayes valley.\n\nIn short, a very cute restaurant with ambiance, good food, ok service, and best of all, great value!  All the dishes I tried were remarkably tasty, authentic, and with huge portions.  However, I left disappointed that it took too long to get my dinner entree.   Yes, I ordered lots of appetizers as the menu was totally enticing.   There were probably not enough man power for the work load that the restaurant could handle.  \n\nThe wine list was average.  We tried the Zinfandel and Pinot, which need sometimes in the air.  I noticed one server running around serving many people.  I know it's tough but dining out only gets perfect if the experience can be with spectacular service and plentiful and amazing food.  Service was good but not great. But that is truly nitpicking.\n\nOne unbelievable thing...  how could this kitchen run out of a desert?   Totally shocking with full disappointment!  \n\nThere were several good things about this restaurant but I am torn between giving it three stars and four stars. For now I will give it three stars and then I will give it a second chance and may modify that later.", "author": "Ivory B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "I am new to San Francisco food scene and friends took me here. Service - perfection, Food great and ambiance - relaxed and comforting. Here is hoping I don't make a yelp disaster because I definitely want to come back. On the upside they accept reservations so do that. \n\nThe menu is small but gives a good sprinkle of french dishes. \n\nI had oysters to start and they offered me three kinds. They were all very good with a good dose of brine in each. My friend had some warm olives. Watch out because they are not pitted. \n\nI ordered Bone Marrow and it came with a nice bread and a Tomato Jam. I expected the Jam to have some bacon in it (now I know I'm a real American...I want bacon in everything) I ate all of it. Roasted Porchetta came out looking silky and luxurious and the Fillet Mignon to perfect temperature.\n\nThis place is great for special occasions because the staff really are attentive so you can focus on your companions rather than on the service. They have a room that seems to allow the restaurant to section off for a large group.", "author": "Marcy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Food and service are fabulous.   At a prices less than other French Restaurants in the city", "author": "Glenn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "Went there last night for dinner on a Friday night. It wasn't that busy but the food and drinks came out slowly. We felt like there was too much time in between dishes. We had to ask for bread and that still took a while. The crudo did not seem fresh as the plate and sashimi wasn't chilled. The poke and chips were a little better. The osso bucco was good but the Brussel sprout and other veggies were under cooked and under seasoned. The meat itself was tender. The New York strip was good. I expected better from a 4.5 Star yelp restaurant. The prices are fair but the portions could be a little more.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "What a fantastic hidden gem of a place! Came in for late lunch and loved it! Atmosphere is relaxing, food is gorgeous and overall great impression of service.\nDuck confit salad is great. Perfect selection of cheese and meats.", "author": "Elena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Revelry is the type cute little neighborhood restaurant that I forgot still exists in SF. We tried to make reservation for a Friday night one day in advance and most places in SF were booked up but we were able to get into Revelry. When we first arrived, it was maybe half full. After a while, the entire place filled up.\n\nThe food here is very good and priced very reasonably for SF. Portion sizes are hearty and their entrees are listed on the specials menu. The bone marrow and sweet breads were excellent. Even the salad we ordered was great and I'm not a salad eater. This is a gem and a perfect place for date night.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-14", "description": "Two of us arrived about seven minutes early for a table for four reserved a couple of months in advance for my birthday. We were told that our table wasn't ready yet, so we were offered a glass of wine for the wait. When we were handed the menus, we realized they were going to charge us for the drinks. No problem. We got a drink.\n\nTable still not ready at time of reservation. GM asked us to sit at a table by the door that was already occupied by a party. We look at him strangely. He explained we can have the whole table once they leave. We explained this is for my birthday dinner and he tells us not to worry because the food will taste the same and that he will make me me feel special. \n\nMy friends arrive and they have to sit awkwardly because there is a giant table leg that one decided to straddle while the other side saddles. I ask if we can put two two-tops together but the GM says he wants to save those for the couples. He explained that we were supposed to have a table in the back but the other table back there was a reservation for 14 that arrived with 22 people. So I guess if you roll with two dozen, they will bend over backwards to accommodate your party. We pray for our table mates to leave. After we order they do and we scoot over. \n\nThe food was good except for: 1) the beef bourguignon, which was overcooked (the reduction was reduced too much, making it salty and intense and the meat wasn't melt in your mouth but on the dry side), 2) dinner bread, which was stale and dry, 3) profiteroles, which had good flavor but was also on the stale side.\n\nWhen the dessert was brought out, they turned off the lights and sang happy birthday, which was the fourth time that happened that night. Afterwards the GM asked if I felt special. His smug condescension was so infuriating. \n\nThe bill came and nothing was comped. I wish I picked a different place for my birthday dinner.", "author": "Leah F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-25", "description": "Mushroom risotto is not rice with mushrooms. Slow service. Overpriced. Limited menu. Limited bar. Would not go back.", "author": "Smiley S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Adorable little neighborhood restaurant serving French fare. I'm a sucker for sweetbreads, steak tartare, and filet mignon. This place has all 3.\n\nVery similar to Central Parc bistro (menu, ambiance, and people!).\n\nThe Brussels sprouts Cesar salad with smoked trout is delicious. Perfectly dressed and wonderful textures and flavors.\n\nSweetbreads were good but came out lukewarm. Steak tartare was excellent. The peppercorn sauce with the filet mignon and the peppered potatoes had too much pepper flavors going on. Besides that, steak was cooked perfectly.\n\nThis is a solid little bistro that I'm sure we'll revisit soon.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "My family and I always do early dinners for special occasions. Who wants to deal with the craziness of having brunch or dinner on Father's Day?! A couple weeks ago, I had dinner with the parents in honor of Daddy's Day. I made a reservation a couple days prior through OpenTable for a party of three on Thursday, June 15th at 6:15pm.\n\n*Petit Gris Escargot in the Shell ($12)\n*Foie Gras Au Torchon: with Huckleberry Compote & Pear Gastrique ($24)\n*Daily Fresh Oysters: Kusshi, British Columbia; Kumamoto, Humbolt Bay, CA; Miyagi, Tomales Bay, CA ($17.50 for 1/2 dozen)\n*Cheese Board: Brillat Savarin, Truffle Tremor, Bay Blue, Served with Honey Comb, Fig Jam and Walnut Bread ($16 for 3 Choice Plate)\n*Charcuterie: Prosciutto, House Cured Duck Breast, Slow Roasted Porchetta, Served with House Pickled Vegetables ($16 for 3 Choice Plate)\n*Oven Roasted Bone Marrow: with Tomato Jam ($14)\n*Heirloom Tomato Salad with Watermelon, Mozzarella, Red Wine Marinated Torpedo Onions & Basil ($14.50)\n*Creme Brulee ($9.50)\n*2015 Daou, Cabernet Sauvignon, Paso Robles ($52)\n*Cappuccino ($4)\n\nI loved the charcuterie and cheese. It was hard picking only three each, but I was happy with our choices. I especially loved the bay blue cheese. So creamy and such great flavor. The bone marrow was a generous serving. Four beefy bones?! Yes please! I was the fat a$$ that ate two of them. The foie torchon had good flavor and was a decent size. I actually really wanted to have the seared foie you can add to their steak, but unfortunately, they were not serving it that day, so I was disappointed. I prefer seared foie over a torchon. The rest of the dishes were good as well. The escargot comforting with it's garlic parsley butter. Good for dipping with the complimentary bread and butter. The tomato salad was refreshing. The oysters had a nice sweetness to them. The mignonette was very tasty. The creme brulee was okay. I like my brulees firmer and this was a little too runny for me. Our red wine paired well with everything and my dad seemed to enjoy his coffee.\n\nRevelry is a small restaurant, so I'd recommend making reservations. Our waiter was sweet and attentive given he seemed to be the only one on the floor. I'm bummed I missed out on their seared foie. I may come back just for that! Plus, I think they also do happy hour oysters on the weekends? That may be a perfect meal for me. Oysters, steak, and seared foie? Yes please!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Excellent service! The food was delicious! We started with drinks and then dinner. There was wide selections of wine, and I ordered a french Bellini, it was refreshing. We then ordered baked bone marrow and paella for dinner. The bone marrow was incredibly delicious, the tomato sauce blended perfectly with the marrow, and pampered my taste buds. The paella was the best; the rice was hot and succulent, and has thoroughly absorbed the seafood juice, while the shrimp, scallop and clams on the top were very fresh. I will highly recommend this place for a fun and yummy night out!", "author": "Christina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "I am incredibly picky about restaurants because SF is so full of amazing food that I hate to waste an evening on something mediocre, and when it comes to special events I'm even pickier. So I felt stressed about having to choose a spot for my 8-person birthday dinner with parameters (neighborhood, time, availability) that forced me to choose a place I'd never been to. \n\nWalking into Revelry Bistro, I knew I'd hit the I-hope-yelp-is-right lottery. The proprietor knew it was a special event and greeted us in the most genuine, friendly way - I felt like we were having a private dinner in her home. She attended to every detail and made us feel like honored guests, even though we were first-time customers. The food was truly delicious, the decor elegant, but moreover the impeccable service made this an unforgettable evening. Will definitely be back!", "author": "Rebecca K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "We had the Heirloom Tomato and Watermelon salad, oysters, Coquilles Saint-Jacques, and the Charcuterie. All was fantastic and exquisitely prepared. The salad was very unique and fresh. The scallops were cooked just right and the accompanying risotto oh so tender, creamy, and full of flavor. The service was prompt and helpful to answer all questions.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "Everything is passable. Cut of beef could be improved. Coq Au Vin was dry/overcooked. Shockingly poor wine list. I recommend guests use Vivino before ordering. Nice neighborhood restaurant, but it's tough when you are competing with the likes of Mssr Benjamin or the prices of Chez Maman. Experience saved by super friendly owner. No need to say no to this restaurant if your friends want to go here. Just do your own wine investigation.", "author": "Pandora B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "Like a spoiled child she was upset about the upcoming detoured trip: the horror, they must fly into Paris before driving to Southern France. That's like telling someone that they have to fly to San Francisco then rent a car to drive down to L.A., what's the point of going to Hollywood when you spend all your time just to get there? Must she land in Paris first? Isn't there a direct flight that can take her to Toulouse? He tries to explain to her it's because they'd will first spend a week in Manhattan, in a hotel by Central Park west, with a possible meal at Blue Barn, only the best restaurant in America right now and that changed the flight itinerary. She finally turned her attention back to this little neighborhood bistro, let out a sigh, \"Well, at least you don't have to go to France to have a decent French meal around here.\"\n\nRevelry showed up on the San Francisco eating map not too long ago. It's a slice of France in this ever-increasingly French neighborhood of Hayes Valley. It's French inspired, according to the web page, or sometimes called New American. But it felt French at the core. If this restaurant was in France, it'll be called French and Modern European. \n\nWhat will surprise most people, however, would be the large size it tends to serve. A starter sweet bread is entirely big enough to serve as an entree or shared among two people. The salad size is big enough to serve two. Definitely go for the duck confit as it's quite similar to what you'd expect in France. Steak frites could easily be twice as large as what you'd see in France, or any number of French restaurants around the neighborhood. The owner, who hails from the Alsace region, says that this being America, one must serve American sized meal. All entirely reasonable, and makes this place stand out even more as it can easily become a repeat indulgence for it has quality food, good ambience, and a serving portion size that you rarely see these days in the city. \n\nYou really don't need to go elsewhere if you wish to get a modern European with French twist meal without breaking the bank. And if this is not all.. the owner is about to open another French place with a strong focus on Alsatian food in Mission Bay. It would not surprise anyone if you have not heard about Alsatian food. Up until now, there has not been any Alsatian restaurants in San Francisco, not even in the entire West Coast. Alsace is a region that changed hands between the French and Germans over the centuries. It combines the best elements of two cuisines and forms it's very own style over time. It's really the best of both worlds. Now San Francisco will finally get to see more of it.\n\nThe order of the universe was finally restored after this scrumptious meal.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "The food is really well cooked. The filet mignon was cooked to perfection. The cheese plate was delicious. The service was pretty great.", "author": "Penelope S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Had a very special work lunch here yesterday. Normally not open for lunch. They definitely made us feel special & food was delicious. Chef Brad & staff made it a very memorable experience.", "author": "Kathryn Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "A little unsure how this spot got such a high yelp rating... I think I'd go 3 1/2 stars rather than three but that's not an option individually... \n\nMy wife & I had dinner here on a Friday night. Mediocre melon salad. Tasty but overpriced gnocchi. Chewy and undercooked NY striploin steak (was planning to get the filet mignon I had seen from other posters but for some reason that wasn't on the menu). I had asked for medium rare and it was definitely more on the rare rare side. Could I have sent it back? Sure. Who knows what happens once a steak goes back though... we sat outside so we got a little forgotten at times. With so many options for dining in SF, I don't think I would return.", "author": "Lindsay S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Dined here on a fairly quiet Wednesday evening. Overall, must-do date place for an intimate friendly setting with superb food and service. Can't wait to come back.\n\nFood: 5 stars. We had the ceviche as pictured, the duck comfit salad and steak. All delicious. I especially loved the mix of flavors in the ceviche. I'm typically not a fan of frisee but it went paired wondefully with the duck.  My favorite was a tie  with the steak and the one cheese we shared. The steak flavors and butter sauce was delicious and cooked perfectly medium as ordered.\n\nService: 5 stars. Our server Nolan (I believe) was amazing and super friendly. He ensured we didn't order beyond our appetite and recommended one of the best cheeses I've ever had.\nAmazing!\n\nAmbiance: 5stars. I love how its small, fairly quiet and a nice intimate setting The lighting and space is perfect for an evening together or catching up on the larger table with a group of friends over some amazing wine and cheese.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Pretty good all around. French focused dishes and drinks. Most dishes were competently executed, but nothing stands out as amazing. Value is lacking.\n\nBy the numbers:\nFood 4/5\nAmbiance 5/5\nService 4/5\nValue 3/5\n\nSalmon terrine: Good\nRoasted beer salad: Ok\nTruffled cauliflower gratin: Ok\nPotato gnocchi with arugula cream, mushrooms, snap peas, and cherry tomatoes: Very good", "author": "Navi O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "One of the best dining experiences I've had in SF so far. Everything I ordered was exquisite and I ordered a LOT (18 oysters, tuna tar tar x2, scallop special, cheese plate, lots of rosé, dessert, and some other entrees I'm forgetting). For a nice sit down dinner it was probably the best food I've had in SF and probably one of the best places I've eaten at in my life.\n\nI have payed much more for mediocre food that was poorer quality at other places. This was excellent quality for the pricing, which is a bit up there but it's a place to treat yourself at, not casual dining (unless you're really swanky I guess). The service was excellent and I can't say enough about how amazing this place was!!", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Revelry Bistro is soooo AWESOME! Love the food, great atmosphere, fine service. The Chef / owner, Brad is super talented and offers some of the best food in SF. I really love this neighborhood gem. Keep up the great work!!!", "author": "c.t. d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Wife surprised me and took me here for a birthday dinner. We were both surprised to see Jerome, who used to work at Central Parc, behind the bar. Apparently the CP chef is working here. The dishes did not disappoint. Had the cheeses - creamy and delicate along with tiny chocolate bites and honeycomb. The French onion soup was good. The bone marrow was superb. The lamb shank fell off the bone and was accompanied by polenta and some veggies cooked to perfection. The foie gras was obviously good. \n\nThe service was attentive and the atmosphere was casual and warm. \n\nI have found my new go-to French restaurant in the city.", "author": "Oren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Reviewer Yi Z really hit the nail on the head with her review that \"Revelry is the type cute little neighborhood restaurant that I forgot still exists in SF.\" It was these words that prompted me to book a reservation at Revelry last week after my husband said he wanted to try something new, not obscenely expensive nor trendy, and cozy. This was the perfect choice. We were seated in a comfy corner table where we shared a padded bench and many pillows next to a fireplace. Amazing food, sane prices for SF, and excellent service makes this restaurant a win.\n\nIt was quite busy, but not too loud. The wine list is great and they excel at making recommendations to pair with your selections. We loved:\n\n-Escargot (probably one of my all time favorite foods, but theirs is delicious)\n-Endive salad (to help balance out all the butter we ate in above appetizer)\n-Charcuterie plate with house-cured duck breast (beyond good)\n-Chicken Cordon Bleu (perfectly cooked, and so comforting for a rainy day...and this coming from people who NEVER order chicken in a restaurant)\n\nThe table next to us got the truffle cauliflower gratin and it smelled divine but we were just too full. Do not miss out on this charming spot. Perfect for a date night or quality girl time. They also have an adorable long table with fresh flowers, perfect for a small group.\n\nExtra points for the lovely (and French!) staff.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-14", "description": "Brunch was very underwhelming. Arguably the least appetizing croque madame I have had. They used what looked and tasted like white Texas toast. The real concern I have with this place is that I was over charged, and fairly certain it was tip manipulation-- luckily I kept the customer receipt as proof and my bank was able to accredit me the rightful amount owed back. The only reason I give this place a 1-star is due to the duck confit salad, which was actually on point. Nonetheless, Revelry is on my \"never-to-revisit\" list mainly due to the tip manipulation, which is very disappointing.", "author": "Alex B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Restaurant is in a very quaint location and very nice setting, however, our Sunday dinner was disappointing.  Maybe it was just a bad night and we ordered the wrong dishes ... first, baguette is not crusty, with so many good breads in SF, this I can not find an excuse for. The next dish is soft shell crab BLT which was way salty.  The escargot was good but the baked oysters smelt bad, which we simply sent back.  Maybe it was bad judgement to order seafood on Sunday night ... anyway cute restaurant but not so good experience...", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "Came here for a business dinner. Food was phenomenal! Service was okay, but being with a large group it was hard to judge a more intimate dinning experience. It is a pretty small establishment. But they have a small area to the back for larger groups. We were a group of 10. I got the trout niçoise and it was exceptional! Just the right portion and I completely cleared my plate. From the first bit to the last it was exquisite. Well worth the $25 price. I'd love to come back and try another dish being a party of two.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-03", "description": "Delicious food and wonderful friendly service. \n\nWe started with the escargot - and I must say, it was one of the best in the city. They came in their shells, had a perfect chewiness with a very tasty sauce that was not overly garlicly. We dipped the yummy fresh bread (soft with a good crust!) into the sauce. We also had the ocean trout crudo which was good. The fish was very fresh, but this dish didn't stand out to me overall. \n\nNext we ordered the halibut - flaky, firm, flavorful. And the filet mignon with truffle butter...mmmmm. The big pat of truffle butter sitting atop the filet slowly melted into the steak and turned a typically tender but not flavorful cut of meat into a mouthwatering piece of heaven. Do not skip this entree!\n\nFor dessert we ordered the profiteroles - deliciously baked pastries with ice cream in between and the most amazing chocolate (Valrhona) drizzled on top. We also got their famous cookie trio: chocolate chip (again, the rich Valrhona!), snickerdoodle, and peanut butter, with Tahitian vanilla milk. They had scraped the insides of fresh vanilla beans into the milk for just a light hint of vanilla. Amazing amazing AMAZING!\n\nLove this place. It's going to become one that we frequent!", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Great food! Simply beyond expectation in such a hidden gem. We were so lucky to get a table as it is a small scale restaurant. We ordered steak and a bunch of other dishes. One of best steaks and other food are all awesome as well. Staffs were very nice. Definitely recommend it!", "author": "George T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "They deserve 5 stars\n\nEverything on the menu was delicious. Zero complaints or I think of could of been better comments all night. \n\nI'm not a wine person at all but I enjoyed the two bottles we had. \n\nTheir entree changes daily depending on what is available to them in the market. \n\nThey were able to accommodate a party of 7. Bar area seating and a back seating area. \n\nAverage cost is about 80-100 dollars per person. \n\nFYI chicken liver mousse is amazing.", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Do not let the bougie glitz of Hayes Street lure you away from this genuine bistro, on a much mellower corner just 2 blocks away, with the menu and comfort to match. The French dishes are lovingly prepared, hearty and take great advantage of SF's fresh produce and seafood. Also the food is not over-dressed or over-sauced. This is probably because the proprietors are on site and actually French. Taste. Both kinds.\n\nThe wine list is good and the service and hospitality are spectacular. Go! Dépêchez-vous!", "author": "Jed M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Me and my friends went to brunch here and had such a great experience!! I ordered the Garden Eggs Benedict and loved every bite. The environment was super relaxing and the service was so friendly. I know I'll be coming back!", "author": "Kaylin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "I was feeling good after seeing 100 reviews and a 4.5 star rating..\nMade a reservation for a birthday celebration for 2.\n6p on a Thursday, nearly empty. Not a good sign.\n\nExtremely welcoming and kind staff.\n\nWe were led to a table on the second level we both immediately smelled something bad. We went to sit down, but the smell was persistent. We agreed it smelled of bathroom.\nWe asked to sit at the bar where it didn't smell.\n\nOrdered glass of wine. Delicious and healthy pour.\n\nWhile waiting for food, noticed chef eating a French fry while plating fries. Unsanitary and unappealing.\n\nOrdered cheese plate. tasty, nice additions to the plate, especially chocolate. Someone's eyelash in the soft cheese, not a nice addition.\n\nOrdered melon salad w ham. Large portion, some tasty melon, overpowering aged ham.\n\nOrdered fresh oysters. Delicious, fresh local, great vinegar sauce and cocktail sauce. but not a clean shuck, pulled 3-4 shell bits out of my mouth while eating the 6.\n\nOrdered gnocchi: badly over salted, and we like salt.\n\nOrdered langostino risotto w clams. Tragic. Mushy langositno, mealy clams, risotto was devoid of flavor, the cheese came through, but not in a good way. The grilled mushrooms were excellent! \n\nWe were bummed.\n\nThey asked 'how was everything'? We told them most of what I just told you.\n\nThey were sad to hear it and wanted to know more. The Chef came over to inquire. They took one entree off the bill. Very sweet and kind but we'll never be back there and suggest you try elsewhere unless they address all 17 of these issues.", "author": "Dan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Had dinner at the Revelry Bistro last evening for the first time and the food was excellent, one of the best meals I have had in San Francisco, and I have lived here forty years.  I will definitely return. I loved the casual neighborhood vibe and the friendly service, but most of all the great food!", "author": "Gloria J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Wow. What a great little French restaurant on the corner spot in a nice little neighborhood in SF! We made a reservation for 5 for Friday, and I only had made the reservation on the Monday before. I tried the liver pate, Brussels sprout salad, filet mignon with foie gras on top, and the profiteroles for dinner. Overall, a great meal, although the filet could have been done better. I think I prefer an aged steak, but maybe that's not the French way. \n\nAnyways, excellent experience. I will definitely be back.", "author": "Sheewon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Really cute bistro with exceptional service and great food. It's definitely not $$$ for brunch at least. The brunch menu was pretty typical prices for SF. My eggs benedict dish was $16.\n\nI got the garden benedict with tomato jam, buttermilk biscuits, and arugula pesto. I loved this dish! The eggs were perfectly cooked over two fluffy yet crispy biscuits. The tomato jam was a great combination of sweet and tangy. The dish also came with potatoes and small salad which was a nice touch. Highly recommend trying this!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "New place in Hayes Valley. Came him for Thursday dinner. Had a good experience. Good food, good service!", "author": "Alisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Came here for brunch yesterday and wasn't as busy as expected.  We were seated promptly, but after that, service was a bit spotty with no one coming over for about 10 minutes before finally asking if we wanted anything to drink.  Not that bad, but considering the restaurant was largely empty, it was a bit surprising.  We were then asked a second time (by a different server) if we wanted to coffee a few minutes later - kinda strange. Food was good - though pretty buttery/oily (but that can be expected as it is a French Bistro).  Some of the dishes came out cold, however mine (quiche of the day) was actually quite tasty.  Anyhow, it was an OK meal though not necessarily somewhere I'd actively recommend - that said it's a convenient backup location if the restaurants on Hayes are super busy.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "Cute little place and friendly staff. \n\n1/2 dozen raw oysters-super fresh\n\nCredo-white fish with garlic, apple, and celery-light, refreshing, and tasty.\n\nGot the Charcuterie and cheese board (3 choices each)-the presentation was super pretty. Nicest meat and cheese board I've ever seen. My favorite is the speck and the truffle goat cheese. \n\nBrussels Sprout Caesar w/ smoked trout, croutons, and Parmesan-I really liked this dish, but my friends said the sprouts \n\nBone Marrow w/ tomato jam-I did not like this at all. The tomato was weird with the bone marrow. Thumbs down.\n\nGot the seafood paella-good flavor and seafood was perfect and lots of variety, but the rice was a bit under done. \n\nSeared foie gras-how can you ever go wrong with this. So delicious.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "The food and service here was beyond terrific. We had a private lunch and were treated like royalty. All the food was delicious - the portions were a bit big; but perfect. We had to be rolled out of there! Will be back and will be recommending to friends.", "author": "Kris O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Still amazing.  Get the scallop Crudo.  One of the top three dishes I've eaten in the past year.", "author": "Zac A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "The atmosphere was very nice. I suggest having a reservation. They had a decent size wine and beer menu. I had the king wild salmon, and it was beautiful and mostly importantly tasted great. I ordered a delicious wheat beer and jumbo artichoke to share. All and all, I would come back here if you want a nice dinner.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "Pretty slow service (at the bar).  We've been sitting at the bar for 20 minutes on a Saturday at 1:20pm, place is half empty. Ordered the Blood Orange Margarita which was just ok. We opted against ordering food because service is too slow. Shame. Eggs bene look delicious!", "author": "Kasandra V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "I had a very pleasant brunch here, primarily consisting of eggs benedict, but i also very much enjoyed the salad. I found the coffee overly bitter, but this is not uncommon in French restaurants. Staff was friendly and polite, allowed me enjoy a long brunch in peace. We'll be back.", "author": "Kyle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "Super cute neighborhood spot. The mushroom risotto was delicious although I thought the rice had a hard center still.\n\nThere wasn't a rush to give us our check (or to take our CCs) even once it filled up. But we weren't in a hurry, so that's just fine.\n\nI'll be frequenting!", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Lovely environment. Great food. We had the artichoke and the Brussels sprout Cesar starters. Both really good, but roasted artichokes are so messy. \nGreat wine list. And especially the champagne. We had the beef cheeks and the halibut for entrees. Both wee beautifully presented and delicious. \nA rhubarb tart wrapped up the magical meal!", "author": "Shannon K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "My mom and I stopped in here after a day of shopping for a cup of tea and a cheese plate. The owner(?)-manager, Jerome helped us by selecting three of the best cheeses we had ever tasted and also sharing some excellent advice for where to check out next. We are both planning to come back for dinner in the future, as the ambience, food, and service were all impeccable!", "author": "Kendra L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Accommodating to walk ins and welcoming to kids. We walk by this restaurant daily for over a year and finally ate here. They were so nice. The owner made our 5 year old feel so comfortable in an upscale restaurant. They made her a special dish. The food was wonderful, i think better than Monsieur Benjamin. The prices were really great too for exceptional quality of our meal and wine. Very excited to try brunch soon. This is a lovely neighborhood restaurant with amazing French cuisine. If you want to avoid the craziness of Hayes Valley walk a couple of blocks to this lovely place. You won't be sorry.", "author": "Autumn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "I've only been here once and I can already say it's one of my favorite places in San Francisco.  The vibe is so warm, friendly and welcoming.  The staff are attentive, engaging, and invested in making sure you have a great experience.  I almost don't want to write this review so I can keep this lovely restaurant a secret.\n\nMy husband and I sat at the bar and noticed a stellar wine list and very respectable beer selection.  We wanted to try everything on the menu but settled on baked Camembert and oysters to start, and for our meal I got gnocchi and the husband got a filet.  Everything was just so perfect.  I never thought I would taste gnocchi that amazing in a French restaurant.  For dessert we had some cookies and profiteroles.  Again, truly outstanding on all courses.\n\nThe manager let us know that the menu changes very frequently and though thy have some staples, other dishes will rotate in and out.  I'm excited to go back and try more food!!", "author": "Robyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "A group of six of us had dinner here before the xx show at Civic Center, so venue picked because of proximity, plus I had passed by several times and it looked attractive.  Our group got there in bits and pieces, but we were starving so they let us order a bottle of champagne and appetizers and seated us before everyone got there, which I appreciate!  We got a bottle of sparkling rosé, and a board of three cheeses and three charcuterie plus some ceviche to start.  Our server was very helpful and friendly and clearly did not mind out group coming in parts and ordering haphazardly.   The rosé was good, although one of the group said it was too sweet...however we ordered a second bottle and she had another glass, so there.  The cheese and charcuterie was awesome!  It's such a standard usually, but this came with two kinds of warm toasted bread, nuts, dried fruit, mustards, chocolate and honey!  And the cheese and charcuterie was delicious, and at first glance tiny, but it was all so rich and filling.  The ceviche also bright and limey, if also very tiny.  We split a beet salad, the mushroom risotto and the salmon with pea purée and asparagus.  It was all very good, though the risotto was a bit thick and set by the time it got down the table to me.  Six people, four appetizers, two entree and two bottles of champagne ended up being about $55/each w tax and tip.  We weren't stuffed, but comfortably full of delicious tidbits.  I'd like to come back and bring just the boyfriend and have a long romantic dinner here.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Excellent food and friendly service! Delicious foie, big, tasty salads (we had the duck confit salad and the Brussels Sprouts Caesar), and perfectly cooked sea scallops over risotto with a rich and satisfying sauce. Profiteroles rocked for dessert. We will be back for sure!", "author": "Dave N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "Having lived in San Francisco for over 10 years and gone to many of the good and great French restaurants like La Folie or Monsieur Benjamin in the city, I was greatly impressed with Revelry Bistro. There were three of us on a Saturday night, without reservations but they kindly squeezed us in at the spacious three-place bar by the window.  We felt like personal guests of the host but of course we had just met! \n\nThe food: Fantastic! One of the best Filet Mignon's I've ever had - perfectly seasoned and prepared. Their main course menu changes every week but I was told this is so popular it is always offered. One of our party was a wine aficionado and was also very happy with the great selection of French, Spanish and local wines. \n\nCrabcake appetizer - amazing! \n\nDessert: Pecan tart - it reminded me of the cakes and tarts my wife and I had at an incredible patisserie we visited in Lyon, France. Just a perfect balance of buttery and sweet. \n\nReally an incredible find!", "author": "Tim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Nearly perfect place! Real bistro hours! We came by at 4 on a Sunday & dinner was being served. Yey!\nWe wanted to order several bistro-sized items. Oysters are both baked & raw & you can order them individually which is great & true French style. Unfortunately the baked oysters, although done in Rockefeller-style our favorite, tasted too fishy. The fresh ones were better.\nIf they offered a smaller pasta portion as an option,  Revelry would earn 5+++ stars. They could take a lesson from Anchor Oyster Bar which allows a smaller portion for pasta even though it's not on the menu. We noticed the server allowed the person next to us to order fries--also not on the menu--so if the staff here were smarter,  the server + chef would have allowed my friend to order a small pasta & made more $. \nGreat wine selection, great homemade pate, cool space. Hope they survive.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "This was one of the best meals I've had in a long time in the cutest little bistro, hidden away in San Francisco. It's a bit off the beaten path, which is nice because we were able to get a table for 3 right away on a Friday night. \n\nEverything was 5/5. Ambiance, service, food (both presentation and taste). \n\nWe all shared the hamachi crudo special, the duck confit salad, the halibut entree, and the filet mignon special (with truffle butter and foie gras), and no charge for splitting entrees which is awesome, since we all wanted to try everything.\n\nWe raved about the food to the waitress and they actually brought out free dessert for us -- completely unnecessary but another example of how great the service is. \n\nThis place just opened about 7 months ago, and I'm glad it did... We'll definitely be back regularly!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "I am actually afraid to Yelp Revelry Bistro because right now, it's still easy enough to get in for dinner, as it's still flying low under the radar. Its location in the former Samovar Tea Lounge on a route I generally associate with getting on Hwy 101 is fairly random - and that's a good thing! Because otherwise, this place would be overrun.\n\nIf you like a low-key and comfortable atmosphere focused on great food and unpretentious presentation, Revelry Cafe may just be your dream come true. The first time I came here, I had dinner with girlfriends in the most comfortable corner booth in the restaurant's front dining room. Everything was insanely delicious - and the trio of cookies was so good that I begged the waiter (whom I'm pretty sure holds some other noteworthy position at the restaurant) to bring another order that consisted solely of the most amazing chocolate chip cookies, which he did. Bless him.\n\nThe second time I dined here, my husband and I went with another couple. We sat in the elevated dining room in a cozy space I didn't enjoy as much as the booth, but the food was no less worthy. Again, the service was outstanding: warm and friendly without being overindulgent.\n\nNext time you're looking for a great place for dinner, and you're tired of trying to score a reservation at one of the usual overplayed spots in the city, give Revelry Cafe a try. It won't disappoint!", "author": "Kiesha R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Excellent service, excellent food, and excellent ambiance! Very charming neighborhood spot in Hayes Valley!", "author": "Talya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "Here's the tl;DR: FINALLY AN UNPRETENTIOUS PLACE TO EAT LEGIT FRENCH FOOD IN SF!\n\nThis place is awesome. They focus on the food and it shows. Crusty bread and butter. Radishes and butter. The fresh albacore tuna Crudo starter was delicious and well plated. Cauliflower gratin comforted us on our way to our mains.\n\nWe really appreciated the reasonable portion sizes. You just don't need the heaping mounds.\n\nThe profiteroles were just great and again, really loved that there weren't 8 of them. 3 of them in a row, well plated with mint.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Nice big sign on the corner of Page and Laguna! (hey, sometimes it is hard to find the name of the place in a not so busy street) Celebrated friend's bday here last night, with a party of 10. Arrived at 6pm and place was fairly busy. We sat at the bar till the rest of the group showed up. Clean bar and restroom! Our table was nicely set up in the back room (love the tulips) which was great because we were loud =) Our server was attentive with our orders and filling up our water glasses. Even when we request to return three entrees because the meat were overcooked, she was still very calm and helpful. We ordered two of each of the appetizers: bone marrow(lack bit of salt), escargot, foie gras, gem salad, creamy cauliflowers, 5 choice charcuterie platter and scallops. She also gave us a free duck confit salad. Most of us ordered either the filet mignon(adding more foie gras) or the baked half crab. Gave the bday boy a piece of yummy chocolate cake and sang a nice birthday song together. Wonderful experience!", "author": "Vee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "This place is a superb family style bistro! The food is excellent ! The atmosphere is romantic. And the service is top notch. I have eating here twice and loved both times. The steak with froie gras is unbelievable! The seafood is very delicious and oysters in the half are chilled and love to slide down my gullet! Gulp!!!\nI shall return!!", "author": "Ethan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "This is one of my favorite restaurants in SF!  Wonderful, accommodating and always one of the the most delicious restaurants in the city.   I have been here half a dizen times for anniversary's, birthdays, holiday parties and will always recommend for others.  Don't think about it and just come here!  P.S. the Crudo is just WOW", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "A very cute little bistro with large windows that let in plenty of light and ceiling fans that keep the air moving.  Very good and caring service up front and a chef in the back who knows what he is doing.\n\nDuck confit salad with arugula, spiced pecans, and poached pear was a delight.  You see, there was plenty of lean tasty duck and all of the other components of the salad were fresh and vibrant. \n\nGnocchi in a green arugula sauce with wild mushrooms and peas was my second course.  The portion was immense, the gnocchi chewy, the peas and mushrooms tasty, and the sauce verged on overpowering the mushrooms but managed not to.   I liked this almost as much as the salad. \n\nMy only suggestion to the restaurant would be to post at least a few of the main courses on their menu on-line to give a hint to potential diners of what Revelry has to offer.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Came here last night for a client dinner with a large group of 16. They had originally asked to go to The French Laundry but budget-wise that wasn't going to be an option, so the pressure was on to have a memorable meal ;)\n\nArrived early to talk to Jerome about menu and wine selections, and he was tres gentil, helping us taste a few wines and choose appetizers and salads for the group to share. When the group arrived, we were seated in our own room upstairs. Here were the highlights: \n\nAPPETIZERS: Had the oysters, bone marrow, cheese & charcuterie board and two different salads. Everybody loved the oysters, which were small but really rich and the salads, especially the special heirloom tomato with mozzarella\n\nENTREES: There were 4 entrees to choose from -- filet mignon, trout, braised beef cheeks and vegetarian risotto. All of the dishes were beautifully plated and cooked to perfection. \n\nDESSERTS: Incredible end to an already great dinner.... We had the profiteroles, clafoutine and creme brulee. \n\nWINE: Loved the sparkling rose \"cremant d'alsace\" and the Cotes du Rhone Jerome recommended was a hit... He couldn't keep them coming fast enough for the group, which maybe to the chagrin of the other patrons got them more boisterous as the evening progressed. \n\nAll in all, my expectations were exceeded with Revelry. Several clients asked how I'd learned about the place and raved about it, so I'd consider that success! \n\nMerci beaucoup, Jerome et tout le monde a Revelry Bistro pour une soiree memorable et delicieuse!", "author": "Kristen N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "A perfect meal.  A revelation in gnocchi.  I try it lots of places, but this was beyond any previous best.  A lot. More textured gnocchi, a bright green creamy arugula sauce with wild mushrooms... intense flavor.  We all went WOW. The service was impeccable (and we got a lovely visit from the chef), the filet mignon  of my companion was perfect. Foie gras!  Every other dish looked beautiful.  \n\nParking is so much better than Hayes St a couple blocks away. We ate early, and it got crowded as we left -- it's definitely getting discovered and deservedly so. 6 thumbs up from 3 diners.", "author": "Catherine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "We just had the most wonderful dinner! Everything was delicious and we feel like we discovered a hidden gem in your own neighborhood. I'm going to be back for sure. The food was so good, we only thought about taking a picture when all was gone!", "author": "Helena G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "This place is amazing! I had risotto with scallops and lobster sauce. Service was impeccable. We celebrated a birthday and everything was perfect. I will definitely go back. Great value for the money as well.", "author": "Claudia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "We just spent a week in San Fran, and this was my best place... if you want fine food! This place was amazing! Everything was superb!!! Foie gras with truffle melts in your mouth! To die for! Also, crispy sweet bread! Oo my, the best I had anywhere! Bone marrow was fresh and delicious, also we had scallop ceviche! The freshest scallop ever! I'm driving home from\nThe airport and wish I lived in San Fran! I already miss French revelry!! Will definitely come back next year!", "author": "Cat L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Very good service and food. We had the salmon and filet mignon. Salmon was crispy and flaky. Filet mignon was very tender. Delicious! \nDessert special was very good too. I don't remember what it was called. It was like an ice cream with pistachio and dried fruit. \nWarm and calm atmosphere with French music playing in the background. \nDefinitely will come back here again!", "author": "Peony C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Literally top class fare. 10/10 will be back. The service with fantastic, the wine pairing was , and the food literally was without friction. Melted right there on your tongue with a corresponding burst of flavor. Picture perfect, excellent portion sizes, I can't say enough about this place!", "author": "Nigel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "I live in the area and have been here a few times for brunch and dinner. It's a cute French restaurant, which serves very good food.\n\nFor brunch, you can't go wrong with any of the eggs or the steak. For dinner, check out their specials since those are usually amazing, but also get some foie gras.\n\nThis place is a bit pricey compared to chez maman, but also more intimate.", "author": "Tanay J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-06", "description": "I think the food here is not bad. I would have given them four stars for food. It was the service which was very disappointing. After we sat down, it wasn't until 15-20 mins before someone came to take our order for drinks. We ordered our food and a bottle of wine. However, they forgot about the wine. We finished our appetizers and there was no wine. Even after reminding them about the wine, it wasn't until 10 mins that the person who took our order of wine came back, to ask again what wine did we order. No apologies. Water wasn't refilled after the first serving. All in all pretty lame service. The escargot we ordered were kind of bland. The salmon was good though.", "author": "Chet L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Paris experience in the heart of San Francisco!\nEVERY one of the dishes was simply superb - a hot asparagus soup where the freshness was well present in every sip and counter balances with perfect match of spices and crispy almonds. The three salads, endive, duck and the Brussels sprout with smoked salmon were a celebration of well orchestrated combinations. The sea bass special for main course just notched, cooked to perfection. The tartetatin was heavenly and perfectly paired with European style macchiato.\nService was attentive and you could tell everyone really cared.\nWe'll be back! Merci!", "author": "Udi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Had great Valentine's Day dinner here. Nice and comfortable environment. Food was great, got recommended good wine with them.", "author": "Cece Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Came here for dinner with a group of friends. Had the best filet ever, cooked to perfection. Tried a bite of salad (the ceasar) which was also quite good and had a nice unique twist on the traditional as well as the scallop ceviche. There was this delicious apple dessert that was a special that the waiter brought out to us- from the single bite my partner allowed me to have before devouring it, it was tasty. Lots on the menu I look forward to trying and I will definitely be back when I'm in the mood for steak again.", "author": "Debra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "We came here after seeing a play at the Orpheum and we loved how charming it is! The food was delicious and Jerome made very good wine recommendations. We started with the cheese and bread board, yummy.\nWe had the napoleon veggie dish, heirloom tomato salad and fish. All were wonderful and we will definitely be back.", "author": "Anna E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "The food at Revelry Bistro is spectacular. The ocean trout crudo, tuna tartar and endive salad are absolutely AMAZING. Everything is cooked perfectly and the menu is constantly adding new amazing dishes.  The service is great and the chef is so friendly. Definitely our go to Bistro!", "author": "annette s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Came here for brunch. The business is clean, service is attentive, and the food is fresh and tasty. The wine list was also impressive and was very France-focused. Would love to return for dinner.", "author": "Patrick Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "I absolutely love this place. Escargot was good, Duck confit salad was on point. Oysters were really fresh. Beef tartar was a bit dry, so i prob won't be ordering that next time, but other dishes were pretty good. Food wise, i would've given 4 stars, but the absolutely amazing service from Jerome completed five star experience here. If you love french cuisine and would like to enjoy it in casual setting, revelry bistro is place to go. It used to be Plouf in Fidi for me, but from now on it'll be Revelry.", "author": "Sm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "I love this place. It's in my neighborhood, and has become a huge favorite for my husband and me. \n\nThe food varies, but always spans a fantastic spectrum between heavier fare (beef bourguignon, pesto/pea pasta, steak) and lighter (crudo/carpaccio/ceviche, the best simple green salad, and the most incredible cheese plate I've ever had). \n\nJerome is the loveliest. We usually sit at the bar and chat with him and Silvana.\n\n5 stars for sure, I just wish they didn't have to close ever, because I really wanted to go here last night :)", "author": "Mimi M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-30", "description": "Not the best place for vegan diners, but vegetarians might fare better. \n\nI called ahead to check for vegan options and they said they would be able to accommodate. \nFastforward to the dinner and the owner recommends the tomato salad minus the cheese.  I explicitly asked if this would be sufficient as a meal and was assured by the server that it was. The plate comes out with about 4-6 slices of stacked tomato slices drizzled with balsamic vinaigrette dressing, sufficiently satisfying for no one as an entree.  \n\nWould have appreciated honesty on the phone (especially when I did my due diligence by contacting the restaurant ahead of time) vs. the service I received, trying to please every customer when your menu obviously has limitations.", "author": "Donna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "We had a very laissez-faire experience at Revelry last night. We were disappointed the risotto wasn't on the menu and none of the entrees look particularly tempting, so we opted for a bunch of bites and starters. \n- Tuna ceviche: Very tasty, I loved the bits of chili that really brought on the heat. We didn't actually order this, we ordered the poke and apparently the chef made the ceviche by mistake so he gave it to us anyway! We were confused at first but of course it was welcomed.\n- Albacore tuna poke: There wasn't a whole lot of flavour, the quail egg was an interesting touch and the avocado was pretty hard/unripe. It was more like a tuna tartare.\n- 3-cheese board: Beautiful presentation and gorgeous bread. Can't complain with good portions of quality cheese.\n- Roasted bone marrow: Probably overcooked as it was dried out and there was very little actual bone marrow. There was barely enough for one piece of bread.\n- Crispy sweetbreads: One of the better sweetbread dishes I've had in SF. Large pieces in a lovely sauce with sautéed mushrooms.\n- Potato au gratin: Extremely cheesy and creamy, too bad the bigger potato slices were slightly underdone and were a bit crunchy in the center. Since we were getting pretty full (thanks to the extra ceviche and generous amounts of bread) we didn't bother sending it back, but they compted it for us anyway.\nWine selection was good too with a bit of something for everyone. Revelry is quite the charming neighbourhood restaurant, all the other diners seemed to know the hosts and chef so it was a very nice, friendly atmosphere to be in.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "A real SF neighborhood French bistro , price is reasonable ,  service is good , nice ambiance , all dishes ordered met or exceeded exceptions - really liked this place , when the parents visit from out of town it is going to be La Folie or Gary Danko ( SF white glove action) but with local SF area friends, who don't need the glove action as much as good food / good place - going back to Revelry !", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "We had a great Sunday brunch at Revelry Bistro: the Eggs Benedict was amazing and French Toast was like dessert.  The service was friendly and smooth.  The dining room is small so make a reservation, but it is worth it.", "author": "Dean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "Off day. Wasn't impressed. Foie gras appetizer leaves you wanting. Flavor not present. Steak flavorless .. meat soft but truffle butter leaves you wanting as well. Disappointed.", "author": "Koalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Loved this neighborhood find. Intimate setting. Lovely service. Great wine options. Tasty French inspired food. We loved the sole, pasta and paella. Trout salad mot to be missed!", "author": "amy l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "We had a big party, and the staff was super accommodating and helpful in giving appetizer recommendations. We started with the cheese board, and the truffle tremor was heavenly. Unfortunately, the rest of the meal was disappointing--paella had no flavor at all.", "author": "Benjamin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "We love this place for their oyster happy hour. $2 for excellent fresh oysters, great patio seating, and friendly service from Drake. We'll keep coming back!", "author": "Justin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "This place is a gem! Quiet, intimate, romantic, and delicious! Everything was so fresh. We needed a place open late for dinner on a Thursday night and stumbled upon this bistro. It is the perfect place for a date night. \n\nThe bone marrow was cooked perfectly. The mushroom risotto was bursting with flavor. My tomato salad was beautiful and delicious. This is going into our date night rotation. \n\nAlso, I hear they do brunch now so we'll be back to check that out. More to come...", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Just threw hubby his surprise birthday party in Revelry's private room. Not only did Jerome, the owner, help me plan this down to the wire, but the food was outstanding. My group of 18 guests, who are foodie professionals and quite picky, all enjoyed the exquisite French fare. This is an authentic farm-to-fork restaurant where the executive chefs lovingly curate the superb ingredients at local farmers' markets. We ordered a variety of duplicates: one of each salad (endive, duck confit, beets, Brussels sprouts), steak and eggs: medium rare, croque-monsieur, eggs Benedict, smoked salmon Benedict, the garden Benedict, Banana Fosters French Toasts, and sets of the 3-choice charcuterie (we selected salami, prosciutto, and speck). Our faves? Hands-down, the steak was divinely cooked and seasoned to perfection. The smoked salmon eggs Benedict were soft, palatable, and creamy. The Bananas Fosters French Toast had this delectable caramel sauce that was pure addiction. The Brussels spouts Cesar salad was gone by the time I turned around, and after we ordered another, poof! Clearly, a hit. Claudia and Chris served us with warm hospitality. We even had 4 kids in the group, and they had the high chairs and well thought-out seating arrangement all ready when our guests arrived. This was a birthday brunch, but I've been here for a birthday dinner as well, and their food is simply outstanding. If you're looking for something intimate and accommodating for all age groups, with delectable French food, check this place out!", "author": "T H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "If you have come to live in San Francisco in, say, the last decade, and have been seeking the spirit of Bon vivant, pauvre-gentile, bohemian, auld City, come to Page Street to find it. \n\nJerome will greet  you at the door, seat you in one of Revelry Bistro's cozy tables, and fold you into what San Francisco is.\n\nGo ahead, order any bottle of wine in the list. They are all excellent.  Do err on the side of France - pay particular attention to the Loire, Provence, Bourgogne.\n\nFresh, select, unfussy food.  The menu is tightly constructed, no missteps.  Indecisive? Ask Jerome and he will guide you with care and genuine interest.\n\nDo have a few courses. Linger.  Remember why it's good to be alive...why it is, indeed, so good to be alive.", "author": "Patricia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "Oh man this place is delicious! Got a cheese plate, the couscous, the halibut, and the profiteroles for dessert. A bit pricey, but perfect for a special occasion. Best halibut I've ever had. To die for.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "I went here for my birthday with a group of 12 people. They have a great table/area for bigger groups. \n\nPros\nLocation, accommodating, atmosphere (at least at the group table) and food. \n\nThe food was good but not amazing. I'd certainly eat there again after they've had time to fix the cons below.\n\nCons\nMy party arrived within 5 minutes of our reservation time and though we were immediately seated it was over 40 minutes (I checked) before we could even put a drink order in. They need additional wait staff badly. We kept asking the water guy to get the waitress for us but he just helplessly shrugged and continued to fill our water several times before she came over. We even had to ask for menus twice. Not the best vibe for starting a birthday celebration at all. \n\nThe food came our pretty slowly as well. I would have given this place 3 stars if they weren't new. I think they'll work out their wait staff issues and end up being a solid neighborhood spot. I recommend going with just a couple of people rather than a large group - at least for the next couple of months while they work out the kinks.", "author": "Amber F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "What a lovely hidden gem in the Hayes neighborhood - just opened in March.  The owners are a wonderful couple and the manager has a gorgeous authentic French accent!  Great wine selection and impressive menu that changes daily.  Great for small groups, client dinners and date nite!  Highly recommend!", "author": "Carmelita B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "I had a great meal here! We got the crudo and foie gras - both amazing! I had the trout niçoise, which was great and my boyfriend thoroughly enjoyed his filet mignon! Wanted to order almost everything on the menu. The service was also amazing. Will be back! \n\nI also plan to return to check out the happy hour with $1 oysters. :-)", "author": "Camilla F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Garden Benedict was great!  Good service.  Nice, relaxed atmosphere.  Not a huge wait, which is rare in this hood", "author": "Andrew O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-04", "description": "I would say half of our dishes were just ok. The other half were total fails. For example the creme brûlée was not only broken, the ramekin was too shallow which made the creme very warm. We didn't even finish it which is unheard of. The naked oysters were also too soggy. No Crispy crust. Which might be due to the fact  Two courses were certainly sitting and waiting to long because the food was luke warm or weepy. And the lobster bisque, aka lobster water was below warm, almost cold, not creamy at all and was flavorless. The worst part was our waiters attitude. He talked down to us several times and through out the whole meal giving people the wrong dish. He spent more time chatting to friends at the bar than serving. \n\nThe image of their food is greatly misleading on their website. Named the size of their portions or dishes. Plan to leave hungry. We ordered the steak dish and I only got 4 asparagus stems and I think 5-6 potatoes. Hidden under a small cut of meat. Meat was cooked perfectly but when you run out of side before your meat. Then something is wrong. Also the little gem salad is grilled. Or at least mine was which was not mentioned on the menu. The heat from the lettuce was cooking the salad dressing which I think was Caesar. Don't know never mentioned in menu and even when I asked the waiter he ignored my question and walked away. \n\nA friend recommended the radishes and don't get me wrong I love fresh veggies. But cleaned radishes sprinkled with sea salt does not make a dish. Oh and the asparagus was so over cooked the tips were shriveled up shrubs. I recommend walking down the street to Absinthe or Frances for a more dependable meal. And nicer service.", "author": "brian k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Came here to celebrate my birthday with my cousins. We were a party of 6 and Jerome was our server. We tried the Escargot, Foie Gras, Charcuterie plate with Brie, and the cauliflower gratin, which were all exceptional, especially the Foie gras. My mouth is watering just thinking about it! We also had the Bone Marrow and Oysters, which were decent, but I'd order more of the the Foie Gras and Escargot next time instead. \n\nFor dinner, we tried the Filet Mignon, Duck confit salad, and Beef Bourguignon, and they were also all exceptional as well. We tried a few desserts, which were quite good as well.\n\nOn top of the exceptional food, the service was amazing as well. Our server Jerome was knowledgeable and helpful, and his recommendation for wine pairings were on point! \n\nAll in all, the food was great, the service was great, and the place was great! I'd definitely come back here again. \n\nThank You guys for making my Birthday celebration a special one!\n\nP.S. Make sure you arrive 10-15 minutes earlier since parking around the area is scarce, at least on weekends. \n\nI", "author": "B I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "Amazingly beautiful food, like eating art.  stopped in for a light bite, had the cheese board and marinated olives...lovely.  gracious service from beautiful Silvana...we'll be back for dinner.", "author": "Joan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Love the food - heirloom tomato salad was really good and so was the salmon.  High quality ingredients and well prepared by the chef!  Really good stuff.  Service was inadequate.  The waiter was overwhelmed, staffing level seemed light.  Took forever to get basics and there was some miscommunication.  One of the partners had to step in.  Irregardless, we would go back for the food.", "author": "Glenn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-01", "description": "Short version: Absolutely awesome. \n\nLonger version:\nCame here for one of the opening nights. We had a number of the smaller dishes including oysters, shrimp, charcuterie, the wedge salad with blue cheese and candied bacon and a cheese plate. For desert we had the creme brûlée. Everything was incredible and I can't wait to have dinner here again.", "author": "Napalm M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-17", "description": "Ok, not great. Had the trout salad which barely had any trout. But fresh and tasty brussel sprout salad. Service was ok. A little overpriced. Great biscuit.", "author": "Nancy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "I am happy this place opened. I always loved this spot, and went when it was a tea lounge, so I was sad to see that go. But I am happy Revelry  took over. I love the intimate feel, without being stuffy or feeling crowded. I tried the cheese and meats plates and I could have stopped there, and been happy,  as they were all so freaking good.\nBut... Snails!! I LOVE snails, and these were great. My friend had the meat in a flaky pastry and I tried some of that and really wanted more, so I will order it next time. I like how you can do a full meal, or just grab a plate of yummy meats and a beer and chill out and people watch. Great addition to the neighborhood!", "author": "Jo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "Brunch with the family.  Great service, food and Sunday Bev's. Clean and a nice touch w Easter eggs hidden in the bench seats.  Beets salad awesome!", "author": "Bill B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "Went here for brunch and was so disappointed. They were out of granola and yogurt, which I find unacceptable as we were there just as the restaurant opened. The french toast, nearly $20, was ONE slice of french toast. The tomato jam was far too sweet. The water smelled funny. The eggs of the day were watery and much too salty. The waiter gave us major attitude about asking for diet coke.", "author": "Lady B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-11", "description": "Our party of 8 dined at Revelry tonight before the symphony concert and had a fabulous meal. Overall impression: authentic French bistro fare in a cozy, casual environment. \n\nWe had some amazing starters: \n \n- very fresh salad with melon, cheese, almonds, a light and delicate dressing\n- an extraordinary cheese plate \n- flavorful sweet breads \n- lobster bisque - a must \n\nIt's easy for restaurants to hit the right notes with the starters but the true test of a chef's mettle is the protein course. We all had either filet mignon or sole meuniere and all 8 of us were thrilled with our entrees. The beef was melt-in-your-mouth tender, the sole was perfectly crisp/lightly salted on the outside and tender inside, with a delish buttery caper sauce. Service was gracious, warm, welcoming. We'll be back!!", "author": "SfMom O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Just finished an Easter brunch as this new find, for me.  Years ago I lived across the street and fondly recall the excellent food I got there when it was Green Gulch Grocery.  Today, it is this amazing French bistro with outstanding service and food.  My party of three tried different dishes wand we happy with all of then.  My French toast was outstanding.  The warm bananas served along with fresh fruit  as inspiring.  Loved the unflavored whipped cream.  The Croque Monsieur was well done with shaved ham slices and fried potatoes.  One guest enjoyed the Garden Benedict, with fresh pesto and wonderfully poached eggs.  Will definitely try the place for dinner.  My sole complaint was the choice of music.  Something much softer would have been appreciated, either classical jazz or classical while eating such outstanding food.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "This is a cozy little restaurant I found while wandering around. It seems to get busy, so reservations are in order if you want a table. Was on my own, so was able to grab a seat at the bar. I had the bone marrow appetizer and the filet mignon. Both were excellent. If you're looking for a good date night spot or dinner with friends (or just feel like treating yourself), this place will do the trick nicely.", "author": "Cori D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "Went for Saturday brunch with my daughters and husbands, one was visiting from out of town. Had a 1:00 reservation. Had been told it would take a few minutes to be seated. Meanwhile we're looking at an empty table upstairs (maybe was reserved?). About 20 minutes later, that's where we were seated??  \n\nAfter being seated, we were immediately given menus and a beverage list. Soon after our server came back to get our beverage order. Then, nothing for about 20-25 minutes. Really tested our patience, thought of walking out.  Finally came to take our order. Then about another 25-30 minutes before getting our order. \n\nAfter asking for the bill, it was delivered fairly shortly. Then, nothing. After about 15 minutes, we got up, walked out and paid at the register. \n\nI will say, the food was delicious, cod, oysters, Pan Bangnat. We were on a bit of a time schedule. Don't know if the time and lack of service was worth it.", "author": "Debra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "It's a pleasure to write this review as it was a pleasure to wonder upon a gem like Revelry.  The chef-owner came around to check on how I liked my meal, the bartenders and wait staff were warm and friendly - it felt like I wandered into a  large happy family gathering and instantly felt welcome.\n\nAs for the food, &*%#!  so good!  i started with the happy hour oysters which totally hit the spot and gently primed my pallet for the taste adventure that was to come.  \n\nmy smoked trout brussel sprout salad with just absolutely perfectly creamy caesar salad dressing, and shaved cheese - served on leaves of butter lettuce - was simple yet delicious.  The fresh as can be thin sliver-cut brussel sprouts provided a contrasting crunch and a bright green flavor for the salty creamy fishiness of the dressing and the trout smokiness mingled with all the other flavors.  The result was multilayered and resonant, this is the kind of thing that makes me feel very grateful, inspired. \n\nCan't wait to try the other things - I hear the squid salad is a religious experience.\n\nFYI - They have a beautiful room in the back that hosts 25 people dinner parties.", "author": "tatiana k."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-14", "description": "Accommodating, I had arranged a birthday candle for my husband's birthday and they accommodated at well, the whole restaurant saying happy birthday for him. Food is good. Thank you.", "author": "Dibina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Perfect place for our Sunday Brunch! Exquisite food and terrific service. All 4 of us had something different and we all thoroughly enjoyed our dishes.", "author": "Jayne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "We recently returned for our second visit to Revelry Bistro.   Our first experience was so good we couldn't wait to return.   At the first visit, we shared a salmon is puff pastry that was simple yet elegant.  The owner, Jerome, when we asked for the recipe, didn't hesitate to offer it.  We've prepared it three times at home to much acclaim (and enjoyment).    This visit my partner had a very nice salmon and I had boeuf bourguignon.   Both were excellent and hit the spot.   We shared a wonderful pinot noir that we brought.  Jerome was nice enough to comp us the corkage fee.    The place is small with an intimate feel.   With the high ceilings, it was easy to hear even though the restaurant was full.   Can't wait to return.", "author": "Malcolm J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "The perfect combination of great food, service, and atmosphere at a reasonable price. As an example, not many places use filet mignon for their beef tartar. WIll definitely come back!", "author": "Peter J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "My Go-To place for an early dinner or weekend brunch! I would give them my 3Gs rating - Great food, Great Vino, Great Service! And not to mention great atmosphere - casual, relaxed and always bustling. The oysters and marrow are MUST haves. I've had marrow in many restaurants around the world and Revelry has one of the best!", "author": "Keith L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "I fell in love with this space when it was a tea house, and, though we were a little put off by the look of the new sign out front, my tea friend and I finally decided to try Revelry Bistro for dinner.  We were both blown away by the delectable, but not fussy, food and still-wonderful vibe. On that basis, I chose Revelry as the venue for a brunch I hosted last weekend to celebrate my City Hall wedding a few days before.  I reserved the entire upper space, toward the back of the restaurant, for our party of 18. (I was rightly admonished that it gets pretty crowded at 22.) The Revelry folks were absolutely wonderful from start to finish: really nice and easygoing, but utterly professional. After a few email exchanges about basic parameters with Brad, the chef, and Jerome, the maitre d', I decided to have parts of the meal served family style.  At that point, Jerome asked me to come down so we could discuss menu and logistics. He spent a good hour with me one afternoon about five days before the party, liberally popping the corks on expensive champagne bottles for me to sample so I could choose what to pour for my guests.  Then we chose a menu: a few appetizers (cheeses, olives, radishes); three different salads; and five different entree options. I also wanted my guests to be able to order any kind of coffee drinks they wanted, and wine, beer, and other non-champagne drinks, and that I would bring cake for dessert. My favorite moment of the meeting was when Jerome looked at me soberly and said, \"This is going to be your day, and I want you to have a wonderful party, but we will need the space back to prepare for other guests.  So you have to make sure everyone is out of there by . . . 4 pm.\"  (The brunch was starting at 11!) I told him that would not be a problem. He took copious notes, and emailed me later that evening to confirm everything we had decided, including the title of the event, to appear at the top of the little menu cards he would have printed specifically for the brunch. The party itself was just plain glorious. I showed up early to bring the cakes and lay down name cards.  The lovely wooden table was set beautifully, bistro style, little jars of fresh flowers down the middle, no table cloth.  Champagne was chilling in buckets of ice, flutes beautifully set out waiting to be filled. I'd asked for food to be served about 45 minutes after everyone arrived to allow time for our guests to mingle and nibble and sip.  We had a dedicated server, the wonderful Kat, who took care of every little thing, pouring champagne, bringing coffee, whisking away empty glasses. The food (brussels sprouts, duck confit, a few kinds of eggs benedict, steak and frites, a tuna sandwich) was delicious. Damn, I'm wishing I were back there right now. One of my guests, a real foodie, noted how Brad brought out super flavors without leaning on the butter and salt, like many French-style chefs do. And the service was fabulous--very warm and light-hearted, attentive, but not intrusive, not fussy.  This was truly one of the nicest parties I've ever thrown. And I was amazed to find when we  finally left, that it WAS after 3. If I could give six stars I would. I can't wait to go back to Revelry.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-28", "description": "Wonderful place.  FIVE tables in main dining room.  Small plates win the day.  More promise than performance in main dishes the night I went.  But I'll be back!", "author": "John M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-19", "description": "Food was OK.  Good but not great.  Salmon was undercooked, and the sauce was heavy.  \n\nService was poor.  The waiter interrupted our conversation repeatedly and intentionally.  He seemed annoyed we were there.  Hurried us along as soon as we were done.  \n\nI live right next door to this restaurant and wouldn't come back.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "Incredible little European gem, epic neighborhood charm and hospitality. Crudo and oysters fresh and perfect, I've had the gnocchi twice, sweetie loved every bite of his boeuf. Wine pairing lovely, gracious with tasting before buying a glass. A new favorite!!", "author": "Spunky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Great food and great service. It was a bit empty when we went in on a Friday night but it was also raining which could have been why. It's also BYOB with a corkage fee which is great. Highly recommend.", "author": "Danielle P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Amazing food and service! I always have oysters! They super fresh and delicious! I also recommend the Filet Mignon Rossini with Foie Grass and top with fresh Truffles from Burgundy!  Tre bon!", "author": "Tatiana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Wonderful ambience and excellent food.  When you walk in it feels like returning to your favorite restaurant, warm and welcoming.  The specials are always great and top notch wine list.", "author": "Z E W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Have been meaning this place for a while. It was a real stand-out for us, not only for the food but also because of the friendliness of the staff. We shared a charcuterie board to start (delicious!) & I had a duck salad - which had enormous amounts of duck in it = divine! - and my partner had pork chop with grits, which he ate like a starving wolf. We're European & the hankering for excellent French-style food never really goes away - we have definitely found our spot!", "author": "Fi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Amazing place. Great food, great staff. Great choice for a date for bringing your parents.", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Revelry is a perfect and cozy neighborhood gem! My boyfriend and I went for dinner last night and when we were looking through the menu, it reminded me of a very memorable meal we had in the South of France. We ordered the cheese plate, filet mignon, and the gnocchi. All were good, but the cheese plate and the gnocchi dish were my favorite. I can't want to dine back here again.", "author": "T D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Classic French bistro fare executed at a high level. A lot of love clearly goes in every plate. Little touches stand out, such as the mushrooms sautéed separately from the risotto to keep them crisp and the rice creamy. Filet Mignon was cooked to perfection and should be added to the menu, if it's not already.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-08", "description": "I really wanted to eat here, but we had no luck getting service. When my husband and I arrived, we were told we could wait ten minutes for seats at the bar and another 20 minutes for a table. Unfortunately they had 3 different people managing incoming guests, so when another couple arrived, another hostess seated them immediately and ahead of us at the bar, without checking with her colleagues. My husband, then, simply stood in the doorway until a third server/host asked him if he could help. When my husband said that we were still waiting to be seated, the man casually waved at an open table. We sat down, and they completely ignored us for over 5 minutes (no water, no menu, no service, and we watched the couple who got seated ahead of us drink their wine at the bar). So, we got up and left.", "author": "Caroline N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "Loved the duck confit salad and the hangar steak. Service was top notch as well.", "author": "Calvin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Went here for date night.\nThe food was solid.  The wine was solid.  The prices were solid.\nWould highly recommend and look forward to a repeat visit in the near future to try other menu items.", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Food was excellent! My only criticism is that it was very warm in the restaurant. The food and service is wonderful, give it a try! I loved it!", "author": "Dianne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "We were in the neighborhood on a Saturday night and somehow managed to grab a table for four on opentable.com.  We had no idea what to expect, especially since the menu online was pretty sparse, but what a surprise!  I agree with a reviewer who called it a \"gem\" because that's exactly what it is. Right when we arrived, we felt welcomed. Everyone working there was friendly and had a smile on their face. We ordered a lot of specials because they all sounded delicious and these are the ones I personally tasted:\n\nFrench onion soup - Standard but tasty. Portion was on the smaller side. \nEscargot - Standard. Seems to be baked with olive oil instead of butter. Couldn't stop dipping my bread in the sauce.\nBone marrow - Delicious! I really liked the tomato jam that it came with because it helped to cut the rich fattiness.\nDuck confit salad - I had a few bites and it was very flavorful yet clean.\nPotato gnocchi - If it's on the specials, YOU MUST ORDER! The dish was filled with mushrooms, truffle flavors, and spinach.  It's a little rich but if you can't handle the entire dish, order it for the table.\nFilet mignon with foie gras - Rich, decadent and memorable. And the foie gras portion was pretty generous. There was a flavor of star anise that lent an Asian flavor.\nTrio of epic cookies - While I liked the rich peanut butter cookie, my friend declared the chocolate one the best she's ever had (and she's not a chocolate person).\nSorbet - We had pomegranate, coconut and raspberry. Flavors were good but texture was a little rough.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Stumbled upon this charming bistro near where I live and I'm super glad we tried it out. Their entrées change daily but I had the filet and it was perfect. Topped with a light garlic butter, and served atop some essential carrots and brussels sprouts, it hit the spot nicely. Also tried a bibb salad with almonds, fresh melon and savory bits of cured meats which was the perfect pairing of salty and sweet. May try to recreate this one on my own at home. Service was impeccable too and our waiter helped us pick a nice wine pairing. Overall 10/10, would return.", "author": "Jake K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Love Chef Brad, I will follow him where ever he goes. He's so talented I can't wait to go back, my taste buds are exploding just thinking about it.", "author": "Diana T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Ambiance was perfect - intimate, relaxed, and inviting.  Very comfortable dining experience and romantic perfect date night!  Food was incredible from the charcuterie, shrimp, to the desert!  Can't wait to go back!", "author": "p f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "As soon as you walk in it feels like a quaint and authentic French bistro (busy but not loud). We started with assorted oysters, the charcuterie and cheese plates. We really enjoyed the diversity presented in each. All of our entrees were spectacular (we had issues because we each kept taking bites of each others plates because each were all so delicious:)! The waiter made an excellent recommendation that paired well with each of our different dishes. We were bummed we couldn't do dessert (we were so stuffed from the meal) but we topped the evening off with some strong espressos!\nI am really looking forward to coming back!", "author": "Nadia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "I like the space - good atmosphere.  It was not too loud.  The food & service was good.  My complaint is they only have 4 entree choices.  We were there on a Friday at 7:30 and they were already out of 2 of the choices!!  How can that be?  They substituted for one of the choices, but that still left just 3 choices - steak, fish & a pasta.  Not much of a selection.  I ended up ordering the charcuterie appetizer for my entree.  It was good.  Not sure I'll return because of this.", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Amazing.  Happened to stop in for dinner and we were impressed.  We were looking for a venue for a wedding brunch so we came back for brunch and again, the food was terrific, the service attentive and friendly.  We decided to do the wedding brunch here and we couldn't have been happier.  We had the room in the back which was very private and easy to move around in. It is perfect for a family or friends celebration where you want restaurant food cooked to order, rather than a banquet, and Jerome couldn't have been more helpful and accommodating.  Our friends were all impressed with the food and the wine selections, and all remarked at how welcome they felt in this very San Francisco French bistro.  Our favorite choices were the Eggs Cocotte and Croque Monsieur, the beet salad and the duck confit salad for brunch.  You won't go wrong with any choice on the menu.  Thanks a bunch, Jerome.", "author": "dan b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Fabulous food!  Fantastic presentation!  Wonderful experience!  I couldn't wait to see what the next dish would be that came to our table.  What a treat it was to dine at this restaurant.  I am certain it will do very, very well and I look forward to returning soon!", "author": "Rosie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-17", "description": "Really, really like this new French place just a little removed from Hayes Valley. Both the Brussels sprouts Caesar salad and the duck confit salad were pretty well balanced and the risotto with mushrooms, though a tad on the salty side, was excellent. Wines are reasonably priced and well curated. Atmosphere is delightful: like a dressed up bistro with a homey but slightly elegant vibe. Service was leisurely paced but they never brought us a couple more toast points to go with our baked Camembert.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "This place was a great little spot on the corner in Hayes Valley, and the food was very tasty!  The amount of choice on the menu was a pleasant surprise considering it is a small place.  Great selection of wine and beer as well!  The staff is very friendly and attentive.  It is on our list of places we would visit again.", "author": "Dave B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "everything we ordered was awesome and flavorful. the look of the place is cute and cool and the waiter was great.", "author": "Natalie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "I arrived her with my husband like 45minutes after our reservation. Our date couple was already seated and enjoying a decanter of wine and some olives. It was sometime before 5 but that still impressed me that they seated them with out the full party. We had the big wood table in the front of the restaurant. The table sucks! I would highly recommend they replace it with something more practical. It seems large but the way the legal are situated it definitely felt cramped with 5 people. The food is absolutely amazing. We ordered almost everything on the menu. The snails were perfectly cooked. Usually they are chewy and just a vehicle for garlic and butter. These could have been plain and they would have still been perfect! The sweat breads are ridiculous! Even the mushrooms the thymus gland sat atop were good. Our couple contains a Brazilian who was very happy with their salt cod. He kept saying this takes 3 days to make. I find French food to be very simple. It doesn't typically have strong flavors that can overshadow poor technique. This restaurant could easily be in France. Well, except the service is also great! Everything from the beet salad to the desert was truly spectacular. This is easily on of the best French restaurants in the city.", "author": "Corey Jace W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "This place is great. It's right on my corner and has simple, but very delicious food. Excellent cheese platter and oysters. Solid beer and wine selection, and extremely kind and attentive staff. Would definitely recommend.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "This place is wonderful - amazing food, amazing service. Jerome really knows his wine and food, and made our meal memorable. Reasonable prices for such good, well made food. The dessert was incredible - handmade French nougat.", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Fantastic French bistro where you can find splurgy classic favorites like bone marrow, oysters and escargot. We had the radishes, foie gras torchon, pork belly and filet mignon. Everything was tasty and seasoned well. The foie with shaved truffle was divine with a perfect portion size for 2 (or 4 for a taste). My rare filet was perfectly cooked and paired with simple but classic potatoes and green beans. My boyfriend's pork belly was wow. The meat was tender, and the skin was shatteringly crisp. It came with these warm apricots that were surprising and addictive. Lovely meal overall. A tad pricy to be called an everyday bistro option (like say, Chez Maman), but certainly not breaking the bank for the quality of food. Service was attentive, warm and friendly. Wine and beer list extensive and nicely-curated. Atmosphere inviting and spacious with plenty of tables to accommodate both large and small groups.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "We noticed that a new restaurant has opened in our hood and decided to give it a try last night. It was extremely busy but even so the owner took the time to have a chat with us . He and his fiancé are so sweet and passionate about Revelry! \n\nWe shared a cheese and charcuterie board that was a perfect way to start. We also had the braised short rib which was amazing!! Food was gorgeously presented and delicious! \n\nWe are so happy for this couple starting a new business and wish them much luck! We will be back for sure!", "author": "J R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "Actually, 3 and a half stars. Wife and I came here on a Saturday evening at about 5 PM, earlier than our reserved time of 5:30 PM.  We were cordially greeted and seated immediately upstairs, which has about 4 intimate tables and a large central table for about ten persons.  This room was much more esthetically pleasing than downstairs which was more like a bar.  We ordered a dozen assorted oysters and the beef marrow for appetizers.  The oysters were super fresh and delicious as others' reviews indicate.  They somehow forgot that we also ordered the marrow, so we wound up eating them (four yummy pieces) after the main courses.  Wife had the fish (some sort of white fish), which was OK but rather dry.  I had the tournedos Rossini topped with seared foie gras, which was perfectly cooked (medium rare on the rarer side), and, with the foie gras,, it was absolutely delicious. After the marrow dessert (!), we were quite full and skipped the dessert.  The service was solicitous, friendly, and prompt except for the faux pas concerning bone marrow.  We also enjoyed the background music of French chansons and Nora Jones.  Overall, we enjoyed our dinner here and will be back for the oysters and tournedos.", "author": "Hoyle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "We discovered Revelry Bistro last night and are thrilled to have found such a great restaurant in the neighborhood. The menu is interesting, the served portions are ample, the owners are charming, and the wait staff pleasant and helpful. We ordered Osso Buco, mushroom risotto, and grilled salmon for main courses. For starters we had ahi poke, bone marrow, and chicken liver pate. We all loved our own food and everyone else's as well. I can't wait to go back.", "author": "Terry H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "$1 oysters? Yes please. Everything else is yummy and with good portions for the price including the wine. Welcome to the hood!", "author": "Ella M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "A quaint spot to meet a pal for wine and a perfect array of cheeses, oysters, soups, and salads. In fact, my girlfriend and I ended up closing the restaurant down and had the opportunity to meet the owner, who is super passionate about his craft and excited to mingle with his patrons to come up with his next great offering. I would recommend this place to anyone in the mood for a humming SF eatery in a tucked away historic neighborhood.And with a killer brunch set to launch in a few weeks, this place will definitely be a summer go to", "author": "Kiki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "I'd heard great things about the restaurant and was excited to try it. I knew it was the new venture of an excellent local chef, Brad Roth, who has never failed to deliver in the past. I was not disappointed! The crudo was superb, and the filet melted in my mouth! Not to mention the truffle butter on top! AND the bacon brittle on the salad was delicious! The presentation was beautiful and generous as well. Oh did I mention the bone marrow seasoned to perfection? An excellent way to feed the soul on a Saturday night!", "author": "Angelina K."}
