{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "*Came here on a Wednesday around 1pm and stayed until 3. During this time the cafe was quiet and mostly empty, which was perfect for getting some work done. There was plenty of seats, so no need to fight over tables. \n\n*There were a few items on the menu that looked unique. I ordered the Creme Brulee Latte ($5) which to my surprise came out with a crunchy caramelized top just like a creme brulee! It was sweet, might be too sweet for some, so I personally wouldn't order it again. I also ordered a Pesto Toast ($7) which was yummy! Pesto, Cheese, Pepperoni, Tomatoes...It tasted like a slice of pesto pizza lol\n\n*Service was friendly. My drink came out quickly and my food came out maybe 10 minutes later. You clean up your own table at the end. \n\n* I got lucky and parking was easy to find during the weekday/work hours. However, I can imagine that it might not always be the case, and might need to find parking a few blocks away next time.", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-06", "description": "Cute cafe off the beaten path. Stopped by here for the cold brew which was pretty good. \n\nStaff was slow and not friendly.  They seemed more interested in talking with their coworkers and friends not purchasing anything rather than helping customers. No seats were available on the late morning. Seems like it gets a lot of people working from \"home\" on their laptops. They need to find a way to move people every couple hours if they want more business. \n\nOnly street parking is available...good luck!", "author": "Alan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Shop: Super cute! There are seatings but you may have to share the tables with others. There are a couple spots for electric outlets, which is a plus! \n\nBathroom: Get a code from the cashier. It's clean! \n\nStaff: Super nice and friendly. The orders were made pretty quickly as well. \n\nAvocado toast: The best one I've ever had. The avocado is mushed, well seasoned, and nicely spread. The toast was crunchy on the sides and soft on the inside. ($9ish)\n\nBreakfast something Sandwich: The aioli sauce on it gave the sandwich a great taste. Everything was just a perfect combination with the buns, the cheese, the egg and the bacon. ($7ish)\n\nSalted caramel latte: Tasted amazing. ($4-$5)\n\nCold brew: They didn't cold brew it right then and there. It was in a jug which was in the fridge. However, it actually still tasted great. ($4-$5)\n\nWiFi password can be requested. \n\nI would totally come back. This is my new favorite coffee shop to get work done and fill my belly!", "author": "Yuan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-24", "description": "Loved my experience at this trendy coffee shop tucked away on this residential block right off Park Presidio.\n\nLondon Fog - this is one of the better Earl Grey lattes that I've had! The milk supports the Early Grey tea very well, the tea still comes through strong. \n\nAvocado Toast - Runny, fried egg sits atop of a bed of mashed avocado smeared across a comfy, thick piece of toast. Garnished with red pepper flakes. Yum! \n\nSalted Caramel Latte - A solid caramel latte. The latte art was definitely a plus!\n\nMatcha Waffles - MMmmatcha! Comes in 4 pieces, toasted and drizzled over by a matcha/condensed milk syrup. The edges were a little overdone but I loved this nonetheless! Especially the sauce.\n\nTheir menu definitely stands out, at least this is the first time I have ever seen Whopper Latte on a menu. Whether you are in a hurry and want to call in your order for a quick pick up or take your time sitting in to enjoy your matcha waffle and latte art, this is the place.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Came here with friends for a good hipster cafe experience. Did not disappoint! \n\nI had the black sesame latte with soy milk and it was very light in sweetness (perfect), had that distinct black sesame taste, and a subtle hint of espresso (decaf...I know, what's the point of decaf, right?).  Never had black sesame as a latte, but I would definitely order it from here again!", "author": "Peds P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "The coffee was great. I wish they would add some more options with the pastries and the sandwiches though. Also, if you are here to study you will love how spacious it is compared to most other places around town", "author": "Celine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Cute and busy neighborhood coffee shop with a variety of food! \n\nMint Cold Brew ($5) - Kind of tastes like the mint mojito coffee at Philz, but with homemade mint syrup! Minty, smooth, and strong! A great iced coffee. \n\nVanilla Latte with soy ($4) - +$0.60 for soy. Light and creamy latte with a good amount of foam and vanilla flavor. Not too sweet. Loved this although I wish I ventured out and tried one of their specialty lattes! \n\nPesto Toast ($6.75) - Thick (but soft) toast with melted cheese, tomatoes, and slices of pepperoni. Loooved this, and reasonably priced. \n\nBreakfast bunwich Sandwich ($7.50) - Pretty decent sandwich, with bacon, boiled egg, avocado, and thousand island dressing, but I would say it's a little overpriced for the size of it. Comes warm wrapped in foil. \n\nAvocado toast ($9.25) - I really really love avocado toast but I can't justify the price of this! Almost $10 for a thick piece of toast, soft boiled egg, and chili flakes. Although this was delicious, it's definitely overpriced compared to other places where I paid around $7 for the same thing. You can choose either a fried egg or soft boiled. \n\nFor two people our total was $33, which we thought was a bit expensive for everything but we enjoyed our breakfast nonetheless. Very cute interior with a good amount of tables and seating. Definitely want to try the matcha waffles and specialty lattes next time!", "author": "Cecille W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "I came in a group of five, but there was enough working space and plenty of outlets! The music can be a little loud by the window corners, so avoid that area if you're trying to study.\n\nThe workers were friendly and put out orders quickly even though when were a lot of people. They had unique items like creme brûlée and black sesame lattes and ube waffles. The black sesame latte was great, but had the grainy bits of real sesame so those might get stuck in your teeth! Just a forewarning because that black sesame look is not cute.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I stopped in Rise & Grind today after chilling out over at Lands End. I decided to go with 2 unusual drinks because why not? Today was grey and misty and required extra caffeine in unusual flavors: Peanut Butter Latte and Mint Cold Brew. The big, beautifully golden brown crispy disks of Chocolate Chip Cookie in their case also looked really tempting but I stuck to liquids today.\n\nBoth drinks are tasty but imho, the Mint Cold Brew edges out the PB Latte. I never thought mint and coffee would taste good together but there is sorcery in this and it totally works. Refreshing yet invigorating ;-) \n\nThe staff are super friendly, thank you! Great service always appreciated!\n\nThere are a few of those annoying hover-and-fly-in-eye-level-circles flies that seem to haunt San Francisco entryways, but I think those petty pests would linger inside a hospital lobby too. What is their deal?! Maybe some fly paper hidden off to the side would entrap them... I can dream. \n\nBonus Points: A few loaded bookshelves inset high up on a wall -- and lots of community artwork. Cool! But did I miss a ladder or how do you get a book? You'd have to be a Shaq O'Neal to reach them if you stood on a chair. But maybe I needed more caffeine to accurately judge book-hopping. Or they are decorative books. I can dig it.\n\nCoffee & mint. Check it out! Peace, dudes and dudettes.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Absolutely love this coffee spot! I've tried a couple of drinks here (all of which are fantastic), but their black sesame latte is my recent FAVORITE! Trust me, it's a game changer. I've tried both the iced and hot versions and they're both AMAZING AS F.\n\nIn addition to coffee, they offer a variety of other creative items on their menu. Their avocado toast is delicious (presentation is on point) and for those with a sweet tooth, their ube waffle is to die for! So many more items on the menu that I need to try.\n\nThe owners and staff are also super nice and friendly, and attract a lot of regulars in the neighborhood (myself included). It's a popular spot with really great ambiance to study/work -- if only this place was around back in my college days!\n\nHighly suggest checking this place out if you haven't yet. Trust me, you won't regret it!", "author": "Denise T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-03", "description": "Welcome to a super cool coffee house that has all your selections that you like. Many people sitting and relaxing as they enjoy their hot wake up choice. \n\nMy wife ordered us the creme brûlée blend as it really peaked our interest.\n\nIt was really good and tasty! Not to sweet but very nice while strolling in the park!\n\nCmon in and enjoy...by the way the staff is wonderful and will assist you with a great choice of beverage.", "author": "Jimmie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Rise & Grind, San Francisco!\n\nThis place is always humming and chill at the same time. The staff and ownership team are super friendly and have created one of the best cafe experiences in San Franisco, right in our wonderful Inner Richmond neighborhood.\n\n+ Coffee options aplenty (and it is good coffee - especially like the Cold Brew)\n+ Food is really really good - try everything\n+ Atmosphere is perfect for a quick bite/drink, conversation or private study session\n+ Location is right off park and central to any Inner Richmond resident\n\nThanks for existing Rise & Grind, and for making life a little better.", "author": "Mitch M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "I really like this cafe! I'm not a coffee snob but I liked the cafe for its working ambiance. I easily spent a few hours here working away. Their menu is pretty inventive and casual. Creme brulee latte? Pumpkin spice lattee (made from scratch?) Sign me up. I also ordered a BLT ($7.50 - not too unreasonable) and it was delicious. \n\nGreat wifi. Good for working. Would come back here again if I'm wandering near Golden Gate Park. \n\nService is a tad slow... especially for BLT. I would expect a little better but overall it's a cool neat find.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Featured creative lattes like Whopper, Creme Brulee, and Peanut Butter along with trendy bites like avocado toast, corn toast, ube or matcha waffles, and chia pudding, this is a one-stop shop for your caffeine fix AND tasty eats. \n\nUbe Waffle - Recommended!  Beautiful presentation with vibrant purple ube colors mixed with a dusting of powdered sugar.  The waffles were pleasantly fluffy and soft in the center with crisp edges.\n\nChia Pudding - Feeling healthy?  Go for the chia pudding topped with fresh blueberries and cinnamon.  Or do what I did and go halfsies on waffles / chia pudding to splurge a little and be conscientious.\n\nWhopper Latte - I didn't get too much of a malted chocolate flavor aside from some whopper bits on top, but I was pleasantly surprised that the latte was not jaw-achingly sweet.  Kudos to them for not going overkill on sugar like many other places do.", "author": "Sheila C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "Great place to get a coffee or espresso any time of day. Nice location near Golden gate Park and always nice chill people here. Coffee has gotten better the last few months, really nice and rich lattes in particular. Worth a drop in when you need a fix.", "author": "Erik L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "I LOVE RISE & GRIND!!! what really makes this place is the homey atmosphere and the fact that they're run by the sweetest humans in the world. The Vs are super kind and fun. The food is bomb too. I would get the breakfast sandwich or the waffles. The drinks are also bomb. RICHMOND CHILL is SO SO GOOD. An amazing way to jumpstart the day with a refreshing Richmond Chill. It's addictive and delicious. It is the perfect balance of condensed milk and coffee. They're all about meeting new people/friendship and I love that \"we have WiFi but you can still meet someone new\" sign. I also love that they support local artists and you can buy the art off the walls. This place is always popping with people from the area and you can always have a great time at Rise & Grind.", "author": "Caitlyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-13", "description": "I've had their cafe au lait (smooth), almond latte (strong), and their London fog latte (smooth & sweet but not too sweet). All are good, but my favorite so far is the London fog latte! The aroma is so pleasant and it's just so tasty! I ordered the matcha waffle recently, and it was so satisfying! St first glance, I thought it might be overly sweet but it was mildly sweet and just right! It's a tad bit on the dry side, or rather on the cakey side, but I didn't mind that since there was ample sauce and since I had my London fog latte. The two actually went really well together! \n\nOverall, I enjoy it here and will be coming back! There's limited seating, but I've been able to grab a seat each time. The wifi worked for me one time and then it didn't recently. My friend was with me and if didn't work for her either. I'm not sure if it's their internet or if it's our laptops, so I just used my personal hotspot... no big deal.", "author": "Angie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "I've never paid attention to this place until recently. A lot of coffee places have opened up and if you think about it, they all do the same. \n\nWhat made me try this place out was their waffles. I always had a thing for waffles, so here I am baby! I had the Ube waffle, it's visually stunning. Aesthetically very pleasing to the eye, they definitely made an effort. I can't get over it, my picture doesn't do it justice. It does taste good but I think I'm loving it more because it's so attractive. \n\nI'll come here over Stacks, any day.", "author": "Madison Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "Just a cozy, unpretentious coffee shop on the edge of Golden Gate park. My favorite thing about Rise & Grind is its creative menu, which has a rotating slew of unusual but thoughtful coffee drinks and breakfast items like like matcha waffles or biscuit breakfast sandwiches. If you're coming from GG Park and looking for a place to stop, I'd recommend here. Not only because of its staff and menu, but also because it's one of the only spots you'll find lengthwise along Fulton within 10 blocks!", "author": "Leslie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-03", "description": "Yay they have, Black Sesame Latte!\n\nI've been looking long and hard for a good black sesame latte place in the bay area, and alas I've found it. \n\nI opt for the black sesame, iced and half sweeten. I wished I got it in regular because it wasn't sweet at all and a bit watered down. \n\nNonetheless it was worth trying and I'll probably come back if I were in the area to give it another shot.", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Ordered myself a biscuit breakfast sandwich and a black sesame latte. \n\nThe biscuit breakfast sandwich is definitely a winner. Delivered warmed, the biscuit was fluffy and not too dense. It comes with some thinly sliced avocado, cheese, thick sliced bacon, and a sliced hard boiled egg. Everything is then tied together with a delicious aioli. \n\nAs for my black sesame latte, I could definitely taste the roasted smokiness from the black sesame but I had to constantly swirl my latte before a sip. Even then, the bottom had a lot of black sesame sedament. Maybe, I'll try a variety that combines more easily next time - looking right at you, biscoff latte...\n\nOverall, both were very good, but I was a bit disappointed that they were delivered so far apart. Coffee was definitely getting cold by the time my sandwich was brought over.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "Cute little cafe!! Very small so you really gotta scope out good seats if you want to study here on a weekend! My friend and I got a spot at the bar table with high chairs facing the window. It was okay, but we had a lot of stuff so it was cramped with both of our laptops and notes, as well as our food and drinks. However, I will say their avocado toast is very good! You can tell they use fresh avocado and the egg they use perfectly drools out the yolk on top. Yum!", "author": "Sarah Ann K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Love this charming coffee shop close to my house. \n\nI came in with my Corgi and sat in. It is a dog-friendly place! \nThe customer service was friendly and polite. I ordered a cup of Creme Brulee latte, I loved it! I stayed there for an hour and I wish I could have stayed longer, but my dog was getting nervous. So, I had to leave. I will come again!", "author": "Jimmy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "This place has a nice friendly vibe, lots of locals popping in to get their coffees. \nMy coffee was a solid 7.5/10, and the avocado on toast was the little bit of sydney that I was craving after a week or so in the USA. \nIt was tasty and fresh, although, I think a few small changes would've made this a 5star review. \nThe bread, as another reviewer has pointed out is super thick..It was also a little sweet. How about some sourdough? I've had some amazing sourdough in SF!\nThe Avo was fine, I prefer it to be sliced rather than pre mushed, but it tasted fresh so that's cool. The egg was really well cooked...overall a decent light breakfast in a spot that felt comfortable and welcoming. If I lived here I would be a regular for sure.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Coffee and corgis are a few of my favorite things. Starting the day off with both of these? Total win. After a few visits, Rise & Grind has become one of my favorite coffee shops...and it's not just because of Cori the corgi - promise! \n\nI'm a sucker for specialty lattes, especially creative ones that you can't find anywhere else. Rise & Grind makes a creme brulee latte and a special's menu Biscoff cookie butter latte that are decadent and delicious. Perfect if you have a sweet tooth like me!\n\nAvocado toast, matcha waffles, and bacon, avocado, aioli breakfast sandwiches are amongst some of the tasty options available for your snacking needs. \n\nWalls adorned with art. Friendly owner and servers. Seating available for coffee-sipping conversations and laptop lounging. Food orders can take awhile, but it's usually because they get pretty busy. Solid coffee shop and a great addition to the neighborhood!", "author": "Deanna Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "This place is a trifecta of all the best things most SF coffee shops don't have: Free Wifi, ample seating, and power outlets! We wandered over here after an afternoon at Golden Gate Park and it was the perfect place for a few hours of reading and relaxing. \n\nThey have super interesting lattes and sweets (the waffles sounded decadent) but a little decadent as a mid afternoon snack. The spicy chai latte (sub almond milk) was delicious, appropriately spicy, and just sweet enough.\n\nIt's a little pricy, but what isn't in SF? Can't wait to come back here again when I'm in the area - I hope for dessert!", "author": "Denise L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "We stopped here three mornings in a row on our vacation. I'm a coffee snob and I found the coffee to be dang good. The food was tasty. The avocado toast was millennial-tastic. \n\nBest of all, the place was SO clean, the staff was SO friendly and we loved the parade of cute dogs coming in and out.\n\nIt's a little pricy, but probably standard for a big city.", "author": "Whitney D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "My friend was basically begging me to come here to give this place a chance. He comes here religiously once a week, and has even become good friends with the owner! It has flawless reviews and is pretty close to my home. So finally, I gave it a chance!\n\nI got their Whopper Latte. This is not to be confused with a Burger King Whopper lol, but rather Whopper Malted Milk Chocolate candies. Even though it was a latte, it was pretty chocolatey which I loved. The froth was nice and thick, pretty nice considering it was almond milk. Well done! Not too sweet, just in case you were wondering.\n\nI was really hoping for one of their animated lattes (they have a special latte artist!) but she only comes in the afternoons FYI. Next time I'll catch her! They also have a cute Corgi named Cori who I have not met yet unfortunately. Apparently he's super friendly and runs & runs around the place. Looking forward to my next visit! \n\nStaff is super friendly and sweet. For my friend who is a regular, they give him free coffee. One time he took a nap, and he woke up to find on the house snacks waiting for him at his table! Wow. Now that is service!\n\nThis is also a great place to grab a coffee before starting your day in Golden Gate Park! It's right near one of the entrances.", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Holy cannoli, all I can say is bom.com. Got the creme brûlée latte and man oh man was it amazing !!  The staff are super friendly and helpful in helping you decide when your undecided ‍", "author": "Lynda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-06", "description": "This place is a solid 4-star for their coffee. Their espresso and americanos do the job well. It got a solid star knocked off because of their food. Not only could they do better with the flavoring of their sandwiches, but the main reason I'm not a fan is the size of their portions for the high cost of food. \n\nLong story short, I'll be back for coffee, but I'll grab my breakfast/lunch elsewhere.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "I went to Rise & Grind after a 5 Mile Saturday morning run. My friend and I ordered two breakfast sandwiches and iced tea. \n\nThe breakfast sandwich included an egg, avocado, and Hollandaise sauce. It came out wrapped in tin foil so and it was perfectly heated.  It was a great way to end the run and start our days.  \n\nAfter we finished our sandwiches the lovely staff gave us free Vietnamese iced coffee popsicles drizzled with condensed milk.  \n\nWe are definitely returning to Rise & Grind Cafe! This may be a start of new Saturday Morning tradition!", "author": "John L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "Came here on Friday morning and was second in line.\n I ordered the whopper latte and I'd give it 4/5. The latte wasn't overly sweet and I could taste the malt, which is nice. \nSecond purchase was the breakfast bun sandwich and I'd give it a 1/5. I couldn't eat it as it was drenched in thousand island sauce or drenched with whatever sauce is included, which is overly sweet (see photo). I returned it and asked if they could make it with no sauce. The sand which without the sauce is okay. Nothing amazing but it does the trick if you're hungry. \n\nNot sure if the photo does it justice, but the sauce was on the top bun, spilling out the sides, and coating the bottom bun. I tried to scrape some off before I ate too.", "author": "Phoebe U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "4 stars for the place/staff, 2 stars for the black sesame latte that had lumps while I drank it and a thick sludge at the bottom of the cup. Shop is bright with lots of windows and plentiful seating for a smallish place. Staff are friendly! I rarely get a specialty coffee but was tempted because they had so many unusual ones. Sounded better than it was--thankfully though, it wasn't too sweet. Not sure if a regular latte would be up to par...", "author": "CityPixie Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-20", "description": "The Avocado toast is simply delicious, even though it's pricey.  It is just a piece of toast with avocado spread all over sprinkled with some chili flakes and a soft boiled egg.  But it was so good.  I was just a tad disappointed my egg didn't leak like the pictures people have been posting.  \n\nNot a big fan of the Ube waffle I had especially came for.  The waffle was a bit dry and a bit plain, even though there's a side of ube paste with it.\n\nI also ordered the Black sesame latte, which was pretty good.  Not overly sweet, only issue I was bothered with was that there was a layer of sesame on the bottom that didn't seem to have mixed well with the rest of the drink.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Stick to the drinks (except the pb latte) and you'll be good! Was kind of on the fence about drinks and food after the first time, but I really liked the creme brûlée latte today :)! Had to squeeze for study space (2-5 on a Thursday) and music was weird but still a good study spot.", "author": "Anna N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-01", "description": "Costco canned chicken salad goopy with mayonnaise with no choice of bread- oh white or white roll. They load it with chips. The coffee is not special, an off brand. The chairs are not comfortable but they got me out- which is where I will be from now on. We are going somewhere else when visiting GG Park.", "author": "jj c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Very good coffee, friendly staff and cosy environtment. The taro pancake was average. Overall was satisfying.", "author": "Vinteng N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "Came in for a quick cup of coffee one morning, and it was great!  The coffee wasn't unreasonably overpriced, and it was definitely above average (much better than the coffee they serve at chains like Starbucks or Coffee Bean).  Service was very quick, and the people working there were really friendly.  The ambiance of the place is nice too - I could envision myself studying there if I went to school around here.\n\nWill definitely stop by again if I'm in the area!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "5 out of 5 stars on yelp was not a disappointment. \n\nSmall cafe with lot of people studying in the cafe. Not a typical brunch hangout joint despite all the amazing latte art and delicious food photos on yelp and Instagram, so make sure to set your expectations. \n\nI went with a group of 4 people and it took a while to wait for a table to open even though it was a rainy day with no wait. \n\nAll the staff are all incredibly accommodating and thoughtful. Amazing service and pride to their food and drinks. One of the most interesting and delicious cafe experience I've had and was totally worth tracking out little far from the city to try it out. \n\nThe black sesame latte and creme Brûlée latte was delicious! Matcha waffle and avocado toast is fresh and perfectly portioned and cooked. \n\nStreet parking and dog friendly cafe.", "author": "Kwiri Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "The Matcha waffle and the black sesame latte were delicious. The waffle (6.25 not bad) wasn't too sweet and with just the right amount of syrup so that it wasn't to dry. The taste of matcha was just right as well. Gotta try the Ube waffle next time! \n\nEveryone was super friendly, and there was a decent amount of space making it a great spot to work as well!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "I really enjoyed their avocado and egg toast! The egg was perfectly soft boiled. The combo of avocado and chili flakes was delicious.\n\nThe black sesame latte, however, was very disappointing. My friend and I were excited to see black sesame latte on their special menu, so we both ordered it. Unfortunately,  that meant double the disappointment.\n\n1. No latte art - after seeing other ppl's drinks, our lattes came out with nada.\n2. Lukewarm drink - my latte had steam coming out, but my friend's latte was not hot at all.\n3. Minimal black sesame taste - we could barely taste the black sesame and there were clumps of black sesame goop at the bottom of our drinks.\n\nI'm not sure if I would come back.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "Cozy cafe right across the street from the park. Great natural light, decent WiFi, good selection of speciality lattes and standard coffee drinks. Not the biggest space, but never seems to be too full or overcrowded. Overall good place to camp out with a laptop and grind out some work. \n\nThe coffee is good. Not my favorite, but good. Bit on the pricier side. \n\np.s. Cori the Corgi, the resident puppers, is the sweetest :)", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Love this place.  Super friendly & love that I can chill inside, eat & drink a yummy latte happily by the window.  I really like their Avocado Toast made on a single thick slice of bread.  One of my favorite things to have anytime of the day.  This time I ordered one with an extra soft-boiled egg & asked for NO chili flakes.  I don't like chili flakes at all.  Although it was delicious I had to scrape off the chili flakes when it was brought to my table. They forgot :-( ... luckily I can stand only just a little bit of heat, but next time I will have to return it if they forget again, I just hate wasting food.", "author": "Emy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Came up from San Diego to help some friends with their engagement (Nikki and Jim). They've been raving about rise and grind, highlighting the friendliness of the owners and the ambiance. \n\nRise and Grind is exceptional on every mark. The owners were indeed super friendly, the food was great, the coffee was unique. Portions are generous . \n\nThe avocado toast was a big highlight. Large thick toast with creamy avocado and a soft boiled egg.\n\nThey have rotating specialty coffees. I had the whopper latte which was sweet and dense.\n\nRise and Grind is an unpretentious lovely neighborhood coffee spot. Highly recommend.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Absolutely looove this cafe! Such a cute spot to grab some coffee and a bite to eat. Came here with a friend in the search for a good cup of coffee. For food, we couldn't help but try the pesto toast and the Belgium waffle. Both were cooked to perfection, soo delicious!! As for drinks, we tried the peanut butter latte, creme brûlée latte, and the cookie butter latte. They all had a subtle taste of flavor which was delicious and just how I like it! Will definitely be coming back here to try more things!", "author": "Monica-Leah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Can I just start off by saying that I love the owners!!!! Not too often do you walk into a cafe and can immediately tell how much dedication and hard work has been put into an establishment just by the atmosphere and vibes. I absolutely fell in love with the window space and the amount of sunlight you get once inside, it can literally brighten up your day! You can find inspirational quotes all around the cafe which adds a nice touch to start your morning with, or if you're ever feeling down!\n\nRise and Grind is a fairly new cafe with a few kinks here and there to be worked out once they settle in, but they are doing a splendid job so far from what I can see. Their menus are short and quick to the point although I can see that they are planning and trying new flavors in the process! I've only tried a few drinks but absolutely fell in love with their CREME BRÛLÉE LATTE!!!! 5 stars. Soooo bomb and resembles the dessert perfectly! I also recommend their toasts, any of them!! I like them all. The avocado, tomato & pesto, or corn toast. Also all 5 stars. \n\nThere's also a good amount of seating so you can come in to study or catch up with some friends while enjoying a cup of joe. Service is extremely friendly and efficient. It may take a bit longer to receive your drink though, I must admit, if they're busy or depending on what you order but it's usually not an issue unless you're in a rush. \n\nGive this place a try (if you're in the area or not), you definitely won't regret it.", "author": "Sunia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "My new favorite study spot!! I usually never drink coffee because it tends to just put me to sleep (yes I'm weird, I know) but I actually feel caffeinated with their drinks. I highly recommend the mint cold brew, which has a nice subtle mint flavor and isn't bitter like regular black coffee. The creme brûlée latte is delicious as well - not overly sweet, and they even torch the drink just like regular creme brûlée. \n\nThey also have toasts and pastries not displayed on the menu above the register. I've only tried the pesto toast, and while it was a little pricey at $6.50, it was very tasty. I liked that the pesto wasn't incredibly oily and that the tomatoes and pepperoni were evenly distributed throughout, and I loved how the crispy crust contrasted with the fluffy inside of the bread. The avocado toast seems to be a popular item as well, although I haven't tried it. Food can be a little slow to come out, but they're very accommodating of any special requests. \n\nThe atmosphere of this coffeeshop definitely bumps up my rating to five stars. The owners are both super friendly and welcoming as soon as customers walk in the door, and the decorations are so unique. I especially like the signs in the restroom and randomly misspelled words hanging on the walls LOL. However, the absolute best part is Cory, the owners' pet corgi!! He's social and very distracting when I'm trying to get work done, but also incredibly well behaved. There's not a whole lot of seating but it's spacious enough for people to do work, and they have a bunch of power strips lining the walls too.\n\nBottom line: strong coffee, delicious food, cute puppy!", "author": "KC W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-19", "description": "A super cute coffee shop to visit before your big day plans in the Golden Gate Park. The staff is super friendly and will happily explain each of their menu items to you. Ambiance is chill, as a great place to work on your computer. Not necessarily a comfy place to kick back and read a book. Nice large windows provide natural light and there's also a lot of local art for purchase on the walls. \n\nMy favorite item is the Whopper Latte. It's not super sweet as I expected it would be, but I definitely got a genuine light malty taste. It was pleasantly enjoyable!", "author": "Brittney H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "I wanted to mix up my rotation of coffee shops in San Francisco so I decided to visit Rise & Grind. This is a cute spot in the Richmond tucked away on 8th Ave. right off Fulton. Keep in mind, this isn't a very big cafe so seating is limited should you come during peak hours. There is one communal table, a handful of stools facing the window and the wall to the left, and several tables for two. (If you plan to work on your laptop while visiting, note that electrical outlets are limited.) The restroom is to the left of the cafe while the ordering area/kitchen is to the right. \n\nRise & Grind offers sandwiches, toast, and of course, the most important stuff and biggest contribution to one's productivity: coffee/espresso (and tea). I recently stopped by during the mid-morning hours for an iced hazelnut latte. While I was tempted to try their more creative-sounding lattes, I often like to try the basics upon my first visit to most coffeeshops. The latte was good though I could barely taste hazelnut. There was definitely a syrup in the latte but it did not taste like the signature flavor of hazelnut so that was a bit disappointing. As I sat and worked for a bit, I started to get hungry. Since my productivity was on a roll, I decided to grab a sandwich as well. I ordered their breakfast sandwich which consisted of bacon, avocado, boiled egg, cheese, and (I believe) some type of aioli. They let me know that instead of the customary biscuit they served it in, they now served the sandwich in an artisan roll. Fine with me! It was delicious though I wish the cheese was melted down a bit more. I also recall the egg being cold. While some folks might like that, I typically like everything warm or hot for a breakfast sandwich (minus the avocado, of course!). The aioli, while also good, was also a bit too much for the size of the sandwich. I'm not big into sauces in my sandwiches so perhaps I would go easy on the dressing should I order this again. I had an iced ginger peach tea with the sandwich -- refreshing!\n\nIn terms of service, the baristas were friendly and welcoming. \n\nOverall, Rise & Grind is a great place to grab some caffeine+a light bite, and to read, socialize, or work.", "author": "James Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-19", "description": "A really great local spot that adds to the Richmond. Popular with students and techies.\n\n- Locally owned, I *believe* the owners are from the Richmond/are SF natives\n- Tons of work space and outlets, they're incredibly laptop friendly (no charge per hour for wifi, additional power strips, etc). Mix of bar, small table, and community seating.\n- \"Fun\" lattes such as whopper, black sesame, peanut butter, etc. Not in my preference, but very trendy. They also have other interesting drinks such as a mint cold brew\n- Nice variety of food options. Different pastries, toasts, and sandwiches.\n- The interior is a mix of \"hipster\" and less pretentious, quirky, and almost mismatched superhero and literature themed. Haha.\n- The owners sometimes have their corgi here!", "author": "Jacquelyn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Rise & Grind lives up to its name! They go above and beyond with what they offer. \n\nThis place will make you feel warm and fuzzy inside! It's a cute local spot that is cozy and perfect for relaxing, people watching, or studying (they have wifi). Be sure to come early because the place is a bit small and it can fill up quick! Their ambiance is simple, yet playful and warm with Dr. Seuss quotes.\n\nThe staff and owners are also chill and friendly. You can tell that the owners love what they do. They have a great selection of items for coffee, toasts (avocado, corn/bacon, pesto), and waffles (belgian, matcha, ube). I had their avocado toast with a perfectly poached egg -- MUST TRY. \n\nRise & Grind is one of those gems where you hope no one else finds so you can keep it all to yourself. At the same time, you can't help but rave about it!", "author": "Kristal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "I used to go elsewhere for coffee but the poor attitude of the staff on multiple occasions has been enough for me to not return. With that said, I'm so happy Rise & Grind opened up! Great coffee in the inner Richmond, sans attitude. Owners are chipper, friendly and super sweet.\n\nSuch a convenient location as they are right next to GGP, on 8th Ave. Very easy to grab a cuppa and scurry into the park. Love it on Sundays especially because the park entrance is closed off to cars! The space is bright and bare bones yet cozy because of the artwork. \n\nNeed to come back for toast and waffles..", "author": "Susy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "I had the strangest interaction with the cashier here. I asked if a fresh tea bag could be made into a cold tea, and was told, \"Yes, we can do that for you!\" After I pay, I'm handed a hot cup of tea. I ask why it isn't the cold one I ordered, and the SAME cashier tells me that it's not possible to do. Unbelievable. \n\nI was visiting with a group and we were in the area for an event that was starting soon, so I opted out of dealing with the situation so we could get on with our day. It's a shame, because the menu and and ambience seemed cool, and I'm just across the panhandle. But being bold-faced lied to over a few dollars isn't exactly motivation to enter this place ever again.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "YES! Rise & Grind has awesome drinks! Creme brulee latte? ummmm, Yes! Mint cold brew? It had me buzzing for hours! I most recently tried the affogato and it had 2 scoops of ice cream and silky smooth espresso. They're super friendly here and you can always count on great service. I've also had a couple of their snacks, which are the perfect compliment to your coffee. I do wish some people working on their computers would share space more so others coming in can sit and enjoy the space. Parking can be tough on some days, but it's definitely worth it.", "author": "Aaron Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "Coffee and service is fine. But the many flies make me wonder about the cleanliness of the cafe. A little bit disconcerting", "author": "Nona T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Long overdue review but I visited this cafe a couple months ago with a friend.  I had the creme brulee latte which was awesome!  I love how they burnt the top - it added that burnt marshmallow flavor.  I also had their waffles which was also pretty good.  The location is great but I do wish they were a bit bigger inside.  Other than that this is a great cafe!", "author": "Mikayla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Love this place. I come here at least once a week. My favorites are the salted caramel latte and biscoff latte. They're both subtly sweet. Nice little joint to study and they're super dog friendly! (They also have treats for your furry loved ones)", "author": "Betty T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Great neighborhood spot. We had the waffle, served with specialty fruit syrup, which I usually am not a fan of, but was delicious. The classic egg breakfast sandwich was served on a perfect sourdough roll. Do check it out.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Rise and grind is amazing. Great food, staff, coffee and atmosphere. What more can you ask for from your neighborhood coffee shop ;)", "author": "Lucas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Already can't wait to come back! A friend recommended this place for one of our yearly catch-ups and we stayed here for several hours just talking and sipping our yummy drinks.\n\nThe Creme Brûlée Latte has the right amount of sweetness that makes you go, \"mmm, yum!\" without needing to add more sugar, at least that's what I recommend to those who like their drinks sweet enough.", "author": "Christie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-15", "description": "The coffee is pretty good. Their concepts for variations in coffee and food are great. However, I'm not wow'ed by the fancy coffee or food so far I've had. \n\nBeen here 3/4 times because it's around the corner more or less from my home. I'm here for the regular coffee more than anything else. \n\nThe drinks and food are not to my taste, but I think some people would love it. I wouldn't trek out here in purpose for it. \n\nSo far the food menu are all carbs. I can't wait to see their upcoming stuff", "author": "Linda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "I heard about this place through word of mouth.  I was meeting up a friend but realized I was 30 minutes early so I decided to make a coffee run.  \n\nCold brew hit the spot.  I saw a young woman sitting in the corner and made an assumption that she worked here, and I assumed correctly.  Michelle?  Rochelle?  No, it's Vashelle.  Oh hey.  Come here before rising and grinding or after grinding and rising *wink*, and show some coffee love.  Shout out to Vashelle and the rest of the Rise & Grind crew and welcome to the neighborhood!\n\nGood coffee, friendly service, cute Dr. Seuss quotes stamped on the floor.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "By far one of the cutest spot to come get coffee.. but what makes it awesome is that their coffee is sooo good and creamy! I also had toast with avo and an egg will recommend. Come by here before going to walk around the golden gate park. The only con is that the location is super small so if you're going to eat here make sure to get a table spot unless you are taking it to go.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "This place is a cozy lil cafe in the Inner Richmond, super close to Golden Gate park (situated on 8th and Fulton). \n\nThe Frittata Sandwich is pretty dope; messy, but delicious. Pour overs aren't bad, I wasn't too big on their Organic Seven Bridges Blend, but the Colombia they had on hand was really good (light roast: sweet lime, red grape, and cashew butter). \n\nThey have some cool art pieces with cute lil Dr. Seuss quotes laminated into the floors. Wish nothing but the best to this cafe, seeing as how the cafe competition in SF is brutal.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Friendly staff, quick service, very foamy mocha. Nice they offer two different non dairy milk options. Clean quaint place. Only feedback was the avocado toast was salty; let the customer determine the amount of salt.", "author": "Missy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "By far one of my most favorite coffee shops and places to chill in The City. It all starts with the owners, Vee & V. The way they take the time to get to know each every single customer who walks through their doors shows just how invested in they are. \n\nTheir drinks and food are always made to order, it may take longer than some shops but you can taste the difference. My favorite drink on their menu is the Mint Cold Brew. I also really like their Creme Brûlée Latte as well. For food, their avocado toast is always smackin!! Fresh bread, nice avocados & delivered right to your table with knife & fork. What else could you ask for?\n\nThis trip I special ordered Waffles: half matcha with ice cream on side & half ube with extra ube on side. Let's say I was no where near disappointed. Crackin! If you're in the hood drop by & check out what they're selling because you won't leave sad. \n\nOh, plenty of plugs, seating, and strong Wifi. Not to mention Cori the Corgi", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "I pass by this cafe all the time on my way to ggp and decided to stop by one day with a friend of mine. Its right by the 44 bus stop so it is such a great spot to meet up with someone, or wait for your bus! There aren't too many tables so I can't say whether or not this will be a good study spot. However, there is a lot of light that shines in through the windows which is a major PLUS in my book. \n\nThey also sell avocado toast here which is a popular trend in SF...but if I could suggest anything to any friend is to make your own toast at home! It will save you cash that you could be spending towards coffee (= think about it!!\n\nThis rating is mainly based on the ENVIRONMENT and ATMOSPHERE. I will have to be back to try their drinks!", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-02", "description": "Made a pit stop here mid-way through our adventure filled day for some coffee and corgi loving\n\nWhen I saw they had a creme brûlée latte AND a peanut butter latte, I knew I had to try this place out. \n\nThe creme brûlée latte was pretty cool, but taste wise, nothing special. It's one of those things I'm glad I tried, but would never get again. It's just straight sugar on a latte... and the latee itself wasn't exceptional either.\n\nI went with my mom, who is not a coffee drinker, but recommended she try the London Fog which she really enjoyed! \n\nHonestly, for me, the best part was the dog. His name is CORI, THE CORGI. It doesn't get better than that.", "author": "Shayne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "Found this cute little coffee shop and they have excellent coffee. The mint cold brew was really good nice balance of mint and coffee even without cream", "author": "Marwa E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "It was a cool artsy coffee shop with nice employees! My boyfriend loved the pb&j toast! Lol", "author": "Blondie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "This place was a new find for me. I got off early from work and I wanted to try out a new cafe around the area. Lucky Rise and Grind was it! I ordered a coconut mocha with a chocolate croissant. Staff were extremely friendly. The vibe of the place is pretty chill especially if you want those afternoon escapes or wanna hit a new cafe. Check out Rise and Grind , you won't be disappointed.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Super cute cafe was crowded when I visited but would still recommend checking out just for a quick bite or something to drink.", "author": "Kitty H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Holy shit!!  Mint Cold Brew !  Enough said when my comes to this one.  Not bitter or any fake mint taste.  I", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Their cold brew is STRONG just how I like it. The baristas are nice and the place is maintained well. I didn't really notice their food items but they keep their beverage menu simple. Will definitely come back.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "A nice neighborhood gem right on the edge of Golden Gate Park, come early because the cafe does get full if you're planning on studying there. The place does have lots of outlets and fast WiFi. Bonus points for the amount of cute dogs you'll see :)", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "This is not your pretentious coffee shop, which honestly, after living here my whole life, I'm tired of seeing in this city. This place has more of an authentic, neighborhood feel. \n\nI work nearby at USF and this is my go-to spot for lunch. My favorites are the avocado toast and the PB&J toast. One order of toast is very filling in my opinion but sometimes if I'm really hungry, I'll order both. Haha. For drinks, the iced ginger peach tea is my favorite. I try to be healthy for the most part but man their cookie butter latte is hard to resist sometimes as well. Other than that, the owners are the friendliest people, which is what keeps me coming back as much as the food. Lots of love for this place!", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-22", "description": "Rise & Grind isn't a cofferia one gets found of while waiting for ur brew. it's a bit slow due to understaffing and type of coffees offered: drip coffee, pour overs-both need individualized attenion. drip coffee wasn't a cup at time though, a was a potful.\n\nmenu: mr, expresso coffee, teas, a sammie, pastries, specialized seasonal lattes..\n\nbrew: mr. expresso \"columbian\" (3.5) pour over\n-(description) \"light, sweet  lime , red grape, cashew butter\"\nnot what i tasted. bold slightly acidic, earthy was my impression.\n-not a fan of mr. expresso, usually disappoints BIgly.\n\ndrips:\n-parking a problem\n-was looking at construction worker who ordered 2 coffees to go, tipped Bigly, was casual about waiting minutes for his drip coffee(2.75)\n*saw he double parked his van in front of the coffee shop, i looked at him, he looked back.\nno disrespect, just catalogging the facts.\n-when service is slow, i absorb everything possible in the immediate area to figure out whats happening.\n-less than 20 seats scattered thruout.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Rise and Grind Coffee and Tea is a welcoming neighborhood cafe with an assortment of coffee, tea, and snackable items.  There are also real tea options worth exploring. I ordered the London Fog hot tea to warm up on a long walk in the area one day with my husband and really enjoyed the fragrant warmth.  We didn't stay in the cafe for very long, but I also noticed there was plenty of seating and free wifi :)", "author": "Christine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Love it love it love it!\nA nice not too big coffee shop serving good coffee. I ordered cappuccino and spent couple of hours reading a book. Warm welcome by the baristas, nice spot to hang out, grab coffee, or to isolate ourselves and work on our laptop. Will definitely recommend this place to my friends!", "author": "Annisa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-23", "description": "One of my new favorite local coffee shops. Unassuming storefront with a friendly vibe. I really appreciated the smiles. And thank you for the adorable coffee art and toast to come back for.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "I walked my dogs every morning to golden gate park and enter at 8th avenue and fulton. One day, I noticed this location was completely remodeled with a new owner. I had a really bad experience with the PREVIOUS owner so initially reluctant to even walk in. On a random tired morning due to lack of sleep the night before and after walking my dogs, I decided to buy a regular cup of coffee from here. One cup became two and two became three. Now my daily routine going to this spot. Basically coffee is very good, friendly staff, clean location and cool study environment with enough charging ports. i can hear the owner, chatting and joking with his employees and every customer that walk in. Kinda cool, it seem like he knows every customer because I can hear him greeting everyone by their names. Try this spot. it is good. I only wrote 3 reviews all these years.", "author": "Hen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "What a great little place. I had some time to kill before an appointment and I found this cafe on Yelp. I was really indecisive and didn't know what I wanted since they have many options that look good on the menu. The young lady working that day was so warm and friendly and helped me pick out what to get. Just when you think customer service is dead she was very nice and extremely patient and helpful. I ended up getting the biscuit breakfast sandwich and the organic ginger peach iced tea and both were delicious.", "author": "Andreea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "If there's a hybrid between Central Perk of Friends and Cheers, Rise & Grind must be it. It's a cafe by Golden Gate Park where everyone knows your name! You have students, mommies & joggers, WFH'ers, police officers, firefighters, you name it. It's a friendly, relaxing atmosphere and everyone's welcomed. The staff is super friendly and I swear they know all their customers!\n\nI live pretty close by to this hidden gem and I can find almost any reason to drop by. I come here when I'm \"working from home.\" I come here when I finish running in the park. I come here before I picnic by the Conservatory of Flowers. Gosh, I even come here on my Safeway runs. \n\nI'm a recovering coffee addict so I've kicked the coffee habit (going two years strong), but even that doesn't stop me from frequenting this joint. I'm always down for a decaf, soy chai latte, or an iced tea. They also have great breakfast and snack items on their menu. I'm a huge sucker for breakfast sandwiches and these folks here know how to make a fresh, hot one.\n\nAll in all, I love neighborhood cafes and I especially love this one. Drop by, order a drink, and let them get to know you too. I bet you won't regret it, and maybe you'll see me there. ;)", "author": "Jeremy F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "A little overpriced in my opinion. The food is pretty good and the selection is interesting. There isn't a lot of places for seating so finding a place to study or work with friends is challenging. Not too many outlets either.", "author": "Kristine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-01", "description": "I love discovering new coffee shops to study at!\n\nRise & Grind is the perfect place to study or grab coffee/quick bite.I enjoyed the home-y feel to the cafe and the decor is definitely pinterest worthy. You'll see Dr. Seuss quotes on the floor. I ordered a latte, and it gave me the perfect boost and energy for my two hour homework sesh! The Belgian waffle was hugeeee and definitely worth the price. It was perfectly crispy and drizzled with the right amount of chocolate. Parking was a little difficult, even in the residential areas. \n\nThere's currently no limit to your study time (not that I know of!), but I can see this place getting very popular. Will be back!", "author": "Fanny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Lovely little coffee shop with friendly baristas and a cute atmosphere! Spicy chai tea latte was pretty good, a little watery but did the job. Chia seed pudding was yummy!! Good seating, sat at the window for hours doing some work. All in all would recommend, not the best coffee in SF but definitely worth a visit", "author": "Lara H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "after a morning walk at golden gate park, we came to this place for coffee.  parking is a bit of a challenge, but we parked by the safeway about a block out and around the corner (you're welcome;) \nthey have so many items on their menu i wanted to try, but we settled on their breakfast sandwhich & matcha waffles.  their matcha waffles were bomb! i just wish that we can add certain sides with the waffle and make it a whole breaky.. their coffee hits just right! a lot of specialty lattes which we happily indulged in (i usually just get a reg coffee w/ a splash of almond milk).  my cousin got a lavender latte and i got a creme brûlée latte- which the barista would torch on top ...its so extra i had to make a video lol. \nthere was a lot seating available, but i can tell this space would get busy.. the staff were super chill, and you can tell they have a lot regulars.  i wish they had a place like this near my house ... loved the vibe.", "author": "Melanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "Dropped by Rise & Grind during one of my visits to Golden Gate Park. The interior is cozy and has a fair amount of seating so you can definitely come in, grab a coffee, and sit down to get some work done. I ordered the avocado toast *minus the egg* and a vanilla latte. The toast and coffee came out at a good pace and I was happy to find that the latte was at a good, hot temperature. Tastewise the toast was good, but nothing great. The thing for me is, if I'm paying ~$9 for avocado toast, I expect it to be somewhat mindblowing or at least something removed from the mundane. However, this was just bread with some avocado and some simple seasoning. Simple is great, but I just felt like there was so much more they could have done with it. My vanilla latte was good, but like I said before, nothing extraordinary about it. This is a cute shop to drop by if you are in the area, but I wouldn't make it my go to destination.", "author": "Lakshmi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "My friend and I came here on a Sunday afternoon. The place was understandably crowded, but for a small caffe there were an awful lot of people just sitting around with empty coffee cups, studying or just doing nothing at all. My friend and I had to squeeze standing into a one-person space at the bar because some girl next to us was watching youtube and nursing a soda. If you have a popular and small place and you're going to ask 'for here or to go', you might want to make sure tweens arent taking up all your space all day. Perhaps establish a time limit, ask people to leave soon after they finish their drink/snack, or at least put up signs asking your patrons to be courteous.\nI got the vanilla latte and the matcha waffle. The waffle was sweet and yummy but didnt taste the first thing like matcha, so if you want just a sweet, green-colored, insta-worthy waffle I suggest it. The latte was also insta-worthy but otherwise unremarkable.\nTo me the place felt like its entire point was aesthetic, with no real hospitality or quality. Won't go back.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Recently decided to have a \"work from home\" day and trekked over to Rise & Grind to see whether they've made any updates.\n\nNow it's five stars! They started putting up some art on the walls, which helps a lot in warming up the space. Service was stellar, as I remembered. \n\nThis time, I finally tried their creme brulee latte. Oh. My. GOD. Tasted like coffee creme brulee. Too addicting. \n\nI also tried their smashed avocado and poached egg on toast. Yum.\n\nThere's plenty of working space as well, so there was a mix of people there, from college students to those living in the neighborhood to those playing \"hooky\" from work (mind you, I wasn't REALLY playing hooky...I was still working!). \n\nHighly recommend.", "author": "Evelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Loved this convenient to GGP and spacious spot. A perfect mellow blend latte coffee will bring me back for some snacks or breakfast and settle in a bit!\nThe dog is... perfect, clean, friendly and welcoming as well.", "author": "Daphne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "This cafe is fantastic, it's definitely our favorite place to go for drinks or food in the neighborhood. The owners, V and V and Brian, are so friendly, they remembered us after our first visit back when they opened and have greeted us by name ever since- and even remember our kids' names! The place is cozy and comfortable and clean, the coffee delicious, and the food menu is really tasty. It's also very inventive- I've never had food like it anywhere else. My favorite combo right now is the Richmond Chill and the Biscuit sandwich. But honestly everything I've tried (which is about 98% of the menu) is delicious. I can't recommend this place highly enough. Love!", "author": "Sophie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "I dig this place. Came here on a recommendation from a friend and I'm happy I did! \n\nThe coffee is great. I like sweet coffee drinks. And this place has a good amount of them. The creme brûlée latte was pretty fancy with a flame torched top etc. but the best is the cookie butter latte.\n\nThe staff is friendly and the space is nice. The resident corgi is awesome. \n\nThe parking is definitely not easy around here but if you are walking by or are in golden gate park, then stop by this place for a tasty latte.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "I went here this morning for a chia latte and breakfast sandwich before working out. It was great and the staff is super friendly. I realized about halfway to the shop that I had left my wallet and was worried they didn't have Apple Pay. When I called them they reassured me that they Did, and was happy that I was still able to enjoy this great place!", "author": "Justine J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Why not get your start from a decent cafe in the area? Not much in the Richmond for good coffee. Soft boiled eggs are a must on your avocado toast.", "author": "aaron t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Neighborhood gem of a coffee shop.  Great service, atmosphere.  Nice selection of espresso drinks (black sesame latte - yum!) and breakfast options.  I had the organic matcha waffle, which was worth trying but slightly over-saturated with matcha powder.  I hope this place sticks around.  I enjoy coming here on the weekends on my way to GG park.", "author": "Annie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "Pretty dang good cappuccino! Came on a rainy week day and it was surprisingly busy. They have a wide selection of espresso and signature specialty drinks, pastries and foods. They have free wifi now! Should've brought my laptop to do work. They have power strips and plenty of plugs to charge your laptop. Music wasn't too quiet or too loud. Very good customer service! The barista checked in and asked how my cappuccino was after I was done. They also have a bathroom which is always a plus for those who like to do work for hours.", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "A hidden jewel and a must try. \n\nLocated right next to the park, it's the perfect pick-me-up location for anytime during day! \n\nPrepare yourself coffee enthusiast. The coffee / espresso is on point. Extra delicious and full of flavor...\nTheir barista's make exceptional Latte Art. Be sure to ask :)  Excellent Photo opportunities ! \n\nA \"little heart\" goes a long way. Thank you for providing a great experience and for sharing the beautiful latte art. Their cappuccino = Exceptional \n\nWe sampled their cold brew coffee. Omgoooooosh... It actually taste like coffee... not like that water downed stuff made at the mainstream cafe'(s). Their brew is full of flavor and can be customized to your standard. Absolutely perfect for a hot day. \n\n\nTry their delicious, freshly made waffle(s). Extra fluffy and crisp on the edges. mmm\n\n\nWarm ambiance and beautiful interior design. Besides the grinding of the beans and hiss of the milk steamers, it wasn't too loud in there. Rise & Grind is perfect for meet and greets AND for grinding out what seemed to be an endless array of emails. \n\nWhat are you waiting for?!? Add this location to your coffee bucket list !", "author": "Jeremy B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-30", "description": "I came here expecting a decent meal and place to work, I was sadly disappointed. \n\nAfter ordering the seemingly only vegan item on the menu (PB&J toast) I was informed that the wifi was currently \"having issues\" and they would let's me know when it was back. Finally my toast arrived, it was cold and had way too much topping smothering the crusty bread. The coffee was sub par and burnt tasting. \n\nWas looking forward to finding a new place to work, but I won't be returning.", "author": "Oscar S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "I would've never thought to create a Creme Brulee Latte, but these guys did, and they deserve four stars for it. They also make a delicious brioche pastry. Plus, it's a delightful spot to sit down with a laptop and get a bit of work done during the day.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "Good coffee, mellow atmosphere. Seating is not very comfortable and tables are oddly placed.   There is one large picnic style community table that was taken up by techies and a couple of laptop bars.\nRight next to 44 bus stop on the edge of the park.  \nI wish more coffee shops had seating that takes advantage of window views by placing window seating facing outwards", "author": "W M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Came here while waiting for a friend to finish a race in the golden gate park. Really nice place with friendly staff. Their avocado toast (with a boiled egg) is amazing !", "author": "Arvind M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "The creme brûlée latte is a MUST TRY!!! :) (Hence the 5 stars)!!! I also had the breakfast bunwich which was pretty good. The bacon could've been a bit crispier though. Overall, this is a great brunch joint.", "author": "Maria V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "Cons\n- creme brulee latte tastes like regular latte besides the burnt sugary top layer \n\nPros\n- wifi\n- beautiful interior\n- good customer service", "author": "Karen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Love this place - def try the black sesame latte and waffles!! Friendly staff and cute atmosphere.", "author": "Janet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "I've been contemplating for awhile about Rise&Grind. You know that place we call \"Home\" that's also in SF? If you can't find a drink at Home, which I cannot - start your \"I need something to wake me up\" morning or anytime of the day with Rise&Grind. I'm talking about creative drinks you can actually taste the espresso, not flavored milk (ahem* Home). If you're a fan of mochas, do yourself a flavor and get the Whopper Latte. The heat from the steamed milk softens the Whopper ball crumbles and it's pleasant. Sweet but not too sweet, strong, flavorful, bomb!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "This brand new spacious coffee shop is conveniently located right by Golden Gate park. The store has floor to ceiling windows and the natural morning sunlight is very welcoming!\nThey serve Mr.Espresso: you can get all the standard espresso drinks plus cream brûlée latte!!! We also had the Chai: the aroma was delicious, for a moment the whole area smelled like chai:) I had the Golden gate blend, I usually take my coffee black and it was a perfect morning caffeine boost. \nThe place has several tables and sitting area by the windows, so you get some rest after long walk in Golden gate park. Apparently they will get Wi fi eventually: as for now make a friend with a person sitting next to you! We were sitting next to a couple visiting SF and we gave them some tips about the neighborhood.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "I came here after seeing some amazing latte art through a friend's Instagram. Ended up coming during my short lunch break from classes and the barista here went above and beyond in customer service! \n\nMy friend who came with me wanted a more substantial lunch, so I had to get my latte to go. I asked the employees if I could possibly still get latte art on my drink even though it would have to be in a to-go cup, and they said yes!!\n\n I requested a penguin, and they did such a fantastic job that I just had to write a review. Despite ordering a simple vanilla latte, the barista even came over and asked me if I was allergic to chocolate before adding it to my drink for the art. \n\nOverall, it was such a positive experience; I am completely blown away! Hopefully they will add more food options in the future so that it can be my one-stop for lunch. I will be coming back more in the future!", "author": "April T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Came here on a Saturday afternoon after seeing pictures of this place on Instagram. \nIt's a super cute little coffee shop, lots of ppl at work on their laptops, cute art/decor, and for sure looks like a good place to post up and get some work done.\n\nI had the avocado toast and soy sea salt caramel latte - both delicious! \n\nThe toast is on a fat piece of bread - really it's quite simple, just avocado, a gooey egg, and crushed red pepper -- however, it cost almost $9. Extremely pricey for what you are getting, hence the 4 star! \n\nCoffee was perfect temperature and not super strong (which I prefer), no complaints there!\n\nStaff is also super nice and friendly, always a plus!\n\nWould come back to do work and try other unique items like the Ube waffle! Only con is the price.", "author": "Doreen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Skilled baristas, Pinterest decor, and welcoming service. \n\nQuality cup of coffee. Their cold brew actually taste like coffee and not iced water + milk like most places. \n\nEverything you can ask for in a coffee shop.", "author": "Napoleon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Coffee is freaking delicious. It's a small cozy place and the staff are super nice. You'll always hear a loud greeting once you walk in the door (even if they are behind the bar). It seems they remember their customers quite well because I've heard them greet different people by names and even ask about their lives. I love it when shop keepers do that. \n\nthey have Dr. suess quotes around and it's decorated simple but yet playful. \n\nparking can suck but if you get to make it, you'll be glad you did. it's right across the golden gate park too. \n\nI really like this place. Swing on by if you get a chance. \n\nthey also have great pastry; sweet or savory.", "author": "Leme K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "Needed an afternoon pick-me-up and stumbled upon this place. Minimal look with local artists' work on the walls. Friendly staff and the best coffee I've had in quite some time. AMAZING salted caramel latte! Not too sweet with a great taste. And the latte was the perfect temperature. Hit but not so much so that you couldn't enjoy right away. If I lived here I'd go back all the time.", "author": "Shannon F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "Found this place on Instagram and so glad I did!! I sat there for 5 hours and they were super nice, talked to me, and even let me sample a new drink they were testing. The place is super well-decorated with funny cartoon art and some Dr. Seuss quotes on the floor. They even had a Dr. Seuss book that they let a kid borrow :)! \n\nThey have the usual gamut of espresso drinks with a really cool crème brûlée latte. They make the latte, add a bunch of sugar, and blow torch it!! It was so cool and he was nice enough to let me snapchat it. The baristas were really nice and friendly.\n\nThey have a few pastries and waffles. They said they will have wifi and savory toast soon so what more could a girl ask for?", "author": "Kate T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "This is a great little spot just a few steps out of Golden Gate Park on the north side.  Coffee drinks are well done..Capuccino, Late', etc.  Real nice people.", "author": "Dennis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "I just discovered Rise and Grind! I've been on a small hipster coffee shop rampage lately, and this cafe did not disappoint! It's only a couple blocks away from Golden Gate Park and all the museums that are located in it! \n\nThe service is really great and everyone who works there is super friendly. They also have a neighborhood pupper and the pupper is adorable! From coming in today, I can definitely tell that they have a warm ambience as there were many regular customers who would come in and greet the baristas! It's like a small family here. \n\nThis is also a very good place to work. They have wifi and multiple chargers everywhere. I guess that's why it's called Rise and Grind right? Hehe.\n\nHere are the things I tried:\n\nCookie Butter Latte: I really liked this! It definitely had that strong Cookie Butter taste. The only thing I would say is that it gets a bit heavy after a couple of sips and you'll need to stir ur drink if you've been letting it sit for a while. \n\nCorn Toast: I loved this toast! It was super packed with sweet corn on top and meat and it was a great balance. You're definitely left feeling extremely satisfied after a coffee and a toast. \n\nOverall, I loved this cafe. I'm definitely coming back really soon. Thanks for the great coffee and for being such an aesthetically pleasing and wonderful cafe! I was definitely in the mood to Rise & Grind.", "author": "Marissa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "great coffee.\ngreat ambience.\nokay customer service ( they forgot my order once and have such difficulty saying my name right), but they are pretty nice.\nnot much food options especially for vegetarians but the ones exist are yummy.", "author": "Helia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Very cute and clean and bright. The workers were really nice and friendly. I did some work and forgot my headphones but the music was really good anyway. I got the vanilla latte with almond milk and it was really nice and smooth. Overall I loved it!", "author": "Bethany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Awesome selection of beverages and food. I only tried the coffee, but they have several unique flavors and the biscotti butter cookie iced latte was awesome. Such a sweet find!", "author": "Scott C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "I absolutely love this place. \n\nMy boyfriend showed me this place because he lives around the corner and he's now a regular. \n\nSuch a quaint space in a perfect location across from GGP and if you walk in some people are sporadically studying or just having their morning coffee. \n\nCoffee is always done spectacularly and the Frittata sandwich is to die for! So many ingredients and it comes with potato chips, I've also had their avocado toast and the egg on top just makes it so addicting! \n\nStaff is not rude and so welcoming every time you go up to the counter.", "author": "Briana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Good coffee and REALLY good atmosphere. The staff was friendly and talkative. Good vibes fam.", "author": "Lucianne C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "i always spend one of my days off in a cafe to work on personal projects and rise and grind is by far my favorite one. it's in a good location near my apartment and there's always space for me and my laptop. the baristas are always very welcoming and watching the steady stream of customers they seem to know a lot of them! the drinks are pretty consistent and very tasty. i often get the mint cold brew or creme brulee latte. the food is good too--love the waffles! the wifi is pretty fast and holds up for what i need to get done so i have no complaints. there's ample seating and outlets. love how open the space is even if its a smaller cafe. the large windows let in a lot of natural light and opens up the space a bit too. \n\nbig plus is cori the corgi makes an appearance every so often. the cutest pup around! happy to give cori belly rubs at any opportunity!", "author": "Alison M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Super cute and cozy cafe in the Richmond. There's parking if you know where to look and/or willing to walk a bit. The cafe is a bit small, but there were enough seats which is good to sit around in and catch up with a friend or do a little homework. The decor is adorable, with positive quotes and comic book pictures. The owners and staff were super friendly too!\n\nThey use Mr. Espresso coffee from Oakland, which I hadn't tried until I came here but tasted solid. The menu is a little sparse, but their toasts all taste really good. Looking forward to coming back!", "author": "Michelle Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "Super nice staff and the creme brûlée latte I had here was delicious. The wifi was fast and they had ample seating. It wasn't crowded when I first got here so my experience here was great.", "author": "Natasha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "Super friendly service and chill vibe. Incredible Bunwich breakfast sandwich!  Coffee drinks are pretty good - not as fancy as a blue bottle and milk isn't organic, but overall good quality and good foam in lattes etc. They have lots of creative drinks that I haven't tried but I see others order them all the time.", "author": "Gwen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Very cute coffee shop just by the entrance of Golden Gate Park! Great place to stop by and grab coffee before a walk in the park, get your laptop and work, or chill with friends for some bites and coffee. They don't only make good coffees but their frittata sandwich is so so so so goooooood!", "author": "Ugur O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "Perfect neighborhood coffee shop with the friendliest staff! I live a couple of blocks away and love coming here to study while enjoying a great cup of coffee. They also have amazing snacks that complement their coffee really well. If you're in need of quick pick-me-up or just need a place to chill/study in the area, there's no better spot!", "author": "Derrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "This is a really cute coffee shop in the inner richmond. If you want to try something different go for the peanut butter latte. It's a friendly, casual place, but don't expect that you'll definitely get a seat, it's small.", "author": "Holly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Love this little coffee shop next to Golden Gate Park! Their staff is super friendly and greets you when entering the door. I tried the whopper latte and it was delicious! I will definitely be back to try their pour-over brews and pastries.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "I'm a local and live extremely close to this place, and I LOVE it. I'm going to be as concise as I can get with this review:\n\n- Great place for studying with lots of outlets, lighting, music, and mood.\n- Great coffee and tea\n- I have an addiction to the avocado toast - it's literally to DIE for.\n\nThe owners Vi and Vi are super-chill as well. If you need your caffeine fix and a place to study or hang out, Rise & Grind is the place. And do yourself a favor and treat yourself to the Avocado Toast, you won't regret it.", "author": "James V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Cutest latte ever!!!! One of the baristas is a superstar latte artist - request an animal and you will not be disappointed. I can't wait to return!!", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "I love this place and will be coming back forever. The coffee is absolutely delicious, the people who work there are fantastic and kind and attentive. The atmosphere is wonderful.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Best Coffee place in the Richmond. Their costumers service is excellent and always good vibes all around. I have tried almost everything in the menu and everything is delicious. I would recommend this place to anyone who is around the neighborhood. They are pet friendly too!!", "author": "Jose C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "Creme brulee latte was expertly done. And their matcha waffle was an elegant classic. On a sunday midmorning, it was packed. Kinda pricey, bur worth the splurge for great and creative coffees.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "I have a Saturday tradition where I go to a different coffee shop in that city and work on my side projects. This week I went to Rise & Grind. The atmosphere could use some work as far as creating some warmth, maybe more art on the walls? I donno, just kinda felt empty rather than comfortable. They had plenty of seating to work, which was very appreciated. I'm not a big coffee snob, but the coffee is good. I always look for a coffee shop that has food options and they had some interesting things on their menu, including the Matcha waffles. When I saw that I had to try it. It was good and something different, as well as satisfied my sweet craving. Over all its a nice neighborhood coffee shop.", "author": "Nikki H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "Came across this place and was so excited to try it. Very disappointed. My boyfriend and I ordered the matcha waffle, the girl got our order wrong and gave us a snooty attitude saying she \"heard Belgian.\" The waffle was ok, gave us very little syrup so it was a bit dry. We got the mint cold brew which was good, not too minty but still had a hint. The service was very upsetting we got such snooty vibes from all of them. Prices are ok. We will not be going back.", "author": "Jasmin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "I too like me many I saw tried the cream brûlée latte and very much enjoyed it! The place is small cozy and yet has some rustic San Francisco feel as well I love. Everyone would want to live here if you could afford it! This is like blue bottle cafe yet not quite as good of service I experienced. I will come back when I'm the city and you should as well!  They have traditional pastries and some breakfast items that looked good but I did not try!", "author": "Brian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Two words. Totally SF. This place is the epitome of San Francisco, with its urban neighborhood, exposed concrete walls, and arrangement of wood and chalkboard painted walls. Rise and Grind deserves my notable five-stars as they are committed to great service and equally great coffee. Though the prices for their food is on the higher end, their lattes are totally worth it and I would personally recommend the Biscoff Coffee Butter Latter.", "author": "Karissa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "This is a great joint in a place that has been lacking coffee options! We swung by after a visit to the DeYoung Museum, and were pleasantly surprised!\n\nDecor/Ambience: This place is the epitome of new San Francisco. The stark white walls of this small shop were covered in art riffing on Microsoft Word, lots of exposed concrete beams and wood grain furniture. That said, it worked for me - it felt quirky without being contrived and cool without being pretentious. It didn't look like a super cozy place to set up on a laptop and do work, but it was cute to sit and have a quick coffee.\n\nDrinks: We didn't have any bites to eat (although they looked yummy, with standard SF pricing,) but I was very satisfied with my hot beverage! I ordered the Chai Latte, and was offered a sweet or spicy option. I chose the spicy option, which tasted of fresh ginger and was delicious! My friend got a mocha which he said was solid. And, the prices felt super reasonable, especially considering that each drink was made to order (I think my chai was brewed to order? Not actually sure...but it was definitely not a standard mix!) The wait was a little long, but not unreasonable.\n\nOverall, a really nice spot to pop in and grab a drink to go whilst meandering GGP or escape a cool gray day and warm up with something tasty!", "author": "Alex F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-03", "description": "I stopped in here yesterday on the way to the De Young for a quick cup of tea.\nI know they are still in 'just opened' mode but ordering was a little chaotic - there was a woman behind the counter who did not acknowledge I was there, and then another woman came up and was about to take my order but she got distracted by someone, so a third woman took my order.\nTheir menu says they serve loose leaf tea but actually it is Mighty Leaf - in a tea bag.\nHad I known that was what they served I honestly would have gotten something different, because I don't like Mighty Leaf.\nThey don't have as many tables and chairs as Cafe Muse did, and the space didn't feel quite finished.\nI hope they do really well, and I will definitely give them a second chance again soon.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "Incredibly disappointed with their customer service. We came in for 2 coffees and a chia seed pudding.  They forgot 1 of the drinks and when we asked for it, they still took a bit of time making it and putting other drinks out in the meantime.  The iced coffee came in a hot cup, when I asked for an iced cup with a lid, because we were on the go they, said sorry we can't.  They would simply not give me an iced cup, even after purchasing two drinks, food and waiting for a long time after they forgot about it in the first place.  The drinks were great, chia seed pudding decent, but the customer service is terrible.", "author": "Stephanie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "This place is LITERALLY unbelievable and has the best coffee EVER and much better than the phoney Siteglass or overpriced starfucks! I love this place and I go here every single dingle day.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Say and worked for a few hours in the morning.  Plenty of plugs, good coffee and a Belgium waffle.  Smiles behind the counter were a plus!  I'll be back.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "This new coffeeshop is quite the jewel of the Richmond district. The moment I walked in the owners and workers greeted and welcomed me, which is quite important as first impressions really set the tone of a cafe experience. \n\nThey serve Mr. Espresso coffee beans, which I heard is roasted with oakwood. Clearly they know how to utilize and sell a quality product because their lattes are each individually, uniquely, skillfully, and deliciously-made. Co-owner and barista, Vashelle knows how to make a mean cup o joe! \n\nThe other guys who own and work there are really friendly people too. Brian and Vananson both always seem down to have a chat and get to know their customers. You can really tell that they are passionate about not only what they sell, but also the surrounding community; fundamental in order for them to learn how to better serve the neighborhood.\n\nIf you're in the area, don't hesitate to stop by, say hello, grab a bite to eat (they serve waffles, WAFFLES!!!!) and have your coffee and your day made.\n\nP.s. They have an awesome picture of the justice league members hanging out on the wall. Superheroes ftw!", "author": "James W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Love this fantastic neighborhood spot.  Espresso is bold, service is super friendly, and options unique and delicious!  So glad they opened!", "author": "Megan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Amazing!! I had the Iced Whopper Latte and donut muffin! It was heaven!! Definitely would recommend. And it wasn't crowded at all on a Saturday morning which is a HUGE plus!!", "author": "Krystyna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Great coffee, friendly staff, clean. I might have a new favorite local coffee joint! Thanks!", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Rise & Grind is without a doubt the best coffee/tea shop in the Richmond District quite possibly in San Francisco. Everything on the menu from the food to the drinks is delicious, but it's all also uniquely one of a kind. I live down the street from Rise & Grind and couldn't have been more pleased to have a local coffee spot with great food and even nicer employees open when they did a few months ago. They have a variety of specialty drinks like the creme brulee latte, cookie butter latte and their newly added Richmond chill, which is their version of Vietnamese coffee with espresso and condensed milk shaken up in a cocktail mixer. If you're not a big coffee drinker I highly recommend the London fog.\n\nI've tried almost all of the food items and have to put the Avocado Toast at the top of the list; a delicious thick piece of toast topped with a nice hearty spread of fresh avocado, red chili flakes, and a soft boiled egg. It will surely leave you full for hours. The breakfast biscuit is another one of my favorites as well as the Pesto Toast (AMAZING), but their variety of waffles if especially delicious and one of a kind. My favorite is the Matcha waffle. Try it, you're taste buds will thank me.\n\nAlong with all the great menu items, the environment and staff are something that makes Rise & Grind especially enjoyable for me. The owners have gone out of their way to put local artists work on the walls and the business has a number of regulars you'll often see every time you go in. There's a great communal and hospitable vibe that keeps me coming back for more. To add to all the greatness of Rise & Grind, there is Cori the corgi, the resident dog who sets up camp at the spot every day and greets customers with a big smile. He's always willing to be played with and adds to the greatness of the baristas. If I could, I'd give Rise & Grind 10 stars but Yelp only lets me give 5. This is a must try coffee spot if you're in the neighborhood or go through this part of town.", "author": "Niko L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "This spot is another one of my favorite coffee shops in SF. The employees are all so welcoming and all the coffees (drip, mocha, latte, etc.) are so delicious. In addition to the coffee, this spot has a breakfast menu that has really delicious toasts, sandwiches, and waffles. And if you get lucky, you might meet Cory the corgi who just brightens up your day with his cuteness.", "author": "Tina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "Cute little place good for some casual reading time but the drinks and food items were a bit underwhelming. My black sesame latte lacked flavor, the coffee was a bit sour, the matcha waffle didn't impress my son at all. The avocado toast was okay. Too bad. I am always on the hunt for good local options but this one definitely did not stand up to the 4.5 stars on yelp.", "author": "S L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Great little coffee place with friendly staff\n\nGot the following:\n\nCold brew: 5 stars, pure coffee taste without any sourness or bitterness\n\nSpicy chai tea latte: 5 stars, love the extra punch of flavor from the ginger\n\nWill be back!", "author": "Hazel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "I'm writing this in the full knowledge that they are only newly open and still finding their way. But while i understand they may be new to the coffee business they give the distinct impression that they have never even been to a coffee shop as a customer either.\nFor example, they have only one size of coffee cup for take out. (Small) At $2:75 a pop this is pretty steep.\nThey have a choice of only white or brown sugar, no sweetener nor sugar supplement, like so many others i am diabetic and i take Splenda in my coffee, raw sugar is a health hazard for me.\nI am really happy to see a new business open. The staff seem very friendly and capable and i wish them all the best in the future, just hope they can make these small changes soon.", "author": "Paula M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Loved this cafe in the Richmond. I got a London Fog hot tea which was AMAZING and the avocado toast which was also mind blowing. Positives: drink was great and sweet, toast was on really soft brioche like bread (nice and thick), avocado was super fresh, egg was just the right amount of soft. Negatives: the tea comes in a tiny cup so you are paying like $4 for an x-small drink (done in 3 sips) and they don't have a \"large\" option only 1 size. Toast is $9. My entire order ended up being $17 with tip and tax which seems steep for a coffee shop. But wifi is good and nice baristas.", "author": "Brenda I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "To say I've been here a few times is an understatement. The staff is always warm and welcoming. The black sesame latte and the cookie butter latte are my favorites. The corn toast is my favorite food item and my friends love the avocado toast. Great spot to study, do a little work, catch up with friends, and people watch. Check them out!", "author": "Brendon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "Finally, a legit coffee place in the Richmond district! I got a regular cappucino and my girlfriend got the creme brulee latte. The cappucino was smooth, nicely pulled, and she wrote my name on the latte art :). The creme brulee latte is a sweet latte with a hard sugary coating on top, like creme brulee. The barista actually used a blowtorch to caramelize the sugar after she poured the milk. Will definitely be back again to sample their other drinks and pastries.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Good spot for decent coffee and a quiet hang out just feet from the greenery of golden gate park.  Friendly, interested owner operators.  Light, airy room with various small seating areas and wifi.  \n\nCoffee by Mr Espresso, an older Oakland roasters using oak wood to roast; not your usual grassy, bold new-SF roast. I'm used to the newer blend so found this well-rounded and definitely satisfying, but nothing adventurous or unexpected.  This is the style the operators said he is after so kudos to him; many will enjoy it fully. \n\nHad banana walnut cake.. a bit expected and wouldn't repeat. \n\nOverall a solid 4 spot.  Would definitely come here again, an oasis is an area of not much going on, handy to the lovely park. Good stop on your way to or from  the bridge.", "author": "dean b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-02", "description": "Went to this spot 2 days in a row in my 3 day stay in San Francisco. It was close by to our air bnb and seemed cool. The first day my friend got iced mocha and I had a soy chai latte .. both were good. The next day was as if it was a totally different place. My friend got a vanilla latte this time and I got the same soy ice chai latte ... the soy chai latte tasted like a Luke warm cup of soy milk. The latte was okay, but not worthy of a repeat purchase. \n\nWe also had the Belgian waffle which was dry and barely had anything on it  .. they had no syrup. When I asked for syrup the girl said \" we don't have it.. that's why we put the icing on it\".  Which would be fine! If there was enough of it. \n\nBut, my biggest issue with this place was their effort to be hip and cool ... being met with not a single vegetarian / vegan or progressive food option ... there is pepperoni on one of the menu items and this to me is just careless. They serve their iced dine in drinks in mason jars ( all the rage) but their avocado toast has hard boiled eggs on it ( a usual safe vegan option) \n\nOverall this place doesn't seem consistent. To go two days in a row and have a completely different experience the second day is concerning. Also, get some vegan options... this is San Francisco and it's 2017.", "author": "Vee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "This coffee shop is a breath of fresh air in the Inner Richmond. They have an avocado toast to die for, as well as creative lattes and tasty cookies. The owners are super friendly and really make an effort to get to know you. This has become a regular go-to spot for me and a place I take my friends whenever they visit from out of town.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "I ordered a creme brûlée latte and it was not as good as the one that I had during my previous visit, but the owner heard my comment and offered a bacon beer muffin and a strawberry muffin to make up for it. There is no question that the customer service here is amazing. Highly recommend.", "author": "Queenie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Great atmosphere, phenomenal iced coffee, and friendly staff.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "Get the creme brulee latte!! I got it with soy milk but it is really good. They use the blow torch to burn the top of the drink. It reminds me of the creme brulee at LA Mill.  Cute location right by Golden Gate park and Fulton Street in the Richmond district. Cute tables and chairs. Parking may be a bit hard as there is nothing much (other stores, etc) in the area so its all residential but you may be able to find a spot along the park on Fulton Street. I had to park a few blocks away near Safeway. I am looking forward to going back and trying other specialty drinks.", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "Such a great find! Rise and Grind is friendly, inviting, warm and oh so close to the park. I was greeted with cute decor and all smiles from the baristas when I journeyed in this AM to avoid the typical Saturday brunch chaos. I tried the creme brûlée latte in a cappuccino size and I was very pleasantly surprised by the unique texture on the top. The espresso was extracted very nicely, it was evident throughout the drink. It was followed with a perfectly poached egg on the avo toast- and pizzaz of red pepper flakes. I was reluctant to even leave for my walk in the park. I can't wait to try the rest of the menu! Get there quick before the rest of the world find it!", "author": "Abbie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "They opened just two weeks ago. On this rainy/ gloomy day, I wanted to have a cup of latte to make my day complete. I stopped by this place since I live in the area.  Very cute, cozy inside. The staffs were so chill and friendly. I'm definitely coming back for studying.", "author": "Mona E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "Cute coffee shop, very cozy, yet spacious and inviting. The owners are very personable and downright adorable! I recommend trying their creme brûlée latte!yummy", "author": "Nerrissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "They made a shiba in my latte! That's some skills right there. I've never had anyone make anything cool in my drinks. Definitely coming back to see what else they can do. Maybe they can make my face on my drink next time", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "This new coffee house is awesome. My wife and I came here and got an Organic Seven Bridges pour over, a cold brew, and the avocado toast. \n\nThe coffee was excellent. Balanced, flavorful, and not sour or bitter. The cold brew was equally as good. \n\nThe avocado toast really stole the show though. It came out on 1-inch thick pieces of toasted white bread with an avocado spread that reminded me of deviled eggs (I think they whip the avocado with mayo and some light mustard seed) and a perfectly cooked soft-boiled egg. \n\nThis place also gets top marks for customer service! They were super friendly with our pooch, giving her treats and they were friendly and engaging during and after the transaction. \n\nOverall, we love our new neighborhood coffee shop. We will absolutely be coming here regularly.", "author": "Connor O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I was drawn into this place by the cute honey bear sign out front.  It's located in a quiet area of the Richmond across the street from Golden Gate park.  The inside is bright and happy with local art featured on the walls, the staff is friendly and the coffee is great! I'm so happy I found this little gem because the Richmond is lacking in great coffee shops.  Definitely recommend coming here and am looking forward to going back.", "author": "Shelby N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "This is a cute little coffee shop right outside of Golden Gate Park. My friends and I came in here because we had some time to kill before dinner and thought we could use a cup of coffee. As we stepped in we noticed the clean eclectic look, and the walls dotted with art for sale- assuming these are local artists. Anywho there were two people behind the counter and both were equally friendly. They helped us order and they talked to me about a lot of local sushi spots since they overheard that's what we were having for dinner. The two were very pleasant and helpful. We al ordered coffee from the specials menu, including a creme brûlée latte, salted caramel late, and a whopper latte. All the drinks were delicious and served adorably. Glad we came in, definitely worth it.", "author": "Anum A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Absolutely love Rise & Grind! I've been on the hunt for the perfect cafe to study: somewhere not too loud, a chill environment, and most importantly great coffee. \nRise & Grind has gone beyond my standards! It's a great place to study as, on a weekday, it doesn't get overwhelmingly loud and busy. They also keep their music at a lower volume, so it's a nice place to read. The environment is always clean and there's a good amount of tables to sit and chat or like me, set up your laptop to study. \nI have yet to order any of the food or fancy lattes, however, I do get the cold brew and it's very good and strong!\nIf you are a huge dog lover like me, the owners bring in their pet Corgi named Cori who is adorably friendly and minds his business. Also, the staff is incredibly personable. I've noticed that they greet every customer that comes in and asks how everything tasted before you head out, a rare experience for a coffee shop in the city! Highly recommend whether you're looking for a drink to-go, to get work done, or for a conversation over some good coffee with a friend", "author": "Tricia Angela L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "Peanut butter latte & the Belgian waffle are to die for!! I liked that the cafe is spacious and doesn't feel like everyone is on top of each other. Great atmosphere and service, and love the corgi puppy :)", "author": "Lindsey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "I heard they had peanut butter lattes... so I had to stop by and try one. I was more than pleased with the latte and thoroughly enjoyed talking to the two baristas (owners I assume).  They were very knowledgable about coffee and the roasting procedures and shared some fun history of their coffee (Mr. Espresso) roaster. They also have Devil's teeth biscuits, which is really nice for us who live a tad too far in the richmond to make it there on a regular basis. I love this place I can't wait to negate future work outs here.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "This place used to be known as something else and OMG it was terrible before! Now that it's changed to Rise&Grind, it's MUCH BETTER! The workers are always extremely friendly and, as someone who is very indecisive, they never put pressure on me to hurry. The place looks kind of hipster, but it definitely feels like the old SF (friendly, unique, dog-friendly, and makes everyone feel welcome). The waffles seemed to be a MUST-TRY because every time I go in I see people eating them. I decided to try one of their waffles and it definitely is pretty tasty. My only complaint is their coffee sucks (ironic, isn't it?). Yes, their coffee is terrible. A $4 cup of cappuccino was extremely small and tasted like bitter water. I've also tasted their cold brew and that tasted exactly the same (like bitter water). The coffee is definitely not good, but I leave them a tip anyway because the service is that good. So, if you can, come and chill and order some food...but you may want to hit up some other place for a coffee. Or do what I do, go back home and make Viet coffee.", "author": "Cathy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Really nice service. Great quality products and awesome sandwich and snack options. Wish more coffee places could be like this one.", "author": "Arik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Awesome coffee and cute corgi to pet. Very nice owner. Will be back.", "author": "Ben G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "This is a small but notable cafe on the edge of Golden Gate Park in a residential block. It was popular and the coffee was good. The barista cared about pouring a good cup. Lovely spot to start the day.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I was staying at my sister's around the corner and found this place on Yelp. What a find. I had the breakfast sandwich. Delicious!  The flavors going on in this tasty bun were unlike anything I've tasted on any breakfast sandwich. And the bun they put it in was warm, crusty, and a perfect choice for the tasty ingredients inside. Can't wait to come back. Oh, and coffee was great too!", "author": "Anne T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-05", "description": "I recently visited for some breakfast. The coffee was OK but small and bitter, I had an Ube waffle order... it wasn't very good, and really pricey. But the thing that was really annoying was, while surveying the menu, the lady behind the counter kept looking me and my girlfriend up and down in a judge-y way. I'm not sure why... I made sure nobody else was in line waiting while we looked at the menu, just to be sure we weren't holding up a line. I won;t be going back.", "author": "Ara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "Great neighborhood spot to grab well-done coffee and some good food. Has internet, so many people are there working on laptops.", "author": "Kayla G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "This plc has become a regular weekly coffee spot for me and I don't even live in the Richmond. They have super creative drinks like the whopper latte that's delicious and it isn't made too sweet. I also like their take on avocado toast.", "author": "Kristy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Friendliest owners and baristas around! Haven't had a snack or a drink that I didn't like. The quality of the coffee and ingredients are all exceptional. This has become my go-to cafe: wifi, easy-to-find parking, right across from GG Park... what more can you ask for?", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "I love this place. The coffee is delicious and unique. Especially the whopper latte! The staff are very nice, a couple times coming in and they'll know your name. The place is very cozy and the perfect spot to study. Also, if you're a dog lover so many dogs come in. Rise and grind is definitely a place to try.", "author": "Scarlett M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-10", "description": "I live in the neighborhood and hadn't realized this place changed ownership. The interior had a remake--an attempt at industrial chic--but came across cold and unfinished-looking. I ordered a breakfast sandwich and it took 30 minutes to make it. They told me it took so long because they forgot the egg. [There are only three ingredients in this--egg a pretty central part of the sandwich]. Would not go back.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "I work in the park this is the best coffee greatest eats. What they call it \" sweet and savory \", I love the staff and the atmosphere. PS I love Cory The Corgi", "author": "sid s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Really love this place. They make delicious lattes and avocado toasts and they a cute corgi puppy. So adorable.", "author": "Vivienne W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-22", "description": "I was hoping to add this place to my routine, since it's on my morning route and often has a parking spot out front. But when I stopped in, I was underwhelmed. They don't have the things I need in the morning. Only one size of house coffee--not big enough!  Their menu is full of twee coffee drinks and precious little things to eat but everything has to be made for you and the basics are missing.  No bagels to grab, no coffee self-service.  Also, the staff was neutral and matter-of-fact rather than friendly or accommodating. If you want to pay too much to be waited on in the morning, rather than a quick toasted bagel and a hearty house coffee, it's clean and accessible at least. PS the coffee is really bitter.", "author": "Lorelei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "The biscoff latte is really good!  I also really like their breakfast sandwiches and strawberry muffins.  They know how to treat their customers.  A few times our food was delayed to come out and they will apologize and give us a free muffin.  Top notch.  My only gripe is the location and parking.  Great if you live nearby but if not then you may need to drive around a few times until you find a spot.  Dont let that stop you tho, this place should not be skipped.", "author": "Tony Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "While it may be overpriced, their coffee and food will not disappoint. It's my first time here and I got the biscuit cookie butter latte and the breakfast biscuit sandwich. The latte was just right, it wasn't too sweet. And the biscuit was really good too with really fresh avocado.", "author": "Alejandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "This is our go to cafe, just a few feet from my house with the kindest service! The owners, V & V are fantastic and the food is awesome!", "author": "Breee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "SF is full of great coffee shops and this one is no exception. It's a great place to study/work and get a really delicious drink. I've only had the americano and the mint cold brew so far but I'll definitely be back! Super yummy toasts and their pastries looked great. Extremely friendly staff. You won't regret coming here!", "author": "Kylee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Amazing coffee and a great spot to grab a breakfast bite!!!! Super friendly owners too!!!!", "author": "Aron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "The most amazing coffee shop in the city.. and dog friendly. Great coffee, incredible food (get the avocado toast) and the service is out of this world. So happy to have this place in our neighborhood!", "author": "Maggie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Have to add to the other 5 star reviews here. Rise & Grind is definitely the perfect neighborhood coffee spot to catch up with friends or get some work done and has become an instant hit; it's also a great place for people enjoying a day in the park to stop and grab a cup of something delicious. The coffee is strong and the latte flavors are inventive and irresistible (try the biscoff flavor for sure!). The food menu is limited but tasty (especially the breakfast sandwich, which, sadly for the waistline, is both insanely good and very addictive). High praise to the wonderful ownership, especially Vi. He and all the baristas, know every single customer by name and make them feel welcomed and at home as soon as they set foot through the door. Love this place!", "author": "Nina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "this place is great. you can pop out of the park for a quick coffee and waffle. the staff are super friendly and it's nice and cool.inside out of the sun.", "author": "Alla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Amazing neighborhood coffee shop. Calm atmosphere and unique/tasty menu. If you haven't been yet you gotta get out there.", "author": "Lydia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-09", "description": "Disorganized, undercooked food. Lots of things on the menu that they don't actually have. Run by inexperienced kids from the look of it.", "author": "SF R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-08", "description": "This place is near where I work.  I come here about once a week.  The folks seem friendly and the atmosphere is relaxed and open.  They have some graphics and art on display, and I believe they're open to local artists contributing their pieces for ambiance and possibly sale.  \n\nI haven't had a chance to sit and try some of their food items so I can't give a full review, but this is a solid place to grab a hot beverage and maybe chit chat with folks.", "author": "V. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Adorable little coffee shop with ample seating and the most friendly owners! Plus they are always playing country music or NSYNC. So basically I love coming in. I tend to stick the the usual cappuccino or latte but I'll have to try some of the specialty drinks after reading other reviews!", "author": "Amanda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "The creme brûlée latte was amazing and the pesto toast was also really great. Right next to golden gate park so that's also a plus. The staff was extremely nice and it's a great place to get some work done.", "author": "Vicky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "Stopped in here one day after just noticing that they opened (two weeks prior), \nhad one of the best lattes.  I was truly impressed, came back again the next week and was able to sit inside this time, I loved the atmosphere, the wonderfully friendly people that work there (owners) and their beverages!", "author": "John M H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-05", "description": "I was looking for a place to grab a quick bite with my kids after a visit from the Academy of Sciences. I ordered the avocado toast with no peppers and the waffle. After what seemed like a long wait, the toast came with peppers. I didn't feel like waiting another 10 mins to have them fix it. I ended up eating the toast as my kids didn't like pepper so they ate the waffle. Overall, I would probably not order the food again. I did get the drip coffee and it was good and strong.", "author": "Jen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "Great place to study! I've tried the London Fog, maple scone and creme brûlée latte. All excellent accompanied with friendly service.", "author": "Breanna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "Great to see new coffee & tea shop in Inner Richmond.  Opened 2 days, still setting up & excited to be offering waffles in couple days.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "I stumbled across this spot on my way back form after leaving another coffee shop due to poor internet connection...the spot is quaint and quirky...Dr. Suess left a quote on the floor as you walk in, local artists are welcomed to decorate their walls with their work, the bathroom is clean and smells good, AND the coffee is DELICIOUS. Aside from its charm and tasty Mr. Expresso coffee, the staff are warm, friendly, and welcoming. So lucky to have this spot in my neighborhood!", "author": "Jessie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "I love to study and do homework at coffee shops but it was always a pain having to walk so far from my apartment to reach a coffee shop and most of the time it's crowded with people which is really annoying. My sister recommended this place to me since it's close to my apartment. I love how the place is super spacious and tastefully decorated! It gives off a simple and cozy vibe. I ordered an iced vanilla latte and it was served to me in a cute mason jar. I think this place is perfect for students like me to study and drink delicious coffee while at it! Will definitely be going back", "author": "Anelise T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Ordered a latte and was rewarded with two cute cream kitties sitting on top of the coffee. I was very charmed. Hope to see good things from this place! :)", "author": "Ruwen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Love this place. Great study spot with strong wifi, delicious coffee and snacks, and a cute corgi!  The workers are also really friendly!", "author": "Priscilla Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-18", "description": "I come here randomly because it's right where I can transfer from the 5 to the 44. It has a nice atmosphere and a lot of people are relaxing on computers and reading. The menu has a lot of unique flavors. The coffee is alright but it's always barely warm when I receive it and the strawberry banana muffin was exciting but ended up being chewy and not too flavorful. They're never very crowded when I come in but I always end up standing around waiting for someone to notice I'm there/to answer me. I've gone a few times for convenience but not much else.", "author": "Laticia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "I love coming to Rise and Grind to either work, read, or grab coffee with a friend. The cafe has a modern industrial look to it and has a very comfortable atmosphere to it. The staff and owners, Vy and Vashelle, are beyond amazing and friendly people. They will go the extra mile to make sure you are satisfied and happy. Rise & Grind serves delicious coffee, pastries, and toast. My usual go to is the cold brew, avocado toast, and the beer & bacon muffin. I can't recommend this place enough!", "author": "Richard W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-19", "description": "Its right next to my house so its pretty convenient. Their coffee is okay and pastries.", "author": "Katrina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "Great place to stop if you're in the neighborhood or the park. The owners are extremely friendly and the drinks are delicious.", "author": "AJ F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "This place is the best! The owners V and Vashelle are super nice and attentive.  The mint iced cold brew is my favorite.  Can't wait to try the peanut butter latte.  The pastries from Devil's Teeth are exquisite.  So happy they opened in my neighborhood and I look forward to going there all the time!", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "delicious coffee and food, friendly and speedy service, nice atmosphere, really great cafe.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "This is probably my favourite Mr. Espresso coffee beans ,and they know how to make a coffee designs . With a delicious WAFFLES !!!", "author": "Kieu I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "Soooo good.  I had the whopper late and it was out of this world.  Love the minimalist decor and relaxing atmosphere.  The menu is unique, playful, and simply delicious!", "author": "Liza L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-05", "description": "The Whopper Latte here started my Saturday off great! The Belgian waffle was fluffy and complemented it perfectly. Friendly staff, local art, handmade benches- all the elements of a great cafe! Will definitely by coming back to try their mint cold brew...", "author": "Megan W."}
