{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "My local San Francisco friend recommended this local spot to grab a cocktail. \n\nCool little beer and wine bar. Nice ambiance for a chill date night or drinks with friends. The best part was the added touch of the slanted leg support underneath the bar. Wow! They thought of everything! \n\nThe staff members were helpful with selecting cocktails and really friendly.", "author": "Linda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "This place keeps getting better and the service is wonderful.  Thank you Robberbaron for the great food and wine!!  Monday's they are so generous to offer complimentary fresh cheese pizza. \n\n Wednesday's they offer this buffet of beautiful food that is also complimentary, a bit elaborate and way too kind of them.  \n\nProbably the best cheese plate in San Francisco next to Gary Danko's.\n\nThey really need to raise their prices, they keep it real and we love you guys!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "This is a classy establishment located along the fratastic street that is Polk. I'm not a huge fan of bars along Polk because they get overly crowded and full of young clad spring chickens. Maybe I'm just an old fart who likes some peaceful atmosphere at the end of my days.\n\nStumbled on robberbaron because it had seats left and the crowd seemed calm. It's totally a gem along Polk! They have a good selection of red (I'm so old I know) and really nice bartenders. \n\nI'm definitely paying them a visit again when I feel the urge to booze!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Gracious staff, lovely ambiance and an excellent happy hour. It's my favorite wine bar on Polk !", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Loved my evening here with a girl friend for drinks. So impressed with the staff-they were informative about the wine selection, attentive and very welcoming. The awesome food set out on Wednesday nights was also great!", "author": "S. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Cute low key bar that gets busy past happy hour. I got here right when they opened and was one of  be first people there. There were some comfy sofas already reserved and friendly bartenders. I found street parking right across the street. \n\nThey do not have an actual happy hour but they have a special where you can get a free item from the charcuterie options if you purchase a bottle. I came here with a new friend to celebrate her getting a job and just went for cocktails instead. I got the mother of dragons and it was delicious. I would definitely come back here as it was packed by the time I left on Thursday night.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Stumbled upon this wine bar on a late Saturday afternoon with a group that had been drinking since brunch. We sat in the front table, overlooking the busy action on Polk street. The people watching was fabulous with the open concept windows and busy weekend vibes. The bar itself wasn't too busy but that meant we had the bartenders to ourselves. Such classy fellows with great service and hospitality. Someone in our group picked up the tab so I never even saw menu prices or options but we drank a Sangiovese red wine and both a sparking and flat rose. Overall great vibes and my absolute favorite part was the cute little bathroom in the back--where do I get my hands on one of those fancy black and white patterned toilets. Will be back to show this place off to my family when they visit", "author": "Kara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Overall I was very happy with my experience here. The staff was extremely friendly, and the atmosphere is great for a laid back night or date. I came here with a couple friends on a Friday and there was still space for us to sit, chat, and split a bottle of wine. For SF this price point is decent, not a steal, but not bad either. There are several wine bars on polk to choose from, but this should be at the top of the list.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "The only reason this place doesn't have five stars is because the $5 (first red flag) cheese and crackers plate is no joke that cheese and cracker (see image) snack you'd get as kids. The cheese even tastes and looks the exact same. You even get a silver spread knife that's supposed to be the red stick.\n\nOtherwise great wine selection, ambiance and friendly staff.", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Perfect spot. Gracious staff that are both knowledgeable and super chill. Luc has really made this an A+ addition to the neighborhood. See you soon!", "author": "Thomas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "My sister and I loved this place! \n\nWe came in for some pre-dinner drinks and found out they have free (yes FREE) cheese and charcuterie on Wednesdays. \n\nThe drink menu also has some hilarious names for their champagne based cocktails, causing my boyfriend back at home to beg me to try \"the volleyball scene from top gun\" and my sister ordering the \"fresh prince of bel-air\". \n\nI would love to come back here if I lived in SF, it a actually hurts a little bit that this bar exists and I can't go to it every day", "author": "Courtney D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Luc and the crew make you feel like you're an old friend. There's always someone interesting to chat up and you're a 'regular; in a half hour! Good selection of beverages and great tunes. A huge addition to the neighborhood.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "My bf and I stumbled across this place as tourists looking for California wine. The friendly bartender, Luke, made some great recommendations for both reds (for the bf) and whites (for myself). There was a great variety and we both loved what we ordered. The ambience of the place was really laid back, not too bright, not too dark, music was the perfect volume and everyone in the place seemed generally happy to be there, as were we.", "author": "Rayannin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Luc and the gang at RB are simply the best! RB is my favorite spot for an amazing playlist, generous pours and the warmest service (not to mention the most beautiful and delicious cheese and charcuterie plates). Do not miss this neighborhood gem!!", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "I randomly walked into this bar about five years ago and it's still my favorite in the city...or any city for that matter. Wine & Charcuterie that can't be beat...plus a great regulars crowd that make you feel welcome every time you show up. The Owner cares about her customers and changes up the menu regularly, hosts Wine Wednesday and sometimes serves fried chicken in a bucket.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "One of my favorite bars in the city! It's super clean and nicely decorated. The bartenders are really nice and the specialty drinks are very good, one of the bartenders even checked up on my drink and offered to make a new one if I didn't like it. Loved that my group didn't have to yell over each other the whole time we were there. Overall, it's a pretty small and intimate space but it's not overly crowded like other places I've been. \n\nI had the fun GoT themed champagne drinks: Mother of Dragons and Blood of My Blood - liked them both!", "author": "Sara L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "Typical SF bar - \n\nPretentious bartender - check\nRidiculous wine prices - check\nExtremely small servings - check\nObnoxiously loud customers who can't be bothered to tone they're voice down, and the bartender doesn't care either - check and check", "author": "Ash S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Robberbaron is proof that Polk St. has some class.\n\nThis is not your usual pick up scene/raging heffers/overrun with B&T crowd/etc. etc. It is a NICE neighborhood bar where you can have a fun, decent, adult conversation with your girlfriend or take your date to before having dinner at Lord Stanley across the street. \n\nThere are a lot of interesting wine choices on their menu that are fairly priced, but my gf and I both got the Mother of Dragons champagne cocktail: rose, elderflower with a lemon twist. It's so easy to down this thing, you'll need to have at least two! I really loved that they named this after Daenerys of Game of Thrones (the series of which I am so hooked onto right now!)\n\nIf you think this place is too quiet for you, take your loud annoying self to Rouge on the corner. Robberbaron likes to #keepitklassy.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Outstanding\n\nThat's how I would describe Robberbaron in one word. The owner and staff pay attention to every detail. Their service is phenomenal. Keep it classy, stop by for a glass of wine or beer. No cocktails here, however they have Noble Drinks... Don't know what that is? Stop by and ask!\n\nHere you'll find the most interesting woman in the world, Luke\n\nNow go drink like you're from House Martell [add wine emoji here]\n\nMondays - pizza nights\nWednesdays - charcuterie nights", "author": "Walter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "Small bar convenient located on Broadway and Polk. I used to come here years ago before \"The Wine Bar\" closed its doors. Despite minor changes the bar has not changed much; the bartenders are very friendly and fast to make drinks. They are thrifty though; I have noticed that the amount of liquor poured in each drink is anything but generous. I think my five year old nephew could drink three or four Long Islands and remain 100% sober. Not the best way to encourage clients to come back.", "author": "Roman S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Robberbaron is the best. The staff is the best and what keeps me coming back. They have a great Sauvignon Blanc as well! Great atmosphere any night of the week.", "author": "Lacey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "robberbaron has kept the best elements of Black Sheep (the bar before) and upped it to another level. A wider selection of wine and beer + some champagne cocktails, pizza Mondays, and the new vivavcious owner of the place who is reason enough to come visit. \n\nThere is a very unique SF feel to the place. It's the SF I arrived to almost a decade ago and the one that I sometimes miss. An open and accepting space for all to relax while being decidedly understated and unpretentious. You come in here for good drinks and good conversations. Patrons are respectful of each other. Just don't be a douche. Good times to be had by all.  \n\nAnd coming back to the new owner. She is a BIG warriors fan and gets really animated during games. But her affable charm and genuine desire to make sure you have a great time ensure you most certainly will.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "So this wine and beer bar is amaze. Wow the service and selection was incredible. The staff was knowledgeable and funny.", "author": "Dale W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I finally returned to robberbaron and it's still the best wine bar in San Francisco. Where else will you have pizza night for free (Monday) or free charcuterie (Wednesday) tasty wines, great ambience for date night or girls night out.  I love this place. The staff and owner are friendly and welcoming. I love this place!", "author": "jennifer b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "This is a super cute neighborhood spot.  I am unsure about the vibe, but I like it.  There's swanky decor, old school top 40s playing, and the bartenders and crowd are not pretentious.  \n\nI really enjoyed the service, Charcuterie Wednesdays, and GOT drinks on the menu (cool!!).", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "I honestly can't even describe why this place is so good because their drinks make no sense but everyone is amazing. Great atmosphere too! Stumbled upon it and it was the best bar experience I have had in years!", "author": "Lindsey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-08", "description": "Love love love this bar. Luc and team are so much fun, so welcoming and I feel right at home  thank you for all the good times!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Great place for wine and champagne. Went here w my friends , so delish. And here for national wine day. I'll defiantly be back", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Awesome, unpretentious gem of a wine bar!  It's all black and unmarked on the outside.  Once inside, you're welcomed by a comfy padded bar, some tables, and comfy window seating.  The best part besides the drinks?  The Mirror!  Perfect for people watching and making fun of people without them knowing.  Great music selection too.  Really was feeling the 90s hip hop. \n\nTons of tasty wines to choose from, top notch craft beers, and good cocktails.  The owner Luke is A+ and treats her patrons well. There's free food during the week too. My sister was drinking an IPA and she opened up a bottle of Blind Pig IPA for us to try FOR FREE. Such a top notch spot.\n\nGreat for a girls night, date, solo drink, pregame or actually whatever you want- do you really need an excuse to wine?", "author": "Alison B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "I only live a few blocks away and have been wanting to check this place out for a long time with my girlfriend, and finally made it work. This place is has such an awesome ambiance! From the awesome wine to the eclectic beer and music, this place is just cool. For drinks, I had the \"Snakes on A Plane\" and my girlfriend had some Elderflower champagne- both delicious! The customer service was great and the bathroom toilet was even cool too! We'll be back!", "author": "Preferred C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "If you've ever had a Cheers fantasy, this is the place. Came for the wine, stayed for Luc (the owner) and Matt (the mustachioed bartender). Do yourself a favor and have them recommend something to drink for you. And then say hi, because they're both awesome people that will keep you coming back for more.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "Yes way Rosé. Came here for a quick glass while waiting for dinner reservations at Frascati . I loved the vibe from the short time spent there. Wine choices were of course fantastic. It was a Friday so quite busy as expected. I'd love to come back for a HH and spend more time. Sat on the tables against the wall but everyone at the bar seemed extremely friendly, always a huge plus in my book. And the cherry top.. they were playing the Giants game and had a few other games playing as well! Doesn't get any better than that !\n\nPs. If you're searching for a good date spot , this is it, look no further !!", "author": "Hetal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "What a delightful little neighborhood spot. Classy, but not fussy. The drink names are hilarious. There aren't cocktails, but they do have something called Noble Drinks, which mix champagne and wine with other syrups and what not. Pretty tasty. The place ain't cheap, but if you go on Wednesday nights they have a free cheese/charcuterie set-up happening. Every time I've been, the people there have been extremely courteous and attentive.", "author": "Jenna J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "my favorite bar in the City. vibe is very welcoming and the staff is friendly and extremely knowledgeable about the wines & beers. music is ALWAYS on point.", "author": "ronda a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Robber Baron is your neighborhood hangout. The people behind the bar are literally here for YOU. They are so hospitable and relatable 7 days a week.", "author": "Kaitlyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "A small but chic place, really chill (but then again we passed by on a Wednesday night). The bartender was really really nice and made the visit worth it. He even recommended us bars to visit while we were in town (which we really loved). Sadly, we forgot to ask for his name but everyone was very accomodating. Interior is really nice too.", "author": "Jess P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Great owner, great staff, great selection of wine and beer. Cozy atmosphere. Monday they usually have free pizza. Highly recommend checking this place out if you are looking for a good wine bar in the city!", "author": "Matt K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "I've been in before, a few times, for the delicious wine. I've also sampled some of the appetizers and always had a great time. Everything is delicious and the place itself is gorgeous.\n\nRecently my lady and I decided to get married and I've been trying to arrange some kind of reception afterward because you can only take a few people to a City Hall ceremony. I'd almost given up on the idea and resigned myself to having friends buy us a PBR at our local queer bar, as the GF suggested. And I really do not like PBR. But our budget is tight and once you use the word, \"wedding\" costs just skyrocket. \n\nI began to despair of finding a place to gather a somewhat large group, then a coworker asked if I'd checked in with Luc. I had forgotten to check and robberbaron is just up the street from me! When I shot off an email to the owner about bringing some folks through, the response was near instant and totally enthusiastic and willing to work with us on making it happen. \n\nI cannot possibly recommend the place with more enthusiasm. TY so much for being soo accommodating and helpful, I can't wait to drink some more delicious wines and celebrate with my love at robberbaron.", "author": "RJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "I haven't yelped  in some time but the service I received this evening deserves a prompt and stellar review.   I wish I knew the names of the lovely peeps tending bar this evening, though it really doesn't matter.  The point is, they were both fantastic and really made the experience.  I felt so welcomed and catered to.  I will def be back and will also recommend to my friends.  The vibe was comfortable, inviting, real, friendly and upscale, just the way I like it.  :)", "author": "Lisa E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-24", "description": "So far...great!\n\nStopped in on a Wednesday evening, busy but not overly packed (which I prefer). Great wine selections, you can tell the folks here care about what wine they are providing. It was also a special night (might happen once/week) where they offer complimentary charcuterie to the patrons. \n\nWould definitely go back :)", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "We've lived in the neighborhood for 6+ years and didn't have a true neighborhood spot until Luc and Matt arrived. Great times, great drinks, and great people!", "author": "Brett M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-15", "description": "I've been to Robberbaron a few times now and it only keeps getting better. They have good and classy drinks for any taste. Their decor is classy and low key as well and you're always bound to have a good time. It's also a good place for a date or a casual drink with your buddies. DO NOT miss out on the Baron Bars! Stop by, you'll be glad you did!", "author": "Jeanette Jane G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-13", "description": "I came here with a friend around 9 on a Friday night & after having a wonderful time here I am honestly surprised it wasn't more crowded from the time we got there till we left which was around 11:30.\n\nThis is a great place to unwind after a long week & like many others have commented, it's definitely not your typical bar that you would expect on Polk. If you're looking for a bar that's more lowkey, this is definitely the place to go! Everything from the music to the incredibly attentive owner & staff that provided us with nothing short of amazing service made for really great vibes. Not to mention the drinks were delicious & they also happen to be Game of Thrones themed! I unfortunately do not watch ( sorry to all you avid watchers) so I didn't get the references, but I got the Mother of Dragons, and it was great nonetheless. \n\nEverything about this place deserves 5 stars so needless to say I will definitely be coming back!", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "The location was cozy, the staff was amazing. Our party was treated well and I'm sure the locals will return again. The out of town visitors will have fond memories. \nBe sure to check out the loo. Too cute!!", "author": "Mz P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "I literally love this place. It's like walking into a home where the bartenders are your friends with great food and wine. It truly feels like a neighborhood wine bar and I hope the vibe never changes! Best part is Wine Wednesday and no douchey people!", "author": "Jasmine G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "robberbaron is top notch. I've lived in the neighborhood for a few years now, and it's so nice to have a spot that's NOT Amelie for a nice glass of wine. Luc and all the staff at robberbaron are SO friendly and welcoming. They serve free food on certain weeknights (I think it's pizza on Mondays and meat/cheese/fruit on Wednesdays) and the ambiance is stellar. Highly recommend!", "author": "Stefanie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Robber Baron was awesome this afternoon with a lively party in the front celebrating the Kentucky Derby with pretty Spring dresses and matching hats. My brut rosé was perfect , but it is hard to choose what to drink from an amazing list of wines and beers , I want to try everything ! Their beer selection is intriguing with so many local and European breweries represented. Luc and Matt were there behind the bar and they can help you with your selection. They also have wine & beer based cocktails with wonderful names like Mother of Dragons . If you need a snack, they have several cheeses and charcuterie , they'll make you a bar picnic ! I can't wait to go back !", "author": "Sondra Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "Just discovered this place with my neighbors. Love the ambiance and special drinks with fun names. The cheese plates are amazing - I have become obsessed with Beehive Barely Buzzed cheese is amazing! I have been buying it from Cheese Plus since.", "author": "Elizabeth A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "We came across this bar before dinner and so glad we did. Great place to have a glass or two wine.", "author": "Valerie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Really great wine bar, my favorite spot on Russian Hill. The owner is very engaging and really makes sure you are happy with what you are drinking, from their great selection of wine and beer.  It's a really nice break from all the douchey bars on Polk, highly recommend if you're looking for a Nellie glass or two of good wine.", "author": "Steve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "One of my all time fav Wine Bars in SF!!! \n\nThe Happy Hour starts early around 5pm .... arrive early to snag a seat.\n\nTheir wine & beer choices are great, I always try to get something new.\n\nSuper cute date spot (especially for blind dates!)\n\nLuc and team are amazing and super friendly, love coming here any day of the week. Everyone knows each other or get introduced by someone- it is the perfect neighborhood bar (I live a few blocks from the bar). \n\nThey do have special events as well : Wine tastings, Beer tastings and a few other ....", "author": "Sepi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "Very cute and quaint neighborhood wine bar tucked in the heart of Polk St. \n\nI went to catch up with a friend at Robberbaron a few days ago and we both agreed that it makes the perfect first date spot - the ambiance has a rustic and intimate charm, the bartender is so friendly and inviting, the two seater tables are so cute and above all, you can actually hear everything that your counterpart is saying. The vibe is definitely more quiet and laid back than a really loud divey setting. \n\nThe wine selection isn't vast but it's perfect. I had the prosecco and my friend had the chardonnay and they were both crisp and absolutely delicious. The ~$13 price tag per glass is more than worth it. They have a small bites menu as well but we'd already eaten dinner beforehand. \n\nSo if you're looking for a new cute date spot or you're in the neighborhood and want to head to a quieter, more quaint wine bar, Robberbaron is for you! \n\nHappy Drinking, Yelpers!", "author": "Priya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "The best to ever do it.\n\nFree pizza on Mondays for happy hour.  Some of the best glasses of wine (and consistently good) we've ever had.  Friendly, knowledgeable, engaging staff that feel like friends more than bartenders.  Plus, the owner remembered I liked a certain glass of Cabernet Franc, and when my wife was there later that week with her friend, she remembered us and gave us the last bottle left of that wine FOR FREE.  You have to be kidding me.\n\nThe best neighborhood wine bar.  Since a lot of the strengths are subtle, probably one that will grow on you after repeat visits more than impress you for a \"one time\" visit.  We are so thankful to have this bar within walking distance of our apartment and have trouble going anywhere else for wine at this point.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "This is one of SF's hidden gems that you might be so lucky to find and frequent. The wine selection is vast and delicious, the service is friendly, knowledgable and always welcoming, and the bar itself feels so comfortable. \n\nLuc and her team won't let you down!", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Just when I thought it couldn't get any better, the folks behind Robberbaron went and did it. This is easily my favorite wine bar in the area. Service cannot be beat. The wines are interesting, and if I were a beer drinker, I'm sure I'd be in heaven. Their free pizza Mondays and snack options go over quite well and they seem to have expanded the variety each time I visit. \n\nI popped in recently to find out they've added a (small, but mighty!) champagne cocktail section to the menu! Woohoo! Perfect timing given the unusually beautiful weather we've been having. I tried the Oathkeeper - a pear-ginger syrup + champagne concoction. Mouth watering, I know. \n\nLove the effort Luc and team put into making Robberbaron be the best it can possibly be.", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "This place is incredible! I've been coming here every time I'm in town since they opened! Luc and her staff are always a lot of fun and very attentive! The beer and wine selection has something for everyone.", "author": "Mario F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Awesome drink selection, cool atmosphere, and super sweet owner! \n\nPoint 1: Came here on a date, had 2 drinks, and then the owner (Luc) brought us a free bottle of (super delicious) beer just 'cuz she said it looked like we were having a good time and she didn't want that to end. Too kind. \n\nPoint 2: Ended up staying here until midnight, at which point I realized that they had closed at 11. Whoops! But Luc was sweet enough to just let us stay and chat, rather than giving us the boot when they officially closed.", "author": "Gillian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "Its nice and service is great,but no happy hour as listed in reviews. Most wine is $11-13. Nice atmosphere with a window seat.", "author": "Julie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Fantastic recommendations from the knowledgable bartender. \n\nWith a familiar and community vibe, this sheik of a spot shines with wine. Whether you're looking for a quaint lounge or the feel of a stripped down 1920's accent bar, you've got it. \n\nThe beer menu is large, but more for show. The wine is genuine, generous and full for varied palates. \n\nSit a spell here. Feel happy.", "author": "M F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Outstanding, friendly, unpretentious wonderfulness. Words can not describe how enchanting Luc and Matt are; their generous spirt is contagious, and you can't help to fall fast in love with them. After a decade in SF I've found my absolute favorite place to have a great glass of wine or beer. Great selection and prefect atmosphere....\nHey-O xoxo", "author": "Allison H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Very engaging and good spirited owner. We came here for a break from St. Patrick's day bars and crowd. They have very good selection of fiber beers and wine.", "author": "Dondi D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "Ended up going on a 1st date here. Called ahead to see if I could reserve a spot for 2, unfortunately they only take reservations for groups of 6+. I explained the situation to the person on the phone, and she said she would absolutely take care of us and make the date special. Arrived on friday night at 745pm, best table in the house was saved for us. The staff absolutely took care of us and the wine/appetizers were phenomenal, couldn't have asked for better service and quality. \n\nThe next morning I received a text from an unknown number. It ended up being Luc (the owner) asking me how everything went, she went out of her way to make sure my date and I had a great time. That's some incredible customer service if you ask me. I will definitely be back, and would absolutely recommend Robberbaron to anyone looking for a fun date spot/wine bar.", "author": "Nick W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-21", "description": "While expensive, this is such a nice place for a drink on weekdays! It's not too crowded (even on a Thursday), and it has a good selection of wine.", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Loved this place! Service was excellent and the bartenders were warm and very friendly, the decor is beautiful and the wine list is fantastic. Definetly going back to check out the food, very soon", "author": "Anissa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "I'm in love with this place. Luc and her team are SO wonderfully kind and care deeply about making their patrons feel welcome. Wonderful neighborhood bar with a great, carefully curated menu. Will continue to come back again and again for as long as we live in San Francisco!", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Great bartenders, service and drinks. Crowd, not so fun. I live in the neighborhood and I loved it.", "author": "Oscar P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "I don't usually write reviews on Yelp, but felt I'd be doing Robberbaron a disservice otherwise. My friends threw my fiance and I an engagement party here and the staff went above and beyond to ensure our night was a special one-- and the owner even went as far as standing outside to pretend to wash the windows, so that our friends could surprise us. I've been back since and the staff remembered us and once again went above and beyond to ensure our visit was a special one. It's rare to find such spectacular customer service, but Robberbaron has it figured out. The wine selection and light bites aren't too shabby either ;).", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Incredible experience! Well thought out wine selections and excellent choices of beer. The bar team is very knowledgeable when describing wine and assisting with selections. Amazing cheese/charcuterie in a very lively atmosphere that's not too chaotic. Lounge space, cocktail tables and ample bar seating; surrounded by comfortable decor, great music, and amazing service. The owner, Luke, is one of a kind. She's passionate about her craft, excellent with wine knowledge, and clearly has a true understanding of hospitality. Robberbaron is a blast to visit! Highly recommended for gathering with friends, dates, or just a craving for a good glass of wine.", "author": "Napa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "We had dinner at a nearby restaurant and decided to stop in and see how Robberbaron was doing.  Just like last time, it was awesome.  I can not rave enough about the staff and owner!  Every time I come into SF, I always look forward to coming here.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "Came here for halloween. It's a fun bar. Lots of people were dressed up and the crowd and staff were friendly. They had a really good sour beer called the Vanderghiste. It was also someone's bday that night, and they shared their cupcakes. Overall a fun time.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-12", "description": "Nice addition to the Polk St. scene.  Small wine list.  Sadly, no happy hour.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Cute little place. Not a ton of seating but I've never had any trouble getting a spot. Great date location", "author": "Therese M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "Robberbaron was recommended to me by a friend who raved about the place, the staff and the warm welcome.  Really?  Well, yes, it's true.  I went a couple of times for a glass of wine with a friend then decided to use this sweet spot as a gathering place for my birthday.  I chose well.\n\nLuc, the owner, was a gem to deal with and assured me everything would be just right. And it was.  We had a reserved space that fit the whole crew, two beautiful platters of cheeses and meats, and a surprise birthday presentation of their crazy delicious rice krispie treat thingamajigs.  The staff shared the recipe with one of my friends, but I chose not to listen. I don't need to know how to make those dangerous treats in my own home, I'll just head to Robberbaron.\n\nThis spot is a real find.  Each person is made to feel special and like part of the inside crowd, even the first-timers.  And the wine and beer selections kept all of us very happy.  Thank you, Luc and team!", "author": "w r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-11", "description": "I heard this place is awesome, and our office had a happy hour there. \n\nBut the home page of this wine bar (http://www.robberbaronsf.com/) has absolutely no information and they don't pick up their phone calls. This makes me wonder if they actually want any business. When I gave a single star review the first time, I was asked to change/remove it -- how is it an unbiased rating if they only want to see 5 star ratings?\n\nNow I really start to doubt these 5 star ratings of this place are fabricated.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Cool, hip, and classy place! Come listen to Lucre's great selection of music and hand selected beers and wines. Comfortable, relaxed that makes for a perfect place for the regular hang out.\nSmall plates that are a perfect companion to the \"pimpiest\" selection of wine and beers. Make your own \"picnic\" basket and delicious plates, such as Baron's Bruschetta, Hummus Tostada and plenty more\n\nCome in, relax. You'll be in good company.", "author": "Eve T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "Awesome bartender and owner Luc who makes everything fun and the drinks are awesome with Wednesday free Charcuterie board.", "author": "N A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "I was on my way to get my hair cut and had some time to kill and was looking for a quiet bar on Polk Street to have a glass of wine and kill some time. What a pleasant surprise Robberbaron was! This is the place my friends and I sort of avoided when it was Black Sheep or something. Ladies, it's under new ownership and it's what we've been looking for on Polk - a cozy friendly wine bar. I'll be back very soon! Thanks, Luc!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "I was looking for a quiet place with WiFi but I didn't want coffee... Hmmm... I decided to try Robberbaron and I was not disappointed! The bar is big and beautiful! Shiny, black and super clean. I hit them just around the start of happy hour time so I had the whole bar to myself. The bartender was friendly and knowledgable and he helped me choose a great wine to go with my \"bar picnic\". Bonus points for giving me more crackers when my \"cheese to cracker ratio\" was off! \n\nI would recommend anyone go visit this hidden gem in Russian Hill.", "author": "Katie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "Whenever you end a night by giving the bartender, owner, and guests of the bar a round of hugs... you know it was a pleasant night.\n\nI wanted this bar to be great. After the Black Sheep drifted away from the herd, I always wondered what will replace the ill-fated wine bar. I live a block away, and Amelie gets way too crowded. So I ventured here as soon as I possibly could.\n\nMeet Luke (owner) and \"Little Face\" ('tender), the two adorable ladies who greeted us as we walked into the bar. They were a blast to hang out with and they know very well how to connect guests with each other. \"Hey you should feel how soft his hands are\" *points to the cute girl next to me*... freakin' genius.\n\nThe menu is simple and sweet: a short list of  wine selections by the glass or bottle, artisanal beers, and 5 options for petite snacks.\n\nIn case you're wondering about prices: wine is around 10-15 per glass and apps are around 8-12.\n\nGet the bean dip. Delicious and delightful to share.\n\nAs they say: Eat. Drink. Be Noble.\n\nQuickly! Copyright that before Dos Equis gets a hold of it.\n\n---\n\nDistinguishing factor: A friendly neighborhood bar that is classy and loungey. It is not as loud or crowded as its counterparts on Polk so it is naturally a destination for a chill night out.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "I've been going to this location for the past 4 years that I've lived in the 'hood. It's changed owners twice in that time, and the current bar definitely seems to be the best, so I hope it will be around for a long time! \n\nThey've made some nice updates to the look & feel (including to the bathroom - thank goodness), while keeping it relaxed, inviting and \"neighborhoody\". They've also improved the wine list, food options, and music (thank goodness there too). \n\nI can't wait to go back...and back...and back...", "author": "Emily A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-17", "description": "Totally meh. Musty smelling wine glasses and musty tasting wine. Dark and noisy and too much lame music. Paaasssssss.", "author": "Viv R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-15", "description": "Hands down my favorite place to unwind with friends.  Atomosphere is laid back enough to have an audible conversation and active enough to chat up the hottie on the couch .  The owners, who are usually behind the counter, are really friendly and will recommend an awesome beer (or 2, or 3...).\n\nTL;DR: Classy, cozy, intimate.  Awesome beer and awesomer bartenders.", "author": "Dagmar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "What a fun night! This is my favorite spot in the city to have a glass of wine, listen to good music, and good conversation. So many cool people and the Bar is EXQUISITE...so simple but super classy! Well Done. Oh and I topped night off with a cider and a RobberBaron Bar (delicious) ..... just makes me happy.", "author": "moira s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Went here for a celebration last night with a friend. Wow, we were so impressed. \n\nThe owner of the bar, Luke, overheard us talking about a promotion my friend got at work that day, and brought out two glasses of champagne... on the house! Talk about a great way to greet your guests. \n\nThis place has a great vibe to it. It has a relaxed atmosphere with a \"bar\" feel, great wines, beer and delicious-looking food.\n\nWe are so excited that we've found a new go-to neighborhood spot. Can't wait to go back and spread the word about robberbaron!", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Last night a friend and I stumbled upon robberbaron on Polk Street. The minute we stepped into the bar we were greeted by the owner, Luke. Luke is AWESOME. She gave us a glass of Prosecco on the house, let us try different wines, and chatted about the opening and fun events robberbaron is going to host. Robberbaron has amazing wines and a selection of beer, but has a bit more of a bar feel. They even have a TV so you can check out any games going on. \n\nWe walked out of robberbaron so excited that we had found a new neighborhood go-to bar. I highly recommend checking it out!", "author": "Tara A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-16", "description": "You can't ask for more here. \n\nFriendly staff\nGreat wine & drinks\nFantastic food \nReal cool decor\nGood prices\n\nI came here for happy hour, place wasn't overly crowded, I had great convo with a friend. The bartender was super friendly and attentive, owner was there, also extremely friendly. Everyone knew each other- it felt like the perfect neighborhood bar. My friend had some wine and we shared an assorted plate with cheeses, preserve, olives, nuts, grapes, and crackers. \n\nGood way to end the evening.", "author": "Azizi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "This is going to be my new hotspot in my neighborhood. The owners are super friendly and personable. The snacks are great and they have a great drink menu. \n\nThe ambiance is much more inviting than the last venue to be here. You would be missing out not to try this place soon!", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "a big fan of this place! i must have walked past it so so many times up and down polk. the vibe is chill, the crowd is classy, the wines are good, meat & cheese plates delicious, and not overly expensive!  we sat in the lounge area at the front and really had a great time, connecting with our neighbors on the couch. would totes be down to come back! and not overly crowded and people arent sweaty, which is rare for polk street!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "My friend introduced me to this place and said that, \"They have the coolest toilet that will just blow your mind!\"  It's completely true - try going to the bathroom and you'll find a toilet that has been custom-designed by Sharpie pens... WHAT?!\n\nBut besides that, this place is awesome to grab drinks.  It's directly across the street from classic bars such as Nick's Crispy Tacos and Bullit.  If you want to veer a bit more on the classy side, I'd definitely recommend popping in here for beverages.  The bartenders are always friendly and you will seldom need to wait for drinks.\n\nThey have casual seating everywhere.  This place is optimal from parties of 2-4 people.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "Better go visit them now, because this place isn't going to stay a secret for very long. Robberbaron has a rare mix of classy yet casual, and you can still walk in and find a table to sit at or space at the bar on a weekend. The wine selection is absolutely amazing and very reasonably priced, and the owner/operators are a lovely couple who are actually behind the bar most nights.\n\nLittle tip: check out the beer menu too.", "author": "Jackson P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "Fun date spot. Small and intimate atmosphere that's on Polk. You can also progress onward to a few bars/restaurants afterward", "author": "Jim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "This is hands down the best thing to happen to Polk Street.  Incredible wine from incredible people.  Luc and Bathia - the lovely ladies I have had the pleasure to get to know deliver not only a passion for wine but even more so a passion for the customer's they serve.  \n \nI am officially in love with 'Oro en Paz'  on their menu and the new policy of ordering 2 glasses of any \"bottle only\" wine is perfect for someone wanting to experiment with different high-end wines. The appetizers and pastries are also fantastic - the rice crispy treats will blow your mind!", "author": "Shabby D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "We came here for a drink before going out to celebrate my birthday.  I had a big glass of bubbly and my partner in crime had something Pinot.  The awesome bartender topped off my drink (which was essentially empty) and its a wonder I didn't break an ankle stumbling out the door.  The things I noticed before I got too tipsy to pay attention...\n\n1. The mirror TV they have is a genius invention.\n2.  There are a lot of single women here, both seated in front and at the bar. If I were a dude I would totally have a drink here, the girls really seem like they are looking to meet someone and its way less sceney than some other places nearby.....", "author": "Poppy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "This place just opened on Polk St. and I'm pretty impressed. They have a really chill vibe inside--lots of cool colors: grays and blacks mostly. It's small and dark inside, but in a trendy way.\n\nThe beer list is small but packs a big punch. I've tried three different beers there, and have been enormously satisfied by the complexity of each one. \n\nI haven't tried the wines yet, but I can't wait to go back. The wine list is pretty tight. \n\nThe bartender/owner was really friendly and quite knowledgeable. We were dressed down that day, but she didn't hold it against us. I would definitely dress up a bit to go here, at least business casual.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "I am blown away by the hospitality and generosity of robberbarron. I came this evening after a terrible day at work, and all sorts of other things going wrong. The owner -- whom I had never met before, as this was my first time here -- saw that I was upset, and of her own volition, gave me a hug and said some of the kindest things I've heard. She literally turned my day around. And that was before I found out at the end of the night, as I tried to pay, that my wine had been complimentary. She wouldn't even accept a tip! Of course, it's nice to get a free drink -- but even without that, I'm just so touched by the care she showed. It made me feel that, no matter the occasion, she would take care of my friends and me. In fact, I saw that tonight with another patron -- she brought out a birthday cupcake for them in the happiest fashion. When I think about how I could spend my limited free time, robberbaron will always be on the top of my list, thanks to the kindness of its owner. I can't wait to come back!", "author": "A. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-14", "description": "There's just no friendlier place in the area. Awesome menu, fantastic staff, great vibe. Can't be beat. Live 2 blocks away and I'm here all the time. Best place on Polk.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "This is a great place if you are looking to have a quiet drink with friends or a date.  On a Tuesday night it was fairly empty except for a few couples.  The space is dimly lit and the drink menu has an extensive list of wines, cocktails, and beers.  I will definitely be back - it's a nice change from some of the other bars nearby on Polk (i.e., Nick's Crispy Tacos, Tonic, Green's Sports Bar)", "author": "Andrea L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "Great spot and service.  Really good vibe.  Awesome date spot.  Great music as well as a great beer/wine selection.  Can't believe it took me this long to come here as it is walking distance from my apartment!", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "I had a great time here a couple weeks ago. It was cold out and the atmosphere inside was inviting and warm. I went to their happy hour on a Monday and it was easy to find a seat. The staff was kind and courteous. Even better they ended up with free pizza for the bar. I'm not sure if this is a regular thing or if we just lucked out. Either way I appreciated not having to think about dinner after going to happy hour. I'll definitely be back to this little neighborhood gem.", "author": "Jacqueline S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Lady Luke is amazing! She made RB my hands down favorite wine bar in the city. I went there with new fiance after just getting engaged and Luke gave us champagne and olives for free without us even telling her our news! We just went in today to buy a bottle for the park and she gave us a free 2nd bottle to take with us (ask her about the off the menu secret syrah). Good vibes every time!", "author": "Katie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "My love and I stopped here August 2013 just after they opened. It was close to closing time but the owner Luke welcomed us with open arms and even socialized with us after they closed. The energy and positive vibe was amazing. We promised to come back the next time we had a day in San Francisco and we kept our promise. To our surprise when the owner saw us she immediately recognized us and welcomed us again with open arms. If you want to have a nice glass of wine or a classic beer and know that the owner cares about your service then this is the place for you. Music is relaxing and not too loud so you can enjoy it and still have a conversation. That is important to me!! If I could give this beautiful little blooming bar 100 stars I would!", "author": "Julia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "Robberbaron is my home away from home. Luc and the staff go out of their way to make you feel welcome whether you're new to the bar or a regular. I've taken dozens of friends here who feel the same great vibes I do. \n\nGreat wine list, great beer list. Luc also whips together the prettiest and tastiest charcuterie plate in town complete with homemade crostata, jams, and pickles. Don't leave without trying a Barron bar which are these peanut butter rice krispie treats with marshmellows and chocolate chips. Edible crack. They also have pizza on Mondays!\n\nI also just hosted a private tasting here with the Junior League. Luc, as always, pulled through and did a phenomenal job showing us a variety of different beers and wines. She even pulled some strings and brought in Patrick from Headlands Brewery to talk to us about IPAs. The girls and I had a fantastic evening and stayed long after the tasting.\n\nThe best. Just the best.", "author": "Helen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "Wine and beer only. The Merlot was good, but at $10/glass was the lowest price red. Still worth it for a nice wine bar you can actually have a conversation in without going hoarse, compared to a gross cocktail in a loud, dirty bar. The seats by the window are nice for street view people watching.", "author": "Amy X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Cool place. Small but cool. Wine list is not too bad but not as extensive as some other wine bars I've been to in the city. And the prices are very reasonable. I love the decor with the shadow box artwork on the walls. Service was quick too. Our group of 6 grew to a group of 14 so it got a bit packed and hot in there but it wasn't unexpected for a small place. I would like to go back on a weekday and try some of their small bites.", "author": "Gina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "This is a great place to duck in for drink/snack.  Great beer and wine selection.  The layout is spacious; plenty of room to stand and mingle or sit and get cozy withe someone.  Staff is very attentive and helpful.  Great place.", "author": "Kari T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Love this place. Great staff, nice ambience and friendly customers.  My \"Cheers\" of SF.", "author": "Matthew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Great date spot. This place has a quaint atmosphere with dark wood; it was made for dates. The menu has a bunch of small shareable items to have with the wine also.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "Sleek and sexy wine bar. I never knew it existed until we walked by one day. It's a great place to meet up with friends before or after dinner...or go on a first date. They have food, but only during certain hours. We went during an off hour so they only had nuts and olives.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "I hadn't been since this space became Robberbaron, and I was pleasantly surprised. The space is simple and clean with tons of light and a giant front window. The wine options are interesting and at various price points. The atmosphere is laid back but high end. The service is stellar. I like this place so much better as Robberbaron than I did its previous attempts.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "This place is really great! I just wish they would turn down the music like 30% so we could talk without yelling. If they did that, this spot would be perfect.", "author": "Jack J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "I love it here. The decor is awesome, the beer selection is thoughtful, and the owner is a sweetheart. I would definitely recommend this place.", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Bartender Matt was super nice. Wine was good. Cheese plate was ok. Most notable, however, was that the owner never said hi or even looked at me for the entire time I was there at the bar (even tho the place was practically empty and she walked by me about 6 times). I'm just surprised because the reviews were so outstanding regarding how friendly she is.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "Stumbled upon this place after a failed attempt at squishing our way into Amelie on a Saturday night, and were thrilled with the rest of our evening! We had a group of four and sat down at a table that ended up being reserved. Rather than simply telling us we had to move, the bartenders (owners?) let us sit there until the party arrived, and then pulled barstools out of the back (lifting them up and over the bar!), creating seats for us at the bar. Amazing, accommodating service! The wine is pricy, but delicious. Would be a great spot for a date or a night out with a couple friends.", "author": "Julie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Welcome to the hood RobberBaron.  I had a great glass of wine and dinner here for well under $20.  Here's to many returns after a hard work week and future date nights.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "I celebrated my birthday with some wine at robberbaron and let me tell you, Luc made my birthday. They went above and beyond to make it one of the most memorable b-days I've celebrated. The hospitality here is phenomenal. Nothing better than great people, great wine, and a great ambiance!! Thank you Robberbaron.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "Cool & cozy neighborhood wine bar that you could actually talk with friends without yelling each other.", "author": "Beril Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "Fantabulous! Was here for happy hour with the Golden Gate Tri Club and they had an excellent selection of wines and AMAZING customer service. Before my wine glass was empty it was filled right back up. I had the Grenache noir which was nice, light and slightly tart. I am moving to the neighborhood so I am looking forward to coming back again and again.", "author": "Kristina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "My husband and I came here last weekend and loved it! The owner and staff were super fun and friendly, the drinks were great, and the only bad news is that I don't live down the street! Also- cleanest bar bathroom I've ever seen. Highly recommend! We will be back!", "author": "Lindsey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "sexy ambiance. \nperfectly curated wine selection. \ngreat nibbles! the tostada is killer. \nluc is the best, go say hi! \noh, and a muy bonita bano! \nlove this new neighborhood gem!", "author": "Stephenie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-07", "description": "This is one of my favorite bars, but I'm giving them 3 stars since last Friday night , September 5th, they had allowed kids -under 5 y/o- at the bar! It was night time after 7 PM at the bar, and these 2 kids were playing and running around. The staff actually played with them instead of asking the kids to at least sit by their parents.", "author": "Monica R B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "Amazing bar and vibe. Def fave in SF. Feels like best west village bars in NYC. Tried a number of rare delicious beers. Bar tenders very knowledgeable and friendly. A lot of regulars which I like. Will certainly be back soon!", "author": "Arthur L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-09", "description": "Met up with some amigos at about 10pm on a Friday at this hidden gem. We were comfortable and cozy, we ordered 2 bottles of wine that was a delish red zinfandel from dry creek valley. Atmosphere was a mixed crowd passing through- service was friendly- cant beat a friendly server guy with a twisty mustache. My friend ordered the Krispy bar- which was out of this world!", "author": "Angelica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "We had a happy hour here a few weeks ago -- the owner did an awesome job setting everything up (appetizers, special drink menu prepared with our name on it). The place just has a great feel -- they've mastered the perfect chic yet welcoming style. Great drinks (still craving the Einstok beer), really fun and friendly staff (love the bow ties).  If we had a spot like this in the Mission I'd be there every night.  We posted up at the bench in the window and didn't leave (AMAZING people watching up and down Polk). I highly recommend for after work, drink date, or meeting up with friends.", "author": "Dolores Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Really happy to see this place reopen with an even better vibe.  The wine is terrific, the small food menu was great, and the service was excellent.  I'll definitely be back again and again!", "author": "DC T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "This place is absolutely amazing - great service and wonderful selection of wine! I randomly came across this place and found out it recently opened. It has a very posh, yet casual ambiance. The bartender was super friendly and inviting. The snacks are delicious. I highly recommend! Oh and check out their cute bathroom.", "author": "Alexandra O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-15", "description": "best bar in SF. From the wine & beer selection, to the incredible bartenders, this place is top notch.", "author": "Jake K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Stopped in on a whim for a friend's 30th birthday last weekend and it couldn't have been more perfect. The owner treated us very well and totally added to the celebratory vibe of the day. Sitting in the window on a sunny day with champagne = perfection. Awesome rice crispy treats, too. I'll definitely be back.", "author": "Christy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "My favorite wine bar ever!  They have an amazing selection of wine and the owner is the best.", "author": "erin e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "Great spot with incredible beer and wine selection! Fun atmosphere and amazing service!  Luca and Matt are great!!! Love it!!", "author": "Rebekka p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "I cannot say enough how much I love this place. Their $25 water is THE BEST WATER ON THE PLANET. Seriously, best water you can get. Anywhere. Plus their beer and wine selection is good.", "author": "Jo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-28", "description": "LOVE the look of this place, but the selection of wines leaves much to be desired. Also, the cost is a little high. If the new owners would run the place like the previous owner Josh, I think it'd make a million. With that said, the staff is very nice. Debating on whether to come back. We'll see if they change anything on the menu.", "author": "C W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Good wine bar on polk street that is a break from all the other bars there.  Sophisticated crowd, reasonable wines, great bartender/owner.  Also serves some food \"picnic\" style which is a great concept.", "author": "around town e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "We were brought here last night with our friends. We shared a few very good bottles of wine that the owner recommended. Very friendly place and the servers were also great. Delicious cheese board and rice crispy bars for dessert.", "author": "C B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "super cool place, they let you try many wines & Luke the owner is so friendly , loved this place", "author": "Tarek S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "I love Robberbaron. They have the most creative wine list in the neighborhood, and you can always ask the knowledgeable staff for recommendations (or a taste!).  Don't miss out on the bar snacks- they have excellent cheeses, charcuterie and my personal fave, nuts and olives!  Great vibe with a friendly regular crowd, which is definitely a reflection of the owner and staff.  5 stars!", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-10", "description": "Thank goodness for a new fun and reasonable wine bar in the neighborhood! Checked out this new spot for a friends birthday tonight and we had a great time. Luc took great care of us with delicious wine and food. We had the olives, hummus tostadas, black bean dip and a sampler form the picnic. All were delicious and something I'd recommend on the menu again! Looking forward to going back time and time again.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "came here on saturday and it was a great spot. low key, great space, friendly bartenders, and great wine. came from dinner so i was too full to try the cheese plate but it looked sooo good. this place is great for a first date or for a semi large group. i would def recommend this place if you're in the mood for wine or beer.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "Hands down the most welcoming and fun bar in SF. The owners create a warm and inviting environment that's rare and all to fleeting in today's bar culture. It varies from family friendly to an all out rocking good time. Lucre, Matt, Danielle and Jose create a sense of community and a flat out enjoyable experience. I thank them for opening up in our hood and cannot wait for their future projects.", "author": "Nika R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "This place is great and the owner (Luke) is absolutely lovely.  She'll give great recommendations (including on occasion what's not on the menu) but is just super friendly and you know she wants to ensure her customers have a wonderful experience.  Thanks!!", "author": "H. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Seriously, worth traveling across town for the wines alone.  Very thoughtful wine list that is diverse, unique and full of character.  Ambiance nice and mellow and very attentive staff.  It's a winner.", "author": "Suzy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "This place has quickly become our favorite bar to go to! Small, but lovely selection of wines, knowledgable and friendly bartenders (owners), and excellent selection of small plates to complement your wine. It is perfect for me and my husband to go down to on a week night looking to unwind from work, and also with friends on weekends to have a great time! I am so glad to have a place like this in the neighborhood!", "author": "Shruti S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "Luc and the gang at Robberbaron have brought something special to the hood. Their goal was to emulate the hard working, successful San Franciscans of an age past, a golden age. Well, Robberbaron has returned Polk to it's golden age. Come here. Just do it.", "author": "Adam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "Love what they have done to the place! Great food as well as vegan options! Nothing like this place in the area, very nice addition, I'm already a regular!!", "author": "Joshua s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "I love this place! It's kinda crazy that it has a four dollar sign rating, though - glasses of wine are very reasonable at 9-13 dollars a glass. The wait staff is professional, super friendly & the wine is great (I'm kind of a snob, so I wouldn't just say that ;)). Definitely my new favorite SF wine bar!", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-07", "description": "What an amazing transformation.  The atmosphere, selection and service are all exceptional.  Robber Baron is a great addition to the hood!", "author": "Joe S."}
