{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "Super simple but so delicious! I always tell people that from the pictures the food looks alright but once you've tried it, you'd want to go back again.\n\nI usually just get the #1, its simple, clean, and filling. You get chicken with rice, some cucumbers with sauce, and a small broth. I was amazed that the rice had so much flavor. It's not just plain white rice, it's seasoned and goes amazing with the soy ginger sauce. I am not a huge fan of ginger but because it's mixed with a semi sweet soy sauce (tastes similar to ponzu / dumpling sauce) the flavor is more enjoyable. They also have hot sauces you can get as well.\n\nI usually get my order to go because the place is small and gets crowded / super loud. This is one of my go-to spots during work lunch hours.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Lots of hype around this place so I had to check it out on my lunch break one day. Let's just say I have been back many times. \n\nSimple chicken, simple veggies, simple rice. Pour the sauce over it all and you got some magic. \n\nLong lines but moves fast. Definitely check it out you won't be dissapointed.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "Simple yet tasty! For anyone working in the Financial District and want a filling lunch, Rooster & Rice will check all the boxes. The line can get long during lunch hours with most tables full, but it's easy to bring back to the office!\n\nThe menu is straightforward without any crazy items. You get a good amount of chicken (or whichever option) for the higher price. I was disappointed that all the flavor is in the sauces. Don't get me wrong, it's delicious but it makes me believe I can easily make this dish at home for a quarter of the price. I do like you get a soup with your meal too! The little things make all the difference.\n\nFor an extra wow, get the soft boiled egg and put the sauce on top! It'll transform your view on the egg! But don't feel pressured in getting an egg. Having worked in F&B, it still feels like a rip off paying a dollar for an egg when they're buying eggs for around 50 cents/dozen. \n\nAnyway, if you're on a lunch break alone or with a coworker, I'd recommend this as an option! I don't think I'd come during dinner or on a weekend lunch, but I like it when I want a solid, tasty choice that can't go wrong.", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "The place was so nice and clean! I went in around 5 on a Wednesday and it only started to get busy at about 6. The employees were so nice, there's a water and sauce station, their napkins are thicc (like, you really only need one and you can rip it in half and it'd STILL be huge), and I love their compost & recycling station. Yay for being environmentally friendly!\n\nAt the other location, I got two soups? And they cut their cucumbers the Thai way instead of just in half. Just making observation, idc, it's just cucumbers.\n\nMY FAVE PART: they have vita milk! It's my favorite Thai brand soy milk and a huge part of my childhood, so I was super excited to see they have it in stock!\n\nLastly, it's super cool how they have a vegetarian option and they REALLY stack up the bowl. My friend was super full afterwards!", "author": "Nassa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "I love Rooster & Rice!!! Simple menu, simple food. I hate that I'm paying double digits for one meal of chicken and rice, but that's my punishment for never cooking at home. Until the day I become domestic af and meal prep, I will be back many, many, many times. Avoid coming here during lunch rush hour! Line can get long (out the door).", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "yup I am officially hooked.\n\nThe chicken and rice they serve here is practically the Thai version of Hainanese chicken rice. I like the fact that the food is so simple yet so delicious. I ordered the #1 (the original) on my first visit here and the staff told me they only had breast meat, no thigh. Regardless, the food was great still. There is a lot of meat and rice in the entree, so you don't have to worry about being hungry afterwards. All the meat is prepared boneless for your enjoyment as well, so you don't have to worry about bones whatsoever.  \n\nStaff members are friendly here. There are also no fountain drinks here as they only serve bottled drinks. I shall be back soon!", "author": "Philip M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "For the busy working people around this area, it really works. I ordered the first combo on the menu, the chicken w/ skin and rice. The chicken is juicy and the sauce that comes with it is delicious. Also remember to take some Habanero sauce with you (available on the small table next to the wall where you wait) because it is sooo good if you are into hot sauce. \n\nThere was a line almost to the door when we got there but we were served very fast, got out of the door in under 10 minutes with our food in hand.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "I was able to order this from Caviar and have it delivered to my office for lunch. Aaaah, my goodness. This dish is so simple, but it was SO good. So much flavor and that chicken was so moist! \n\nTip (if you don't do this already): Pour the broth over the rice and chicken :)\n\nThis was one of the few times where I actually devoured my whole meal with no left overs! Obviously, coming back!", "author": "Khrystine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Very very long lines at lunch time, would\nGuess this means it is a popular place. Seems to be 4 options to choose from on the menu. All seem pretty healthy in general, however, you can extra healthy with options for vegetarians or just protein or protein (skinless) with brown rice. A little pricey for what the food is. Will add more once I try and and give overall opinion.", "author": "Mary W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "This place is great for a quick lunch, but can get a little pricey. \n\nThe chicken and rice are flavorful and moist and I love the dipping sauce and the hot sauce they provide (what more can you expect from Khao Man Gai?). I normally get it with Veggies and Eggs (adds a nice texture to the dish, it's a softly poached egg that mostly yolk), and it comes to a little over 15/person. Which really is a little pricey for Thai Street food, but I guess what can you expect in the middle of FiDi. \n\nOverall, I come here vaguely regularly, and will probably be back for lunch.", "author": "Sophie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "I just love this place! Finally tried this place 3 days ago and have bought lunch here for 3 days!  :0) \n\nSimple, fresh, tasty and steaming hot food and chicken broth! Large portions too! 1st lunch, I tried their \" Original \" with white and dark chicken meat and amazingly delightful white rice which I basically inhaled! I don't like white meat so I dumped it into the yummy soup cup. The ginger soy sauce is tasty too! \n\nYesterday and today, I had the \" vegetarian \" with tons of brown rice, broccoli and tofu! Soup too! \n\nCheck it out if you're in the area.", "author": "Aaa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Food: 5/5 I ordered the original\n- the meat was really tender and the rice was decent. This item also comes with chicken broth which was okay. The combo together was just really amazing yet so simple. \n\nService: Long lines! but it moved really fast imo. we received our food in about 10 minutes or less after paying. \n\nPrice: It is pretty pricey for the portion but the portion given did not leave me hungry.  The price was kind of expected considering the location. Other than that, I think I can get cheaper Hainanese chicken rice elsewhere. I also like their napkins xD\n\nAmbiance: Crowded but a chill place. \n\nWould I come here again? Yes  but not often b/c no money", "author": "Celina D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "Summary: healthy \"fast food\", good-sized portions, limited seating.\n\nDetails: If you're in the Financial District and want a quick lunch, add Rooster & Rice to your list of places to try. The menu is pretty limited --  but there's no issue in doing one thing well. And they do chicken well -- it's plump and juicy.\n\n\"The Original\" is chicken breast and thigh served with the skin on. The skin gives it a bit of extra fat/taste which I recommend but you can order it skinless, if you prefer. It comes jasmine white rice. You can (and should) pay extra for egg or veggies (each are $2). \n\nThere's also an extra sauce option for $1 but you don't need it. There's free habanero and sriracha sauces. We preferred the sriracha -- it had a kick but wasn't too spicy. The whole thing is served in a cardboard container with plastic utensils.\n\n\"The Marina\" is skinless chicken breast and organic brown rice. It's also solid but I prefer the original. If I get this again, I would order the sauce as the rice was a little dry. There're also a paleo option -- chicken and veggies, no rice.\n\nYou also get a small container of bone broth. This was hot and tasty -- a pleasant and healthy surprise.\n\nThis Rooster & Rice location is small with limited seating. Come early or late for lunch to avoid long lines. Also, don't expect a bargain -- with the add-ons it's $15.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Can't believe there is very tasty Asian style fast food in the city! \n\nWe came here around 3-4 pm for late lunch, and was supersized this place was 2/3 full. Normally I am not a big fan of chicken. I chose this place was because I want something light. As you can see in the pictures, the food was light but supersizing tasty. I loved.", "author": "Silvia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "When all you want is simply good chicken, this hits the spot!  Ordered for delivery multiple times and visited in-store once.\n\nVenue / Service: not too many seats inside and the sitting area can be slightly dark, but otherwise clean and not shabby-looking.  I had to wait a bit for a seat since I came during prime lunchtime on a weekend.  The server when I went in in-person was nice enough to explain the menu to some customers visiting for the first time and seemed patient when taking a 10-person order.  \n\nFood:\n-- \"The Marina\" (skinless, poached chicken breast with brown rice)($12.95) - this is my preferred dish, mainly b/c I'm not a huge fan of poached chicken skin.  Even so, never had chicken so simple yet juicy every time (surprising for chicken breast especially)!  I personally don't need any seasoning for this (personal preference) b/c it simply lets the chicken shine.  Brown rice is fine too- seems well cooked to me, but this dish is all about a simple chicken.  Would recommend this one for those looking to get slightly \"healthier\", almost most options here are pretty healthy.  \n\n-- \"The Original\" (poached chicken breast + thigh w/ skin, jasmine white rice)($11.95) - my bf prefers this one since you can get thigh meat and he loves the skin and white rice.  Pretty tasty too.  \n\nAll in all, it seems like such a simple, boring dish, but Rooster and Rice shows how simple can sometimes be the best by highlighting the chicken.  Would highly recommend for delivery for a light dinner!", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Not only was I born the year of the rooster, I am also a HUGE fan of rooster & rice!\n\nThe khao mun gai here is the best I've ever had.  The Original is perfection.  Plenty of chicken served on top of fragrant rice, delicious sauce, and a side of broth.  Grab a side of habanero sauce and your palate will be super happy.  \n\nI did try it once with the egg but found it unnecessary.  Everything is super moist so you really don't need the egg for additional texture.  \n\nThe service is super friendly here.  The food is served quickly and you're out of there in a flash with a delicious, piping hot meal.  I could prob eat here every single day.  I believe they have 3 locations in the city for your convenience.  Parking here can be rough.  \n\nOtherwise, a super fan and totally deserving of 5 stars!", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "The line is always out the door during lunch, so that is a testament of how tasty the dish is. Who would've thought such simplicity could taste so satisfying!\n\nThe menu boasts variations of the standard chicken & rice dish, with a version that is vegetarian-friendly. The dipping sauce pairs perfectly with the chicken and jasmine rice, and so does the broth that is included. Chicken is juicy and the jasmine rice is flavorful. This is a prime example of a healthy, but very delicious, meal!\n\nAt about $12 (pre-tax) per set, this isn't the most bang for your buck. However, it is a nice treat whenever you get the Khao Mun Gai craving. 4 stars instead of 5 due to the lack of customer service, but expected I guess since the place is always poppin'! Highly recommend stopping by for lunch when you're in the area!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "Love this lunch spot. nice music and ambience. Clean. \n\nI got the Paleo - chicken (half thigh and half breast) with broccoli. The chicken was tender. Broccoli is cooked just right. A bit of ginger and garlic in the dipping sauce. \n\nI love it that the portion of broccoli is actually sizable - making me feel quite healthy. \n\nThe only thing that I would tweak here is that the side sauce is a bit too sweet - Americanized at the core. A bit less sugar would make this the perfect lunch.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-21", "description": "Probably one of the best chicken and rice I have had state side. Here is my breakdown:\n\nPROS:\n- Insanely moist chicken, even the white meat\n- Full of flavor \n- Rice is made well\n- Everything tasted fresh\n\nCONS:\n- Portions are small\n- Prices are a bit high for the quantity of food\n\nOverall, a great meal and I will certainly come back. Note, there tends to be a line during peak hours.", "author": "Phat T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Chicken and rice, how can you go wrong? Khao Mun Gai (or in Viet, Com Ga Hai Nam) is my ultimate comfort food so I was ecstatic to find a spot so close to Yelp Headquarters that specialized in this dish.\n\nAnd Lordy, Lordy it was fantastic! The chicken was perfectly poached. The rice was loaded with flavor since it's cooked in chicken broth and chicken fat. And as a welcome, non-traditional spin you can add fried chicken skins on top for mere pennies (I highly recommend it!). It also comes with a delicate broth to sip on as well as an umami packed ginger sauce for dipping. I can't think of a more perfect meal. I ate the whole thing with complete and utter abandon which led to a giant post lunch crash but it was absolutely 100% worth it.\n\nIf chicken and rice isn't your thing (we probably should not be friends) they offer a paleo and vegetarian combo as well.", "author": "Kimberly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "I'm from Singapore and I love chicken rice. I suggest getting their breast skinless chicken with WHITE rice. I love the soup too! I wish they had more \"original\" spicy sauces. \nIt's almost always crowded so be prepared that you wont find a spot to sit. Sometimes they do run out of silverware... \nGreat work day lunch spot!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "The Original (#1) is always worth ordering and it is my favorite when I visit Rooster & Rice. This is the second location and always a positive experience. I truly appreciate the cleanliness and simplicity they use.\n\nI really like how they put together the meals. It's neat and artistic. The (#1) which is what I ordered contains chicken meat with skin, rice, broth, sliced cucumbers and cilantro.\n\nA truly satisfying positive first experience here, I highly recommend it and will definitely come back. I certainly enjoyed my meal here.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Street food is the essence of Southeast Asian cuisine.  Chicken and rice is a basic dish in almost all cuisines.  A staple that many connoisseurs seek here is the famed Hainan chicken and rice.  This is offered mainly in Malaysian/Singaporean though sometimes found in Vietnamese or Burmese restaurants these days.\n\nRecently, many of classic Asian dishes are making their way to the mainstream market including this.  My search for this, my dad's favorite, led me to ABC in Chinatown (closed about two years ago) and Banana Island in Daly City. Late last year, my friend surprised me with a box on our way to a Warriors' game with a box of food (https://www.yelp.com/user_local_photos?select=jLV0bGDuLgzOc6m2mydEmA&userid=saJuyv784apZzH--psHZ3Q).  It turns out my friend ordered the Original (https://www.yelp.com/user_local_photos?select=1dmW1YjvNODDhJXpRymj9Q&userid=saJuyv784apZzH--psHZ3Q).  I took a few bites only that night as it was late by the time I got home after the game.  It was delicious but would definitely keep me awake on a work night.  I actually had this the next day (do not advise reheating) for dinner.  Here is my checklist for this dish:\n\nChicken - perfectly sous vide as you don't need teeth to chew this; nice that they use breast and thigh meats and there are no bones to pick here... literally.\n\nRice - nicely flavored and actually didn't starch up like most when refrigerated; some places use butter to sauce this up but it tasted like they use the broth from the chicken likely.\n\nCondiments - the dipping or pouring sauce (your preference) paired well with the chicken and the rice, not overpowering; would have enjoyed a second sauce (red chili sauce is the norm in Asia and many places here).\n\nFor leftovers and, moreover, for such a specialty dish, I was surprised that it was still so good the next night. Price wise, don't expect street food pricing especially given the location and cost of doing business here.  Will try to stop here for lunch one of these afternoons and try it fresh.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "We had high hopes for this chicken and rice.  This was recommended by several ppl and all raved bout it.  We got here on a Saturday afternoon lunch time and this place wasn't too packed .  My husband got the original and I got the paleo ( chicken w veggies).   We got our food in about 5 min or so.  Not a long wait.  We got the chicken thigh and to both of us .. the chicken wasn't juicy at all. It was borderline dry.  The sauce wasn't too bad.  This to me was just average . Definitely not something I have to have.  Good lunch time spots for a Monday thru Friday job but not for a weekend splurge.", "author": "Joyce W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "Not bad. Very promising restaurant. I loved the concept and the simplicity of the menu. Down home comfort. I was intrigued by the Hainan-Style Chicken that was served with rice cooked in their homemade chicken broth that the chickens are boiled in. \n\nI ordered \"The Original\" aka Kai Mun Gai. Verdict? Let me break it down:\n\n* The Chicken: Very moist. I was afraid it might taste \"gamey\" but had a natural chicken flavor throughout. Wished it was served skinless as the skin can be used for chicken cracklings (as they do serve at the Filbert St location). It is served with cucumbers which I loved to cleanse the palate and cut through the richness of the protein. I wasn't into the soybean ginger sauce as it was too overpowering for the integrity of the chicken lol!\n\n* The Broth: Very clear broth which means they cooked it right and skimmed off all the impurities from the cooking process. However, it was heavy on the salt. I had to dilute it with some water to tone it down. It would've been so comforting:(\n\n* The Rice: OMG...the rice was SO FLAVORFUL!!!! Very aromatic and you could really taste the chicken broth it was cooked in. I could just eat this alone with their house habanero sauce ( which is so good for all you spice lovers)!\n\nConclusion: I would go back again to give them a second try but I'll probably end up going to the Filbert St location as they serve the crispy chicken skin. Service was superb though...the lady was very accommodating. $17 for my whole meal with sparkling water. Kinda pricey.", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "I love hainan chicken. If you love it, you'll love this place too (but if you don't, they really have nothing else).\n\nTo me, good hainan chicken depends on the tenderness of the chicken and the depth of flavor of the rice. This place has both. The chicken is not dry and the rice is very flavorful.\n\nI also like the sauce that comes with it too. Nice amount of salty and sweet and compliments it well. Absolutely recommend the broccoli and egg as it adds something additional from a texture and flavor standpoint. The egg makes everything creamy and the broccoli has a nice crunch.\n\nGreat spot and if I'm nearby, I'll come again.", "author": "Mark F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "Love coming to this place. It's a light meal but full of flavor and it's quick. The sauce is a must and I like to add a little hot sauce to mine because who doesn't like a little heat? The lunch line is long but don't let that detour you because it goes by fast. Def on my places to go to when I'm on lunch.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "I love Rooster & Rice. Visiting the Kearny St. location finally completes my trifecta. I first went to the Marina when it was relatively new, followed by SoMa and now FiDi. Each one is equally delicious, and I always get the same thing: The Original.\n\nWho knew that something as simple as chicken and rice could be so good? I don't even normally like chicken, but I crave Rooster & Rice often. The sauce is phenomenal, as is the hot sauce and chicken broth you get on the side. Portion size is perfect, too.\n\nIt's a little pricey for what it is, but this IS San Francisco. The line is always out the door during busy lunch hour, but luckily I came here on a Saturday right before going to work. It was practically empty, and I easily got a seat on one of the size benches.\n\nI'd definitely recommend coming here if you haven't already tried it. There's lots of other eateries along Kearny St. if it gets too busy, but arrive a little early, and you might get lucky. Totally worth the wait either way.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "A coworker heard a Rooster & Rice location opened up by work. She stopped by without telling me (we both adore checking out new places), but dropped by my desk afterwards to share her lunch. This was on Tuesday, December 19th around 1pm.\n\nI believe she got ​The Paleo: Breast or thigh & seasonal veggies version of Khao Mun Gai: Poached, organic chicken over fragrant chicken rice, garnished with cucumber and cilantro, Served with a fresh chili, ginger, garlic and soybean sauce and a side of chicken broth. Her dish didn't come with rice, just broccoli, so I'm assuming that's the right one. I adore chicken and rice, so I tried the chicken, veggies, and their sauce. The chicken was moist and tender. The broccoli still retained a slight crunch which I love. Their sauce was also good. A little spicy, savory, and sweet. I just wish there was more of it.\n\nI'm not a big rice person in general, but if you cook it in chicken broth, that's a game changer. Would love to come back and try their original chicken and rice. I just wish they had more add on options. I adore adding liver to my khao man kai.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "I live for Hainan  chicken. It is my entire existence.\n\nOk so basically 4.5* but don't sweat the detail.\n\nOne of the first thing I did upon moving across the continental US was to yelp for a good hainanese chix place near my apt. At first there wasn't much good options so I had to import my hainanese chix from Millbrae (shout out Ipoh garden). The other choice was to get delivery khao man kai from House of Thai which is good but not enough.\n\nSo when I saw R&R about to open near i-Tea I was hype. \n\nThe Original so superb and though I sort of wish for the bone-in + more skin experience I'm still thoroughly satisfy. But I guess people are afraid of chicken skin/bone these day because skin = unhealthy?idkwut. The sauce is perfect, the chix is perfect, the rice is perfect. My beloved gist of hainan chicken is now so close to reach. I would do my boba run at i-Tea and pick up some chix rice for THE perfect meal combo. Also dem broth is gorgeous, thank you very much.\nAdd in some beautiful habanero sauce and we have a party.\n\nThe only negative is the wait. It seem to take forever and they can get quite busy, despite my usual awkward hour of dining (lunch at 2pm). Also they close sort of early at 8pm and are not open on the weekend leaving me with not a lot of chance to come here since I usually work til fricken 9pm T_T I would eat here more than once a week if they open a wee bit more but issok I understand. \n\nI also find a workaround for the long wait: CAVIAR ORDER PICK UP. YESSSSS Although sometime they turn off Caviar pick up so I can't pre-order = me waiting in the place forever for my food. \n\nOtherwise I love you chicken rice.", "author": "Quynh Nhu D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "My fav lunch spot in the financial district. \n\nSometimes there will be a line but don't worry the line moves very fast. Most people got take out anyways so there were always plenty of seats. \n\nI got The Original chicken rice ( with both chicken breast and thigh). It also came with a small bowl of chicken broth. Really cannot go wrong with this moist chicken rice combo! The soy sauce mix was on point, not extremely salty.", "author": "Ava A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "To mix or not to mix, that is the question!  Whatever your answer is, it will be delicious.  Tender chicken, rich chicken-infused rice and a myriad of flavorful sauces.\n\nThe Original: Love the rice!  Tastes like they use a bunch of chicken fat and chicken broth, so it's almost like eating chicken risotto.  The poached chicken itself is quite tender.  I appreciate that it's warm (...hate when places give you cold chicken) and doesn't have too much fat/skin/gristle.  Sometimes when I get this dish (or the Singaporean variant) at other places, I end up throwing a lot of the lesser chicken cuts.  Here, it was mainly just white meat and dark meat.  I liked the salty soy dipping sauce a lot.  But I really liked the house-made habanero sauce!  It obviously had a spicy kick, but also tons of other nice flavors.  The broth was a nice palate cleanser between bites.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "If your going to have one thing to sell, it better be a winner winner chicken dinner!  And that's exactly what they did.  All they sell is chicken and rice, and a pretty darn good one too.\n\nThe poached chicken was silky, moist and was as simplistic as can be.  The rice was flavored by the chicken stock and  the soup was seasoned nicely.  But that sauce, that chili garlic sauce, it was everything!  And it brought the dish together.\n\nI can eat this every other day.  It is the ultimate comfort food.\n\nGood customer service.  Takes about 10 minutes for your order to come out.  Good portions.  Wish they had different size orders.", "author": "Jenny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Solid choice for the Kearny street lunch crowd. It aint cheap but the quality is really good and tasty. \n\nI have been three times now and it gets really busy by 12...just saying.\n\nDefinitely try the classic with an egg ( $1 extra)....it is really delicious.", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Great meal!\nGood value.\nExcellent chicken!!\n\n20 minutes was too long to wait after ordering.\n\nMaybe stop taking orders when there is no place to wait?\n\nI came in on a Thursday at 11:12 waited in line for 15 minutes and didn't have my great lunch for another 20 minutes. These times are simply not worth it, especially since I'm at work.\n\nThe chicken is excellent. I mean really good. I highly recommend you come in and give 'em a try when they're not packed.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Can't stop thinking about this place since I first had it this week. I love chicken and rice so very sad I didn't try this place earlier. On my errands run through downtown, I found this new location on Kearny by Market Street and since it was earlier in the afternoon (around 11am) there was no line.\n\nNot much else to say that hasn't already been said. I got the Original - broth was hot and flavorful, pretty good amount of chicken and rice and that soy sauce concoction was super yummy. Without a drink, the meal comes to a little less than $14. A bit expensive but I think it is worth it for the quality and flavorful ness of the food you end up getting. I even recommended it to my Asian mom. We'll see what she thinks..", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "This is the newest location in my area...legit chicken for lunch!  \n\nClean, pretty fast service and friendly people.  My only complaint is that the chicken was kind of cold by the time I got back to my office because the lid wouldn't shut and it was probably the first few days of opening so they were all still pretty new to everything.\n\nI'm going back with coworkers for sure though.  My fav is the paleo option...skip the rice!", "author": "Kimberly L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "Came for lunch around 1 pm.  Short line, not a long wait for food.  Seating is very limited, but got lucky that a table freed up right after we ordered.  Staff is friendly and helpful.  We were dying of thirst and ordered 3 bottles of water.  The girl taking our order suggested we go next door to Walgreens to get the water cheaper!  Thanks for the tip!  Saved $6!\n\nThe Original ($12) Chicken breast and thigh over chicken broth rice with a side of cucumbers, sauce and chicken broth.  The portion is decent for the price.  The sauce, tasty!  The rice, deliciously flavorful! If I were to just order the rice by itself, I'd be in heaven!  The thigh meat was cooked perfectly, tender and juicy, and tasted delicious with the sauce.  The breast meat was a bit drier and tougher.  That was disappointing.\n\nMight try it again.  My husband has brought it home before and the breast meat was more most than today's, so I'd try it again.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "After seeing my coworker eating Rooster and Rice, I really wanted to try it, too. I got The Marina (#2 on the menu), and at first the chicken looked pretty dry, not what I was expecting. When I saw my coworker's chicken, it was all drenched in wet sauce. Then I realized, I had to do that myself with the little sauce container that they provide.\n\nOk, now I dig in... and wow, the chicken not only _looks_ dry, but it actually _is_ dry inside. The sauce on the outside tastes good, and I want the entire chicken to be marinated and cooked in a pot of it! But I guess after eating this healthy clean chicken breast, I don't feel oily and crappy on the inside. Also, the broth that comes with it is hot and delicious!\n\nOverall, although the chicken was dry, I did enjoy it. The price is high ($13 for a small box) and I usually add an egg to my food when I have the option to, but I refuse to pay $2 for one here. If the prices were lowered a bit, I will definitely come back again.", "author": "Wesley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Amazing organic chicken! I had the #1 Original which comes with organic chicken (breast and thigh with the skin), jasmine white rice, a couple of cucumbers with cilantro on top. The chicken is chopped above your rice. If you don't like the skin of the chicken, I suggest ordering menu option #2. They also provide chicken broth. There are a lot of sauces to choose from for added spicy. The sauces come on the side.\n\nLastly and for bonus points, the bathroom, CLEAN!!!!!!  Ask for a key.\n\nI will be returning!!!!\n\nCheck out my pictures", "author": "Anita T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "I got the \"Original\" Khao Mun Gai twice and enjoyed my meal both times. The price was reasonable and portion was generous. The meal also comes with a side of chicken soup. I bought a bag of fried chicken skin once. It was greasy, fatty, and a bit too salty for me, but my friend really liked it.\n\nOverall, I've enjoyed my experiences with Rooster & Rice and would recommend it if you're craving chicken rice.", "author": "Vu P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Came here on a weekend afternoon on a friend's recommendation. Normally, I'm not a fan of chicken, but I didn't really have a preference for what I wanted to have for lunch that day so I just went along with this. Other than the recommendation, I didn't really know anything about this place before I came here, although I did pass by this place a couple of times. \n\nWhen I saw the menu, I was surprised that they only had four items on their menu. But maybe the simplicity of their offerings allowed them to focus on the quality of their food. I was thinking about getting The Marina or The Paleo, but I was feeling like getting some rice, and The Marina didn't seem to have chicken thigh. I ended up getting The Original since it had both chicken breast and thigh. \n\nThe Original has slices of chicken breast, thigh, rice and cucumbers along with a cup of chicken broth. It also came with the chili, ginger, garlic and soybean sauce. The chicken broth was pretty clear and tasted great. I liked the chicken thigh better than the breast, and it was good by itself. However, my favorite part of the dish was the sauce, since it really enhanced the flavors of the chicken and rice. Was a very nice touch to the dish. \n\nI added a small spoonful of the rice to the broth, and it was awesome. I probably should have set more rice aside given how much I enjoyed this. I'll remember this for next time.\n\nChicken's not really my first choice of protein, but the sauce really did it for me. The broth was excellent and only made the dish better. Overall, Rooster & Rice deserves a solid four stars, and I would get The Paleo if I come back. Highly recommended for chicken enthusiasts.", "author": "Nelson X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "Pretty good chicken and rice spot in SF. I got the #1 \"the original\". The chicken was moist and flavorful  the soup was also really good. I really liked dipping with the habanero sauce, it had a nice kick to it. To me, the serving was pretty big. I couldn't finish it all, but that's just me. \n\nThere's some seating inside. I think it gets pretty busy during a weekday lunch. I came on a Sunday afternoon so relatively no line.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "I got The Original the first time I had R&R, and I was SO mad. I'm in the middle of this struggle to try to live a healthier lifestyle, which means eating fewer carbs. Yet here I was, finishing every last grain of jasmine rice that was given to me in this deliciously packed container. Nooooooooooo the diet that I (haven't) tried hard to sustain gone down the drain... (I'm totally kidding btw because I eat dessert like every 3 hours)\n\nThen, I discovered The Paleo, where you're just served chicken and broccoli with a side of broth! Can't say I don't miss my grains, but at least now I can be happily stuffed and be at a recommended level of daily carb intake.", "author": "Claire W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "Plain boiled chicken with rice. That's it. For $13.50 (tax included). This is like the McDonald's of Thai food. Also what's the point of the chicken broth? Maybe instead of the bland broth you could put a could of veggies in with the bowls. \n\nOh and whatever you do, DO NOT FORGET YOUR NUMBER. I came in on a Saturday afternoon when the place was empty. The cashier took my order and then two minutes later called my number. She then asked, \"Where's you number?\" Me: \"I think I just threw it away by accident. But you literally just took my order two minutes ago.\" Her: [Clearly disappointed with me] \"Next time bring your number.\" \n\nFor real? That's the battle you want to pick on a quiet Saturday afternoon? Here's a thought: next time tell me I need to have my number when I pick up the food. If it's that important to you, tell me. Otherwise I'll just do what I do everywhere else, which is remember my number then pick up my food when it's called. \n\nThis place really doesn't do anything particularly well, and for that reason it's not worth a second visit.", "author": "Michael R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "If you want a quick meal with chicken and rice, check this place out.  With four items on the menu using farm-raised chickens, the meat is tender and tasty with their sauce.  It's the Thai version of Hainanese chicken rice without the broth soaked into the rice. Of course, it can't compare with Hainanese chicken rice in terms of authentic flavor and price, but it's worth considering if your other options are Chipotle and sandwich shops.  \n\nService is fast and friendly in a clean and minimalistic setting.  It's within walking distance of BART to avoid parking on the street and lots.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Solid chicken and rice spot, but not sure that I'd come by if there were the long lines that other reviews have mentioned.\n\nDon't even bother trying not drive/park here, it's in the middle of the worst area to park of SF.\n\nI'd say that pretty much any option is great on the menu, but I tried the classic #1.\n\nFood is great, Prices are a bit higher than I'd love, which is typical of SF, but other than that, I had a great experience!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Truth be told, I couldn't imagine what the big deal was with Rooster & Rice...after all it was simply chicken and rice + a sauce...clearly I was impressed\n\nChicken - moist, copious amount, and tender\nSauce - a nice kick balanced with a rich umami base\nBroth - a rich clean chicken essence \nRice - cooked well and a good amount of it to go around \nVegetables - fresh and adds a nice crisp texture \n\nOverall Thoughts\n\nI would gladly come back again", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Yummy quick Thai chicken rice. Available in Original, Marina, Vegetarian (tofu instead of chicken), and Paleo. Simple. Delicious. Great for a quick bite if you're around Union Square/FiDi. A little pricey for fast food but in the realm of SF normal. Would definitely come again!", "author": "N C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "I would give this place a 3.5 star.\n\nMy friend had been wanting to try this place and we walked right by, so we decided to stop for a late lunch. We walked in and there wasn't a line, but quite a few people sitting to eat. There are only 4 menu items, so we decided to both get the original. \n\nThe food is probably ready to go because our number was called pretty quickly. With each order, you get soup and a sauce to go over your chicken/tofu. The soup would be the perfect soup for a cold day or if you're feeling a little under the weather. It was quite refreshing.\n\nIt didn't seem like that much food for almost $12, but I guess that's SF for you. Anyways, the chicken and jasmine rice were delicious. The sauce it comes with has some ginger taste to it and it goes well with rice. This dish, however, just reminds me of a Cantonese steamed chicken with ginger sauce, which is why it seemed quite overpriced for what it was. Maybe their chicken comes from a more free-range place than Chinese butcher shops or something, but I don't think I would come back to eat here again. Don't get me wrong, the food was really good. It's just that I can eat this at other places that taste just as good and maybe a little cheaper too.", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "I come here for lunch at least once per week. The line looks intimidating but it actually moves fairly quickly, they are a well oiled machine.\n\nOnto the food, which is what you come here for. They serve chicken over rice, with a soy sauce based sauce. Simple right? Be prepared the chicken thigh is so moist and the rice is just perfect. I normally get the original with white rice and I add brocolli which comes out to just about $15, which is pricey but par for course in the area. Bonus they serve a chicken soup with all meals which will warm you right up on one of those cold San Francisco days. \n\nStop by ASAP if you have not tried it!", "author": "Kevin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Thank you Yelp!  I needed a quick bite and was amazed to find two of my favorites (chicken and broccoli) together here at Rooster & Rice.", "author": "Jeffrey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Simple and healthy - Rooster & Rice has a streamlined menu with basic offerings that excel in both taste and quality.\n\nLike the name implies - Rooster is all about the poultry. They have mastered the art of cooking organic chicken.\n\nTheir most popular offering is their Khao Mun Gai, which is an organic poached chicken dish accompanied by light chicken rice and served with a fresh chili, ginger, garlic and soybean sauce.  If you're vegetarian, they have an organic tofu dish which comes with brown rice and seasonal veggies (usually steamed broccoli). They even have a Paleo version, which omits the rice.\n\nFor a wholesome organic lunch in the Financial District - Rooster & Rice is a superb choice. The staff are efficient and the food is both wholesome and delicious.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "There are dozens and dozens of food in this city at any given moment. It would be impossible to visit them all, let alone try every dish from each: Many of them move around, and many offer an almost dinerlike array of options .\n\nBut here is my favorite place chicken over rice with specialty sauce is real authentic Thai fast food. \n\nThis place is the best of the  best \"Kao Mun Kai\"  in San Francisco.", "author": "Chinnakrit W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "I wasnt mind blown about this place. Maybe because im used to this home-style type of food.\n\nChicken was tender, rice was flavorful, soup was salty, sauce that it came with was good.\n\nFor $15 though.....double the price of nongs khao in portland, DEFINITELY NOT WORTH IT. I thought $9 for that was expensive.", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "This food is super flavorful, but I think a bit on the pricey side.  If you want to lighten up your meal I would suggest adding veggies (for an extra fee).  The original comes with jasmine rice, poached chicken, four tiny pieces of cucumber, and a delicious ginger sauce.  They also throw in a cup of broth, which is a nice touch.  Don't let the pale colored chicken fool you, it's moist and flavorful.  They offer a vegetarian options as well.  Definitely worth a visit.", "author": "Chira E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "The menu is super simple with less than 5 items. I tried the original. It's basically like a Thai version of hainan chicken. The chicken was very tender and delicious. The soup was great as well. My only gripe is with the sauce- it's very good but I wish it didn't come with bits of ginger. \nAlso the lunch line moves pretty fast.", "author": "Jenny J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "There's nothing like your first time for anything I suppose?  For better or for worse, you always remember your first time for anything.  The first time I've had poached chicken (Hainanese tho) was at Banana Island when I was in high school.  I've had several since, but I could never find one that excited me like the first time.  Let's face it poached chicken itself isn't exciting even if the skin is still on, but when you pair it up with flavorful soy ginger garlic sauce + a hot sauce it's pretty special.  And still healthy, right?  That's what I'm telling myself.  And let's not forget the chicken fat rice!  Okay, that may not be healthy, but healthier than greasy fried rice, yes?  I've always loved Hainanese Chicken and from time to time have the craving. \n\nI've had Rooster & Rice bookmarked for their version of this treat, Khao Mun Gai, ever since they opened up their first location in Marina.  But let's face it that location sucks for parking.  And of course their 2nd & Folsom St location opened way after I stopped working in SOMA.  So you could imagine how excited I was to see when the Kearny Street location opened.  After one failed attempt after my 11:30 Barry's class got out, I wasn't going to wait in that long line!  So, I made my way to the shop around 11:15-11:30 on a Friday a couple weeks later.  There were only a few people inside and no line.  I ordered the original though I was trying to be good and contemplating getting the Paleo for the broccoli.  The Original comes with breast and thigh meat, chicken fat rice, chicken broth and this amazing soybean ginger garlic chili sauce.  They also have Sriracha and a habanero hot sauce at the utensils station but you won't really need it because 1) their sauce has a little spice to it and 2) it's cracktastic!  \n\nAfter a few minutes my order was ready and I brought it back to the office to indulge in.  I took sips of the comforting flavorful chicken broth.  My coworker said it smelled amazing and reminded her of posole.  LOL Anyways, the chicken was super moist and light even the breast meat.  It had some flavor but the wonderful sauce takes it to another level.  Lastly, the chicken rice was flavorful and fluffy, and the slices of cucumber rounded out the dish to give it some crunch.  I loved the sprig of cilantro too.  \n\nIt's a bit priceyish at $12 pretax but it's a wonderful, comforting, and delicious treat.  And depending on how you look at it, healthyish.  The portions are generous too and I know you can add an egg on but I think it's satisfying enough without it.  I'll be back!", "author": "Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "I went here with Debra R and Jose R. I got the original. Debra R got the paleo and Jose R got the marina. The food was really good and the customer service was good too.", "author": "Julia R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "Located in the FiDi area, Rooster & Rice is what I would consider a good deal for lunch. You will definitely be full, if not have a bit left over, for the princely sum of $14 after tax. In an area where lunch can easily be $20, this is an everyman's meal and hits all the criteria for the kind of lunch area you would want to go, if you work in this area. I don't work around here nor live close to here. I was craving some Hainan chicken and rice and even though Rooster & Rice markets themselves at Khao Mun Gai, it's similarly enough. A quick walk from the Montgomery station and I found myself behind a quick moving line. I got the original-chicken breast and thigh over jasmine rice. Some cucumbers on the side. No egg. I received my order pretty quickly (checkmark on quickness of service, v. important when you have to rush back to work). At home, I dug into my food and..felt meh. The meat was not as tender as other Khao Mun Gai/ Hainan Chicken I've had. It tasted rubbery after a while and bland. The sauce that it came with helped but the chicken is definitely a 7/10. The rice wasn't too bad, flavorful but it was weird. Some of it seemed to have not been cooked in chicken fat, leaving 85% with that melt in your mouth chicken fat taste and the rest (15%) loose, bland white rice. What was the point of the cucumbers? They were soggy and most likely served as decorations. I felt some regret as I bit into the first slice. I should have known better. Perhaps it was because I wasn't rushing to devour my lunch before my lunch hour was up, which was why I tasted everything so succinctly but next time I have a craving for Khao Mun Gai on a day off, I'll look for somewhere else. But if you work in the area, this definitely checks off all the marks for a work lunch.", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "Hit the spot for my rice and chicken craving. I'm a huge fan of Nong's Khao Man Gai in Portland, so when I saw a chicken and rice spot in SF I was ecstatic!! Simple, good food. The dipping sauce was more soy than ginger for my liking but good nonetheless. I loved that this spot also had tons of chicken skin on deck (unlike Nong's...they always run out ).", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Simple, healthy, and super flavorful! Loved the Marina with skinless chicken breast, brown rice, cucumber, and chicken broth. Order extra sauce!", "author": "Jennica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "I got The Marina (#2) on my first visit and I have to say, I did not like it at all.  I was actually mad about how much I disliked it.  The chicken texture was just not for me.  But I came back anyway so I could try The Vegetarian (#3) and they have totally redeemed themselves.  The tofu texture was also much softer than I would typically prefer, but there's a good balance with the broccoli and rice.  Love both the veggie and chicken broth.  Wish I ordered extra.  \n\nSuper love how the utensils and the food containers are compostable.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "I've had Rooster & Rice bookmarked for soooo long so I was really ecstatic when I happened to pass by this location one night when I was walking around Union Square!\n\nI came in and got the original khao mun gai which comes with chicken breast and thighs with skin, jasmine white rice, an amazing sauce with garlic, soybean, ginger, and a little bit of chili in it, as well as a cup of chicken broth. I love khao mun gai or chicken rice plates like this in general too much to share it, so I thought that one order is good for one person! It is kind of pricey for what you're getting, since it's not really a fast food restaurant but not really a restaurant either, but hey, it's SF, but also the quality is great... I think it's worth it!\n\nI loved Rooster & Rice so much that I took one of their magnets home with me! This place is awesome, I recommend it 200%!", "author": "Chanel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "I'm ecstatic that they finally opened a location that's close to my work. And they even have more seating than the others!\n\nKhao man gai is the epitome of simple yet delicious food, and Rooster & Rice really does it right. Does it call for a $12-$15 price tag? Honestly, probably not, which is why this review isn't 5 stars. But then again, you gotta consider that this is San Francisco, and you've probably paid just as much for a salad here that's a lot less filling and satisfying. \n\nI've tried the famous Nong's Khao Man Gai in Portland, and I have to tell you, Rooster & Rice is much better. Their broth is much cleaner tasting, and that soybean-chili-ginger-garlic sauce is goddamn irreplaceable and really makes the meal. I always wish that I had asked for extra.\n\nGreat place to grab a healthy and tasty lunch.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-04", "description": "Very average. I came to this restaurant because it was raved on various online blogs. This is nowhere close to the chicken rice I had in Singapore. The chicken was tasty but the sauces were too strong and took away from the usual tastiness of poultry. The broth was also praised on the blogs. I found the broth outstandingly salty. It was like drinking soup out of a can. I am giving it a solid 3 stars because service was quick and food was average. I will not be returning unfortunately.", "author": "Sheila C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "OK... I have to admit, I was a bit skeptical of this place.. come on steam chicken over rice.  This is comfort food.\n\nThe lines are long... get there early and be prepare to take out... there is very little seating.\n\nI ordered the #1 the Original ($11.95) - thigh and breast over rice.  Sounds simple, but it could go soooo wrong.  Rooster & Rice did it right.  Simple steamed boneless chicken chunks (you can tell its chicken) over a bed of chicken broth flavored rice.  The rice is a salty to my taste... but still really yummy.  it comes with side of soy/ginger based dipping sauce... does not really need it.\n\nGreat dish guys!!!", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Rooster and Rice specializes in Khao Mun Gai, which is poached, chicken, rice, and garnished with cucumber and cilantro. On the side you get a great sauce made from chili, ginger, garlic and soybean sauce (tons of flavor and a bit spicy) and you also get a side of chicken broth to mix in.\n\nThe food at Rooster and Rice is very good - the rice and chicken are always well cooked, veggies are fresh and steamed perfectly and the overall dish has some unique flavors.  I typically opt for the Marina ($13) and add veggies(+$2). \n\nMy only gripe is that it's so darn expensive for what it is.  I mean chicken breast, rice, and broccoli for $15?  Even in SF, that feels egregious.  \n\nBut hey, the food is reasonably healthy, always consistent, and pretty unique compared to other local options, so I keep coming back.  \n\nDefinitely a good FiDi addition.", "author": "Tom G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Rooster & Rice really reminds me of Nong's Khao Man Gai in Portland. If you've never been or tried, it's the same concept. It's just chicken and rice with that sauce poured on top. Yes, that's all it is. What really makes this basic meal standout is the sauce. I don't know what the sauce is called or how to describe it, but it comes with your order and you pour it all over your chicken and rice and it brings out all kinds of flavor. \n\nI got the Original, which consisted of chicken breast and thigh meat on top of a good amount of jasmine rice. Also included in the meal is a chicken broth soup. The menu is just as simple as the food as it only has 4 different choices to choose from. For the vegans out there, there is something for you on the menu too. Instead of chicken, it's replaced with tofu. \n\nMy only gripe about this place is that it's price. After getting a thai tea with my meal, I was $15 poorer. I mean, I understand it's the City and all, but for food this simple, it shouldn't be this expensive. Despite that, I'll probably still come back. Not like I will be breaking the bank eating this daily.", "author": "Jackie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Simple, tasty food that's somewhat pricey. The original chicken comes with rice, a cup of broth, and a few cucumber slices, all of which are unremarkable. The only source of flavor is the sauce, and covering as much of the chicken with it makes it really tasty. Still, the price doesn't justify the meal for me, especially the lack of decent veggies. Add some steamed broccoli and carrots and I'll gladly pay $11.95", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "When I found the first Rooster & Rice on Filbert off Fillmore a scant two years ago, I was thrilled to discover a place that served one of my favorite dishes, Thai-style poached chicken or khao mun gai, and nothing else (review: http://bit.ly/2uXGQ5b). After downing the Original in record rime, I remember asking co-owner Bryan Lew if he was considering opening another shop closer to SoMa as I said I would be a more frequent customer as it takes me a while to get to the Marina on MUNI. I think I may have offered to wear a chicken suit and sing \"Tennessee Bird Walk\" a capella on the sidewalk. Lucky for you it didn't come down to that, and in fact, I was surprised he made it happen with not only a SoMa location (review: http://bit.ly/2D1q7mC) but now this spot in the heart of the FiDi right on Kearny.\n\nIf I was still working in the FiDi, I'm guessing I would be there every other day. Going every day might border on the ridiculous, don't you think? I met Jamie W. here after work as herds of office workers were making their way to Market Street to get home. There was only one young Asian couple dining here, so service was pretty fast. In fact, most of the customers who came in after us were young Asian couples with the occasional tall blonde boyfriend looking bewildered that he didn't end up at Chipotle like he suggested. The staff was also unsurprisingly young and Asian. We were thrilled they served the $12.95 Paleo because Jamie and I are trying to minimize our intake of rice even though the Hainan-style rice is extremely tasty. In its place was quite a bed of steamed broccoli florets that were just tender enough (photo: http://bit.ly/2CU85P5).\n\nWhat was nice was the choice you get to make between a breast and a thigh for your poached poultry. Jamie likes his white meat and I like my dark. It came with a snappy dipping sauce made of chili, ginger, garlic, and soybean as well as a cup of intensely flavorful chicken broth (photo: http://bit.ly/2FqrTv0). That could have been enough flavor, but we took advantage of the habanero sauce and sriracha and splooged our chicken with sheer delight (photo: http://bit.ly/2CS9cPp). I threw aside the fresh cilantro because I'm not a fan, but the cucumber slices provided a nice crunch for contrast. Much to my surprise, I've noticed a recent boom in similar khao mun gai shops like Chick'n Rice in Berkeley (review: http://bit.ly/2qUK09k) and Hawking Bird in Oakland (review: http://bit.ly/2miv3Ix), both quite good but Rooster & Rice definitely have the head start and the savvy to sell a paleo version for increasingly selective eaters like us.\n\nFOOD - 5 stars...that chicken thigh is cooked just right now\nAMBIANCE - 4 stars...more spacious than the other locations, fits snugly in a prime FiDi location\nSERVICE - 4 stars...the operation has gotten a lot more streamlined and efficient over the past two years\nTOTAL - 5 stars...the current champion in the local khao mun gai wars", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "Ordered \"The Vegetarian.\" That's what it's called. Not \"Vegetables and tofu\", but \"the vegetarian.\" So when I opened the container of broth that came with it and took a sip, what I was *not* expecting was chicken. \n\nI understand that some people may want vegetables on their rice and chicken in their broth and that's fine, but if you're going to advertise one of your meals as \"vegetarian\", and you see someone has come to a place called \"Rooster and Rice\" because that's where their officemates or whatever took them and then that person orders the \"vegetarian\" option, you should probably at least verbally confirm whether that person wants chicken broth or not. \n\nAlso the tofu and veggies were meh.", "author": "George M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "I'm a big fan of the rooster and rice on 2nd and Folsom. As you can guess, this is their new location. I came here after work around 6pm and there was no wait which was great! Same as the original location. \n\nI felt the portion size was a bit smaller here but that might just be because I was hungrier. \n\nYou know the drill. Classic chicken and rice, add the egg. Don't pour the entire sauce into your meal unless you really like sodium! \n\nBe prepared to wait a while if you come during the busy lunch hour. You can also order them on caviar to avoid waiting in line :)", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Pleasantly surprised by the quality and taste of the food here. I ordered the dark meat \"paleo\" bowl and was in love with their ginger/garlic dipping sauce.  The best part was probably the soothing bowl of broth that comes along with your order. \n\nWould i come all the way out to this part of town for this dish? Probably not (i live in the outer sunset). But, if they ever open another location i would make this a go-to fast/casual meal. \n\nEach bowl is approx $12-15 which is a tad more than you would find in traditional asian/southeast Asian restaurants. Nonetheless, they do hainan chicken well. So they have my vote.", "author": "Diane T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "This would have easily been 5 stars as the food was amazing, except for the price of the dishes. \n\nThe menu is simple enough - basically there are 4 options:\n1. The Original ($12) - breast + thigh + skin over flavored jasmine rice\n2. Breast with brown rice ($13)\n3. The Paleo (a whopping $13) - Breast or thigh with veggies\n4. Vegetarian option subbing the chicken with tofu - please don't even think about this one\nYou can add toppings at additional cost, so it can easily rack up to a $15 plate for chicken, some rice, and whatever topping you picked.\n\nAs their name suggest, please order chicken with the flavored rice (I am not sure if the brown rice alternative is comparable). For those who get their daily carbs from whiskey/wine like me and generally would order something like The Paleo - stop it and give in to the delicious rice that is meant to accompany the chicken.  \n\nWith my Hainanese roots, The Original really hit home for me and was very reminiscent of the Hainanese chicken rice. The major difference is the sauce, since this is a Thai chicken and rice. In The Original, both the breast and thigh chicken were succulent, but dunking it in that chili garlic soybased sauce was heavenly. The sauce is not overly garlicky, but you may still want some gum afterwards. All dishes come with a chicken broth that really warms the heart on a cold day. \n\nAt this location in FiDi, lunch time is crazy, but the staff here move the line pretty quick. The place is also small with limited seating, so togo may be the better option. Shoutout to my high school bestie, accompanying me on this culinary walk down memory lane!", "author": "Swan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "I was so happy when I found out Rooster and Rice opened up near my work.  Food is always on point at the Marina location.  I like ordering the original with breast and thigh meat sans skin.  At the Kearny St. location, the soup is slightly overly salty.  \n\nCareful with the Habanero sauce.  I can handle spice, but a little goes a long way here!\n\nI foresee many, many work lunches at this location.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Got the original for just under $12. Wasn't bad and the portions are decent. The westernized version of chicken rice and great for the clean eating diet.\n\nIts a lovely airy restaurant with quite a few tables for customers.\n\nThe only thing I would wish they had was the proper chicken rice chilli sauce that goes with it not the general sriracha. They also provide habanero sauce which has a nice hit of spice.", "author": "Carmen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "So simple, yet so good.  Wow.  I would come back here often.   I would would skip the veg if you don't have a big appetite.  The sauce....wow.", "author": "Lyndsay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "I've only been here twice and I love it! Not only is it simple and delicious, but also healthy. Plus I got a FREE awesome fridge magnet! The layout is very modern, you basically line up and order before either sitting in or take out. I recommend coming here before or after the lunch rush or on the weekend since the line goes out the door and seating is very limited but possible. \n\nFood:\nThe Original - Both chicken thigh and breast meats (best of both worlds) were nice and juicy, served with a side of hot chicken soup, chicken flavored rice, and flavorful sauce which compliments the chicken and rice. I can/would eat 3 servings in one sitting if I wanted to but of course I have to watch my weight. Everything simply just comes together really well.\n\nService:\nEveryone is very friendly so far and I think it's great that they have a self-service booth for water, utensils, napkins, and additional condiments. It allows the customers to be independent and reduces the demand to be served by a staff member, since they provide you with everything you'll need.\n\nI shall be back when I'm craving Hainan style chicken and rice in SF. \n\nThanks,", "author": "Victor Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "This is some damn good chicken and rice. I always find myself craving this place, but the rather high prices help my self control. It's $12 for the original bowl, but I often find myself wanting an egg, which is an extra $2.\n\nNonetheless, the meat is great, but the part that really sets this place apart is the broth. Call me crazy, but I feel that the best way to get all of the flavor out of the food here is to pour the broth all over the bowl and mix it around thoroughly (adding in the yummy sauce of course!). The meat itself just looks really dry and lonely, so to me, this seems like the *only* way to eat this dish. Drinking it separately, as I've seen most people do, seems like a waste of potential flavor synergy, and a really inefficient way of consuming all the food anyway. \n\nAnyway - regardless of how you chose to eat it, it's good, so if you haven't been here yet, you're really missing out.", "author": "Jatin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "I honestly wasn't expecting much since the pictures looked like just normal Hainan chicken, but this place was surprisingly good! I got the original that came with a combination of white and dark meat chicken. The dark meat was really tender, but the white meat was a bit dry for my taste. It comes with a sweet and sour tasting sauce, and it mixes really well with the rice too! They also have habanero sauce and siracha sauce available by the utensils stations. Wish they had the salty scallion ginger sauce as an option too though. Overall, I enjoyed their chicken rice and I'm glad I gave this place a shot!", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Yum! Came yesterday for dinner and got the original plate, came with white and dark meat, some chicken rice and cucumbers.  \n\nThe chicken was poached to perfection, super juicy and tender.  The sauce they give was delicious as well and the addition of the habenero hot sauce made it.\n\nI just wish the portion was a bit larger, maybe more veggies, only got a few pieces of cucumber and not a lot of rice.  The total came out to $13 which isn't bad for a San Francisco dinner.", "author": "Tu T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "There's nothing more simple than eating chicken over rice. I've been visiting Rooster & Rice frequently on Marina & SoMa ever since they've opened and I'm so glad that their 3rd location is literally 2 blocks away from my work! \n\nI'm such a huge fan of Hainan Chicken and it totally reminds me of Nong's Khao in Portland. One of my favorite dish here would have to be the \"Original\" ($11.95 + $2 egg) or if I'm not feeling any carbs then I would get the \"Paleo\" ($12.95 + $2 egg). \n\nI love love love Rooster & Rice because of their selection of healthy food items.", "author": "Danny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "I had some extra time to kill on a business trip and made it a mission to come Financial District from San Mateo just to try their khao man gai. Their menu is quite simple...how would you like your khao man gai? White rice or brown rice? Chicken, seafood, vegetarian or paleo version? I went with the original #1. It comes with white rice, steamed chicken and their special soy sauce. They also have sriracha and a habanero sauce that has quite a kick to it. The rice was a little disappointing. Other places where I've had this dish, they made their rice with chicken broth. Their rice was not comparable. Quality of their chicken was good, but some pieces of white rice came off a little dry. Their soy sauce was pretty tasty though. I think they have garlic pieces mixed into it which gave it a more savory taste. My friend just went straight for the habanero sauce. I do like the soup they served with my entree. It really hit the spot for me since it was cold, cloudy day. Overall, this place has decent khao man gai. I recommend coming here if you work or live around the area, but I think Nong's Khao Man Gai still takes home the crown for this dish. Sorry!", "author": "Carmen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-26", "description": "Sighhhhh.....\nYes, it is good but for almost $14 for chicken and rice that isn't entirely filling- that makes me sad. \nLine is long during lunch hours and seating limited.\nDon't forget to get their thai sriracha and hot sauces.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "I love this place so much and come here a ton. This location is much larger than their Marina St location and has pretty ample seating which is great. It's complete chaos during lunch though, probably because everyone must come here for a quick affordable lunch. \n\nOverall, same delicious quality as the other Rooster and Rice locations. Great price for the value of food that you're getting. Chicken rice is rich in flavor, the chicken is bland but the soybean sauce makes it delicious, and the chicken broth is always a nice accompaniment. Huge fan of this place .", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "Chicken and rice! The original ($11.95) comes generously with breast and thigh meat over a bed of jasmine rice. Broth comes on the side as well as a ginger and sweet soy sauce mix with cilantro. The chicken is very juicy and comes with skin. No bones! They do give too much rice despite the filling amount of chicken, but that's where extra chicken for +$3 comes in. The broth is light and very tastey. Pour it over the sticky rice = win. Next time, im getting a fried egg over the rice and chicken (+$2). Unfortunately, I didn't see that this time!", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "We're all blessed to have Hai Nan chicken within walking distance. I agree with others that the poached chicken doesn't have much flavor, and wish the rice was cooked better--however the sauce is very potent and totally infuses whatever flavor you might need to amp up the taste of the chicken breast.\n\nI wish they had a more expansive menu but get that this is a roster&rice only kind of place. The decor is cute and simple. Menu is straight forward. Good addition to the neighborhood!", "author": "Kay H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Rooster & Rice's newest location in the Financial District opened quietly this winter, and my heart almost stopped when I stumbled upon its new post up on Kearny.\n\nThe same simple menu of Hainan chicken, rice/veggies, and add-ons is the same, and I appreciated how there was much more seating here than the other locations. My favorite is still the Marina (skinless breast + brown rice) with a poached egg added, and the Paleo (breast + broccoli) if I'm trying to eat clean. \n\nThe location is definitely still experiencing growing pains - we had to wait 15 minutes because they had run out of eggs, and then I had to wait an additional 10 minutes because they forgot to cook my veggies (I had gotten the Paleo). The egg is 100% necessary - it really ties the entire dish together and I love how the egg mixes with their sauce to make the chicken even more fragrant.\n\nNo stars taken off for the incident above, because 1) where else are you going to find Hainan chicken as delicious in the overpriced food desert of the Financial District and 2) the manager came up to us afterwards and apologized for the wait (they were trying to get used to the ebb and flow of crowds), and also gave me an extra cup of chicken broth. \n\nR&R FiDi has secured its place as a weeknight staple for me!", "author": "Denise L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-18", "description": "Chicken and rice on a cold day is nice comfort Asian food.\n\nI got the Marina (All breast, skinless, organic brown rice).  The chicken tasted very fresh and the rice was cooked just right.  The main reason I did not give this a higher rating is that the chicken without any sauce did not have any flavor to it (I expected more).  And while the sauce that is served with it has a good flavor it was a little too strong after a while.\n\nThe people who work here are very nice and the line moves pretty quickly at lunch time.", "author": "Bob F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Since my fiance was working in Asia for a number of years, I've had my fare share of chicken rice. Chicken rice is traditionally poached chicken with the rice cooked in the chicken broth accompanied with a ginger, chilli sauce. Although tasty, the traditional version is generally quite fatty.\n\nI found Rooster and Rice was the perfect intersection of flavor that appeals to a health conscious Californian like me. \n\nThe menu is simple with four options. The original, the marina, the vegetarian and the Paleo. My default is the Marina which is skinless chicken breast served with brown rice and a side of broth. The chicken has always consistently stayed juicy and tender and the soy based ginger sauce really pares well with the chicken. If I'm being particularly carb conscious then I get the Paleo which is skinless chicken breast served over veggies (broccoli and cucumbers). \n\nA regular go to option for a quick healthy meal that still packs a lot of flavor. If you aren't able to get it in store, remember to check out Caviar and order it online.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Came here for lunch on a Wednesday around 11:40AM hoping to beat the rush. Not bad, only 7-8 people in line from what I saw from the outside. Once I got inside, seemed like about 10 or so people waiting for their order. Was hesitant but wanted chicken rice since I just got back from SEA. \n\nOrdered their classic with only thigh meat. Watching their kitchen work and operate makes you cringe and question their efficiency. Waited 20 minutes for my order. Their system in dishing out food makes no sense. My number was 46 but orders from mid 20's to 50-65s were being called. People who ordered after me for their order way before I did . \n\nChicken - 4/5 tender and juicy \nRice - 3/5 not as fragrant as it should be \nSauce - 4/5 slightly sweet soy with ginger \n\nOverall, the food is probably one the best chicken rice you can get outside of Thailand. Their service however isn't very organized.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Healthy. Quick. Big portions. I can eat the number 1 every day. Simple menu and seemingly simple dish but excellent. \n\nWent back for the number 4. Instead of rice I got broccoli. So. Much. Broccoli. I forgive you. I'll still come back.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "It is crazy that rice, chicken, and some sauce could be sooooooo good. But it truly is. The broth here is salty and yummy.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Healthy food with high quality ingredients in a nice atmosphere. Not your standard thai place as the name states they stick to bowls of chicken and rice. They do have it down to a science tho. I had the marina with chicken breast, cucumbers, house sauce, and chicken broth over brown rice and added various hot sauces. Everything was super fresh amd tasty. The portion was on the lighter side so I left satisfied but not stuffed. If your after a quick healthy option definitly check it out.", "author": "Sean G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "I still can't believe this is a Thai fast food place. I get the most authentic Cantonese style chicken on rice here so far in the country. The chicken is soft, moist, and easy to chew on. The ginger sauce is so delicious, though in my opinion is a bit stronger than I expect. We went there to get take-out lunch. There were some tables and seats there for dinning in, though it's self-serving. Overall a very good place, I would give a 5-start rating just because it's flavor.", "author": "Yanzhong L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "Love their chicken rice, so tender, great taste, boneless, and the sauce is so yummy. Definitely a good value for an Asian style chicken & rice.", "author": "Norman Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "I wasn't really expecting much after hearing from my friends that this place serves chicken and rice, but this was a pleasant surprise. I stopped by Rooster & Rice for a quick dinner at around 7:30pm, which was not a busy time (no line). I ordered their original ($12) which came with a good portion of chicken (both breast and thigh meat) over rice, along with a little bit of cucumbers and a small chicken stock soup on the side. It was surprisingly good -- the chicken was tender and the rice was very well flavored. They also have an interesting sauce (I believe soy based) that had a tangy taste as well as a slightly spicy kick, which complimented the chicken quite nicely.\n\nA little bit pricey for just chicken and rice, but definitely a good, healthy option and the portion size was decent.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "New location that will be ...scratch that ...already is very popular. I like the paleo plate and I'm glad there is another option for this type of food in the city. A little pricey for what it is but hey it is sf and wages/rent isn't getting cheaper...", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Good food and consistent. Fast service too. I usually get the paleo and I haven't tried the rice yet...maybe next time. The one bummer was that they didn't have the fried chicken skins available. They are the best!", "author": "Lea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "I've been coming to this location on a regular basis since they've opened as it's right across the street from my building. And I will continue to patronize the business as well as recommend it to my friends.\n\nBut I'm mainly writing this review today because I wanted to give a viewpoint from a Thai person's perspective....I'm hoping the owner would read this and give it some consideration.\n\nAs I'm Thai I've very familiar with \"Kao Mun Gai\".  The rice and chicken are well prepared here.  My only gripe would be the ginger sauce.....though the sauce tastes very close to the original street version....It lacks spiciness.  I'm very aware that additional spice is offered at the condiment table but what's offered is Sriracha and Habanero sauces. Though these items will spice up the flavor, it will, unfortunately, change the flavor of the ginger sauce as well.  Trust me, I've tried it!\n\nSo my request is to the owner.....Can you provide some chopped chilis at the condiment table as well or per request?  As you know, I'm sure you're aware that chopped chili is a normal ingredient in the ginger sauce for this dish.\n\nThank you in advance.", "author": "Dolly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Love it. just simple and delicious. Love the chicken broth. I wonder if the brown rice is cooked with chicken broth too. Seasonal veggies just means steamed broccoli. Not that exciting. When we order, we all just get rice and pay for the extra broccoli side. Kind of wish we could do a little more customization, like having brown rice (offered in the Marina) with chicken breast+thigh w/ skin (offered in the Original). Also for the Paleo, wish we could choose both breast+thigh w/ skin. overall, still a great place for a quick lunch. Housemade habanero sauce is yummy, but it's all about the khao mun gai sauce!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "I love Rooster & Rice as a meal that's very simple yet hits the spot so good. I've heard of Hainanese style chicken dishes first when I went to Portland and tried that one famous place located in the food cart pods. Since then I've been thrilled to find out a similar place opened like that in SF with fairly reasonable prices & portions. The menu is fairly simple in that there are four options; The Original, Marina, Paleo & vegetarian option. I always go to for the Original as it comes with a side of chicken broth, white jasmine rice cooked in chicken broth, a generous portion of white meat & cucumbers. The ginger sauce used for the chicken is DELICIOUS. It tastes good drizzled over the dish or used as a dipping sauce. Try the habanero sauce too if you can for a good spicy kick that's different than srirarcha! I have tried the vegetarian option before as it comes with a veggie broth, brown rice, tofu & seasonal vegetables. Overall this place is great as service is always fast & friendly, and can get crowded during prime lunch hour. Always does the lunch job for me and leaves me feeling super full afterwards!", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-22", "description": "I am a chicken lover, got so excited by so many 5 stars. Drove all the way there to try it out. BIG DISAPPOINTMENT! It is just a big portion of rice, topped with few pieces of farmed chicken and salty sauce. The dish is way overrated and certainly overpriced. \n\nTwo stars is for the friendly young lady behind the cashier. Sorry, not good!!", "author": "Jane W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "Bland, and no flavor. Chicken and broccoli tasted like water with bouillon cubes. Soup tasted like canned broth. I thought it was usually served with white pepper, salt, green onions, scallions, fried red onions or ginger oil instead of a generic soy based sauce. \n\nSince the food comes out fairly quick and fast I will still come here solely for connivence and it's simplicity, but defiantly it's overrated and over priced for what it is and it's serving portion. \n\nIf you go to any Thai restaurant you'll know how much subtle and complex flavor and aroma is missing here.\n\nAlso to label something \"Paleo\" and serve it with a sugary soy paste is incorrect.\n\nPaleo has no sugar or soy.\n\nPlease provide plain old salt and white pepper and consider adding on a ginger garlic scallion sauce to keep it paleo as well as making it more flavorful.", "author": "Janno L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "So a few weeks ago, I saw my co-worker having this for lunch. I was intrigued because the plate was so \"healthy - looking\" and given that I'm on a sort of \"wedding cut\" right now in prep for my wedding I was like \"whoa. I need to try this!\" So this past Tuesday, I told her I'm going to get lunch there and see if she wanted to come with me. We ended up going together so I asked her for some tips on what to get on our way there. We got there about 12:20pm and the line was out the door. I kinda freaked out a bit but good thing I didn't have a meeting to get to so I was ok with the wait. I ordered the Paleo with extra Veggies, Chicken Breast. There were a lot of people but our wait for the food was about 10 mins. Not bad right? We were in and out in about 20 mins. The cashiers were quick and friendly. The staff who gave our orders were also really nice! The atmosphere is kinda cool as they have a small sit in dining area for people who want to eat inside. They offer hot sauces on the stand next next to the kitchen so you're free to get as much habanero and sriracha! Overall, I'll give it 4 stars. I wish they can do pickups even for just 1-2 orders and have a pickup station so people have the option to order ahead then just grab and go if you're having a busy day at work and no time to order then fall in line. But.. I'll still come back here if I've got the time to get lunch because.. it's super clean, lean and the sauce on the side is AH-MAZING. Gosh, I can probably eat that thing with everything. Go try this place out! You won't regret it!", "author": "Anna Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Delicious -- tastes like what my mom makes at home. Absolutely in love with the flavorful soy sauce with ginger. Service was fast and friendly. Love that it comes with broth too. Will definitely come back for more!! (Order the original -- it's the only way you should eat it)", "author": "Annie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "One of my favorite lunch spots. Simple & delicious - reminds me of eating a comfy meal at home. They also have a vegetarian (tofu) dish.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Authentic thai food, according to my thai friend.\n\nGot the plain chicken and rice for about $10-$12.\nThe sauce that came with it was really, really good. Food itself was really plain, so I drowned the chicken in the sauce, habanero and sriracha, and it wasted really good.\n\nA fine place. Meat a little too plain for me, but that's personal preference.\n\nP.S.\nAlso, the chicken broth was insanely good.\nThis is definitely food to try. Its exceptional in its own way.", "author": "Subrat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-16", "description": "I fell in love with Kao Man Ghai from Nong's cart in Portland. I've searched everywhere for a similar alternative, even considered making the daunting dish at home.\n\nThat said, I was super excited when Rooster & Rice opened up right by my office but after my first visit there, I was unimpressed. The rice and chicken weren't very exciting, so I eagerly dipped the sauce, hot sauce, and slurped up some broth but the flavors didn't quite hit the mark for me. \n\nThat said, there aren't many options in this exact area unless you go to Bun Mee down the street. Rooster & Rice is a solid healthy lunch in the area for a quick bite to eat.", "author": "Angie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Delicious, clean-tasting and nutritious chicken on rice! \n\nTheir menu is minimal with the necessities plus just enough accessories.\n\n​The Original\nbreast and thigh with skin, jasmine white rice - $11.95\n​\n​The Marina\nall breast, skinless, organic brown rice - $12.95\n​\n​The Vegetarian\norganic tofu, brown rice, seasonal veggies - $9.95\n\n​The Paleo\nbreast or thigh & seasonal veggies - $12.95\n\nExtras:\nChicken $3     \nRice $2     \nBroth $2     \nSauce (soybean, ginger) $1     \nEgg (sous-vide) $2    \nVeggies $2     \nDrinks $3\n\nPortion-wise, they give you a substantial amount of chicken. When I ordered The Paleo with all breast, it looked like 2 medium-sized breasts sliced up in total. The egg add-on comes in sous-vide form, seasonal veggies were steamed broccoli. There's also sliced cucumber, cilantro as garnish, chicken broth, and ginger soybean dipping sauce (flavor central!) that comes alongside. \n\nOne thing to mention: habanero sauce. My meal was heightened to another level upon trying this guy out. It's complimentary at the napkin station; also sold in bottles at the counter. This sauce adds flavorful smokiness and gentle heat without taking over the entire dish. It's a phenomenal condiment.\n\nPrice-wise, I'd say it's fair in the competitive landscape among hipster chicken and rice businesses, the location, overall quality and portions. Extras, like the egg, are where they get ya. \n\nI could see this as an easy go-to lunch spot if you're in the area. \nEnjoy!", "author": "Karen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Convinced the sugar daddy to pick this up on the way home from work, so I didn't get to try it until a few hours later... cold. Regardless, I still very much enjoyed the meal.\n\nGot the original with a poached egg on top. Although I don't have anything to compare it to since this is my first thai style hainan chicken dish that I've tried, it was def pretty bomb. The sauce definitely is what makes the dish, otherwise it would be just meh. ~$14 is pretty steep for some boiled chicken and rice, but I guess these prices are expected in FiDi.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "First time here. It was very tasty. Would go back. Got the Original. The only downfall is not a lot of seating but overall it's great.", "author": "Scot M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "The graphics caught my eye. I love the design and that their containers are compostable. The food is pretty good too!", "author": "Tammy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Yay finally made it to a R&R location! I LOVE Hainan Chicken & Rice! Got the Original and it was huge and delicious. Everything was flavorful, the sauce and the broth were both delicious. Two minor complaints. The rice was a bit dry, almost had a stale texture, for my preference, but I'm picky about my rice. It could be that's how the Thai style is supposed to be. The sauce wasn't garlicky enough for me. But that's probably a good thing... don't wanna be that person with vampire-killing breath at an afternoon meeting. I came super early 11:30 and ate there. They seemed to bang out orders fairly quickly with a couple of rushes. Yay new lunch options!", "author": "Nana L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-22", "description": "One of many great asian spots around the city, but separates itself by offering a much healthier, less oily option, and sacrifices very, very little in the taste department at a reasonable price.\n\n4.5 stars [review based on 'The Vegetarian' bowl]", "author": "Jasper D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "I've been here a few time, and their food is pretty good. However, my only complaint is the wait time. First couple times were not bad, but the last time I was there I waited 17 mins from the time I ordered my food. They were not busy at all because I arrived at 11am, and there were only two people in front of me. No warning nor explanation nor apology from the staff. \n\nI personally wouldn't want to wait more than 5 mins for lunch on a work day, so I do not recommend this place if you need a quick lunch. There are better place in the area with more efficient service.", "author": "Bee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "https://www.yelp.com/biz/rooster-and-rice-san-francisco-8\n\nRooster & Rice in San Francisco does one thing and does it well.  Poached organic chicken over chicken rice. 3 locations to serve you.  The FiDi location of the restaurant gets very busy especially during lunch. Production time even off peak is slow.\n Picks:\nThe original ($11.95) Breast & Thigh w/skin, jasmine white rice is the clean and pure making for a nice tasty healthy meal.  The soup that comes\nwith it is really good. The hot and zesty chili, ginger, garlic, soybean sauce goes well with the meal. If you like this, be sure to try Hainan Chicken Rice at The Night Market in South SF.\n\nhttps://www.yelp.com/biz/the-night-market-south-san-francisco-2\n\nThe Marina ($12.95) Breast, skinless, organic brown rice is not as good as the original version.  Drier, denser without skin.\n\nJust OK:\nNone\n\nWould not reorder:\nNone\n\nOverall - Very Good\nFood - Very Good\nDecor - Very Good\nService - Good\nValue - Good\n\nWould we come back - Yes", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Great food and great service! Could be your good choice for grab and go. I ordered the original one with extra chicken and rice for sharing with my gf but the waitress give us another free cup of broth.  ps. Love both signature sauce and habanero sauce.", "author": "Ferrari D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "This is my go to spot to eat lunch when I'm downtown. I love the original. The soup is great and the haberno sauce with the chicken is the best if you want a little bit of spicy. Their chicken is very moist and is over rice with their sauce is great! I love this place!", "author": "Orion L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-26", "description": "I love the Rooster and Rice locations in Soma and the Marina. For some reason, I've just had terrible experiences at this location. The service has been rude and the food has been served to me cold or lukewarm and several occasions. I wish they would keep the quality and customer consistent across their locations. I'm on the hunt for a new lunch go-to spot now. Hopefully the turn things around at this location.", "author": "Craig D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Only visited because there was a shorter line. But food was pretty good. Good portion, and very different than other fast food in the area. Rice, veggie and meat. I had the Paleo dish. It was a nice grab and go.", "author": "Pat S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "When I'm craving a simple, filling and relatively healthy meal, I come here. The name explains it all, you get chicken and rice.\n\nWhat I liked:\n* Simple and filling. The Original which is what I normally get is just steamed chicken (breast and thigh) and rice (with a couple cucumber slices) as well as a soy based sauce on the side. It also comes with some chicken soup/broth on the side which which is a bit oily for my taste, but still not bad.\n* Great hot sauce that you can get on the side. Pick the habanero over the sriracha unless you can't handle the heat very well. It's sweet and has enough kick to it that you can feel, but not enough to ruin your meal or stomach. I definitely wouldn't come here as often if they didn't have the habanero hot sauce.\n\nWhat I didn't like:\n* A bit pricey. With tax, you end up paying $13+ for a relatively normal meal.\n* Limited seating. If you come here for dinner on a weekday, expect to wait for seating or get takeout.\n* Usually a decent wait for your food, but I guess it doesn't exactly claim to be fast-food.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "Really good meal but be prepared for a plane meal. Not in a bad way, just make sure you know what you're getting. I'm more of a saucey guy who likes heavy flavor. I'll give it one more shot though. Fairly healthy as well if that's what you're looking for. Portions are a bit small.  Staff was super friendly.", "author": "Matt N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "I came here for lunch and even though the line goes out the door, it is pretty quick! I love Rooster & Rice because even though it could be on the pricier side for lunch, it is well worth it if you are craving chicken and rice or want to treat yourself to a delicious meal. Everything in this restaurant is quality. From the chicken to the sauce and even the napkins. One thing to note is that the egg is $2! Depending on where you stand in line, it could look like it says $1 on the board, its a dollar difference, but I learned it the hard way..", "author": "Steph L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "Great place to pick up a quick and healthy lunch. Got the paleo, choice of poached breast or thigh meat with steamed broccoli and some cucumber slices. Sauce was good but has huge chunks of ginger (soy sauce wouldn't be strict paleo but they have a habenero and sriracha sauce). Gets pretty crowded during lunch so probably could call ahead but even still the order only takes 5mins or so to get ready. I do think it's a tad over priced but only by 1-2dollars.  Seating available for small groups, but limited.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Got the original and added veggies which is actually just broccoli and it was bomb. First time at R&R. Being Chinese, I am accustomed to chicken being prepped this way and it's quality ass fresh chicken that is super tasty. The chicken rice is amazing in itself. Drizzle the sauce it comes with over the chicken and enjoy this simple yet super satisfying meal. Good bye.", "author": "Ying Ci H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-01", "description": "First timer at rooster and rice. I was downtown searching for a good rice plate. I looked on yelp and this was the first to pop up. I've seen other people post about Rooster and Rice so I was always curious about it. None the less I ordered the original  I believe it is called. Very simple. Sometimes less is better. The chicken was boiled and was very tender. The sauce is what gives this meal a kick. I added sriracha and habanero sauce on top of the chicken as well. All and all a very simple chicken over rice plate.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-30", "description": "I have no idea why there's a line at this place. $15 for bland, boiled chicken and bland white rice? There are a million options within a 2 block radius.", "author": "Matt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Really enjoyed this spot! Stopped in for lunch and ordered The Original (breast and thigh meat with skin over white rice) and a bottle of Vitamilk soy milk.\n\nRice was flavorful, if a touch dry. Chicken was well-prepared; specifically, the breast pieces maintained their moisture. To quote Guy Fieri, the dipping sauce took me to Flavortown. Try mixing in some of their habanero sauce for an extra kick. Fresh chicken broth on the side was a nice touch.", "author": "Trevor M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Hearty comfort food at a decent price. The menu is simple and the service is extremely fast. The chicken rice tastes a bit like the Singaporean Hainan chicken rice, which I'm more familiar with. They ran out of chicken breast today so I got all thigh meat, which is great because it's very juicy. I liked the garlic/ginger soy sauce. I added Sriracha on my chicken and it's very good. It comes with a cup of chicken soup and it goes well with the rice too. Overall, a very nice spot for a quick bite. Would come again.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Love eating here! The chicken is so moist and the rice is incredibly delicious! It's one of those meals that doesn't make you feel bad and gross afterwards. Although there's NO parking anywhere near this location since it's in the heart of downtown SF, if you're staying at a nearby hotel or happen to work around the area, it's a great alternative lunch or dinner spot to check out.", "author": "Jenna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Nice being able to order comfort Asian chicken and rice with simple menu.  I went on a very rainy day at 3:30 pm and there were only 5 patrons through my entire 30 minute chow down in house.   They offer free water from a cooler, small paper cups, disposable forks and spoons, Sriracha sauce, Habanero sauce, and thick napkins.  I am not sure if they have a Public bathroom.  You're intended to throw away your own trays and clean up after yourself when you eat there and not leave your mess on the table.  I deducted the star because no staff member wipes nor busses the tables after in-house dining  patrons leave their tables and their messes behind", "author": "Lark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "This place is maybe $1-2 dollars overpriced, but the food is always cooked perfectly. The chicken is super moist and the sauces and broth they give add so much flavor. Service is always prompt and it's a great quick lunch grab.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Love the chicken !! So nice to have it deboned . \nJust the right balance of flavors and sauce . \nDefinitely coming back", "author": "Mei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "This is one of the best lunches you can get in SF. I get the Marina with broccoli. The food is great, healthy, and you get a lot of it for a reasonable price. The service is great, usually never wait more than 5-8 minutes. Everything comes with broth which is another bonus. Highly suggest coming here for lunch, I only wish they were open on the weekends.", "author": "Mitchell S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "It's a pretty straight up healthy fast food place in Fidi. Dishes are consistent and it's fast service. Yelp asks me to keep writing but I don't think it's necessary. What is good is good, period. Keep it up, rooster and rice.", "author": "K Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "A pleasant surprise to my Taiwanese roots. Loved the chicken!! Delicious, juicy, tender, and just right. \n\nPortion was good, and the soup OH MAN.\n\nTake your diverse friends here because I only saw Asians when I went and that's no fun", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "I lived in Singapore for 3 years where chicken rice is a national dish. This was close. It also is putting a Thai spin on chicken rice. I ordered a double meat portion and could not finish. I'm 6'3 and 215 lbs. It was a darn good lunch. Simple but packed with flavor. Excellent sauce.", "author": "Clements J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "The first time I got the chicken and rice and it was pretty good. Loved the sauces and soup was tasty. The second time I went there, it didn't have the same charm as the first one but still delicious :-)", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-05", "description": "Simple chicken and rice. The sauce is where things are happening and tie it all together. Lines gets long fast but it also moves fairly quickly", "author": "Henry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Great tofu dish with egg on top is the best. Order this at least 1-2 times a week. Simple easy and healthy. Would like to see more variety on menu, at least for sauces", "author": "Ken M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-24", "description": "Been to a few others in the city. Cold/luke warm chicken. This was dine in too. Oh well.", "author": "Walter K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "I just don't get it. People lining up to pay $14 for blander than bland, basic poached chicken and rice. Literally there is zero flavor without dousing everything with the hot sauce. So done with hyped-up places in SF charging high tariffs for sub-standard product. I'll be spending my hard-earned lunch money elsewhere.", "author": "Melanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-12", "description": "Quick, Decently Priced, Decent Quality. That's all that needs to describe this place. It's quick and simple. Comes with soup and sauce for your chicken. Can't go wrong.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "3.5 stars. Yay! Finally one opened closer to my work. Must eat it with their special hot sauce. I don't think it's the best, but this is the only place around the Fidi that has something like this. Can't eat it all the time, but I like their broth and I get the all white meat no skin. Line moves fast and there's a good amount of seating.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Decent new vegan option in FiDi. The menu has about three options. The tofu is a little bland but the broth is good. A friend has come with and prefers the chicken with the skin if that's your thing. They are usually busy but the wait is never long.", "author": "Barie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "I've been going to Rooster & Rice at Filbert location back in 2016. But due to inconsistency issues, I hardly ever go back there. \n\nWhen they have the recipe right, it's amazing! The chicken is fragrant and juicy, the garlic rice is also fragrant with the perfect texture, and the chicken broth is good and soothing. They have really good habenaro sauce to go with it too.\n\nBut when they don't have the recipe right, it's a disappointment. Sometimes the chicken is dry and other times the rice is too hard or way too mushy. The inconsistency happened regularly.\n\nSo when they opened the FiDi location last year (2017), which is somewhat near my work, I've decided to stop by for a try. I stood in their long line full of excitement because I haven't had it for a while. \n\nOf course, when I took my first bite, I regretted it. Their rice was hard, and the portion of the meat was tiny. I had an assumption that they were still working out their kinks at this new location, so I've decided to not go back until I've given them enough time to get settled.\n\nToday was the day I've decided to go back... and I'd have to say, it's a lot better than the first time. The broth is not too salty, and the portion of meat is perfect. Unfortunately, I found the meat a bit dry, rice was a bit mushy but tolerable, and the raw sliced cucumber tasted old. Again, it's inconsistent.\n\nI will go back there when I'm craving for something warm and hearty, and my stress level's so high at work that I needed comfort food (I'm Asian who grew up with Singapore's Hainan Chicken Rice, which is MY comfort food) but it won't be my go-to place. \n\nFYI, I would never compare Rooster & Rice with Singapore's Hainan Chicken Rice. It's slightly different, especially the sauce that comes with it. Rooster & Rice says they serve Thai Chicken Rice. Anyways, whether you're craving for a chicken rice version from Singapore or Thailand, let's be less critical and give Rooster & Rice props for introducing and making this Asian dish popular in this liberal city.", "author": "Summer O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Yummy! Wish they had some appetizers (like fried chicken skin) on a more regular basis. Overall - quick and yummy!", "author": "Joy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "This is a cheap and fast restaurant in an expensive part of town. The menu is tiny, which translates into fresh food served quickly. The sauces are tasty. The decor is spartan. It's bare bones and it's done well. Bathrooms weren't very clean.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "We got the original plate.  Priced at $11, the portions are good enough to get you full.  The soy/vinegar sauce was good, and had the right tang.  The chicken was very tender so that was it went down very well!", "author": "Ben S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Really good. Though it's Thai, it reminds me of Singaporean chicken rice. Had it back to back days .", "author": "Banu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Pretty good Hainan Chicken with rice. Rice was tasty. Wait wasn't bad but like most places in SF, seating is limited. I would probably come back again during an \"off-time\" or get to go.", "author": "Deb L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "I got an order of all dark meat. This combination with the sauce and rice is bonkers! The secret sauce has flavors of ginger, soy, black bean. It's the best to mix with the smooth chicken meat. It doesn't seem to be too unhealthy for a takeout choice. Rice and chicken with a side of soup makes this an easy, relatively healthier option for your quick weekday meal. I'll be back as often as I can! Check out the location on 2nd St too.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-04", "description": "Had original to go +$2 for steamed broccoli came out to $15.! Price of food in the FiDi i guess. Came w broth at least. Taste like \"tinolang manok\" if Ure filipino.", "author": "art t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "Great food, I get it three or four times a week. However, their chicken gave me and my coworkers food poisoning last week (end of February 2018).", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Love this place. It smells like heaven when I step my feet in there. And as expected, the food is great! I came from South East Asia, so this hits home to my pallete. I love putting some soup on my rice, which will enhance the flavor of the chicken so much more. Definately going back for more chicken rice!", "author": "Cherice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "Meh. I picked this up because I was starving and it was close to my hotel. The poached chicken had skin and some other gross stuff on it. The rice was fine. The sauce did have a bit of spice. It was a let down.", "author": "Sara R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "glad this restaurant has expanded, spreading the thai hainan chicken rice.  still enjoyable portion and deceptively simple very yummy sauce and rice.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-12", "description": "Definitely not as good an experience as my last visit. They lost my order, which whatever, shit happens. The bigger problem was that everything except the broth was cold -- not just not hot, but cold. Cold chicken and broccoli might ok with some folks, but no one wants to eat a c", "author": "Erica W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-18", "description": "All four of us got food poisoning the next day, which seems like it has to be from the chicken. That put a damper on things. :/ \n\nFood was tasty overall, but the chicken breast was a little dry. Make sure to mix in the included sauce, it was slightly bland without it.", "author": "Raymond J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Sweet jesus this place is simple and delicious! It's like having a piece of Singapore in your backyard...but via Bangkok? Who cares. The chicken is good and the dark umami bean sauce will blow your damn mind!", "author": "M G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Great food, great service.\n\nI ordered The Original and my wife had the The Marina. Base meal was good. The habanero sauce put it over the top.", "author": "Joshua K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "Finally a location in the middle of somewhere the food says it all healthy, delicious, and simple.", "author": "N A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "Absolutely overhyped garbage. Plain chicken that tastes like nothing with about a pound of rice. They give you siracha and a broth that has minimal flavor that you are supposed to douse the chicken with, With as much hot sauce and broth as you need, might as well eat fried chicken or a chipotle chicken burrito bowl. Staff was nice and place was clean though", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "Today I had the original, with steamed broccoli for extra $2 dollars. Rice is very tasty. Broth is really rich. Chicken is tender. Overall a good meal!", "author": "Nozima T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Good classic Hunan chicken! Limited menu but good place to go if you want Hunan chicken!", "author": "Erik L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "The portions are huge, but I honestly think I could make this at home. I got the Original which is $12 and added veggies an an egg for an extra charge. Including tax it came out to $18 OUCH.", "author": "Cassie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Had the original + extra chicken. Really like their fast, convenient and healthy food. Love the sauce! Broth is a bit of salty.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Has really good flavor!! The service is super fast and people are very nice! The rice is packed with flavor ..and the chicken is soft and actually tasty!", "author": "Divya B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "I want to give it 3.5 stars because it's good but not enough to drive me insane so 3 it is, very simply made but I prefer more spice if you will", "author": "Nathan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "I've had all the West Coast Chicken and Rice from Portland to LA. Rooster and Rice beats everyone by far with favor, consistency, and service. I've been going the Marina location to cure my hangovers for 2 years now. Sometimes they have chicken skin! FIRE! When they opened a 2nd location, it changed my life because they started doing delivery. Now they have this location and I'm downtown for work all the time. There's a few chicken and rice places that just opened but none are as fuego as this shit right here.", "author": "Alex P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Taste great, chicken was juicy and firm together with fermented soybean sauce and habanero sauce. I would say 10-10-10. Place was clean and all staff was so nice :) would recommend", "author": "Edward O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Simple, quick and delicious... this is basically Thai-style hainan chicken, which is all that they do but it's great. Restaurant design is new and minimalist and designed to be more like a fast food store.", "author": "Emile L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Super yummy and super tender chicken! Simple but delicious. Gets really busy during lunch but it's great quality. Price is comparable to the area.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "This is one of my favorite places to get a healthy dinner.  It has a delicious homemade taste and is super quick to pick up.  The original is the thing to get, but if you want a bit of greenery add on a side of veggies.", "author": "A C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Love the original chicken rice, which is pretty much the Hainan chicken. The chicken rice and the chicken work so well together. It really brings thr flavor of chicken to life, not to mention the broth was also very tasty. Wish this is a bigger portion but still give it a 5 stars because of how good it tasted.", "author": "Jing W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-11", "description": "Food is good, but portions of the food price little too much. Service not too good. Really need to improve.  The time I'm been there I leave a tip. Probably won't  go back there.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "It's good for what it is and for some of us, this is comfort food.  But it's very simple and it's very expensive. For a plate with rice and poached chicken, you will paying about $15+.  And the broth literally tastes like Swanson's out of a can.", "author": "Diana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "very delicious and quick serve. there's a similar place like this in Portland and it's super comparable :-)", "author": "Vienna H."}
