{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "I came here for the first time 2 weeks ago and I've been craving it ever since, so I got R&R again for lunch today. I'm on a low carb diet but I ate the entire bowl of rice because it's just too good!\n\nRooster & Rice is a super simple, warm meal that makes you feel at home. Plus you feel good about yourself afterwards because poached chicken and rice are healthy! They have the most flavorful rice I've ever had and the ginger soy sauce is AMAZING. I usually get a variation of The Original with skinless dark thigh meat. The little cup of chicken broth is a nice touch too. \n\nLines get long around lunchtime so come a little earlier/later. It's also slightly more expensive than it should be, but it's worth to me.", "author": "Katy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-02", "description": "Omg - how can chicken and rice be so good?\n\nLove this little lunch spot for Hainan Chicken & Rice. The menu is straightforward and so is the food. The chicken is moist, and the rice is flavorful from the broth.\n\nGet the side of fried chicken skins if you're feeling extra indulgent.", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "If you want to get your solid protein and greens in the city, you've come to the right place! \n\nOne of a handful of locations around downtown SF, with this one being the most spacious at the bottom floor of a typical business building. What I appreciate about this location is that it faces a fairly large plaza with a water fountain, a few dozen tables, and pillars around the water fountain where you can sit. \n\nThe location itself is pretty small - don't expect to sit inside to eat your meal, unless you want to deal with dozens of customers standing around waiting for their order. The line itself goes pretty fast, but expect to wait around 15-30 minutes if you go anytime between 12-1pm (aka rush hour for lunch). The servers are friendly, and do their best to get your order across, and yell out order numbers despite the place getting super crowded.\n\nThe menu is simple - choose between skin or skinless chicken, breast or thigh (or some combination), and white rice, brown rice or just broccoli. You can even opt to get half/half (i usually go for half brown rice, half broccoli). \n\nThe chicken itself is actually very tasty, considering they simply boil it. I highly recommend sipping the chicken broth that comes with it, as it starts to get dry. They also offer sriracha and spicy sauce to change up the flavor, although it does come with this soy sauce. \n\nWith tax, your meal usually comes out to around $15. As expected, eating in the city, but admittedly a bit steeper than I would want in a simple and healthy meal.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-21", "description": "Literally Hainan Chicken Rice with a little extra flair + cardboard bowls. \n\nAfter hearing loads and loads about this place, I finally got to try it and man I was just whelmed. Flavor was fine, moistness of the chicken was fine, portions were fine, toppings were fine. Pricing was your usual marked up SF pricing for a dish that probably cost 3 bucks to make. But that's exactly it. It's just fine and really average.\n\nYou can seriously just make this at home by throwing in some chicken seasoning into water and simmering a whole chicken inside for a little bit. \n\nSure for those of you who don't have time to try to make this at home, it's a good meal, but there are so many other places that make this well for half the price. \n\nIf I'm craving hainan chicken rice, maybe i'll come here once in a blue moon. But to me there's something just wrong about paying so much money for the most basic of dishes got dressed up to seem high value.", "author": "Christopher L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "I was very hesitant to eat here because the pictures make the food look extremely bland and tasteless. My friend convinced me to try it and meet him for lunch so I decided not to knock it til I try it.\n\nOrdered the Original - chicken breast and thigh with skin, rice, cucumber, and their special sauce. I poured myself hot sauce on the side. The food is fresh and after eating a boatload of it, you still feel good because it's so healthy. Tastewise......well, their special sauce really made the flavor. Lot's of ginger but overall I was surprised the flavor was good. Definitely worth a try.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I can't believe I've been here so many times and haven't written a review yet! This is one of my go-to lunch places because it's so delicious and healthy. It's just chicken and rice (+ a few cucumbers and cilantro), but they somehow make it taste amazing.\n\nI usually get The Original, but the options only get healthier from there, with The Paleo being the healthiest. The rice is unbelievable, and I have no idea how they season it so well but it's probably my favorite part of the meal. The chicken always tastes fresh and tender, and the broth that the meal comes with is the perfect addition (especially on a cold day or if you're sick). Definitely add their habanero sauce if you're a fan of spicy food! That and the ginger soy sauce it comes with go really well together.\n\nThere's always a line at lunch, so come before 12 or after 1 if you don't want to wait very long. There's some seating inside, but there's plenty of seating at the center of the plaza, which I would recommend if it's a nice day out!", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I came here for lunch with teammates on a wam September afternoon. It's nestled in the corner of a fairly drab office plaza.\n\nI went for \"The Original\", which comprised skin-on chicken white meat on top of seasoned rice. The rice is gorgeously seasoned - not sure how they've done it, but it's incredible. The chicken is flavourful enough to stand on its own, but not so much so that it's out of balance. There's a delicious soy/ginger sauce that you can use either for dipping, or pour all over your dish (I opted for the latter). And to top it off, they have a house habanero sauce - like Sriracha but better - a drizzle goes a long way, so beware!\n\nThere's lots of seating inside and outside, although much of the outside seats are ledges, so if it's busy you'll probably be holding your meal in your lap.\n\nI'd definitely go back, and would strongly recommend it if you're looking for a simple, delicious Thai meal at a reasonable price.", "author": "Sebastian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "I don't understand why there was a line for this place. I mean it's poached chicken and rice. I'm also not a chicken off the bone guy, so I wasn't super thrilled to see how sparse the menu was. Literally four menu items and a few sides. \n\nI came here with a group, so I couldn't bail once I saw the menu. I ended up getting the Tofu option which was ok. Organic tofu, brown rice and seasonal veggies. The seasonal veggies was broccoli, are you serious? I did get an egg on top, which sort of saved the meal, but not enough for me to come back. The meal was dying for some salt and I basically used everyone's soybean sauce. \n\nThe shining spot here, they serve Topo Chico!", "author": "Nate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "I had the chance to try Hainan Chicken or Hainanese Chicken in Singapore a few years back.  It was outstanding.  We all loved it and couldn't get it out of our minds.  I think the Thai also have a similar dish by the name of Khao Mun Gai.  Come to think of it, I think the Chinese also have a poached chicken dish that is somewhat similar.  Seems like every culture has a version of this dish!\n\nSince that trip, we've been trying to find some authentic-tasting Hainan Chicken here in the States and it's been difficult.  You can find it, it's just hard to find it done right.\n\nI love the simplicity of the dish, the bare, skinless chicken and that garlic and ginger infused broken rice.  It's so light and refreshing.\n\nTHE ORIGINAL (5/5) I ordered \"The Original\" which included thigh meat along with breast.  I asked if I could have *only* breast and they accommodated.  I *almost* ordered the soft boiled egg as an extra but decided I wanted to just have it plain the first time around. It comes with cucumber and cilantro garnish and a clear chicken broth.  I was craving spice!\n\nIt was so delicious - the meat is so tender and that sauce goes so well with the chicken.  The rice is like crack-cocaine, you just can't stop eating it (not that I've ever tried crack-cocaine)!!  The rice, with that chicken, and that sauce is such a magical combination.  I can completely understand why this restaurant has made the choice to sell only this dish!\n\nLove this place.  Love the concept.  Love their food.", "author": "Darien R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-20", "description": "Rooster & Rice is a treat yo self lunch for me. Not in the sense that I never pay $15 for lunch, but moreso in that I don't think $15 for chicken & vegetables (the PALEO) is justified.\n\nNevertheless, I find myself eating here because I'm addicted to the sauce(s). The sauce they serve with their khao mun gai is some sort of mix between two popular Thai street sauces, nam jim tao jiew & nam jim hai lam. You can find recipes for one or the other on the interwebs, but R&R's particular concoction boggles my mind with it's bewildering proportion of chili, ginger, garlic and fermented soybean. Sometimes I want to pay the extra $1 and take sauce for home. But not only that! The SRIRACHA here is the best I've ever had, and I'm not as obsessed with sriracha as everyone else seems to be. I've scoured Asian markets, even Thai markets, for this particular brand. No such luck so I can only get my fix here :( The habanero sauce is also pretty damn delicious, and I find myself dipping amongst the three in more rotation than I would salsas at a taqueria. Seriously so addicting.\n\nI almost strayed from trying this place because I have a Thai friend who did not give her stamp of approval. I guess it was inevitable that I'd one day walk into this newer SoMa location because it's walkable from me and I'm lazy af. Glad I did because now Rooster & Rice is one of my usual lunch options.\n\nI really just wish they'd lower their prices. To put it into perspective, for a few more dollars you can get khao mun gai for lunch at the Michelin-starred Kin Khao. Rooster & Rice is even counter service, and you can definitely find cheaper, more complex uses of organic Mary's chicken at plenty of other fast casual restaurants. It's not even like they put any effort into their decor/ambience, and they literally have a max of 2 people working at a time. I REALLY JUST DON'T GET THEIR PRICE POINT. I'm willing to bet their business would do so much better if the owners would just get off their high horse. Other than that, chicken is good, broth is good, chicken fat rice is good, and sometimes the cravings exceed my frugality.", "author": "Stephanie Joyce D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "Simplicity is key at Rooster & Rice. The incredibly minimal menu specializes in Khao Mun Gai, poached chicken on top of jasmine rice. At first glance, that might not sound all that sexy, but trust me, it's sexy!\n\nA line out the door on a Tuesday afternoon took around 10 minutes to get up to the front. The tiny space was packed with locals mostly ordering take out, but with lots of options to dine outdoors why take it back to the office?\n\nThe Original - Poached, organic chicken over fragrant chicken rice, garnished with cucumber and cilantro. Served with a fresh chili, ginger, garlic and soybean sauce and a side of chicken broth. I amped the flavors up to 11 by dousing the chicken in habanero sauce. Score!\n\nAgain, poached chicken isn't necessarily the girl next door, if you will. However, each ingredient is prepared carefully and executed well. For $11.95 I really can't complain about the portion size for the price. But I'll admit I could've used an XL portion!\n\nIt does get a little crazy inside, especially when folks don't listen for their numbers to be called, then it backs up the operation. For those looking for something extra, order a freshly cracked coconut for your pleasure! \n\nRooster & Rice hits the nail on the head for a reliable, affordable and relatively healthy lunch.", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "For our weekly office lunch, I decided to get part one from Rooster & Rice. Our delivery order arrived on Friday, June 8th around 12:15pm via Caviar.\n\nI got The Original: Breast and thigh with skin, poached organic Mary's chicken over fragrant jasmine chicken rice, garnished with cucumber and cilantro, Served with a fresh chili, ginger, garlic, soybean sauce, and a side of chicken broth ($11.95). One of my favorite preparations of chicken is the Chinese style poached chicken, so I was excited to try this. The chicken was tender and moist. The sauce super flavorful. The rice also had a nice savory note as I believe it was cooked in chicken stock. The soup was clean and refreshing. I've had this dish at a popular spot in Portland, so I was missing the chilis they gave us with that meal. Added a nice spice which I wish I had.\n\nGreat spot for Thai style chicken and rice. (Though a lot of people in my office thought this was too real. But they only really eat American Asian food.) I do adore a good khao man gai.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "It's the closest thing to Nongs from Portland that I can find here in the Bay Area! Rooster and Rice was introduced to me by Forkable and this review is solely based on my to-go experience. \n\nFirst of all, Rooster and Rice was soooo good from start to finish. The chicken is super tender, not dry at all and the rice is soft and not undercooked or over cooked. There's nothing I hate more than undercooked rice with dry chicken...ok a few things I hate more but you know what I mean ‍\n\nTheir sauce is interesting. It's probably the only thing that's like meh unless I had a not so good batch. I feel like places like this are all about the sauce but mine was a bit too sweet. I need to come back and try again in person though. Can't wait!", "author": "Shelly W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "TIME: TUESDAY @11:30am\n\nSEATING: there's some communal seating indoors and some tables outdoors.\n\nI'm so glad I planned for an early lunch (they open at 11am) because by the time it was noon, a line was formed.  I came at 11:30am and there was no line!\n\nSince it was my first time, I thought I go for:\n\nTHE ORIGINAL - $11.95\nBreast and Thigh with skin, jasmine white rice.\nPoached, organic chicken over fragrant chicken rice, garnished with cucumber and cilantro. Served with a fresh chili, ginger, garlic and soybean sauce and a side of chicken broth.\n\nThey also have slices you can add:\n- Thai Sriracha - sweet and mild. Goes so well with the chicken and rice!\n- Habanero - didn't try it but I'm sure it's very spicy.\n\nThe chicken was tender and I loved the thigh (dark meat).  I love my food rich so I enjoyed all the skin that came with it!  The chicken rice was soft and everything I want in white rice--and there was a good amount of it!  As for the soybean sauce it comes with, although I don't like ginger, it's not terribly gingery. There's some peanuts in em!  This sauce is good if you want your food saltier, but I prefer the Thai Sriracha!\n\nIf you don't stuff yourself, you can turn this into 2 small meals--which is actually the portion we should be eating, hehe.  For the quality and amount you get in San Francisco, the price really isn't bad.  This place keeps it simple with simple food that tastes pretty darn good!\n\nI'd like to come back and try the vegetarian! Oh and the staff is very friendly and attentive, even when it's just one person up front with a long line.", "author": "Tu-Anh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Solid 4 stars. This place is on our take-out rotation, especially when we feel like being a bit more healthy.\n\nThe menu is simple: chicken + rice. You can choose between poached white meat or white/dark meat, and brown rice (+1 extra) or jasmine rice. The chicken is extremely tender and the rice is fragrant (they call it chicken rice). There is a side of sauce (ginger and garlic sauce = THE BOMB) and they have Habanero hot sauce and Thai Sriracha (I use a combo of both). My favorite part is the broth they give you on the side - I'm not sure how they do it but it is the cleanest yet most flavorful chicken broth I've ever had! Really my favorite part!!! They also sell a limited selection of drinks as well as whole baby coconuts if you want fresh coconut water :)\n\nThis location is open Mon - Fri and closes at 8pm. There is plenty of seating inside and outside and the line/wait is very short during dinnertime.", "author": "Michele L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Rooster & Rice is so simple but flavorful at the same time. Khao Mun Gai is a fave Thai dish of mine so after trying Chick'N Rice in the East Bay I knew I needed to try this SF staple. This location is great too because it's a a newly updated plaza with a fountain and plenty of seating for your meal. The location itself is quite small so come early to avoid the rush or you'll be part of the large mass waiting for their order to be called. \n\nFor ~14 w/tax you can get yourself a whole breast and thigh, seasoned jasmine rice, cup of chicken broth, and their delicious chili, ginger, garlic and soybean sauce. The chicken is moist and the sauce was killer. You can definitely see all the ingredients they use in the sauce and it adds so much flavor to the chicken. What I liked about R&R compared to C&R is that the rice is flavored a little more. While C&R's rice tasted more like it was cooked in the chicken broth/fat, R&R tasted more garlicky - at least for me. \n\nI thought the meal was delicious and it was enough for two meals for me, however I think that the price is on the steep side for what it is.", "author": "Keizzel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "I'm upping this rating to 5. The more I eat here, the more I love it. Healthy, tasty, and the price point is what you should expect for SOMA lunch. Also they always have plentiful chicken skin... at least up to around 12:15. That's money.", "author": "Don B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-10", "description": "Rooster & Rice is really overhyped and I'm surprised there are so many good ratings. The chicken and rice itself are pretty ordinary, and the sauce is really the only good part of the dish.\n\nGiven the there's a new location in SoMa, I decided to give it another try, but it was just as plain and ordinary as I remembered. You can choose between 4 variations, \"The Original\" has breast & thigh w/skin, jasmine white rice, \"The Marina\" has skinless breast, organic brown rice, \"The Vegetarian\" had organic tofu, brown rice and seasonal veggies and \"The Paleo\" has breast/thigh and seasonal veggies. It comes out to about $14 which is pretty overpriced in my opinion. \n\nI had the \"Paleo\" and it was so-so. The seasonal veggies are always steamed broccoli, so it really doesn't stand out to me too much. I imagine that its a popular place since its a healthier option in the area.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "Rooster & Rice is delicious, but what really differentiates their menu items and food is the sauce! I ordered \"The Original,\" which comes with chicken breast and thigh with skin, jasmine white rice, cucumber, cilantro, and a fresh chili, ginger, garlic and soybean sauce. To be honest, without the sauce, the meal would have been quite bland -- it's your standard chicken and rice dish. But the sauce is fragrant, a wonderful complement to drizzle over the chicken and rice. Everyone should come to Rooster & Rice at least once during their time in San Francisco simply to try the sauce! It's difficult to describe, and is a flavor I don't think I've ever experienced before - the ginger shines through but doesn't overwhelm, the chili and garlic add the perfect kick, and the soybean rounds it out with a nice savoriness. Simple ingredients that on their own may seem uninspiring and ordinary, but together, pack a powerful punch. \n\nHowever, I will caution that after the meal, I felt extremely heavy and bloated. I would definitely recommend splitting it into two separate meals because I felt extremely sleepy and sluggish afterwards. While portioning it out was my original plan, the meal was so delicious that I couldn't resist myself and devoured the entire thing!", "author": "Claire L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "I love it when simple things have been perfected. And that is exactly what rooster and rice is -- perfection. I ordered the original - seasoned jasmine rice with poached chicken and it comes with a side of broth. I also ordered a poached egg for a few extra, but totally worth it! It's not a fancy sit down, as every order comes in a take out container but who cares. The food is excellent. The chicken is juicy, the rice perfectly seasoned, and broth reminds me of home cooking/cozy feelings that warm your tummy.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "It is a very simple meal because both of us were thinking about something light, when you are in a city that is surrounded by fried chicken sandwich, big burrito, tacos, and greasy curry, you will appreciate such a place. Honestly it is not very worth considering all you get is little bit rice and some chicken, a small bowl of soup and some sauce but you are paying so much, but it is indeed very tasty so I have to give it a 5 star. When it was our turn to order, the 5 dollar crispy chicken skin just sold out and there was only 1 dollar chicken bits left, so we got that. It is so good, soooooooooo good. Perfect thing to snack on when you are waiting for your food, and also pour over the rice to give it a crispy texture. \n\nWe ordered the most basic one, I just don't see the reason why we should pay 1 more dollar to get 2 broccoli on the plate.", "author": "Shuang W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Y'all this is home! Rooster & Rice is perfect. You get soup and a nice portion of rice and chicken to make you happily full. I recommend combining their habanero and sriracha together and adding it on the rice. The brown sauce they provide is pretty good too! I'm usually not a cilantro and ginger fan, but it's not overpowering and sweet. The soup is so so good. My favorite part about this place is that there's only four options so you don't have to spent years trying to decide what you want. There's the original, marina (no skin), paleo and vegetarian. Don't forget to take a magnet! Free and cute for the fridge!", "author": "Caitlyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "This food is unexpectedly good! I came in with really no expectations, but my friend eats here often, and we just wanted something quick to eat. We both got what was called \"The Paleo\" I think, and it was their typical chicken with lots of veggies, and as someone who is usually very critical of chicken, this was surprisingly flavorful! I will definitely go back!", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "I recently visited San Francisco for work and one day I found myself hungry with nowhere in particular to eat for lunch. A group of work buddies and I decided to explore the neighborhood around the office and we eventually found ourselves at Rice & Rooster. It was the twelve o'clock lunch rush so the place was extremely busy and there was a really long line. The way it works - You wait in line to place your order, place your order and pay at the register. From there you wait for your meal to be called out and then enjoy! For the size of the place and the huge amount of people visiting for lunch, it was pretty cramped. Thank goodness I didn't have to wait to long. My group and I were in and out in of there in roughly twenty minutes or so. We then meandered back to the office to eat, it was way to busy to sit down and enjoy it in house.\n\nWhen it comes to the food, I ordered The Vegetarian and I added egg to it. The seasonal veggies were broccoli and cucumber, which was excellent. I only wish there was more of it! The tofu was soft and the rice was pretty basic. I wasn't a huge fan of the broth, as there wasn't a lot of flavor. The fresh herbs were a great touch and the hot sauce was a fantastic pack of heat. I'm so glad I added the egg! It gave it a wonderful consistency and just the richness I was looking for in such a healthy meal. Overall, the best tip I can give you if you're planning to visit for lunch is to order it to go. You'll be glad you did.", "author": "Jayme H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "My coworkers and I decided to try out Rooster & Rice because we've heard that it compares to Nong's Khao Man Gai in Portland. After having Nong's, I guess my expectations were a little high because Rooster & Rice's chicken and rice was just okaaayy. I ordered the Paleo with all dark meat. The paleo comes with seasonal veggies instead of rice, and mine came with broccoli. I was glad to see they had sriracha and habanero sauce to fill up in the restaurant. \n\nThough I ordered dark meat, some of my chicken pieces were dry. However I did like the sauce, and I wished that I had added an egg after I saw my coworkers poached egg in her order! The sauce was really flavorful and had a small kick. I think the soup was chicken broth and it was pretty good.\n\nIt was a good lunch and i'd give it 3.5 stars, but at the end of the day, you're paying upwards of $12 to eat chicken and rice... Not worth it in my opinion since there are better things you can get for $12, but I would go again since it's rather healthy or if my coworkers wanted to go!", "author": "Tara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "A quick and healthy spot for lunch.\n\nCame with a group of co-workers during meal time and there was a pretty big line wrapping around the restaurant. The menu is limited, so that definitely helps make the decision process easy, but what's really great is that they turn around the food super fast so that you're not standing around wasting precious eating time.\n\nFor food, I went with the original that's a mix of thigh and leg meat (skin on) on a bed of rice. What really makes it special is the gingery garlic sauce that it's sided with - make sure to pour it all on generously as you wont regret it. The food will satisfy without making you feel like you're carrying a small child in your stomach and you'll probably still have room for dessert without feeling guilty when you're done.\n\nThere are a few tables inside, but good luck - they also have some communal seating outside if the weather is nice. Probably better to avoid trying to secure a spot if you're going with a group and just taking your food to-go and eating in a park or other communal space.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "I am pretty much obsessed with this place. It's my go to lunch spot because it's filling yet somehow it doesn't make me feel completely terrible afterwards. The sauce is so flavorful, and the seasoned rice is so fragrant and addictive. I always get the original... it's the way to go! Pro tip: go around 11:30am to avoid the long lines during lunchtime.", "author": "Cathy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "As a lazy millennial who regularly takes the bus for 10 minute foot commutes, I would actually consider walking the 20 minutes to Rooster & Rice during my lunch break everyday. Do not underestimate the significance of this decision from the perspective of a highly sedentary individual.\n\nForget the fact I'm being charged an exorbitantly inflated price for what is just chicken and rice. Or that the meal is so incredibly sodium-generous that I hydrate enough afterwards to probably spike our water bill for the month. This place is the bomb. If i could, I would hook myself up to an IV drip of their chicken broth soup.\n\nUnfortunately there's not a lot of easily accessible places in SF that make decent Khao Mun Gai, so as a slave to the laws of supply and demand, I find myself crawling back here more often than I'm willing to admit to order another bowl of the Original with a side of an egg.", "author": "Jenni H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Okay price for hainan chicken, but everything was pretty spot on in terms of quality and quantity. \n\nI got the original which came with chicken, rice, and a bowl of soup. The chicken was juicy and tender, and went well with the soy sauce they provided. It in itself didn't taste like anything, but that's where the sauce comes into play I guess. The chicken broth really hit the spot and completed the meal - it was hot, rich, and flavorful.", "author": "Elvi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "If you haven't figured it out already, Rooster & Rice serves exactly what its name implies, chicken over rice. Much like In N' Out, you can stare at their menu being indecisive all day long. But ultimately, they really only serve varieties of one dish (chicken with or without skin, white or brown rice, or a vegetarian option with tofu instead of chicken). \n\nThe chicken itself is plain, cooked with basically no seasoning and little to no additional oils. And you get a delicious bowl of chicken broth. This is the kind of place you come to have lunch at if you wanted something (mostly) filling, yet healthy. Price wise, it is your typical SF price point. With a bowl ranging between $10-$13, plus extra for sides (egg, extra sauce, extra broth).\n\nI'm personally a fan of this location over the nearby Kearny location as this spot is a lot less crowded, friendlier, and the chicken actually tastes better (I find the Kearny location tends to overcook their chicken). Plus this spot offers outside seating next to a beautiful courtyard with a waterfall fountain.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Limited variety but they don't need to have more selections because their hainan chicken taste sooo good, especially the original one. I sometimes choose the paleo one when I don't want to eat carb. \n\nOnly complains are: it looks like a very quick to assemble dish, but I normally need to wait 5+ min for it, sometimes even 15 min. Hope they can make it faster", "author": "Wenjing Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "Chicken rice is one of my favorite dishes and oh man had I been missing it! Rooster & Rice did not disappoint as they really stuck to the basics on the dish and served it straight up - with optional sauces on the side.\n\nPros: good food, decent prices (for downtown SF), fast service\nCons: Minimal seating, no sit-down option (only served in to-go boxes)\n\nNotes: Location is in a nice, open plaza (so that kind of makes up for the lack of in-door seating, so long as it's nice out) with dessert and drink options nearby. Parking is basically as you would expect in downtown.\n\nGot the original Chicken Rice and it was just what I needed! Definitely recommend this place for a quick bite, especially if you're a fan of Hainanese Chicken Rice or its Thai counterpart, Khao Man Gai.", "author": "Julian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Love me some Rooster & (no) Rice!! Keto-friendly but pricey AF. \n\nI ordered the Paleo all thighs over veggies $11.95, add an egg $2.00, plus chicken skin $5.00 (wanted to try, but probably won't get it again). Good grief! $20+ for simple but delicious chicken, veggies, and sauce. This is the kind of meal you order when you've just got paid and you're feelin like a baller.\n\nThe combo of chicken + chili sauce is where the magic happens. For keto-goers, I lightly dipped my chicken ever other bite because it was a bit sweet and I know ginger is hella carby. I focused my veggies on the habanero (low carb) sauce. I swear the chicken broth is a warm hug in soup form...super comforting. I think I'll bring my own egg next time and save $2. Overall, Rooster & Rice is solid. I just had to dock a star for the price.", "author": "Michele A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "I got the paleo chicken with an add on of an egg. It consisted of chicken thigh, veggies like broccoli and zucchini, and this partially raw egg. I Iove raw stuff. You can choose chicken thigh or breast for paleo.\n\nThey gave me sooo much chicken. It was like 3 times as much as my friends' chicken dishes. But my friends got chicken and rice, not paleo. Maybe that is why. Anyways, I couldn't finish it in one sitting. It took me over 3 hours to eat it.\n\nThe chicken is organic, free range chicken which I think is amazing. Know what else is amazing? Their napkins. Their napkins have a chicken on them and they are super thick and soft, almost like a hotel towel. Wow. \n\nThere is no bathroom here. You need to go to the big tower across the hall.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Came here for lunch on a weekday around 1PM. Place was not too crowded but the tables were dirty.\n\nJust ordered the typical #1 Khao Mun Gai. The food is average, to be honest. I've definitely had much better ones elsewhere. I preferred the one from Kin Khao more. However, for the price, Rooster & Rice does an excellent job at this dish.\n\nOverall, it's simple, healthy, and clean. Can't complain much for the price and how fast the food comes out.", "author": "Sang P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Very solid hainan chicken and rice. It's a not a great amount of food for the price, but about right for San Francisco lunch prices. You get chicken, rice, sauce, and a bowl of soup for the price, and you can also add egg, extra chicken, or extra sauce for a few dollars more. I went with the original with an egg, which was a decent portion and the egg was pretty well done.  The broth was just okay, while the chicken, rice, and sauce were pretty spot on. I could have done with more sauce than what was given but I guess I could pay for extra sauce next time. \n\nThe natural comparison for Rooster & Rice would be to Nong's Khao Man Gai in Portland, which is still the superior hainanese chicken rice, but R&R is still a very solid option for a good lunch that I will be looking forward to coming back to again.", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-11", "description": "Rooster is healthy and the rice is tasty. Wait, no, other way around. Or does it really matter?\n\nThe chicken is good, but way overpriced. 12 bucks for piece of meet and some rice? Even if it was farm to market or whatever, hand-picked chicken in some San Franciscan urban farming, it's still a lot.\nAlso, the lines are getting humongous, so I guess they won't really make it cheaper, but at least they could make sure that once you place your order, you get it fast. There are like 4 items on the menu, so it's not like they couldn't predict ahead what people gonna order...", "author": "Jakub S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "I'm from South East Asia and this is as good as it gets ! The chicken is always fresh and the rice delicious. \nIf you're hankering for Hainanese Chicken Rice Malaysian style this is well worth it ! \nThe staff is friendly and kind. They don't have bathrooms but at least the nearest bathroom is just down the road in a Mexican restaurant. \nI come here at twice a month to fulfill my chicken rice cravings ! Yum", "author": "Pilates G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "Rooster and rice is a basic Asian-styled comfort food establishment in FIDI. They only have 4 menu items, all surprisingly enough focused on chicken and rice, except the vegetarian option! Each entree comes with soup and some spicy sauce. This is a good basic comfort food, although it's a bit on the pricier side ~15$.\n\nThe interior is pretty small, they seat about 20 people.\n\nI ordered:\nThe Original - chicken with the skin, jasmine rice, an extra poached egg, cucumbers, and spicy tangy garlic sauce.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Went here for the very first time a couple weeks ago. I wanted something that wasn't a salad so I was happy they had the paleo option. It came with a generous portion of chicken breast, broccoli, and cucumber. The sauce is amazing! Just the right balance of sweet, tangy, salty, and that zing with the grated ginger! Delicious!\n\nWhat's even more delicious was the fried chicken skins! I rarely eat it just because it isn't the healthiest, but once in a while it's nice to treat yourself.", "author": "Lea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Where are my 626 homies at? If you're from the 626 and have \"Savoy Standards\" for hainan chicken (I guess Rooster & Rice is technically the Thai version, but they taste the same to me haha), you definitely have to come check this place out. This place is amazing and checks all the boxes for what good quality hainan chicken should be - fragrant and perfectly cooked rice, tender chicken, and mouthwatering sauce. Their sauce is so bomb that I can eat it with plain white rice, all day everyday. \n\nThe menu is also very \"SF friendly\". So far I've only tried the original (chicken with jasmine white rice), but they also have a healthier version (with brown rice), a vegetarian version (with tofu instead of chicken), and a paleo version (sub rice with veggies). I'll be sure to come back for one of the healthier options on one of my non-cheat days (:", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "I guess I'm just not that thrilled by poached chicken & rice with some cucumbers on the side. I like my lunch to be a bit more colorful and complex. But hey - if you're into the clean eating, Paleo thing, Rooster & Rice is probably your jam. \n\nI did appreciate the side of chicken broth (rich & delicious - would be perfect for a sick day), and the sauces that come with it (a vinegar and a spicy sauce). Points for using Mary's Organic Chicken.\n\nThe line was pretty intense, took us about 20 minutes to get to the front and order. But, the outdoor seating is a lovely spot to chill with your chicken after. Super sunny and full of happy lunching people.", "author": "Nique F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "On my second visit to rooster and rice, I went to a different location close by my office.\n\nI wanted to go for a healthy option and avoid carbs, so I chose the Paleo - both chicken breast and thigh meat over vegetables (instead of rice). The vegetable bed was primarily steamed broccoli and five slices of cucumber. I honestly wasn't impressed by the vegetable option, especially considering my dish was over $14. I was hoping there would be some cabbage since that is what Ive had with this dish traditionally at other restaurants. \n\nThe chicken itself was good and I did like the sauce, however there were a lot of beans in my sauce which I didnt like so I had to pick them out. \n\nDon't try to be healthy and get the paleo. Last time, I had the chicken over rice and it was so much better. The rice truly soaks in the sauce and it becomes very flavorful. \n\nI also love the chicken soup! If there was an asian comfort food, I would think this combination was it. \n\nArrive early, avoid the lines. I came at 11:45 and there was no line, but by the time I got my food, the line was out the door and around the corner. Grab a seat outside in the courtyard on a nice day! Small groups (2 people) are best.", "author": "Claire W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-28", "description": "Place - Easy to find. Sign board is vivid and easy to read. It is one of restuarant in 303 building. There are few tables inside and lot of tables outside. \n\nTaste\n* The Original - It came with thigh and breast part, rice, soup and sauce. It is simple. Chicken was boiled and no seasoned. Rice and soup was little salty. It was quite good combination. And It tasted really healthy. \n\n*The Pleo - it came with seasonal veges. I expected several kind of veges but only broccolis. Well, it was disappointed to me. I checked photos of pleo on Yelp. Everyday pleo came with broccolis, no change. If vege is always broccoli, it might be better just writing on board, the pleo comes with brocolis. Taste was same with the original.\n\nService and Price - Service was good and Price was reasonable.", "author": "Da Won L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-05", "description": "Gonna go against the tide here and say that the 5 star reviews are probably for the healthiness of this spot as a take out place, as opposed to the tastiness. To be fair, poached chicken is about one of the healthiest meals you can get around these parts without resorting to salad.\n\nThat being said, I found the chicken to be severely lacking in flavor (unlike really good Hainan chicken, which is super full of chicken flavor), though there was a good amount of it. At $14 though, it seemed like a fair amount. I would have preferred the sauce to be cooked into the chicken instead of a dip. 3/5.\n\nThe rice while the appropriate amount of oily, was a bit mushy. 3/5.\n\nThe broth that came along with the chicken is where all the flavor went! This was excellent (4/5), and I'd come back for the broth alone. \n\nSeating inside was nice. Seating outside by the fountain, while nice in theory, was a bit precarious given the (actual) swarm of mosquitoes that formed as I was eating....", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Not gonna lie, the presentation did not give me high hopes but Rooster & Rice legit made me eat my initial thoughts. \n\nThey apparently only have one non-meat option (tofu) and it comes with just a super white lump of tofu, rice, some cucumbers, a side of brown sauce, a side of hot sauce, and a side of almost clear broth that we're apparently calling soup but I think that's kind of a stretch. \n\nMy coworker got the chicken version and it looked exactly the same as mine only his super white lump was apparently chicken. \n\nWe kind of looked at our containers for a minute and were like, 'oh boy' in the most sarcastic tone but then I drizzled some of the brown sauce, added probably too much hot sauce (the habanero one and the milder one were both great), and I chugged the 'soup' which was not very flavorful but even still, I like extra sh*t with my meal so it was exciting and on a colder day it's prob perfect. \n\nI tossed my box of stuff around with all the sauce and even though there was actually a whole lot of food in the portion, I couldn't stop eating until I finished the whole thing. It was healthy, delicious, and a real game-changer in terms of my lunch habits when I have to go into the office. No more oatmeal packets and microwavable soup cups for me!", "author": "Candice G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "This place was pretty good. I like the simplicity of the chicken and rice dish. The dish came with piping hot chicken soup (always appreciate it when it's extra HOT), flavored rice, chicken, and some magical vinegar/spicy sauce. \n\nThe ingredients were fresh and yummy but honestly, the sauce really made the dish. Without the sauce, the rice and chicken would've been really bland. \n\nI would come back if I feel like I want to spend a little extra for some chicken and rice ($11-13)", "author": "Karen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-25", "description": "Ever since Bryan Lew and Tommy Charoen opened up their Marina shop (review: http://bit.ly/2uXGQ5b), I was hoping they would open another shop closer to my neighborhood in SoMa. After all, I can never get enough steamed chicken, or in this case, poached Thai-style. There's only four items on the menu. The $11.95 Original is their most popular item and the classic version of Khao Mun Gai, a breast and a thigh, both sliced boneless with their skin left intact, accompanied by some jasmine white rice that got intimate with the cup of chicken broth that comes with the dish. The $12.95 Marina is aptly named because it's a skinless breast with brown rice.\n\nThat sounds so Marina. You can bypass the cluck entirely by ordering the $9.95 Vegetarian with tofu, brown rice and seasonal vegetables, or you can split the difference like what me and Jamie W. did and order the $12.95 Paleo which allows you the choice between a breast or a thigh and accompanied just by the seasonal vegetables with no rice. While we love broth-drenched rice, we didn't need the extra calories or barbs, and the chicken was nicely succulent (photo: http://bit.ly/2eMp3Yg). I barely used the spicy soy sauce preferring instead the chili-infused hot sauce they provide in squeeze bottles. It has a real kick which goes well with the broccoli.\n\nBy the way, broccoli is the only \"seasonal vegetable\" I've ever seen them serve so keep that in mind. There's more seating here than in the Marina, about a dozen seats inside, several patio tables on the immediate terrace and lots of open seating in the 303 2nd Street plaza, an inviting spot on a warm day akin to the wooden lounges on The High Line (photo: http://bit.ly/2eMabt0). I've been making a culturally insensitive remark by referring to the specialty here as Hainan chicken, the Singaporean dish which is what I am most familiar with from its best stateside version at the Savoy Kitchen down in Alhambra (review: http://bit.ly/2uWbMTL). But hell, this was pretty damn good, too.\n\nFOOD - 4 stars...Thai-style poached chicken is a tasty delight for those looking for a Hainan chicken fix like me\nAMBIANCE - 3.5 stars...small, clean and modern with a distinct lack of character and a primarily Asian target market...none of the Giants fans appear to stop here on the way to the game\nSERVICE - 3.5 stars...OK, nothing special...though I like how they stay open until 8PM on weekdays for those of who don't work in the area...wish they'd stay open on the weekends\nTOTAL - 4 stars...paleo is the way to go at this fast cluck stop", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "I took a break from my MealPal adventures and met up with a friend for lunch at Rooster & Rice. After reading the reviews, I decided we should probably head here before noon in order to beat the lunch time rush. We arrived at 11:45am and there was already a line forming out the door. \n\nThe lunch line moves pretty quickly and they have already perfected the ordering process. I decided to go with The Marina because I'm still on a low calorie diet and this was nutritious enough for me to not have to worry about it turning into fat. It's all white meat chicken with veggies, brown rice, sauce, and a cup of broth. Now granted this was a $15 lunch, it's not cheap. I do feel like the ingredients are high quality and organic does give me the warm and fuzzies. \n\nGetting a table wasn't too difficult. Two seats freed up on the communal table by the time we got to the front of the line if you don't mind eating a strangers. Otherwise there's outdoor seating but it was a little too chilly outside for that. \n\nIt would be great if they participate in MealPal though. I'd eat it daily.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "I'm really surprised this place is as busy and highly regarded on Yelp as it is.  I was extremely disappointed after eating here.  I'd seen the lines so I made an effort to come early around 11:30am on a Monday which was a good move.  I was excited to see the \"paleo\" option but after eating I realized I felt \"off\" and then realized one of their sauces is soy-based.  While I should've given more thought to the sauces you'd think that for an extra $1 \"paleo\" up-charge it would actually be a paleo meal.\n\nFor people who don't care about paleo there's nothing unique about the chicken itself.  It looks and tastes the as if you simply broiled or even boiled it.  It's fresh but I'm not onboard with spending $13 for bland chicken on top of broccoli - that's a lame \"meal prep\" style meal.  The only thing that makes it tasty are the sauces.  Maybe the better move is to buy the sauce for $1 and throw a chicken breast in the oven.\n\nI found the service to be cold and verging on unfriendly.  I tipped 20% for takeout and neither the cashier or person who put the food on the pickup counter said \"thank you.\"  All in all I spent $18 total for a small chicken breast and thigh + some sauce that made my body feel bad because it wasn't actually paleo.  Won't be back!", "author": "george c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Are you around the corner, or maybe you're looking for a quick lunch break, or maybe you just got off from working out at the gym... Looking for a quick bit? Rooster and Rice! You can smell it from a mile away! My mouth watered as I approached this delishyyy smellyyy place! HmMm!\n\nOrdered the *ORIGINAL* - chicken breast and thighs topped on top of garlicky rice (it was kinda soggy, but no fear it was still good), it also came with chicken soup broth (this was my favorite! Keeps my dry mouth wet) and I added an extra $2 for veggies (the only veggie was seriously.... broccoli, so it wasn't really \"like mixed vegetables\" as I imaged it.)\n\nOh, the dipping sauce... DUNK your chicken on it and (omg) the rice! \n\nApprox. ~$14 = it was a good quick dinner... I ate everything up... it was a good dinner\n\n**OVERALL: may possibly come back here... if I'm around the corner. tehe! 4 stars", "author": "Mindy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "If you're looking for something fast and simple, you'll love this place. There are only a few menu options, but it's yummy, if a bit overhyped. A little pricy for what you get, but pretty average for SF food. \n\nGot The Original chicken rice and it came with--surprise--some really tender chicken and jasmine rice, topped with cucumber and cilantro. They also give you a side of clear chicken broth and a ginger/garlic sauce. I highly recommend pouring some of the broth onto the rice and dipping the chicken in the sauce for extra flavor.\n\nThere's not much seating inside, but it's very clean and simple. Great option if you're looking for a quick, relatively healthy meal, but didn't entirely live up to the hype.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "This was the best khao mun gai (poached chicken and rice) that I've ever had in the US (so far). My favorite Thai street food isn't offered at many restaurants back home, but even if it is -- it just never hit the spot... until I looked up \"lunch\" in my Yelp app while I was visiting SF and Rooster & Rice popped up.\n\nThe menu is simple and has 4 options: the original (breast and thigh with skin intact) over white rice, the skinless breast over brown rice, the vegetarian (tofu) over brown rice and seasonal veggies, and the paleo (breast or thigh) over seasonal veggies. You can also ask for additional chicken, rice, broth, sauces, etc. or even add an egg for a surcharge. The prices range from $9.95 to $12.95. There's several seats inside the restaurant if you're dining in but plenty of outdoor seating as well. They also offer delivery and pickup!\n\nI went with the original and my expectations were exceeded. The chicken was succulent, the rice was pillowy soft and the broth was flavorful. I finished every bite and I'm already looking forward to my next visit when I'm back in SF.", "author": "Annie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "White meat, white skin. Contrast that with the dark sauce with peanuts and spices. Really enjoyed the white Jasmine rice that seemed to have some sauce already applied. The homemade hot sauce has a slight sweetness to it and wasn't terribly spicy. The pork skins were super rich and pricy. Couldn't eat more than like 5 chips. \n\nWent for lunch and there was a line that move pretty quickly. Probably waited 10-15 min. I would definitely go again! Seemed like high quality food and different from typical Asian food because it was not oily at all.", "author": "Young Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "A teammate recently introduced me to Rooster & Rice, which was a dangerous move. I got the Marina (#2) and boy was it delicious! Takes me back to eating at street carts in Thailand! The chicken was tender and moist, brown rice seasoned extremely well (thinking that they might use the broth to make it), delicious sauce, and the broth was seasoned perfectly! A healthy lunch option that's delicious, and it lasted me two meals. Will def be here again, especially once the weather cools down.", "author": "Andrea O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Had the Original (breast and thigh with skin on top of jasmine white rice and a side of sauce). Added a poached egg for $2 more. The chicken in of itself is nothing special and it tastes healthy cause of the way it's prepared (steamed?). Not dry at all, but the real star is the side of sauce which is tangy and sweet (almost tastes like a thinner Worcestershire with sugar and ginger). The rice too was a perfect accompaniment. Tasted like it was cooked in or moistened with chicken broth to give it that extra flavor. The runny egg added that final touch of color, texture, and flavor. Bonus: came in a recyclable container. Minus: tough to find parking in the area but that's all of SF. Overall, recommended and make sure to get extra sauce!", "author": "Jay F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Fantastic chicken and rice dishes! Stopped by Rooster & Rice on a Friday evening with a group of friends -- it was surprisingly pretty empty and there were plenty of seats inside and outside.\n\nI ordered their original ($12) which came with a good portion of chicken breast and thigh meat over seasoned rice, along with a bit of cucumbers, a dipping sauce, and a small chicken broth soup on the side, It's so simple yet very flavorful -- the seasoned rice goes so well with the light and dark meat of the chicken.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "Was so excited to visit Rooster and Rice during a recent visit to SF cause if it's one thing I know and grew up eating, it's the sort of \"hainanese\" chicken rice. Overall my experience wasn't bad, but for these little gems I have HUGE expectations. \n\nI definitely can't complain about a restaurant that dedicates their entire existence to one of the most quintessential dishes of my youth. With that said, i'm also highly critical of it. Starting with the chicken itself, it just didn't feel right without the bones in the chicken. The bones are a source of flavor and are important to having the \"wholesome\" feel. While the chicken was cooked nicely, it was missing so much of that great chicken flavor. \n\nThe rice was very nice, albeit perhaps a little bit too fragrant. I understand the need to really give the jasmine rice a kick, but I didn't feel like I could actually taste the sweet white rice itself. Ordered some broccoli with mine and an egg. Seemed very out of place and didn't really add to the bowl.\n\nThe soup, however, was just as it was when I was growing up. The sauces were pretty unnecessary in my opinion. Didn't really care for or need them.\n\nOverall not bad, would come here again just for a quick lunch, but for hainanese chicken rices, there are definitely better options imo", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-14", "description": "Rooster & Rice is beloved by SF hipsters. Where else can you get boiled chicken over rice and pay over $15?!\n\nPrice aside, the food here is great! Simple preparation using quality ingredients makes for a very delicious meal. The chicken broth is always my favorite part of the meal - it warms the soul!", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "I've been here about 4 times now. I always order the original, and if available, I'll also order a bag of crispy chicken skins. For $11.95 (pre tax, SF mandate, etc.), you get a decent portion of chicken, rice and broth. Normally, I don't like poached chicken because I think it is flavorless. However, the sauce that they provide you makes the chicken taste GREAT! The chicken itself is always moist and the consistency/quality is always there. The rice isn't plain rice. It is quite flavorful, in a subtle way. \n\nDuring the lunch rush, there will be lines out the door because it takes them awhile to assemble the chicken bowls in the back. I suggest you come on the earlier end of lunch (think 11am) so that you don't encounter a line and can be in and out in no time. \n\nIf you come with a group, and want to eat there, there are some tables outside as well as some seating inside. For large groups, I recommend you order take out or delivery.", "author": "Carolyn Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "Came here on a Friday and there was a line out the door but the line moved quickly. Menu was very simple. I ordered The Original and it is pretty overprice for what it is (11.95 before tax). It was a jasmine rice over chicken and it comes with the sauce (what made it good with some hot sauce) and chicken soup. There wasn't much skin on the chicken as they have fried chicken skin on the menu. \n\nI also tried the fried chicken skin ($5)and it was meh. It was already cold when my coworker got it but it was a good amount. I could prob only eat a couple. \n\nOverall the sauce is what made it good but for the price of what it is... I prob wouldn't go back.", "author": "Sherry Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Got to try this place out during a recent trip to San Francisco, and quickly learned how popular of a lunch spot it is in the city. Luckily, we got there a few minutes before the line went all the way out the door. \n\nThe menu is pretty simple and I ended up going with the Original, which I believe is #1 on the menu (makes sense right). The chicken, veggies and rice were all amazing and I ended up inhaling my lunch once I got it back to the office. It's there amazing sauces that come with the meals based on which you order that really make things come together!", "author": "Isaiah W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "Ordered \"The Marina\", skinless chicken breast with brown rice. Service is fast, the food comes in compact form but portions aren't big enough in my opinion. The taste was ok, a bit spicy tho. Also their napkins are surprisingly soft and thick.", "author": "Rafic K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Hands down the best meal I had in SF. Looking at the picture you wouldn't think anything special; in fact, I had it bookmarked but we decided not go. Rooster & Rice happened to be next door to a place we were visiting, so we said why not. I am so glad we did. The dish looks so simple yet the flavors are so complex. The rice is cooked in the chicken broth and the chicken is so juicy and tender. The ginger sauce compliments the dish very well. Make sure to grab some of their homemade habanero hot sauce!", "author": "Janie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "They only serve Khao Mun Gai here (aka Hainanese chicken with a different dipping sauce). A very simple dish of chicken poached in a mixture of ginger, garlic, and chicken stock with a garlic, chili, soybean dipping sauce. \n\nYou can customize this to be super healthy when eating on a bed of broccoli. The flavors are comforting albeit a bit pricey for the amount.\n\nVegetarians - they have a tofu option!", "author": "Theresa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Solid 4 stars for this place. Don't be fooled by the simple and limited menu of rice and boiled chicken. They make it delicious. They have a secret sauce (literally) and it always leaves you satisfied. If anything- their chicken portion is too big. Lines are not too long, and their napkins are the softest I've ever used. \nOne star less because it pretty expensive. $14 on average for a meal.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Great staple lunch spot in SOMA. There's usually a line during the lunch rush but it moves relatively quick. There's some seating inside and outside as well. The menu is super simple which is not a bad thing but there is definitely room for growth. I have been here twice and both times I ordered \"the original\" with brown rice. It comes with chicken w/ skin (dark + white meat) over a bed of rice and a side of cucumbers. The meal also comes with a yummy broth! The quality of the chicken is amazing and everything tastes fresh. What makes this meal outstanding is the soy sauce which is mixed with garlic and bunch of other good stuff. SO flavorful and unique. \n\nI always forward to grabbing lunch here. Next time I definitely want to try the coconut drink that comes in an actual coconut!", "author": "Mandi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Tastes great in-house and delivered. I am SO happy there is finally a place that specializes in Hainan chicken that you can count on. Who doesn't appreciate flavorful and tender chicken from the expected dry and flavorless? Not to mention, every bite of rice has the deliciously oily and flavorful chicken broth that it has been cooked in. Oh, and for even MORE flavor, the dipping sauce will put you over the edge. Nom nom. The price is kind of steep given it is only chicken and rice, but they make a mean chicken and rice... and got no competition. Just don't get the add-on \"veggies\" - For $2, all I got was some disappointing steamed broccoli. :(", "author": "Vickie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "I've heard about this place through coworkers for while, so when given the opportunity to grab some lunch here on a Friday afternoon, I quickly jumped on it! \n\nDon't get me wrong, I think paying about $12 for chicken and rice is a little extravagant but man, you have to try it. To back up a bit, when you arrive, you stand in a line that moves fairly quickly. The staff is super friendly and efficient. The menu, VERY simple so shouldn't take long to decide. There are 4 main dishes to choose from and 7 extras to add on. They also have fried chicken skins at the front for $5 with samples to entice you. \n\nThe most popular dish and the one I chose was \"The Original\" for $11.95: 2 pieces of poached organic chicken, thigh and breast with skin, sliced over a bed of jasmine rice cooked with chicken broth instead of water, topped with cilantro and served with cucumbers and a chili, ginger, garlic and soybean dipping sauce. I added on a side of veggies (broccoli) for an extra $2. OH EM GEE, I would come back time an time again for that ginger dipping sauce. It was one of the best sauces I've had in a while. The chicken was good, the rice was heaven and add in that dipping sauce to elevate the entire dish from level 4 to 36, and you've got a HUGE flavor dish. \n\nI now know the reason for the hype. It's completely worth the price and overall, the food is exceptional. Just comes to show, simple ingredients made right and the people will come!", "author": "Rockne H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-28", "description": "Don't get me wrong, I love pricey SF lunches, but 17 dollars for Chicken and Vegetables? If the flavor wasn't so damn good, I wouldn't keep coming here but 17 for a meal is a little much for what is. \n\nDespite the price, Rooster and Rice is a very quick and satisfying concept. You choose what pieces of the boiled chicken (leg, thigh, both) you want and add a side. The paleo is veggies, the original is with rice. The overall combination of flavors is simple but so flavorful. Especially with their ginger sauce, you will be addicted. \n\nKudos to the staff for bringing rooster and rice to the SOMA area. Not a lot of indoor seating, but there's a good amount of outdoor seating in the beautiful pavilion. The wait is massive during lunch, so highly suggest going after 1!", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Yummy chicken over rice. Simple but yet must haves on a busy day or a hungry day or a gloomy day.", "author": "Jane L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "I was a little skeptical to try this place out because I don't know how I feel about pale chicken.\n\nI might be scolded by all the asians on here but I'm not used to eating blanched chicken so it was definitely a new experience for me.\n\nI came here for lunch with coworkers and ordered the Original which has both chicken breast meat and thigh meat. The chicken was well cooked and tender. The dipping sauce was tasty and had some ginger flare. The spicy sauce on the side was spicy but gave the dish and interesting kick. My favorite part of the dish was probably the rice and the side of chicken broth they give you. They probably cook the rice in the chicken stock so it gave it a wonderful flavor and aroma. \n\nOverall, I think I prefer grilled chicken to boiled chicken. I feel like boiled chicken has a weird chewy texture and the skin creeps me out with the bumps. Also it almost makes the meat taste more gamey if that's even possible.\n\nFire away! I know I'll get heckled for this one because I don't have quite the seasoned palate for a dish like this.", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "I've been wanting to check this place out since I've returned from my vacation to Singapore. It looks and tastes just like Hainanese chicken but they call it Thai chicken. Anyways, the chicken was super tasty and moist. The sauce that comes with it compliments it so well. The rice was a bit too moist to my liking but still very flavorful. I tried it with their habanero hot sauce and it was amazing! Definitely satisfied my Hainanese chicken and rice craving!\n\nThe broth on the other hand was a bit too salty for me so I didn't finish that.", "author": "Ang W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "There is no secret to why this place consistently has a long line out the door wrapping around the corner. It's delicious.\n\nSilicon Valley techies from all over flock to enjoy the aromatic chicken remedy which soothes many a jaded startup soul. As one whose diet often mirrors the latest Tim Ferriss podcast episode I can't live without the bone broth.\n\nIt's tasty. It's healthy. It's succinct. It's delightful.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "I love the simplicity of this food. It's super comforting and filling. I always get an egg, it's great mixed in with the rice. \n\nNegatives: the skin on the chicken is fatty. The broth isn't my favorite. \n\nI order ahead on caviar but you don't really need to since it's pretty quick.", "author": "Lori W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "If you're looking for something simple and healthy, this is probably the spot for you!  Every order typically comes with chicken, chicken rice, sauce, and a cup of chicken broth.  I really enjoyed the broth - it was light and pretty flavorful.  I also enjoyed the chicken rice, which was both well cooked and flavorful.  The actual chicken and sauce was a bit lackluster for me though, as I thought there would be more to it.  I ended up using the sriracha they have to add flavor to the chicken.  I think that this place could be improved by offering a wider variety of sauces for patrons to dip their chicken in - similar to comparable restaurants elsewhere.  \n\nThe price point is a little bit more than what I would like for a meal like this, but it was fair considering it was also downtown.  There's plenty of seating here, and everyone was super friendly.  If you want something light for lunch, I would definitely recommend stopping by Rooster and Rice!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "Rooster & Rice is pretty everything I'm not looking for in a lunch spot during work, besides the clean interior. The line when I went was a little long, but typical for SoMa lunch. Interior has a very sterile/clean feeling to it. White walls and countertops everywhere, and the menu is short and simple. But simple doesn't really mean much when only the Paleo comes with actual vegetables that don't cost extra (but at $14 it might as well be considered that you paid extra). I will say that the packaging and napkins feel high quality. When it's nice out, the out door seating is a plus!\n\nIn terms of the actual value of the food and everything, I feel weird heading to a restaurant to only order chicken and vegetables (because I'm sure as heck not ordering chicken and rice for $10!). Not a big fan of ordering something that at least *feels* like I could make it at home and bring it in. Just not my cup of tea, but some of my coworkers swear by this place. Maybe I just got my expectations up a little high. I will say that the coconut intrigued me so I'll probably be back in the future, but I wouldn't go out of my way for it.", "author": "Rajeev S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "DELICIOUS! I am a huge fan of Hainan chicken rice and this is pretty delicious even though it isn't exactly the same dish! \n\nMy friend and I dropped in around 1pm on a Wednesday and there was a still a line. The line goes by pretty quick, which is perfect for those with a short lunch break. I ordered The Original which contains both breast and thigh meat over jasmine rice, cucumber, broth, and a dipping sauce. The rice was perfectly cooked and flavored. I wish they had the option of thigh meat only, but the breast meat wasn't too dry surprisingly! The cucumbers were refreshing and the dipping sauce paired well with the chicken. Wish the dipping sauce didn't contain peanuts though! Also, the small cup of soup that came with it was great as well. \n\nFor $13 (after tax) you get quite a lot of food. You could probably stretch this out over 2 meals! The interior is clean, though there isn't much seating. Thankfully, there are some seats available outside. Parking is difficult, which is typical of the area. Will definitely stop by for lunch whenever I'm in the area!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "The food here is extremely aromatic especially when it's being cooked --- It's almost impossible to not want to try this place if you work in the plaza unless you have dietary restrictions or absolutely despise chicken. Every time I smell the chicken, I want to grab Rooster & Rice for lunch! The aroma definitely draws people in. \n\nHowever, I was hesitant to try this place because $13+ for what seems like the typical Hainan chicken with rice seems a little crazy to me because I can easily eat Hainan chicken at home for way less than that. But one day, I decided to treat myself to some Rooster & Rice! I wanted to know if the chicken tasted as good as it smelled and I wanted to know if Thai chicken + rice tasted like Hainan chicken + rice! \n\nAND GUESS WHAT, it did, sorta! \n\nI ordered the Original: chicken, rice, cucumber, soybean based sauce, and chicken broth. \nUpon first bite, the chicken was tender, healthy tasting, but bland. I was a little disappointed, but definitely not surprised. But here's where I got undisappointed: when I tried the sauce! The sauce is gingery, garlicy, and soybeany. It complements the chicken and rice so well. So if you enjoy the sauce, you'll definitely enjoy the chicken! Similarly to Hainan chicken + rice, the chicken is poached so it's not very flavorful. Sauces are essential to enjoying both chicken + rices! \n\nFor around $15, the meal definitely filled me up just enough. I'll definitely come again when I feel like treating myself.", "author": "Yi Xian R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-21", "description": "I like this franchise along with the location on Kearney . For those on a low carb or carb free diet the Paleo plate is a delicious option.\n\nI was very skeptical but the broccoli and the chicken do taste very very good in the broth.\n\nThe price does seem a little high given what you get but that's sf for you. Both locations get very busy during lunch.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "I would go here for the ginger soy sauce dip and the cooked rice - they probably cook the rice in chicken broth instead of water - because both were so good!\n\nOf the four options the Original was my favorite. It's a basic boiled chicken with warm rice comfort food. The Marina is \"healthier\" since it's skinless chicken with brown rice. The Paleo was good as well but it's just chicken and veggie. All orders come with a cup of chicken broth.\n\nYou can add a soft egg to each order but it's not needed unless you really want a runny egg with your meal. They have a dipping Sriracha sauce blend if you want a kick.\n\nGo around 12:45pm or later and avoid the lunch crowd line. Be prepared to wait after ordering though.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Goo paleontology food.freah..great taste chicken..I love sauce..good service.\n\nReasonable price.", "author": "Supawat J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "This place. Is. Nails. \n\nIf you're looking for a healthy, flavorful option in SOMA then Rooster & Rice is a fantastic option. Be prepared to wait in a little bit of a line during lunch hours but, it moves quick enough and is well worth the wait. \n\nI ordered \"The Marina\" which is brown rice, skinless chicken breast and cucumbers. I added some extra vegetables (broccoli in my case) and man was it delicious! It comes with a great soy based sauce that's chalk full of onions, garlic and other flavor filled herbs. \n\nGet here ASAP. Out.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Rooster & Rice is awesome. I felt the need to get a bowl of rice and chicken with an egg on top. Without further thoughts, I came in and ordered The Original. This bowl contained rice, chicken, cucumber, cilantro and sauce dip with an egg on top.\n\nThere may be a long line especially when coming here for lunch during the week. However, I do want to admit that it does move fast which is always a good thing. Seating is limited inside, but there are more seats available outside. Rooster & Rice is a good spot for something to eat before or after the gym.\n\nI also admit the entire meal is delicious and will come back again to try the other bowls.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "For me it's a must if you're around Downtown San Francisco! Their Thai style chicken rice was so hearty and yummy that I had to order a second portion for myself (I'm usually not a big fan of rice).\n\nRooster and Rice was actually not in my itinerary for my SF trip. I was planning to take my bf's family to the famous San Tung, but it was closed on Wednesday, so I was desperately looking for an alternative and I forgot how but I found this place. I guess it was a destiny for us to go here and enjoy the chicken rice, as well as the SF downtown vibe (although the parking was a lil' bit of a hassle). \n\nI personally thought the best thing from this place was the sauce, the garlicky, gingery, soy saucy sauce. I'm not sure what they put in the sauce (some kind of magic dust or fairy dust), but it was soooo addicting. Too bad I had to pay for more, or else I would gulp down all the sauce. \n\nThe 7 of us initially only ordered 5 for sharing, but we ended up getting 8. The cooking time could be a lil' bit long, but I guess that's what you have to bear to get the freshest right?\n\nBy the way, they can deliver via Postmates app if you are not in the mood to fight for parking spot with other Downtowners.", "author": "Nathania Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Having heard glowing reviews of this lunch spot, my boyfriend and I decided to check this place out, and it did not disappoint! As Singaporeans (though I know Thai chicken rice varies slightly from Singapore chicken rice), this tasted like home away from home - from the fluffy, flavoured rice to the boiled chicken and soup on the side! While I'll admit that $12 is pretty pricey for a bowl of chicken rice, the restaurant makes up for it with a generous serving of protein.", "author": "Sabrina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Tried the Original. Really good Hainanese Chicken! They call it Thai but I think they taste just like those well-executed Hainanese Chicken Rice I've had in Singapore. \n\nIt's slightly pricey for a workday lunch, but given they cook their chicken so well, I'm willing to eat here every so often.\n\nMake sure you grab some of the hot sauce on the side. They go really well with the chicken!", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-04", "description": "Chicken and Rice. It's a very simple meal. If that is what you are looking for, and you definitely aren't looking for any other variations, then this may be the place for you! If I am making it sound like a meal you might expect at a cafeteria, I haven't yet talked about the sauce! It's soy and ginger based, and it's all the seasoning you should expect. I am probably being unfair, because the chicken is cooked well, and the rice is also cooked. There's just not much more to expect. \n\nThere is a line at lunch, so be prepared. At least they seem to have sorted out their service/capacity problem from the first time I visited. \n\nLet me run through everything in the $13 (after tax, no tip) original meal. Poached chicken on a bed of rice. 3 slices of cucumber, quartered. 2 oz of soy-ginger seasoning. 1 small cup of chicken broth. I'm not sure what to do with the chicken broth. Do you just drink it? Add it to the rice? It is certainly the most confusing part.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "What an ingenious idea for a quick, healthy, delicious lunch joint!  I went with the original, which is skin-on chicken over white rice, and a delicious garlic sauce that I suggest you use generously. The chicken is so incredibly tender and tastes incredibly comforting with the rice. My only critique is that everything could've been hotter (the chicken was lukewarm). A tad overpriced at about $13 for lunch, but not bad for SF standards. The line gets long during the weekday lunch hour, but moves fast!", "author": "Chloe Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "On 8/1/2017, I decided to try this chicken food shop located within the 303 2nd Street building in South Market neighborhood called, \"Rooster & Rice.\" Rooster & Rice serves the customers to taste their finest \"Khao Mun Gai\" entrees that will devour their tastebuds! The atmosphere and the concept is much simple by serving one of Thai's greatest and easiest food to go option by adding chicken and rice combined especially for vegans too which they also have organic tofu with rice as an alternative!\n\nThe employees from counters and cookers are doing a great job for making the customers like me a tremendous service! Friendly and approachable. No cons at all!\n\nNow onto the food! I ordered \"The Marina\" chicken plate which it includes skinless, poached organic Mary's chicken breast with organic brown rice and slices of fresh cucumbers. It also includes fresh chili ginger garlic with soybeans sauce and a small cup size of fresh chicken broth. As a result, that meal tasted flawless and outstanding! It compared and tasted like eating a Chinese styled chicken breast right directly from an Asian supermarket because of a distinct broth taste! Very clean and eatable to bite without any leftover bones around! The brown rice also cooked perfectly without being too harden and dry especially the sliced cucumbers. The sauce, da bomb goodness! I really tasted the ginger into my mouth along with a spicier taste of chili and garlic combined! Awesome sauce! Finally, the chicken broth tasted superior and naturally delicious just like slurping Sawnson's Chicken Broth. Not a bad meal for lunch!\n\nParking at Rooster & Rice can be quite challenging to park. You can park at the nearby surface metered street parking if it's available. Alternatively, you can also ride a bike, walk, carpool, ride sharing or public transportation easier without the hassles and gimmicks.\n\nIn the end, Rooster & Rice is the finest and most remarkable chicken food shop that I've ever visited for the very first time right here in San Francisco! Perfect for your lunch or dinner break needs! A well visit! My rating: 4 solid stars.", "author": "William L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "I've been visiting Rooster & Rice frequently since they offer a nice selection of healthy food items and it's conveniently located down the street from my work! \n\nI'm a huge fan of Hainan Chicken and knew I had to give this place a try when they opened a location in the SoMa. My favorite dish here is the \"Paleo\", which is Mixed Chicken with a bed of steaming fresh Vegetables and a cup of Chicken Broth. Also, don't forget to get that amazing ginger dipping sauce on the side! The sauce is seriously so addicting and I don't blame you if you decide to drench all your chicken into it (guilty, that's what i did!).\n\nThe food here might be pricey but at least what they offer is healthier than the food trucks near by. Rooster & Rice has been added to my rotating lunch schedule for the week and I'm looking forward to visiting again later this week!", "author": "MyTien P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "$15 for the rooster & rice entree + an egg. after tax. The meal comes with a small side of broth\n\nRooster & Rice is a bit overpriced, and service is very slow since this place is very popular these days but it was also delicious. This is definitely not traditional chinese chicken, but thai. I felt a bit mislead by the previous reviews, but i love all asian food so I wasn't disappointed. \n\nThe white jasmine rice is not plain rice, I'm not sure how they season it but my guess is it's cooked in some broth and seasoned. overall, I really enjoyed this lunch - I wish my food would come out faster but I'd definitely come back for more :)", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-31", "description": "I paid $17 for a bowl of rice and chicken breast with a token scoop of broccoli after tax and tip.\n\nThe sauce was good, the rice had some half-decent flavor, and the chicken was tender, but at the end of the day I paid seventeen smackeroos for a barely-above-mediocre dish. I could have made something almost as good for half the cost, even with SF grocery prices being as insane as they are.\n\nOf course, there's more to a final product than its bill of materials. You have to take the quality of the recipe and skill of the cooks into account. I've got no problem paying for someone with great skill to turn a few simple ingredients into something delicious, but the dish is just so uninteresting I can't give it any credit here either. It's chicken breast and rice, the bread and butter of college students and bodybuilders alike. No new ground is being broken, and the flavor isn't anything out of the ordinary.\n\nOh yeah, and the $2 \"veggies\" is literally just five pieces of steamed broccoli. When I took the lid off I had to ask my friends if they forgot to give the veggie side to me or something. I actually felt cheated that they had the gall to charge for such minuscule morsels of greenery.\n\nSkip this place. Do yourself a favor and go to Dragoneats. It's a block away, tastes better, is no busier at peak lunch time, and is half the price.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Tooofffuuuuu and sauce! Seriously the sauce is amazing and no offense their chicken is, um, not good. It's simple and likely not the highest grade. The tofu absorbs the sauce better and their rice is super good too. Did I mention you should get an extra sauce? :)", "author": "Jason P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "The only really clean meal option I know in the FIDI/SOMA area in SF. All \"healthy\" options out there aren't clean. they usually come with sauces, unwanted carbs and fat, etc. This is your paleo/ clean/ macro-friendly go to.", "author": "Debora C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Still solid. Probably one of the best/healthiest lunch options in SOMA.\n\nOnce again, I ordered the \"Marina\" sans egg on top. Damn, this meal certainly satisfies. The dish consists of brown rice, poached/skinless chicken breast, cucumbers , brown rice, and a side of bone broth. Make sure to snag a few sauces (everything from a soy sauce medley to a spicy red sauce) to douse on your poultry.\n\nWord to the wise... Order in advance (online or by phone). If you just show up to the restaurant during lunch hours, prepare for a long wait. Also, prepare for a large portion. I usually have a pretty appetite, but I could only eat half of my \"Marina.\" Fortunately, I enjoyed the rest of it at home for dinner.\n\nThis place is a winner!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "It's good, but not the best Khao mun gai I've ever had. Nong's in Portland is better. The portion size is larger than expected. It's pretty simple: steamed chicken, cooked Thai style, over a ginger and garlic rice. The line was about 15 minutes long when I came. I don't think it's worth queuing up for. Feels very sterile.", "author": "Billy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "I had actually been thinking (read: dreaming) about the Marina location of Rooster & Rice recently and wanted to go back. One day while running errands in SoMa, I Yelped a place for lunch and discovered that Rooster & Rice opened up another location nearby! Jackpot!! It was in the middle of the lunch rush, but I think enough people are unaware of the awesomeness that is Rooster & Rice, so it wasn't too much of a wait. \n\nOf course, I got the Khao Mun Gai \"The Original\" which is soooo delicious. Love how limited this menu is. They specialize in just a few things, and you can add a few extras on top of whatever you order. Each dish comes with a small bowl of chicken soup. Hot, fresh, and tasty. The chicken and rice comes with a side of garlic and ginger sauce, which is the perfect degree of seasoning. You can also drench everything with the hot sauce available. Gives it a nice kick. \n\nRooster & Rice is one of my favorite lunch spots in the city. I'm never in the Marina, so this SoMa location is quite a blessing. There's plenty of seating outside in the plaza. On a sunny San Francisco day, the greenery and fountain are gorgeous. There's also some seating inside -- more than the Marina location -- but I prefer sitting outdoors while enjoying this warm and cozy meal.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "Came here for lunch... now don't get me wrong, the food is good! Just got the chicken and the rice (duh) and a poached egg. Chicken was pretty good, flavorful and so was the rice. The egg was meh. The sauce was really good too! The soup is definitely a winner, though the portion is very small... but BOY is it pricey... it's just literally rice and chicken... maybe it's an Asian thing, lol. 2 dollars for an egg?! geebus.. SF, you are killing me!!! This is one of those places where it's definitely a treat vs. an everyday lunch. I spent $15 dollars on it, and it's just chicken, egg and rice? lol. if it was maybe fish and rice, or steak and rice then I think $15 is ok, but eeeek.... You guys know I am more than willing to pay for food when it's worth it..\n\nService was good though..def want to also try that fried chicken skin.....\n\nI will be back when I am craving and willing to splurge a bit....", "author": "Judy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "I ordered the marina with extra chicken for lunch. I also got an egg for $2 and that was very disappointing. It was sloppily done, kind of runny but not really. Everything else was fantastic, reminiscent of hainan chicken and rice. \n\nThe wait for not too long, about 10 minutes in liken and another 10 minutes for food. They also had a Thai sriracha sauce, and a habanero sauce. However I'd say the sauce provided with the lunch box went along much better than the sriracha and habanero. \n\nThe location has a lot of sunshine, is close by to a fountain with plenty of open space where lots of people come to enjoy their meal. It was a pleasant experience with delicious food. Just wish the egg was done better!", "author": "Alex S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Bland chicken that tastes like nothing with a pound of rice thats $14. Might as well get a chicken burrito bowl from chipotle, half the price. 3x the flavor, cant believe this place is surviving. Soend your money elsewhere", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "I was hit with a great smell upon entering this place.  The concept and food is pretty simple.  The Marina is my staple dish.  Good portion of tender chicken breast sliced up over brown rice.  I love the little broth they give you.\n\nI don't think $13 bucks for lunch is crazy at all.  I hear from random people how this place is kind of expensive.  I don't get it.  If the food tastes fresh and healthy, then expect to weigh that into the price.\n\nThis place is kind of far for me but a worthy lunch spot for meal rotation.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "Okay, it's more like a 3.5. It was too good to be a 3, but I needed to like it a little bit more to bump my rating to a 4. \n\nThe chicken by itself tastes absolutely bland, and yes, it's all in the sauce, but I found the sauce similar to the sauce you dip XLBs or dumplings in, just with a whole lot of ginger... ALOT. \n\nI've had similar types of Chinese, Hainan Chicken, and generally those chicken have an inherent chicken-y umami flavor that doesn't rely so much on a soy based sauce. I did love the broth though, it was light and refreshing tasting. I like putting the chicken into the broth and eating it that way. \n\nSeasonal vegetables, if you get them, are guaranteed steamed broccoli (crunch is still retained!), and sliced cucumbers, nothing out of the ordinary. \n\nTo me, this meal didn't strike me as Thai. My Thai friend tells me the traditional way is cooking the rice in the chicken broth, but my brown rice was plain. It's worth a try, but I wouldn't come back again. This was also an EXPENSIVE lunch. But you will be full!\n\nUPDATE: I came back to try a second time. I got the paleo this time, with chicken thighs. GET THE THIGHS. It is alot more tender, and alot more tasty! I think the thighs make all the difference. So much protein, and a whole ton of broccoli. Broth is standard and good. I tried my friend's regular white rice, and that was cooked in chicken broth and really, really good (unlike brown rice, which is just plain).", "author": "Ke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Best Hai Nam chicken spot in San Francisco. The chicken is perfectly poached, tender, boneless and with the skin on! The rice is fragrant and prefect in texture and the side of soup is so good.", "author": "Viet P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-12", "description": "New to SOMA and that sauce is AMAZING! made with fresh chili, ginger, garlic and soybean sauce, absolutely delicious! And the rice was cook perfectly. I can just eat the rice and the sauce alone. Yum! I got the original, with both white and dark meat. Garish with cucumbers. You can add veggies of the day for extra $3. Small menu but its great because chicken and rice is all you need. \n\nI got there at 1:10pm and there was no wait. I ordered my food and got my order in under 5 mins. Quick and efficient. There is also outside and inside seating.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Khao Mun Gai for the first time! It's amazingly delicious. The time I went, I got the original with an egg. The original comes with a nice amount of chicken, rice, some cucumbers, a cup of soup, and a small container of soybean sauce. \n\nWhile I didn't end up eating my food here, I will begin by looking at the ambience of the location. The ambience seems pretty modern. Your experience begins when you enter the front doors and you see a pretty minimal menu, which in my books is an A+, since minimal menus allow for less \"decision fatigue\". I also liked the interior design, since the colors weren't very distracting from the whole experience (yes, my whole experience of waiting for my food to-go haha). There is also a courtyard outside of this restaurant, giving you another option if you think the indoor seating is too claustrophobic. \n\nOn to the food! I think what stood out the most to me was the soup; there was just so much flavor, that I probably would have been happy if I had just drunk that (well flavor-wise). The soybean sauce (from which I tasted garlic and ginger, as some of the more prominent flavors) was also something worth mentioning, as it gave an interesting kick to the chicken. \n\nAll in all, I would definitely come back here again, and probably more often too, if it weren't a 15 minute walk away from my workplace.\n\n\nPhoto I took (Instagram):\nhttps://www.instagram.com/p/BYytElLBObT (Original)\nhttps://www.instagram.com/p/BasPORrBBej/\nhttps://www.instagram.com/p/BcGFCpFB48E/", "author": "Ed W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-04", "description": "I like this place's focus on doing one thing right.. but I just don't think that their signature dish is exactly perfect. I grew up eating boiled chicken and rice (in Chinese this dish is usually called Hainan chicken rice) and while I like their packaged convenience, I thought that the convenience was the best part. I tried both the thigh and breast meat, regular and paleo versions, and I'm not sure I would pay $11-13 dollars for them again. Also, while I thought the sauce was fine, I don't think it's as good as the Cantonese style ginger+green onion in oil sauce that had a sharper, cleaner punch. I'm not a food purist when it comes to tradition.. I just didn't think this place was that great.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "It's simple and just soooo good. It may be a little pricey but again it's San Francisco so I don't really mind", "author": "Jackie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "You can't come here expecting Hawker Stall style chicken, but you can expect to a good fast, healthy and tasty meal. \n\nFor ~$14, paleo chicken comes with a hefty portion of breast or thigh meat, some cucumbers (not pickled, sad) and steamed broccoli. It also comes with chicken broth and ginger soy sauce. \n\nThe chicken here is moist, though it's not the typical Singaporean super fatty salty chicken type broth, with almost creamy rice. Nonetheless, I'm a huge fan and an even bigger fan of the outdoor seating. \n\nTip: line seems to get massive around 1215!", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Easy. Macro-Friendly. Meal. Ever.\n\nHowever, it may be seen as a little on the pricier end as you're paying about $12 / 14 for rice and chicken / or tofu when comparing to your typical rice and chicken / tofu plates elsewhere. The quality seems pretty fresh and the rice is very flavorful - a little on the saltier end for my taste but I'd still come back.\n\nThey do get pretty busy as most people order delivery so just be prepared to be patient.", "author": "Cheri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "Rooster & Rice's expansion into the FiDi was clever, especially in time for the Year of the Rooster. After all, which millennial wouldn't be able to resist an expensive but photogenic lunch with a clever fitting Instagram caption! (Yes I am aware that I am making fun of myself)\n\nR&R illustrates my love-hate relationship with the SF food scene--it's delicious, wholesome, high-quality, global-inspired, but borders on downright unaffordable. My counter-service lunch of chicken over rice with sauce, cucumbers, and broccoli (an extra $2) totaled to $15.18! In Asia, you could probably serve the same dish to a small family at the same cost. \n\nPrice rants aside, R&R creates an excellent rendition of Hainan chicken rice. My SF cynicism expected a gentrified version that would lose the original flavors and toss in random avocados and stuff (I do laugh at their poached egg option), but the complex flavors and superb quality exceeded my expectations. My favorite turned out to be the rice: the robust, fragrant chicken flavoring was memorable, and the unconventional amount of al dente-ness was a pleasant surprise. The sauce brought everything together in layers of sweet soy sauce blended with ginger, scallions, beans, and chili. I also opted for some habanero sauce (mainly to make my picture look more colorful), which added a mild creaminess.\n\nBecause of the distractingly good sauces, I found it difficult to evaluate the chicken itself. The chicken in this dish is always intentionally plain so you can fully appreciate the chicken essence. I think the use of Mary's chicken inherently has a different chicken-ness compared to the \"yellow-haired chicken\" (黃毛雞) traditionally used, so it's difficult to evaluate the poaching technique. The chicken broth was richly flavored and steamy, the perfect heart-warming addition to any lunch in chilly SF days.\n\nNote that although it ins't your typical greasy food, the liberal use of chicken fat and various sauces make it a more filling lunch than you'd expect from a chicken meal. For me, it also left a bit of a salty aftertaste.\n\nThe space is hipster--upbeat almost-rap-like music, impressive arrangements of succulents, communal tables of course. Outside there's a beautiful public open space courtyard. \n\nThe verdict? Yummy food, quite authentic, with a Californian flair, but at Marina prices.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "I've been to the Marina location and liked it a lot, so was very glad there's now a location close to me. Came on a Monday night around 6, and waited over thirty minutes for my food after ordering. I was pretty mad, but we received a sincere apology, got an explanation for why the food was late, and was offered free drinks when we finally got our food. I think most of the time when people are pissed off about bad service, they really just want an apology and explanation. \n\nIn terms of food, I thought the chicken was just slightly dry, but the sauce totally makes up for it though. It's got a tinge of sweetness and not all oil like some of the other places, and I only wish there was more of it. The rice is super soft and not too greasy, and definitely try both hot sauces!", "author": "Julie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "YESSSS. Kao mun gai is my favorite Thai dish ever (and is very much a staple meal choice in Thailand) but sadly is not that well known or offered in Thai restaurants in the US. I'm so glad Rooster & Rice opened a second location close to where I work to share this amazingness with America! My cousin and I are both of Thai descent and went to this restaurant to see what the hype was about. Actually I was just really craving some kao mun gai and Rooster & Rice delivered! \n\nWe got the original and were both very impressed. Portions were generous. Chicken was tender and flavorful. The rice, OH THE RICE, gave off a light, fragrant scent of jasmine combined with the mouth watering flavor of chicken broth. The highlight and real test was THE SAUCE. This is always the trickiest part to get right but the portions of the ingredients really hit the spot. Sigh... I love kao mun gai. \n\nWe came the day after opening around lunch time so there was a delay in getting our orders out - I think they were waiting for the rice to cook. The owners acknowledged the delay and even offered to give us a free drink, but their generosity and that acknowledgement was all I needed. Thanks for being awesome and opening your doors to SOMA!\n\nPros\n-Kao mun gai, duh!\n\nCons\n-Kinda pricey, but it's soo goood", "author": "Grace J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Great place to eat if you're looking for something healthy!\n\nI came here for dinner and there was basically no wait but I do hear lunch time gets pretty packed. I ordered the original with white rice and it came with a little cup of soup. If you want any add ons though, be prepared to pay 30% more...\n\nHowever, overall it was very simple and filling! The soy bean sauce paired very well with the chicken and rice combo. The rice was very flavorful and the chicken had a good texture.  Overall a good meal! The downside is that it is relatively expensive for just chicken and rice but that's kind of the norm with restaurants in SOMA.", "author": "Angela P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Simple, yet delicious dish with chicken soup \n \nOn the side, you can try the chicken skin. it's an unhealthy option, but it's too good to resist.\n\nFive stars in general! Will come back at least once a month.\n\nRecommend coming before noon or after one to dodge the lunch crowd.", "author": "Lit K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "Given the area this shop is in, it's not surprising that it's a bit spendy given what you get, but there's no denying that this is authentic Hainanese-style chicken, with the right sauces to match.\n\nThe portions are rather modest, but that's probably a good thing if you're watching both the quantity and quality of what you eat. It's honest-to-goodness chicken served on a bed of rice.\n\nIt's all short, simple, and satisfying. Service is also fast and efficient too.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Tucked away in the corner of the plaza of 303 2nd Street, Rooster & Rice is a booming new craze in the South of Market area of San Francisco. During lunch hours the line is straight out the door, but this is expected as SoMa is chock-full of busy, urban professionals. Clean and modern feel on the inside. You order at the cashier and wait for your name to be called, and you can either grab a seat at a table/bartop or take it to-go.\n\nMenu doesn't seem diverse, but each chicken-over-rice (or vegetables) combo has its own unique flair. I usually get the Marina -- breast, skinless over brown rice -- and it's amazing! Love the broth on the side, too. I was in there for days at a time when I went to work sick (-: They provide a garlic soybean sauce with the order, but you can also add this orange hot sauce on the side. The meal is super light and I don't hate myself afterwards. A weekly ritual!", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Good food, price and portion. This Thai dish is very similar to hainan chicken in Singapore, but the sauce is different. The sauce here is mildly spicy and sweet. The rice is marinated in the chicken sauce. \n\nBonus is that they use take out containers that is biodegradable and compost in 20 days. From the portions, take out container and luxurious napkins, the owners seems like generous and caring people.", "author": "Gloria T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "As the name suggests, the specialities of this place are chicken & rice.\n\nI got the Paleo Bowl which came with chicken, seasonal veggies (broccoli when I went), cucumbers, and a cup of chicken broth. I got a mix of thigh & breast meat, and my it was so unbelievably tender. The chicken flavorful and super juicy. The price is a bit steep since it was $12.95 and after tax, about $14. However, they use organic Mary's chicken and the chicken was indeed a enormous portion. The broth was super flavorful and tasted like the kind of broth my mom would stew with chicken bones and make me drink when I was sick as a kid. Definitely use the ginger garlic soybean dipping sauce that comes with it too!\n\nThe original bowl come with chicken & white jasmine rice, the Marina comes with brown, and there is also a vegetarian option that subs the chicken with organic tofu. You can also do add ons for a few dollars more, such as adding an egg. It's a great healthy lunch option or even post-workout meal. Over all it's a bit pricey for a meal, but the quality and portion sizes are worth it.", "author": "Joy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "This place is simply delicious! Great for lunch, they are super quick and nice service. Their poached chicken is perfectly cooked (I hate when you chew chicken and two seconds later it becomes saw dust in your mouth.) they give you about 6-8 oz. of chicken. I've had both the original and paleo which was both served with chicken broth and cucumbers. (Can't go wrong with either chicken breast or chicken thigh) I personally love when dishes are served with a bit of freshly cut cucumbers, makes the meal taste clean and fresh. Their side of ginger sauce is lightly sweet and perfect to pour over the whole dish or dip separately. They also have a sriracha (standard) and a habanero sauce. The habanero sauce is definitely spicey but not overbearing which gives the dish a really nice kick to it. \n\nThe place is small, but there is a ton of seating outside and on a nice day, it's generally preferred. For $13, I'd say it's worth it. I always feel full, but not the gross kind of full that makes you feel sluggish and want a nap after. This place is definitely my go to lunch spot.", "author": "Christine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "*** In Short ***\n\nTasty and accessible Thai chicken rice in an area all-too-lacking in Asian food.\n\n*** In Depth ***\n\nIf you've never had khao man gai, it's the Thai take on Hainan chicken rice: similar in preparation, but with a slightly different flavor profile. Simple, but somewhat time-consuming to make, Rooster & Rice finally brought what it had to offer to SoMa, after a successful start in the Marina. And thank god they did, because this part of town has always been a bit lacking in solid Asian eats!\n\nThere's not much else to say here other than that they've done a great job capturing both the flavor and simplicity of this comfort food, serving up tender and moist chicken, with an equally flavorful side of chicken broth to pair. Of course, expect the typical SF tax on what is traditionally a pretty cheap eat, but hey, that comes with the territory, right?\n\n***Accessibility Info***\n\nVenue - A smaller shop with plenty of seating in the courtyard outside, the only real accessibility issue you might face here is reaching their hot sauces, which are usually on a pretty high shelf above another counter. That, and carrying about your soup without spilling it.\n\nBathroom - Didn't try them.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Food = good. Fresh and clean tasting.\n\nThe Original = breast & thigh skin-on with Jasmine white rice. Tender and juicy breast and thigh--they're both so good. Habanero sauce in addition to their awesome (chili, ginger, garlic & soybean) sauce makes this chicken & rice dish even more epic. Chicken broth comes with the entree and it's delicious. Piping hot, not crazy salty and actually tastes like, well, chicken. $11.95. \n\nI added an egg. Because why not. $2.00. \n\nThey also have fried chicken skins ($5.00) but they were out after 1 p.m. Maybe next time... \n\nService = friendly at the counter. Everything else is self-service. And almost everything is compostable/biodegradable.\n\nPrices = moderate. Lunch came out to $15.14. Probably would've had leftovers if I hadn't waited so long to have lunch. There's plenty to eat though.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "I'm a HUGEEE fan of chicken and rice dishes, particularly Hainan chicken rice. When I saw this place popped up, I knew I had to pay it a visit! After a long day at work, I was really craving something simple and delicious and Rooster & Rice was just around the corner. \n\nI have never had Khao Mun Gai, which is a Thai version of Hainanese chicken rice, but I have had Hainanese chicken rice countless times in the past. I ordered their Original (around $12 with tax). Their Original is a combination of chicken thigh and breast all boneless on a wonderful bed of fragrant rice with a side of chicken broth. The Asian me screams thigh meat is the way to go for all chicken dishes since chicken breasts are often super dry and tasteless. However, their chicken breast meat super tender, flavorful, and juicy. When I took a bite of their chicken with a scoop of the rice with a little bit of their habanero hot sauce, I was in full chicken heaven bliss. Not only is their chicken good, but the rice is packed with chicken oils and flavor. I have not tasted a chicken rice this flavorful in a very long time. Many Chinese places serve Hainanese chicken rice, but most of them fail to deliver juicy chicken and flavorful rice. This place has PERFECTED their chicken and their rice. \n\nOnce I took the first bite of this mega flavorful chicken and rice, I couldn't stop myself from finishing the entire box. Put some of their housemade sweet, sour, garlicky, gingery sauce and the housemade habanero sauce onto the chicken rice to give it the most perfect spice and flavorful kick. If you find yourself in need of some veggies, you can crunch on little pieces of cucumber that are given as a side. If you want to wash down your chicken rice with some liquid, you can drink their super flavorful chicken broth. You will be in full chicken heaven!!", "author": "Hoyan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "This is an instant favorite. I'm not really into the healthy food craze (mainly because most places I've tried really sacrifice on taste and/or service), but this is just one of the best restaurants I've tried recently, healthy or otherwise.\n\nThey have a simple menu, matching the simple and modern layout of the location. I think that's good because it keeps things simple, but refined and focused. \n\nI'm partial to the original. Each of the ingredients are incredibly flavorful and complement each other well. They don't skimp on portions either, which means you'll be satisfied at the end of your meal. \n\nThere may be a bit of a line depending on when you visit, but they get the meals out quickly. \n\nIt's a little more expensive than I want to pay for a regular meal, but the quality is well worth it. If you're looking for something new, healthy, and quick, definitely check this place out.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "This spot is absolutely, 100% different in almost every way from their Marina location. Super nice decor, much much more seating, white walls, and even fresh coconuts (never seen them at other location). Cater to your customers though. \n\nWe ended up grabbing the Original with double chicken which was a nice amount on top of what already comes with. Pretty good food. Good rice. Good soup. Chicken is cool, however my chicken was cold. Everything else was hot, even my girlfriend's full plate was hot. I was disappointed that my chicken was cold. I wanted to say something but the guy behind the register kept disappearing behind the wall so wasn't sure if he was cashier/chef/clean-up crew. \n\nBesides the chicken being cold I like this spot. 3 stars for that.", "author": "John M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "This is my comfort food right here. It's good and I enjoyed the sauce. The rice isn't what I would get in Thailand but I wasn't expecting it to taste exactly the same anyways. It's futile to compare.\n\nThe oddest feeling was to eat this dish with a fork! I have never had this dish without the use of a spoon before. Weird, huh?", "author": "Yad L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-19", "description": "Same great chicken as the Marina location, with significantly worse service. The cashier and a person in the back were looking at Tinder profiles together when I showed up, and it took a solid minute for them to disengage. As I was eating, I noticed that they took their Tinder swiping to the back, even though there were people waiting to be served. Great chicken, but don't expect a friendly experience.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Rooster & Rice is a great new option for lunch in SoMa that replaced the old Urban Picnic location (thank goodness).\n\nWith a young staff and menu that's humbly only 4 items long, it's easy to like this unassuming but friendly restaurant.\n\nSomehow, the 4 options are each individually delicious, extendable through add-ons, and can accommodate most diets: vegetarians and paleo/keto folks should have no issue here. With such an easy menu, the kitchen is able to pump out boxes with no problem.\n\nThe chicken, stock, poached eggs and rice are made in bulk in the back, and each well-cooked and surprisingly authentic. I only had two gripes both times I visited: 1) the chicken skin was chewy and 2) the box and dish were lukewarm.\n\nBe warned though - the line can start going out the door around noon every day, so it's advisable to come a bit before or after the lunch rush.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "This place is AMAZING. Not sure if it's because of the nostalgia this dish brings to me (my family cooked this my whole life) or if it's just that damn good but I had it twice on my trip to San Francisco even though I had a long list of places I wanted to visit. It's just THAT good. \n\nI ordered the original both times. The meat is so moist and the sauce that comes with it is BOMB. Would highly recommend this!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "I love how simple, clean and fresh the ingredients are at Rooster & Rice. The broth on the side is a nice touch and i love that the veggies are fresh and still have a bit of a crunch to them. The chicken is poached to perfection: flavorful and tender.", "author": "Danielle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Favorite chicken in sf so far! Really like the chicken soup！Of course will go there again", "author": "Ying C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-04", "description": "I came here on a weekday evening and it wasn't super full but there were people. The chairs outside are chained to the table so we opted to sit inside. I ordered #1, and the chicken was very tender and juicy but there was a lot of skin/fat/black veins? or whatever it is. The sauce was good and so was the soup, but the rice was quite soggy and not very chewy. The cucumber was a nice addition though I wish there were more vegetables. The portions were really big though; it was a lot of chicken! At $13.54 post-tax, I guess this is on par with SF prices, but I'd say it's a bit pricey for chicken, sauce, rice, and soup.", "author": "Andrea W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Came here randomly last time I was in San Francisco. Surprisingly good hainanese chicken over rice. Don't forget to add the egg on top, you won't regret it! Compared to some restaurants I usually go to in Chinatown, it's a bit on the pricier end, but the portions are huge and it's enough to fill you up.", "author": "Calvin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "I love rooster and rice. The food is so cozy, simple and filling. The chicken is always well cooked and tasty and goes well with the rice and the sauce. The portions are sizeable as well. The broth, to be honest, is probably the best part of the meal. Amazing!\nAlthough, this place is a bit expensive and the wait times can get a bit crazy depending on the time of day.", "author": "Leelakrishna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "This place has a very simple menu, which I like. Chicken and rice, that's it (save for a vegetarian option).\n\nMy companion and I ordered the original rooster bowl and a vegetarian bowl. They come with little cups of soup on the side! My chicken broth was light and delicious.\n\nAt first glance, the chicken looks cold and flavorless, but looks can be deceiving. The meat was very tender, but the sauce was the real star, mixed with a little of the habanero sauce for a spicy kick. Very good. The only thing I didn't really like was the skin that they left on the meat- I'm not a big fan of chewy skin but to teach their own.\n\n The veggie bowl was fine, but the chicken was better imo. Also we ordered an extra egg, which turned out to be poached, not fried. The eggs were kind of inconsistent in that one still had a runny yolk, while the other was completely solidified. A little weird, but it didn't really bother me.\n\nThe seating is very minimal. Server was very nice and polite, but it took a while to get our order. Overall, probably a 4.5.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-29", "description": "The Jasemine rice is NOT VEGETARIAN. Food is good, but from the dozens of times I've been here I've never been told that the Jasemine rice was cooked with chicken broth. Severely disappointed in this company for not better informing their customers.", "author": "Kyoko L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "The secret delight is definitely in the sauce. Inexplicably delicious, it contains many things from small beans, garlic, ginger, green onions, vinegar, shoyu, to many other tangy things that go well with fresh steamed broccoli, cucumber slices, protein of your choice (tofu, chicken, etc), and brown rice. Simple and healthy take-out meals with fairly standard ingredients are made spectacular by the sauces. $1 more for an additional spicy orange sauce. Takeout and delivery option available. A bit on the pricey side for each dish ($11-$13, not including add ons like egg), but it's healthy and again, they deliver to the office.", "author": "Alison A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "I love your portions, your rice, your chicken, your sous-vide egg, and your broth. It's as close to Savoy Kitchen or Green Zone from SoCal that I can get in the Bay Area. \n\nAlso your paper napkins are luxurious! Holy crap, one of our to-go broths leaked in my fridge because of my fault (I didn't snap on the lid fully after opening it) and the next day I opened the fridge, the napkins absorbed all of the soup. Can't be good for the environment but appreciate having such quality napkins.\n\nBut food is better than napkins so gonna end it on that note.", "author": "Jayson V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "The original chicken rice tastes good. The chicken soup that comes with the main dish is delicious too. I would recommend.", "author": "Yinrong L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Simple and straight forward. Wanted more cucumbers/veggies with my order, but will keep that in mind for next time (guess I'll have to ask for extra?). I got The Marina which comes with skinless chicken breast & brown rice. Sauce was good, went well with the chicken & rice which were also very good. Broth also good. Great customer service. Quick and easy pick up after my workout nearby.\n\nOther:\nThey don't have Apple Pay, despite what the info says.", "author": "Kelley P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Yummy! My gf just brought over to-go for our lunch date. I had The Paleo with thigh meat. Super soft texture over a bed of crunchy broccoli, side dipping sauce and soup. Healthy protein lunch and big portion. Will try out different order next time.", "author": "Vee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "I LOVE Hainan food... In particular the chicken. I was recommend to this place by the Fung Bros (you can find them on YouTube). You would've never known that the restaurant is located where it's at. It is a bit hidden but keep walking near the perimeter of the building and you're bound to find it. \n\nUnfortunately we came here about 30 mins before closing so it was our fault we came here so late. There was 4 of us but they only have enough chicken for 3 orders. As bummed out as we were, we ended up getting all of the food anyways. The cashier was nice and saw the disappointment on my face, he gave a small percentage of discount and through in some soup with our order for free. (*soup is extra charge)\n\nWhat can I say about Rooster and Rice?... it's simple and it's exceptionally healthy or at least it taste healthy in a good way. The portions were enough for one person (sadly, I had to share with someone else...again MY fault). I would definitely come back and get my own plate next time! :)", "author": "Kaleigh R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-23", "description": "One of those...ITS THE BEST KHAO MUN GAI IN SF places because I really haven't been to any other khao mun gai only place in sf.  A bit pricey but I don't even know what that means in SF anymore maybe because I'm poor and can't keep up with the rich kids.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Love everything about Rooster & Rice. This is my boyfriend and my go-to spot for a weekday quick dinner. Luckily, they are open until 8 PM Monday-Fridays (unlike a lot of other restaurants in the area that are generally only open for the lunch crowd). Rooster & Rice uses Mary's Chicken (you can get breast or thighs) over jasmine rice (or you can get brown rice). They always give you a side broth as well (usually very hot, so I would let it cool down a bit first). This spot is more of a to-go spot, but there are a few tables. Their spicy sauce is super good, but warning-a little goes a long way, so don't be dumping it on! It is your typical SF price point, but definitely a filling meal! I definitely recommend!", "author": "Kim C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "The chicken: I ordered \"The Original\" and the cashier kindly let me substitute brown rice. The chicken was good! Big portion! Well poached! Would have been a LOT better if the chicken had been topped off with the cilantro that appears on every damn photo on Yelp and on the R&R website. I love cilantro. But... cilantro, denied.\n\nThe brown rice: Big portion, freshly prepared. Would have been better with cilantro. I fell for the old \"Cilantro Bait & Switch\" and it hurt.\n\nThe dipping sauce: Awesome, awesome. Love the generous amounts of ginger. Oh, hey, I think I saw a fleck of cilantro in the sauce. Nice try, R&R, but you still owe me a generous helping of cilantro. \n\nIt's a pricey lunch, but for healthfully prepared chicken, brown rice, and killer sauce, it's a great high-protein/good-carb meal. But I'm keeping a cilantro ledger, and R&R is in the RED.", "author": "Jon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Deceivingly simple but really tasty chicken and rice bowls.  I was a bit skeptical at first, but demolished my lunch in record time today.  The chicken was tender, the jasmine rice was aromatic - but the whole dish comes together owing to the tasty soy ginger sauce, which is a riff off of classic Asian/Chinese flavor profile (chicken + ginger).  The chicken broth side was a teeny tiny too salty, but still delish.  This location has plenty of indoor and outdoor seating, but it's still best to come on the early side of the lunch hour.", "author": "Tabitha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Rooster and Rice serves hainan style chicken and rice. It's a really simple poached chicken dish with some fragrant rice and sauce (soy, ginger and garlic). Besides the vegetarian option, each dish comes with a side of chicken broth. The place is pretty small and gets crowded during lunch so it's better to order it to go. \n\nIt's simple but man do they do it well, it's one of those comfort foods that you can have every day and not really get bored of it. \n\nMy go to order is The Original ($12) plus a poached egg ($2). The runny egg over rice just makes it that much better. They have a house habanero sauce that packs a nice kick that I add as well.\n\nI know people complain about the price being high, but being in SF and comparing it to a $15 salad, it really isn't that bad. My only complaint is that it's not closer to where I work. \n\nTip:\nSome days they fry up the chicken skins and have it available for $5, if you're with a group it is worth sharing", "author": "Vijay S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-03", "description": "Such a solid spot for lunch! Chicken and rice prepared the hainan style is definitely comfort food for me and this spot delivers! It might be on the bland side for people who are unsure of what to expect, but to me, the light flavors of the broth and chicken are a perfect combination along with the sweet/savory cilantro/ginger/garlic sauce that it all comes with. It's a healthy and fast meal that is great on a cold day!", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Great lunch spot in SOMA!\n\nI have heard people raving about this place long before I tried it out myself. To be honest, I was very skeptical about this back then, but now I'm hooked! The photos do not do them justice. Yes, it might look kind of bland. Yes, it might seem somewhat small-portioned. But the chicken and rice combo tastes wonderful and is surprisingly fulfilling. I love \"The Original\" and \"The Paleo\" w/ an egg. The chicken soup they always give out as a side is delicious too. It does tend to be pricier than other lunch places in the area (~$13-15), but I would say it's worth to try out.\n\nP.S. I find the actual restaurant area smell really funny, but none of my coworkers are picking up on that... so it might just be me. Food is great though!", "author": "Angel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "BUYER BEWARE!!! \n\nJust bought an \"original\" chicken and rice bowl from this hole in the wall and was shocked with what I found! My bowl consisted of about 70% chicken skin and fat and 30% meat which is unreal for a $12 lunch IMO. I mean this place cleary wants you to be sickened by their original so they can price gouge you on the Marina \"healthy\" option for 2 dollars more! I posted a photo of what I believe is chicken skin on this yelp review. That is all I am going to rant for now but never going back after my experience here.", "author": "Kazmo V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "Solid lunch spot to eat a light and healthy meal. When Rooster & Rice first opened, the food was superb. It was flavorful, juicy, and the chicken meat was smooth. It also didn't feel too heavy and was balanced. After going back a few times, I feel like the quality dipped slightly. The chicken tasted more bland and the texture was less smooth. It's still good though, but doesn't live up to when it first opened. That's why I'm docking one star.", "author": "Amanda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "A simple, tasty, filling, healthy meal close to work!? Sign me up! While I do find it a bit expensive for essentially chicken and rice, I still think it's worth it in terms of flavor. I certainly can't make chicken this juicy and tender at home haha (sorry to my future s/o). I may gripe about the price, but I certainly don't let it keep me from coming back over and over again!", "author": "Alice L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Yum!  As the restaurant's name suggests, this place literally has only rice and chicken haha.  The location is tucked away in the plaza so it was nice and quiet when we came in around 3p. \n\nI ordered the original with dark meat only and added an egg.  The dish came with soy sauce mix on the side and a bowl of chicken broth. I was nervous to pour the entire cup of soy sauce but it worked out perfectly. To my surprise, the dish wasn't too salty even with all the soy sauce.  I'm glad I chose to get all dark meat because the meat came out juicy and flavorful (not dry at all).  The addition of the egg gave the rice a creamy texture -not creamy in a weird way.  The cucumber and cilantro gave the dish a refreshing kick. If I were to get this dish next time, I would opt to get it without the skin. I wasn't a fan of the mushy skin (for some reason I thought the skin would be crunchy lmao).  The chicken broth went soo well with the rice. Such an Asian combo :) aka the rice x broth. I never knew this was a Thai dish and I'm glad a place like this exists!  Overall, Rooster and Rice was very memorable!  10/10 recommend. \n\nOh, grab a Thai tea while you're at it!", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-19", "description": "Nestled in a shopping plaza located in SOMA, lies Rooster and Rice.  The place gets crowded during lunch, but with a simplistic menu that only offers a few things, the line should move quickly.  There are plenty of seats inside, but if every spot is taken, there are still lots of places to sit outside.  \n\nRooster & Rice does live up to the hype, but it comes with a price tag.  My rice box ended up costing me a whopping $16.22.  I ordered ​\"The Marina\" which comes with all skinless breast, and organic brown rice.  I also added an egg to my order.  \n\nI waited several minutes for my order, and decided to load up on sauce at the condiment and utensils area.  You are also able to purchase sauce at the counter, but why would you if it is free here?  They also have really good quality napkins here too!  I guess you could say that is why a rice box costs so much here?  \n\nAfter grabbing a seat, I decided to try the chicken without any sauce first.  I took a bite, and the meat was ultra soft-- melt in your mouth type quality.  However, there was no seasoning whatsoever.  It tasted so boring and plain.  I decided to try the next bite with the spicy sauce and the ginger garlic sauce. The flavors were a fusion of multiple parties in my mouth.  Needless to say, it was delicious.  The brown rice was cooked well.  The egg was a little under for my liking.  The chicken broth that comes with the meal was amazing.  I thoroughly enjoyed how flavorful it was.  \n\nIn conclusion, this place is good.  However, this is something I would not get every day.  For $16, I could get three rice boxes in Chinatown.  I would consider trying this place at least once though  because it is very unique.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "VERY good chicken rice, also the soup is very very yummy.\nDipping sauce and averything else just perfect.\nJust little bit in high price.", "author": "Gatot T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "New favorite lunch spot in the city! Rooster & Rice serves only khao man gai, which is quite literally just boiled chicken and rice. Don't underestimate the flavors of khao man gai, however. In my opinion, khao man gai is the better version of Hainanese chicken since it comes with a flavorful soy sauce and side of soup. Honestly, I think Rooster & Rice does khao man gai much better than Kin Khao, which has a Michelin star. At least, I would hope so, since that's all they serve.\n\nMy recommendation is to eat the dish by dipping the chicken into the soy sauce. If you pour it all over, I think it'd be too salty. The portion is huge, even if it is a little expensive - I can definitely split it into two meals. They also have Thai sriracha and habanero sauce available for you to take as you please (I prefer the habanero). They have a vegetarian version, which has tofu instead of chicken and seasonal vegetables. \n\nOverall wait is very short and the inside of the restaurant is cute too!\n\nI think my only complaint with Rooster & Rice is that I wish they gave more cucumbers in their original khao man gai, but I just really love cucumbers, so I finished them all before I even ate half of the chicken.\n\nAnyways, I definitely recommend checking Rooster & Rice out for lunch! It's definitely a place that I can see myself frequenting a couple times a month.", "author": "Trisha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "I had my first taste of Thai chicken rice last year in Portland at Nong's. Ever since, I've been waiting for something like it to open in SF. And then the illustrious Year of the Rooster came around and brought Rooster & Rice with it. I knew this would be a good year. \n\nRooster & Rice has made itself a staple of my weekly lunches and that's because it heavily satisfies two of the three qualities I look for in a weekday lunch- delicious, and quick (if you show up before 12). Unfortunately it's not that cheap as you'll be forking over at least $15 for your meal. \n\nI've gotten both the \"Original\" and the \"Marina\" and they are amazing. The chicken is tender, the rice filling, and the sauce herby. I saw some people dipping their chicken into the sauce but the true secret to unlocking the taste of your meal is to pour the sauce over your chicken. Your meal will taste much better with the sauce permeating every nook and cranny of your plate. \n\nFinally, I want to give a shout out to the soup they throw in with your meal. This is the kind of soup you drank in college to cure hangovers. These days, I drink this soup to cure bad mornings at work.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "The lines will be long, but it goes by fast and it's worth it, yo!\n\nYou will be spending about $15+ on lunch though, no doubt. But that lunch will be filled with juicy, healthy chicken on a bed of delicious rice served with a little cup of bone broth. Healthy, filling and oh so satisfying. What gets ya is the additional add-on's, pricewise. Want extra veggies? $3. Want an egg? $3. Goodbye are the days of cheap eats for lunch.\n\nOrder the original with white rice, the marina with brown rice, the paleo with seasonal veggies in lieu of rice or the vegetarian, tofu in lieu of that chicken.\n\nThey have a tasty soy based sauce to pour on and don't forget your little cups of sriracha or what looks to be housemade habanero. If you're gonna drop $15+ on lunch, this is a great option.\n\nPlenty of outside seating both with tables and chairs, but also some funky seating in the courtyard; perfect for a sunny San Francisco day.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "It's good but bland compared to the real thing in Singapore, also pricey but not unexpected in the area. I do like their paleo option. Thanks", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "It took me a while to figure this place out, so let me break it down for you.\n\nYou need to get the ​The Original. It's dope. And you know it's real chicken because sometimes the thighs still have sharp ass bones in them. Second best option is the The Marina if you don't want to stab yourself potentially with bones. Chicken, however, is aces either way. You cannot go wrong with chicken at a place called Rooster & Rice.\n\nWhat you need to do is request the addition of veggies. It's extra. I do not understand why their main dish doesn't come with a single piece of veggie (which happened the first time I ordered here), but you need something to balance all that dry ass rice and delicious sauce. \n\nOnce everything's done, you'll quickly realize it's almost too much food for one sitting. My tip, carve out the section that you want to eat and plan to save it for another late night meal.\n\nThat way, your overpriced $17 San Francisco lunch won't feel like robbery. Although it is, don't kid yourself.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-09", "description": "Walked in at 2:50pm, they were playing T-shirt by Migos, the place was empty except for this one dude waiting for food that kept giving me a smolder-smile which was a little weird but it's all good because I then ordered a paleo with half veggies half rice and both chicken breast and thigh. Food was ready in like 3 minutes. I was thinking about sitting inside--they had cool succulents and other chaparral-ish flora to examine but it was 82 degrees and my top peeled off (jk it was like 60 and i had my jacket off) so I sat outside (lots of seating options). \n\nThe food is not as good as the one on FILBERT but still decent. The rice is more flavorful (and sticky) but the chicken is less hainan and more bland. They didn't give me half rice half veggie (more rice than veggie) but I'm fine with that. The sauce here has more sauce than ingredients but overall similar tastes. The chicken also had a lot of skin in comparison to the ones I got at filbert.\n\nSubtle differences between the two locations: the one on filbert tastes more high-quality but the location on 2nd is convenient and has a ton of seating options.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Yes! A super healthy option right next to my office in SOMA. They serve exactly what I have been making at home, whenever I want to eat right -\nProtein, Brown Rice, Veggies. Done. And, they have a nice habanero sauce available that made me happy. I read several reviews before going so I was okay paying ~$15. As many have said, welcome to San Francisco. I give it 5 stars because of the napkins - I hate it when a place charges a lot and then has those flimsy useless napkins that disintegrate in your hands. R&R has these wonderful plush, towel like napkins. Nice touch.", "author": "James L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "Pretty interesting Thai chicken and rice place. I've been here a few times for lunch. The wait is never really more than 5 mins, probably because what you're getting is literally boiled chicken and rice. \n\nI was a bit skeptical at first that the food would be too bland but the little container of sauce they provide adds a huge kick of flavour. In fact, it might even be too much. My main problem with the sauce is the big chunks of ginger. I'd prefer the ginger to be blended in a bit better and not so overpowering. But I'm sure some people actually love the ginger overload. \n\nAlso, $13+ feels like a lot to pay for essentially boiled chicken and rice, even for SF, but hey, it's certainly fresh and flavourful. Also, it's perfect as a post-workout meal!", "author": "Sahil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Rooster & Rice is now one of my favorite places to eat in the area!! I just wish this place opens on weekends too... then my life would be complete.\n\nI actually live nearby but don't work in the area, so I always request my boyfriend to bring home a bowl for me... I love all the sauces they offer. It's also really filling and good enough for two meals when I cook some veggies on the side to go along with it.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "As everyone seems to agree, this place is a solid four stars. Great place to get a filling and (relatively) healthy meal in downtown. Rooster & Rice serves a Thai variation of Hainanese chicken rice, which features juicy, tender chicken over rice, combined with a very flavorful soy-based sauce. The portion size is generous and will leave you feeling satisfied. It also comes with chicken broth on the side, which is lightly flavored and comforting.\n\nThe menu is short, featuring only a few variants of chicken rice with clever names like \"The Marina\" -- a healthier skinless chicken option over brown rice. As a result, the line moves quickly, so don't be intimidated by what looks like a long wait.\n\nDocking a star because it's so pricy, but I'll probably still make my way over every now and then, because the chicken rice really is that good.", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Finally got to try Rooster & Rice after having the Marina location bookmarked for months, and I was not disappointed! Came here with my friends one rainy day for lunch and it was completely packed - we ended up taking our food to go because there was nowhere to sit. We all had the original, chicken breast and thigh with skin over jasmine rice, which also comes with a small bowl of delicious soup. The chicken itself was incredibly tender and flavorful, and even better with the ginger sauce that comes with it (even though I had to pick out all the leaves of cilantro). There are also two more sauces you can serve yourself, but the spicy orange one is better than the red tangy one. \n\nThe price was pretty reasonable especially considering portion size because I was quite full after devouring the entire box. I just wish they had a bigger space with more seating, but there are many public spaces in the area where you can take your food to go. Though the menu is very simple, the quality of food is top notch and well worth the wait. Definitely will be back in the future to satisfy my Hainan chicken cravings!", "author": "KC W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Stopped by for lunch on a Wednesday. Beat the lunch crowd by arriving before noon! \n\nMenu is very basic, usually a base (rice, salad) with a choice of meat (chicken/pork/beef). The sauce that comes with it is really good. I got the chicken bowl, which comes with some pickled? vegetables and the sauce and rice. It was pretty cheap for the amount of food I got. \n\nThere is a lot of outdoor seating in that courtyard area. Good spot for lunch on weekdays.", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "New lunch spot in SOMA and I'm a fan!  It's located in the same plaza as Red Dog.  The menu is simple- just chicken & rice or chicken & veggies with a side of chicken broth.  Who knew chicken and rice can taste so good and be satisfying?  It must be that ginger soy based sauce!  They also offer a side of the habanero and siracha sauce as well to complement your meal.  Seating is limited and there is usually a line out the door during lunch but it goes fairly quick.  A great \"Asian\" alternative to the area.", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "IT'S SOOOOOOOOO GOOOOOD!!!\n\nBut seriously though, I just finished it a few minutes ago and now I have very conflicting feelings. I'm super happy because I just had an amazing lunch. I'm also super sad because I'm done and there's no more. Are these tears tears of joy or tears of sadness, or am I just crying because my sneaky ninja coworkers are cutting onions again? Is this how Anton Ego felt when he took his first bite of that ratatouille? Well, in Whoville they say that the Grinch's small heart grew three sizes that day.\n\nRooster & Rice, located as part of the nice plaza at 303 2nd Street, is a small little restaurant that specializes in Khao Mun Gai which is also known as Hainanese Chicken. If you love Hainanese chicken, you'll for sure love the chicken here. If you're not sure if you love Hainanese chicken, then this might just be the place you fall in love with it.\n\nI've passed by this place a couple times with an intention of trying it out, but I typically find a long line here around noon so I end up opting for something else. However, on this Friday afternoon, I noticed there wasn't a line so I rushed in and quickly ordered The Original to go. I was a bit skeptical of the chicken here once I found out it was boneless, since I love dark meat and find the meat around the bone to be the most juicy and flavorful. Also, when my meal came out to be $13 flat after tax without adding any extras such as veggies or egg, I thought to myself, \"This better be good.\"\n\nThe Original comes with a bed of fragrant jasmine chicken rice, pieces of cucumber, some broth, and a soy based sauce with soybeans, ginger, garlic, and chili. They provide a good amount of meat which consists of both white breast meat and dark thigh meat. The meat is boneless, but has skin on it. The chicken turned out to be some of the most juicy chicken meat I've ever had. There was not a single piece of dry chicken to be found and each bite was a succulent artistic work that artists like Van Gogh and Ringo Starr could only dream of. It's just so wonderful to have such delicious boneless chicken meat since it isn't messy to eat and is also easy to eat which is great for a quick workday lunch. The rice is filled with the savory umami flavor from the chicken to make it the idea carb to complement the meat. The cucumber adds a contrast to all the umami flavor by adding a bit of sweetness to the meal\\. The refreshing nature of it pairs very well with the chicken especially when the chicken is dipped in their habanero or thai sriracha sauce for a spicy kick. Their soy based sauce adds so many wonderful flavors with the chicken. The fragrance of the ginger with the saltiness of the soy sauce help to accentuate the natural flavors of the chicken rather than detract from it. If all this wasn't good enough, the chicken broth on the side provides an aspect of warmth to the meal, reminding me of homemade chicken soup that could heat up a home on a cold winter day and help heal the sick.\n\nNeedless to say, I'm a huge fan of Rooster & Chicken and if you're in the area looking for lunch, this restaurant is surely a solid choice!", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-15", "description": "Pricey!!! I enjoyed it, but I kept thinking if it's worth the $$$.....\n\nI got the paleo (mixed chicken) bowl, but did half brown rice and half veggies - added an egg too! That came out to be ~$17. WOWZERS!!!\n\n\nI ate it all at once too, so it's not like it can be split into two meals. I would recommend that you try it at least once.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-28", "description": "Simple but filling! Got the #1, Flavors were on point, tastes really authentic. Might become one of my usual lunch spots!", "author": "Sammy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Came here for lunch but wished they were open for dinner as well!!!\n\nAlthough a simple chicken and rice dish, the flavors were there!!! The ginger soy sauce is to die for as many yelpers have suggested. There seems to always be a long line but it does go fast. \n\nI ordered the original and it was definitely not lacking in size. The portions are perfect if you are a heavy eater like myself!", "author": "Mai W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "Thought that the khao mun gai here was a homey, comforting, and satisfying meal. \n\nI ordered The Original for myself. The chicken in the bowl was lean yet very tender and flavorful. My boyfriend ordered The Marina because he doesn't like when chicken is fatty or has skin, but I actually think that he would've been just as happy with The Original. The chicken in The Original (even the thigh) was just as lean, and I actually didn't get any skin in my bowl. That last part might be a big negative to some, but I didn't mind much. The broth was good too. Full of flavor, and not heavy or oily.\n\nThe jasmine rice was like the rice that's usually included in Hainan chicken dishes, in that it was very flavorful on its own. For that reason, don't dump the whole sauce container over the rice! The sauce is SUPER delicious, but if you put too much into the bowl, it can overpower the flavors of the chicken and the rice. Same goes for the optional Thai sriracha and the habanero sauce that they offer. SO good, but be careful how much you use because the bowl is far from bland even without them. \n\nWould this be 5 stars if this was cheaper? Definitely. In fact, I have no doubt that the same dish could be as little as half the price in Thai restaurants located elsewhere, like LA or Thailand itself. But let's be real: This is San Francisco. This is where many people don't think twice about dropping $15 for a simple salad. So Rooster & Rice isn't cheap, but I wouldn't say it's overpriced.\n\nWith that said, I really enjoyed the food here, and I'm happy that they opened this SoMa location.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "I'm told the food here is authentic, which I guess means a lot more to other folks. The chicken and rice dish (pretty much the only thing on the menu) is tasty enough, if a little bland on its own; you've got to pour on the included garlic/peanut sauce (or Sriracha) to get strong flavors. Once you do, it's pretty good. \n\nThe portion sizes are solid, but you're still paying $12+ for chicken and rice and a little cup of broth. It doesn't quite feel like a great lunch value and I certainly don't enjoy waiting 20+ minutes in line to place my order and get the food. \n\nBeware the upsell! The first time I went there I blindly said \"Yes\" to every question they asked, and I walked away with a lunch that cost nearly $20. Serves me right for being such an agreeable person, I guess.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "The best khao mun gai in this part of the city. Their menu is small - chicken and rice, chicken and rice with veggies, chicken without rice with veggies, tofu and rice. That's it. It's all good. \nThis spot is a local lunch place for the folks who work nearby. The lines are long between 12:15 and 1:15 - try and avoid those times.  Only a few seats inside - probably seats about 6-10 people max. Grab some chicken & rice then try to find a spot in the plaza on a warm day in SF (else, be prepared with a thick jacket).", "author": "Trang H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Having moved from Portland, OR I've been seeking for a replacement to fulfill my Khao Man Gai fix that I used to get from Nong's. \n\nRooster and Rice does that and more. For a great price you can get one of the best comfort meals you can find in Asian cuisine. The R+R team does an impeccable job with everything. Making the sauce their own and making it so DELICIOUS. Fried chicken skins is a hit and is sharable for the 5 dollars it'll set you back. Totally worth it to mix it in your rice. \n\nI will definitely come again. My only nitpick is I'm not sure many of the goers have had experience with Khao Man Gai and some didn't touch the sauce at all or sip the soup after a spoonful of rice and chicken. I would excited reading into the dish to get the full experience! Because I'm so happy this place exists.", "author": "Tu D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "I stumbled upon this place while trying to fit into my new ketogenic diet. I was tired of the norm sandwich, soup, and salads spots downtown so I decided to give this place a try. It didn't disappoint. Upon first entering, the aroma of chicken fills the air. The staff here is friendly and knowledgeable of the menu. They only have 4-5 things on the menu, however, they are all bomb af. \n\nI got The Paleo which is chicken and vegetables. The rice here is delicious as it's cooked with chicken stock (so delicious...). To accompany my dish, I used their house habenero sauce as well as their Thai chili sauce. Both I highly recommend. The meal is accompanied by a soup which compliments the muggy SF weather. All this cost me $14 (pretty normal for SF downtown lunch pricing). It didn't leave me in a food coma and it fits right in with my dietary needs. I highly recommend this place for anyone working downtown that wants to eat something healthy and delicious. Shout out Eugene (manager) and David (cashier). They're really the Steph Curry and Klay Thompson of this location.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "Having had the best Chicken Rice of my life in Singapore (which is their national dish btw) - I was highly disappointed in the version being served here. I guess they've asterisked their version by labeling it as Thai.. but still.. where's the flavor of chicken in the rice? Where's the silky smooth chicken that's supposed to be star of the dish? \n\nThis place probably just be renamed overcooked chicken on top of rice with some sliced cucumber. \n\nFor those interested in trying some real Chicken Rice, go to Lime Tree on Clement Street.", "author": "Henry W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-23", "description": "$16 for flavorless chicken on top of broccoli with an egg that wasn't even poached on top but ended up at the bottom of the bowl. The mixed meat option has skin, not what expected. I guess you can get way with this in SOMA for lunch.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "New favorite chicken comfort food place. Been here twice and I am a huge fan of the place already!! The sauce is delicious (I am a big ginger fan but even if you're not, you'll still like its sweetness). The chicken is nice and tender. You can sub brown rice for white at no extra charge. I have only gotten the original, but for me that's all I need! Friend got the paleo and it felt like there was a lot more chicken, but I could be wrong, as I easily finished mine while she took a while to eat. The broth soup it comes with is 10/10. It warms me from the inside out. I'm willing to pay the money for this place, which must mean it's GOOD. Will come again!", "author": "Serena W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "My girlfriend told me about this location.  This is my second time and now I know how to order.  I had the Original and the Marina.  Marina has brown rice and no skin on the chicken .  The original has white rice and skin on some pieces of the chicken.  I always call in so I can stand in line versus ordering there.  I love their broth as there is no MSG in it.  I wish there were more veggies with the meal.  Thank is why I am giving a 4 star.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "this place is really good. Their garlic sauce goes well with the chicken and the chicken soup is nice and full of chicken fat flavor. Would return", "author": "Kay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Finally, a decent place to get khao mun gai in SF! Kao mun gai, or the Thai verson ofHainan chicken rice, is one of the most popular street food in Singapore, and despite its extremely simple premise, is super flavorful. The secret is the super flavorful rice, flavored with chicken broth, chicken fat, oil, and whatever sauce you include, such as garlic. \n\nRooster & Rice gives khao mun gai an SF flair, with an option to make it \"Marina healthy\" with skinless chicken breast and brown rice, or Paleo, chicken & veggie. I like the healthy customization, but if you want the true khao mun gai experience, you should try the Original option, with the poached/boiled chicken and the oh-so-delicious chicken fat rice. All orders also come with a ginger/garlic/spicy/sweet/soy sauce and a side of chicken broth, which you can drizzle on the chicken and rice to add more flavor. \n\nIt's a tad expensive, especially for what is essentially street food in Asia, but it's definitely one of the best I've had outside of Singapore. The Marina location is bigger, while the SOMA location seems to be mostly a grab and go place.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "OMG OMG OMG, I almost fell out of my seat when I realized Rooster & Rice had opened up downstairs in my office building. Not only is it 100x better than its predecessor (Urban Picnic, RIP), I was excited since I had been wanting to try the original location for ages (except for the fact that it's in the Marina and I don't do the Marina).\n\nFor lunch, my date and I both got The Original; I asked for all dark meat juicy chicken. It was a cold day and the soup was a pleasant surprise. The chicken itself was tasty and the soy sauce based sauce was amazing! The rice was fantastic as well and had a good amount of chicken flavor.\n\nThe food is cooked authentically; only the price is not cheap. This is a great addition to the SOMA food scene and a wonderful complement to DragonEats nearby.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "I am still a tad salty that I paid $13 for a bowl of Hainan style Chicken & Rice, but I guess it's all because SF pays their workers a higher minimum wage so I have no grounds to hate. \n\nThis place caters to the lunch rush, there is not a lot of seating but there is plenty outside in the courtyard.\n\nNonetheless, the all of the bowls given a sizable amount of food! Very pleased with the portion. The standard bowl comes with a few cucumbers, soup, tons of rice, chicken boob & thigh, and soy sauce. \n\nDefinitely a great option to break the usual sad salad routine in SoMa or for a quick, chill meal. It's gringo Hainan chicken for sure, but good in its own right.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Great, tasty filling lunch and cheap for San Francisco. The chicken is delicious every time and I love the broth.", "author": "Maggie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-04", "description": "The food was pretty good. I'd say it is too bland if you don't add any sauces; but if you add too much, it can be overpowering. Considering the meal is just chicken and rice, I think it is a little overpriced at around $10- $12.", "author": "Wyatt S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "Went to grab a quick to go meal for lunch and was in and out within 10 minutes. I ordered the original: a very simple meal, basically just rice and chicken with a few cucumbers inside the box yet the sauce they provided definitely takes the meal to a new level. I like spicy food so I also added Habanero sauce to really get the flavor kicking. Everything came together much better than I expected especially after looking at the pictures of the meals which are rather basic. My only knock would be that it's a little more expensive than I expected, but I will definitely be going back.", "author": "LeVar H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "This place serves a Thai version of Hainanese chicken rice. It's delicious and addictive. The rice is subtly spiced with ginger and soy, the organic chicken is poached perfectly and they have a dipping sauce with chilis and ginger and soy with beans in it that is also so good. The long lines tell you how tasty it is. You can also get a fresh coconut to drink. It's pretty awesome.", "author": "Bunny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-13", "description": "Straightforward, no-frills chicken and rice, delicious in its simplicity and high-quality ingredients. I got the Original, but there isn't much else choice on the menu (a good thing).", "author": "Josh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "The chicken is nice and moist and goes well with rice and the sauce they give you. The portion size is okay, like it won't leave you starving but still not the amount you'd expect from a $13-14 meal. I really like the sauce on the side, even though I'm usually repulsed by ginger because ginger tastes likes soap to me. I mean, it still does, so the sauce tastes like really good thai soap, if that makes sense. They also have a paleo option which is super cool since eating out on a low carb diet can be v difficult.\n\nThe best part about this place is the broth. Like oooommmmmmgggggg. I could just drink this shit all day. It's so flavorful and oily and goes so well with the chicken.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "Busy during lunchtime with nearby yuppies but a good healthy/hearty alternative if you're not feeling a sandwich or salad. \n\nI got the original which comes with their jasmine rice, chicken, some cucumbers and a side of broth for $12. It's a bit pricey but the size is decent. Just wish they had more included options instead of a la carte items like $2 for egg lol. But all in all, everything tasted clean and the chicken was moist.\n\nNot much table seating but plenty outside!", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Pretty decent meal for a reasonable price.  The food's fairly plain and simple, which I think is a good thing!  Just as the name implies, it's basically just chicken and rice, but you can add some toppings like an egg if you want.  The original's pretty good and filling, and the side order of fried chicken skin is delicious!  \n\nMy favorite part is probably how simple the whole thing is, definitely a nice and easy lunch outing during work.", "author": "Keith C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Not gonna lie, I didn't have high expectations for this place but I was wrong! The chicken here is super high quality and flavored perfectly. I get the Paleo because I want veggies without having to pay for a side and they give you a tin of brown rice anyways. \n\nIf you've never been, it's basically like Chinese Hainan chicken. It comes with chicken, rice, sauce, and a small soup. It's a bit expensive for what it is but on par for SF prices.", "author": "Ming Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "GENERAL: Back home in Indonesia I call this Hainan chicken. Famous in Singapore too. In general, you can still find these in the area, but to have it solely as a restaurant itself is amazing. This is a good to go food during lunch and good to eat in as well. Just come a little early around 11am, you'll be fine. \n\nFOOD: The big plus for me is when you can order solely breast chicken, in which not a lot of places do that. The sauce is... interesting in a sense that it has whole beans in it (i guess i'm not used to that) but the taste is spot on. Wondering about the soup? Drink it from the bowl or pour it over the rice.\n\nTIP: Come at 11am if you wanna avoid the line. After 12pm you can get fried chicken skin by the bag for $5. Fresh coconut is amazing. You can also get any meat of your choosing - mine is breast meat.\n\nIMPROVEMENTS: Maybe a different chili sauce because I've definitely had a better chili sauce that pairs really well with this cuisine.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-18", "description": "Everyone at work raved about this place so my expectations were too high. I find their food to be very plain... it's just plain chickens and rice but you add a sauce that adds flavor. I only gave this place 3 stars instead of 4 because I waited 35 min for my food. I noticed everyone else was only waiting about 10 min and it turns out their printer broke and they didn't get my order even though I paid and stood their waiting. I was super disappointed. The workers were very nice but the super long wait coupled with the plain chicken was very mediocre. If it wasn't for the wait and mess up on my order I would give it 4 stars.", "author": "Olivia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Some of the most succulent chicken and tasty rice that I've ever had (at that price range). The sauces that come with it (both the ginger/sesame and the spicy one) make the meal complete. Some reviews are criticizing the lack of seasoning on the chicken. I think that you're supposed to combine the heavily seasoned rice and sauce in every bite.\n\nService was fast and friendly. The restaurant was clean.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "Great addition to this east SoMa area with a general lack of Asian food options. The shop was not super spacious but had a few tables and could get very busy during weekday lunch hours. \n\nSimple menu with just four options, one vegetarian and three with chicken. Five of us got all different chicken options. \"Paleo\" option could be confusing - no rice and instead more veggies. I wanted to bring it up because their rice was the highlight of the meal for me! Chicken flavor was noticeable in the rice along with garlic and ginger, very tasty and just like in the classic Singapore style Hainan chicken. I got extra veggies (steamed broccoli), though the original portion was already more than enough for me. It also came with soup (tasty warm broth), perfect for a chilly day :)\n\nA bit on the pricey side ($12+ for chicken options) that probably made me not go every time I ate out in the area, but certainly a place I'd crave once in a while.", "author": "Jaclyn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-07", "description": "This reminded me a little of Hainanese Chicken Rice, except with a side of chicken broth.  Pretty limited menu, so at least you know they specialize with their main dish.  It was worth trying, but it's not going to make it into my Top 20 favorite Thai dishes.\n\nThe Original:  Oddly, I liked everything about the dish except the actual chicken.  The rice was very rich and full of chicken flavor; I could probably eat mounds of this.  The chicken broth was more intense than typical chicken soup (maybe more fat content?) and did an excellent job at warming up the lukewarm chicken.  The soy-based sauce with ginger, garlic and chili added a ton of personality to the chicken and really was a treat if you dip the chicken in the broth first.  The cucumbers and cilantro help add a nice vegetal kick to cut through the richness of everything else.  The chicken though just wasn't my thing.  The limp boiled skin had such a weird slimy mouthfeel.  The chicken meat itself isn't that warm so it had the cooled off chicken taste.  And there were pieces of bone and cartilage in the mix.  In theory I'm not opposed to picking meat from the non-meat parts, but not in the middle of the workday when in nice business attire and surrounded by a bunch of professionals.  Pulling a piece of bone out of your mouth and putting it aside just seems so awkward.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Flashbak to Thailand \nI remember that taste at the HuaHin", "author": "Dmitry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Visited this place after looking for a place to eat for lunch. Seemed to be a new lunch spot providing new options for the workers in the area tucked into the plaza. Expanding from their Marina location, they made their way down to SOMA opening this place.\n\nUpon walking into this place, it seems like a restaurant meant for a quick bite with takeout. It's very bright and very modern styled spot with a friendly atmosphere. In the back, the place is where the ordering happens and the rest of the magic.\n\nI ended up ordering the Paleo. Wanted to go with more vegetables and meat option instead of the having the rice accompanying the meal. Took the recommendation of getting the egg on the side. After receiving it seems pretty well presented. Vegetables layered on the bottom with the steamed chicken layered on top and the poached egg on the side. Layering on top is the cilantro, sauces, and the soup finishing off the plate.\n\nStarting off the soup. I will say this option was a superb compliment to the soup tasting like home. It had a bit of a sour taste, but the flavor from some vegetables that probably have been in the pot for a while. \n\nThe chicken had a bit of a supple, moist flavor with which had a nice vinegar like taste from the sauce with some spice. With flavors of the egg meshing with the chicken, it provides a great fulfilling experience to the meal. \n\nOverall I would say this place is a great recommendation to get a pretty close traditional meal while being a tad experience. Due to the price, I will give it a 4 out of 5 stars.", "author": "Frank O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "I'd say this place is really a 3.5 rather than a 3.  \n\nFood - a solid 4 stars.  The menu is limited to a few main entrees, and their focus means these options are very high quality.  The ingredients are top notch and well-sourced (organic chicken etc).  The food, at first glance, looks relatively plain, but the chicken is cooked to tender perfection and once you add the sauce, your whole experience becomes layered w salty, spicy, fresh flavor.\n\nAmbiance - 3.5 stars.  It has a clean, bright, light interior.  Not a ton of seating and most of it is communal, which I'm not a huge fan of.  I understand why they do it though - it is a more efficient use of space.  The seating area isn't as cramped as many SOMA restaurants, but it's not exactly sprawling either.\n\nValue/price - 2 stars.  I understand they are using really high quality ingredients, and those ingredients cost money.  However, w tax and tip and no extras, this lunch was over $17 to go. While that price tag will make me pause before going there, what I really didn't appreciate was that the marina (skinless chicken breast) cost more than the original which actually includes more meat (breast + thigh).  I didn't need or want the larger quantity of food, but I did want my chicken without skin.  I understand there is a small additional cost in the form of manual labor, but really?  It seemed like it was just \"demand\" pricing - they are expecting more people to order that so they priced it higher.  I guess if others feel like I do, the market won't bear it and they'll have to change.  Or, the market will bear it, and good for their business.", "author": "Sara E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-29", "description": "4.5 stars for sure. they had their soft opening today. I have  had the Marina location booked forever to try since thy opened. However, over the weekend I saw this sign go up by mi casa. They took over the old Urban Picnic and its refreshing. They add a different line up to the food scene in SOMA for lunch. Still the same simple 4 item menu but yet so delish. I got the Paleo with breast and a poached egg. A little price at almost $20 for chicken, broccoli, and an egg but it was clean and healthy. It came with broth too which props to them of it not tasting like oil water. \n\nwill def be back.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "I decided to come here because I was searching for a restaurant that accommodated my paleo diet. I must say, I was very impressed by how much flavor such a simple dish could have! Growing up in a Chinese household, I was accustomed to having this type of steamed chicken so I didn't think it would impress me too much. But DAT SAUCE THO. Game changer. I wish I still worked in SF because this is the perfect little lunch spot in SoMa with plentiful seating in the cute, little courtyard.", "author": "Sharon I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "In the former Urban Pinic space and so happy that it is there.\n\nI am use to Singaporean Chicken and Rice, but R & R is a happy addition to the SOMA area. A standard original chicken and rice, is about $11.95 (make sure you get a poached egg for an extra +2), and get the hot sauce they have there because it is amazking.\n\nIt comes with chicken over rice and a side of cucumbers and a soybean sauce is the best for a lunch in soma (and with the hot sauce on the side).\n\nI love that it comes with some chicken soup/broth for the cold weather and the food comes out without a long wait. Food is in a compostable container and the portion is generous. I will have to try it with brown rice and the paleo version (without rice).", "author": "Mei L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "I am excited to have found this place which serves one of my favorite all time dishes. It's not at the same level as what you'd eat in Thailand or Singapore, but until I go travel back to SE Asia,  I am happy to have this Americanized option nearby.", "author": "Rumi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "Thai style steamed chicken served with broth and soy ginger sauce. Very much a San Francisco spin on the Thai original, R&R serves their organic Mary's chicken over (optionally) brown rice in a compostable takeout container. A far cry from the street food traditionally  presented in a plastic bag!\n\nThat said, the preparation is delicious. A lover of chicken thighs personally, I recommend \"the classic.\" The $2 poached egg add on is very good but I don't think necessary given how much sauce the dish comes with. \n\nDon't be deterred by the line; since they only serve essentially one thing it moves very quickly. Also, in case you're wondering, this place is not a good option for vegetarians. \n\nMy one gripe (and subtracted star) is the high price point. $12-15 for lunch is too high. If in a closer location to home I'd definitely consider this place for dinner. Until then -- or when they realize they can get away with serving Safeway $0.99/lb thighs -- I'll keep this one on my list as a splurgy lunch.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Tried this place for the first time and it was pretty good! I got the original with an egg and a bottle of Thai tea. My coworker got the original and an orange Fanta. For the both of us, the total came out to be $37 and I thought that was pretty pricy... I'm originally from LA so I'm a bit biased because I've had better hainan chicken and rice. The only unique part of this meal that differentiates the Thai style from the Chinese style is the dipping sauce.. and in my case I wouldn't mind having either one. \n\nWe wen during lunchtime at around 1130am and beat the line. Chicken was tender, no bones, rice was flavorful and it also came with a cup of soup!\n\nOverall, I was pretty satisfied with my meal and the portion sizes were also just right. I would probably come back and eat this again but not anytime soon.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I like this place when I want to have a heathy meal.  It is just steamed chicken on rice and vegetable.  Although the chicken is steamed, it doesn't taste dry.  The source included is very tasty.  It is a bit pricy for such simple dish.  But everything in San Francisco is pricy now.", "author": "Jon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Ever had Nong's Khao Man Gai in Portland?  It's considered the best khao man gai around. I PERSONALLY think Rooster and Rice has wayyyyyyyyy better and  more flavorful chicken and rice. Super\nTender and teeming with flavor. The only toss up?  I think they could use some work on their sauce. But still bomb ass heck.", "author": "Chai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "This place is amazing! I've been trying to make it here for the longest time and happened upon it on my way to the 24hr gym. I wasn't even hungry, but got the original, and added an egg. The check came out to close to $15.  You have to add an egg. It was cooked perfectly! That dipping sauce was soooooo good with the chicken and rice. Everything was awesome. I highly recommend trying this place out. I'll definitely be back!", "author": "Julia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "Not great compared to the Hainan chicken food truck in Portland. Let down for me and the line was way too long. Also expensive! Rice was overcooked (mushy).", "author": "Carol C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "I love love love Rooster & Rice! I didn't know about this location until my friend took me here for lunch one day! \n\nI was so glad we were able to beat the crowd because there was a huge line right after we order. But, the line does move fast from what I've seen. \n\nJust like their Fillmore location, their original chicken rice did not disappoint! The flavors were all there, the sauce was delicious, and the broth was full of flavors! I recommend trying the habanero sauce if you like spicy. It definitely adds a kick to your meal.\n\nOverall, this is a great spot for lunch, dinner, or whenever you're hungry. It's a little pricey (being about $13 without add-ons), but the quality is great and the food is absolutely delicious. Can't wait to come back!", "author": "Wendy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Rooster and rice is the perfect fast casual meal, the chicken broth is so good that I have to order two every time. You can't go wrong with the original hunan chicken!", "author": "Betty B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "YES it's that good the \"original\" is delicious with tender chicken over fragrant Jasmine rice and a side of chicken broth. It's unfortunate the location is embedded into a building hard to find but if you're near by its worth a one time try.", "author": "N A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "Bland, plain, and overpriced.  \n\nI wouldn't believe it's  $14+ for some steamed tasteless chicken and brown rice, except.. thanks SOMA.\n\nAvoid. Plain home baked chicken, with nothing, is far more interesting and satisfying.", "author": "Calvin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "I live nearby, and this is my go-to dinner spot when I'm feeling too lazy to cook but still want something reasonably healthy! I love the paleo option (chicken + vegetables) with some delicious chicken stock on the side! Their ginger dipping sauce is A++, and the small courtyard area outside is really cute as well! \n\nI just wish this place wasn't as pricy, but I'm used to cheap Hainan chicken from Asia. This place definitely does hainan chicken justice though!", "author": "Maria Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "I love the food here! It is a bit on the expensive side and sometimes the wait is long. It gets busy during the Fidi lunch rush (as expected) but with very few menu variations, you'd expect the food to be expedited faster. As for the food, the chicken is very juicy and tender and cooked simple but flavorful. Delicious!", "author": "Shiela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "I've now tried khao mun gai at a few places in SF (you could say I'm a little obsessed), and hands down Rooster & Rice is above and beyond the best. The broth, rice, and chicken quality (not to mention quantity) are all better than the likes of Hawker Fare and Lers Rhos. I just wish they were on more delivery platforms like UberEATS-- the only reason I even tried those other khao mun gais is because R&R is only available on Caviar, with absurd delivery minimums (and the restaurant itself is rather far), or else I swear I would be eating R&R at least 3x/week. I'm obsessed.", "author": "Minnia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "Tender chicken cooked competently and stacked on top of rice. Add a tad of special soy sauce and spicyness. What's not to like?\n\nPointers: don't add the soy sauce thing all at once. Ration conservatively. The sauce is pretty potent and they were very generous with the amount they give you.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "Great place for lunch. Traditional thai chicken and rice. I had the paleo style without the rice. The chicken was extremely juicy and tender and the chili garlic soy sauce was absolutely decadent. I didn't love the fact that the accompanying veggies were basically broccoli. I felt like they could have been a little more creative there. The broth was also delicious, but there were no spoons to eat it. So I wasn't sure if it was a stew or like a juice? It was alright. Nothing to talk about.", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "I was craving Khao Man Gai in Portland and I found this little gem close to my work.  I ordered the original and the paleo Togo.  \n\n\nThe thigh meats were so soft, juicy and tender. The skin was just perfect--in my mouth. The broth was crisp, clean and enhances the flavour of the entire dish.  \n\nIt's one of my favourites. Super healthy.  Great tasting and very filling. If you're looking for a quick bite without the guilt of unhealthy calories this is your place.  If you're looking for something that comes close to home, this is your place.", "author": "Peter N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-29", "description": "Eh, A-OK sounds about right for this place, mostly due to the price.\n\nCame late on a Monday (~7:00PM), and ordered a paleo style (mixed breast and thigh meat) with an egg. The sauce that came with the chicken was quite flavorful, the broth that came with the food was quite good as well, and the star of the show (chicken) was tender and tasted quite good. All that combined with the fact that this place seems like a healthy option made it a fairly decent meal overall.\n\nThat being said, however, this place is pretty (quite) expensive. At $13 for poached chicken over broccoli, it's quite the premium to pay even by SF FiDi standards. If I ever come back I'm getting a Marina; I found that the paleo style dish wound up with a bunch of juices and no rice-like component to soak them up! Oh, and I'm also going to skip the egg next time. Even though it was cooked quite runny (goes well with the dish I think), I think the additional $2 is not worth it.\n\nAs an aside, this place has napkins and togo boxes branded with their logo..!", "author": "Alexander L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Super surprised how such a simple dish (chicken and rice) could taste so damn good! They give you a lot of chicken, so you will definitely be full. I love their small menu; absolutely hate it when there are too many options to choose from. \n\nAnd this is located in the best area for lunch. Plenty of outdoor seating to enjoy your food before dragging yourself back to work.", "author": "S. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Delicious, light and healthy. Also open late which is a plus. Delivery available by caviar which makes this an easy weeknight dinner choice when I'm too lazy or don't have time to cook. Located in the 303 plaza with the big fountains and the Lee's deli also in the plaza.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "Simple and incredibly delicious is all you want when it comes to Asian chicken and rice and this place is both. I got the original with an added egg because, duh. The poached chicken was tender and delicious, the rice tasted like it was cooked in chicken fat for 20 days because it was so tasty and the sauce was salty, sweet and brought everything together. The broth was a good palette cleanser that was smooth and warm. Also, all their napkins, lids and bags have their signature chicken on them--so cute! Definitely coming back...everyday...for every meal.", "author": "Tina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "I grew up in an area some pretty amazing Hainan chicken rice, and I'm so excited that this is on par with the stuff from home, in addition to being walking distance from my office!\n\nRooster & Rice serves the Thai variation of Hainan chicken rice. The meal consists of tender pieces of chicken served over a bed of chicken-flavored rice with a side of cucumbers, a cup of chicken broth, and a gingery, garlicky soy sauce for heavy dipping. There are two other sauces (one tangy and another spicy) you can serve yourself.\n\nWhile it's a tad more expensive than what I get back home, the price is pretty standard for a lunch in the area. I'd also rather spend that money on $10-12 on some delicious, hearty meat and rice than on a couple of leaves at a salad place to be honest!\n\nCan't wait to get it again!", "author": "Derick N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Let's get one thing straight -- this is NOT hainan chicken rice. This place serves THAI style chicken rice but it IS delicious.\n\nI came by during lunch to get two originals to-go (one for me and one for the husband).  Opened the box and it looked kinda sad. Chicken is white, rice is white, parsley is green, and three 1/2 slice of cucumbers. Probably not sad but a but a bit too healthy for my palete.  I felt sad looking at the box but I was hungry so I started eating...\n\nDAYAAAAAAAM the rice is good. Yes, it's the garlic flavored chicken rice.  The texture is perfect. I ate about half of all the rice before I picked up the chicken because it looked boiled :*(  I don't like boiled chicken. My dog doesn't even like boiled chicken (no, she actually does like boiled chicken...she likes eveything). But then I noticed the little sauce container. It contained some tasty dipping sauce - yummy and delicious! Like soy sauce with spices and seasoning. \n\nSo $12.95 isn't cheap but it is worth it.  The portions are quite large and... most importatly.. remember this is SoMa and salads are like $15 each.", "author": "Virginia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "it's sooo good.  if you like tender chicken, rice with an essence of chicken, and garlic ginger sauce. you must try it.", "author": "golf g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Yay for khao mun gai aka Thai chicken rice aka hainan chicken (they all taste the same to me haha but maybe I just don't know any better)! Finally a place around the area that sells a decent version of this dish. It's not the best kind I've ever had but it'll happily satisfy my craving. Also a bit pricey for what it is but welcome to SF I guess.\n\nI order The Original and it comes with a mix of light and dark meat along with white rice (cooked in chicken broth). Make sure to pour some of the herb-y soy sauce over the chicken to give it some flavor. The portion size is alright. I can finish it all without a problem and be full and satisfied but not overstuffed. A guy with a bigger appetite might be a bit more unsatisfied. If you need a little more food or want a more balanced meal, add some extra veggies. The meal also comes with bone broth soup which is simple but tasty. \n\nGood healthy choice for lunch/dinner! Wish it was closer to my office as I can only get it when I splurge for delivery.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "It takes me 20 mins to walk here from where I live, and yet I've made it a habit to visit at least once every week, because it's just so worth it. No place in SF serves up a better Hainan Chicken. Get The Marina or The Paleo if you feel like something healthier, but for me it'll always be The Original!", "author": "Carl W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "A place to be when craving some chicken, rice, and soup. This serving that you order is worth your wild because its a different style of Asian cooking which serves up with a great sauce as well to have with your chicken. Although it is pretty pricey, I think it is worth your money to get this as it fills you up for lunch and maybe till dinner time.", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-21", "description": "There are about four lunch options to choose from. \"Looks\" plain, probably simple if you like crazy flavors, but don't be fooled. Chicken is very juicy and tender with a ton of flavor. Rice is equally delicious and marinated. The ginger soy sauce it comes with makes the meal so much better. Each meal comes with a chicken broth, great for cold days.", "author": "Marfel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Awesome!  Similar to Nong's in Portland -- and possibly even better.  Folks in SF are lucky to have a couple locations to choose from.  Rooster & Rice reminds me of yet another \"food truck turned mini-shop\" venture.  Seems many are taking advantage of the current order-take-out-and-sit-in phenomena.  My colleague and I enjoyed sitting outside on this particular day, though, as we were experiencing a break in the winter storms that have saturated the state.  I didn't realize there was a difference in rice between the menu options, but I think I had the Original with regular white rice.  There's not much else to provide in a review, other than just bookmark and go try it sometime!  Counter service was quick and friendly, and after that you take care of your own sauces and utensils while waiting to pick up your compostable bowl of freshly-made and perfectly proportioned protein and carbs (and for some of you, veggies).", "author": "Sherri C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "I don't get it. Prime example of SF overzealousnsess..attempting to modernize traditional foods with a heavy price tag to trick clueless yuppies. \n\nThe chicken was pretty disappointing..and far from than the dozens of chinatown eateries that serve poached chicken. I will give props to the interesting sauces..but you can't just add some rice and slices of cucumber and call it a day.", "author": "Howe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Delicious poached chicken and rice with a side of chicken broth, broccoli and cucumbers - a wonderful meal any time! As I like to finish off my meals with tea or something hot, I was very surprised at how the chicken broth complemented the rice and chicken so well. Highly recommended.", "author": "Erik S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "It is 99% similar to traditional Chinese food \"Hainan Jifan\", don't quite like the fact it puts \"Thai\" as style here. The food is very good, just like the ones I had in China, the other thing I don't like is it is closed during night and weekend.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "wow! just caviared my fiancé and my dinner for Wednesday night late dinner! I got the original and the marina with extra breast meat for the bae. the meat texture was chewy, just the right amount - what was amazing was the gingery soy sauce it came with the dish! can someone please share with me how I can make this at home?!?!  \n\nso glad to have found this place! will def be a regular", "author": "holly n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "The food is not cooked bad which is why I gave it one star. But it's sooo plain. Since it's \"Thai\" I was expecting some seasoning, maybe some curry or peanut sauce. Nope. It's literally a scope of plain rice, a scoop of plain broccoli and a scoop of plain tofu ( I got the vegetarian). No salt no sauce  no seasoning no nothing. If you want the most bland bowl of food in San Francisco try this place.", "author": "Jeanine K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-10", "description": "What a phenomenally mediocre place for lunch. For $15, you can get dry chicken over cold rice and a half assed attempt at a fried egg and no drink. \n\nJust go to the food trucks. For $15 you can get better and more interesting food for your dollar. \n\nI'm so upset I waited for 20 minutes for this crap.", "author": "Cody R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "Juicy chicken, aromatic rice, flavorful chicken broth, variety of sauces - what else could a girl ask for? Love this place so much and will keep coming back! When I can spend $15 on this (the same price as my salad) and be much fuller and happier eating it, that's not a bad trade off! Wish they would open on weekends!!", "author": "Cynthia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "I've been to the new location a few times since it's opened, and haven't been left disappointed yet. The menu is simple, clean, and delicious. The portion size is considerable, but never leaves me feeling bloated, and the service is quick -- perfect for that lunch during work hours. When a spot like this has only a few items on their menu, you can be sure that they've perfected the recipe for each dish. \n\nHaving traveled to Thailand a few times, I can say without a doubt this is the best Khao Mun Gai I've come across in the States. Of course it's a bit more pricey than the Khao Mun Gai you might find in Sukhumvit, but you're paying for quality and service -- from my understanding the chicken, rice, and vegetables are all organic. \n\nI've eaten everything here except the tofu, which I imagine will be just as good as the chicken for you tofu eaters. I usually add extra cilantro to my dish, because I'm that type of dude. Enjoy!", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "I was so happy to find out that there was a Rooster&Rice 1 block from my office! Yay for more (Asian) options. The place is small and trendy. I got in line right before 12 and had to wait about 10 minutes for my dish. By the time I left, the line was twice as long. \n\nI got the \"original\" and it definitely filled me up. Pricing is aligned with SF..it came out to be $13 with tax. The menu is limited and simple. It's basically just rice and chicken. It does come with a broth but I'm not sure how \"healthy\" it is. There is limited seating inside but it looked like majority of people were getting it to go.\n\nI didn't have too much interaction with the workers but they seemed friendly. There are also 2 handsome men working here so that's a plus if you're single, haha!\n\nI would definitely come back again!", "author": "Megan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "A simple, healthy option for lunch. The menu is a bit one note...but the broth always hits the spot!", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "It's a bit pricey, but it makes sense since it's in SoMa and the quality is great! I'm used to eating the chicken rice that my mom makes and I know that the sauce really sets Thai style chicken rice apart from other chicken rice dishes. \n\nThis being said, Rooster & Rice does *not* disappoint! I've been here twice and have been satisfied both times. \n\nCouple tips: \n- It's super busy at lunch time. Come either right before the noontime rush, or wait until ~12:40 or so to place your order\n- The portion is generous! Either share w/ a friend or eat half for lunch and the other half for dinner/an afternoon snack :9", "author": "Nadine F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Cool concept. They have a nice brand/stamp. The chicken skin was slimy and there was a lot of it. And it took forever. Still it's really good overall and unique.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-09", "description": "I've visited the Marina location and realize they opened one up near my work. YAY!\n\nIt's a simple dish, of thai chicken and rice. Think Chinese Hainan chicken but with different sauces, and fragrant rice. The difference maker is the hot sauce on the side, really makes it worth going to. The one they provide is a mix between the original and bold, and it's pretty darn good. You can buy a bottle of it as well. The dish also comes with a small cup of chicken broth and cilantro/green onion. Goes well with the dish. You can either pour it on or drink it solo. \n\nThey had some fried chicken skin pieces to sample as well, and it was delicious. Anything fried is usually amazing. \n\nIt's a little pricey, but in the FiDi, it's kind of expected. I can't remember if the prices were cheaper out in the Marina, but I feel like they would be. \n\nI'll be back!", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Love Rooster and Rice!  Skinless chicken with brown rice is healthy and filling. Perfect quick lunch or dinner. Always get hot sauce to add to your meal to make it extra spicy.", "author": "Christina Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-23", "description": "I'm so glad this place opened in soma. I had been to the marina location once and it was great but the marina is so far away for a place that is barely a sit down joint. Anyway so glad it opened it's new location. There is a decent amount of seating inside, one long group table for about 12, and then some bench seating along the window. They rely on everyone going to eat outside in the plaza seating. \nThe menu is really straight forward chicken and rice: original version, chicken breast version, vegetable (no chicken), and I think I saw a paleo version (chicken and veggies, no rice). The extras would be an egg, extra chicken, sauce, rice, and soup. \nI love chicken and rice and I've tried to make my own at home and damn is it a lot of work. It's a lot a lot of work. That's why while it is more expensive than I'd like to spend for a quick lunch meal, it's def worth it. It's also a really hearty portion. They give you a lot of chicken - no bones! - and the rice is flavorful, broth tasty, sauce is awesome. It'll definitely fill you up. Definitely coming back and I'm so excited to have it in the neighborhood.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "This was my first time checking out Rooster & Rice.  It's a great lunch spot if you're looking for a solid meal.  I got here a little before noon and luckily I did because the line started getting longer after I ordered.  I got the Marina and it was a very healthy portion.  The flavors were great and I added some siracha for a nice kick.  Only complaint was that I had some bones/skin on my chicken and it is expensive.  Otherwise it was very good.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Chicken and rice is my favorite! I'm so excited that they finally opened. The chicken is soft, tender, and juicy!  Add an egg  for extra yummy ness! The lunch crowd is lively, so come early. The line is fast, so waiting is not an issue. Lots of seating inside and outside. I definitely will be back and highly recommend to everyone!", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Yum. Expensive but it's better than no Hainan Chicken :) This is as good as it gets in the Bay Area.", "author": "Lyn X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "So good, I almost didn't write a review because I don't want more people coming and the line getting longer.\n\nI had the Original. Chicken was juicy, broth is delicious.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Can't beat this place! Khao mun gai is one of my favorite foods when in Thailand and these guys are as authentic as it gets down to the minimal wait time for the food.", "author": "Rolf C B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "My team recently ordered lunch from here via Caviar, per a recommendation from a coworker. I don't eat meat, so I got the vegetarian dish. For a place that specializes in chicken, the vegetarian option was surprisingly good! The ginger soy sauce/glaze and broth really heighten the flavor so I would recommend adding both. I wish the tofu had it's own seasoning, but it was just plain and bland. I also would have liked to see more vegetables than just broccoli. The website says \"seasonal vegetables\" but surely there are more vegetables in season than just broccoli.", "author": "Ariana M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "I guess I'll be the voice of reason. I've given this place a chance numerous occasions. The truth is, it's overpriced and lacks taste. If you want to spend 15 bucks on boiled chicken and plain brown rice go for it. Then again, there are a lot of suckers in SF.", "author": "Mehr E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-12", "description": "Chicken was poached very well. House sauce was delicious. Rice was a bit soggy. Overall the food was great.", "author": "Tony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "I've always been a fan of Rooster & Rice ever since the beginning. I made sure to drive out of my way to pick up their signature khao mun gai for dinner even though it was all the way up in Fillmore. The owner is super nice and I visited so many times that he remembered my name. I was super excited when R&R opened in Soma because it's so much more accessible! However, I'm not sure if it's the staff or the owner not being there all the time, but the chicken rice here is just not as good. Same sauce and same rice but the chicken really varies. Sometimes it's super dry but their sauce is consistent so I usually just pour the entire thing over the chicken. That usually helps with the dryness. Overall, still love R&R but I prefer the Fillmore location!", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Wow! Chicken taste so fresh and the was so good! I'll recommend it to anyone who loves chicken", "author": "Tirso D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "the food was really great, short wait time\n(also there was a cute guy that was walking in and out of the kitchen)\nwould definitely return for the food (and the guy)", "author": "Melody W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-13", "description": "A bit pricey (just like lunch almost anywhere in SF SoMa/FiDi lol), but a tasty meal nonetheless. It was my first time trying this dish so I don't anything to reference it against, but the chicken was soft and moist. The dipping sauce went well with it, but I really enjoyed the rice. It was very flavorful and complemented the dish. Get it with an egg! \n\nI don't plan to frequent this place, but if coworkers decide to check it out I wouldn't mind going again.", "author": "Eduardo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Today is Trump's Inauguration day. So I needed something really good for lunch. Something that reminds me that life is worth living. \n\nI hopped on Yelp and saw that the Urban Picnic was replaced by Rooster & Rice, a place I had seen opened in the Marina, and now here it is - 2 blocks away from my work. Yay!\n\nUpon arriving at Rooster & Rice, i see the line. I expected this as San Franciscans are crazy. I don't usually like lines. Some people go just for the line, it seems, but I stay away. This is the first time, I actually stood in the line. I dunno... maybe it's because today the world is ending. I mean if the US is going to try something new - like elect a fascist, xenophobic, racist, sexist imbecile, then I can also try something new. Like stand in a line.\n\nUpon entry into the actual restaurant, I noticed that it was all asians and their more experimental non-asian friends. I don't know if I had ever seen so many asians in any other SOMA restaurant before. If Trump wanted to put all asians in an internment camp, they can make Rooster & Rice it's capital. He can just fence us all in like chickens.\n\nAnyhow, I got the original. DUH. the OG of course. Jesus - the marina? Really? I'm not judging. I'm just saying... I'm judging.\n\nEverything was pretty good and satisfying. As expected. The best thing was the broth which was super flavorful. Rice had a light flavor, which is fine. (Not as good as Hainanese chinese chicken, but it's fine.) Khao Mun Gai chicken is poached, where as Hainanese chicken is steamed - but end result is similar. Basically a very clean, chickeny flavor. \n\nThis is why only the most experimental of non-asians would ever come here - that poached chicken. I think it's something you grow up with. To the non-asians, it's just rubbery and too chickeny. There's a reason why chicken is battered and fried. Or smothered with bbq sauce. I actually don't love chicken ...but there is something nostalgic about eating poached / steamed chicken. Very comforting. \n\nThe ginger-soy sauce was of course delicious. You gotta have that right. I could talk about hainanese chicken sauce (which is a ginger scallion sauce), but I might have a gang of thai techies come beat me with a coconut hammer. \n\n(Aww.... don't get mad my Thai cousins... If it's any consolation, the Chinese don't do any noodle dishes as close to delicious as Tom Yum Noodle Soup.... mmmmm... Tom Yum Noodle Soup.)\n\nAnyhow... seriously I'd say the only reason I am giving it 4 stars is because it's not Hainanese Chicken Rice. And I know that's not fair. But you know what... Today, a person who lost the popular vote by 2 million votes is being sworn into office. So life isn't fair. \n\nMaybe I'll update the review when life is fair again.", "author": "Bonnie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "Chicken and rice is definitely my choice of comfort food whenever I go back to my parents' place. Rooster and Rice's version of this dish was very tasty. It was a bit on the pricier side but the rice and chicken was delicious. They also had many different types of sauces that were excellent garnishes for the chicken. I do wish they had something spicier though. If it were not so far from my work, I would have come here at least once a week!", "author": "Catherine T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "The quality of the food was good but the price seems a bit outlandish. Not sure I'd go back based on the price. It's chicken and rice after all!", "author": "Shawn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "4 Stars on the food.  3 Stars for the value.  The chicken and sauce over rice are pretty excellent.  I couldn't help wanting some greens to even it out though.  You can order a side of vegetables for $2 more, but given the already high starting price of $12-14, kind of starts taking you into a price range where the expectations should be much higher.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "Glad to see that Rooster & Rice has opened up a location in the SoMa area.\n\nI recommend ordering \"The Original\" and adding the sous vide egg to go with it. The portions are very filling and the ginger/garlic sauce that comes with the meal is delicious. The meal includes a chicken broth to help wash the meal down.\n\nThey have some seating inside and plenty of seating outside.\n\nI'll definitely be adding this spot to my lunch rotation.", "author": "Lester W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "I love this new location! The owners/employees there are super friendly. Nice modernized seating and a good vibe with music in the background. Simple menu with SUPER GOOD food. I get \"The Marina\" which is skinless chicken over brown rice. Add and egg and splash the sauce over your plate and you're good to go. Definitely eating here again and again. HIGHLY RECOMMENDED!!!", "author": "Alvin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-20", "description": "I received the wrong order. I ordered an original to go and got chicken with broccoli only, no rice. It was a bit disappointing to discover this after I got back to work and I didn't have enough time to go back and exchange it. \n\nThe chicken is ok but what I like most is the rice and unfortunately for my order today there wasn't any.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "This place is soooooo good. I wish it was just a LITTLE bit closer to where I live. I always get the original but with only dark meat. The chicken is SO good and tender and has so much flavor. The rice also has a lot of flavor and the combination of the chicken and rice is literally magical. The sauce they provide is also so yummy and brings the rice/chicken to the next level. The broth is also really good. YUMM. now i'm just craving rooster and rice.......", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "My new favorite place for lunch in the area! Simple looking menu with fresh ingredients. The broth is something I've been thinking about on these cold and rainy days. \n\nI'd spring for the egg and get a sprinkle of their fried chicken skin. The other options are breast meat and brown rice. \n\nSo the last couple times I've either opted for chicken breast and brown rice as an option. Just make sure you get the sauce (not spicy) and the broth that comes on the side!", "author": "Rob M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "Food: 4/5\nService: 2/5\n\nThe chicken with jasmine rice is so simple but so flavorful. Add an egg to make it even more amazing. \n\nEverytime I order I need to order like 5 lunches and to drive it to another location like 40mins away (SF to Hayward). So, I call in right when they open at (11:30am) to make sure it doesn't mess up with their lunch flow. On both accounts, this is how the conversation goes.\nWaiter (W): \"Hi, Rooster and Rice may I help you?\"\nMe (M); \"I'd like to place an order.\"\nW: \"uhhhhh hold on a minute.\"\nPuts me on hold\nW: \"How many are you planning to order?\"\nM: \"5.\"\nW: \"Well it messes up our lunch flow when we do take-out orders. We rather you come by and order.\"\n**Me thinking: efficiency..lots to do..Got a dog with me that can't go in, hard to find good parking there without getting broken into.**\nM: \"Why do you have a phone number if you don't have take-out?\" \nW: \" We can do take out, just not at the time you want it bc it's during our lunch hour and our staff in the back cannot make all of the boxes quick enough\"\n**Me thinking: seems like it's a management issue or someone in the kitchen not being capable, unsure which.**\n\nI was able to place my order, but each time it's been rough. It's good and so I like to share with my family and friends, so I deliver them lunches (practically advertising for them) and I get this annoying conversation that I'm like causing ruckus to their business. It makes me not even want to order bc it's the treatment that they give to take-out orders. Clearly, it's not a place that can handle big (or small) company lunches.", "author": "Mo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "The food more than lived up to how good it looked on Yelp. so good in fact I wasn't even mad it was in a nondescript courtyard of an office building complex. As a tourist I was hoping for a hipper location . I was confused about what SOMA was. But I left satisfied and now I'm wishing they would open a location on Los Angeles' east side.   I like that there are limited option and each is healthier than the next. I had the Original and felt no guilt.", "author": "Fioni B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-30", "description": "Not worth it.. way to simple, taste is ok. Extremely expensive$$$$\nPaid $17.95 (Chicken, steamed veggies, egg, brown rice) and chicken broth aka fat soup = I dont think so! First and Last!", "author": "Jane D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Best chicken and rice dish ever! This is one of my favorite go-to lunch spots. I love that it includes the broth as well. Definitely comfort food all the way.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Very tasty chicken rice! They have several stores in the city and all of them are good. The downtown one is extremely efficient. During workday lunch time they will make a chicken rice every 10 seconds.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "They serve one dish, but prepare it extremely well. Get the veggies for a well balanced meal.", "author": "Jacob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "I don't know how they do it, it's simply chicken and rice. But this may be the best thing I've ever eaten. Still having dreams about R&R!", "author": "Kaitlyn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Delicious chicken and rice topped with a soy-ginger sauce. My go-to order is the Paleo, but I get it with half brown rice and half veggies instead of the standard veggies-only. It's a bit on the pricier side for a SOMA lunch, but portions are great and it's really hard to find a well-balanced lunchtime meal like this.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-07", "description": "Simple food done well, line can get a bit long but that's a good sign, right?", "author": "Erik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "The chicken was very moist, and the rice was good as well.\n\nThe hot sauce is DELICIOUS.\n\nThe egg is very gooey and mixed in well with rice, and the broth is heaven.\n\nDefinitely recommend!", "author": "Justina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "you sf-ites have it good, man. burmese stops galore, $4 banh mi, andytown, and khao man gai? i hope u guys give thanks for all the goodness you have\n\nanywho\n\nwhen i saw that theres a place that does khao man gai i h a d to go. i chanced upon this dish for the first time a few month ago at nong's in portland (bless her soul) and i think its safe to say it kinda changed my life. dont sleep on khao man gai. \"room temp chicken\" sounds whack but when the sauce is right, such a simple, barebones dish can prove to be one of the most replenishing, fulfilling meals you could enjoy. \n\nand now reeling back from my philosophical divergence: i ordered the marina with extra vegetables and sauce.\n\nit was ok! the sauce is pungent as it should be. it looked like there was some dried shrimp in the sauce alongside some pepper that added a much-needed kick. the chicken was most definitely not dry, despite it being skinless breast. the brown rice was cooked, all i could ask for. just barely the right amount for a proper chicken:rice ratio. the extra vegetables i got didn't seem to make it to my take-out container? or perhaps a few extra slices of cucumber were the extra vegetable, in which case, the +$2 was definitely not worth it.\n\nregarding the broth, it was nice, but very single note. i expected radishes and some spring onion, additives that would make the broth crisp and refreshing as it had been at nong's. it sorta tasted like low-grade sushi miso soup with some chicken fat incorporated into the base.\n\neventually the marina + veggies + sauce (had to meet a minimum for the caviar order) rang up to be around $18 with the silly sf tax included. it was nice to fix the khao man gai craving, but not worth that heavy hit to the wallet.\n\nreally nice and clean store tho! wish i'd given the original location a try too", "author": "Angie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-27", "description": "I'm giving 1 star..because I liked the rice and the saucey thing..it was yummy...lets just say I was holding on to dear life for a couple days after eating there..i got sooo sick from the pale chicken....which was suspect...the skin and fat were still uncooked.....of course I didn't want to be rude as I was with coworkers...i had a few bites and couldn't handle it....and my stomach can normally handle anything...and as for the price...yikes...i can buy a whole rotisserie at the grocery store and everything plus the skin would be cooked....for like $5", "author": "Vicki D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Very tasty but very pricy! Perhaps for frequent customers a rewards card? Every 10 get one free? Would love to come more often but every time I walk out of there it's $15-$18- way beyond my budget for boiled chicken and rice. Don't get me wrong- it's delicious but $$$ - so just once a week for me now!", "author": "Stan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "When I heard this place was opening up by my office, I had to check it out after hearing so much about the Marina location. The hype was definitely real and I may have found a new go to spot for lunch in the SoMa!\n\nDon't be fooled by the \"plain\", simple appearance from the photos...there is a lot to love in the dishes and the atmosphere is pretty spot on (Coke in glass bottles! Hip-Hop music! Fresh Coconuts!)...you really get a feeling the owners/staff take pride in the details, and it shows.\n\nGO TO ROOSTER & RICE!!", "author": "Mario P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Rooster & Rice is SO delicious! I agree it's a bit pricey, but I'm willing to splurge every once in a while for a healthy, tasty and filling meal. I usually get their Marina with veggies and my husband gets the Original with egg. Perfect meal on a chilly San Francisco day.", "author": "Erica P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "The food here is fantastic. I had never tried Hainan chicken before Rooster & Rice, and now I crave their \"Regular\" dish with house habanero sauce almost daily. The chicken is somewhat reminiscent of my my mother's Tinola, but it is a wholly different experience. If it weren't for my self-imposed rice restriction, I'd be at R&R every day.", "author": "Amelia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Pretty bomb chicken and rice . The sauce is solid and the staff is fun. Can't wait for those stickers!! I'll put it on my laptop!", "author": "Shirley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Kao mun gai is one of my favorite Thai dishes and I feel like it's not that common in SF. I've really only had it at the renowned Nong's in Portland. It's been a long time since I've been there so it's hard to compare but Rooster & Rice is certainly quite good. I always order the Original. The chicken feels fresh, tender, and juicy. The rice is super flavorful and most importantly... the sauce is just perfect. The chicken broth is also good.  The reason I'm dropping a star is because I don't think this meal is worth $13. Lunch is consistently less than $10 in the area so it's difficult to justify putting in the weekly lunch rotation. Adding an egg is $2 and a side of 6oz of fried chicken skin is $5. Pricey indeed.  But yeah, it's good. And you should totally try it.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "I got here at 1120 on a Monday and didn't have to wait in line.  Ordered the chicken with rice and it came with the delicious piping hot soup.  The chicken was good, but not outstanding.  The sauce takes the chicken up a few notches.  The rice is tasty, but texture was a little soft.  Soup was great.  I thought the value was good for a $12 lunch in the City.  As other reviewers indicated, portions are large and could have easily been split into two meals.", "author": "Yvonne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Great hainanese chicken place that has delicious food and good execution. I love that you can customize the order and add dark meat if that's your thing, or add a poached egg. It's pricey for what it is (ie. chicken and rice), but it is some of the best you'll have in the area. Be warned, lines can be vicious during rush hours, and you might die of hunger and jealousy as you see others enjoying their food. The fact that every order comes with a soul warming cup of chicken soup broth is just a bonus.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Foods good, staff is always friendly, everything about this place is good! I always get the fried chicken skin on the side for the extra .", "author": "Aaron Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-21", "description": "Food is good ... but I don't appreciate being forgotten... was told that my order would be out in 5 minutes and received my order 20 minutes after I placed it. I normally wouldn't care but only getting a 30 min lunch does the trick. Also pretty pricey", "author": "George A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-20", "description": "Don't understand the rave reviews. If you enjoy bland,  barely lukewarm,  boiled chicken with a skin texture somewhere between slimy and rubbery, pieces of bones and cartilage mixed in, and all that for an outrageous price, then sure,  you're at the right place.  Extra star for the dipping sauce, which was indeed excellent and the only way to get some flavor on the chicken.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Has a simple menu but great tasting food. great options like paleo and vegetarian(tofu).\n\nI had the original plate.  chicken was cooked perfectly and sauce was awesome. only drawback.. the rice was a little grainy. taste was great but texture let it down.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "Fast food place that takes 30 min to get your order ready. Tastes great but takes too long to get the food and not cheap.", "author": "S L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-13", "description": "Such good chicken and rice! This was my first stop in SF and its a small little place with only a couple seats. Most people who ordered here were taking to go. The orders come with a small bowl of soup broth which is nice and warm. Really good garlic ginger sauce that goes on the (soft and delicious) rice and chicken. Less stars though because it is really expensive for such a simple dish, though it definitely has to do with the area that they are in.", "author": "Suzan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Delicious chicken and rice but one caveat: their service is slow and you'll have to wait a while to get your order. I waited around 10 minutes -- but they only make one thing (chicken and rice, duh!) So I'm confused why it would take so long. It's a simple meal. With that being said, I still think it's tender, juicy and hits the spot. Good comfort food and it's the best option around this area in Soma!", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-30", "description": "I am so glad more Asian food place opened in the SOMA area. This place is pretty new and I have been there a couple of times already. They give you a good portion of chicken. The chicken and rice taste very good mixed in with their sweet soy sauce. Down side is that it is a bit pricey! You can get skinless chicken breast which seems healthy.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "This would be a five-star review if they offered a less expensive option that contained a smaller portion of chicken for those of us with daintier appetites. \n\nIt's about as good as the famous Nong's Khao Man Gai in PDX (which I've been to several times) but the portion sizes are ridiculously large at Rice and Rooster relative to Nong's default size (twice as much chicken -- too much!). \n\nRice and Rooster is reat value if you can eat it all in one sitting or split with another person; not so great if you can't, especially if you won't be getting home anytime soon and have no safe place to store any leftovers. \n\nRice and Rooster, you have a genuinely wonderful Khao Man Gai. The chicken is super tender; the sauce is incredibly flavorful, but can you please offer a more affordable, smaller portioned option? Please, please? Pretty please, with a cherry on top?\n\nI would be everlastingly grateful and visit much more often if you did :D. Otherwise, I will only visit if I have a dining companion willing to split/share, as the default is more than enough for two people. On that note, anyone who complains that the portions are \"too small\" is a dope. They practically dump in half a chicken per order. Almost.", "author": "Maya B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-24", "description": "Order The Original. Boring flavors. They charged two dollars for six pieces of broccoli. The sauce it came with was pretty good. Decent amount of food.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-16", "description": "Decent price but doesn't feel that authentic. Not the biggest fan of the consistency of the rice.", "author": "Alison D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-11", "description": "Really over priced for pretty simple chicken and rice, not unique or flavorful enough to merit the $$$. Do not recommend.", "author": "Brittney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "Really tender chicken.  Good portions.  Broccoli needs to be steamed a little more because it's almost raw.  Sauce should not cost extra if you want more because the chicken doesn't taste good without it.  Otherwise, great place and please add evening hours.", "author": "Apple M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "The service I received at Rooster and Rice from David and Eugene was exceptional. David started off by recommending his favorite - the original, and Eugene HIGHLY recommended me to add an egg. My belly thanks them for it. 10/10 would come back again!", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-27", "description": "The food itself was simple, but very good and healthy. Chicken was moist and the broth was delicious. However, waiting almost 20 minutes for lunch was not ideal. Perhaps it was just the day, but for how basic the menu is, it doesn't make much sense why I would have to wait so long.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Really good chicken and rice that is flavorful, moist, and yummy.  It even makes up for the fact there is really no place to sit.\n\nThe condiments compliment the chicken and vegetables and bring out even more umami-goodness which is fantastic.\n\nThe price is a little on the high side but I would come here again.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "I ordered The Original near closing time on a Friday. Having missed my lunch during normal hours, I was starving and found the first bite of the chicken to be gratifying. The ginger sauce, the poached egg yolk, and the well-brined chicken breast with skin, topped with a few drips of habanero sauce, made for an amazing combination. Within 10 minutes, I had finished everything and washed down the food with the chicken broth, leaving me feeling very happy about the meal.", "author": "Hank F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Great concept and spot for those longing for a chicken and rice meal similar to what you might find in a hawker market. You pay a premium and the chicken was a bit dry.", "author": "Aaron V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Yup. It's good. I got the original, but next time I think I'll try the paleo as there was a LOT of rice in the original. It's not cheap but the portions are huge and it can easily be split between two. It would be great if they offered a half order.", "author": "El B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "It's kind of pricey for just \"chicken and rice\", but they make it super delicious and healthy. The chicken is juicy and the jasmine rice is really nice. The sauce brings it all together really well.", "author": "Tan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Food is so yummy here! Chicken is super tender and the sauce makes a heavenly combo by adding the perfect flavor. The place is quite small but there's ample seating outside. They also have some additional bomb sauces you can add including a Thai chili sauce and mango habanero sauce. Not to mention they have super friendly workers and great service. Eugene was our cashier and he was really helpful in explaining the items and he's also super cute! Would definitely come back.", "author": "Y C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-08", "description": "This review is strictly for the vegetarians, because I desperately wanted to love this place despite all the red flags, i.e. the restaurant name and logo, that this place was not intended for our kind.  They were so nice, and the aesthetic is awesome, and the people outside munching on their chicken seemed so happy. But. There is no amount of special sauce and veggie broth in the world that can make a box of lukewarm, unseasoned tofu and steamed broccoli into a delicious treat for me :(", "author": "saru k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Was recommend by a co-worker.  I liked my lunch today, the original with extra cucumbers.  The line is out the door and the space is packed with people waiting for their order.  The flavors of the sauce was amazing.  Wish I had more of it though.", "author": "Mello M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-20", "description": "The food is really good, comfort food type stuff. When I first ordered, I was given the wrong meal, but the dude was really gracious about it when I told them. I'm gonna miss this when I don't work in the city anymore but I definitely recommend.", "author": "Prags S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-02", "description": "This is probably the closest thing to hainan chicken if that's what you're looking for. The place is small, limited seating and a few tables outside. Only a few choices to choose from. Meals come with rice, chicken, broth and their special dipping sauce for the chicken. The amount of chicken I got was not a lot for the price I paid but then again it's SF...And my chicken was chopped up in tiny bits, I think it might have been the leftovers from previous chicken. I wasn't completely full afterwards and the taste of the chicken was bland without the sauce. Extra sauce is 1$z I wouldn't come here again unless friends want try it.", "author": "Vicky C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Second location, original is in the Marina.  Happy to have this addition to the SoMa area.  Go-to healthy, nutritious comfort food. Tender, well-prepared Thai Chicken Rice with a few variations including skinless, vegetables instead of rice, etc.  Sauce is fantastic (get extra) and the broth is a tasty way to wash it down.", "author": "J M."}
