{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "When I moved to SF, I snagged me a local. Therefore, RT has become apart of our Sunday Night Ritual.\n\nThanks for the filled drawer I have full of Parmesan cheese & red pepper packets, and don't stop bringing paper plates either. Sundays mean I'm lazy.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "I ordered for delivery today 10/6/18.  Same order I always get.  First time ever it was late.....called after hour and a half said it was on its way.  17 min later it arrives.  I thank the driver and open the box and the pizza is soggy and the bottom of the box is all wet.  Pizza was icky crust was totally soggy.  Called the store and spoke to the RUDEST WOMEN who told me it was because of the pineapple.  I assured her that it wasnt because I get it all the time and its definitely NOT the pineapple.  She was arguing about the pineapple, I tried to explain it was the crust and the bottom of the box that was wet and bowing because it was so wet and heavy.  I asked for a refund because she said her driver had already gone home.  Said NO REFUND but offered 25% off next time.  UM, NO.  She kept repeating OK, OK...like somehow her repeating this was gonna make me feel OK.  I told her I was NOT OK.  She said it was the pineapple AGAIN!!!  I repeated no it wasnt and Im not OK I need a refund please.  She hung up on ME!!!!!!!  NEVER NEVER EVER AGAIN!!!!!  IT WAS LIKE THE WHOLE BOX WAS STEAMED FROM UNDERNEATH!!!  Im calling again tomorrow to speak to someone else.....ALSO, when I came on Yelp I saw the WARNING for this place!!  I threw up in my mouth a little!!!! EWWWWW!!!", "author": "Holly D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-09", "description": "No surprise here. This place is trash. Low quality food. I ordered a pizza sandwich, which they half assed cut, which was the least of my worries. It was DRY, barely any sauce, the cheese was already hard, not even warm. My girlfriend called to get a refund and they said she could only get 25% off her next order. BS!!!! NO! I would never order here again so that offer is invalid! I called back very aggressively and they refunded the money right away. Smh. They were gonna take advantage of someone who was nice, even after they provided trashy service smh. Round table is one of my favorite pizza places, but this location needs to get their act together.", "author": "Melly C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-29", "description": "Today Friday June 29 and time is 10.30 This business is closed at yelp business hours for this location is 12.30 this is their respect to their patrons they are not reliable they do not deserve any star unfortunately I can not give them ZERO STAR", "author": "Ihsan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "That pizza was terrible I discovered a roach leg in my pizza upon further discovery I found the other end of the roach at the other end of the pizza when I called to complain to the manager she said I was lying in making stuff up I took pictures and show in emailed it to the email address she gave me which turned around to be bogus I called again asking for my money back and the corporate affirmation she refused to give it to me I will be going to health board ASAP", "author": "D'Angelo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "Came in here starving after a long drive to San Fran. Place is trash and whoever works the cash register is an absolute ass. Guy bussing tables/making pizzas was nice though. Probably wouldn't mind if this place never opened again.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-08", "description": "I ordered online saying it will be fufilled at 7:45,  when I called to check the status since I was confused by that everytime they put me on hold and they would send a driver before that time which was at 7pm and he still is not here. They don't offer discounts for me waiting 1hr after they said they would send a driver. Never order from them again!!!! I order 2x from them before and never issues but now. I would give it  0 star if I can", "author": "Leighann M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-29", "description": "This location has the worst delivery drivers ever! I have tried out weighting the cons but they really suck. Not only do you not get your food on time but when it's delivered it's freezing cold. I always tip $6+ dollars regardless of the service but for some reason the drivers feel entitled to much more although the experience is always horrible. If you are looking to order pizza then try other places that are much cheaper, have great service, and can have your order to your doorstep within a reasonable time frame.", "author": "Unique U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "Probably the worst Round Table location, surprised it's still open. Tried to stop by to see if things were changing and they did, apparently for the worse, found a bug in my food and multiple hairs", "author": "E.G. O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "I love round table, i mean who doesn't? But my experience today was horrible, I ordered an extra large pizza which cost me about 30 something, i was really exited to eat it, the guy delivers it to me, i go home; the first slice was really good, but the second one i took a bite off my raw, the crust wasn't even cooked and the dough was still mushy, i called to get a refund and they said i should of called the exact time the incident happened and they can give me a '5 dollar discount', they refused to give me my money back. im honestly never ordering from this location again.", "author": "Victoria H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-14", "description": "OMG!!! \n\nSo I ordered a personal pizza and a half dozen wings (MILD!!!). Placing the order was fine, the delivery was fine - delivery guy was super nice. I get the food inside and start with the pizza. I then get to the wings and after the first wing I notice it was really spicy. I tasted the sauce and it was HOT. I called to let them know that they sent me spicy wings instead of mild and the staff members reaction was \"...And?\"\n\nI again stated my order and then he says \"Oh, yeah, we are getting complaints about the mild wing since corporate change the sauce to something a little spicier, but their mild\". \n\nI told him that I have eaten there on many occasions and have had their spicy wings so I know what I am eating. He goes on to say that the wings are maybe too spicy for me, but that is not really a \"them\" issue. \n\nAfter some more awkward and frustrating back and forth, he says he will send someone to pick up the wings and give me store credit ... he said that was all he could do. I said \"okay\", but then he hangs up in my face before all of it could be sorted out. \n\nI sat for a second and thought about just letting go and cutting my losses, but then I spent way too much money for this and I can't eat everything!! So I called corporate and made a complaint through them and asked them for a refund. They are sending in my request to upper management and stated that someone will reach out to me. This is still in progress so we will see how it ends.\n\nThe only redeeming thing about this whole experience is how nice the rep from corporate was ... fingers crossed, I hope I get my money back.\n\nIf this place is shitty to you, please call corporate, hold them accountable!!!", "author": "Jane D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Very good service. Had a coupon for a free one topping personal pizza with any purchase. Lady at the register suggested if I didn't want to spend much I could add a topping. I wanted twists but I appreciated the advice. Food was fast, hot, and fresh.", "author": "Arun B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-26", "description": "Rudest service ever.   Wanted to arrange weekly business order worth $100.00 per week.  Told to ask for Amir, who's apparently there... next to never,  or so I'm told by \"Diego\".  He (allegedly) wrote down my name and number but when I called back for Amir second time, the message was either lost or didn't exist.  Claims he passed it along.   And yet, still no call from Amir.  Diego suggests, \"maybe Amir doesn't want to speak with you\".    Seriously?\n\nI love RT pepperoni pizzas (since I was a kid) and hot sandwiches.  Alas, I believe there must be another pizza joint in San Francisco.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "I love this place, their pizza combos are delicious and their customer service is stellar. Will be back. Thanks Round Table!", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "I miss exactly two things about the West Coast. \n\n1. In-n-Out\n2. Round Table pizza. \n\nAin't nothing fancy, though I'm sure they can do that. If you're looking for foofoo, exotic ingredients, hipster sweat, etc. Round Table probably isn't for you. If you're looking for an exceptional pepperoni pizza, walk right in.\n\nGarlic twists, get 'em.\n\nNow, location, well it's Van Ness, so it's a mixed bag, but I've eaten in worse. It's pretty good sized, and during my lunch only two homeless/unbalanced folks came in.\n\nThe place was clean, the staff was as nice as can be expected.", "author": "john W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "Came in today for some lunch.. but didn't know what I wanted right off the bat ... as I'm looking at the menu I asked the guy if they had a restroom? He said yes. But you have to buy something first ... wtf how rude is that?? Mind you I'm pregnant what a fuckin dick I will never come to this location again..", "author": "Angel R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-14", "description": "Today was not my first time being a customer here. I literally work around the corner. I placed a delivery order online and I ordered a Large pizza for 35$ and there were certain ingredients i wanted, so i wrote it in the notes. I called when they opened to verify if my order was correct and to ask if they can bring paper plates and peppers and cheese to. The worker who answered the phone verified my pizza and it didnt have what I ordered and paid xtra for  So I asked them to please make sure they read the notes on how i want my pizza and the cashier or whoever answered the phone stated that they dont read the notes  I am very upset because I spend my hard working money & I expect my order to be 100% accurate. I am very disappointed that they had such horrible customer service today because Round Tables pizza is one of my favorite pizza joints. They dont accommodate customers satisfactions or orders. They are rude & they just robbed me for 35$.", "author": "Patricia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "Poor service.  Can't trust them at van ness.  Spent fifteen minutes placing the ordering and repeating it several times.  The guy rushes me off the phone and hangs up.  I call back an hour later and he lies saying he \"tried to call me back\" and instead he NEVER placed the order because he hung up before I could say cash or credit.  I was and am always polite with round table.  It's the best pizza.  Just annoying because I just got off the plane from 10 hours of crap travel and I wanted a half cheese / half pep + 6 twists.  Round table you will never lose my business.  This location sucks tho.", "author": "Hague D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-01", "description": "Terrible service. Employee put me on hold for 20 minutes just tell me they were closed 25 minutes before they were actually set to close. I'd rather get something cheaper and more reliable.", "author": "Ron C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "I love Round Table Pizza's pizza. In a city of food snobs, I will DEFEND Round Table Pizza, because I think it's delicious (shut up, you don't know me).\n\nI ordered online at 5:12, with a quoted delivery time of 6:12.  At 7:12, there was still no pizza, so I called.\n\nI live in an apartment building where you scroll through the directory, push a button, and I buzz you into the building.  When I called Round Table, they said the driver tried to call my phone number, and it was disconnected so he left. I asked why they were calling if they didn't need my phone number to get into the building, and the man said it was to make sure he could contact me.\n\nWhat?  That....doesn't make sense.  Try to get buzzed in, and hey look!...contact.\n\nPointed out how ridiculous that was, and he said the driver needed to make sure I was there.  Uh, then try to get into the building.\n\nThe person on the phone said it was my fault for having the wrong number.  I looked at my account online and pointed out that my phone number was correct.  His answer was just, \"No, it's not, it's not connected.\"  Looking at it RIGHT now, man.  CALLING you from that phone number.  He then said what phone number they had, which wasn't correct.\n\nI asked if they had some kind of synching problem between their web based ordering and the actual restaurant, and he told me to contact corporate with complaints, because they don't internet.\n\nYou....are a restaurant in San Francisco.  Bro, you need to be able to internet here.  Come on.\n\nHe ended with, \"This is not our fault,\" and asked if I wanted to cancel my order. \n\nSo I waited 2 hours, never got my pizza, was told it was my fault.\n\nI'm going to assume that this was the Universe's way of telling me to have a salad instead.\nThe worst.  You don't win friends with salad.", "author": "Naoko M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "This Round Table Pizza is the worst I ever used.\nThe worker \"Diego\" was taking  phone order told me to hurry up it had been 15 min. he was on line with me. I was on my cell and I looked it was 4 min. which 1 min. he had put me on hold.\nI had ordered $104.00 worth of food\n1)King Arthur Supreme XL\n2) Half  Cheese & Half pepperoni and olive XL\n3) 12 hot wings\n4)  Garlic twisty bread 6piece\n5) Garden Salad\n\nThey Charged my card & Never delivered. I called back & they say they have no record, Diego is not there and theres NO Manager.\nI got ripped of or they are pulling a Scam.\nI will be going into store tomorrow with copy of my Bank Statement", "author": "Eric C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "First time at this location. \n\nTheir crust tastes like nothing. fluffy undercooked and nothing. they have no sauce on their pizza. i ordered an original with ham onion and jalapeño .  there was a greasy film covering and no sauce at all. \n\nnot like any other round table location i have been to.", "author": "Dean N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "I love Round Table pizza. The delivery received 2 days ago (through Eatery) was beyond disgusting. I've been sick for 2 days having had this awful excuse for food. Never ever again. \n\nRound Table, are you going to include any level of quality control??\n\nZero stars if I could.  \n\nP.S. - I called them to discuss the food poisoning and they didn't respond.  Yelp, I would consider not providing delivery options from this specific location going forward.  It tarnishes your brand as well.", "author": "Nikki G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-15", "description": "Ugh. Just UGH. Never again.", "author": "Shereen A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-04", "description": "if i could give this place zero stars i would!! this ignorant ass place including the bone head ass driver hadi this man needed an ink pen for me to sign off for the food ($58) i went to get a pen and his punkass took the pizza out of my hand. i told him to keep the fucking pizza and that they have bad customer service skills. then the manager calls me some female and tried to apologize for their bull shit! fuck yall i'd be damned to spend that type of money with yall late asses stupid  you will never get a damn penny from me! i don't know about that management but dont fuck with them period!!!!", "author": "SHRONDA J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-01", "description": "Very rude customer service I ordered 3 For large  pizza online and I call to confirm the order she hung up on me, not once but twice,  couldn't believe she said she was the manager and that's how she acts so unprofessional", "author": "Isaac Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "This review is for their delivery. We ordered a medium King Arthur's Supreme without onions, and added anchovies. The size was perfect (and even a bit much) for three people. The lady over the phone made sure to inform me that anchovies would cost an additional $2.99, which is a huge plus as many pizza places just charge without informing their customers first. They quoted 50 minutes, but our order arrived in around 30 minutes. The pizza was hot and crispy when it arrived. Also, they remembered to bring napkins and paper plates like I asked. I'll be sure to order from this location again!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-15", "description": "This is a franchise operation.  I didn't expect the best of the best by all means, but I went for what I thought would be an easy and reliable option.\n\nFirst, I ordered online and was quoted a time of 45 minutes.  Order went through without issue.  Even received an instantaneous email confirmation further noting the 45 minute delivery window.  Great.  It's a Friday night at a reasonable time.  Not bad.\n\n45 minutes came and went.\nAt the hour mark I checked to make sure I had the time right.\nAt 70 minutes I decided to call the location.\n\nI explained to the gentleman who answered the phone that I was calling about my order that was late.  After giving him the address he said its on its way.  When I again brought up that it was supposed to be here in 45 minutes and now its well over that and asked what he was going to do to make it right, he simply said we're busy, your pizza will be there soon so that's it.  I told him I was quoted 45 minutes and he said well its an hour and half and the online system isn't right but whatever.\n\nI then asked to speak to the manager.  I got John.  The franchise owner.  Not even remotely better.  When I explained the situation that my order was late and I was calling and not pleased and expected him to make it right.  He used the exact same approach --- they were busy so what did I expect.  After a heated back and forth I explained to him as an manager and likely an owner I would have expected him first and foremost to apologize and then take it from there.\n\nTERRIBLE service which is just completely unacceptable when you are going to end up with what you know is mediocre food anyway that you ordered just out of convenience.  Avoid these guys.  There are way better options, like a Dominos or Pizza Hut... and that's not something I thought I would ever say.  OUCH.", "author": "Jake W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Always been a big fan of round table and this location is no exception.  It's more expensive than your average pizza joint, but you get what you pay for.  Toppings, sauce, and crust are all excellent. \n\nThey've got an special that I ordered online for pickup - $19 for a large Maui Zaui with bacon.", "author": "Rushil R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "My husband ordered pizza from here.They didn't show up 2.5hours...\nWe called them few time to make sure,they said it should be there in any time. \nThe pizza finally arrived was cold. So we complained about that and didn't take the cold pizza.\nThen they said we can have a free pizza for next time. Well... the next time came, we explained what happen at last time and about the free pizza. They said we already used the offer up.Really???When???\n I don't wanna waste time with them anymore.", "author": "Keiko W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": ".....oh my the rage... this company is racist. Or maybe just the chefs i came in and they saw me with slick smiles and tossed out some racial slurs about me. It was very hurtful. I just came in for some pizza.", "author": "Abigail S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-18", "description": "I've ordered from here twice while on business in the area. The second time disappointed me. I tend to go simple with just a cheese pizza. I also ordered Garlic Bread and paid extra for cheese and marinara sauce. In my experience you usually get one thing of sauce automatically, but sometimes you don't. That is not a big deal. My order arrives right about on time with the estimate, maybe 3-4 minutes early. I have my pizza, but the garlic bread has no cheese and the sauce looks like ranch or something. If I have to pay extra for it I definitely want it. It wasn't as if I called in the order. I actually ordered online (not through Yelp though). Now I have to wait for them to remake the cheese garlic bread and return. I am very particular about how I eat things and in what order. Now it is either eat out of order, or eat cold food.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "I have always loved Round Table, but its more for when I'm in a small town, not SF. Anyways NFL game day is here and were eating pizza.  I was a little worried after reading these reviews, but ordered anyway, since I think people don't bother with reviews unless they have some sort of gripe.\n    Anyways I was quoted 50 minutes, but guess what!?  It was here in 30 and Im all the way in the mission.  Everything was exactly what I had ordered, and was super fresh.  I'm so happy with my order right now, I don't know what else to say.  Oh, the dude on the phone and the driver were both super nice.", "author": "California B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-13", "description": "1) Tried to cancel order almost immediately after placing it online: \"I can cancel the order but you won't get a refund.\"\n2) Time Estimate was 1 hour...got it 2 hours later! This place is less than 2 miles from me.\n3) The delivery guy cannot speak English so forget about communicating with them.\n4) And that's probably why he delivered it to the wrong address.\n5) Got my crust wrong.\n6) Cold pizza.", "author": "Mitchsweets D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-06", "description": "They recently raised their already high salad bar prices to 9.99 for the one-trip salad! Not worth it. The veggies are clearly not of the $9.99 quality, tis a crime to pay for that- and I'm no cheapo! I'll pay ten bucks for a salad if it's delicious! \nAlso the service is meh. I worked for 7 years in the restaurant industry and I know a lil something about service. It's highly uncomfortable to see the employees yelling at each other. I witnessed what looked like the owner/manager yelling at this poor girl to hurry up making a salad that looked like it was for a late delivery. \nThe ladies that work here are all super nice though.", "author": "Tina Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "I have had a horrible experience at this location. I ordered a pizza on Sunday at 10pm-1030pm online and the website says that they close at 11pm. After my orrder was placed I was advised that they are no longer taking orders. I asked for a refund and the person over the phone says that the issued it on the spot. I have called to speak to a manager every day since Sunday (it's now friday) and the manager Diego says that I did not call \"at the right time\" for him to handle this transaction. He is advising me to wait another week to two weeks for this to be handled. I did not know that for me to get a refund of almost $40 required me the customer to call at the EXACT moment that he says to call. This manager did not care about me the customer not receiving his product or my refund. THIS IS BAD CUSTOMER SERVICE. I have spent hundreds of dollars at this same location and for a \"manager\" not to care or value this is sad. If this is acceptable for a manager to treat their customers like this it says a lot about the company. I'm extremely disappointed!!!!!!", "author": "Nikki C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-30", "description": "This location needs to be shut down. The most horrible service and every delivery is at 15 minutes late plus missing an item. Not to mention the most rude people answering the phones.", "author": "Bennett S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "Don't order here if you are paying with credit card. They make a practice of imprinting your card on the receipt which opens you up to Identity theft. Also, it's illegal.  \n\nhttp://www.ncsl.org/research/financial-services-and-commerce/credit-card-numbers-on-receipts-legislation.aspx", "author": "Keith G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-06", "description": "About a month ago when I ordered pizza from here for the first and last time I wound up waiting  over an hour and a half for it to arrive.  When I ordered I was told  the pizza that it would be a 45 minute - 1 hour wait depending on traffic. After waiting for an hour and twenty minutes I called them and they said that it had just been sent out.  Are you KIDDING me? Why didn't they call me to let me know that it was running late?\n\nI was obviously upset and explained to them that I was babysitting and it was going to be the kid's bedtime soon and that I couldn't wait another 30 minutes for the pizza to arrive. They weren't very apologetic and when I asked to speak to the manager, after how they acted like they didn't even care that they were late, I was told there wasn't any manager on duty. Since when does a place NOT have a manager on duty??\n \nThey finally offered me a $2 discount for my wait- for a $25 or so pizza. It just added insult to injury...I am never ordering pizza from this location ever again.  Finally when the pizza does arrive, which actually wasn't that long after I got off the phone, it was burnt. Yep- waited over and hour and a half for a burnt pizza. The guy who delivered the pizza was nice though and did genuinely apoligize for being late. \n\nI have always had a wonderful experience with their Geary location, and I wish I could say the same about the Van Ness location...", "author": "Apryl S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "AHHHHH I forgot to check Yelp again before I ordered .... darn darn darn.\n\nThis place sucks and rips you off.\n\n1. In general I love the Round Table Chicken Garlic Supreme. Ordered one to share with my wife with Extra cheese. Got almost no cheese, but did get charged for it of course. So they ripped me off.\n\n2. Pizza arrived super late and super cold. Again rip off and bad service.\n\nAvoid ordering from this bad business and remember to check your yelp!  AHHHH!", "author": "Jason H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-05", "description": "As other reviewers mentioned below, should've checked Yelp before ordering from this place! Ordered on Seamless for 45-60 minutes, after calling twice they show up after 90 minutes, and the pizza is missing! Called a 3rd time, the guy didn't seem to understand what I was saying and I was still not given a time.\n\nHow do you run a pizza restaurant and forget to deliver the pizza?!", "author": "Jason N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-23", "description": "I walked in at dinner time, the place was deserted.  The man at the counter just stood there for a while, doing something behind the counter.  I waited for a while before approaching and placing an order:\n\nMe: I'll take a vegetarian personal pizza and a diet coke please\n\nHim: (continues tinkering behind the counter) A personal....A personal....\n\nMe: Yes, a personal pizza and a diet coke please\n\nHim: (mumbles) a personal.....A personal...\n\nME: Yes, and a diet coke please.\n\nHim: (practically screams at me) A PERSONAL WHAT???!!!\n\nMe: A vegetarian personal pizza and a diet coke (I had already said that, he was just not paying attention to me)\n\nHim: (Acts all put upon and continues puttering at the cash register)\n\nMe: (He doesn't give me a total. I wonder if I should just wait there until he is done)  If you are busy I'll just come back....(I walked out)\n\n\nSeriously.  If you are too busy to serve customers, close your doors.  If you didn't hear my order, say that. Use your words. I'll give you some acceptable examples:\n\n- Greetings. Give me a minute please. OK, what can I get for you?\n\n- Can you repeat your order please?\n\n- Sorry, I didn't get that. \n\n- What was your selection, again?\n\n- Can you say that again? \n\n- Can you repeat your order?\n\n- Sorry, I didn't see you there. What can I get for you?\n\n- Let me repeat this back to you....It was a personal pizza, what kind?\n\n-  I was in the middle of something, sorry I didn't mean to ignore you. I'm grumpy and cranky and underpaid and I can't figure out how to balance this cash register. I don't meant to take it out on you.  Can you please repeat your order? I didn't get that.  \n\n\nWe are all human and have bad days, but NEVER YELL AT A CUSTOMER, specially if there is no reason for it.", "author": "Raul A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "Typical round table pizza, bacon pizza was a little greasy but expected. Soda machine tasted like a mix of soda and city water, not the greatest just could of been low on syrup.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Today I stayed home from work not feeling well and ordered food from this Round Table location.  The food was fresh, hot, and delivered by a wonderful gentleman.", "author": "Tess C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-05", "description": "For my birthday, my friends had ordered pizzas that were scheduled to come at 11:45.  It is 1:30, and my friends are staying with me even though the pizzas have not come and they all came from the downtown area to have lunch with me.  What does round table do but give me a measly discount (15%)  There is no one to eat the pizza but me when it is finally delivered.  and the whole scene is just depressing.  So I gave the pizza to the people on the streets.\n\nI will never, ever come here, there is something terribly unethical and disgusting about what happened.  I hope you guys shut down.", "author": "Derek C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Yesterday we ordered a medium gourmet veggie\nCaesar salad\nGarlic bread with cheese\nThe pizza was thick and creamy tasting\nThe veggie salad had alot of mozzarella and croutons \nAnd the bread was too oily and crunchy \nI usually get the breadsticks but ivwanted to try something different \nWe ordered for delivery it came fadt with a friendly driver and the total was just under \n$40", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-03", "description": "HORRIBLE. Stay away from this arm pit disgusting location. I've ordered from round table for over 30 years and this location is by far the worst experience from any delivery pizza I've had in my life. \n\nFirst when calling the call handler hung up. I called back and the extremely broken English second person couldn't get my order right. It took literally 10 minutes to place an order after being put on hold and having to spell everything out. Thought we were good at this point. \n\nPizza arrives completely wrong and when calling to ask to correct they don't. Manager calls back and is rude and cuts off the conversation and tells me I'm wrong. Feels like a mafia slum lord type of business. I give  negative 5 stars because this is overall HORRIBLE. Stay away and save your money.", "author": "Mike B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "The best round table pizza I've ever been to! Very clean and everything tastes so fresh! The manager was so sweet and accommodating! I was a bit shocked for poor ratings... I highly recommend! Chicken garlic is the best pizza with the BBQ chicken boneless wings!", "author": "G A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-27", "description": "...Ok the food was good just like most of the Round Table, but I just spent over $40 an a pizza and had to pay extra $3 for 3oz of ranch!!!! That is clearly not enough ranch! BYOR(BRING YOUR OWN RANCH) walgreens is across the street.", "author": "Vikash K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "Great pizza.  Service can use some help though. I come here atleast once a week and the quality and taste is consistently good.", "author": "David S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-13", "description": "You guys are consistently NOT consistent with your pizzas. I order veggie and/or pineapple from you guys -- some times the veggie has tons of veggies and the pineapple has tons of pineapple. Other times there are literally 4 pieces of green pepper and onion and 6 pieces of pineapple (half/half) on a medium pizza. When the latter happens it's almost shocking...how does your pizza maker see half pineapple and put SIX pieces of pineapple?! It's basically a cheese pizza. You're almost never friendly when I call either. Get it together.", "author": "L O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-01", "description": "I love the pizza here and the salad bar. Today was the first time I ordered delivery instead of eating at the restaurant. I used their website and purchased a pizza and garlic twists at 9:01pm. I quickly received an email saying it will arrive at 10:01pm at the latest. It's now 10:43 and I haven't received my order. I called once but was quickly dismissed saying it's in transit and they're about to close. Calling back tomorrow when they open to get a refund.", "author": "Ryan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-27", "description": "Two hours later I'm still waiting on my pizza. Lesson learned. Never again round table.", "author": "Alexandra B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-15", "description": "I will never order from this location again.me and me girlfriend ordered a medium pizza, they said it would be done in an hour. After an hour and forty five minutes we called to check the status. The rude general manager answers the phone and says we called your location and a guy answered the phone. With me and my girlfriend knowing there was a mistake with the number, instead of owning up became very nasty and rude. These guys are terrible. Way to talk to a pregnant woman you jerk. To bad I can't give you 0 stars", "author": "Dante T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-28", "description": "Edit: I should have known that once I left a positive review their service / food would go to hell. The last 5 times we have not gotten what we've paid for - it's either missing toppings (normally the linguica is non-existant from the pizza) or it's a swimming pool of pizza sauce. I have ALWAYS stated LIGHT sauce yet, I get the entire can. There is a reason I state LIGHT sauce 1) I don't like much tomato sauce and 2) I'm allergic to tomato sauce. When it's light tomato sauce I can muddle through the stomach burning and mild hives but, a pizza bleeding tomato sauce is just money I've thrown away because I can't eat it. I'm over ordering out and I'm over this place - can't seem to ever get anything right or follow directions. What's the point of telling them how I want something I am paying for if they are just going to do whatever they want anyways. Must be nice to make so much money that you can just throw away dedicated customers like they were trash. Really wish I could post pictures of the disaster I just threw away but, there are no options for posting pics. ~sigh~\n\nI'm really surprised by the reviews and to be mary (you can be frank), I usually wait until after 3 - 4 visits first before writing a review - you know, just in case the first time was a \"fluke of excellence\". \n\nI tend to be a little intimidated by eateries with bright lights (I prefer ambient) but, I walked in with my roommate and Cyrus greeted us with a big happy smile and took our order. My first reaction was, \"Wow! He's in a good mood!\" which is more than I could say when I worked food service. He very happily took our order and while doing so, I was my typical observant self and noticed the place was very clean and it appeared everyone was working (despite how slow it was that night). \n\nIt was indeed, quite slow that night, there were only 2 other tables taken. The T.V. wasn't blaring loud and this is the one place I actually approve of a television - television and pizza just go together. We honestly didn't wait very long when the pizza arrived at our table and was cooked EXACTLY the way we like it - crispy pepperoni, stringy cheese...... Ohhhh, I couldn't stop eating but,  if I hadn't I would have leaked all the way home not to mention, I still had to get through my salad. Speaking of which, their salad bar was awesome! All the vegies were fresh and crisp though, I really wish they had a few more items, one being red beans.\n\nThe girl who brought our pizza to the table was incredibly nice and had a smile on her face. Good and friendly service is important to me and I base my gratuities on such - not a percentage. My gratuities are usually much higher than the percentage and I always tip at the end of my meal to ensure the entire experience was pleasant. I was really surprised that Cyrus was surprised when I tossed a few bucks in the tip jar. Don't people tip anymore for service? \n\nOverall, this was a very pleasant experience, the place was clean (though there were several stacks of pizza boxes in the back area which indicated that they were often busy), the dining booths were large (big ++) and the atmosphere was pleasant. My only regret was not sitting closer to the TV while I enjoyed my crisp salad and delicious pizza.\n\nOh! And to the corporate peoples - SERVE BUFFET! IT IS VAN NESS AFTER ALL! HELLO?!? LOTS OF FOOT TRAFFIC!\n\nUPDATE (11/29/16): These people haven't gotten any better - still completely and totally incompetent. Ordered a pizza with NO SAUCE because of tomato allergy. Ended up eating 95% of the pizza and discovered THERE WAS TOMATO SAUCE ON IT! You people trying to kill your customers?! Done and over with these people - so much for forgiveness and second chances! Geez, food has really gone DOWN HILL in San Francisco!", "author": "Jamilah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "This isn't the best pizza, but it's all about the King Arthur Supreme!!  \n\nThe best thing is it always taste the same!!", "author": "Jon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "I had nice quiet dinner date with my husband and when I got her they made my meals fast and was very friendly to me. The food is decent and the pizza they made for me deep dish was a lot better then the other round tables I have been in.", "author": "Franny A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-25", "description": "I Wish I could give this location 0 stars because it is the WORST. It is a shame because I love Round table pizza and it is the only location that will deliver to my address. The pizza is always under cooked even if I give specific requests to pl,ease cook well done. The main complaint I have is the TERRIBLEST, RUDEST customer service. The mexican lady who took my order without any indication whats so ever actually hung up on me when I began to  describe my order.  All I wanted was a medium pizza half with tomato half with pineapple and she hung up. I thought it might have been an accident and I called back, when I told her she hung up she said she hung up on me because I was confusing her and she was busy. it made me so mad!", "author": "Crystal E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "Not sure why it has such bad ratings. When I want round table I order from here because I get classic round table. Of course it does not look like it does in the commercials. Who even writes that?  It's good though and they take care of their customers.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-15", "description": "If i got chance i'd give less than 1 star. Worst round table i'v ever seen. Rude staff( got wrong order and blamed me). This place sucks. Karla(cashier) was so rude.", "author": "Valid H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-23", "description": "What's with this place and the delivery service????\n\nNo star if possible!!! SAVE YOUR MONEY. This place is horrible which is such a shame because the pizza is so great. Maybe if you chose to pick up your pizza you \"might\" have an ok experience. \n\nEverytime I order from here (3 times total) the delivery has taken almost 2 hours. Last Monday I ordered online was told the delivery would take 45 minutes it was 8:30PM at the time. \n\nBy 10:00 the pizza had still not arrived. I called to cancel my order, they let me know the driver had left 30 minutes prior so that would have been 9:30PM. I told them I no longer wanted the pizza and to please cancel. My card had already been charged so they said it would take 3 days to show the credit. After telling them 3 separate times I no longer wanted the order they finally said \"ok let me call the driver and tell him you cancelled\" ok fine I thought all was done.\n\nAt 10:45PM my doorbell rings....pizza delivery. We tell him we cancelled the order and look outside to see the delivery guy also brought his 4 friends with him in the car! He and his 4 friends have been driving around with my order for over an hour....well that sounds YUMMY! NOT!!! \n\nSAVE YOUR MONEY!!!", "author": "Crissie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "Great pizza. Terrible service. Pizza took an hour and ten minutes. And it was wrong. Refused to redeliver, then tried to offer a small discount instead of refund the purchase. I'm done. No more good Round Tables within ordering distance from us. The company should shut this place down.", "author": "Jimmy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "One of the worst experiences I've ever had with a pizza delivery.  Ordered the artisan pizza(advertised on TV/online, fresh mozzarella,  red onion, pepperoni,  and basil) when it arrived (45min wait) all the pizza had was pepperoni,  sausage,  and cheese.  Called the location,  when the man repeatedly yelled at me saying the pizza was made correctly then kept hanging up on me.  Needless to say. .. don't order from here.  Terrible customer service.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-26", "description": "I worked for Round Table as a kid and loved it!  But now I am afraid of their delivery driver who makes illegal u-turns, we so do so many others, but he does it into traffic and I watch as he tried to u-turn and cut in front of a Muni bus.  Your pizza is good but not worth killing someone in your car.  Slow down Jack.", "author": "Pete W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "It's pizza alright but not quite.  Don't know what it is, maybe it's been commercially oven, taste kind of plastic.  The prices are way up there.  They have a pix of the guy who started it all back in the day.  I think he had a philosophy but it probably doesn't apply anymore.  Their staff is always changing, guess nobody wants to work here.", "author": "BanBan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-12", "description": "Wow I'm not surprised to see so many 1 and 2 star reviews for this Round Table. They DO overcharge! Albeit my overcharge was $0.10 but still I'm not surprise to read that it happened to others. I ordered the #4 lunch combo today (salad bar, 3 twists, and a drink) $8.29 posted price. My receipt says $8.39... I'm not a stickler about the $ but moreso the principle. This one star review is more for the one-trip salad bar policy... the Round Tables I've been to in the past have two options: a single trip salad bar for a reasonable price around $5-6 and an unlimited salad bar for $8-10. Granted it is SF but still THE PRINCIPLE!!!! Plus I felt like the guy, whom I assume is either the manager or owner, was watching me like a hawk making sure I only go once. Maybe it's all in my head, but I felt very discriminated... not on race, sex, age, or any of the usual stuff but just for being a patron.\n\nOh almost forgot... California has a consumers rights law that says all establishments must honor the price marked/advertised. If they don't, they can be fined. (Resource: http://www.dca.ca.gov/)", "author": "Stephen Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Best pizza around. Also fresh and hot when they deliver. It's a chain pizza place but it beats any chain in the area. The sauce has a nice spice and flavor that goes great with anything.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-09", "description": "Pizza was an hour and a half late. Each time I called they said they were on their way. I even asked the guys name who took the order and he lied, \"uh, rick.\" They seemed not to care about any quality of service.", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-20", "description": "Worst Round Table pizza Ever. \n\nI ordered the triple pepperoni pizza online in the \"specials\" tab - $16.99 for an XL. Honestly, this was the reason we ordered here- they generally are a bit expensive, however their crust and sauces are so good! \n\nTen minutes later, I get a call from them saying that the \"special\" isn't available anymore even though it says it is online and that it will be for the full price of $22.99. Since it showed online at the discount price, I asked if they would honor it that price, it just seemed like the right thing to do. They just said No, in a very unapologetic tone with no further explanation. A little frustrated at this point, I finally agreed to the higher price. She then tells me my new total is $36!! Clearly I questioned this because that math did not add up, and I sat on hold for another 4 min for her to agree that the total was way off. \n\nWe finally got our pizza an hour and a half later and the crust was under-cooked and doughy. The crust thickness was about 2.5\" thick, because they didn't put the sauce and cheese up far enough. To top it off, we ordered a side of red sauce on the side, but they gave us ranch. All in all, the worst round table experience. Don't waste your money.", "author": "Katy D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-14", "description": "bad customer service... hang up on me... they don't deliver on my address but their the closest that's open til 11pm.", "author": "Dexter M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-01", "description": "Sigh....I felt kinda dirty coming here, to be honest. My excuse is, I had a coupon.\n\nYou'd think that chain restaurants tend to offer pretty cookie-cutter experiences, but sometimes that's not the case. Sometimes, they're actually worse.\n\nFirst of all, I was pretty bummed I couldn't add shrimp to my King Arthur Supreme (http://www.yelp.com/biz_photos/sW98jWYHl01r46avD5cUYA?select=saNkgU8TWKgqw2lPyBa2vQ), which is usually a free upgrade, because they \"don't carry shrimp\" here. What? Really? Why? \nSecond of all, I asked for ranch dressing for my pizza and was told it was 50 cents. I could have paid it, but considering I just shelled out $24 for pizza, I felt obligated to respond with a \"hell no\" expression and walk away. Other than that, it was pretty mediocre and just like every other Round Table experience.\nI also noticed that a salad bar lunch with a drink is $9 something - WTF? I'll try and remember that next time I feel like overpaying for iceberg lettuce and fountain drink.\n\nOther things to note...\n- Lots of seating (http://www.yelp.com/biz_photos/sW98jWYHl01r46avD5cUYA?select=_2RnC7dZLJ77oPgn2zavyA)\n- Backrooms in the back\n- Old school arcade games in the back where all the school aged truants hang out\n- Parking is a biotch, but you already knew that\n\nThis review is depressing. Sorry. I promise my other reviews are better! Because I usually don't eat at places that suck.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "I absolutely love Round Table and I've held off on giving this location one star in the past but I just cannot hold off anymore. We order a medium Wombo, 6 garlic twisties, and a 2-liter for delivery. Comes within 45 minutes, but they forgot our 2-liter. I call and she says there was a mix-up (oh really? tell me more, I was unaware) and a new one would be coming in 5-10 minutes (cue Maury \"and the lie detector test determined THAT was a lie\"). Then we notice the ranch is also nowhere to be found for the twisties. I didn't even call back, it'd be a waste of time - had to go to walgreens to get some ranch and by then pizza was cold and 2-liter still not delivered. Long story short, order from a different location or pick another pizza joint. Place is riddled with incompetence.", "author": "David B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-30", "description": "Just like everyone says: delivery is *glacial*. It can take hours for your pizza to arrive, by which time it'll be luke-warm and stale.\n\nIf you call them to ask about it, they'll always just tell you that it's \"on its way\".", "author": "Tyson M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-31", "description": "Stopped over there on my way home out of pure. Starvation and not knowing the neighborhood. Vomit....their pizza is awful I didn't even have the full slice of my mini personal pie, just looking at it I knew it was going to be awful the cheese wasn't even melted and the topping didn't even look appealing...never again and should've yelped before entering", "author": "Danielle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-16", "description": "These are the stupidest basterds on the face of the planet!!!\n\nI called in an order after 1 hour 30 min (30 min late) I called to check in they said it'd be a few minutes\n\ncalled in a 3rd time after 2 hours they said it'd be a minute\n\nthen I called in at 2 hours 10 minutes and these god damn morons said they didn't have my order even though it was the same brain dead dipshit that took the phone order in the first place.\n\nFUCK YOU!", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-22", "description": "I love Round Table Pizza, but this was not the pizza I would expect form Round Table. The delivery was just in time for game 1 of the 2014 World Series, but it looked like they rushed it and it was burnt just a lil and have very skimpy toppings. I would like for them to make it uP, we shall see.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "I told one of the managers about my previous experience and he gave me a 50% discount coupon. Thanks a lot for your apology and your attempt to make things up.", "author": "Rosemarie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-09", "description": "We knew based on the reviews what we were getting into but WOW. Round Table you used to be the BEST back in the day. First of all we order a large half pepperoni and half gourmet veggies with three side of ranch. Total came out to a little over 30 bucks. Seemed extreme but hey we love pizza. What was delivered to our door looked like a medium sized pizza and two side of ranch. It was tiny. I was sorely bummed and we polished off the entire pizza with no guilt since it was no bigger than a medium at best. The next day we both were ridiculously bloated and retaining water which never happens even when we pig out hard on pizza. I am 100% sure they use MSG. Ill just have to hang on to the good times way long ago in the 80's/90's.", "author": "Bri R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-13", "description": "You would think that corporate pizza places would be on top of their business, but this is possibly the worst experience I've ever had with any pizza place. \n\nWorst munchies ever AND willing to wait for pizza delivery. For the love of God, all we wanted was some BBQ chicken pizza, some Maui Zaui and wings. Not too much to ask. About a year goes by and still no pizza. \n\nWe called back so many times they started to screen our calls. So we called back  with a different number and the pizza dude said the best he could do was give us 20% off on our next order. My boyfriend says, \"Well Domino's or Pizza Hut would have comped us the order by now.\" And the guy's response...\"Well, this is Round Table.\"\n\nRound of applause for Round Table, you guys suck.", "author": "Brittany V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-29", "description": "Can I give negative stars?\n\nI ordered a pizza at 6:15. After waiting 2 hours, I called at 8:00 and was told my order never went through. Funny, because I was charged the $26 regardless of whether it \"went through\" or not.\nI called and explained the situation and was offered a $2 discount, but I'd have to pay for my new order and wait for the other charge to be reversed. I'm sorry, but is a $2 discount supposed to appease me? I cancelled the entire thing and ordered pizza hut.\nRemarkably bad service. Very disappointing.", "author": "Kylie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "A guilty pleasure. I take the weekly special route. There is usually a large pizza for ~$17 and that usually gets me through dinner and a few lunches after that. \n\nIt's not fine dining by any means. It is a nice place to sit-in and catch some TV while having dinner.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Geez, 2 stars only? That's pretty harsh. There have been numerous nights when I've speed (sped?) dialed this place to order my usual: a large pepperoni and a large maui zaui. The numerous times I've ordered delivery, the pizzas were consistently on time (within 45-60 minutes), fresh, and tasty. That said, the taste and consistency of this pizza is similar to any Round Table, which I personally find to be the best large chain pizzeria out there (with Pizza Hut coming in at a close second). 5 stars for the consistent level of service and quality!", "author": "Eric C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-14", "description": "I never write reviews but this place deserves another bad one to put into the pile.\n\nThey have horrible communication issues between what customers say on the phone and what they deliver to your door. \n\nDon't expect it to be on-time: it'll be later then they give you and if you call earlier to anticipate this they'll bring a pizza to you as if you had called on time for it. \n\nThey give all the excuses in the book and never any kind of reprieve for the customer.\nI believe they should be very thankful for their location otherwise I'd order from another place.\n\nThink before you order and follow my advice to branch out from Round Table.", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-03", "description": "I used to order from here regularly but in recent months they are not paying attention to specifics of orders and are unwilling or extremely difficult depending on who you speak with to correct their errors or admit fault. As a result I will no longer be ordering from this Roundtable location. I am so disappointed that it's gone this way after being a customer for the last six years.", "author": "Julie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "Too expensive to add veggetables on your pizza, extra meat toppings i understand, but $2.50 to add a couple pieces of onios and $2.50 for mushrooms is ridiculous. Got water and the cups were dirty. Pizza isnt even all that good. Dont think i'll be coming back here.", "author": "Paulina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-05", "description": "Lazy people work here, the place is dirty, they are extremely rude, not very smart, the pizza comes out like my dog made it and they take hours to deliver the pizza. Don't ever order anything from this location. You'll regret it if you do.", "author": "JungHyun H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-13", "description": "I ordered a pizza.  It arrived cold an hour and a half later.  The driver could not even be bothered to bring it to my door.  And note that they charge a $2.50 delivery fee.  He claimed there was nowhere to park.  What a load of bull doodie.\n\nI go down to get the pizza and was asked to sign a credit card receipt that had no line for a signature.  When I asked where to sign it the driver got all pissy with me.  Well excuse me.  I will not bother you or your employer ever again.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-25", "description": "My order never showed up! I don't think this has ever happened to me before. I tried calling to find out what happened but nobody  answered the phones. I'm used to slow and often late delivery but a NO SHOW is a new low.", "author": "Angel P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "Like many others, I had a pizza hankering real bad and have always enjoyed RoundTable. After reading the horrendous reviews though, I was feeling like I made a big mistake. \n\nBut you know what? The pizza was amazing. And I've ordered it many times since. It may be pricey at around $30 for a medium specialty (or is it a large?) but I get at least 4 meals out of it. And it's best cold straight from the fridge. I can't say that about any other pizza. \n\nMy only qualm is one of the delivery guys there, he won't bring the pizza up to my apt by pretending he can't work the security system.  Lame.", "author": "Tony O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-09", "description": "We just bought a pizza tripple pep special and extra cheese.  Although the pizza looked good it was far from it.  There was no extra cheese and very little peperoni also the dough tasted like a cardboard box pizza. I picked this order up and from what I can tell the cooked looked backed up. This is a reflection of the quality in the food, I would like my money back seriously not good at all. Please contact me for a refund and fix the pizza problem this place did not have the taste of a round table at all it tasted like a frozen pizza", "author": "Familia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "I've gone to Round Table Pizza locations for about 30 years. I don't know if they've change the ingredient quality or what but its always been my go to place for great pizza until the last few years. It's just not like it use to be but maybe they'll go back to basics before it's too late.", "author": "Adrienne K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-01", "description": "Had a coupon for Round Table Pizza and decided to call the Van Ness location. Big mistake. The guy who took my order kept trying to loudly talk over me and couldn't understand the numbers I was dictating to him due to the fact that he was talking when he should have been listening. This happened while I was reading my credit card information. \n\nHe took my order, but I felt rushed. Each time I finished a sentence, he would repeat my order thus far, but would forget half of it, I would correct him and he would talk over me again. He told me the total, which sounded good: $16.00 for an $11.99 pizza, plus an order of cheesy garlic bread. The order would arrive in 45-50 minutes.\n\nI called back an hour later and the lady that worked there told me the driver was on his way. She told me the phone number on the order and it was wrong, even after I had corrected the guy I spoke with previously. She talked over me as well and had a difficult time listening.\n\nThe driver finally made it and gave me the pizza, no garlic bread. I looked at the receipt and saw the garlic bread wasn't on the order ticket. WTH?!? The pizza wasn't pan crust as I had asked for either and by this time, the pizza  was cold as well. The only thing they got right was a half-cheese, half-pepperoni pizza. I wish they would have recorded my credit card number incorrectly...", "author": "Kristen N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-01", "description": "THIS IS CRAZY: they lie to us on the delivery time so bad!!!! It is a joke?? And the cheery on the top: the pizza is discusting, cold, I will NEVER order again there!!!!", "author": "Sergio E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "I have enjoyed Round Table since I was a kid. It was one of my first jobs when I was in High School.\nI'm sorry to hear other Yelpers have not had good experiences, however I have been lucky and rarely have issues. \nI always order a small Classic Pepperoni. Tonight was not exception. I asked for a small pepperoni and she told me there was a special, for three bucks more, I could get a large. Sign me up! Got it  home and scarf some of it down with eft overs for tomorrow. I am one happy camper.", "author": "Geoff F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-24", "description": "I'd give 0 stars if possible.  I also purchased a Groupon for a large one topping pizza for $13.  After calling to plave the order I was told by the woman on the phone that they stopped acccepting these on Monday.  WTF!  Then why are they still available to purchase?  I was told there was no manager to speak to and she had no idea when I could contact him/her.   \n\nI wish I would have read the rest of the Yelp reviews first.  It is obvious that customer service is not in their vocabulary.  Don't waste your time here.", "author": "Christopher P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-26", "description": "I am a huge fan of Round Table Pizza.  When I go to other Round Tables, I usually just call in an order and pick it up.  However, because this location is close to my work... my sister and I have our lunch there.  \n\nToday, when we walked in the first thing we see and hear is the owner yelling at one of his employees right in front where the cash registers are.  I don't know about other people but when I take a lunch break I want to relax and enjoy my time away from the office.  I couldn't believe how UN-PROFESSIONAL this owner was.  If you have an issue or something that needs to be addressed, NEVER discuss it in front of customers.  We felt so uncomfortable being witness to this.  Fortunately, the employee took the public reprimanding in stride.  I was tempted to actually go up to the counter and say something to the owner about how this was making our supposed \"relaxing\" lunch VERY uncomfortable.  But since I'm pregnant, I didn't want to any un-necessary stress.  So my sister suggested yelping this would be better.  \n\nSo I am not rating the pizza because as I mentioned before, Round Table is great.  I am rating the owner of this establishment.  This man was very unprofessional, rude, loud and had absolutely NO concept of what customer service is all about!!!!!!!!", "author": "Gabriela R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-27", "description": "If you want your pizza late and cold, call this business.  I ordered on line and my receipt said 45-minute delivery at 12:15 pm.  It arrived at 1:26 pm.  For cold pizza delivered 1-1/4 hours late, he offered me a free pizza next time.  Would you order a 2nd time?", "author": "E G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-10", "description": "Say what you want about Los Angeles, but there we have some concept of customer services. Here,  basic things like,  we don't accept plastic should be part of a phone order. To arrive and then have to find an atm is unconscionable! I expect basic common courtesy, not crazy *** kisses up my** when I call in an order!  Let me know if you are having technical difficulties and I will work with you!  Don't make me wander a strange city lookIng for cash!  I feel homeless enough when I travel! !", "author": "Josue B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-26", "description": "So I bought the groupon deal that was offered yesterday for the 13 dollar large pizza. I called in to place my order and the owner of this Round Table told me I could not place an order over the phone because someone before me with the same deal didn't pick up their Pizza. So he told me I have to go in there and wait for my pizza...\n\nand that is why I will never go to this pizza location again because the owner is rude and I'm getting penalized for someone else's mistake..", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-05", "description": "My boyfriend and I ordered a pizza for delivery around 12:30 pm and were quoted 45 minutes until our order arrived. After an hour, we called back to check the status of our order. We were told that it was on its way. Twenty minutes later, we called once again and were told he would check with the driver and call us back. When he returned our call, he let us know it would be ANOTHER 15-20 minutes since he needed to make a new pizza. The guy blamed the delay on the driver's \"car breaking down.\" \n\nI get that things happen and perhaps the driver did in fact have car issues, but is it acceptable to just let customers linger wondering where their food is? Perhaps a proactive measure - reaching out to inform us that there was an issue - would have healed our grumbling stomachs. Instead, we ended waiting 2 hours for a sub-par pizza and had to demand a refund/voucher. Simple business: HONESTY. Ironic since Round Table's mantra is \"the last honest pizza.\" Hmm...", "author": "Allison A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "This is a review for dining in the actual restaurant. Seems like most of all the negative reviews are for the delivery option. My experience was quite nice. Went in and ordered a large pizza and a pitcher of beer. A little more pricey than i anticipated for round table but the service was quick and friendly. The pizza came out fresh and hot, got the all meat and added jalepenos and it was extremely good, got a couple sides of ranch and I was perfectly content. Seems from the overall experiences there are much better places to get delivery from but as far as a quick great round table pizza just go to the actual restaurant.", "author": "Zino M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-13", "description": "\"Don't let it be forgot\nThat once there was a spot,\nFor one brief, shining moment\nThat was known as Camelot.\"\n\nAh...Camelot ...King Arthur ...Sir Lancelot ...Monty Python and the Holy Grail ...Round Table makes me flash back to high school when we used to hang out at one of these parlors in San Jose. Back then, it felt more medieval like the name implies. Nowadays, it's like any other generic corporate pizza chain trying to get the Domino's monkey off their back.\n\nI can't even comment on the place since I had the pizza delivered on a cold, dark night last week. I have to say the service was prompt and friendly. But the pizza is not what I remembered from my acne-laden adolescence. We ordered a 12\" King Arthur's Supreme - pepperoni, Italian sausage, Italian dry salami, linguica, mushrooms, green peppers, yellow onions, and black olives - for about $20.\n\nThere was nothing remotely unique about it, and even Extreme Pizza has a gooey greasiness that makes it more of a guilty pleasure. I think I'll leave my high school memories alone now.\n\nPIZZA - 2 stars....ZZZZZZ\nAMBIANCE - n/a...had it delivered...you expect me to walk up Van Ness at 10 at night??\nSERVICE - 4 stars...speedy and friendly\nTOTAL - 2 stars...but it is all about the pizza and well, there are so many other better options in this pizza-centric city", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-21", "description": "Horrible service! We called for delivery and after 2hrs they havent delivered yet. When we called them to follow up they said 15mins. After 30mins they called and the delivery guy tells us he cant come up. I told him i cant leave the my floor since im at work and i asked him should we just cancel this since there has been so much trouble getting to us and th delivery guy says \"yes yes just cancel\" and he hangs up the phone. Im like WTF!!!", "author": "Celine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "It's Round Table.  If you haven't had it before, this is as good a place as any to try it in SF.  They have a salad bar that kind of skeeves me out because of how \"not fresh\" the pasta and potato salads look.  But who eats that stuff anyway?  On the other hand, it's an all-you-can-eat for $8, which is a deal.  The pizza is passable.", "author": "Drew T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-21", "description": "i usually love round table, but this place had THE slowest delivery service i've ever experienced. \n\ni had to call twice to check in on my 45 mins turned into 2 hour pizza delivery.  the second time, the person on the phone said15 mins. i told him that he needed to give me a realistic estimation instead of lying to his customers.  he tried to offer me a discount on my next order, but i'm not from town and told him that. he then offered nothing. hahaha.\n\nuhhhh, choose a different location to order from.", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "One of the worst pizza place. I ordered my pizza on 3/4/2015 for 3/5/2015 pickup. I pay with my credit card online because I cannot pick the pizza up. Instead one of my co-worker went there to pick up the pizza. The girl working there \"KIM\" (name on the receipt) told my co-worker that the pizza has not been pay yet. Therefore, my co-worker pay for the pizza (pay partial with cash and the rest on his credit card). Then, my co-worker told me that he pay for the pizza and that the girl did not charge my credit card because it has not been pay. When I called the store to confirm, they say they have canceled my credit card and it will be in pending state for couple days. Couple days later, I checked my credit card statement, the charge went through. I called them again, they told me they cannot find anything and they will call me back. After two days, they never called me. I call them again and they say the owner of the store is not in and they will leave a note for the owner to call me. Once again, I did not get any calls. I call them once again and they say to call in the morning. After at least 5 times of trying to reach the owner of the place, I finally got through him today on 3/17/2015. Of course the attitude of the owner was @#$@#% and they cannot view the transaction online and nothing they can do about it. Then they told me that they reversed the credit card charge on my co-worker and the partial cash is in-store ready for us to pick it up. Service like this is piece of !@#!@$.\n\nSide Note: When I finally talk with the owner of the store(3/17/2015), I was going to gather some information and I told him if I can call him back in 5 minute because I need my co-worker information. He told me \"Im leaving in less than 5 minutes, call me tomorrow\". What kind of service is this? Fix the problem before you go home. Not drag the problem until the customer forget about it.", "author": "Dong H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-18", "description": "I love Round Table! We always order delivery from here- arrives in scheduled time frame. Absolutely love plain cheese and their mushroom! My boyfriend and his roommate love the King Arthur. Always consistently good. We always think we order too much...and then devour it all (:", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-05", "description": "This place sucks. I have been coming here for years because of their amazing breadsticks. Lately, I have been ordering here from work and their delivery time is off about 20 minutes. I call and they simply hang up on me. This time, I called and the person on the phone said that the delivery person was here. Ten minutes later I still had no pizza. I called and she said the delivery person was lost. I am no longer going to order from here anymore. I cannot take this crappy treatment from people- their food is not worth it.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-20", "description": "I meant to write this revised rating earlier. During this past Tuesday my friend and I came here and ordered a pizza prior to a movie at the nearby AMC Theater. We ordered a half pitcher of Anchor Steam beer. The menu listed premium beer as $7.50 for half pitcher but they charged us $8.99. We contested the charge with the cashier but he insisted he just works there and the prices are built into the computer. I said okay, but seriously anyplace else we'd have a winning argument that the posted price is supposed to be what's charged ever if it's in error or not updated. This reminds me that I should write a formal complaint before I forgot. It's not the dollar amount but the principle.\n\nAnyway, this is still the only Round Table rotten enough to charge the Healthy SF surcharge. I'm not totally sure about the regulation but I question whether they actually need to do it and may be just taking advantage to charge us more money. My apology if I'm wrong about this point but it's what I wonder.", "author": "H K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-24", "description": "Hey! Where the hell is my pizza? I was told that it would be here half an hour ago. So I am going to kill the time waiting -- when I should be eating -- by warning other innocents away from you.\n\n(Two stars because I fear Yelp's filtering system.)", "author": "Nick B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-02", "description": "Is there a zero button? If you're a half hour later than delivery time and I call twice and you lie to me both times is that ok? Wow, first time I tried on recommendation and 100% disappointed! Never again.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-21", "description": "Sooo....you only get two stars because I love Round Table in general. Otherwise I'd give you one. I was pretty excited to order a Round Table pizza, because they can be pretty darn good. Pricey for a chain, but good. This was my first time ordering from a Round Table in San Francisco.  \n\n1) We ordered the thin crust pizza that was advertised at a special price. Sweet! When it was delivered to us, I opened the box, and the pizza was ICE COLD!! NO sh**. Cold cold cold. The delivery guy wasn't even using one of those cushy warmer thingys.  We had to put our freshly delivered pizza in the oven, the second it was delivered. Why not just got to Safeway and spend less than half on a frozen pizza?! \n\n2)  I was sincerely disappointed, because, as stated above, I LIKE Round Table and would actually ORDER from this place, if it was any good.  I called them to let them know what happened, and give them a chance to redeem themselves, before I write them off. The manager said he would send me a gift certificate in the mail for the next time I order. (I didn't want him to redeliver another pizza because we had already waited almost an hour and were starving) So I thought, sweet! This guy cares about his customers (a little bit) and at least I'll get to give them another chance for free. I wouldn't pay to have another pizza delivered from them. \n\n3) The gift certificate never came. \n\nExpensive cold pizza + unresponsive management = I will not ever call you again. \n\nEnd of story. \n\n(PS: Go to the one on Geary...They are AWESOME!!!)", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-19", "description": "I placed an online order at 11:58am. I specified a delivery for 1:00pm. I called at 12:15pm to confirm the order. No one showed up at 1. I called at 1:15 and was assured the pizza was out for delivery. At 1:30, still no pizza. I called again and cancelled. At first I was told they had the address wrong and then that the it was marked for pick up. My online receipt conflicts with this. \n\nMy building is one block from this Round Table. This was inexcusable. I do not plan to try again with Round Table, but I hoped this review would cause a reevaluation of this location. Hopefully this level of service will not be the end of an established brand in these economically uncertain times.", "author": "Bryan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-13", "description": "If you like Round Table Pizza then you like this one.  It's like the Mc Donalds of pizza.  \n\nSometimes there are annoying homeless druggies inside and the place is a little greasy but it's ok.  Tables to sit at.  You can eat there or to go.  Ok salad bar.\n\nSometimes there are a lot of kids waiting to get their pizza so that slows things down.  Parking meters don't really give you enough time.\n\nPrices could be better considering thatthis isn't gourmet pizza.  Lots of better pizza options in SF.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-10", "description": "I had to speak to two different cashiers to place my order. Then it took 15 minutes to get a chicken sandwich and 3 breadsticks.\n\nI should have walked another block to Burger King.", "author": "Vincent G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-06", "description": "I reluctantly ordered a $10 large Pizza that has been advertised on TV, I guess I was having a weak culinary moment. What looked like a good pepperoni pizza when it was warm quickly turned into a plastic looking pizza on the equivalent of cardboard crust. Each slice tasted worse than the previous one and eventually I surrendered! You win Roundtable. \nWhat is amazing is if you look at the regular menu, RT's pizzas are not cheap, I couldn't imagine paying their full retail price and getting the quality of pizza that I received.\nI realize plenty of people love Roundtable but for me, I won't be going back.", "author": "David P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-22", "description": "I have been a fan of Roundtable since I was a kid, but my last experience was enough for me to never give the Van Ness location my business again.\n\nI came home from being out of the country, completely craving my usually Roundtable pizza. I placed my order over the phone for delivery. I got my pizza in 45 min, but as I sat down to eat it, my order was incorrect! The pizza was wrong and actually soggy and my salad was wrong and with no dressing. I called them back to bring me my correct order and they told me it would be another 45 minutes!! An hour went by and nothing was delivered. I called them and asked what was going on and the guy on the phone said he'd call the driver and call me right back. 15 minutes later I still had not gotten a call back. When I called back again, the guy on the phone told me he didn't know where my order was. I asked him to send the driver by with a refund and I'd give him back their unedible food. He said that would be 45 min!! I laughed my ass off in dismay, like that's their automatic time frame response to everything! I asked to speak to the manager and he told me that the manager was on break! A real restaurant manager does not get a break! I should know, cause I am one! I asked him to interrupt his manager's break so that I could speak with him, he put me on hold, and got back on to tell me the manager did not want to speak to me! In 45 min I got my money back from the driver. No apologies, no nothing. \n\nI wrote the corporate office about my experience and checked a box that stated I would like to be contacted by phone and no one ever called!\n\nBAD BUSINESS!!!!", "author": "Jay C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-16", "description": "We were in the neighborhood and my friend wanted to go someplace cheap.  Cheap!  Not!  We each got the salad bar and a small drink and shared a dozen wings.  It came to $27, which is iffy for a fast food chain.  Then we go to the salad bar-- a sign says only one trip to the salad bar!  And the plates are small!  And the wings were so tiny, they looked pitiful in the big wire rack server thing that they use.  \n\nThe food-- what there was-- was just okay.  Certainly nothing special. \n\nThe service was fast, accurate and friendly, so no complaints there. \n\nBut if you want to spent that much money on a snack-sized dinner in that neighborhood, go to Max's and get a couple of appetizers.  You'll be much happier afterward.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-17", "description": "My 9 year son wanted to play video games and eat pizza. so here we are back on Van Ness. their was something wrong with soda machine-too watery and not good. i told them about this but they did nothing\n he bottom line is that I got a stomach ache from something there...this is the second time, I had attributed to too much fruit punch the first time.\nThis place has got to clean that soda machine or the kitchen. Otherwise, the pizza was fantatsic.", "author": "barabara b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-09", "description": "Incompetent.\n\nThey said it would be an hour to deliver a pizza (we live a few blocks away) and told them -- while ordering -- that we would just pick it up. We get there, our pizza is sitting -- waiting. Takes another 10 minutes for the weirdo behind the counter to package it up for us. Cold pizza. Owner/manager is at the counter arguiing with some guy who wants to use a roundtable coupon -- horrible disrespect not just for the coupon but for the person wanting to use it. Horrible -- and, this was the owner!\n\nOn top of all this, they charged us twice for the credit card. Incompetent. Rude. Lacks customer service on so many levels.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "Pizza's okay. They've messed up my order before and not been super helpful, but they're cheap enough (and don't have messy politics like Dominos) so oh well.", "author": "Roxy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-02", "description": "Really bad. Ordered by phone, took an hour to arrive and then what we got was wrong pizza, which cost way less, totally cheated spending $38 on a medium sized pizza!", "author": "Glan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "Ordered a pizza with a 1 hour eta, after 2 hours tried calling and getting an update and was hung up on 3 times.", "author": "Colton P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "St. Patrick's Day.  Drunk friends who want pizza.  End up at Round Table. \n\nI felt bad for the staff at RT, our group was a bit loud and since American Idol was on (Michael Jackson night) some of the guys were singing.  We ordered 2 large pizzas - 1 Combo and 1/2 Vegetarian  1/2 Maui Zaui and an order of Garlic Cheese Twists and the 2 pitchers of beer.  It was amazing that we couldn't finish it all.  \n\nI hadn't been to a RT in a long time, I think the pizza was ok.  The place was ok...wasn't crowded, accommodating, decently clean.  I probably wouldn't be back here unless some of my drunken friends brought me again.", "author": "Christine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "Just ordered what I thought was a round table pizza from this place, what arrive two hours later was a freezing cold burn and literally smashed pizza. This pizza was not worth five dollars. I called and the wan told me she could not refund me, but would absolutely give me five percent off my next order. Round table is not cheap anywhere, so you should know, that's she basically told me to 'f' myself. I hope that place burns down.", "author": "Tyler F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-01", "description": "Still waiting on my delivery. It's an hour past the hour expected delivery time. They just lied to me and said the driver was here and hung up the phone. I don't understand. I am also hungry.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "Pizza is very good here for being a chain in my opinion. Yes the service can be iffy at times, but boy you cannot beat the pepperoni pizza", "author": "Aiqx J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-26", "description": "A colleague (who shall remain nameless) insisted we order Round Table Pizza over Domino's or Pizza Hut for an office meeting we had last week (sometimes you have a hankering for national chain pizza, ok?).\n\nI have never been a huge fan of Round Table's Arthurian branding - who came up with the idea of knights and pizza? Anyway, we ordered the Wombo Combo (might as well have been called Chumba Wumba) and Guinevere's Garden Delight (strangely soft porn-ish), and the woman who took our order was pretty jovial on the phone.\n\nThe pizza was a bit of a disappointment, it was edible but lacked the zestiness I'd expect Lancelot or Galahad would settle for. We also had some garlic parmesan twists that not even Merlin's wizadry could save from staleness.\n\nMethinks that at $60 for two large pizzas, the next time I'm getting the door, it's gonna be Domino's.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-07", "description": "The pizza is ok.  The salad bar is ok.  But given how much amazing food is within a 3 block radius of Round Table Pizza, I think the fact that it has seating and is open after 3 pm are pretty much it's strongest selling points.", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-13", "description": "They never seem tot have the specials advertised on tv. It's impossible to find specials online.the website sucks big time as you can never fine specials unless you call! That's not how it should be!", "author": "Peter D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-01-12", "description": "Working late last weekend, we were considering Roundtable. I went online to check out the menu (cos I'd never sampled) and spotted their \"Nutritional Info\".  I was curious so I downloaded the PDF and wow!! ... in 3-4 slices of just about anything there's enough sodium and fat to kill a water buffalo!!\r\n\r\nNeedless to say, visions of \"spare tire\" and my imminent demise killed off my appetite ...They get an extra star for coming clean with the info though.", "author": "I. O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-01", "description": "This is a joke, 2+ hours to deliver pizza, lied to several times on phone by manager", "author": "Lance P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-01", "description": "After ordering our pizza online through GrubHub it said the order was received.\nApparently they were accepting orders but not filling them.  After calling 2 times (they didnt even pick up the first time) and waiting an hour and a half they said our order got \"lost in the shuffle\" and they would start it now.  2 hours later I still dont have ANY FOOD.", "author": "Spencer P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-09", "description": "4:15pm ordered  Veggie Gourmet Pizza and Large Caesar Salad for delivery\n4:45pm recieved above mentioned treats\n\nYay.\n\nFastest I've ever gotten my pizza from this location!\nThe pizza was delicous!\nThe salad was awful.\n\nThe pizza was really good, but over priced.\n$35 for a pizza and a salad (that I couldn't eat) PLUS a $2 delivery fee.\nBoo.", "author": "Linz H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-17", "description": "3:00pm: Order pizza online\n3:20pm: Call location because I never received the confirmation call I was supposed to. I was told in broken english that my order would be delivered 1hr after it was placed. \n3:30pm: Tried to figure out why I never received an email confirmation.\n4:00pm: Started to get worried when my pizza was not there.\n4:15pm: Called to see where my pizza was. Was put on hold for 5min and then was told she had to call the driver and find out, that she would call me back. Never heard back.\n4:45pm: Called again, was asked if I could be put on hold but before she got the -old out I interrupted and informed her that my pizza was 45min late. She then began to argue with me, saying that it was only 25min late\n4:50pm: Hallelujah my Cold, Soggy pizza is finally here.\n\nI ate at a RT in Sacramento about a month ago just because.....well thats all Sacramento has, and it was pretty good. This experience was obviously due to piss poor management. I will never order from here again and I hope people will read this and not make the same mistake as I did. Call up Stelladoro, its cheaper and they will get it to you in about 30 min.", "author": "Jackson D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-10", "description": "I'm only giving two stars cause I usually love round table and their pizza. yet the service at the Van Ness location was a sad excuse for customer service. Im pretty sure if the delivery guy could have sat on our pizza on the way over, (the hour and a half it took to get to our house).  and who doesn't automatically give ranch with buffalo wings? this is america people.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-18", "description": "Worst experience at a Round Table Pizza place. Called ahead to order pizza for pick up. I was on time for order. A Hispanic male verified my order and I paid for pizza's. He went back to get pizza and found out the order was never put in or pizza maker just forgot. First he said its \"in the oven, not done\" I asked him if that was true and he said no. We just didn't make it.  He did say we can make it in 15 minutes. I asked to speak to Manager. He replied the Manager Carlos was not there. I then asked for a credit on my card that I used to purchase the pizza and he was reluctant to do that. He finally gave me a credit receipt, but still have not seen anything. This cashier never apologized or offered any solution other than waiting another 15 or 20 minutes. I walked out.", "author": "joe c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-19", "description": "The pizza was burned-dark black areas on the crust and the canadian bacon and it  tasted like charcoal. Then the clerk argues with me on the phone when I call to request to exchange the pizza. I hear a lady in the background yelling out to the guy on the phone rudely like she was cueing him to argue with me.  An hour later the delivery guy \"Aaron\" has the nerve to warn me rudely he will charge me  (twice) if it happens again! ...because we each bit a slice if the pie (returning like 8 out of 10 slices). I guess he wanted me to give him back the bitten slices too on our plates.  Fine.  As I went to get the plates he started making some pissed off remark I can't repeat.  I told the guy I didn't want to argue with him and just wanted an edible pizza. Don't give this rude branch your business my tip.  Try Goat Hill Pizza.", "author": "Caroline D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-03", "description": "I like Round Table and seeing that I am surveying slice pizza places in SF and the Van Ness Round Table serves by the slice I broke my \"no large chain\" rule.  I wish I hadn't.  It was a large piece for $3.15 (cheese) but it seemed everything was out of proportion and they lost the balance that makes their regular pizzas so good.  The 2 stars are for their slices the normal pizzas are still good.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-18", "description": "I miss this place. The lunch specials are great. I love the salad bar, except the pasta salad is nasty. I recommend the skinny crust, with extra sauce and light cheese, with bacon on top. I loved accruing stamps and getting a free meal out of it.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-17", "description": "I don't recommend anyone to order from this round table pizza because the last time i ordered for a delivery, the pizza came with a LOT of hair in it. The pizza should be named, \"HAIR PIZZA\" because there was a whole LAYER OF HAIR TOPPINGS on and inside the pizza sauce, to top is off, some of the hair was curly. TRUE STORY, i am not making this up. GROSSNESS!", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-14", "description": "Honestly, I would rather go to pizza hut.  Got RoundTable last night since they are having a $10 pizza special.  The pizza wasn't too bad.  Definitely not the best I have had in the city, but it was ok.  I also got a salad to go with the pizza and I will say their salad bar is horrible.  The lettuce is some of the worst iceburg I have ever seen and they were running low or out of quite a bit of stuff.  Some of the things that were in stock, the tomatoes and cucumbers for example, looked like they had been sitting out for a while.  Plus it was $5.99 for the salad.  Another disappointment.  I can't believe I paid almost as much for the salad as the pizza.  Maybe they should just stick to pizza.  Plus, if they didn't have the $10 deal I would NOT eat there.  It would have been $18.99 for my 1 topping pizza!!!  Definitely NOT worth it!", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-02", "description": "Let's see, this place was like home to me for awhile. I went to high school around the corner, and my friends and I used to come here after school to hang out, do homework and eat. Now it helped that one of our friends was good friends with a few of the employees, because I hardly ever remeber opening up my wallet, but I would have paid for what we eat regardless.\n\nSo the garlic twists, an ode to. Seriously though, these things are orgasmic. I could sit around all day and eat these things, dipped in ranch dressing. Its hard to even articulate it. Anyway, the service has gone down hill since I frequented this place, but the garlic twists bring back such fond memories.\n\nAlso, If you get these guys on the phone late at night and happen to be under any sort on influence, they are great at talking you into ordering more food than you intended. \"what? I have to order how much food to get this delivered\" eruption of giggles \"okay, well how about i get 4 orders of garlic twists and a pizza? yeah? okay \"  But for all it was worth, we ate every last bite and enjoyed it all.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-10", "description": "Ordered pizza around 8pm.  Called at 9:30 to ask where my pizza was.  The girl said the delivery driver had just left, yet it took another 30 minutes to arrive.  When I did finally get the pizza after two hours, it was lukewarm and over-cooked.  Avoid.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-30", "description": "do not come here! the workers are rude and UNHELPFUL! worst pizza place ever!", "author": "Q W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-04", "description": "They messed up my last order last night! I ordered a specialty pizza and they left out some ingredients! If you're going to charge an arm and a leg for your pizza at least get it right! I work hard for my money and don't like throwing it away. I feel jipped!", "author": "Marla Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-25", "description": "Round Table advertises on the Sharks website to give a free personal pan pizza(1 topping) if the Sharks score 4 goals.  But it's a scam here in SF.  Every Round Table I call is either NOT participating, or they have extra conditions, like you have to buy a 10cent drink for $2.  Or only one per person per visit.  what a scam.  No wonder I don't like them.\nMy advice to the Corporation is to make your franchisees live up to what you've advertised.  The Sharks should drop you losers.", "author": "Bill F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-15", "description": "Ordered a simple delivery of 1 pizza. 2 hours later still hasn't arrived. I have called them twice, once after an hour to check on the order, they said it was on its way, second call after 2 hours, they said the driver was 15 minutes away. We are located less then 10 minutes away.....just absolute lies. They offered a free pizza next time, this is the first time I have tried Round Table and will not be trying again. Cancelled order, simply hopeless !!!", "author": "Tim M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-19", "description": "Judging from the other reviews I've read, my awful experience at this Round Table was not an exception. One time I was in there and saw an exposed bulb hanging from the ceiling in one part of the store. Hmmm not a good sign. One of the employees was making fun of another employee to a customer. They screwed up my order and when I tried to complain I essentially was told to shut up. Avoid this place if you possibly can, it does suck.", "author": "Todd H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-18", "description": "My company recently has been spending approximately $300 a week at this location to feed our employees as well as conference classes to which we have been hosting.  I figured I would call to see if we were spending approx. $1,200 a month on pizza it wouldn't hurt to ask if there was any discount incentive and figured it would be a win win for both us & this location.  The worst they could say was no.  However, I was wrong.  I called at 6:00 on June 18 and requested to speak with the manager.  I was informed I was speaking with the manager and his name was Mike.  When I asked, he was INCREDIBLY rude and before I could even explain  my situation (and after being put on hold TWICE so he could talk to another employee) he interrupted me & rudely said could \"just get to the point & make a long story short.\" He then told me that even if I spent $300 a week with them, that \"he only makes 10% so he would only make $30 so whats the point.\"  He gruffly continued to say that if I wanted a discount then I would have to buy much more than $300 a week (again $1,200 a month) to get a discount & if I wanted one that I should just look to my mailbox bc that's the only discount theyre gonna give no matter how loyal of a customer you are.  Had he simply said \"no\" I wouldn't have an issue.  After all, I was only asking because I thought the worst they could say was no.  However, after the treatment I received was so condescending and rude that I will never support them nor the treatment that they dealt out.  If they treat a loyal customer like myself and my company like that, how would they treat me if I were only spending $24? To me customer service is everything and I would rather pay extra to have our pizzas picked up from now on than support them.  If you care about how your business is valued, this is NOT the place for you", "author": "Sam S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-29", "description": "Knight, good sir, I challenge thee to a duel. You should be ashamed to call yourself a pizza chain. Expensive, incompetent and tasty as thy horse's bridle. I shall ride to the depths of hell with Dominos before I see the likes of you again.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-17", "description": "I used to live right above this restaurant.They have variety of pizza with multiple toppings to choose from and salad bar is awesome. People that work there dont get off until 2-3am. They work really hard. The service is mediocre but pleasant and patient on phone order. They let you know in advance how long it takes to prepare pizza for you. I prefer round table better than domino's pizza anytime.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-29", "description": "First time I ordered round table it took two 2 hours - no exaggeration! Not only that but the delivery guy came to the door and paid him for the pizza, I gave him a 3.00 tip, (27.00 total, 30 bucks total) he put his foot in the door as I walked away and said \"is that all\" (as if I screwed him on the tip) across the room.   Seriously?  2 hours, cold pizza, 3 bucks, I think that is a fair trade at this point and perhaps a bit generous...   The conversation from there was fairly short as I slammed the door... unreal..", "author": "Brian K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-20", "description": "I  purchased a Groupon Daily Deal for Round Table Pizza  Today at around 6pm, it was a ONE DAY ONLY 10am to 10pm a $20 value for $13.  Around 7pm ordered a large pizza by phone, arrived about 20 min later to be told 'WE DON'T ACCEPT THOSE ANYMORE\", I explained I had JUST bought online.  Both employees where rude and refused to call the owner/manager to help. I told them that these are being sold right now and other people will be having the same problem, please call your boss and tell him. At this point the woman turned her back on me and the man just looked away!   I am so upset about this, both Groupon and Round Table on Van Ness.  Wasted over an hour of my time for nothing.   I am done with Groupon and Round Table............As to other reviews about delivery;  NEVER try delivery at this place, Will always take at least 90 minutes IF they even bother to show up with your cold pizza!  The owner obviously does not care about his business.", "author": "John C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-31", "description": "Can someone please tell me how it could possibly take over an hour and a half to make a frickin pizza and deliver it to my house 10 blocks away??  It just absolutely blows me away.... the pizza, once I got it, was great.  This made me remember why i stopped ordering from national pizza chains... Round Table, Domino's, and Pizza Hut all blow. Ridiculous....", "author": "A B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-05", "description": "This place sucks!!! I tried ordering from another round table location since I love their pizza but the Van Ness one was the designated location for my address. Crap.\n\nSo I have order 2 times from this location. \n\n1st time, it was a Thursday night and I was tired from a long day at work. So decided to treat myself to a mess free dinner. I ordered and the lady said it would take 45mins to get to me which would be around 6:45pm. Perfect, right before the basketball final starts at 7pm. So we wait and we waited. We even called the RT and asked where's our pizza and they said it went out 1 hr ago?! By the time the pizza guy got here, it was 8pm!!!! You have my cell, if you are lost you should have called me! What was worst was that my pizza was cold and burnt, the garlic twist that we got was burnt as well and you can't even eat it, it's rock hard.\n\n2nd time we ordered it 'cause we couldn't get the other location to deliver it to us. And was hoping that it was only a one time thing. This time the pizza guy got here on time right on the dot. But again, the pizza was burnt!!!\n\nNever ordering from this location again.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "This is really only for delivery. I have quite a love affair with their chicken garlic pizza and well... I call them up and they bring me one.", "author": "Constance C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-06", "description": "For a chain pizza joint, it is not that bad.  Grew up on it, having pizza with my family on Friday nights in central California, so maybe there is some sort of built-in fondness.  But prices are decent, they deliver, and pizza is consistently good and seems to appease most people from different parts of the country.", "author": "Lucas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-09-01", "description": "The ULTIMATE pepperoni and mushroom pizza. I can't live without it. This play has not skipped a beat in the past 10 years!", "author": "A D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-14", "description": "Just like any other Round Table.  I actually like their salad bar a lot. The choices actually look fresh and they taste fresh as well. I like their Italian dressing.  This location seemed to have enough seating. Your ordered at the counter, take a number and your pizza will be delivered to your table if you are dining in.  I ordered the Garlic Parmesan Twists, Salad and Soda for $6.49.  I like my twists on the soft side and they came out perfect, just the way I like them.  For kids, there are gumball machines and arcade games like the old-school Rampage.  Friendly counter person.", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-12", "description": "About par for a Round Table Pizza place. Although when it is difficult for the cashier to understand what I am ordering it does become a bit problematic to make sure you get what you want! Our order did come out like we ordered it, but it was the sorryiest looking thing I have ever eaten. The breadsticks were over cooked and super small compared to how I am used to seeing them and the pizza was a bit doughy.", "author": "Tyler D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-11", "description": "my parents live in san francisco near van ness. and the closest round table there is the one on van ness st. so we had ordered an xl pizza for pick up. i did not expect anything that was going to ruin my appetite until the moment i picked up my pizza and asked for cheese and red pepper. the man in the front which happened to be the manager said that they had ran out of cheese. so i asked for ranch and the man had charged me 50 cents for a container of ranch. i find it hard to believe that a pizza place has no cheese and red pepper. so i went back to my moms house disappointed. \n\na few weeks later there was another gathering at my moms place and she had told me to order round table again so i gave it another shot to see if service was better. i called for delivery and it was a man on the phone. he asked for my phone number and found my address on his computer as they save it after u order once. i had ordered the same thing like before. and asked for ranch. the man on the phone wanted to charge me 80 cents for a container of ranch. and said \"RANCH ARE NOT FOR PIZZA\" i had told him i ordered there before and you only charged me 50 cents. he said ok. ill give you one ranch. as soon as the delivery boy knocked on my door he asked me for a coupon. i said excuse me? he said that if i didn't have a coupon it will be 3 dollars more. i said i want to call the manager i was talkin to when i ordered the pizza because he had never told me about any coupon to present when u get here. he said that it was ok i dont have to call the manager on him. then quickly said \"how much tip are you giving me?\" i had already gave him 4 dollars of tip but he wanted more. as i close the door slowly he yelled and said \"CHEAP BAST*RD\"! \n\n this is the worst round table i had ever experienced. and promise to never order from this place ever again. pizza is good but service is really really BAD!!!!  i like the round table better out in pinole.", "author": "rob a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-29", "description": "Lousy service.. DO NOT order from them...Last Friday we order 2 pizzas at 1030am, called again on 11:30 and was told driver was on his way, 1215pm passed by no pizza. called to cancel the order but was told the driver had left the shop. Pizza didn't show up until 1245pm. Called and talked to Mike. He promised to send the gift certificate and vip coupon (free pizza) in the mail Friday night but no sign of coupons and today is Wednesday... Lied through their teeth... can't trust them and can't rely on them....worse experience ever... 3 hours for an order of pizza...", "author": "Steven C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-24", "description": "Unfortunately I live near this round table pizza and I will never order pizza here again. The staff answering the phone is super rude.  I see this as a reflection of the management's lack of skill in hiring and in training.  This is my number one complaint.  I believe everyone is bound to make mistakes but it is how a business deals with the mistakes that distinguishes businesses\n\nI ordered a pizza at 7 pm.  I was informed it will take 45 minutes to an hour.  At 8:30 I called to check on the status.  I was told that the pizza was sent out to my home \"a long time ago\".  I said well I still don't have it.  To which the person on the phone says \"are you sure?\"  I told her that since she obviously doesn't know how to solve the problem I would like to talk to a manager.  She said that she does not know who the owner or the manager is.  Few minutes later I got another call this time from a woman identifying herself as the manager and saying the \"truth us that the driver took the pizza but came back forgetting to deliver it\".  I then said then please be sure I get a new one since this 1 hour old pizza is going to be cold.  She said that she is warming it in the oven and will send a warm pizza.  Before I had a chance to hang up with pizza the 2 hour old cold pizza arrived (9 pm).  I called back and said that obviously you lied since the pizza is here, it is cold and she never sent a fresh or warm pizza.  \n\nAlso the manager told me more than a few times that I should not tip the driver since this is his fault.  I never see the problem at the bottom but at the top.  This is why in both cases I did tip the driver.\n\nThe biggest problem is the entire time the manager spoke to me she was yelling and I had to hold the phone away from my ear.  \n\nThe worst part is that this is the second time this EXACT same scenario happened with this pizza place.", "author": "Simone D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-13", "description": "i know this pizza is just average.  but i grew up on it.  so it tastes strangely like the best pizza i've ever had everytime i order it.  and they deliver to my house.  what else could you ask for?  you must eat it with A&W root beer.", "author": "a g."}
