{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Haven't even put my order in yet but I have high expectations.\n!! LPT incoming !! If you have trouble eating your entire pizza in one sitting, put it in the fridge and eat it the next day as is (just like the cold pizza they talk about in American Pop Culture)\n\nWould order again, 2 thumbs up!!", "author": "Kaitlin P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-04", "description": "I'd say ROUND TABLE PIZZA generally is a * * * * or even * * * * * quality pizza to me, even compared to non-chain pizzarias.  It's way better than Papa John's, Shakey's, Pizza Hut, Dominos, Little Caesar's, Costco, Sbarro's, etc. - - and a different type than the quick pizzas like Mod, Blaze, etc who have you build your own pizza on thin crust and bake it within less than 10 minutes (I do admit I love those places where you can get a personal pizza for under $10).\n\nRound Table's traditional standard crust is the best, along with their very zesty flavorful red pizza sauce.\n\nThe sausage and linguica are the best toppings, 'tho if you're not into greasy tasty pork, there's other options.\n\nThis location is \"A-OKAY\", in terms of, I've had better experiences with other Round Table locations, as well as worst, so this here is average, noting to write home about nor complain to the manager about either.\n\nParking can be tough at times, but it's all about timing and usually you can find a spot.  The parking in the front are all metered, but there's adjacent residential streets in the neighborhood for free parking if you want to walk.\n\nIf you live in the area, this location does do \"couponing\" as marketing to the residents with advertising flyers, which is always nice to have a discount.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-29", "description": "DO NOT ORDER FROM HERE. This place SUCKS. They are always consistently late, and not just 10 minutes. It takes 90+ mins for a damn pizza. RIDICULOUS. Always late, not even that good, no tracking, and terrible customer service.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "The pizza today was delicious and I am impressed on the improvements in delivery . I always enjoyed Roundtable. This pizza today was the classic Roundtable pizza I long enjoyed and yearn for and finally got delivered.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-20", "description": "This location cannot handle the volume of orders it receives. \nTwo hours for a delivery less than 10 minutes from the store. \nOne hour for a pick up order placed on line. The website said the order would be ready in 20 minutes,  I waited 30 minutes before leaving my house since they are usually slow. When I arrived my pizza was just being made and I had to wait an additional 30 minutes before it was ready. \n\nI will be going to a different pizza place in the future.", "author": "Joan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-11", "description": "Two stars because the guy on the phone was nice when taking my order. However I waited 3 minutes before anyone acknowledged my existence even though four guys were standing right there. Then when I got home the breadsticks I ordered are 1/3 the size of what Round Table usually serves. If head quarters is reading this- check on the standard size of bread sticks. Thanks.", "author": "Alice B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "This place has been my go-to for years, back in the days of paper menus stuck to your house. Now, with food apps, it's even easier. This crew rocks pizza, plenty of toppings and lots of choices, and delivery is always on time . \nExcellent choice!", "author": "William M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "Ordered a pizza today at 6:30pm...Yelp said it will be delivered at 7:30...Had to call them to cancel after almost 3 hours at 9:15 since it's past my kids bed time...they were looking forward to pizza. \nNever write Yelp reviews...but had to do this one to warn other consumers before ever ordering at Round Table...", "author": "Edwin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-19", "description": "The pizza wasn't that great.  It looked better than it tasted.  The crust was cardboard-like.\n(Think cheap ,grocery store, frozen pizza crust)\nWe ate in and ordered a small pizza with half pepperoni and half sausage. We were the only ones there except for a manager and three delivery drivers.  \nWe paid almost $20 for a small pie with two drinks. \nThe tables needed wiping down from the very young staff that were hanging around waiting to deliver pizzas.  They were good guys who are presently working at a pizza place. I felt like I walked into a scene from a movie:\n\nPizza driver #1:  \"My mom says I have to get a better job\".\nPizza driver #2:  \"One of my friends says he can get me a job as a valet at a really nice place\".\nReally young manager:  \"Pizza's up... I want this delivered in 20 minutes\".\nPizza driver #1:  \"Can't wait to see the Yelp reviews tomorrow.\"", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "I ordered a pizza a few months ago that was late and cold - I was skeptical when they told me they would give me a free pizza to make up for it but they actually came through and we're so kind and true to their word.\n\nIn this age of customer service not being great, this round table is so helpful and kind.", "author": "Katie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Forgot how salty this pizzz is.  The guy at the cash register was super friendly. Haven't ate pizza here in over 10 years. Won't be back for another 10", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "I ordered pizza around 7:20pm pizza arrived after 8:00pm and it's cold on top of that website sucks I enter my address and when I got email confirmation it wasn't even correct which I probably should have called and let them know but still arriving late and it's cold pizza is just not acceptable\n\nUpdate owner of this location gave me call apologized for the cold pizza and gave me credit outstanding business model", "author": "Allan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "Horrible! If I could give this place zero stars I would!!! I ordered a pizza at 5pm, delivery time was 50-60 minutes. 6pm comes and no pizza... 620, no pizza. I call the place, they put me on hold forever and say they never got our online order (surprise surprise). They promise to make a new pizza and deliver it ASAP! 730pm  rolls around and no pizza...again, call the place, on hold forever and they tell me the guy left ten mins ago,  now it's 8pm  the restaurant is ten mins from my house), no sign of pizza.  So basically I've been waiting 3 hours for a pizza from this terrible establishment! Do not order from this round table! Do Not Order from here!!!!! The round table on Junipero Serra in Daly City is MUCH more reliable!!!! Again NEVER EVER ORDER from here!!! Ok, that's all... bye round table!", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "I honestly have no clue how this location is still open, they are completly unorganized. I really didn't want to write a negative review but after todays trip I had do. I called 40 min before i came to the location which i was told would be ready in 20. I had simple orders small pep and 6 boneless wings, what happens when i get there you may ask? They havn't even started making the damn thing, guy behing the counter tells me i have to wait another 10-15. Also the white kid behind the counter needs a new role he was freaking out the entire time, the phone rang he had to step away and grab his head yelling i can't do this anymore. I will never order from or come to this location ever again.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Awesome pizza, great service. Parking difficult at times.", "author": "Sergei Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "I always like RTP, so I'm in from the get go. Last time I ordered here it took awhile. I complained, and the owner refunded my $. So they care about their customers. That deserves at least 3 stars right there.", "author": "Matty R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Update: So the owner replied on yelp and emailed me separately. I do appreciate the professionalism and the attentiveness to the service I received. I took him up on his offer for a re-do and when I called; the clerk took my offer with ease, he was pleasant and my pizza arrived on time. I appreciate the action and hope that it continues. Thank you for a better experience.", "author": "Carlee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-08", "description": "As a Bay Area native, RT holds a special place in my heart. There pizza is great. But sadly this locations service is the worst. On more than several occasions have I waited over two hours for a pizza that should have taken an hour. I get it, you're busy. Shouldn't you plan for that? There are way better pizzas in the city with more reliable service. I", "author": "Silvio S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "Reliable enough, although I always wonder what an Italian would think of Round Table.  Still, the toppings are generous, they don't charge for extra sauce and cheese (which their pizzas need as they can run to the dry side), and they aren't priced quite as high as the \"artisan\" places that want you to eat their arugula, fig and nettles \"pizzas.\" You won't be wowed, probably, but you won't hate it, either.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-25", "description": "Order from another branch; as many have noted, they do not have their act together here. I gave them a second chance, shame on me.", "author": "J W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "I write this as I am still waiting for the pizza I ordered an hour and a half ago. (Supposedly I have 20 minutes to compose this review before the pizza arrives.) Online estimates said it would arrive in an hour. After 1:20 I called and was put on hold. After 8 minutes on hold I hung up and called back and refused to be put back on hold (sorry, I was hungry). After much hubbub they looked up my pizza, which had been ready for some time and had not yet left! They promise it will be the next pizza delivered and here in 20 minutes. Google maps puts my house at 7 minutes. I wholly anticipate this to be one cold-ass pizza. They did give me a 25% discount after I specifically asked for it. I've ordered delivery from here maybe 5 times and I've probably had to call to follow up 3 of them. This may have to be the last.\n\nUpdate: Have given them another two stars due to arrival of pizza. It was 30 minutes after the call, not 20, but it was hot and scrumptious. Thank you pizza overlords!", "author": "Megan T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-08", "description": "Expected delivery was at 7:11pm, it arrived at 8:20pm. We called and the guy was being dismissive and unapologetic. I've ordered here before and knew that delivery was slow but had no idea we would wait 2 hours for pizza. You're better off picking it up or not ordering at all.", "author": "Patty N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-12", "description": "This review is only for delivery as I've never actually ate there.\n\n1 star - delivery is always promised within the hour, yet I live down the street and it routinely takes 90+ minutes for delivery.  As I sit here typing this review, I'm currently at 38 minutes past the expected delivery time.  With such shoddy, unreliable, late service, I don't think there's any reason for me to continue spending my money here.  You were late one-too many times.  That's it.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-25", "description": "I've been ordering from this Portola location for years.  It's been average pizza, but will do in a pinch when you are too tired to cook.  Alas, I will order no more. Two nights ago I ordered and they said delivery 1 hour to 1:15 hours.  Ok, well, this pizza didn't show up till 1:30 hours after I ordered it. \nThe pizza was $23 and was the worst pizza I've had.  It was dry, no sauce, and the toppings were minimal, I mean nearly nothing on the pizza.  Mostly dough.....well, I put the pizza back in the box and drove to Portola round table pizza and said I want my money back.  I was furious.  Why wait an hour and a half for a sub standard pizza.  The cashier looked at the pizza and agreed with me, it was seriously lacking.  He refunded my money as I told him, this is it, no more will I order from this place!  \nWe walked to the store on the corner and got the most delicious burritos for less money, they were filled with goodies unlike the lousy pizza.", "author": "Jacki F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-06", "description": "I have given this location many chances but everytime I have been seriously disappointed.  The delivery has taken anywhere from 1 to 2 hours long. They have never delivered on time.", "author": "Donatella Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-12", "description": "Mine didn't take but 15 minutes from the time I ordered and paid to the time I left the building, pizza box in tow.  A little pricey, but I knew that when ordering.   \n\nEverything was as ordered.  I'd be hesitant to eat at the location.  Accordingly, it looks like take out dominates their sales.  \n\nUsed an Entertainment Book coupon ($5 off!) just fine and dandy also.", "author": "David B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "What this updated rating is for: the response from the franchise owner. \n\nHe took the time to reach out to me after reading my review. In this day and age where a lot of franchise restaurants lean on the overall brand to carry them through bad business, I appreciate the personal message and offer of reimbursement. Thanks to him, I will consider ordering from RT again... which is a good thing, since I've grown up with the brand!\n\nKudos on good customer service. It's not that easy to find nowadays.", "author": "S. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "My first order from the Portola restaurant, done on-line, was completely screwed up, even though the receipt clearly showed what I was supported to have received.\n\nI made a complaint here on Yelp and was immediately contacted by the manager who apologized and offered me a free pizza to make up for the goof.\n\nI took advantage of his offer this evening and it was PERFECT!\n\nRound Table Pizza has definitely redeemed itself by getting my order right and the manager is to be congratulated for following up on the bad review and making it right.\n\nThank you, Round Table Pizza.\n\nI'll be ba-ack!", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "I came here today and they greeted me with a smile. My 90 year old who hates pizza came here with me and he wanted to order another one, because it was so great. The price was very reasonable. This was the best pizza I've ever eaten and I've eaten a lot of pizza.", "author": "Timothy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "YESSSSSSSSS the service is awesome the people are very friendly and I LOVE PIZZA but only from ROUND TABLE it's very unique !!!!", "author": "Esther M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-30", "description": "I'm hesitant to post this because the food is good and the people are nice. \nHowever, the last time I was in the store I was standing at the register to pay and I watched the girl making the pizza wipe her face and push her hair back and then continue to make the pizza. When I brought it to the owners/managers attention he was super apologetic and yelled at her to wash her hands and change her gloves. However I only saw her change her gloves and continue making the pizza. \nAfter seeing this I can no longer eat here. \nI'm sure this stuff happens everywhere behind the scenes but every time I think of ordering a pizza this scene is repeated in my head. I'm still rating them 3 stars because as I said the food and service is good. Hopefully this experience was an outlier.", "author": "V I P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-11", "description": "I have ordered pizza from here twice in the last month. The first time it arrived after 1hr and 15min of placing the order. Tonight I gave them the benefit of the doubt and ordered again. I placed my order at 4:08pm and it just arrived at 5:28pm.\n\nI figured that by ordering early it would arrive by my daughter's dinner time of 5pm. Can't keep a 2yr old waiting. It does not take an hour and 20minutes for cheese pizza.\n\nFine, the pizza was late.\n\nI get my kiddo into her high chair. Open the box to find BURNT pizza. It's late and its burnt? Seriously. Can it get worse? Oh it can -- the pizza is COLD! I paid $50 for cold burnt pizza that took almost an hour and a half to arrive.", "author": "jamie b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "Brent is extremely rude, never ordering from this location again. Please address the situation management", "author": "Dee D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "A joke, they take 2 hours to deliver pizza. Poor service when i called to double check on the order after an hour an twenty minutes he tells me they're waiting on a driver back and then heading straight to me.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "The delivery service and customer service is horrible. They have been over an hour late several times and when you call to see what's up they are annoyed with you! Its crazy! I will now go to Daily City if I need a round table fix. Such a shame!", "author": "Adrianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "As Round Table pizzas go, this one is really really well-run.  Always good pizza, fast delivery, and they're super nice inside.  I came in one night to order a pizza for takeout, and while I was sitting there waiting, they offered me a free drink.  I hadn't asked, and I certainly didn't expect it, but it was just a really nice thing to do.\n\n(Now - bring back the Meatball Marvel!  That pizza was the best thing on the menu, even for only a limited time.)", "author": "Foodbag B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "I ordered over the phone for carry out.  The estimate they gave about when my order would be ready for pick up was accurate.  The inside was dead, but the workers were busy making pizzas.  It is safe to assume that most people get delivery, or take it home to eat.  Few actually dine in.  The restaurant has a television, so there is at least something to watch while you wait or eat.  \n\nThe pizza was delicious.  They make sure to pile on the toppings and they don't skimp you.  I also like how they aren't stingy on plates/napkins/ranch.  Dominos just can't compete with that.  The pizza is always consistent.  The wings are a must try too.  \n\nRound Table is my favorite pizza chain.  I would definitely recommend this place.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-21", "description": "I ordered online and was told the order would be 50 minutes. I have kids in the house. They are salivating by the window. I call after an hour and forty minutes has passed. I am put on hold and wait five minutes. I hang up and call back and they immediately ask if they can put me on hold...I wait two minutes and hang up. I call back and they ask if they can put my on hold and I beg them, \"PLEASE NO I HAVE KIDS IN THE HOUSE AND WE ARE HUNGRY.\" He asks for my address and then tells me that they have our order and they are just waiting for a driver. I ask how long it will be and he says another half an hour. I have cancelled the order. Our entire house is hungry and fighting now. This is beyond unacceptable. They are not appropriately staffed.", "author": "Tiffany R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Amazing. Whoever worked tonight needs a raise!! We have ordered from here before several times but have never had such a great pizza. Both my boyfriend and I couldn't stop eating because it was so good. We need to order from here again soon!!", "author": "Mary E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "**BUYER BEWARE!! NEVER ORDER FROM THIS PLACE**\n\nI don't expect much when it comes to pizza delivery but the one thing I do expect is for a business to keep it's word.  We ordered online and it told us our food would arrive by 6:20pm. I gave a customary 15 minute grace period before I called to find out what was taking so long.......wait for it.....\"We are taking it out of the oven right now.\" (Riiiiiight) \n\nI said well how long is it going to take to get here.  He says at least another 15 minutes.  He is bagging it up now. I said you do realize that makes the order like 40+ minutes late right?  To which he replied, \"Ohhhh you must have ordered online.\"  \"Yeah, that is our corporate website and it automatically gives you the time.  We can't do anything about that.\"  \"We almost always call online orders to give them their real time but I guess you didn't get called.\" I replied to him that had I known it was going to take this long, we would have never ordered it.  Now get this, he actually says, \"Well do you still want it?\"  If I could have symbolically phone smacked this twerp I would have! (Yes, I said twerp)\n\nNow, what this example of the future of America should have said is this, \"Hey B, I'm really sorry about all this.  It's a glitch in the system with corporate and I'm going to make sure it's brought up again with management.  We take responsibility for this error and if you are willing to still receive the food, we would love to take off 30% off this order and I'll send out some coupons for you as well.\" \n\nThat's customer service!!!!!  This Roundtable Pizza is contributing to the destruction of America.  Yeah, it's that bad.  Thanks for destroying America Roundtable Pizza!  Okay, okay, they may not be single handily responsible but don't piss me off with millennial BS when I'm hungry! \n\nBTW, If you are still with me, it's now over 50 minutes late!", "author": "Brian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-13", "description": "What a worthless group of people. I ordered a personal pizza to go, over the phone. Was told 15 min. Get there 20 minutes later and the pizza was just getting put into the oven. And im told it's another 7 min. My very first job was at round table pizza, it takes a minute to make and 6 minutes to cook. They had 5 guys back there just shooting the shit.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "Ordered pizza an hour and half ago. Called to check on the eta and we were told that they were REALLY busy (on a Monday) and maybe we should just \"walk here.\" Yeah right, with two 3-day old infants. Classy.", "author": "Julie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "So I ordered a salad and pizza for pick up, but when I got home.  I realized the salad was almost all brown and not edible. It clearly was just an error because all the previously ordered salads were just great.  When I called to complain the person on the phone offered some great options, but I didn't have the time to go back to pick up the salad. So the manager, Frank, made me a new and had it delivered very quickly!! Also, he upgraded the salad from a small to a large.  This location gets 5 stars because Frank and his staff were just so good, apologetic, and made things right!\n\nThank you!!", "author": "olga p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-21", "description": "I asked for 6 classic original wings and the guy behind the counter asked me to pick a flavour while pointing to the menu. I told him I wanted 'original' and he repeated himself. So I said, 'well, it says here Original,  Mild Buffalo, Medium Buffalo, Spicy Buffalo, BBQ or Polynesian and I want Original.' So he very rudely says, 'Oh you mean Plain?' Huh? Ok.\nWings not very good and I hate this location but against my better judgement, I came here tonight because it was convenient. Wish I'd just gone somewhere else.", "author": "Miss M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Always received exactly as ordered !!  My fav pizza in the city for sure !!", "author": "Holly D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-02", "description": "So I have read a lot of the reviews for this particular store. It seems a lot of negative reviews are based off a lack of communication with their Internet order customers and accuracy of delivering upon a given time frame estimated by those Internet orders.  So I decided to try the place out for myself.  Mind you this was dine in.  \nI think the food is pretty good. Wings had a great flavor to them. (I got the bbq.)... \nThe pizza was pretty good for crust crispness, flavors, and cheese ammount. The only negative thing I'd say is that when I placed my order they asked dine in or carry out. It was given as carry out, but the server asked if it was supposed to be dine in (as he actually looked at the receipt as he brought it to me). I of course replied yes. He went and transfered it to be dine in. \nSo just a little lack of paying attention behind the counter area when either boxing it to go or putting in the order for eat in. \nOnly negative about how the food was prepared was the fact that they have huge slices of ham. it's not diced down or anything. It's just a huge hunk on a slice and slides off the moment you bite into it. \nSo, overall, good dine in experience.", "author": "Katherine G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-04", "description": "Note to self. Don't call in on Fridays as they were slammed. Been waiting hella long. Apparently their oven was down thus the cause for a serious backlog. #ridiculous as it's 1hour+ and still no sign of my pies....And after almost 2 hours after the call in and peeps saying it's in the oven- no pizzas were made and got a refund. Another case where a shop's supply cannot meet their demand. Not coming back to this one for at least a decade of not longer. Hello Colma or Daly City shops. SF portola sucks big D....", "author": "Neilson V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "I like this place cause you can order ahead and pick your dinner up after work. They are generally timely.  They deliver and they lag on that. They state they will be there by xxpm and they don't show up until much later. \n\nBut, as a pick up place it's nice. Near where I live so after leaving work, i call and it's ready for pickup before I go home. \n\n\nThe food is consistent.", "author": "Dishar R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-18", "description": "Ordered a pizza online and it never came. Called when it was 20 minutes late to see where it was and they said \"any minute\" and then when it was 50 minutes late and they said they didn't have my number to call me. It was entered twice online. They didn't bother delivering. \nSaid they would have to re-make my pizza but it was already 9. Didn't even offer me a discount off my next pizza or an apology. Bad customer service.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-09", "description": "I hate giving 1 star reviews but if I could give negative stars I would.\n\nTonight, 9/9/2015, I called ahead to ask if they had gift cards.  I wanted to buy one to give to my son who buys lunch there everyday because he attends school nearby. They said they did, so I drove in. \n\nWhen I got there, I saw the gift cards.  I went up to the gift cards.  I asked the guy at the counter if they were refillable.  He said he didn't know.  He said he had never sold one. He looked at another employee, slack jawed, who was apparently on break watching the TV, and shrugged.\n\nI ask, 'So can I buy one?'\n\nHe says, 'I don't know how they work.'\n\nI ask, 'So you can't sell me one of these?'\n\nHe says, 'Now I've told you three times.' And walked away.\n\nNow I understand that you must be pretty sad if you are not so busy working at a Round Table on Thursday night.  But this is the age of Yelp, dude.", "author": "John G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-04", "description": "Their dough must have been old. I have had round table at many locations throughout California", "author": "George M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-20", "description": "Great place if you're on a diet, because they don't bother to actually deliver a pizza.\n\nI call as they are trying to close without delivering and they try to multiple times to make up a reason why it was MY fault, I tell them why each reason isn't possible, and they move on to the next one.", "author": "Baru L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "These guys got my order wrong initially, but fixed it with a replacement pizza! The manager Eddie was super helpful, and they were able to resolve the issue in just a few minutes of phone time. Both pizzas arrived hot and relatively quickly (I live over the hill in the Upper Market area), and were nice and tasty!\n\nI'll be ordering from here again when my next Round Table craving hits!", "author": "CMOS P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-12", "description": "Rudest delivery driver ever. How dear you ever comment on the tip you receive. You didn't even give me the correct chicken wings I ordered. Then when you call the manager about your order being wrong they give you no solution. Don't order from this location. $90 for pizza and they don't care to fix their mistake.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "This is the third, and final, time we have ordered from this location. Should have stopped after the first time they were over 30 minutes later than their given time and the order was wrong. But we tried two more times because no other Round Table location delivers to us. This time was the worst, though -- over an hour later than promised and all I got was a lame excuse that the on-line system is wrong. Since I am writing this before we even received the delivery, I may be updating if they got the order wrong again. Regardless, we are never ordering from this location again!", "author": "Heather C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "Reason for THREE stars: I ordered a pizza online and the system automatically created two orders. I was billed twice for one order. They immediately called me six times within 5 mins but i didn't hear the phone as i had left it in my bedroom. I give them a credit for being proactive. When i finally called them, 10 mins after the initial call, i spoke to  a gentlemen who was very helpful, and said the order must have been a system glitch and he would delete it. \n\nAfter i hung up, i checked my bank statement and they had charged it twice as well. I immediately called back and another person answered who was INCOMPETENT and NEEDS to be trained better how to handle and respond to customers issues. When i asked him, the timing of the refund- his reply \"i don't know\" \"its a system thing\", \"YOU will figure it out\", obviously that got me fired up.  Why would i need to figure it out? Had he said once an order is cancelled a credit is generated would have been it...... This guy needs to be kept in the kitchen where he belongs AND not handling customer calls. I guess, thats what you deserve when you don't like to learn the trade of Customer Service.", "author": "Kayvan C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-27", "description": "I don't write a lot of reviews, but this one needs to be made.\n\nLook, I get it.  You're sixteen, and you're being forced to have a job by your parents, or you need some extra money so you can buy some weed.  I get it.  I was sixteen once, too.  But when is it ever okay to answer a business phone with just \"Hello?\".  They do this all the time, and it's not professional.\n\nSecond, they put you on hold, without fail, every single time you call, for at least five minutes each call.\n\nThird, it's clear that the guys (kids?) who work here clearly don't want to be there.  They're short on the phone, bordering on rude.  If you have to hold a job, bruh, you can at least feign kindness.\n\nLastly, it always takes at least an hour to an hour and-a-half to get to you if you want it delivered.  This place is a mess.  I wish I had other options where I live, but this is it.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "Don't order online for delivery or pick up. The expected time to get it is not accurate. they say they have to enter manually. It will take about twice as long to get it.", "author": "Tony P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "They said it would be an hour, which is totally fine...   However, it's been 2 1/2 hours and I'm still waiting.  My fault as this is the third time it has happened.  Last time they gave me a coupon for 50% off my next order, which is the pizza I am now waiting for.  If you are hungry, DON'T ORDER FROM ROUND TABLE PIZZA.  And, by reading the other comments, if I was the owner, I would certainly pay attention.", "author": "Lori N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "This location never delivered to my spot  before. There use t be a west portal location, and im sad its gone. I like my pizza full of toppings, crispy and thin. And RT essentially delivers just that. I used the easy online ordering system, took advantage of the online coupon and got an XL half extra cheese, half pepperoni, and a garlic twist side. They took an hour(qouted 45mins) but the pizza was piping hot, the garlic twists are soo good, and we got an extra dipping sauce... Didnt need to request parm and pepper flakes too. \n\nIll give this location a few more shots and hope the service doesnt chance.", "author": "Benjamin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-30", "description": "I ordered my pizza and the pizza was over 45 min late. It was cold and the driver kept asking for money. He said he needed food for his kids. They refused a new pizza or refund. Don't order here!", "author": "Bryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "Trying to feed a group of hungry teens tonight. They made a confusing order sensible. Courteous. Punctual. Took my mistake and made everything better.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-30", "description": "This place is a disaster - happened to me multiple times - 1 1/2 hrs to get delivery to less than a mile away. Called and had to redial many times and was immediately put on hold...don't order here....", "author": "Thomas C K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-05", "description": "Do not, I repeat, DO NOT order from here. Taking up on the Italian special, I ordered for delivery at 5 pm. They promised it would be here in 45 minutes. I noticed an hour had gone by, so I call in. First, the man said that he thought we said pick up. Then he said the pizza wasn't made yet. Okay, wow. 30 minutes later I call back and canceled the order. \n\nThen the delivery boy calls and tells us he'd get there at 9:30.\nSure enough, he arrives and refused go leave, so I end up paying with 50% off. The pizza was lukewarm. This is ridiculous. VERY POOR SERVICE.\n\n\nTHIS HAS HAPPENED COUNTLESS TIMES. PLEASE, LEARN FROM OUR MISFORTUNE.", "author": "Jade F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "So, where do I start- ok, I ask the cashier how much longer for my order will be (he appears to be lost-probably new.) Then, another employee lets me know it will be about 6-7 minutes. Then an overzealous asian employee brings me a pizza (not the one I ordered!) I'm like \"this is not what I ordered!\" So, when I get my order, I got some really small garlic parmesan (they gave me some extras) and pizzas has additional items (onions, tomatoes,scallions) You know what, I am hungry...so my mom and I just eat. Not sure if I will come back. I've had better at Extreme and Mr Pizza Man. I would recommend getting personnel who knows how to make the food!!", "author": "Nancy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-15", "description": "Come inside to see a man counting money with gloves on.  I said to myself wow they take good precautions to keep the food safe. Then o no he takes my order after him counting up all his tips and then starts to make my pizza. Barf barf barf. I don't like to report people but man that's just foul", "author": "Alonzo T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "This place is hit or miss. Pizza is generally good and warm/hot when arrives, but twice now we have ordered and the order was delivered well over 90min after ordering. Both times the order was \"canceled\" and redone in their system, but we didn't get a call or anything telling us the timing on it changed and if we still wanted it. Courtesy would have gone a long way. The second time they did give a discount, but 15% vs on time pizza? I'll take the on time pizza...", "author": "Martin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "I ordered through eat24. I waited a bit past the estimated delivery time and finally called. They answered despite being closed and helped me. Apparently there was a mix up between eat 24 and the store. I spoke with Ed who was fantastic and polite (despite me cutting him off, sorry Ed). He offered to start up the entire store to finish my order to make up for it all, as a reasonable person I declined (they had been closed for almost half an hour) . He instead offered me a refund and offered to honor my order free of charge in the future. Ed, one manager to another, you did great!  I'm so impressed, I won't order anywhere else or through eat24. I want to hear Ed or know he's watching my order. Give that man a raise!", "author": "Jason E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-06", "description": "I absolutely love Round Table Pizza and have been eating it for about 20 years. Im not usually a big fan off big chain pizza places but Round Table has some good pizza.\n\nHowever, this location for Round Table is the worst Ive been to in 20 years of eating Round Table Pizza. Ive eaten RTP 4 states and a dozen cities. Never have I seen such unprofessional ism and to top it off our order wasnt correct. Note I used to eat at the RTP on West Portal and around 18th and Geary by the Ross and the one by Arguello by the old Coronet Theatre. Only one of those locations are still around and since I was closer to this one by Twin Peaks I went there. Yeah thats not happening again.\n\nSo I went in to get pizza. As a person who used to work in this field what I saw  was bad. There was this short guy working in the front who was yelling at a member of the staff in front of customers, WTF. There was some mistake but you dont do that in front of customers. Plus this guy was very short and rude with helping people. Not only being rude to your staff but to customers. This location also has a really tight kitchen and they were packed in there. Not very organized  which may explain the mix ups. Granted they were busy but still no excuse for that kind of unrofessionalism. To top that all off I saw my pizza wasnt completetly made right but after what I witnessed I wasnt gonna wait around here any longer.  I just wanted to leave. \n\nI made a Yelp mistake and should have checked the reviews before coming here. From now on if I am in the Twin Peaks area and I want RTP, I will drive the 20 mins and across the Golden Gate Park to the RTP on Arguello just to avoid coming here.\n\nAlso the parking lot/area which is no fault of this RTP store has a bunch of unfinished construction and holes, watch you tires.", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "ORDER THE GARLIC TWISTS!! They are so good. The pizzas are so good too! You have to come here and try the pizza and garlic twists. It was very crowded but the staff was able to manage.", "author": "Tatum M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-22", "description": "As much as I love round table, these guys can't get an order for delivery right to save their lives. Every order I've made online takes at least 2hrs. ONe time they even said, oh! you requested that for today, after I called 90min in.", "author": "Tys B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-05", "description": "I had placed an order online and after twenty minutes past the estimated time I called and I had never been treated so rudely on the phone until today. The guy on the phone out me on hold before I could even say yeah that is fine. I had to wait an extra five minutes and asked if my order was on its way. The guy felt it was necessary to say it was my fault that I never answered my phone but I never received a phone call. I asked if I can get it redelivered and he kept raising his voice saying it was my fault. I offered another number since I have two cellphones thinking maybe my reception was faulty and even then he felt it was necessary to still get me in trouble? Really! At this point it has been a little more than two hours and a half and the order has yet to arrive.", "author": "Joaquin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-12", "description": "One of the worst round table pizzas I have ever been to, this and the one on van ness have nearly ruined round table pizza for me.", "author": "H G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-07", "description": "the lack of consistency is appalling - you never know what to expect.  we just waited 60 minutes for a pizza that was supposed to be delivered in 50 minutes.  It was burned!!! you coul smell the carbon upon opening the box.  how this was let out of their shop I do not know.  I called immediately and am now waiting for a replacement.... it has been 100 minutes since we placed the original order -- still no pizza. what a mess!!!!!!", "author": "Theresa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-28", "description": "I was super excited to order another King Arthur Supreme pizza from Round Table Pizza, as I was getting together with several of my friends in SFO whom I haven't seen in a long time.   A week ago, I ordered the same pizza from Round Table Pizza in Walnut Creek, CA and the pizza ROCKED!   Here at the Round Table Pizza on Portola in SFO - the pizza was dissapointing. \n\nLet's compare:\n\nWalnut Creek:  Pizza was loaded with all kinds of goodies, as advertised.\nPortola:  Pizza was very skimpy.\n\nWalnut Creek:  Pizza was hot and crispy, very heavy cheese.\nPortola:  Pizza was soggy, and tasted barely cooked.\n\nWalnut Creek:  Pizza had a whole lot of lovin going on - nicely layed out.\nPortolla: Pizza thrown together.\n\nXL King Arthur Spreme Pizza:  C+\nXL Pepperoni & Mushroom Pizza:  B-.", "author": "Marko C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "Ordered a delivery, and nothing was delivered for 1 hour 20 minutes. When I called to check on the order, the person put me on hold and forgot about me. When I called back, he just said that it was his bad. Then I asked about my order, and he was not even able to tell me if my online order went through. The person on the phone was an idiot and could not have cared less. He kept telling me he didn't know anything about my order. When the delivery person finally showed up, no apology or anything. This is the worst pizza experience ever.", "author": "Peter Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-28", "description": "Do not waste your time with this location. We have tried to give them the benefit of a doubt, but they have CONSISTENTLY failed to provide decent customer service. Not only have our orders been delivered late and room temperature, but the folks who answer the phone don't try to take ownership for the restaurant's mistakes. It is truly a wonder this place is still in business. But it will be two less customers as a result of today's final cock up.", "author": "Dante' T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "The delivery man unfortunately forgot my drink with the order, but ran around the corner to the liquor store and picked one up and brought it back quickly. Above and beyond. Pizza was good too.", "author": "Pierre A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "Here is my experience - take from it what you will.  \n\nI ordered a pizza online (4/5/2013 6:47 PM) and had a estimated delivery time of 45 minutes.  After 90 minutes we called to check on our order and after being put on hold we were told our pizza would be 50% off and if it didn't show up in 10 minutes it was would be free.  Sounds OK...although the guy did just hang up on us without saying goodbye or apologizing.  Not the best service, but whatever.\n\n30 minutes later we called back and told them to cancel the order and they promised it would be there in 5 minutes.  We asked if it was going to be free like they said in the earlier call, and the person told us no, they couldn't do that.  During this call the person also told us that he \"didn't have time for this\".  Again, not the best customer service.  We told them to cancel the order, but the delivery driver showed up anyways (10+ minutes later, a full 2+ hours after ordering) so we refused the pizzas.\n\nWe called the restaurant again to verify that we would not be charged and they apologized profusely and said the driver was returning to bring us a free pizza as way of an apology.  And...that pizza never arrived, which is actually more frustrating than the original pizza not showing up in a reasonable amount of time.\n\nSometimes you just want good \"bad\" pizza and Round Table is the best in that category, but with service like this, why would I spend my money at their restaurant?  Next time I wil spend the few extra dollars to support a local business, like I should have done in the first place.", "author": "Marc B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-13", "description": "Worst service EVER!!!  I have had awful experiences with this location before but wanted to enjoy some pizza while watching the Warriors game so thought I would give them another chance...Big mistake!!  I placed an order for delivery at 7:30pm and was quoted a 50min delivery time.  It is currently 10:10pm and pizza has still not been delivered.  I have called twice and both times was told driver is on his way.  I live 10min away and would have gone to pick it up had I known it would take this long.  I will never service this location again!!!", "author": "A N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "As a pizza lover with a budget, I found that Round Table is the perfect fit. \nI recommend the BBQ chicken pizza.", "author": "C B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-07", "description": "Both times I have ordered for pick up they gave me an estimated time of 45 minutes and both times I showed up they cannot find my order and have to remake it! Seriously guys get your act together! I miss Papa Gino's. East Coast pizza is best!!", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "I wish I had read the reviews before I ordered the King Arthur to go. What was supposed to be a 12-minute wait turned into at least 30 minutes. The pizza itself was not bad. Very generous with the toppings but all in all a little dry. (Maybe overcooked?) Too bad because the employee who took my order was quite cheerful.", "author": "Aleece C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-27", "description": "Not only can't deliver reliably; can't provide info on the phone. Called order at 6:30pm on a Saturday. \"45 minutes to an hour\". OK, fine. No pizza after an hour and a half. Call, wait on hold, ask where my dinner is, they hang up on us. Call back \"it's already out will be there in a minute\". Wait 15 minutes, no pizza. Call again. Ask where my dinner is, put on hold, they hang up on us.\n\nUpdate: I wrote to Round Table via their web site to complain, and got a very polite note back from the manager taking responsibility for the error, offering a credit, and explaining some of the reasons for the service problem. I'm still skeptical but I'm willing to give them a second try now.", "author": "Nelson M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Best round table ever. I keep it simple with just pepperoni pizza. Also the owners are super nice. My go to round table for sure", "author": "Tommy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-13", "description": "I love pizza so its my local place to eat. People in there are kinda ehhh when it comes to service, so I like to call it in and just pick it up. Don't ask me to eat in there cuz that rarely happens. Hence the marks. they get a thumb up and one thumb down.", "author": "Oliver G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-15", "description": "Well, I ordered my pizza at 12:21pm, and it's now 2:55pm and I haven't received my order. I've called there THREE times and was told 1) \"we're really busy, we're making it right now, and sending it out immediately\", 2) \"I don't know when it will be on it's way, we're just so busy\", 3) Um, yeah, it's on it's way\". I ask if they're sure because if it's not, then I'd like to cancel. \"Uh, let me check for sure\"....\n\"Yes, it's definitely on it's way\". That was 22 minutes ago. \nHow can you not make ONE PIZZA in THREE HOURS?????\nDon't order from here based on this alone. I don't even have a clue how the taste is since I still haven't eaten.", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "It always busy here so be prepared to wait 45 minutest to 90 minutes and this is just for pick up. I can say the food is consistent but all it takes is a Domino in the area to open up with better service and I can the owner fix the issues.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "Pizza is a good solid  pizza at a reasonable price.  Mostly disappointed with the website.  Ordered the pizza, input my address, phone number, paid for it with my credit card,but the order still didn't go through. Turns out you have to sign up for their website to have the pizza actually ordered.  Better to call, -less time consuming.   Mark took care of it right away after I called, and gave us some extra bread sticks. Will order again, but only on phone.", "author": "Dennis N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Just had to comeback after a couple years and want to say it looks like this location is on the same calibur as other round tables. Am going to order again. 5/5", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-31", "description": "Order was incorrect. Crust was burnt. Toppings only half way on the dough. I will NEVER order from this location again. #Ideservearefund", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-06", "description": "About 7 months later and the service is just as bad. I'm not really sure why Round Table allows this location to keep the brand name. The service is terrible. I was on hold for 8 minutes - called back and told that there were too many calls coming in for them to take my order. I was put on hold again and then promptly hung up on. \n\nDon't order from this location. It's frustrating and will make you resent what is normally a reputable pizza brand.", "author": "Christian D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-19", "description": "Not sure what's going on with this place but it's gone downhill lately. Long waits for inconsistent quality.", "author": "W M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-08", "description": "From personal experience, I have always loved Round Table Pizza.  As a native San Franciscan, I always loved ordering pizza from the location at 243 West Portal Avenue.  Unfortunately, as time went by, the Round Table at West Portal had to close down, so residents in that vicinity were told to order their pizzas at the Portola location.  The switch over has been anything but pleasant.  Last night was the final straw.\n\nWe ordered pizza using the online method, and I made sure that I asked for \"Delivery\", not \"Pick Up\"; heck, even when I printed out the details, it states that I asked to have the pizza delivered.  So, the scheduled delivery was set for 8:24 pm.  It was already 8:34, and I'm wondering where the delivery person is.  I immediately called Round Table, and asked them why we haven't gotten our pizza yet.  The man over the phone looked up our record and said that we had asked for \"pick up\".  I said, \"that's incorrect\", and before I could go into any further details, the man over the phone wanted to debate with me about it.  I finally said, \"no!  You listen to me, sir!  I have a printout that reads, \"TYPE: Delivery\".  It is all written here, black and white, clear as crystal!\"  There was a long pause for 30 seconds, and then the guy finally says, \"okay, I'll have someone deliver the pizza to you in about 5-10 minutes.\"\n\nNormally, I would say, \"never pay 'full price' for late pizza.  In this case, because the man over the phone wanted to debate with me about the status of delivery or pick up, and the fact that he never apologized for the mistake, I said, \"there is no way I am paying any price for the pizza.  I will gladly give the driver his tip, seeing that it wasn't a driver issue, and in addition, I will highlight the area on the printout that reads \"Delivery\", and hand it to the guy.  Otherwise, the pizza is on the house.\"\n\nSo, the delivery guy shows up, and points out that they had docked $10.00 off the original amount; the final amount was equal to the price of a medium pizza.  Give me a break!  I respectfully declined to pay any amount for the pizza, and explained to the delivery man that the person I spoke to over the phone was rude and wanted to debate with me on whether I asked for delivery or pick up.  He gets on the phone and speaks to his manager, and in the end, we ended up getting a free pizza.  Unfortunately, because the pizza was cold since it had been sitting at the pizzeria for more than 20 minutes, it just didn't taste the same.. even with the few reheated attempts we made.  The crust was hard and chewy, which is NOT how Round Table Pizza is.\n\nI agree with the other reviewers that they shouldn't receive any stars at all.  In addition, they have lost me as a long time customer.  I will never order pizza from this location again.  In a nutshell, I still have the utmost respect towards the Round Table Pizza franchise; they still make a really good pizza.  I just think it's a shame that there are some employees or branches out there that give the company a bad name. :(", "author": "Claudine P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-08", "description": "I ordered one pizza online. ETA was 54 minutes. They called shortly after and said it would be an additional 30-60 minutes. Okay fine. Finally, pizza arrived 2.5 hrs after initial order and it was barely warm.", "author": "Johnson B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-17", "description": "Manager reached out via phone call and mail. Apologized and offered free pizza to try  delivery again. We did and this time service was right on time.", "author": "Russ C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-02", "description": "I like their pizza and have enjoyed it many times. It also has the nice feature of being the closest pizza place to the boyfriends house in West Portal.\n\nHowever, we live a couple blocks away and usually just order delivery even though we could hop in the car and pick it up in a couple minutes. After a long day, especially a late evening, pajamas and delivery are more important than picking up your own pizza or making your dinner lol\n\nDelivery here can be questionable sometimes. We once ordered a cheese pizza that took two hours to get from their oven to our doorstep only a few blocks away. Not  acceptable even if we lived 2 miles away.\n\nTHAT SAID, the owner was very accommodating after this incident - and I do like the pizza.\n\nWe still order from here, but we do have our expectations lowered a bit for delivery.", "author": "Ennis O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-22", "description": "What is the acceptable wait time for the inevitable and unintelligible \"Round Table Pizza, can you hold?\" answer when you call? To me, over 2 minutes you have a problem, over 5 minutes and I start working on finding a new pizza delivery joint.", "author": "Bob M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-08", "description": "Ordered my pizza over the phone for take out at 5:10 and they told me it would be ready in 20 to 25 minutes. Waiting waiting waiting and at 5:40 they are just now putting my pizza in the oven. Booooooo. Ain't nobody got time for that. Lol.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-28", "description": "In general, I find the idea of yelping pizza/fast food chains somewhat pointless - being franchises, the food is supposed to be rather uniform across the board at all of their locations.  Unless we're talking about some major failure, it's all relatively the same.  At that point, you're just commenting on the workers and general service.  That said, I just wanted to write a brief note about this Round Table.\n\nCouple of months ago, I called in an order here for a large Italian Garlic Supreme pizza for the Super Bowl, and I was told that it would take the usual 20 mins or so.  I showed up to pick up my order, and it turns out that they had some sort of error (computer problem I was told) that resulted in the wrong pizza being made.  They quickly threw together the right pizza for me, and promised me it would take no more than 7 minutes.  I was a little miffed, since it meant not getting back until after the game started, but nothing I could do but sit and wait.\n\nHowever, to help make up for the problem, the girl was nice enough to give me a drink while I waited (not that big of a deal), but also threw in an order of Garlic Cheesey Breadsticks (bigger deal).  For her to volunteer it without me putting up a stink or asking was a nice and unexpected gesture, especially at a place like this.  Sure enough, about 7 minutes later, the pizza was good to go and I was on my way home.  In general, I usually don't come to places like this unless I'm in a time crunch, but I appreciate the gesture they made to make up for their mistake.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-12", "description": "Only one star -- really it should be no stars!!!!  We ordered two pizzas last night. We have out-of-town company staying at our house. All of us were hungry. We were told it would be delivered in 45 minutes. So, what happened when the 45 minutes passed? We called them to get a status and guess what they said? They told us it would be another 45 minutes.   They straight up said that they had not even put the pizzas in the oven yet. Are you kidding me?! Never again will we order from this place.  What a joke!\n\nWe called North Beach pizza on Taraval Street. Ordered the same exact pizzas and were able to pick them up in 20 minutes. Oh, and guess what? North Beach's pizzas tasted really good. So, Round Table, bye-bye!", "author": "Gigi F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-01", "description": "Normally I like Round Table, but the service at the Portola restaurant is terrible. We've waited more than 2 hours to have pizza delivered from there.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "My friend and I ordered individual pizzas for delivery.  I ordered online which wasn't that easy but I got it to work.\nThe pizzas came right on time and the delivery boy was friendly and pleasant.\nMy friend ordered a small pizza with Italian sausage and extra cheese while I ordered a personal pizza with mushrooms.  The pizzas were hot and just as ordered.\nI missed the little containers of red pepper and Parmesan cheese so I got some from the cupboard.\nThe pizzas were not spectacular but they were tasty and filling.  I prefer to use local pizzerias but for a chain these pizzas were not bad at all.", "author": "Philip C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-15", "description": "By far the worst Round Table I have ever had. My pizza was burnt on top and my dough seemed stale. My wife's thin crust pizza was so gross, she had to throw it away.  Usually RT has a higher class of pizza than Pizza Hut and Dominos, but not in this case!", "author": "Joe B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-18", "description": "Think back to your grade school pizza party. Remember that bastard who never ate the crust, but kept taking more slices? \n\nThat's the kind of person Round Table appeals to.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-16", "description": "This is a tough review to write since this is one of my favorite pizza places but a few days ago I ordered two extra large pizzas, bread sticks and a salad total coming to $50+ dollars. When i was eating my salad, I looked down on my plate and there was HUGE wings of some kind of bug. It looked like moth wings or something. I was disgusted and threw it out. I couldn't find the body meaning I probably ate it. The bug also wasn't from my house because I had only been eating for less than 5 minutes and I would have seen a fly that large fall into my food.  I'm just upset because $50 dollars isn't cheap so I expect higher quality food.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "This location would have a 5 star rating if the cashier Frank  was more pleasant. The pizza was hot, and fresh after a wait of 20 min. And all the other employees were busy working and all smiles. We ordered a pizza to take back to the bar next door because we were watching the NBA playoffs. When I went to the counter to order I asked Frank if there were any specials. I seemed to of annoyed him with this question because his only response was \"it's in the window\" I turned around and there was a picture of a pizza in the window but no pricing I asked him how much is it and he pointed up to another sign. I told him forget just give me a large baconator. I handed him my card and he walked to the back with out a work after. Few minutes he came back out and tossed my card on the counter said a comment to another employee, And they came and completed my transaction. Food great. Service terrible", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-30", "description": "I should have read the reviews before I ordered! I go on-line, I make an order. I wait, I wait, I call them up: \"What pizza order?\" And then I'm feeling good, because by then I don't want the damned pizza anyway. How can you stay in business when you run your business in this way? I like Round Table, but there's no way in Hell I'm going to give these people my business again.", "author": "Tom B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-28", "description": "Ok, so I am usually a fan Round Table, as they are one of the better chains in terms of quality. But what we received on this particularly lazy Wednesday evening was pretty sad. Sad, cold and expensive.\n\nI can't recommend ordering from this RT especially if you live in the Sunset. Delivery takes about an hour and what you get is probably not the kind of pizza you were craving with stringy, gooey melted cheese :(", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-05", "description": "My friend ordered online at 5:30 pm and at 7:30 pm, no delivery came. So he called them to inquiry what's the hold up only to find out that the order did not go through. He received his receipt and we thought everything was fine, but it wasn't. \n\nMost importantly, this wasn't the first time that an event like this happened.", "author": "Ken N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-19", "description": "Pretty nasty the quality of food; service is schizophrenic: sometimes nice and at others the cliche \"I really don't want this job and you making me work makes it even more inconvenient\" sort of service.\n\nThe positive was that there was a tip jar so I pretty much had more control over that aspect of the bill.\n\nThe seating areas aren't cleaned up; there was a nice flat screen tv but it was on too loud.\n\nThe only truly positive thing that comes to mind was that it was nice to go to an establishment in San Francisco where there was actually parking that wasn't a half mile away and immediately available.", "author": "Tony U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-09", "description": "I'm usually up for pizza when the moment calls for it but when I took a bite out of the ones from this specific Round Table's... I was rather disappointed. When I eat my pizza, I like the bottom to be crispier and stable so my pizza isn't all floppy and such. When I want to eat a pizza, it shouldn't be difficult for me to stick it in my mouth (e.g. angling your head awkwardly so the slice would go into your mouth). \nUnfortunately, this round table's pizza was unsatisfactory in the crispy department. I had a few instances where I was going to stick it in my mouth and it totally flopped on me and smeared a bunch of oil on my chin. I hate that feeling - the paranoia of getting acne from pizza oil *shivers*. I am not picky with pizza toppings which round tables is superb in terms of selection but what really matters to me (the crispiness) was really lacking and I was not impressed.\n\nP.S. Sorry for the sexual innuendo.\nP.P.S. If you didn't see any sexual innuendo, don't attempt to search for it.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-12", "description": "After moving to the Bay Area, it didn't take me long to notice that Round Tables are everywhere up here.  I hadn't really been before, but it was clearly the pizza chain of choice for the Bay Area, and, I'll admit, the geek in me liked the Arthurian theme.  So, when I moved to a spot only a block from a Round Table, I figured it'd be my go-to pizza place.  \n\nHowever, after giving this place several chances, I have to admit the pizza's just not that good.  In particular, the toppings feel like they're just sitting on top of the pizza, rather than a part of it.  They're also too dry.  Now that I've discovered Mr Pizza Man, I've never looked back.\n\nStrangely enough, though, the Round Table pizza at the airports (the Oakland airport anyway) is completely different and much better.  I thought airport food was supposed to be worse than its real-world counterparts.  Maybe the trick is not trying too hard.  So Round Table is now my primary food source in OAK.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "I like their new flat-bread artisan pizzas.\n\nIt's $6 for a \"half\" which feeds one person nicely.  The tomato-pesto one is bomb though the pesto looks like an oddly glowing green colour.  The pepperoni-tomato one is ok, a little salty, but completely edible.  I didn't try the chicken one but it looked decent.\n\nI also think Round Table has the best veggie pizza for fast food/takeout.  Too bad they're so damn expensive compared to everywhere else.", "author": "Kimiko Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-28", "description": "I called in and I thought it was the WP location. The one at WP closed. :( That makes me sad.\n\nAnyways, I got the Italian Garlic Supreme -- like usual. It was a tad salty. Heh.. REALLY SALTY ACTUALLY. I was gasping for water and I downed at least 3 bottles of water upon completion of the pizza.\n\nI just can't get enough of the Italian Garlic Supreme though. It's amazing.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-09", "description": "I wasn't even going to do this but you know what, i wasn't a sastified customer...\nNumber One- I call in for delivery, they said somewhere between 45 minute to 1 hour. I was totally fine with that, however my pizza came over 1 hour and 30 minutes. (I called in to see if they forgot) \"the guy that answer wasn't very friendly, telling me the guy was on his way.\" you know what forget about the wait, they're lucky I wasn't that hungry.\n\nNumber Two- My pizza was fucking cold? are you kidding me...enough said.\n\nNumber Three- The delivery guy ask me if I wanted cheese n pepper. That was nice but he gave me enough for like 4 slices considering that I had to use 1 pouch for like 2 slices was very sad.\n\nNumber Four- my crust was burnt, not very nice \"Round table\" \n\nwith all due respect to you guys, YOU SUCK. I was actually looking for a place to call in about every week or few days to have pizza because I LOVE pizza but after this experience.....no more round tables.\n\nP.s. I would give them a second chance for sure if they had some respect for the customer but that wasn't even descent enough to give me a 2nd thought. sorry 1 star because I can't give 0", "author": "Thanh K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-28", "description": "Pizza delivered 90 mins after placing order online. Enough said. Avoid.", "author": "Darren C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-13", "description": "Not that clean inside, especially at lunch.  A lot of kids come in here and trash the place and the staff is slow to clean up.  greasy pizza handprints everywhere.  Cashier will usually give you ranch dressing for your pizza for  free if you ask nice.\n\nThey deliver but don't expect parmesan cheese, peppers, napkins and plates unless you ask for them on the phone.  even then you might not get them.\n\nHave some Tums ready, their pizza is delicious but will hit your stomach like a brick.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "I've got one word for you: rountablepizzaisawesome.\n\nSure, you won't find it in a dictionary. But it doesn't make it any less of a word.\n\nGranted, we didn't come to this location, just ordered takeout. Had a 50% off your entire order coupon in the mail. I guess they're doing their best to divert traffic from their former location in West Portal.\n\nBut whatever. If you've been to Round Table, you already know what you're going to get. Zesty fast food pizza.\n\nEven though coin-op games are no longer the rage, I will always have a spot in my heart reserved for Round Table.\n\nAnd when I mean heart, I really mean stomach.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-27", "description": "Ordered a pizza to be delivered online. After an hour it never came, so phoned the business and they had no record of my order. And, they basically accused me of lying. Bye-bye Roundtable Portola.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "The King Arthur and the Gourmet Veggie pizzas are superb. The service is so-so, you often have to wait 5-8 minutes before you can order on the phone. Most of the time they get the order right but they are inconsistent.. sometimes the extra-crispy pizza is soggy, often they promise delivery and are really tardy....I stopped giving my credit card to them on the phone because they would lose it and request cash at the door anyways... still the pizza is really good usually!", "author": "Alex B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-21", "description": "After a great experience at the Round Table on Geary, I thought I would give the neighborhood Round Table a shot.  I ordered a chicken and garlic gourmet for pickup.  What they gave me was a garlic supreme(different pizza) and food poisoning.  My appetite was crippled the following day.  Not cool, I NEED TO EAT!\n\nI would not go back.", "author": "Will L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-13", "description": "My first time ever eating a Round Table, but still probably my last given the large selection of other pizza places to go nearby. The pizza wasn't that great for the price, it was alright, but nothing amazing for a $22 three topping large pizza. The crust wasn't very fresh, it tasted like it had been frozen at some point. We were still kind of hungry even after finishing that off, it wasn't very filling.", "author": "John T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-22", "description": "I've always been a Pizza Hut boy since childhood. I moved to Twin Peaks about a year ago, and go figure no one really delivers up here. I was never really a big fan of Round Table Pizza. I've ordered from them quite a bit since moving to the area, and it wasn't until last weekend, I finally took notice of this location in particular. As we all know, I don't have a problem putting folks on blast if it's deserved and warranted. I've never really had any issues with this location, other than the occasional the delivery guy forgetting to bring Parmesan cheese or being a little late. This past weekend they were actually close to an hour late (and go figure I was beyond hungry). I called to find out what was the hold up. Supervisor Nate mentioned thy got slammed and he apologized. Additionally, he would credit me half the am", "author": "Terry D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-20", "description": "We have ordered from Roundtable numerous times in the past and they generally do an OK job. This time they took well over an hour to deliver our food and by the time it got to the door it was cold hard and inedible. I call the store and they did apologize and said they would credit  us the next time we ordered. When we subsequently placed another order a week later they conveniently forgot and said they didn't know anything about it.\nDon't promise what you don't intend to fulfill! We have stopped ordering from them!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-23", "description": "I'm taking back two of my stars. When I thought that Round Table was my only delivery option to Monterey Blvd I thought this place was a savior, but now I've come to the conclusion that it's average, at best.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-10", "description": "I've been ordering from this location for the past 5-7 years.  In general, I think Round Table Pizza is pretty good. I've had some difficulty with this loc, so we prob won't be ordering from them anymore.  Today there was a long brown hair in the pizza.  I called & Ricky the manager apologized, but with consistent late, cold pizza, I'm going to go elsewhere.", "author": "Sunset S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-07", "description": "What I ordered:\n\n- small extra cheese pizza with light sauce\n- 6 garlic twists with ranch\n\nThey made everything the way I wanted, and they found my apartment fine, and the delivery guy was really nice, but everything was cold. I understand that my pizza is going to not be fresh-out-of-the-oven hot when I get delivery, but still. I've ordered from places that were farther and everything was still hot when I got it. I don't understand :( It also took an hour and ten minutes on a Tuesday evening for a small pizza and twists that take like 13 minutes to cook total. Sad. Never ordering delivery from here again regardless of how much I love Round Table.", "author": "Sydni S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-21", "description": "My high school son had a couple friends over so i said i would order them some pizza. the delivery took over 90 minutes and i called to say cancel the order (all his friends were gone and i ordered over $100 bucks worth) instead the still sent the delivery driver and instead of apologizing he was to cool for that. Didn't apologize (too worried about how is cap looked) and i still paid. Of course i only took one of the pizzas and paid for that. basically bad management. yo need to have someone to make customers happy when you screw up. i used to order from here twice a month.", "author": "Jamie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-21", "description": "Called to order pizza at 7:15pm.  Called again at around 8:30 to find out where pizza is and was told that car is 5 minutes away.  After 30 min, no pizza still so called again.  Manager said I did not talk to anyone in the restaurant.  OMG!  By this time it's almost 9pm and I haven't had dinner.  Was offered pizza to be delivered.  No thank you since I was accused of not having spoken to anyone in the restaurant.  I'm in disbelief.  \n\nPlease beware if you're ordering for delivery from this place.  Make sure you get names of who's taking your order.  Better yet, think twice about ordering from this place.  \n\nI wanted to give this 0 stars but was not allowed to do so.", "author": "L F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "I decided to try this Round Table location for the first time tonight because I wanted to catch part of the 49ers football game, figuring there should be a tv.\n\nWhen I went in, I found that this is almost certainly the smallest of the chain that I've visited. They did not have very many tables nor seats.\n\nOtherwise, service was fine. I ordered the personal King Arthur Supreme. Like other locations they bring it to your table. They only have 3 beers on tap, but at least on the menu they show more choices in the form of bottled beer.\n\nFine pizza and Blue Moon beer on tap. Too bad the 49ers lost to the Saints on the game's final play, darnit!", "author": "H K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "I really like Round Table pizza and want this place to have good service so I keep trying.  But the long holds, long delivery times, and cold pizza never improve. Yet somehow people keep ordering here.  Look at the list of bad reviews people - don't buy your pizza here.  After today, I hate to say it, I no longer will - very sad. Get it together Round Table!", "author": "Steven P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "round table will always have a special place in my heart! i've been coming here for a long time and they never seem to disappoint. my favorite special pizza is the italian garlic supreme with green onions, purple onions, crap load of garlic, chicken, with the short crispy crust. they have the best crust, not that kinda crust where it gets dull and tasteless. every bit of that crust is salted and garlicky if i may make up my own words. \n\nalthough prices have gone up,  XL garlic supreme was 26.85, i still have that occasional need for a pizza chain that is delicious and not as greasy and is known for making outstanding pies. chicken wings are also awesome with ranch. get it, girl.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-25", "description": "No show on pizza. Order 1945hr on 9-23-11 with 12 pieces chicken wings. Call 2050hr was told in 10mins. We are only 10 mins away. Call 2105hr was told its on its way. I don't think it was even made. It was totally BS. I gave them 1 star just for telling me BS that its on the way!", "author": "Randolph T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-21", "description": "I'm actually surprized to be adding this review, but it's the first time I've had REALLY disapointing pizza from a Round Table location. As a chain, it should be rather predictable, but at this location on this one recent first visit I was like WTF??\n\nThe box felt light and not very hot when I carried it home even though it just came out of the oven. Well the reason was:  SKIMPY PIZZA! \n\nThere was very little cheese, especially on the outer 3 inches or so - no cheese at all really. Well that was a first for me - rip off. Cheese near the center only.  Some money saving technique I expect.  Also I only had one topping which was black olives and that was skimpy as well with some slices being olive free all togther!!\n\nMaybe I came on a bad night or maybe there is a person that doesn't really know how to make a pizza working there....or it really is a way to boost profits.\n\nIn addition the pre-made salad was also very short on substance unlike other locations.  so again WTF? Not a value at all.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-31", "description": "Tonight, I had the worst experience I have ever had with Round Table. I've been eating Round Table pizza since I was very young. It has always been my favorite pizza. I recently moved and had to switch from my regular location. I placed my order and an hour later I called to see where it was. The rude kid on the phone said it would be another 30 minutes. When it arrived 30 minutes later, my order was lukewarm, the breadsticks pencil-thin, my pizza was wrong, the sauce and toppings lacking and the driver forgot my soda. \n\nI called immediately and spoke with the manager. He was very nice and apologized. He upgraded my pizza size and soda, said he would make it himself, and would send it out ahead of all the other orders. He said it would \"hopefully\" be delivered in under 30-45 minutes. I didn't understand how it would take so long if it was ahead of ALL the other orders. An hour later I called back because nothing had arrived. As I was waiting, the pizza arrived. When I asked the guy where my soda was, he was defensive, unapologetic, and simply said, \"They just told us to make the pizza again. I don't have it.\" That explanation doesn't make sense to me, as there was a new ticket with my new order, with a 2-liter soda on it. When I opened the boxes, these orders were worse than the first ones.\n\n I am so disappointed for so many reasons. I wasted 2 and a half hours, and $25, waiting and calling. I have 4 boxes of inedible pizza and breadsticks and I can no longer have my favorite pizza delivered. This was an awful way to end my night. I understand things happen, and the few times I have had any issue with Round Table, they were handled perfectly. I am in absolute shock at the lack of service and quality of this location. I don't understand how they are still getting so much business that it takes so long to get orders out.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-21", "description": "NO STARS!!! I wish I could leave such a rating because this place is completely and utterly aweful. Nothing gets high marks.\n\nService: Ordered pizza. One simple medium pizza. Time of deliver = 2hrs later!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n~Yes I called twice and asked where it was. Always got the response \"It is on its way\"\n\nPizza: When it FINALLY arrived. It was cold and unattractive. Taste wasn't spectacular.\n\nIf you need pizza from this area....try elsewhere....in Fact I reccomend Orgasmica...I should stuck with ORgasmica for f**k's sake.\n\nBleh~", "author": "Jade I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-02", "description": "Fast ON TIME delivery!!  Wow!\n\nI ordered a cheese pizza online today hours in advance of dinner as we are expecting a few little kids over with some friends.  I told them to deliver the pizza at 6:30pm, and they delivered it RIGHT ON TIME.  BING!\n\nPizza looks good too.  Traditonal RT quality, which is pretty good stuff, and way ahead of the other large chains.", "author": "Harry W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-06", "description": "This review is from an experience I had a couple of months ago, in November 2010.  I'll never go back.  I should clarify that this review is bad because of the extremely poor customer service we received.  Their pizza is actually pretty decent for a chain restaurant.\n\nWe had ordered from this location about a dozen times since the WP one had regularly screwed up our orders.  This location still sometimes screwed them up too, but less regularly, and had been cool about it when they had.  Apparently the workers get easily confused by the names of their \"specialty\" pizzas, which tend to be very different pizzas with similar names (particularly the \"gourmet\" and \"garlic\" ones).\n\nAfter dealing with a 50% or so screw-up rate previously, I am VERY clear with when placing orders.  Since I started clarifying EXACTLY what I wanted, Round Table had been more accurate.  We always order the same thing.  Half-and-half, with half Chicken & Garlic Gourmet, and half REGULAR veggie (if you say Guinevere's Garden Delight, they tend to mark it veggie gourmet, which is totally different).  When I called, the guy hurriedly rushed through my order without repeating it, though I managed to squeeze in a reminder that the veggie side was regular, not gourmet.  He couldn't get off the phone fast enough.\n\nWe picked up the pizza, and after we got to the car, found it was half Guinevere's (fine), and half Gourmet veggie (?!).  We took the pizza back in to show them it wasn't what we had ordered.  \n\nThe belligerent a$$ at the register told me that he had taken my order and that's what I had gotten.  My jaw dropped.  I explained that I knew what I had ordered because we had ordered the EXACT thing the last dozen times, but he continued to argue that he'd taken the order correctly.\n\nInstead of just admitting it was a mistake (which is understandable -- he's in a noisy room with a TV blasting and multiple people babbling), he indignantly  told me I couldn't get my money back, but begrudgingly offered to make another pizza, if I wanted to wait.  I told him that was fine, since we considered half of the pizza we got inedible.\n\nHe obviously was pissed off, and I watched as he made the pizza, as I was pretty sure he was going to do something disgusting to it.  He looked repeatedly back at me to see if I was watching during the pizza-making process. I can't say anything gross happened, but it was overall a weird, jarring experience.\n\nMistakes happen.  I'm okay with that.  But to blame the customer in such a confrontational manner was just appalling.\n\nIn the end, he couldn't even bring the pizza out himself.  He sent one of the kitchen staff to do so.  I was so disconcerted that I gave the pizza to a some homeless people.  I hope they didn't get sick from it.\n\nThere is NO excuse for treating a customer like that.  NONE.  I'd still consider going to other RT locations as I do enjoy their pizza, but I'll avoid this one like the plague.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-25", "description": "If me and my bf are too lazy to cook, we usually order pizza from here...\n\nThe King Arthur Supreme with anchovies is the best!!!!  \n\nThey're pretty quick on delivery..though I had one gripe from last night...the delivery guy who delivered my pizza was a punk!\n\nThe total on my order was $31.19 and I handed him $40 and he just turned and was about to walk down the steps..I was like EXCUSE ME can I get change please???  HELLO!!! Idiot!  I'm not giving you no $9 tip fool !  That irked me so bad and my bf was about to go after him, but I did get my change back!!!\n\nI'll still order pizza from here, the last delivery guy was extremely nice, giving me extra cheese and peppers PLUS some mints!  I hope I get this guy next time instead of the punk kid trying to take my money!!!", "author": "Jade B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-18", "description": "The pizza arrived in an hour and fifteen minutes. I was placed on hold for approx. 5 minutes when I called to find out where the pizza was prior to arrival, they hung up the phone on me before I could inquire and had to call back....placed on hold again for approx two and half minutes. Finally I spoke to \"Frank\", he explained to me that they were busy and seemed very stressed out over the phone, I got a very insincere apology. The delivery person gave me a smirk and came across very cocky and not caring about his tardiness. The pizza arrived luke warm at best. When I called back to speak to \"Frank\", I was placed on hold again this time for approx. 9 minutes. I expressed my concerns.......he explained again how busy they were today and finally offered to re-make the pizza only after I asked for the store# (753) and the manager's name (Mr. Kamau Jones), I declined because on how the delivery person's attitude was. I don't want to eat a possibly contaminated pizza. Horrible service and I will continue to complain to a higher authority if need be. I paid $30.00 plus a $5 tip for a cold pizza and bad attitude's from your employees!", "author": "Jorge R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-29", "description": "Love this place!  The service is great and the people are very helpful, accommodating, and friendly.  We've used this location for many, many years and they have never let us down.", "author": "Susie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-04", "description": "Ordered a pizza for delivery. They told me it would take 45 minutes to an hour. Sounds reasonable right? An hour an 20 minutes passed by until we decided to call them. They told us 45 more minutes. They clearly forgot to make our pizza. Never ordering there again. This has never happened to me anywhere else.", "author": "Kazz E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-27", "description": "Met up with my hubby here for lunch. This Round Table beats others. We ordered the lunch specials and the pizza was great with the perfect amount of ingredients and friendly employees. All in all a nice laid back joint with hot and cheesy pizza for the foggy peaks.", "author": "Trish B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "I have been ordering from RT at this and their other recently closed West Portal location since President Nixon was in the White House.  Their pizzas are made from very fresh ingredients and their sauce is the best!  I like mine cooked a particular way and they always make it the way I ask, even on busy nights.  The delivery guys are pleasant and the food gets to me hot.  You can count on getting a well prepared and hearty meal at a fair price.", "author": "Storm J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-28", "description": "If you like to eat clean food, stay away from this location. The employees are not sanitary and they do not wear gloves. The employees hands and nails are dirty (looks black), filled with all types of chemicals used to clean up their area. Don't be surprised if you get food sickness. If you complain to the owner Jeffrey, he will tell you not to come back to this location. Stay away from this location if you don't want to get food poisoning and terrible customer service.\n\nJeffrey is the owner of this location and Pops sandwich next door. He trains his employees to have crappy customer service just like Pops sandwich. So it's understandable that it has bad reviews. Don't bother complaining cause they will give you a rude attitude and do something to your food. Avoid this place and Pops sandwich at all cost. Check my other reviews to see what they did to the sandwich I ordered and read what happened when I complained.", "author": "unknown u."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-02", "description": "After not using them for a few months, I decided to give them another try. They immediately put you on-hold (seems standard even if they are totally not-busy), then make you sit on-hold for 5 minutes. I hang-up, try again, same guy, same standard 'please hold' then wait 5 minutes. Hear guys bs'ing in the background before click to hold again. Wait 5 minutes, happens again. Told guy I have been waiting, he apologizes then puts me on-hold again. Call back one last time and before the same guy can dump me on-hold again, I tell him I am calling someone else to get pizza since they don't want the business. \n\nI encourage you to give them a try if you have low self-esteem and time to waste. If you are like me and many others who just want pizza delivered, try Extreme PIzza or Mozzerall Di Bufalo in West Portola. \n\nThese guys are a joke.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-27", "description": "Decent.\n\nGood pizza. \n\nTiny place. But, they had the soccer game on, so that was nice. \n\nThe salad bar looked edible.", "author": "Misha F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "After posting my awful experience at this location and also emailing headquarters.  I have to say I was contacted by the manager who apologized about the bad service and made good by a gift certificate and letting me know that the little prick who worked there is gone.  I ordered pizza a second time and receiving good service and prompt delivery.  Thank you for making it right RT.", "author": "Ray A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-18", "description": "Are you the one delivering my pizzas?  cause the one at portola in store is awesome.\n\nThis is the one that delivers to my inner sunset home?\n\nCause if you are..... oh my gosh you suck.\n\nRound Table is my favourite pizza ever, and you can judge me.  But as a lover of it, this one sucks.", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-29", "description": "As far as pizza goes, Round Table is consistent from location to location. Service on the other hand can vary significantly. Tried to place a phone order for pick up at this particular location and was placed on hold so many times that I eventually gave up. \n\nRecommendation, order at the West Portal location. The staff there is nicer, a whole lot cleaner and they seem to actually want your business.", "author": "Rick C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-02", "description": "I've had spotty service from this location, but this one took the cake. I ordered a small Garlic Supreme from them the other night and was told 1 hr. to 1:15. Fair enough - they're busy.\n\n1:30 - Call again to ask for an update. \"The driver just walked out the door. It'll be a couple of minutes, sorry we were slammed tonight.\"\n\n2:10 - Call again and tell them, \"You know what? Just cancel my order. I'm hungry now and am going to forage in the fridge.\" \n\nthem - \"But the driver just left a second ago and is headed there right now!\"\n\nme - \"I don't care, you should have called and let me know if it was going to be this late. Not to mention you told me 30 min ago that the driver was just leaving then. What's up with that?\"\n\nthem - \"I didn't tell you that, it was someone else.\"\n\nme - \"I don't care *who* told me that, it has been well over 2 hours now and no pizza and I'm hungry. Just cancel it.\"\n\nthem - \"It's free! It's free! Just tell the driver that it's free. It'll be there in a minute.\"\n\nme - \"whatever. Look this is really horrible service. You need to look into that. Although I doubt I'll be ordering here again.\"\n\n2:35 - pizza arrives (After I warmed up some delicious dandelion green and goat cheese pasta with garlic bread I made the night before.\n\nDriver - \"that will be $12.40\"\n\nMe - \"You manager said it's free\"\n\nDriver - \"OK. here you go\"\n\nNot at all surprised? Hmmm... could this be a common occurrence there? Yeah, that's it the last pie they'll ever make for me.", "author": "Peter T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-24", "description": "I have eaten at the location as well as had it delivered. It is usually hit or miss. The smaller pizza's are almost always good, but the larger you go the gooier it seems to be. \n\nOrdered once and waited over 1 hour and 20 minutes (when food arrived it was cooked and then mushrooms were thrown on) told us they forgot to add mushrooms so went back to store to put them on? Weird but the management gave us our pizza free.", "author": "mary f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-21", "description": "I needed a quick bite before we were heading up to PDX on tour and stopped in as they were closing. Honestly, I had the best service I had ever experienced from a chain-pizzeria. This Round Table is great: Chris. You rule!!!", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-07", "description": "I think I'm sticking with the Round Table at West Portal.  First off that one at least sorta feels like a restaurant so you can sit and eat without feeling too out of place.  This one was obviously thrown together just for carryout pizza, the 3 booths were so dirty and covered with stuff and the 3 little tables they had were no better.  Also the walls were plain and looked like no one even cared enough to hang up a single picture on the wall.  \n\nSo let's say this is strictly for take out.  Well the pizza still wasn't that great.  First off it was burnt.  It was more blackish than any other color.  The toppings were just thrown on there, not even distributed at all evenly, one half had more sausage than anything else and the bacon somehow just clumped in one corner.  ( we had one of the ulti meat pizzas).  So nevertheless that was a huge let down.  \n\nThe buffalo wings were good and so were the Parmesan twists.  But as good as they were, when you are a pizza joint, I would hope that you would master the pizza, the very thing you are supposed to be known for.  \n\nIf I were to come back here, I'd get the wings and twists and skip the pizza.  Or I would go to the one at West Portal and get the pizza, wings and twists there.  \n\nThe staff was nice though, I will say that.  Now if they could clean their tables off after customers leave, and maybe hang up some pictures on the bare walls, and work on not burning their pizza, we'd be set.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-06", "description": "Today the girl collected my cash.  Then she helped another customer who paid with cash.  THEN she proceeded to make pizza while using the same gloves she used to collect the money.  I guess the oven kills off the money germs.  Just don't go for one of her freshly made salads.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-22", "description": "Its a west coast chain......a simple pizza.  I found the crust to taste a bit like something ud find at a carnival....you know with the small holes in the crust so it wont rise??\n\nWe got the King Arthur.  The ingredients were tasty and the pizza was juicy which is important to me.  One major flaw was the over saltiness.    You really need to suck down a sweet soda with their pizza.\n\nId like to try another RT pizza with just mushrooms and see how the saltiness fairs.\n\nOverall, I would go back only if my partner REALLY wants to go.", "author": "culinary q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-07", "description": "I'm a sucker for Round Table pizza.  Nothing fancy but consistently good.  And they deliver on a schedule, which is really great.", "author": "Anne C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-13", "description": "I've changed my review from 4-stars to 1-star because I am sorry to say that, after years and years and years of being on West Portal, this location has closed down.  Apparently there were some conflicts between the owner and the manager or something along those lines.  Whatever the reason is, we're sorry it's no longer in the neighborhood,", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-28", "description": "30mins late. I ordered a BBQ chicken pizza and what I got was marinara sauge,chicken,red onion with BBQ sauce drizzled on top. Wtf..", "author": "Claudia S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-19", "description": "I must agree with other yelpers, This is probably by far one of the worst round table I've been to. Honestly, it deserve 2 start because I'm in love with the garlic twist, and.. it's close by where I love.", "author": "Lianne D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-25", "description": "When you charge $20+ for a pizza, you should be able to afford more competent help than disgruntled, stoned teenagers.  (Not that I have anything against disgruntled, stoned teenagers.  I just don't trust their customer service or...uh...sanitation skills anymore than I do my OWN from back when I was a disgruntled, stoned teenager.)  And heaven forbid you have more than one person working at a time so that pizzas can get made and tables can get cleaned at the SAME TIME.  These are shocking suggestions, I know...", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-11", "description": "I would normally give Round Table 4 stars based on the usual quality and service I'd minimally expect.  This one however, gets three.  I don't enjoy seeing the same kid who made my pizza 5 minutes before, smoking a joint in the parking lot.  Call the manager and say \"so and so was out in the parking lot getting high\" and get a disinterested response.  It's not cool.  Homey don't play that game.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-14", "description": "I use to work on west portal and the only reason i went to this place was because it was affordable and one of the few non waiter restaurants on the street. The employees that worked here were horrible. Multiple times they forgot about my order. Most of the people that work/worked (changes frequently) here are mid 20s burn outs who think they should be working somewhere better even though this is actually where they deserve to work. I usually got the lunch sandwich deal and it was a good sandwich at a good price but it was not enjoyable to eat here. It is also very small inside so I would recommend getting take out from this place if you really want some round table food and this is the closest one to you.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-17", "description": "It's OK, but I wasn't to happy with the pizza I got. The taste, the tempreture, the price. Everything wasn't right that day. Maybe I just had a so-so day.", "author": "Alla S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-26", "description": "In beauty school I learned about two things...good food and how to do a finger wave.   I went to beauty school in San Bruno and most of the girls were bay area natives unlike me the BA transplant.  So I'm used to buzz worthy SF places like the ones on yelp(Country Station and Weird Fish).  But the girls in beauty school knew of all the local divey places and the good chain places like Round Table.  It's refreshing since SF peeps easily turn their noses up at perfectly good food for no reason other than it's not cool.   I don't really love pizza I'm more a rice and noodle kind of girl.  But every once in a while I crave the gooey stuff and particularly from Round Table.  I never crave any other kind of pizza.    Anyway I have ordered delivery twice and it's been really good every time.  I love their sauce and the crust is the best unlike it's oily nemesis the pizza hut crust. Yummy!", "author": "Joni S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-26", "description": "I like eating here, and they have a salad bar, but theyre so rude on the tele!!!", "author": "kim w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-07", "description": "This place was cool. I liked going here in 2000 when I finished watching a movie down the street.  Nice, Clean, okay prices, and delicious.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-19", "description": "I like Round Tables better than most pizza places. There are some independents that obviously make better pizzas, and those are the ones that are a little more pricey. For price and quality, I think Round Table is good news.\n\nThat being said, this Round Table isn't as good as others. There do seem to be a little more toppings, which is good, but less crust and less cheese, which is not good. \n\nIf it was like NY style thin crust, I wouldn't complain. But in this situation it tastes and seems like they are going that route to save money. Too bad it affects quality.\n\nThey do some great deals with coupons, though. Quality isn't as important in those instances, so if you are getting a deal, go for it! Otherwise, it is just an ok pizza.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-14", "description": "I usually order delivery from here and have never had any problems. My order always shows up hot, yummy, and on time. However tonight I went in to pick up my order myself and was pleasantly surprised. The guy behind the counter was so polite! Something you don't see in people these days. My pizza can out right on time and with a smile. My food was extra yummy tonight because of the great staff!", "author": "Karen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "I used to come here in middle school for pizza and I still come here when I'm around the block. I love Round Table Pizza and this spot makes the pizza in a timely manner and are pretty friendly. The place is kind of small in the front, but in the back there is seating for a nice small party.", "author": "Edgar G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-17", "description": "I've had this twice now.  We didnt have round table pizza in new england, but i liked this right away.  I've had the pineapple and the vegetarian, which has lots of really good veggies and is so tasty!  I've only had the soft crust, but its really good.  This has been takeout at my friend's house, so i havent seen the actual building. the pizza comes on time and is not greasy at all.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "Good pizza, but I would recommend picking-up or eating-in. We placed an order at work today for delivery and had to wait about an hour for our pizza!! It was also kinda cold by the time it arrived. But, other than that, good pizza, especially when I get a pizza craving. Mmm!", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-27", "description": "Mmm...Round Table...all of them...the chain, it's the best of the best (of all the industrial, frozen dough, coupon-offering) chain pizzas you'll ever have.", "author": "G J J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-18", "description": "I went here last Saturday night and the place was absolutely disgusting! We had to wipe crumbs off of the seats before sitting, the floor was littered with dirty napkins, pizza crust and used plates.  The tables weren't wiped down, the bathroom was awful.  I could maybe understand if it had been really crowded but there were only 3 people in the place the entire time we were there.", "author": "Johanna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-08", "description": "Decent. Typical chain pizza place. It's definately nothing special. The pizza comes out better though when you know a employee!", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-17", "description": "The pizza could have tasted better considering I had better pizza at other local Round Tables...Plus the employees look like they never wash their aprons and look dirty and untidy! Very small dinning area and shakers are greasy and nasty to even use seems like no one ever wipes them off with sanitizer or anything this place is nasty!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-02", "description": "the pizza is the regular round table pizza here, which isn't that great to begin with.\n\nbut i am completely disappointed in the garlic twists here. The only reason i subject my arteries to this stuff is for the garlic twists, and i dont know what it is about the ones they make here, but they are discus ting. Damn you this round table for ruining my garlic twists!", "author": "Casey Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-14", "description": "VERY generic pizza. Taste and looks like it came from a gas station. Not horrible just very forgettable. wings are baked and have no sauce, garlic bread was very good though. Overall i probably would not order again but the price and service was better then most.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-07", "description": "the pizza here is delicious! Yummy! The crust is unforgettable! I always crave it. Be careful, may be addictive.", "author": "Pascal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "crust surprisingly thin and crispy.  wombo combo is great. 25min - fast delivery for friday night", "author": "Henry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-23", "description": "So I can't really comment on this particular restaurant location, as I mostly just use them for delivery, so my review is just about the pizza.  And Round Table is By Far my favorite pizza as far as chain stores go.  I just love the hell out of it.  It is damned expensive, I must admit, and you don't get pizzas as big as the Wheel of Fortune like you do at so many SF hole-in-the-wall delivery establishments...but those places all suck.  They do; they suck.  I thought I liked Mr. Pizza Man for a while there, and granted they are cheap as hell, and when it is 1:30 in the A.M. they can be a life-saver, but sometimes you are more than just hungry--you want something that Tastes Good.  And Round Table tastes good.  It's the ingredients, man.  So many pizza places, I'm afraid to order sausage or black olives, 'cause often they just taste WEIRD.  Round Table sausage and black olives do not taste weird.  And I love them for that.  Now if only they had better coupons!", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "there bbq chicken is really good!  the poeple here are really friendly because for valentines i asked if they could help me arrange the pepperonis in a heart shape to give as a suprise.. but instead they went all out and even cut the pizza dough shape into a heart!", "author": "christy w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-14", "description": "Sadly, we ignored the other reviews and ordered from this location.  It's hard to believe that a pizza place could be so inept, but they actually are.  Save yourself the frustration we and others have experienced and bypass this place for one of the many other SF pizza restaurants that can handle the basics of on-time pizza delivery.   This franchise gives the Round Table brand a bad name; it is a shame the owners don't respond to the multiple poor reviews and bring in capable management.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "Oh how i love your pizzas! But a star off because your pizza delivery is terrible! I mean 1hr for 2 medium pizzas? I was starving by then ..", "author": "amandaaa s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-21", "description": "ok. my parent's cleaners was on the same block as round table back then, and i grew up eating pizzas here and remember great things. nowadays i visit the area once in a while and the service has changed a lot!! i went there the other week and the workers acted busy. standing around staring at a customer tahts trying to order, isnt good service. i had to wait a couple minutes before they could even take my order. regardless of service i tried to be nice because of such great memories had here, but its not the same as it used to be. \nwhen i picked up my order, i ordered a liter of coke to take home(i was in a hurry that night) i paid for it, they never brought the soda out!!!!! me being in a rush totally forgot to ask for it, but still.... when a customer buys a drink, you should bring it out right away. \ni wonder if jeff is still the owner. he was very nice, and always hooked it up. he knew how to handle customers. very professional and kind hearted.", "author": "sam k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-07", "description": "not remmend any one buying $10 pizza. hard, no any filling in dry pizza. i usually buy pizza there in regular pizza. not bad . however there are promot this cheapest in their anniversity . but it was terrible. you would better buy in frozen pizza in store.....", "author": "kthy k."}
