{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "I stumbled upon the streets of Polk on a dark foggy night and right into the abyss of Royál Oak, it instantly became my enchantment.\nThis dimly lit of a bar/lounge is a perfect place to unwind.  I am extremely obsessed with the decor of this place, It is absolutely purrrrfect. \nAmbiance-check\nDrinks-check \nService-check \nPayment- cash/card (which is a plus because most bars on Polk are cash only) \nI've yet to check this magical place out on a crowded weekend night.", "author": "Adrianna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "It's reopened again! Love the dusty vintage decor! It feels more genuine rather than contrived. The bartender is super fun to talk to and is willing to mock up cocktails with and for me! New regular haunt!", "author": "M U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "This bar has a great ambiance and environment to it. The place is filled with old \"royal\" looking furniture. Although we went on a Friday night, we were just about the only people there. The one complaint I do have is that in the time being of us there, the bartender played the same mash mix up of songs four times in a row.", "author": "Emma J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "Great place to relax and have a lovely drink. Stephanie at the bar was very attentive and entertaining.  Nice atmosphere, love the eclectic decor.   Lovely speakeasy.  Will return, again and again.", "author": "Patty D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "The hours at the Royal Oak are really undependable.  They're usually not open.  However, when they are open, they have a lot cushy seating to chill.  \n\nThe place reminds me of a furniture store that focuses on restoring Victorian chairs with velveteen covers.  It's one of a kind on the sports bar block of Polk Street.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-03", "description": "My new favorite in town! Great service by Stephanie, amazing vibe, great atmosphere,  good prices and selection.", "author": "Bob H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "Wow, this man must have lost his contact- why else would he awkwardly be reaching onto this chair pushed under the table? Wait, he is wearing glasses!\n\nGuess the reason is because that is where  my North Face jacket was before it was stolen. Sucks to be caught in the act, sir!\n\nDoes anyone know this man? (!!!)\n\nGiving the establishment one star, since when I approached them about the theft they called me a liar.", "author": "Aviva F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Love this place!! Cool laid back vibe. Excellent bartenders that will tailor drinks to their customers. Love that! The kind of place that is rare in San Francisco.", "author": "Kelsey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "This bar is awesome!! It is a very cool place to hang out with friends!!  The decor is also very cool. They don't make bars like this anymore!!", "author": "Leonidas G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-18", "description": "Stopped in because we were looking for a chill place for a drink and conversation, and this was the only not-crowded bar (on St Patrick's, no less).  This was the world warning me, and me not listening.\n\nIt looked like a nice cocktail bar, but then...\nme: \"can i get a Sazerak?\"\nnice bartender: \"...sazawhat?\"\ngf: \"uh...do you have a cocktail menu?\"\nnice bartender: \"yea...we keep thinking we should make one of those...\"\n\nSo, we get our drinks (which were actually pretty good), pay, take a seat.\n\n5 minutes later, the bartender comes over.  \"Uh, hey.  The owner's here, and she didn't like your $20 bill.  Do you have another one I can trade you for?\"\n\nYep.  The bar owner had never seen an old-format (1996) bill, and so she thought it wasn't real.  She then sent the bartender over.  To get different money.  He was super nice about it, but wow.\n\nAnyway, this place...", "author": "Ethan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "See comment above ! Great place family owned for 40+ years .... Love\nCatherine and her staff!!!", "author": "Anne J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "I don't write many reviews, but I just got home and this needs to be shared. And this is why we don't go here...\n\nI'll give this place a positive on the decor and ambiance. Pretty different vibe in sf, and typically less crowded, which is nice. That's essentially where the positives end. \n\nBar service. I'd recommend having more than 1 bartender working at 10pm on a Saturday night. Call it business insights, call it common sense, this is just plain wrong. Waited 12+ mins to order from a reasonably/minimally occupied bar to order 4 beers. Ok, not ideal, but I can deal. \n\nHere's where I draw the line: Customer service. \n\nTowards the end of our time at the bar, around 11pm while we were heading to a different bar, my girlfriend starts to feel sick (food poisoning we later found out). She heads to the bathroom to throw up. \n\nI crack open the door a few minutes later to check on her, since our friends just left for the next bar. I'm greeted by the same unfriendly bartender who served me earlier, explaining to me that she's \"watching over my gf\", who clearly is sick in one of the stalls with no help while this bartender is putting on making on the other side of the bathroom. Can I come in to check on her or help while there's no other patrons in the bathroom? NO. I'm not allowed, as I clearly hold my girlfriend's purse (not an intruder, clearly only trying to help my girlfriend).\n\n2 seconds later, older lady who works at the bar barges in while I'm slightly holding open the women's bathroom door. Rudely asks me to leave. Ok, I relinquish the door duties, hoping that my girlfriend is ok inside. 2 additional seconds later, a bartender fellow comes up asking what's going on. Immediately eyeballs me, without hesitation, asks for my ID. Now, let me explain, I am 2 weeks from my 30th birthday and look nowhere near resembling a college sophomore. I explain to the fellow that I'm likely older than him (he looks 24), but I oblige and show him my ID. Results in escalated, rude tone, and begins asking a barrage of additional clarification questions about why I'm waiting for my girlfriend and what's going on. I can't recall the details of the exchange, but out of my group of friends, I'm the passive person, and in this instance, he had my blood boiling. \n\nMy girlfriend proceeded to handle things herself OK in the bathroom, and we left immediately thereafter. This was one of the most chill dinner nights I've had with friends in SF in the last few months, and I was really surprised at the direct, rude interactions with multiple staff of the bar. Not once did any of the 3 staff even simply ask if she was OK, or how they could help. \n\nLong story short, there is a clear and karmic reason that this place is consistently not crowded, not popular, and very likely hemorrhaging money. I do not recommend supporting their business based on morals and ethics.", "author": "Kyle F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "I was crushed after the Warriors lost last Sunday and forgot to close out the tab I had started earlier in the evening.  I planned to pick up my card after work on Monday when the bar reopened.  At about 3 pm Monday, my credit card company called me as they had noticed suspicious activity on my card.  Someone had run a thousand dollars of charges on my card all around the Bay Area. \n\nThis establishment hires criminals and I will never go there again. Watch out!!!", "author": "Melanie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "It's an absolute shame. This bar has so much going for it - beautiful atmosphere, classic fixtures, good drinks, Tiffany lamps, friendly bartenders, and decent beer selection. However, it is all an unfortunate trade off for one major pitfall: THE MUSIC. Not only is the music selection (cheesy dance/trance mixes) horrible, but it is way too loud for the type of atmosphere fostered here. \n\nTo management - keep your image consistent. Everything about your bar follows a great theme, aside from the music. Turn the dial down and try something more laid back and with some substance: Thievery Corporation, Nightmares on Wax, Classic American songbook...anything but the mismatched, blaring garbage currently played.", "author": "Anil C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-08", "description": "Cool spot and I like the vibe.  I stopped in here for a drink after dinner and was having a great time with my date.  I rated it two stars because I ended up ordering a beer that was flat, but the bartender didn't believe me.  She told me she wasn't a beer drinker and that she would take my word for it but when I ordered something else she charged me full price.  I thought it was standard to replace a flat beer with a different beer for no charge but apparently not here.  Too bad, but still a place worth checking out.", "author": "Nathan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "The Polk Street Bars are great for a pub crawl!  If you plan on stumbling into anywhere for dancing this is a great place to go to!  \n\ni wouldn't say it's the best, but it gets the job done if you just want to have a fairly decently open dance floor to dance the night away.\n\nGenerallly, they've played top 40 and hip hop the times I've been around.  Good music for me to groove to!", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "Absolutely the worst service I've ever had. Waited 40 minutes for 1 beer from a drunk bartender. Ordered 5 times and waited so long. Busy bar, terrible service. I can't even believe they would hire someone that would be drunk to serve me beer? Coming from out of town to come to SF and can't believe it's been this inconvenient at this establishment.", "author": "Kastania C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-01", "description": "What a hip bar with fancy lights in the Tender-Marina.  I never new this was here and with a name like Royal Oak I can't say I was thrilled to attend.  Upon walking up to this spot I realized the lights were the main draw in catching my attention.  The music was a mix of hip-hop and house with good beats throughout the night.  The crowd wasn't very mixed in the since that you could tell every white Marina individual who has ever felt out of place by their community has come forth in hordes to show their faces.\n\nGrab a couch and you'll be surprised at the sights you see while sipping on decently priced drinks.  Have fun.  Relax.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-27", "description": "This is a terrible bar. If it were on the show Bar Rescue, Jon Taffer would tear it apart. The bartender was drunk. Took forever to take my drink order. After she finally took it, she started unloading the dishwasher and taking other drink orders. Then she comes back to me realizing she screwed up and asked for my order again. Then when I received my drinks she made the wrong ones. Gave me a totally wrong drink (all I asked for was a whiskey ginger). She hands me a bill for the drinks that seemed like she made it up on the spot. My credit card got passed around to three different people behind the bar and took five minutes before it finally got back to me. The bar was not that busy and they still screwed up. \n\nOh and the bathroom had a pool of piss on the floor from a broken toilet. No one cleaned it up all night. \n\nThere are much better bars in the area.", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "The decor is what drew me in, the complete lack of service is what drove me away. I arrived around 10 pm on a Friday night, the place was close to empty. I tried to order a beer but was told they had run out so I ordered a different one. 10 minutes later when I still had no beer in my hand I walked out.", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Awesome low light, old-world atmosphere, strong and fairly-priced drinks, and polite bartenders and bouncers. My friends and I only had a great time here, even though the music wasn't great it was much better than most of the surrounding bars. I really like the place and it's probably the coolest bar in the Russian Hill neighborhood on Polk street.", "author": "Dominic B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "This place is awesome! The drinks are cheap and the bartender is nice. Especially the the one beer + shot for 5$ is worth mentioning. The beer selection is good. The interior looks like a mash up of 70s disco and 30s Tea Room furniture with a splash of 80s lights. The music was alright when we were there.", "author": "Shit H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "After a hard day of stealing Inca gold, running from giant sized boulders, and general all around swashbuckling adventure, I like to kick back with a whiskey ginger ale in the confines of the dimly lit Royal.\n\nThe decor allows me to live out my 1930s well traveled adventurer fantasy with hot bartenders and awesome drink specials to boot.\n\nThe only thing that could make this place cooler would be a badass tiger statue containing a hidden lever that automatically refills my glass with DRANK.", "author": "Sam J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-13", "description": "ATMOSPHERE:\nKinda pale in comparison to its neighboring bars. Not bad place to chill and catchup with friends over a beer tho I suppose. \n\n10.17.13", "author": "Angela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-24", "description": "Two stars for the couches and ambience.\n\nThe bartenders were impossibly rude. They served all the drinks with attitude. At ten oclock they had the audacity to tell us to leave, because they got to go home when the last customers left. The really ought to be fired.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-14", "description": "The music absolutely ruins this place.\n\nBecause other than that it's wonderful. It's one of the few places where you can actually sit down and have a conversation with people in Russian Hill. The antique seating is amazing, the lighting is great, the ambiance is right on.\n\nBut they always play these terribly awful dance/trance/house mashups that are dated, cheezy and totally wrong for the bar's overall atmosphere. If I want to dance I'll go to Bullitt or Rouge. You can't dance with 50 antique couches filling the bar. It's physically impossible.\n\nIf the owners of this read this review PLEASE change your music lineup during the week. I love your bar, it's right down the street from me, but the music is just awful.\n\nPlay some classic crooner music, Motown hits, classic hip hop, indie, acoustic, ANYTHING other than what you're playing.\n\nHell, get a jukebox and make some money. But for God's sake...do something because I really, really want to hang out in your bar without feeling like my ears are going to puke.\n\nTwo stars because the decor and seating of the place is fantastic but the music makes me suicidal.", "author": "Corbin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-17", "description": "The atmosphere is fantastic, everything else is pretty average. \n\nThis is not a bar I go to because of their fabulous cocktails, or super awesome bartenders, yet it is one of the places I like best on this area of polk. The dimly lit stained glass lamps, the comfortable old (yet classy) couches, and the fact that its never SUPER packed (like most places in this area), make it a recommended stop. \n\nThey take cash or card, I have had some good bartenders and some ok ones, the drinks are not better or stronger than anywhere else, but very on par. If you're just looking for a cool ambiance and a place you can sit down with a group and enjoy a few drinks, this is your spot.", "author": "Jess K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "This place is nice.  The bartender is cool.  The decor is what I call \"stuck-up seductive.\"  They have some flat screens showing either sports or music videos, which is fine, but what I don't understand is why there is a giant light fixture hanging immediately IN FRONT OF the tv at the bar.  Logic was missing the day either one was installed, apparently.\n\nThey need to serve some food or at least some munchies.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Cool bar in an area with LOTS of choices. The drinks were prepared with care and are inexpensive for SF. I had the cucumber tonic and the wife had a gimlet. Cool Bartender, thanks Furio!!!", "author": "Joe K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Great place. Well made beverages! Really cute bar and on the weeknights, there aren't any douche bags :) Thank you, Mike!", "author": "Disco B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "This place is a fantastic place to chill with friends. One of my favorite places on this side of town. And the people who work here are really awesome and friendly :)", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "I only pop in from time to time, but the staff is always a friendly bunch. The classy decore is inviting and definitely a place to share a drink with a friend or a date. The bathroom is also very clean which is always a plus.", "author": "Benjamin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "So glad we spotted this gem since we were silently getting kicked out of nick's crispy tacos in the middle of watching the warriors game on wednesday. -___-\nWalked down the street and found this semi-empty bar with the game on the tv; so of course we barged right in and sat close to the tv. \nThey had a special going on which was get one of their selected beers (i got a corona & my bf got a Heineken) plus a shot. Beer + shot = $5??!! What a deal! And to top it off, the warriors beat the spurs! Woot woot!!\nI didn't even notice the decor in the bar until after the game. It reminded me of the roaring 20's, and felt the need to watch the Great Gatsby coming out soon. Lol..\nAt least there's plenty of seats and tables and everybody to get all cozy. \nI'd probably come here again...", "author": "Navy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-31", "description": "Could be a great place, if they didn't hire DRUG ADDICTS. Saw one of the bartenders doing Coke in the bathroom. She should be fired- for managements reference it was a girl with short brown hair.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Amazing service. Was the Victoria's 2nd night and went above and beyond to make everyone happy. Extremely hard to do in this city and when you are in your own. I will recommend and come return! Thanks Victoria!", "author": "S C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "I can't quite figure out if this place is a club or a bar... the place is set up to be a bar with tables and chairs and booths everywhere for you to sit and hang out, but they play blazing music that causes everyone to dance up in between the tables and empty aisles making the whole experience really awkward because someone is hip thrusting next to you while you're sitting. \n\nComing here on a Saturday Night at 11pm means the place is completely packed, but upside is eventually you'll find your bar niche for the night, the bartenders are pretty nice - i got a drink without a problem, so sit back and get cozy with your friends because that's the only way you'll be able to hear them.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Im a fan - I just moved into the neighborhood and pass by during the day and will love it here I just know it!!!", "author": "Page D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-11", "description": ":-) I like the atmosphere of this place: decorations in tones of dark woods and reds, velvet \"antique\" couches that give you the feeling you're hanging out in someone's living room back in time, live and  healthy looking plants, big windows... It can be quiet during the week, which is what I prefer, but very busy on weekends!\nService has always been good to me. The bartender Briana is a sweetie!\nOnly draw back for me is the bathroon, it needs a little TLC...", "author": "Luci P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "Super fancy lounge with sticky floors and good beers on tap. This place surely has an identity crisis. Are you a bar? VIP lounge? \n\nThe sticky floors were quite distracting, but you hardly notice after a couple of drinks and meeting a couple of strangers. Service was quick - No BS from the bartenders and no attitude. \n\nWe came on a Friday night and there was no cover. A nice save, since a few bars in the area already had a cover. The crowd was really chill and we actually met some pretty cool people. That's a rarity in SF! \n\nGood crowd. Chill bar. Comfy seats. Reasonable drink prices. Count us in for return-sies!", "author": "Mar A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-27", "description": "Yea this place has a misdirected vibe.\n\nUsually I love places with seating, of which they definitely have plenty accomodating our group of about 18. It was just SO freaking loud in there that a friend and I felt like our neck muscles were sore from all the screaming to communicate with people. Really not a pleasant way to wake up.\n\nThey should figure out if they are trying to be a bar/lounge or a club and tailor the space on way or the other. Probably won't be back.", "author": "Raina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "This is my fave neighbor go-to. I love the old funky grandmother's living room vibe it's got with the gorgeous wood, tiffany's lamps everywhere and mirrors (ok, the tiger is weird, but i'm sure there's a back story for it). They've got a really friendly staff and even though it gets annoyingly packed at times, for the most part it's a good amount of people and isn't too hard to snag a couch and table spot. \nCash only which can be a bummer if you aren't ready for it, but it also makes (at least me) way less likely to wake up the next morning wondering how many drinks I actually had where all my money went.", "author": "Audrey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "I'm currently at the bar so I can provide a realtime simulated experience for you, the future satisfied customers.\n\nWhen your foot first touches the unkept burgundy carpet, your nostrils will be pleasantly kissed by the aromatic candles cluttering the bar shelves.  \n\nNow open your eyes.  The 15 Tiffany chandeliers (shan-del-ee-aye for you classy types) glowing softly overhead and the Victorian furnishings will make you feel like it's high tea at grandma's after Sunday service, except you're here to get drunk, not talk about who's recently courting Ms. Mary Louise - that skank.\n\nI would have given this place 5 stars if it weren't for the shitty caca bathrooms.  Imagine being on a 14 hour flight with one lavatory and you are the very last person to take a shit. Think of a solitary confinement chamber in Russia without toilet paper.  Or, a raccoon who got himself stuck in a sewage line.\n\nSpeaking of butt stuff - Sasha.  OMG (that is the first time I've used that acronym) she has a nice ass.\n\nWake up......Go to Royal Oak.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-16", "description": "Finally went here after all these wondering what it was like - curiosity is quenched.  Ehh...it was all right.  I was confused by the ambiance - old-style Victorian looking furniture, palm trees, sports TV playing in the background and heavy base music too loud to talk over.  Ahhh...must be getting old.  We only stayed for 5 minutes tops, wasn't too keen.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-07", "description": "Cute little spot, bar hopped to this spot late NYE.  It was really crowded and I didn't get a chance to really check it out but I do recall the smell of vomit... It WAS NYE after all.\n\nGood music but I'll need another visit before I add any more stars.", "author": "Cynthia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "we weren't in here for very long, but in short, it was a huge sausage fest of the kinds of guys i'm not into.  now i usually don't mind sausage fests (obviously), and i don't mean to sound like i'm in love with myself, but people just wouldn't stop staring.  probably because we were the only girls there.  the people were just so awkward about it... they could have used a little more discretion.\n\nthere were some foreign guys there with stickers on their faces too.  so weird... you may be european, but you can't get away with everything!!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "it was nice and quiet.  rare for this neighborhood.  Great bar if you can find a seat", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-22", "description": "Likes: the colored lights, the couches and oak tables, plus we weren't carded to enter, only for purchases\n\nDislikes:", "author": "Karen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "If you're going to go here, don't go later than ten. We got a couch in the center, but by 11, the place was too crowded and under staffed. Two bar keeps, one of which was slow and drunk. We has two rounds over two hours because I spent 30 minutes ordering the second. Place had style and music was good, which brought my rating up from 2.", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "Comfortable couches, living room style. Dim lit room. The bartender is nice. Loud music, but you can still talk over the music. The vibe depends on the type of music being played. When we walked into the bar/lounge there was hard core rap music on, which I wasn't a fan. So I asked the bartender if we could change up the music, and she happily changed it to house music. Much better. Thanks!!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "Stumbled upon this bar while making our way through the Blues Festival on Polk St on a Sunday afternoon.  The niners were playing, so naturally we had to find a place to watch the game once we had our fill of blues music.  What reeled us into the Royal Oak was the beer + shot special for $5.  The list of beers for the special included some of my go-to's; the shot was either Jameson or a fireball.  Decent options of poison for the price.  We sat at the bar, our view of the TV somewhat obstructed by a huge chandelier that hung right in front of it.  Still, we were able to enjoy the game and got a nice afternoon buzz from a couple beers and fireball shots.", "author": "Thi D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-19", "description": "I'm confused, is this place supposed to be a lounge? bar? or club? \nBased on the cheap drinks and bartender's attitude, I'd say it started off as a laid back bar, but then the additions came. The seating area is filled with velvet chairs, old world couches and mismatched tables, almost got a coffee house vibe to it, so you'd think it's a lounge or sit-down bar. But there is no way to have a conversation due to the BLARING club music. Oh, and there are palm trees and neon lights mixed in with the velvet couches... Kind of feels like the owner's too many ideas of what he wants this establishment to be and can't choose one, so he combined them all. Wasn't a bad experience, just weird, prob won't be back.", "author": "Claudia Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-16", "description": "It's a good change-of-pace from your typical Russian Hill-side Polk Street experience, but there's this one bartender there who consistently gives me sass.\n\nOn one specific visit, this bartender (henceforth to be known as OTLD - \"Overly Tall and Lanky Dude\") offered me a free drink. Given our tenuous relationship, I was taken aback by what appeared to be a peace offering. Could it be that OTLD was turning a new leaf and our previous troubles were going to be water under the bridge?\n\nNope.\n\nAs I was cocking my head back to take the shot as dramatically as possible (false bravado in an attempt to show appreciation), I instinctively asked what it was I was about to drink. The answer?\n\nOTLD: \"I don't know.\"\n\nMe: \"Huh? What do you mean you don't know?\"\n\nOTLD: \"I mean, I don't know.\"\n\nMe: \"Dude, you're the bartender. How can you not know what you're pouring?\"\n\nOTLD: \"I didn't pour it. [The drink] has just been sitting here for awhile, no one's drinking it, and [the other bartender] and I can't figure out what it is.\"\n\nMe: \".......................\"\n\n...and the grudge continues.", "author": "Leo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-26", "description": "Have you been to a better fern bar?  It's been in the family for decades now and is great little escape... where else to get lost in a corner with a drink and some friends or double dates... and as of recent they have a great new craft beer from a couple hundred year old german brewery... It was delicious.. micro bubbles...", "author": "Adam O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "Awesome place! I loved it and they definitely take card. Beautiful bar and great drinks!", "author": "Ashlee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "Was my first time here over the weekend, and I was impressed! The ambiance was really cool! I particularly liked the fact that the patrons were all different ages. From 20's to young professionals in their 30's to 50 year olds, everyone was getting their drink on. Aside from the main bar area, they had big round tables and booths you could sit in. They looked pretty comfortable. We stayed at the bar to people watch. I only drank beer, so I can't really comment on how well they mix drinks, but I do know if you want a glass of wine, this is not the place to come. My friend wanted a glass of white wine and there was only one Chardonnay option for $12. Anyway, the name \"Royal Oak,\" is truly fitting and I'm looking forward to returning.", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "Cool little bar. Very laid back in a part of town where it's hard to find a laid back bar. Nice furniture, as well. The only downside is that they close before 2.", "author": "Zach H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "Cozy waterhole in Russian Hill.  3.5 stars\n\nCost to worth it ratio: 3.5\n\nHighlights:\n- Maroon walls\n- Foliage\n- Stained glass lampshades\n- Dark ambiance\n- Small\n- Inventive bartender: I asked for a cocktail using vodka and not sweet and got some unique ones\n\nLowlights:\n- Cash only\n\nBrings back memories--we used to frequent this place a lot in our post college all of us were single party days so it has that nostalgia quality going for it and I'll stop in time and time again for a drink.", "author": "Eve K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-13", "description": "Uh, what? Sorry, I can't hear you. My ears are still ringing from the fist-pumping music that was BLARING when I went to Royal Oak on Friday night. Which would be great if this place was actually a club... but it's not. It's a sit-down bar. WHERE YOU ARE SUPPOSED TO HEAR PEOPLE TALK. \n\nIt's too bad, really, because the sit-down areas are pretty neat. Plush, vintage couches and high-backed antique chairs everywhere, stained-glass lamps, that sort of thing. Kind of like if someone inherited a bunch of stuff from an old relative and put it all in one room. But the eclectic decor is pretty much the only redeeming quality about this place; my whiskey sour was poorly mixed and too expensive, I could barely hear my four other friends who were sitting right next to me, and--here's the kicker--the TVs were playing The O'Reilly Factor. Disgusting.", "author": "Stefanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-06", "description": "Where did they get their couches?  My best guess is the set of Midnight in the Garden of Good and Evil.  Or the fantasia of Truman Capote.  Or maybe the mansion of a Southern Belle that escaped to live on Nob Hill after her husband struck it rich selling supplies to miners during the Gold Rush.  Regardless, I dig. Not your $7 well drink price.  Come now, that's inflation.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "I didn't hate it here.  Less douchy than a lot of nearby bars.  I didn't say no douchy.\n\nCash only - that's douchy.  Fuck all, there goes my hidden $20.", "author": "Meg W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-23", "description": "This place is nice. I like the red decor and palms. They play good music. I almost wish they had a dance floor, I liked the music that much. It doesn't get overly crowded and we were able to find seats easily.\n\nThe bathrooms on the other hand, that's a different story. Two of the lights were out over the toilets, and it was dark as night in each stall. Couldn't see a damn thing.", "author": "Patricia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-17", "description": "I've (somewhat surprisingly) had some fabulous times at the Royal Oak. If you want a bar where you might be able to sit down on Polk Street, I think the Royal Oak is one of your best options. It's cash only which can be advantageous if only the boys you are with are carrying cash and they want to buy you beverages ;) Some memorable times:\n\n- started friend's birthday bar crawl here; one of our friends created the \"Summer hairdo\" of our friend out of cardboard so that we could all sport Summer's bob!\n- I really wanted a mojito but they were out of mint so my friend ran across to the market across the street, bought fresh mint, and they prepared a great mojito for me with this mint!\n- I got bet $30 that I wouldn't drink a mixed cocktail including beer, cosmo (not sure whose it was...), etc... I willingly accepted the bet, got several cheers, and the rest of my night was paid for\n- we took over a huge table and played several dice games with the dice you can borrow from the bar\n\nOverall, great times are to be had at the Royal Oak! During the week, it tends to be a pretty chill, living-room-ish bar but it gets much more hopping on the weekends...", "author": "Meghan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Came here on a Tuesday night and had a pleasant time. It wasn't too loud or crowded- I could have a conversation with my friends without screaming over the music. The bar has a really nice atmosphere- its more of a cross between a bar and a lounge actually. Old fashioned sofas and Tiffany lamps give the Royal Oak the charming air of a 1920s parlour. Drinks are reasonably priced. I would definitely come back here when I'm in San Francisco next because of the cool atmosphere. I love bars that don't feel like bars.", "author": "Yoshi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-09", "description": "This place is GREAT! It really has everything a bar on Polk should have. Great music, strong and CHEAP drinks and the staff is ridiculously friendly. The manager of the place really cares about making it a top notch bar, so he's been making improvements to the place almost daily. They just put in a few new bar lights that really tie everything in. Our bartender Stefani makes the best drinks in town, hands down...solid gold...so good this place should be a club.\n\nIf you're looking for a good place to grab some drinks mid-week, this is the place to do it. We went on a Wednesday and there was a good crowd for being in the middle of the work week.", "author": "A V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-23", "description": "This bar has a cozy ambiance, the lighting is dim and the seating includes comfy couches, and upolherstered chairs that feel like velvet.  Came with 2 friends on a Saturday night around 9 pm and we sat at the bar.  Bartender took our drink order and she suggested to us the special that ended at 10pm: Beer and shot for $5.  We all decided to take up the special, Stella and fireball shot for $5, not bad for a Saturday night.  The bartender was nice enough to chill the shots.  \n\nThis is nice, but I came at an early time so I do not know how rowdy or lively the crowd will get,  I would come back again to get a quick drink soley for the comfy seats and hopefully next time I come back they will have the beer and shot special.", "author": "Linda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "I have been living in San Francisco for ten years now. I know this place like the back of my hand. If you are looking for a very cool old school SF bar lounge then check out The Royal Oak.\n\nThe place is located in Russian Hill. The outside looks somewhat mysterious in a 1979 type of way. When you walk in the slight red glow and the lush fern ambiance sets in and all of a sudden you think to your self wow a drink sounds great. Then things get good. \n\nA hot girl bartender will walk up, smile and ask what you want to drink. That's always my favorite part. The drink I'm talking about ;-) but yes the girls that work there are always attractive and really add to the lure of the place. \n\nSo, yes, I highly recommend The Royal Oak. In my ten years of hanging out there from time to time I must say, the place is a lot of fun and has a lot of San Francisco character. \n\nP.S. - And by the way, what is up with all the haters on this site? I cant even count the number of times people bitched about the cash bar on here. Look if spending some cash on some drinks is a problem then find something else to do.", "author": "Thor H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-09", "description": "Laid back bar.\n\nFunky decor. The place is decorated like your grandmothers ancient living room. Red velvet couches etc\n\nGood place to talk with friends and just relax.\n\nThe crowd here is late 20s to 30s for the most part", "author": "James B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-14", "description": "so this bar has been on my list for a while, hence I would always pass by during the day, etc.. \n\nFinally made it in, and the decor lived up to my expectations super cute plush sofas, chandeliers, stain glass windows..HOWEVER, the mood was completely KILLED by the top 40 music. It really should've been jazz, or instrumental, anything but what they were playing. I suppose it could have been worse, but it could have been so much better! I also, think it could loose the T.V's I mean it's not a sports bar... \n\nMinus the music, I liked how it was not too crowded. I was able to sit at the bar with out people pushing me over for drinks.", "author": "Kay J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-28", "description": "So I'm obviously not a Russian Hill person and Royal Oak is really not my scene. \n\nBut I still liked this red velvet hip hop lounge, and it's impressive collection of stained-glass light fixtures. \n\nThe bartender got my order wrong, but collins to tonic is a fair mistake in a loud bar and not that big of a deal so she still left me with a favorable impression.  \n\nIt certainly helps in forgiving these mistakes that I am not anticipating having to go back.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-28", "description": "What a cool little pub. Old antiques and Chandalers and good music.", "author": "Tom B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-20", "description": "This bar confuses me. They try to be upscale and classy.. and then all of a sudden at 10PM a DJ walks in and sets up and starts spinning hits from the 90s? I think this bar is having an identity crisis,.\n\nI also didn't appreciate the fact that my wine glass had lipstick marks all over it and smelled like mold. And the fact that I paid $12 for it pissed me off even more... So much so that I just drank out of my moldy used glass with resentment knowing that I'd never step foot in here again.\n\nThe crowd is lame too..", "author": "Kathy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "Fun place, went in to avoid all the other nearby bars/pubs that were blasting sporting events.  The staff were fun and we stayed at the bar all night.  We tried to go back the next couple nights but they were closed, which was sad.  But one fun night is all it took to make for a memorable experience!", "author": "Ben J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-10", "description": "I had a horrible experience at this bar this past Saturday night out with two other friends, and wanted to pass along all the absurdity so that no one else would get screwed in the same way.  \n\nOrdered a single round of drinks from one of the two pleasant but inebriated bartenders, both girls.  Left my card and sat down.  When I returned to close out my card and move on 25 min later, I was presented with a bill for $69, and this is after the bartender 'kindly' comp'd two drinks 'because my tab was so high'.  WTF?!? One round, $69+ for three people??  'Please show me my tab, you must have had someone else put drinks on it.'  Then it gets ugly, 'see the Mexican guy over there?  He just threw out all the paperwork, so there is none to show you'  Seriously??  Then I got a bunch of lies and  false and contradictory statements from the bartender, who finished by insulting me, told me it was my fault and too bad.  The door guy, Rick, while kind was inept and had no information or authority to help in any fashion, even though he seemed to believe he could.  Didn't even have a good phone number to call a manager or owner about this whole issue.  I work in and around the nightlife industry here in the City, and call multiple owners both friends and business associates.  Stunned that this would happen at any place, but to hear the doorman brag about the 'reputation' of this quality establishment, you would think that they would have had some other way to deal with these problems.  No, they don't.  I literally feel like this girl reached into my pocket and stole from me, and her response was the worst, most cliche'd 'Marina girl' response you could imagine.  Entitled, snotty, flat out lied, and then went back to drinking shots and flirting with the guys at the end of the bar.  I am only happy they are not my employees.  Worst. Bar. Ever.  On Polk, so many options, try to pick a place where the drunk girls are in front of the bar, not behind it, that way you control your $$, not the bar.", "author": "A K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-03", "description": "I want to hate this place.  I really do.  I tried to walk out and go to other nearby places constantly but it kept sucking me back in.  Curses!\n\nRoyal Oak embodies almost everything I hate about going out.  Gorilla-sized security guards (but they're so nice!) gaudy horrible furniture (ok, its classy)  and mixed table/bar food service (that's priced so right!) and people way too well dressed and too good at dancing (that make an awesome party). This review is a failure to accept that the mainstream got it so right here -- so right that I couldn't help enjoy myself despite my ridiculous mental problems and barhopping criteria.\n\nBut wait, I have more complaints that I can't cash!\n\nThe lights are too bright and there's an awkward divider which eliminates the space for a dance floor so people will dance behind the bar.  If the dancing gets good (and it does, dammit!) the bar becomes an impenetrable fortress and you'll have to take a tour to get to the other side.  This would be bad in most cases except for the fact that everyone is so good looking in here.  Easily the most attractive crowd of people I've seen since I've been here.  Dammit!\n\nDeath to the demoness Allegra Gellar,for the drinks are the bomb!\n\nI want to dislike this place, but I can't.  I refuse to give in though.  I don't plan on going back any time soon, but I'll be dragged there by circumstance and I'll surely enjoy it for hours again.  Curses, I say!", "author": "niero g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-06", "description": "If youre a donald trump supporter then this place is for you.  Complete with racism and bats to hit people over the head with.  Sounds like a good time.", "author": "Ferdinand B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "Ahhh..the fern bar....It's a decent neighborhood bar on week nights....also responsible for many pairs of beer goggles I've collected over the years..\nSomething about their old couches though...Each time I go there I feel like I need to de-sanitize my clothes after....", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-08", "description": "I really want this to be my neighborhood bar that I can go to on like a Tuesday - I live a block away.  So much potential... I used to come here all the time in my mid-20s - maybe I'm just older and lamer and married?  I dig the retro decor, great beer selection, respect that it's old-skool cash only, bartenders are cool.  \n\nBut the music KILLS me.  Dude - you can't play \"untz untz\" pseudo DJ'd music meant for Mr. Smiths or Rogue when you have NO DANCE SPACE.  It's too loud, too obnoxious, and meant for too many hoochy mammas.  Stick to something old school, maybe a juke box would help.  \n\nYet I keep going back... probably bc it's decent before 9pm before the bouncer shows up and the redick music starts.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-10", "description": "Ahhhh what can I say... well a lot! I hate this place. No, I dont \"want\" to hate this place, I absolutely hate this place. I have never felt so pissed after going to a bar, but Royal Oak was sure to provide me with that experience.\n\nThe drinks here suck. And thats not to say the alcohol sucks, no, the freakin bartenders do not know how to make a drink. Look, Im a young guy, and when I go to a bar, I want to get drunk if not nearly so. So I ordered a freaking AMF (my clubers know this drink). You expect it to make you go adios! Not this drink my friends. It was the sweetest, bluest, adios mutha effer I ever tasted/seen! Sickening. After receiving a sugar headache from the first one, I asked for another, but told the bartender to please make it stronger. What do I get, the exact same nasty, sweet drink. Then she made me pay $7 dollars for a shot because I said it wasnt strong enough. That was just the beginning. \n\nWhen its time to go, the clueless bartender tells me my card is declined. HMMMMM, I say, Ive got plenty of money on my card, and even if I didnt, the bank would just overdraft my as$. So I check my bank account on my phone, and low and behold, this chick has charged my card 6 times!!!! Literally, 6 times! Of course the card wont go through, they think you're robbing me! Luckily I got it sorted out with my bank, but having that money help up for almost a week is no fun in any situation.\n\nOverall, this place sucks! A bunch of yuppie pricks who ultimately cant make drinks. I will say one good thing, hence the one star. One of the hostess was as nice and accommodating as she could possibly be in such a lacking place, and for that I thank her. She was the only positive here and should find a better place to work. Nuff said!", "author": "William H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-05", "description": "Great neighborhood bar to relax and enjoy a beverage after a longgggg day!\n\nStart or end your night here, and kick-back with the locals!", "author": "Kristian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-09", "description": "The atmosphere provides something lacking in this neighborhood, which is \"lounge.\"  The green ferns and banana leaves are a fresh contrast to the chandelier-like light fixtures, maroon walls, and velour covered arm chairs and love seats.    \n\nPROS:\n-Vibe/atmosphere/theme.\n-Different from local bars.\n-Furniture.\n-Novelty.\n\nCONS: \n-Cash only is lame.\nThe quality of the furniture here is something to be desired.\n-50% of the time, the bartenders are retarded.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-13", "description": "I'm going to preface this review with this statement. I hate Wrigleyville bars. I hate Wrigleyville, period. You have to drag me, kicking and screaming to this area of town...\nThis is the only bar in the area that I don't mind going to, and usually it's a pre-drink or post-drink when going out to eat at Cozy Noodle...the only restaurant that I like in Wrigley. The owner is a sweetheart and the main reason I love this place. Not sure how crazy it is on the weekend, but during the week you can chill in the back room and avoid all the d-bags doing yeager bombs and have a nice convo.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-14", "description": "Wow. Did the neighborhood change? I used to visit this place back in the day and it was much different. Now - loud bass music on the annoying side. The kind of music you'd expect at a dance club. Too loud to have a conversation yet the ambiance and setting (comfy couches) are best suited for a relaxing piano music kind of place. No room to dance. So I don't get it. And the bartenders were anything but friendly and accomodating. We were there early on a Friday night (7pm) and we were the only ones there. Hmmm. Anyway, I would not go back UNLESS the music were different. Then I would go a lot.", "author": "M D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-19", "description": "I live in the neighborhood and I really wish somebody would buy this place and fix it up so it could live up to it's potential. There's reasons why all the bars in the area are packed and hardly anybody inside Royal Oak\n\nProblems: \n-cash bar only (really??.. no really?? this is 2009) \n-bartenders are never friendly\n-drinks are pricey, even for russian hill", "author": "Dave T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-29", "description": "Fun hipster bar with retro couches, chandeliers and a lot of locals. Great spot to meet up with a bunch of people to either begin or end your evening. Pull up a seat, grab a beer (remember cash!) and you're good to go.", "author": "Alie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-01", "description": "This is one of my favorite bars on Polk. It's especially good on a not so busy  night where you can grab a seat at the big round table with a group of friends. I have never seen this place too packed though, and you can usually find a spot to sit if you keep your eyes peeled. Staff is friendly, and they clean the place up pretty well. Sometimes too well. I have had a drink or two gone missing when I wasn't finished with it yet-- oh well. A random plus, they have glow in the dark straws. Pretty darn amazing.", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-24", "description": "We came here as a second choice due to the lack of space to move next door at bullet (and the girl hurling). \n\nOn the positive side:\n- love the plants\n- random red lighting\n- quality people watching\n- retro couches to make you laugh\n- decently strong drinks\n\nOn the negative end:\n- cash only (seriously?)", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-23", "description": "Been there a couple times. Reminds me of a red jungle. They have weird trees and plants and the setting is red so hence the red jungle. Can get crowded on the weekends and the music is cool. Try it out if you're ever on Polk.", "author": "Lisa Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-21", "description": "I always used to walk by this place and thought it looked intriguing, but it would invariably be closed.  Finally, one day we were walking home and the doors were open!  Hurray!\n\nComfortable, cozy, vintage decor.  Plush velvety sofas, darkened mirrors, lots of weathered gilt trim and potted palms and ferns separating the seating areas.  I really enjoyed just sitting back, sipping my drink, and letting the world pass by in a place where it looks like time has stopped.  \n\nGreat seating areas for large groups and lots of room early-ish on a Saturday evening.  Good place to stop after Rouge/Nick's Crispy Tacos if you still haven't had enough red velvet action.", "author": "Jaimie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-23", "description": "good hip hop music and not packed on a thursday. the service on the other hand can use allot of improving. the bartendar forgot what we ordered twice. then when i wanted to close my tab she came over twice to ask my name and then for the third time wanted to know if i wanted to close my tab?? omg frustrating! plus she neglected to tell us they only had diet coke!", "author": "Vanny R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-07", "description": "I took away a star because of my experience here last Monday night (the night of our WORLD SERIES WIN!!!).\nRoyal Oak was seriously the only bar that wasn't packed to the gills, so we went in to grab a shot of tequila in celebration. The girl behind the bar literally wouldn't even look at us-- she stood on the opposite end of the bar chatting with her friends. I was standing with about three other groups who also wanted a drink, all of us ended up leaving. \nYou would think the bartender would be happy about making tips on this busy weekday, especially because everyone was in such a wonderful mood. She was honestly so rude, she didn't deserve our money.", "author": "Kenzie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-28", "description": "Way too loud, way too crowded, way too expensive.\n\nWent on a busy Friday night. Not at all my scene, slumming it Marina folk. \n\nAmbiance, cool.  Drink, awful, a whiskey sour is NOT made with orange juice. Music, god awful.\n\nThe music was way, way, way to loud for a bar that doesn't also have dancing. Also, it was this weird house music. Horrible, just horrible.\n\nThat being said, I would come here again, on a weekday during the day. I think it would be a great hang out on a cold rainy Tuesday afternoon, sitting on a cushy Victorian settee with a beer. \n\nBut a hang out bar it is not.", "author": "Alexa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-15", "description": "Royal Oak is a decent place to grab a drink on Polk St. and since it's not too far of a walk from some Marina places it's a good destination if you're in the Marina and looking for a change of pace. They have Chimay on tap, which I love and the bartender made a mean Marker's Mark manhattan.\n\nThere is plenty of seating so this is also a good option if you're with a group earlier in the evening and looking for a place to camp out at. Music was entertaining the night I was there but be warned, it can get crowded on prime nights so if you need a seat go early.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-27", "description": "The owners don't hire male bartenders because their lunatic son might hurt them.  Seriously.\n\nI used to love this bar, but after tonight I will never go there again.  Furthermore, I am scared for the bartenders and the female patronage as long as they let their son on the property.  The usually tranquil environment was ruined this evening as the owner's son smashed up the priceless, original turn-of-the century pieces, screaming about how he was going to kill everyone while he wore a KKK outfit.\n\nYou might think that sounds extreme or maybe even comical, but put yourself in the situation.  We were scared girls who hadn't spoken to him, trapped in a corner while he threw our table and screamed how he was going to kill all of the police because he was \"Federal.\" The owner did nothing, merely took her time removing him from the property.\n\nHe shouldn't be allowed there.  It was seriously the scariest situation I have ever experienced in a bar.  This place should be stripped of their liquor license until he is locked into a mental ward.\n\nPeople who pace back and forth, talking to themselves while rocking are not good barstaff-- I don't care who's son he might be, he is dangerous.\n\nBefore I used to love relaxing there, enjoying the beautiful and original decor of this historic, former speakeasy, while sipping great-priced scotch-- never again!\n\nDon't go there-- it's not worth being hurt.  Seriously disturbing!!  I pity the ever-changing barstaff!  The owners should consider what would happen should anyone be seriously hurt, or worse-- killed.  It will be on their conscience.", "author": "Tracy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-05-17", "description": "RECENT UPDATE: i really missed this place so recently came back and GOOD NEWS, that mean old bartender is gone! yeah! the allure of royal oak is first of all, such a great location in russian hill. then you've got all thoes plants, and those big massive round tables and mirrors everywhere. i'm happy to report the royal oak is back on my favorites list again : )\r\n\r\ni almost forgot about this place... its really not one of my favorites on polk st. i love the huge round tables and mirrors everywhere but i had the worst service from one of the female bartenders. i had my money on the counter, did the 'maintain eye contact' thing and she merely glanced at me and then went on the help about 4 different guys (who walked up AFTER me) before finally coming down to my end. i even went so far as to smile at her but got nothing but attitude back. i am usually very patient with bartenders (as i know they get busy) but this one left me so pissed-off i vowed to never go back. the first time ever i did not leave a tip-- it was that bad. still havent't been back.", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "I have to say I like this place a lot more than general consensus.  It has a very attractive ambiance and since most people can't seem to remember the name I'm often describing it as either: \"the plush red bar\" or \"fern bar.\"  \n\nOn week nights it's one of the true lounges in the city; easy to get a drink with friends and hear each other talk.  The bartenders are friendly and sweet enough to turn down the music to a reasonable volume (which elsewhere seems to be the cardinal sin of drinking in SF).   Weekends the place tries to transform into a club and I don't find it to be as consistently enjoyable, but if that's your thing... go for it.\n\nOn my last visit (random Monday night) the bartender drawled out a very friendly \"what can I get you darlin'?\" every time I approached and it was thoroughly charming.  She also mixed up a killer Red Headed Slut for my buddy who'd just turned 21.\n\nSo, keeping in mind that I really like this place the other reviewers do have some legitimate complaints which I offer here as constructive criticism (fix these and the place would rock):  \n\n1)  the bar is schizophrenic about credit cards... sometimes they'll let you charge one, sometimes you can give one but only to hold a tab you'll have to close with cash... sometimes they just blink at you.  It's not the mission... you should take credit. \n\n2)  The place is a bit pricey compared to its neighbors.  I actually think well drinks are sometimes accidentally charged as shelf drinks exacerbating this, but haven't had that issue with beer.  \n\n3) Minor nitpick: the bar is starting to show its age.  Some of the seating could use attention (new upholster or more stuffing).\n\nEnjoy!", "author": "David K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-01", "description": "I have a couple problems with this place:\n\n1) The seating that looks so enticing when you walk in is really just an illusion. They are hard as F*ing rocks. You look at them and think, oh yeah, come to mama...I want to relax and throw back my cocktails in the comfort of your cushions. In actuality, they're so uncomfortable that you almost debate sitting on the ground instead.\n\n2) Three words: Cash. Only. Bar. I'm sorry but that is CRAP. The last time I was in and handed over my credit card, the server directed me to the cash machine in the back. So, what you're telling me is that I have to get raped with non-ATM fees because you're bar can't come in to the 21st century? No thank you and good day.", "author": "Julia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-29", "description": "So I have been to Royal Oak a few times now and I really like it. I do think you need to get there by 10:00 if you want to try and get a seat. Speaking of seats, the place has a few red velvet couches and some big dinning type tables. I think the drinks are a bit expensive, but they do have a nice selection of booze. Getting a drink at the bar can be a bit tough, but if you are lucky enough to get a seat, the cocktail waitress always dose a great job!\n*WARNING* cash ONLY bar!!", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-08", "description": "The reviews of this place may be mediocre, but at least they are consistently mediocre!  I will have to concur with the general sentiment here.  Although this bar has a nice vintage decor with all the plush velour-upholstered couches and chairs and fancy chandelier mood lighting you could want, they blast the music unusually loud - even for a bar - the staff can be rude and alouf, and they only take cash. \n\nbooo to places that only take cash! I'm sick of it!", "author": "Rick H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-12", "description": "1 star for decor......It has a cozy finish and a very old school english pub feel to it....So Sad...that:\n1 Bartender is very rude (don't mean snobby) just rude and unprofessional, and she makes the shitiest drinks...brunette, medium to shortish hair, on week days..please, somebody fire her!\n2 The music on the week days is too loud...I can understand it on the wknds.\n3 They don't take cards...c'mon folks...this is not a taco truck...on the other hand I might get from taco truck at this point...\nSo if you're in russian hill...go to some other close by local pubs and bars......Guarantee you'll have a better experience...w/out any BS like Royal Oak....", "author": "Alex W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-22", "description": "The two stars is for posting your hours as Monday Through Sunday 5pm to 2am when it seems you are closed/open randomly.\n\nI was meeting  colleagues for a drink, and recommended the Royal Oak as a good place to get a few drinks and plan out the evening.\n\nA lot of reviews stated it's often closed, but I figured if they \"open\" at 5pm, I'll be safe going by around 6:30.\n\nWell, it was closed when we arrived, and  I was embarrassed, and had to scramble for a decent spot to go to and coordinate the others en route to meet us to a new place.\n\nLife won't wait, but adjust your posted schedule accordingly, be considerate if you can't have someone show up to open the place.", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-15", "description": "Why does this bar smell bad?  It's airy and filled with plants -- you'd think they would absorb the smell with the whole O2/CO2 exchange.  I can't even explain it -- but it really kinda smells like butt.  \n\nAs for drinks -- cash only.  Boooo...", "author": "Mitzi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-14", "description": "Again, I have no clue how in 2008 a bar can not take cards or just refuses to. \n\nThe bar itself is pretty eclectic, with the glow of red lights and old buttoned couches sprawled everywhere. The chairs and seating arrangements are comfortable and the overall vibe is very mellow. At least on a Sunday night when I visited.\n\nThe bartenders were friendly, and the beer selection was standard. I'd be interested in coming back on a Friday or Saturday night, but there wasn't anything too special here.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-13", "description": "We came here after a looooong day of tailgating and football watching so we were beat.  Funny thing is earlier in the day, my buddy got SOOOOO hammered at our old fraternity house he passed out cold.  Now normally I would say at my age with wiser adage I wouldn't do anything like what we were about to instigate, but he did pass out in a fraternity house, so it was more like his fault than ours.  Well...anyway, we drew a bunch of penises on his face (this was at like 4pm) and he carried them allllllll night long.\n\nWhile we were at Royal Oak, we met up with some of my friends and they all saw the drawings on his face and laughing discreetly.  All of my friends, strangers at the bar, the bartenders were all grabbing him for pictures.  One point during the night, he turns to me and goes \"Man your friends are all sooooo nice!\"  \"Yeah they are\" I replied...hahaha\n\nFinally after last call, they turn the lights on while he was at the bar.  Since the back of the bar and the retaining shelves are all mirrors, he finally discovered we mutilated his face with a sharpie and fiiiiiiinally went and washed them off.  Man, he carried penises on his face for about 10 hours...\n\nWell I guess this is a review about the bar; it's cool, casual, fun.  Not divey but definitely not too shi-shi.  The bartenders are awesome and always say whats up.  I wouldn't recommend starting here cuz this place will definitely blow your hearing out for the rest of the evening.", "author": "Nico M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-01", "description": "I don't mind cash only establishments because usually it means that it's worth the inconvenience of taking that extra step in going to an ATM or even worse, incurring two different surcharges.  \n\nHowever, it would be nice to walk into a bar and actually have a bartender know how to make two somewhat common drinks.  Luckily I had been a bartender for a few years to know what the ingredients were for two beverages when the bartender confessed that she didn't know how to make two certain drinks.\n\nA person that tends bar is usually competent behind the bar and this competence usually entails knowledge of alcoholic beverages OTHER than pouring beer.", "author": "Karen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-22", "description": "Walked into the place last night with a group of friends. Right away a very foul scent of Body Oder was noticed and we looked at each other and wanted to puke. We sat close to the door for air, only reason we stayed because we had 10 minutes to spare and wanted a fast shot....Bartender was not friendly and very hard to believe others were just sitting int here enjoying the foul smell... Another couple walked in and I heard them mention the scent of BO as well and they walked right out... it was disgusting.....Used the bathroom as well and there were towels and piss all over the floor.... Bartender used the bathroom right before me and didn't bother picking the paper towels up... that's a problem......will not be back", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-25", "description": "This is still my favorite bar in the whole city. Stained glass and amazing fancy couches and good music!", "author": "L B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-30", "description": "I really like this place and I agree with Megan and Michelle on its allure and classic feel. Also (mW), the meanarse bartender is gone (woohoo!) and all we got was great service and a sense of humour (from Maria?)  Disclaimer: it was a weeknight, so I can't say what goes on during the weekend here. \r\n\r\nNevertheless, the greyhounds are delish, the ambiance relaxed and the old-skool couches super comfy. The decor is funky and green and some of the details feel like something out of a 007 flick.  I'll definitely be back!!", "author": "I. O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-29", "description": "I've heard a lot of people complain about the Royal Oak in similar ways that they bitch about the City Tavern, the Blue Light, or any handful of douchey Marina bars.\n\nI guess I've been lucky to go to the Royal Oak on off hours. For my money, it's a real good place to have drinks when it's empty. \n\nThe furniture is comfortable and the lighting makes most people seem semi attractive. And they have Chimay on tap.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-27", "description": "This is not a pick up bar, although I have been picked up here,...and watched others be/do here as well but it's just not one..so if you are stumbling in looking for that scene you will be dissatisfied... \nIf you're wandering around with a small group who's having a hard time jumpstarting their own party you will also be dissatisfied....\nHowever if your group is a party within themselves, or you want to catch up with a friend or co-worker, or if you were successfully picked up on (vice versa) at one of the more loud and crowded bars nearby and need a quieter place to well \"get to know each other\" this place works!\nI'm using the dark wood description again- I know I know, fuse that with my definition of Victorianish and Victorian red and throw in a bunch of plants you got yourself the Royal Oak! I like this place I really do... really...", "author": "Gracie A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-09-22", "description": "\"Cash only,\" the unfriendly bartender barked at me. The couches are comfortable. I'll give the Royal Oak that, but not much more.", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-03", "description": "The color red has traditionally meant a sign of trouble.  My wife wore a red dress that looked oh so yummy during her bachelorette party years back and from the stories I heard, well lets just say you wouldn't bring it up during Sunday school.  \n\nNo doubt the color red makes people take notice whether some girl is wearing it on her tight body, it's a stop sign, a red Ferrari, or a severely injured person.   \n\nBack in college a few buddies and I went to the local bar to pick up some hotties.  I was a complete dork so basically I was a wing man trying to talk up the less attractive birds (or cows might be more appropriate) while my buddies went up to bat hoping to hit a home run.  One time, my friend landed this Ivanka Trump look alike.  Since my friend was obviously thinking with his penis, his strategy was to get her liquored up (original one there huh?).  \n\nSo she's sucking down strawberry margaritas like a vacuum cleaner.  I try telling the guy she's clearly way too wasted.  Him thinking with his penis thinks it's a no brainer.  So we end up in said friend's car and lets just say we hear the infamous drawl \"uhhhhh I don't feel so good\" from this cat.  Next thing my buddy's interior turns from white to red as a sea of half digested strawberry margarita mix finds its way back to earth looking not nearly as good when it first went down.  So the saying goes, red brings trouble.  \n\nThe Royal Oak has a very red interior.  It looks cool, seems cool but something is clearly missing.  It's true that the bathroom smelled worse than 10 day old piss and yes it's true the drinks are expensive.   But red is supposed to give you a feeling of naughtiness, trouble, passion ... something to make the heart go bump.  I feel none of these here ... zero excitement.  \n\nMaybe it's the music, the scene, the bathroom, the lifelessness of the bartnender or the DNA infested couches.  Of course in the end it could be I only respond to red dresses being worn by my better half now.", "author": "Bill P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "This holiday season I elected to stay home and enjoy my beautiful city with peace and quiet... no crowds, no traffic, just a sweet sigh of RELIEF from all the people.\n\nOf course I had to have my cocktails so with a few other friends we decided to throw an impromptu \"Ugly Holiday Sweater Polk Street Stumble\" (aka pub crawl) a few days before Christmas.\n\nRoyal Oak was so much fun- they still have those large comfy couches I remember from years ago, lots of space, dim/red lighting, and extra oxygen from all the plants in there!\n\nOnly thing... besides our beers, we didn't like any of the cocktails... our bartenders had a weak hand (HOW could you mess up a vodka soda??). Oh, and that \"Cash Only\" thing bugs.", "author": "Nenette Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-26", "description": "On Polk street, the atmosphere was nice, the people were decently dressed up, and prices of the drinks were on par with neighborhood bars. We only hung out for a bit, but while here the crowd was mainly doing their thing. It's predominantly caucasian, so just in case you're looking for an asian crowd, this isn't the place. I felt like I was back in North Carolina when I came here", "author": "Eric A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-31", "description": "Not a bad local bar if you're in the area. Prohibition on tap, funky couches -- relatively standard otherwise.", "author": "Andy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-20", "description": "New to this place, and came to meet up with friends for drinks. Decor is laced in red velvet chairs and couches, similar to a Victorian style living room set up. Drink prices are very reasonable and service nice, although long wait for drink service preparation. Music level is average, and still able to have conversations, but still need to raise your voice. Restrooms are limited with two stalls and poor lighting, and as for parking/location street and metered parking, so somewhat difficult to find in the later hours of the night.", "author": "Jackie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-14", "description": "It's an ok place. Not sure what to write apart from that. I actually like the sofa's and the greenery. It can get really crowded and loud and the drinks are way overpriced but where else can I go and practise my very poor russian with some waitress as I order the next scotch? :)\n\n\"Vi iz rassi?\", I utter as I lean in towards the waitress who kneels down next to me as I sit on one of those could-smell-better sofas.\n\n\"What you say?\", she replies and laughs.\n\n\"Eh, sorry, thought you had a russian accent\", I reply and my mind has already moved on to if I want the 12 or 18 year old mcallan as the last glass of 12 year old was huge and I'm hoping to score the same amount for the 18year old...\n\n\"Oh I am\", she says and sits down on the sofa next to me and my friend. \"I just didn't hear you. What did you say?\"\n\n\"I said 'Vi iz rassi?'\", feeling increasingly uninterested in if she really IS russian at this point. I'm not so why do I really care. We sit in one of those couches that are to the left of the entrance with a view of the street corner but the windows are all fogged up. The people moving outside on the street cast shadows on the windows that are nicely framed by these enormous plants. \n\nAs I finish my drink I smile and ask her if she has any Mcallan 18 and they do. I order one. Neat. Ice is for people who don't appreciate fine scotch. \n\nI lean back on the couch and my friend leans over and semi-yells in my ear \"Did you order for me?\"\n\nI'm puzzled and say \"They were out\"\n\n\"Out of what?\", she replies. \"I didn't tell you what I want\"\n\n\"Peace on earth, a cure for cancer and the ability to eat anything you want without gaining a pound?\"\n\nNever did see her again.", "author": "Rich S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-19", "description": "This place is wack and awful the bartender was a drunk and was dancing like a stripper when we came in, shouldve walked out...all and all this bar is trashy just like the decor, dont waste your time", "author": "Ashley J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-22", "description": "The Ambiance is very warm and inviting...  its red walls, large oak bar and laid back music make it a chill spot to sip on a drink and catch up with old friends or a date...\n\nThe waitress are always hot ...\nand the Vibe is chill, not to snoby ..", "author": "James W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-06", "description": "HA HA !  \r\n\r\nThis place sells more meat than Molly Stones !!  You walk in and everyone eyeballs you (eye f**ks you) like a glass of water in the sahara.\r\n\r\nCome here to get laid, go somewhere else for a drink.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-27", "description": "I have mixed feelings about Polk street on Friday and Sat. nights. Otherwise cool bars become inordinately packed and frantic. Royal Oak, however, is different. Maybe it's because it's a bit further up on Polk, or maybe it's because this place has a super-chill vibe, but it's always a great respite from the hoards at other bars like the Buccaneer, etc. The plants and chandeliers are kitschy and unusual.   The drinks are always strong and the prices are right. I've only had friendly bartenders, and I like the clientele. The only downside is that it is, regrettably, cash only, but if you come prepared you're sure to have a great evening out!", "author": "Jenni D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-06", "description": "It felt royal, not so oaky.\n\nI would really like to come here again.\n\nThe place wasn't too crowded and the drinks weren't out of this world. And they had Chimay on tap.\n\nThis place has a fancy feel to it but is by no means fancy. As my bf stated, \"It's like going to my Italian grandma's house\". Except I'm sure your Italian grandma wouldn't have a bunch of 30 somethings hanging out and drinking all her liquor. \n\nThere were velvet couches, big tables, big windows, nice understated lighting, nice people, and shitty shitty music.", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-04", "description": "The problem of Royal Oak is their cocktail socks.\nI don't know why they can not make decent cocktails.\n\nThe furniture setting is old style and nice even it's so uncomfortable to sit more than 30min. But it's all about atmosphere, I can live with it.\n\nBartender puts her fingers so many time to dig out the ice cubes fell in the cocktail glass is NOT GOOD. \nI don't think it's all the bartender there is that bad. I have to say but I met enough bad ones and I refuse to go back there if I have a choice.\n\nI really don't understand why the place is packed on the weekend.\n\nIt's really too bad, because I like their setting. I like their location. \nIt's just.... I can't use them.\nHaaah....", "author": "Green Mango Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "royal classy red themed.....stiff antique sofa 'n' chairs....stiff drinks matching....long stooled bar starting from entrance....plentiful eclectic mixture of seating...seating tightly packed.....a bar/lounge/cafe appearance.....high back dining chairs 'n' table...\n\na walk along polk....\"last call hours\".....closing time....royal oak obliged to serve one last drink....two vodka 'n' soda...$twenty total.....no other patrons visible...just another stop for a drink before heading home for the night....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-01", "description": "The funky old couches are kinda cool, though mostly uncomfortable, the drinks are absurdly overpriced (stick with beer), but it's generally a good place to go for attractive people watching.\nThe best part are the notes people leave in the drawers.  Have a look, and leave your own.\nBest story about these ever - as a joke, we left a friend's phone # as a \"for a good time call...\".  Our next visit was over a month later.  While in the bar, someone called the #.  This was the one and only time it was called.  Hilarious.", "author": "Don H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-24", "description": "What keeps me out is that the beer is served Joe-sixpack style:  Way over-chilled and in a frosted glass.\nBeer is not supposed to give you an ice headache.", "author": "helge m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-19", "description": "I will always have fond memories of the Royal Oak, for it is here that I was introduced to the gentleman's game of Liar's Dice.  \n\nRelaxing atmosphere, even on a busy night, and arranged in such a way that sightlines for leering at people, both inside and out, are preserved.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-03", "description": "It looks promising enough from the outside, but I'm afraid I don't care for:\n\n- The beer\n- The staff\n- The prices\n- The decor\n- The patrons\n\nAnd yes, I've been more than once. Sorry, still don't care for it.", "author": "Thor E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-22", "description": "This place deserves a little more love. All the greenery is quirky, the place is large and not too too noisy. Drinks are stiff.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-12", "description": "Totally fine place to grab a drink with friends.  Definitely scene-y with lots of young ones, but the drinks aren't too expensive and the decor is kind of fun in a campy sort of way.  The cash-only bar is a bit of a buzz kill.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-17", "description": "Nice place to end a crawl, sit back, drink, and talk about things that seem more interesting at the time then when you think back about them later. \nIt's redness helps to distinguish it when you're trying to remember where it is. \nThe limited beer options MIGHT suck, but that is why I recommend this place as the final stop for your evening. By that time, you're either really flexible with your drink choices or a  wound-up tight-ass who would be better off heading home.", "author": "Loli L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-08", "description": "love this venue for the chill vibe and the friendly bouncer who sometimes doubles as a bartender when clients are ready to throw ice chips at the one female bartender who goes way beyond the requirement for blond stereotypes.\n\ni'm pretty sure she was coked up on thanksgiving - didn't know one drink from the next, was running in circles attempting to do math in her head while successfully ticking off everyone and ruining their tryptophan turkey highs.\n\nam afraid to go back because of that.   that and the velvet sofas that kept swallowing me whole with their 100 year old squeaky springs and deteriorating cushions.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-31", "description": "This place gets two stars right off the bat for being one the last remaining \"fern\" bars in the neighborhood, a style that dominated San Francisco in the late 70s and early 80s. A place you could hide under a fake tree with a group of coked-out disco freaks. Before AIDS. Before all of these American-Arabian wars.\n\nThey have some of the hottest-looking bartenders in town - mostly ladies, of ciourse. One more star for that. The prices, however, are steep and the hot bartenders are not too interested in conversation beyond small talk, so repeat business is not necessarily encouraged (i.e., I've never had the bartender buy me a drink - I'm sure the owner has them under a tight leash). Still, once in a while, when you really DON'T want to talk to anybody, you can wind up here and enjoy one hassle-free drink,  enjoying a little bit of the eye candy while stuck in a time zone reminiscent of the Rupert Holmes' \"Pina Colada Song\" era.", "author": "Nitram N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-16", "description": "Setting-Red with interesting furniture and lots of plants.\nCrowd-young and not so young professionals who seem laid back and unpretentious.\nMusic-old school pop and hip-pop.  It took me back to middle school.\nDrinks-STRONG!  Just the way I like it. *slurp*", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "Loud, epic and fun. The speak easy, Moulin Rouge themed bar is the perfect setting for all things amazing. Give the door man a hug, his massive built hides a sweet heart! Great scene, loved it.", "author": "Rey G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-24", "description": "Dead during the week.\n\nToo crowded on weekends.\n\nWhere's the middle ground?\n\nEven though I live less than a block away, I never come here.", "author": "Ava S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-14", "description": "I admit this place has a cool atmosphere; that said, their cocktails are weak. \n\nI live down the street and have given this place a million chances...  the drinks suck every time.", "author": "Naveen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-20", "description": "Its amazing how many bars I've been to in San Francisco that seem to be full of tools. I'm not even kidding, this bar seemed like it was full of meatheads and their drunk bimbo \"friends\".\nOne particularly ripe strumpet grabbed my girlie's boobs in the restroom, and then tried to play it off with a typical \"Its all good!!!\"\n\nThe drinks were ok but a bit overpriced, and it was a bit slow too, but I think all the tools were busy getting their drink on so they wouldn't notice how rank their dates were.", "author": "Tom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-06", "description": "You would never guess this place is CASH ONLY but it is.  Keep that in mind, because we were ill prepared and had to leave after one beverage because we needed cab money!\n\nIt's a gorgeous bar with a really romantic setting.  All the light fixtures are stained glass and the overall atmosphere makes you feel like your back in time in a 20s, 30s type of swanky bar.  It was really sexy.\n\nThe bathrooms, not so sexy.  I was surprised the bathrooms were kinda gross for how cute the place was.  Hmm, guess you can never tell.\n\nI'd go back again but it was really crowded.  I would probably get there early to secure a cool couch by the window.  We sat at the bar and it wasn't quite as fun", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-06", "description": "This place has the potential of being really cool but it's located in Russian Hill that (please correct me if I'm wrong) is basically where all the Alumni's of Sigmi Chi reside.  \n\nPutting my wannabe diverse, cultured, laid back persona aside.  I have to admit that I have enjoyed this place.  If you get here early with a small group of close friends you may enjoy the plants, red - light, cozy couches, and music.\n\nCould be a great place to bring a date for a drink or two.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-07", "description": "Ok, so I really like the vibe this place. The red hue, vintage (random) sofas/chairs and the tiffany-like lighting makes it feel comfy and cozy. This place would be a super sexy romantic spot, if they spiffied it up and could draw in a sophisticated crowd.\n\nAnyhow, this place plays trance/techno/house music (I truly don't know the difference it all sounds the same to me). It's a cool place to head to if you just want to get out of the house with some friends, sit back people watch and shout at each other bc its so damn loud.", "author": "melissa g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-05", "description": "A fun little haunt on weekday nights. Really cool interior, feels like an old fashioned bordello. Authentic tifanny lamps, sculptures, red walls and tons of plants. The hand carved bar is quite impressive as well. Seating is open and spacious, big round tables and velvety chairs.\n\nI don't recommend for Friday or Saturday nights, it tends to get filled with fratty Marina douche bags in linen shirts. This bar is at its prime between 8-12 when it's quiet and the kooks are still inside.\n\nThey have a good selection of whiskeys and vodkas.\n\nIt's a seductive bar straight out of \"Eastern Promises\", a quiet place to drink after a nice dinner on Polk St.", "author": "Andreas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-02", "description": "Royal Oak is a nice lounge bar, but their cash-only policy is the stupidest thing ever. Why can't you take credit cards? Maybe they were busted for scamming people like that guy on the Sopranos.\n\nBesides that major gripe, I really do like this place. The couches are comfy, everyone seems friendly, and you can drink at your seat from the waitresses. It's sandwiched between Green's and The Buccaneer, and luckily has no TVs, so no douche-bag sport-o r-tards.", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-04", "description": "I walked in this place on Saturday night and wasn't quite sure what this place was. They were playing terrible house music, the people all looked like they belonged own the Jersey Shore, encountered girls doing cocaine right out in the open. This place is disgusting.", "author": "Christie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-01", "description": "It all depends what night you go:\nDuring off hours/days such as Monday nights I love this place.  Fun, relaxed \"fern bar\" atmosphere with cool patrons.  On Thurs, Fri, Sat nights this place is awful.  They put on LOUD club music that's totally out of place and the place becomes packed with obnoxious, egotistical marina people (and I'm from the marina so I feel justified damnit).", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-04", "description": "I love this place and I don\"t mind cash only. The bartender chickie with the cuban hat was nice to talk with,  I got  really buzzzzed here for New Years day. It was worth the time.", "author": "Steb M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-29", "description": "We were recommended to this lounge as we were looking for a place to hang while we waited for a performance at the Red Devil Lounge.\n\nOverall it has a really great atmosphere and is completely geared to you and your entourage to sit, drink, chat and have a good time for as long as you want.\n\nOne very appealing aspect is the eclectic ensemble of furniture for you to sit on or at.  Sofas, chairs, large round tables or the bar.  Just come on in, get a drink and chill.\n\nThe downside is the drinks are really overpriced, the furniture is a bit cheap and uncomfortable for long sit-downs, no real wine selection - they're really focused on the beer and spirits - and the bar ran out of Kahlua (!?!?) while mixing a drink for me!  Also, don't expect any real service, there was one bartender handling about 20 patrons until a second showed up later in the evening.\n\nThe laid-back atmosphere, polite bartender and cool furniture / plant theme are the saving graces here.", "author": "Sean T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-14", "description": "Gorgeous 'Sunset Boulevard' meets 'Moulin Rouge' decor - lavish antique sofas, stained glass, carved Edwardian end tables, Tiffany lamps, lush ferns and red light bulbs. Well-stocked bar with top-shelf liquors. Convenient location on Polk (and subsequently a few blocks down from my apt.)\nSo why don't I soak the decadent atmosphere in on a regular basis? Because the music selection does NOT match the decor. Crappy house club trendy pop, every night of the week. And I think the volume knob is broken, turn that DOWN when you have only two people sitting in there! Save it for a dance club. Play some old jazz, classical, maybe even blues. It would be PERFECT. Maybe even once a week? Please? Royal Oak, are you worried that the local hoodlums wouldn't hang around anymore if you didn't play oontz oontz muzak? Never fear- I'll summon an army of over-tipping antiquiphiles who will drink you out of your Campari and Cognac.", "author": "Andrea Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "Let me quickly be a broken record... it sucks that they only take cash, the couches are not the most comfortable, and the red glow is slightly oddish.\n\nBesides that, I'm a big fan.  I love the Chimay on tap, the bar tenders are all nice, and the crowd is not too snobby or fratty.  Good place to chill with friends or (attempt to) meet new people.", "author": "Brady L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-31", "description": "the first time i went there, the crowd was so nice, i had so much fun.  Like a puppy who found a new home.  People were in the late 20's, 30's, very nice looking, no pretentions unlike in the closeby Marina.\nThen i went again a few times, to find it empty with older people.\nBut i keep on trying.", "author": "Damien J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-23", "description": "Don't ever go here! The bartenders are racist. They kicked my friend out for being Asain. This is not acceptable. This bar should be shut down.", "author": "E H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "Royal Oak is one of my new favorite bars in the city. It's sort of a cross between a dive bar and a posh pub. The ambiance is unbeatable - the decor is really cool, kind of an early 20th century feel with heavy wood and Tiffany lamps and there is a nice, cozy couch area that is perfect for a group of friends to sit around and talk. The music is upbeat and fun, although the bar isn't set up for dancing. The people who hang out there seem receptive to talking and socializing - and since I enjoy meeting new people when I go out, this is a big plus. The biggest drawback is that the bar is cash only - there's an ATM by the bathrooms, but if you don't want to pay ATM fees, make sure to bring cash.", "author": "Randi W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-11", "description": "Repeat after me......\n\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\"I will not go to bars on the weekend and expect them not to be crowded and douchy.\"\n\nOkay...do I need to tell you what days this place is tolerable? And by tolerable I mean stabbing me in the eye with a cocktail stirrer would be almost as pleasant. \n\nThe drinks are not strong AT ALL and a well drink will cost you $7, just $1 less than the premium stuff. They don't have one of those soda squirty thingies (that is the official term) and when I inquired why, the bartender said it was because they prefer to have drinks that are more \"pure\". I assume she meant pure soda because there was NO ALCOHOL in my beverage. \n\nTo top it off the chairs they have around their big wood tables are very top heavy, causing them to fall over should you drape your jacket on the back. Perhaps this is to make those wandering by think some inebriated person just knocked a chair over so the drinks must be strong. \n\nPlus one star for having a decent \"cozy\" dark wood decor reminiscent of your grandfathers study and for the fact that they actually have more than one stall in the womens restroom.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "I was here on a Tuesday, so have no idea what it's like on the weekends, but I really liked it. It was a good place to go for a few quiet ones, definitely not for dancing or anything like that. I enjoyed the comfy velvet couches and the tiffany lamps. The thing that stood out the most for me, though, was the bartender. She was extremely friendly and knowledgeable, and the drinks were extremely strong. Will definitely be heading back here. PS They do accept credit cards.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-08-14", "description": "If you're out with Drunk Girl (we were) who's married (she was) and she insists on hitting on your friend (she did) who is also married (he was) and she's dropping her drinks (she was) with some frequency (all of them), there is no better place than Royal Oak, aka The Fern Bar.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-04", "description": "Drinks are pretty expensive for their small size and the crowd can be annoying but if you are lucky enough to grab some space on one of the couches up front it can be a decent spot to have a couple of drinks with friends.  Just don't expect to have a conversation without shouting.", "author": "phil h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-08-10", "description": "To the owners of the Royal Oak: Please clean and air out this stink-hole of a bar. Seriously, the place was great 9 years ago which was probably the last time anyone febreezed the sofas, but now it's just plain nasty. I pointed out a mouse running along the wall to one of the servers last time I was there. She was like \"yeah, we know about it\" without missing a step. Whoa. Time-out. I know you're not serving food in here, but there has be some kinda health code violation going on. Clean up your act and regain your glory!", "author": "Steven H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-30", "description": "I have to say when i walked into this place.  I thought wow... everything is so pink.  I was then told i was color blind because everything was red.  Although i still think it was pink.  Anyway this place is cute, with interesting lighting (the pink i was talking about) and very... i want to say it has an era theme, but which era?  I don't know.  This is something i'm not too familiar with.  Marianne said maybe the 30's... i just don't know.  You could say something is from the 70's and i'd be like... really?  But enough with my colorblindness and lack of era knowledge.   \n\nThe best part of the night was the girl bartender.  She didn't know how to make the simplest drinks.   When ordering drinks confusion just flooded her face.  So we started off with some beers... not too hard considering we ordered the ones on tap.  However, she did end up spraying beer all over one of our friends.   Then we got to the girly drinks like midori sour.  She got that.  Next, it was my turn and i asked for a sidecar.  Hmmm... \"is that like a manhattan but with brandy?\"  Ummmm... NO!!  So then she looks it up in this book... and tells me... uhhh we don't have brandy!  So i ordered a vodka martini straight up, which i got for free because she couldn't make me a sidecar.  OK fine she made up for it.   Our second round of drinks, confused the poor girl again.  This time i talked to the guy bartender.  I got another martini but Marianne got a chambord sour.  Now, this drink is pretty simple.  One should know how to make this if bartending is their occupation.  Sadly, the guy asked me if that was just chambord and sweet n sour, which i confirmed.  Instead of him making the drink, the girl bartender was given the task of doing it while he made my martini.   Watching her was priceless as she walked back and forth behind the bar looking for chambord which was sitting in plain view.  It wasn't that she didn't see the bottle but she didn't know what chambord was.  I loved it!  Her face was that of bewilderment.  She had to ask the guy what the chambord bottle looked like after 3 min. of searching.  \n\nThe lounge was laid back, not too crowded and was quite comfortable.  Some of the furniture was a little old and felt wobbly.  I was afraid that a few of the chairs wouldn't be able to support me.  I'm not even a cow and i was afraid so that should tell you something.  \n\nOverall it was a cool place, bad furniture, and sad bartenders.  At least i got some strong drinks, but then again how can you make a martini wrong?", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-16", "description": "Cash only and how can you charge $12 for a french martini in a small glass and ask me how to make it?", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-25", "description": "This bar has been there forever and its funny to hear people call it \"un-San Francisco.\" It's penultimate San Francisco, at least from a bygone era. But I won't fuddy duddy about it any more. We used to like to go there because you could have a quiet drink, but went last night and it was SUPER loud with a bouncer outside the door and pounding music. It was freezing and I wanted an irish coffee or hot drink of some kind but they had nothing along those lines. I know times change, but whoever has taken it over is probably going to further change the ambiance; not necessarily a bad thing but arent' there enough noisy bars on Polk?.", "author": "Roxmarie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-24", "description": "Non-pretentious place to chill.  Especially if you have the desire to cuddle with your date on the vintage couches.  Cool stained-glass all around, and a helpful bartender make this place a-ok in my book.", "author": "Kiki G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-15", "description": "..:11: 15pm PST:..\n\n*giggles* (FYI: i giggle when I'm buzzed) \n\ni have a bad // good habit of checking my emails (i have more than 1, and my crackberry only takes in my gmail) every night before i go to bed, and at times, i tend to drift away in a moment of reflection ... AND NOW, ever since yelp came into my life, i seem to update on a daily basis since i go out every day... \n\nnote: i write for my own personal use so i can keep track of where i've been to and my experience so i know what to look out for or give other people the head's up.\n\nAmelie vs. Royal Oak... Royal Oak vs. Amelie... Decisions... Had to drift away from the wine for a bit ... :D\n\ni like this place, i really do ... it's simply a place i'd prolly run away to when i need a fix of the marina scene, but not in the marina ... in fact, i feel like i can convince more people to come to royal oak vs the marina since we all know what people think of the marina ... it KINDA had the marina feel, but not really... i really like the fact how it's just up the street from me...well, kinda, passed van ness that is... def does not have the pretentious vibe ... the crowd was quite friendly ... low key, chill, comfortable setting.\n\noverall, it's very SF to me, how everything inside is super victorian ... \nthe interior kinda reminded me of balboa cafe, mebe it's all the wood ... the whole redness, yes, the decor, nice... very nice ... i really liked how there were so many plants, it's just got this homey kick to it...scattered with tiffany lamps ...\n\nthis would make a decent place to bring a date for a drink or two... i'd def say it's romantic, but on a Thursday evening, you're on your own there since we got these crazy kiddies in one corner ... it's reallll chill, and the sofas are extremely comfy.\n\nTIP: cash only... which truly sucks ...\n\n*yawn* me sleepy... bed time for me...\n\nnight yelpers!", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-16", "description": "Really nice place. Friendly bartending. Great Victorian decor. Came here before Halloween in a quasi-Victorian trench coat and took a bunch of awesome photos along with my blue moon beer.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "I love going to the Royal Oak whenever I can. It is an awesome bar and I consistently have a good night here every time I come.  It's a great bar to bring a group of friends or a date since there are ample tables and cozy couches to lounge on, but it is also a fun place just to come with a couple people to mingle and have fun since there are usually pretty girls around and a nice crowd in general.  The decor is really cool too and makes me feel like I'm in a jungle, and the lighting provides a nice ambiance as well. It's got a classy feel too it, but not so much that it is stuck up or snobby.", "author": "James M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-01", "description": "a funky cool bar i'd always passed by and never really checked out until recently.  maybe it has something to do with the fact that it DOES kinda look like an antique store from the outside like the bartender said.\n\ncame for a quick drink before dinner plans and the interior seemed really interesting.  the lighting was dim, but not too too dark and there were these really loungey tables and sofas/chairs set up all through out the place.  when i got there, there was a woman reading a book at the bar, the bartender chatting to two friendly cops (is that a contradiction in terms?) and two other smallish groups hanging out.  place seemed to have a very mellow vibe.  definitely thought i'd go back sometime during the work week with friends for drinks.", "author": "Bird B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-04", "description": "One word describes this bar. Attitude. I'm a halfway attractive waitress, now get out of my way. I'm a bartender with a low cut shirt, now what the hell do you want? I want to leave and not come back to this place. Throw in a few random, really drunk boners, some expensive drinks and you have a recipe for me despising this place. It's too bad, because from what I remember their Irish coffees were good but the coffee machine was broken this particular night.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-14", "description": "Fantastic place to get a drink with a friend on a thursday.  The velvet couches are oh-so-comfortable, drinks are good, and its not too crowded.   Probably not the top of your list if you like to dance on tables though.", "author": "Sloane R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-24", "description": "Go for it, put on that stripe shirt, pop that collar, do up the hair, and head to Royal Oak.  Those looking for something \"different\" won't find it here,  unless prior experiences have taken place entirely in the Marina.  Nevertheless, the bartenders serve good drinks, and quickly, and there are some decent couches and tables to sit with your friends...although talking over the bizarrely loud music may prove a bit difficult.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-02-18", "description": "One star for the fact that I can write a bad review with facts to back it up!  Drinks are overpriced, not tasty, and I usually end up spilling it before I can get away from the starving snobs at the bar.  I can never use the bathroom, because...\nA - there are a couple girls doing their lines and lock the rest of us out and force us to master the art of \"not breaking the seal.\"\nB - I am stopped before I am able to walk in the restroom with a guy half my size and offering to take me up into the \"fern treehouse\" for some fun....and won't take no for answer so I end up leaving the place.\nC - I get knocked out by a falling branch that has not been dusted since the 70's \"Fern Bar.\"\nAs if this is not enough by my fourth visit to never return, a 22 year old has a cougar on each arm, and throws up on the floor without anyone noticing.\nThanks, but I will stay home with the cat, drink a bottle of wine, and watch him throw up hair balls.  Cheers!", "author": "Lulu B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-15", "description": "this place has potential, i gave it that much from the moment i walked through the door but it's a dump, sadly.\n\nfirst of all, it's cash only, which in my humble opinion is the dumbest thing a bar can do to itself.  don't you want your patrons to drink their faces off so they're incoherent and buy even more drinks?  how do you expect them to do that if it's cash only?  but i guess perhaps you're looking out for us and helping us avoid a DUI?\n\nsecond of all, they have like 2 beers on tap...boring!\n\nthird of all, which bar nowadays doesn't have a wet bar?  it was a huge turn off when i see your bartender (point #4) opening bottles of soda and juice.  what a waste of bar space.\n\nfourth and last of all, this place has the most ANNOYING bartender (i went on a thursday night).  if i or my friends wanted another drink, we'll tell you.  don't come over and try to act...\"cute\" (?) and ask what we'll have next and offer shots.  like that's just trying too hard.  i might've given you credit for trying the first time you asked, but by the 8th time, i just wanted to leave...oh, wait...i did!\n\np.s.  maybe it's not sanitary for the bartender to be wearing flip flops during her shift.", "author": "Sally T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "Good Atmosphere, good music, Good Selection of drinks. What more do you need? Been going there for years and it has been consistently exceeding my expectations. Drop by and check it out.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "What a chill bar should be.  Dark, tons of group seating, full bar with bar tenders willing to make you any drink you could imagine.  The bathrooms are a warzone and smell terrible.  Music has always been mashup mixes the owner put together.  It's a good place to end the night.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-22", "description": "I like this bar.  It's a little kooky, very red, a bit old fashioned- but still fun.  The bartender is really nice there.  They make good dirty martinis, and it's quiet enough to talk to people inside.  What I like about this bar is that every time I've gone, there is available seating.  It's nice to just lounge there and relax with friends.  To me, it's a very un-San Francisco type bar, which is a good thing every once in a while.  Good place to come for a night cap.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-27", "description": "Pros: \n-you can ask the bartender for dice for a game of liars poker\n-lots of couches and tables, which is perfectly conducive to hanging with a group\n-good mix of diff types of people\n\nCons:\n-this might be a pro for some, but I don't like all the overgrown huge house plants everywhere.  I feel like I'm at someone's grandmother's house (minus the cats).  It kind of makes the bar feel dark and unclean.", "author": "LT B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "The Royal Oak is my favorite bar in San Francisco to get a drink.  The staff is always friendly, the drinks are solid and the scene is fun.  Its a great location for people to meet up beforehand and even spend the entire night.  I'd highly recommend it on weeknights (great for dates), weekends and on special occassions like New Years.", "author": "Josh W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-22", "description": "I had the most fun here out of my Big Foot and Bar Johnny stops. Mainly because my friend was holding up the plant that was lingering over his head and it was pretty damn funny! I'm not sure I understood the layout. It almost seems as though they need to move the tables out of the way as the night gets later because there isn't a whole lot of room to stand. I felt like I was in a fire drill as I made my way to the other side of the bar to chat it up with some friends. There had to of been at least three tables blocking my entrance, slightly annoying! On the flip side, it could have been worse. You can carry a conversation here and it was pretty chill.", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-20", "description": "The Royal Oak is one of the most unique and awesome bars in SF. I love this bar because it will satisfy both those who want to lounge as well as those that want a social scene because there is ample seating with plush furniture to sit in and also lots of people standing by the bar if you want to drink and mingle with the locals. Royal Oak is a fun place and if you are in the neighborhood I suggest you stop by.", "author": "ben T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-25", "description": "Each time I've gone to the Royal Oak it felt as if I was in a sauna.  I mean you can feel the heat and steam as soon as you walk in.  Other than that, the place is decent.  Funny decor.  Plants everywhere and burgundy velour seat covers, if I remember correctly. This place is good to bring a few of your friends and sit around and people watch and talk.  It's not too loud, and there are a lot of seats, if you get there in time to snag some. Bartenders are pretty nice, but drinks are a little questionable and not cheap either.  It's not that bad, but there are tons of other places in the city.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-20", "description": "Was there last night with a large group of people. I like this place mostly because there are lots of places to sit and you can have a conversation without screaming. I wasn't drinking last night, but looking at my friends, the drinks seemed pretty strong. I'd go again.", "author": "kristen v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-04", "description": "One of the best bars in SF.   Good crowd, but not very crowded.  The place has lots of comfortable seating and a good bar.  Great to come with a group of friends or a date while also people watching.  Beer is reasonable, bartender can make a good drink.  Not too dark or noisy either.   Solid place.", "author": "John W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-27", "description": "Cool decor, but can only go with a group of friends and even then it's hard to hear each other.  They don't take credit cards either (at least at the bar).  Who doesn't take them???", "author": "Shawn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-10", "description": "Look, I like a place with old couches, it's my thing.  I also like plants.  Unfortunately, for Royal Oak, I use debit cards and don't like carrying cash.  Despite knowing this, every time I stop by I have little to no cash, have to leave and go to the ATM and by the time I get back I'm pissed that I had to leave for cash and decide to go somewhere else.  This review is far more about me than it is Royal Oak.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-06", "description": "This place is a royal joke. The bartender last Friday night inspired my first ever review on Yelp. She had the WORST attitude I have ever come across. I took one sip of a rum and coke that I just paid for which was gross and I politely asked if I could swap it for something else instead. She just threw away the drink and walked off. After realizing she wasn't coming back (and it wasn't cos she was busy cos there was 2 other people in the whole bar) she told me I couldn't have an alternative drink because she poured it right and that I should have ordered something I liked. She was the rudest, bitchiest most unprofessional bartender EVER. She should be FIRED!!! I will never step foot inside here again.", "author": "c m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "Intimate setting with lots of very cool chairs and scenery to make conversation with.   Avoid if you are trying to meet people, but great last call spot with a group of friends.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-27", "description": "\"Dirtier... I like em really dirty.... nope still not dirty enough.\" This was me trying to explain to the bartender how I like my dirty martinis. It was not the best one I have ever had, but after a few olive juice additions by the bartender, it was definitely drinkable. The atmosphere is amusing here with the shabby/chic couches and faux tiffany lamps and it is a decent place to sit with friends. However, they were playing house music in the bar.... I guess I was confused in thinking this was a lounge, not a dance club. Also cash only... boo.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-22", "description": "the 2 stars are for this bar being literally within 20 feet of my apartment. and the decor is interesting -- like you're great-grandfather's study in a dimly-lit tropical jungle. \nhowever, i ordered a tom collins and the bartender made it with bourbon and collins mix instead of gin. i mentioned it, and she had to ask me what was supposed to be in a collins ... yikes. she made me another (correctly?) and i can't say it was much better. overpriced for cheap-tasting drinks.", "author": "Cayla W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-12-08", "description": "Good to note that this place is cash only. It's not that fun, although I love the couches and decor...and it gets so packed on the weekends that you cannot walk around at all, kinda claustrophobic.", "author": "Barbara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "I'm a sucker for the decor of this place, the old chairs and plants and dustiness and spaciousness.", "author": "L C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-05", "description": "This is just an attempt to bring up the Yelp average on this place which is my favorite along Polk street.  Yes the couches may be a little grungy but I'd rather sit on a semi grungy couch surrounded by lots of greenery than jostling shoulder to shouler in a place like Buccaneer.  The cash-only thing can get a little annoying especially since it's easy to order several rounds once you're situated in a cozy corner, but overall a great place.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-29", "description": "The lighting--the awful, awful, terrible lighting.  I don't know what it is, or if it's just me, but the place glows red.  It's the pyric fluorescence cast off by Inferno--not unbearably hot, but not entirely flattering, either.\n\nFurthermore, \"the drinks are weak\" is not usually a complaint I care to voice, but at the Royal Oak, it's a real and consistent problem--especially considering the higher-than-average price of a vodka soda.", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-05", "description": "NOW I know where the red fern grows!  Jesus, bring a machete with you.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-26", "description": "Probably one of the best lounges in the city though their drinks are a little pricey. The place makes me fantasize about old English men smoking cigars and drinking brandy in private clubs back in the early 1900s. It is a great place to stop by while bar hopping on Polk St when your dogs are barking and you want to sit for a while before getting back out there. And for the ultra lazy, they even have a waitress that will take drink orders and you don't even have to get up to get your drinks. I agree that the crowd is lame but I wouldn't recommend the place if your going to hit on people. More of a sit around with your friends kind of place.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-11", "description": "A comfortable, overpriced, low key fern bar.  That pretty much sums this place up.  Some friends wanted to meet here last night, and even though this isn't my kind of bar I decided to tag along anyway.  So I get there with another friend, walk up to the bar, and order a Hendricks and tonic for myself and my friend, handing a $20 to the attractive female bartender in the process.  I get back two drinks and no change.  It's at this point that I discover that this place is charging $10 for a gin & tonic!  I'm sorry, but this joint is nowhere NEAR cool enough to charge that for a drink, hot bartender or no.  It'd be a decent bar were the drink prices lower, but even then it wouldn't be anything worth seeking out.   So basically, there's nothing to see here folks, please move along.", "author": "Joshua W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-18", "description": "I was there early on a Thursday evening and thoroughly enjoyed myself.  The decor is very cozy, Victorian and romantic.  The noise level is a dull roar; perfect for conversation, but not so quiet that you're afraid the people near you will overhear things they shouldn't be privy to.", "author": "Beth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-15", "description": "Lots of fake foliage, red decor, very hot.  I went last night and it was packed. They need an air conditioner or something because I felt like I had entered a steam room when I walked in off the street.  By the time we were able to find seating, I had adjusted to the heat so it was cool.  I was with fun people so it ended up being a good time.  I give it a 3 because the cash only thing is annoying.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-14", "description": "I like this bar a lot. Every year my group of friends gets together on a Thursday in December to have a Christmas drink (or 7) together before everyone leaves town for the holidays, so the Oak holds a special place amongst us. Otherwise we don't get down here all that often but everytime we do I wonder why we don't come more often. Really like the decor, red lighting and tons of plants, very cozy. Major drawback is that it is cash only. Major plus is lots of comfy seating, couches, chairs, etc., for if you're just catching up with folks.", "author": "Sarah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-14", "description": "Drinks here will cost you an arm and a leg, so try to rest those appendages in one of the plush velvet couches before you head over to the bar. I'm a sucker for lounges and I kind of liked the whole red velvet theme with ferns (not oaks!) scattered all over the place. This was my group's last Polk St barhopping destination so it wasn't that crowded, which was great. However, I can imagine this place getting really annoying when packed.", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-18", "description": "the husband likes to call this place the royal joke. \nhe's so clever.\n\nwe actually had our first date here, so i will always have a soft spot in my heart for it. but i agree with what most others say about it. i think they overcharge for weak drinks, and not so good wine. the staff isn't very nice, and it can get way too crowded with assholes from the marina--stay in your own neighborhood wontcha? \n\ni do like the couchy atmosphere tho and it's not bad if you go early to get a seat, drink beer, and happen to have cash on you.", "author": "rachel p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "So this place is not somewhere I am trying to go again..... I went on a Friday and it is not a spot to chill. If your willing to spring for weak ass pricey drinks then go ahead and get slamboned, But on a week night, with a few friends, for a casual but expensive drinks then go ahead, but be prepared to have an average time. The ferns inside are cool, the red is cool until you realize that this place is NOT cool, then you leave after one drink.", "author": "peter v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-17", "description": "I have a love hate relationship with this bar. Loved it for its chitzy decor (velvet couches, tiffany-style lamps, and foliage aplenty), then hated it for the lame crowd it tends to draw, and now am loving it again because of the friendly bartender who we met Sunday night.  My friend and I just wanted a place to have some coffee and all the local coffee shops on Polk St. close by 11 pm. The awsome bartender not only didn't give us attitude when we sat at the bar to just have coffee, but she served it in a cognac glass with sugarcubes, and spent a good amount of time chatting with us. Can't beat that!", "author": "shoba d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-18", "description": "Expensive, boring, and rude workers.  You have entered the category of \"worst San Francisco bars\" that is being championed by Kells", "author": "Adam O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-17", "description": "I love this bar. Chimay in the special glass. Beautiful people. Great vibe...NOT TOO CROWDED. I love this bar.", "author": "Sherie R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-15", "description": "It's never been crowded here, but I've also only been here after midnight and it was pretty chill. I could put my feet up on those fancy replica velvet couches and admire the replica Tiffany lamps whilest sipping a nice refreshing Bass & Cider (they f*cked up my Snake Bite)?!?! I guess its more of a \"bring your own friends to talk to place.\"", "author": "Charm N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-08", "description": "Pretty chill place. It's a bar with a lot of mismatched vintage furniture to lounge on. The chairs and couches are actually in surprisingly good condition considering it's a bar. I love the decor - sure is a getaway from the urban cityscape. Everybody was pretty friendly, and this place makes a good spot to hang out with some friends. Not really a place to mingle with strangers the way it is set up. Oh yea, and it's cash only...", "author": "Jon N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-14", "description": "cool atmosphere... good drinks\ndef worth checking out if you are in the area\npolk street's got a lot", "author": "Scott K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-21", "description": "Been here in the past and remembered it being a bar with lots of ferns and plants and overgrown trees?! I guess they did some slight renovation and the place seemed a lil less congested. Best to secure a corner or seating area otherwise, you get bumped around in the bar area. Casual chill-out place, reminds me of Rainforest Cafe with all these luscious greenery altho without the owl hoots and animal noises and ok, they don't serve food.", "author": "Yan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-26", "description": "I have the feeling that when they turn on the lights in this place it seems mighty shabby. However, it has a certain charm bathed in red light. It's a mecca for Russian Hill yuppies so be prepared for lots of guys congratulating each other loudly over some conquest and girls teetering by yabbering on cell phones.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-16", "description": "meh... i like the redness. it reminds me of my favorite santa cruz bar the redroom. the couches were comfy too. boo's to being cash only (at least thats what we were told) and sitting on couches where couples decided to sit right across from you and basically get it on right there. i'm all about the loving, but not right in front of my face, in public!!\n\nthe drinks were decent, people were eh. maybe will return and try another nite.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-12", "description": "This place is really strange....just moved in nearby and not a big fan of the polk street scene, but it was a monday night and we just wanted to grab a few drinks somewhere nearby.  This place was packed on the weekend, but empty on monday (obviously), so the bartender was training someone new, and making random recommendations as they didnt have a drink menu (i'm a picky drinker).  i said i like vodka, so she made us some random shit that tasted awful, and we felt bad to say both the drinks were god awful, so pretty much just paid $8 each plus tips (cash only) for drinks we left untouched.  The plant decor is kind of cute, but more just seems to be covering a nastier, tacky backdrop.  Also, it resembles a place near my house in the west village in nyc, russian bartenders and the same style decor (yet more $$ and crappier drinks)", "author": "Danielle J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-25", "description": "Decent bar with a nice ambiance. Lots of wood and plants.", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-10", "description": "Seriously, get a credit card machine.  Be prepared to pay \"cash only\".  Truly annoying.  Getting past the credit card issue, I would recommned a visit.  I like the interior and the crowd is pretty friendly.  But they need to start taking credit cards.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-24", "description": "I enjoy the Royal Oak for a variety or reasons ranging from how comfortable it is inside, the Chimay on tap and the Marina contingency constituting of the minority.  The one thing I don't like is that it's a cash only bar, which is pretty annoying.  Anyway, it makes for a great night.  I usually do dinner @ Lemongrass, go to Royal Oak and then end the night at Tonic.", "author": "Jonathan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "SO I use to go drink here before baby and loved the mellow vibe as well as the ambiance.  A couple times I went out after baby I came here for some drinks and girlfriend time.  Very relaxing and great place to throw a couple back or 3 or 4..heehee!  The only problem is parking SUCKS!", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-30", "description": "now this is my kind of bar.   to be honest, i've rarely scoped the crowd.  i'm happily attached, so the social scene is less important to me than the ambience when i'm out for a drink.  i enjoy a rowdy, friendly place as much as the next girl.  and this isn't where i'd go if i wanted to make new friends...\n\nbut it's down the street from my house, clean, has comfortable seating, and is rarely outrageously packed.  it's the antithesis of beauty bar, which i got dragged to one night after a blissful cocktail at the royal oak.  i realized, despite loving the restaurants and prices in the mission, i prefer the comforts of russian hill.  i guess that settles it- i'm not a hipster and i'm also no longer in my early 20's.", "author": "nicole l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-06", "description": "Expennnnnnsive ($7 for a Chimay--okay, Chimay is expensive in general), very girly (not a knock), very reddish, very Victorian(?) with incense burning and chock full of Tiffany lamps. It is cozy for sure though. But...meh.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-09", "description": "Like many others, I am quite confused that this place doesn't take cards.  The only other time I have ever gone into a bar that didn't accept credit cards was when I went to one's opening night and their credit card system wasn't working yet.\n\nMy friends and I came in here after we had just left the Bigfoot Lodge and saw that it didn't look too crowded.  The setting here was pretty relaxing, but I guess I just tend to feel comfortable in bars that have that tinted red lighting.  The music was quite an interesting mix where one song would be 2pac only to be followed by Sublime.  Pretty nice if I must say so myself.\n\nAll in all, pretty normal bar that one can still have a nice drink at with good friends, granted you carry cash.  If you're into the frat party like bar setting, this might not be for you as I noticed the clientele mostly consisted of the older, possibly more accomplished crowd.", "author": "Joel J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-08", "description": "I came here on a Friday night around 11pm, and it wasn't that busy.  The place has nice decor, and there's plenty of seating.  But the drink was pretty lousy.  We paid $8 each for our martini, and it was practically water.  Barely any taste of alcohol, or fruit for that matter.", "author": "Mon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-22", "description": "So classic, old school San Francisco-- with the Tiffany lamps, velvet couches and ferns.  I didn't feel that it was dirty/stinky like some reviewers said, but maybe they cleaned it.  I liked that it wasn't very crowded on a Saturday night, and it was entertaining to watch the scene from a couch in the corner.  Yes, it's expensive, but the bartender sure can make a mean Rusty Nail...and Manhattan.", "author": "Vivien W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-10", "description": "Gotta love that jungle atmosphere!  The crowd is a bit lame (everyone kind of looks EXACTLY the same), but the plethera of plants from the floor to the ceiling make this small bar pretty darn fun to hang out in with some friends.  And so do all the cool mirrors, lamps, and the furniture... all night I wanted to walk out the back door with one of their huge old-school red velvet sofas.  Oh yeah, and the drinks were pretty good too.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-14", "description": "This is a continuation of the concept of a \"fern\" bar from the 1970s where non Californians came out to breed with as many new partners as possible to Californicate California with mega mansions, techno billionaires with Attention deficit, 4 wheel drive vehicles for city driving, therefore creating an overabundance of GapKids stores and South of Border nannies that spend more time with Californicated f**k ups in Phoenix House's Kindergarden classroom.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-28", "description": "this place is great depending on the evening. Weekends we stay clear as it's a haven for drunken fratmarina types but on the weeknights it's quiet and comfortable. The atmosphere is nice for a couple of after dinner drinks.", "author": "Ariana M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-16", "description": "nice bar.  good ratio of guys so if you're a single girl this place isn't too bad. Nice decor.  A bit crowded.  Probably would go back.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-21", "description": "I like the excessive indoor foliage, but the crowd was very college, which is cool if you're in college. But I'm not.", "author": "Michelle O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-29", "description": "Great neighborhood bar!  Love coming here for a night when I feel like going out, but don't want to get too crazy.  Perfect for a Friday-after a long day's work.  Royal Oak has a lounge type setting with vintage decor, dim lighting and strong drinks :)", "author": "Audrey G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-05", "description": "YYYYAAAAWWWWNNN.\n\nWant to go somewhere trendy for a drink?\nThis place is lame, try another more 'happening' spot.\n\nWant to go somwhere relaxing and laid-back?\nForget it. This place is snobby.\n\nWant to go somewhere memorable?\nTry another Polk St. bar...Royal Oak is lame.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "Can we say Ambiance?  I really feel like they should change the name to, \"In this lighting, anyone could get laid!\"  Drinks are a little over priced for what you get, but this bar is totally worth checking out.", "author": "Jodi P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-02", "description": "Nice seating areas but the drinks are overpriced and so-so. My friend has a glass of stale wine that was too awful to finish after one sip. I was stunned the place wouldn't take credit cards (based on the price of the drinks and the seemingly nice decor). Rex Cafe was a much better stop along this street.", "author": "Everso T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-10", "description": "This is a great alternative to the Fillmore triangle scene, especially if you are already a few drinks into your evening.  The music is loud but at that point you are singing loudly as well.  So, it's ok.  Try and get there in time to grab a table with friends.  \n\nBiggest drawback is the sometimes rude staff and the fact they only take cash.  Fun stop on a Saturday night though.", "author": "Robert D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-21", "description": "Bar offers comfy seating and real chill surroundings. If you are looking for a place to get a couple drinks and relax with some of your buds, this is a good place. Don't expect to make a CRAZY night out of a trip to the Royal Oak because prices and music volume can make extended stays a big tough at times. Usually the music is good, but it can be a bit tough to hear someone across one of their round tables over the tunes. I wish I chilled down there more, because the location offers pretty good people watching in early evenings.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "They got a credit card machine YAY!   This was the one thing preventing it from being the best place on Polk.  The music is an awesome mix that you always find yourself singing along with.  The bartenders are super friendly I asked the girl to make me something good and she created a wonderful drink for me.   Tons of beautiful people and a classy atmosphere.  Now that they accept credit cards its a done deal.", "author": "Analise Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-14", "description": "nice roomy bar.  i really hate cash only bars though but this one was rather cheap.  people were friendly, especially the bartenders.  wasnt too crowded which is always a plus.  i like to be able to order a drink without getting an elbow to the face.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-27", "description": "the decor and scent remind me of my dead great-aunt's little berkeley nest, including that one couch she'd bought during the mcarthy era that has the busted spring that rides up into your crevasse.  you know what I'm talking about.  convenient spot to wait out delayed reservations at any of a number of nice polk street restaurants though.", "author": "Kosuke I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "I really like this place. It's got good decor (red lamps, couches, big round tables, Tiffany lamps) but it's kind of offset by the clientele. Walk in for happy hour and you'll find failed aging AA members mixed with white collar jocks. On the weekends, it's jam packed with typical Russian Hill folk, and is a nice medium between Tonic to the North and Shanghai Kelly's to the South.", "author": "Jenna F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-10", "description": "i'm with meagan.  well, i didn't grow up here and i rarely get to the mission because i'm quite occupied with all that the 'north' has to offer, but i love this place too.", "author": "George K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-14", "description": "The decor of this place it really cool. I did not go in on a weekend night so I can't comment on the crowd. The staff was nice. Definitely recommended for a drink or two. The interior reminds me of National Mechanics in Philadelphia but without the cool science stuff.", "author": "dc h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-26", "description": "I used to love this place to have a quiet drink, I have been going there for a long time. Recently, I met my friends there on a Wednesday ningt around 11 pm. We all work in the restaurant business, and know about service. I don't know what happen to that bar but is going down the hill. That night there were two female bartenders, working you can tell they were flying higher than a kyte. I definetely will not go back there and I will tell everybody not to go there, I used to send people there from the restaurant that I work from but not any more. I was mad and dissapointed with the owner and workers. Don't wast your moner there there are plenty of better bars to have fun.", "author": "Carlos O."}
