{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "That super nice to Shell group. Always go on front to.\nBest coffee in San Francisco.\nBest Latino cashier!!!", "author": "Mario G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-28", "description": "I have been to another Royal Ground Coffee in the Richmond. It's a nice coffee shop with a unique atmosphere. This one had a collection of antique coffee grinders. I had a breakfast bagel with egg and cheese. Also, a Sprite. I just needed a snack.\n\nInterestingly, the person working the counter would disappear when there were no customers waiting. She appeared when I was ready to order and then as soon as she finished helping me, she disappeared and there was no one standing around the cafe. There were other customers hanging out in the cafe...maybe 2 or 3.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-16", "description": "Got a quick dinner at this cafe. Had the club sandwich and it is delicious. The coffee is okay. Good spot to hang out chill.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Nice unique surroundings. A local coffee shop with character.  A local neighborhood coffee shop with friendly staff.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "This morning I had some time to wait for my car to be fixed across from Royal Ground Coffee. I'm glad the mechanic recommended it. It's a small café, very clean and well lit. They offer a variety of bagel breakfasts. The coffee is excellent. The owner, Joseph,had the radio  set on KPFA classic music making the whole place very soothing. This coffee shop is wheelchair accessible. It's a perfect place to carry on a conversation.", "author": "George W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "My mother and I arrive around 10:30 am on 8/30/18. His acknowledgement to us was \"what do you want\". When We in asked about a tea latte advertised in the cafe, the man behind the counter responded short and curt \"we don't have that\". I then asked if the hummus bagel could be modified and he responded again with the same attitude \"it's a dollar more\", as if he was not trying to do it and it would discourage me. When I asked if I could have whipped cream on my iced drink he said yes, but shorty after gave me my drink without it. He said he forgot, opened he drink in front of me and put the whipped cream on with the lid wet on the counter. When asked if they had a lid for it he said \"we don't have that\".  His demeanor was very unwelcoming and was as if we were bothering him. We were also the only ones in the cafe. We felt like we were being treated like second class citizens. Do not expect a warm friendly environment, unless he's not there.", "author": "Marissa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Good coffee,  decent price and great customer service!  The guy at the counter is friendly and pleasant to deal with.", "author": "Jun S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "This place is my favorite Ground Royal Coffee in the city. The owner Jozef is always nice and polite and easy to deal with. Bagels are always fresh and the coffee is tasty.\nMy favorite is the pesto feta bagel what is their speciality.\nLove to hang out on the bench by the side on Spruce street and people watch.\nGreat business, highly recommended!", "author": "Logan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "My favorite thing about coming here is the friendly smile, and down to earth demeanor that the barista, Joel, has. You can tell he's passionate of all the food he makes here. Whether it's a quick coffee or delicious breakfast bagel. The atmosphere here is very typical of your average coffee shop and I love it.", "author": "Jerry C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "Update: the owner sent me a passive aggressive private message after reading my review. Doesn't look like management cares much about constructive feedback. Downgrading to one star. \n\n\nIn a convenient location close to city center and Trader Joe's on Masonic. Quite dirty compared to the RGC on Polk street- visible dirt, grime and dust and there is an odd smell. I ordered a chai latte which only comes in a large- it was lukewarm and came in a to-go cup even though I was staying in house. This seemed to be standard practice. The chai was super super super sweet. It was sweeter than Starbucks chai- I couldn't finish it. Disappointed in my experience because I loved the RGC in my old neighborhood.", "author": "Sarem G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "cool little place!!! love their egg salad and coffee! Joan is soo kind and attentive to my needs! She gives a warm welcome which will make you feel at home! Joan you go girl! You are a gem to this lovely cool coffee shop!", "author": "Stunner D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Neighborhood coffee shop, convenient and delicious. My go to coffee every day! I love this place, staff, coffee and the owner is a very kind man who greats me daily even when I'm just passing by.", "author": "Gabrielle Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Free wifi, charging docks, and great people. Great place to grab a coffee or sandwiches and do work", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Found this rando place for lunch while walking down Geary.  I got a turkey sandwich on dutch crunch and was very happy with it.  The food came out really quick and the service was nice.  I like the atmosphere and homey vibe in here.\n\nIt's everything I could've asked for.", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "This is my favorite café in the city. It's never crowded, it has a relaxed vibe, the staff is friendly, they have easily accessible power outlets and free WiFi, and most importantly they have good strong coffee! They also have a nice deli menu that exceeds my expectations for a small coffee shop on the corner, and it stays relatively quiet if you need to focus on reading or work. Anyone who has anything negative to say about to the place should stick with getting coffee in the Financial District!", "author": "Adrian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Every morning starts with a cup of Joe poured by the wonderful Jozef or his star employee Joey. Yes I see the irony in the names.  Fabulous family owned business.  Coffee is hot, the ambiance cool.", "author": "michelle m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-09", "description": "Pretty bad espresso drinks at this location. Polk street location is significantly better than this Geary location.", "author": "Faiz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "This has been my 4th time here and I would have to say these stars go to the employee the young gentlemen that's usually always there I got his name once I believe it's Jol. He is just so welcoming and honestly loves doing his job. His mochas, and lattes are to perfection and the way he makes his sandwiches everything about it is right.", "author": "Tee V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Very quiet and relaxing place. Wi-fi and charging docks. Excellent sandwiches reasonably priced. The employees are very friendly. My first visit and the young lady behind the counter was very helpful in helping me pick something. I'll definitely be coming back.", "author": "Joseph S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "I love this little chain. Wifi, food, quiet, the works. Random but cool room in the back.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "This place has been my favorite coffee spot in San Francisco for over 10 years now. If I need a cup of tasty strong coffee , I go only there. They have all kind of bagels, sandwiches, salads. Always fresh and delicious , highly recommend roast beef sandwich and Lox bagel!!! \nThere is also a separate room with comfortable sofa and several small tables, nice place to relax or just read a book and no problem with parking. Great place!!!", "author": "Mariya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Latte was very good and the foam was very good. I relaxed on the live seat and looked outside. The view was decent. When I got there all seats we were taken except for the love seat I ended up sitting on. Comfortable and I enjoyed my down time.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-14", "description": "Worst Mocha I have tried. It seemed to be just filter coffee with chocolate syrup - had to through it out. Won't come here again.", "author": "Senya T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Cute cafe with lots of plants and natural light.  Great classical music.  Delicious coffee.  Very kind owner.", "author": "Reiko S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "First time in San Francisco and after visiting the full house house, I came across this small coffee shop! I have nothing bad to say about this place. Best choice ever! I had the ultimate bagel And an orange juice; plain maybe, but it was so good. The gentleman in the front was so friendly and welcoming really cool guy... I recommend it, a must try.", "author": "Evelyn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-30", "description": "Came here around 7:30am when it was freaking freezing outside and my car was getting serviced across the street. I wasn't too hungry but ordered a tea and pound cake to share with my mom and a cup of mocha for myself. The seating is quite cute and quaint. We sat there for a good 45 minutes while workers of all types came to get their morning coffee while rushing off for work. The cake was good per my mom who loves pound cake. The tea and coffee was satisfying especially in the cold foggy morning. The owner even gave me a free box of granola bars. Thats nice of him! My mom said the bathroom was very clean.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-16", "description": "I'm sure a lot of people would agree when I say that waking up at 7:00 in the morning sucks.  However, I'm sure even more would agree that having to wake up at 7:00 in the morning on a Sunday sucks even harder.  Ugh.\n\nThankfully, there's this wonderful thing called coffee, and places like Royal Ground that sell it to people.  People like me.  As in, people who really shouldn't be complaining about waking up at 7:00am on a weekend because other people, specifically including the wonderfully nice girl working behind the counter, had to wake up even earlier to go to work.  To work at places like Royal Ground.  On a weekend.  Boy, don't I feel like an ass?\n\nSeriously though, with a cup of coffee in one hand, my delicious and tasty Lox and Cream Cheese bagel in the other (not exactly a breakfast of champions, but I was too tired to care), a cozy coffee shop to sit in (love the little nook area in the back), and a friendly barista there to greet me, being up that early didn't seem that bad anymore.  With free wi-fi and plenty of snacks and sandwiches to try on their menu, I would definitely come back to this Royal Ground (parking around here is easier than by the one further down Geary).  If for no other reason, then to throw a little more money into that tip jar.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "the best cafe in the area. love their chicken sandwich and white mocca coffee! the owner is very friendly and so is Joan.\nShe is so gracious. Highly recommend this place!", "author": "Erick Chuck D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Yesterday morning I stopped in and bought a fruit and yogurt parfait. I brought it to work and started eating it. I saw one of the blueberries still had a stem on it so I picked it off and put it on my napkin. And then I noticed another little green thing so I took it out and put it on my napkin. IT STARTED MOVING. It was a WORM.\nI went back today and explained what happened. The cashier guy was not apologetic at all. He was very defensive, \"We make them fresh daily.\" Okay, but. Mine had a worm in it. He offered me another parfait. Um. No thanks. He did give me back my $3.95, but I'm never going back.", "author": "J F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-03", "description": "Terrible service I asked for a hot chocolate and they give me a cup half full of whipped cream and coca powder. The Pic is after the foam went down.", "author": "Lera W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "Came in here to grab a quick bite to eat and was pleased to find a great little artsy cafe. Super high ceilings with a rustic, very San Francisco interior. There was one cashier, a small foreign girl who was pretty sweet. The service wasn't awful, but it was also not memorable or over the top amazing. I got a pesto bagel on an everything bagel (idk what exactly that meant but it was good). They had a nice bay window seat which was really nice and it was overall just a nice, simple cafe. Pretty clean bathroom too, which is always nice.", "author": "Kyle D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Ok this place totally grew on me. I am not a fan of their coffee but I have been back here several times to study and eat and I am beginning to really dig this place. There is a nice girl with short hair that works there  that doesn't seem bothered by my weird requests.  Their meatball sandwich is pretty good! Also like their selection of food and drinks.", "author": "N N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-03", "description": "So, let's start with the bagels. The man named Joseph, who gave who wore a frown the whole time  made my bagels with a complete lack of care or attention. Then I asked for a bit more cream cheese because a slice was sloppily placed between tomato and sprout (not even on the hot bagel) and he charged me an extra dollar for it. The bagels are barely toasted, and cold slabs of cream cheese were thrown in the midst. You can peel off the cream cheese (check out the video). Also they don't even cream cheese both sides. Did I mention the person had no emotion?\n\nCoffee was run of the mill. I won't be going back and live a block away. Tried this place a couple times. I am done.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "******************************* 971 *******************************\n\n         Little business that offers fresh coffee, smoothies, breakfast and simple sandwich for lunch.  Yummy onion bagel, egg, cheese and bacon breakfast, hot coffee, good service, cute little cozy shop!", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-11", "description": "I used to come hete daily several years ago since I work across the street....I recently transferred back and so looking forward to my favorite bagel.when I went in to order they still had the same sign for a bagel with cream chesse and sundried tomatoes $3.25.qhen the guy rang me up it came to over $7.\nWtf???...when I asked why he said prices went up..I pointed to the sign he said it was wrong...do you want it or not...quite rude. I said you should take down your sign...he said I will..have a nice day. I left empty handed and so disappointed. .no more bagels at work for me...too bad they lost alot of business from me since this would have been my daily stop before work", "author": "diane m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "My favorite go-to is an onion bagel with pesto and feta cheese. Amazing! But the coffee always has a burnt taste to it. Maybe it's just me. Hmmm.", "author": "Nicole F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "I am bumping Royal Grounds up to 5 stars.  Since I got my little Pied-à-terre in the city, I have been going by here quite often.  The service is always friendly and relatively efficient.  There is usually only 1 person working there, so if 10 people show up all ordering breakfast sandwiches, it will, of course, take a few minutes to get your order.\n\nThey let me bring my dog in since I am usually walking her when I stop there.  They don't make me leave her outside on busy Geary like the coffee place down the street does.  Also, the girls there all talk to my pup - I like it when they speak Russian to her and she acts like she know what they are saying.\n\nThe soups and sandwiches are very good, the coffee is great, and the service is excellent.\n\nIt is also nice that they have a separate room towards the back.  If you need to get some studying done (a lit lf USF students live in the area), you can sit in the back with your coffee, using the free wifi, and not have the comings and goings of the front counter disturb you.\n\nGreat neighborhood place and my go-to coffee place when I am in SF.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "A solid four stars, if not better.  I happened to stop by here yesterday morning while in town and had an awesome slice of banana bread and a mocha at a very reasonable price.  The interior decor was charming.  The staff was super friendly and kind.  The outdoor seating looks nice too.", "author": "Terence D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "This place is awesome! The staff is super warm and friendly and the bagel sandwiches are my favorite breakfast treat! There is a reason why I come here 3-4 times per week  So glad to have a place like this in San Francisco!", "author": "Jen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-10", "description": "Like everyone says the service here sucks. They only have one person working at a time. This would be a great cafe if you didn't have to wait an hour to get served by a bitterly stressed overworked employee. 50/50 a coffee a few shop  nextdoor has 10% of the menu, yet they have 3 or 4 working at a time. This is why they have more customers. No cafes only have a single person working, especially if they sell food. One should be on the register, another making drinks and food. Ideally there should be one on the register, one making drinks, one making food. If your a business owner it would make sense to try to get the most out of your investment by increasing the throughput of that asset. You could get customers out the door faster thus selling more product, employees would be more enthusiastic as they would not have to cope with a line of frustrated customers waiting.", "author": "Joseph K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Coffee and sandwiches are delicious!  Stopped in here looking for somewhere to sit and work for a couple of hours and I am glad I found this little corner gem.  Very friendly and the prices are reasonable.  Definitely coming back when I return to SF.\n\nHappy coffee drinking!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "Can't stop heaping praises about this sweet coffee place. \nAmazing selection of coffee made by a wonderful barista. Very nice, very patient , very beautiful too. I go there to sit and study all the time. Love the bay windows.", "author": "Maya A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-31", "description": "The coffee is strong... \nThe service is spotty. Sometime the lady is friendly and chatty, other times bitchzilla rears her ugly head ...\nThe coffee is served boiling hot, like wayyyy too hot.\n\nI keep going back mainly for nostalgia's sake. I miss living in The City and miss my old haunts.\n\nOh, and the turkey sammiches are good!", "author": "Anderson C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "My favorite sandwich in the world lives here. I love the friendly blond cashier who is always sweet. Walk in off the street, and order anything off the menu, it will be delicious. \n\nI always get a Dutch Crunch Roll with turkey, avocado, cheddar, lettuce, and mayo. I'm a purist, but I'm pretty picky about my sandwiches. I love the fact that everything is toasted to crunchy perfection, and that I don't have to pay more than $8 (tip included) for a super tasty sandwich whenever I want it. \n\nThese guys know freshness", "author": "Charlene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "Love this Royal Ground Coffee House! I used to go here every morning for breakfast when I lived across the street. Joe Joe's special is the best! Joseph is so nice along with all his staff! No matter how long it has been since I have been there they always hook it up! Their sandwiches are awesome. Always fresh ingredients and cheaper than most SF sandwiches. I will always stop in when I am in the neighborhood!", "author": "Natalia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-13", "description": "Coffee is good but you should never be able to call yourself a deli if you microwave the meat for the sandwiches. Love the room in the back and a great quiet spot but will never order a hot sandwich again (I had the pastrami).", "author": "Jess B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-14", "description": "As a place to work and spend some time, this place is perfect. A lot of good light coming in, plenty of outlets, good food, not too crowded, friendly staff. I enjoy the ambiance of this place very much.", "author": "Deanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "I had a very pleasant first experience. Stopped by on my way to the airport to get a cup of coffee & ended up also purchasing the tiramisu cake which was delicious. The coffee was delicious! Gentleman who served me was very pleasant & provided great service.", "author": "Natalie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "Royal Grounds Coffee CHICKEN SALAD SANDWICH on DUTCH CRUNCH is the boooooooomb!!!!!!!!\n\n(I'm getting a Royal Grounds Coffee boner, just thinking about it.)\n\nI would make the drive to the city, from Hayward, just for it.", "author": "Tiffany M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "I like this place! The best egg salad sandwich on dutch crunch roll I ever had!", "author": "Anelya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-04", "description": "I stop by here in the morning on my walk to work to grab my coffee (black). The place has a nice look to it the service is quick and the coffee has been good. I'll have to buy a bag of their beans sometime and try a sandwich.", "author": "Keith A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-27", "description": "In a jam.\n\nNo smiles. No egg whites. And perhaps worst of all no jam.\n\nAte my scrambled eggs on a whole wheat bagel (fine) and quickly left because I got the feeling my business wasn't really wanted (not fine).\n\nIt's too bad because with the corner location and cozy spot there is opportunity to be something royal with the right staff.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "Easy and great spot for a coffee on Geary blvd near USF. Very friendly staff and large selection of drinks. \n\nFull selection of deli sandwhiches and breakfast sandwhiches as well (didn't have time to try one. \n\nFree wi-fi if you make a purchase. \n\nPlenty of seating in front or in the back. Really relaxing feel. Stop in!", "author": "Jesse F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-26", "description": "I walked in from across the street to grab a bite to eat while I had my tires changed. The service was quick, friendly and the Chai Tea Latte was great. So much flavor packed into a cup of delightfulness. Also indulged in an onion breakfast bagel. I'm looking forward to revisiting to try some of the fresh baked goodies on the counter.", "author": "Jennifer F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "Royal Ground Coffee has good coffee, good sandwiches, good service, and good prices. It's the real deal. If there is a flaw, I suppose it's in how small the building is; it's a bit of a tight fit in there, which weakens the atmosphere somewhat. All things considered, though, I'm a fan.", "author": "Erik B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-31", "description": "Honestly, I go to Royal Ground Coffee for one thing, and it ain't coffee:\n\nThis place serves a tasty avocado sandwich (omg lots of avocado...num num num) on dutch crunch bread for 5.75.  According to other folks with whom I've gone there, the other sandwiches (similar pricing, a little more for meat-based stuff) are also good, with generous portions of quality ingredients.\n\nI don't know...I can't help ordering the avocado on dutch crunch.  :)\n\nI didn't like the coffee at all, and some servers are very friendly while others are kind of snooty.  That's where they lose a couple starts, for me.\n\nCool spot for people-watching on Geary if you can get one of the window tables...and you generally can, if you wait just a few minutes.  The place seems to get a good flow of customers, but it's not super-busy.", "author": "Crys L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "I am definitely a fan of this place. Its a cafe but so much more. I really like going here to study and do work. They have free wifi and tons of electrical outlets. Is also a really comfy places with booths, couches, etc. perfection. I've spent long afternoon hours here, but don't come at night or in the morning really...just mainly my study and work zone.\n\n1. Free wifi: it's great that this place has free wifi because it just well, is. Hehe. So basically there are couches and tables, and a million places to sit, put on some headphones and watch a movie to get away from roommates or research a paper, and do work. It's a great atmosphere.\n\n2. Menu. they have a great menu, that has more than just pastries and coffee. You can get bagles here with anything you want on them, gyros, sandwiches, salads, soup..huge selection of like lunchy foods. They also have a huge selection of cookies, cakes, and the like. Great menu of coffees, teas, and other beverages. They also make really good fruit smoothies ! Yummmmm\n\n3. Prices. The prices here are amazing. Seriously, so inexpensive and the quality is so amazing. \n\nI like this place to come and go and get some work done. I wouldn't bring a date here, and it's hard to have large groups here because they don't have really big tables. Its a great place to grab lunch to go or breakfast..Seriously, if you need to get work done this is the place to go.\n\n\nParking can be difficulty in the area. There is a Walgreens and a Ross across the street as well.", "author": "Maryam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "Very nice coffee shop, great place to go if you are sick of Starbucks or Peet's. Great selections on drinks as well as sandwiches and snacks. Friendly staff as well.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-12", "description": "Had a hummus bagel with beansprouts and pickles which was healthy and delicious! The coffee is fresh and the service is always happy. This place has a relaxed atmosphere so you can eat well, study, work and stay steadily caffeinated!\nThe attractive staff doesn't hurt either :)", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-19", "description": "I liked my breakfast so much I went back for lunch.\n\nFrom the outside it looks like a regular coffee place but the good food and the really great staff makes this my new go-to.  Could not believe how much I liked my breakfast -- egg  & bacon on a bagle.  tasted good and really big.  just not what I expected.  It was just so easy and ... well ... easy to be there.  really enjoyed it.", "author": "J. F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-20", "description": "Cute place and nice staff but would have liked to know they closed in 10 minutes before I had ordered a coffee and sandwich and sat down to do work.  Peeved.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "Great little coffee shop with a fantastic\nSelection. Ever sense I first went I have loved it and they make incredible sandwiches with Boars Head meat. Expect to be a little to full after a full sandwich however, they are big", "author": "Matthias K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "I know they say \"it has character\" on cheap things, but still. I am fed up with coffee shops all looking like an Apple Store, give me rusty old wood smell all day every day.", "author": "Liam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "I needed a quick meal and I was not in a mood for fast food. Ended up at Royal Ground Coffee where I had a spinach Quiche. It was quite inexpensive and I liked it a lot. The cost ended up being the same as a burger at Jack in the Box but the meal I had its 20 times better.This shop has big walls with beautiful paintings and it's very comfortable; there are big couches and plenty of chairs. They also have several options in case someone is in a mood for sweets; from cookies to muffins and several other options.", "author": "Pepi R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "This place is an awesome place to go if you are looking for a nice quiet cafe with good food and good coffee. My go to order is the veggie bagel and a mocha. The mocha is rich and chocolately and delicious and the veggie bagel is bursting with a bunch of fresh veggies and is very fresh. It is nice and quiet and very cozy feeling.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-28", "description": "Pros: The food is on point and what you would expect from an average cafe. Nothing great but not bad.\n\nCons: The employees will make you feel uncomfortable and unwelcome.\n\nBottom line: Last resort. Need to grab the 38 bus in time to make it to work? Order TO GO. Otherwise, go to Cup & Cake Cafe 4 blocks away.\n\nMy main complaint is with the service. The employees have always come off if it's that time of the month.  Several times they have been lazy in seeing I am ready to order, haven't been happy to have to pause their conversation with their boyfriends and always show zero emotion for your business.\n\nAlso, do not come in any later than 30 minutes of closing because on multiple occasions I have witnessed customers been given excuses for not having time to make sandwiches.\n\nOn a side note do not buy their cookies. The 2x I have tried them they were both very stale. I wouldn't of minded as much if the employees both hadn't given me a weird look of doubt as I ordered them but still sold them to me.\n\nGiven their site states, \"All stores are individually owned and may have different offerings,\" I will give the benefit of the doubt on other locations.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-07", "description": "can not believe I just received a message from the owner about my review saying \n\"Joseph L. Owner, ok dont come again we dint need your buisness\"\n\nCustomer service doesn't get any worse than this!\n\nMy reviews are not meant to bash a business but rather to give them something to improve on as well as to inform future customers what kind of business it is whether it is bad or good. \n\nThis message just took me back and I feel that others should have the right to know what kind of business this is.", "author": "Cescilia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "I decided to walk on over here before watching a flick at the Bridge Theater.  I was kind of hungry but didn't want to eat or spend too much since I was going out to dinner later.  I ended up with a Jojo's Special (house coffee with chocolate and milk), Asiago Pasta Salad, and bbq Kettle Chips.  These three items cost me $8 exactly.\n\nI was really surprised at how good everything was.  Coffee was a large cup and cost about $2.75.  That's pretty amazing.  Coffee had great flavor to it too.  The Asiago Pasta Salad surprised me the most because it was fresh and tasted quite gourmet.  My boyfriend claimed to be full but once he took a bite, he couldn't stop.  \n\nI originally wanted a bagel but they ran out.  Guess they're quite popular!  The lady helping me was very friendly and didn't rush me at all while I was thinking through things and asking questions.  On foot, I didn't see many other cafes and restaurants in the area so I would definitely come here again if I'm in the area.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-09", "description": "A great little place to grab some good coffee while waiting for Big O Tires to get their act together long enough to change your oil...\n\nPlus, the barista working had a cute little (Russian?) accent and seemed nice enough.  She was the only one working and didn't make me feel uncomfortable or unwelcome in the least... (Matt C, maybe I caught her on a good day?) Oh, and the breakfast bites looked pretty tasty if you're looking for something to snack on.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "A huge menu, nice people, good food, they also have a TV and the overall look of it is a down to earth coffee lounge. 3 stars for parking an that they let a crazy homeless woman in with her dog....", "author": "Cecily B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "Yay! I'm a fan (hehe). They make a mean ultimate breakfast bagel and it's very tasty and filling. Add a cup of green tea and you still get change from your ten dollar bill.\n\nThey don't hassle you to leave instantly or force you to pay for wifi. The wifi is free and fast. I actually visit this cafe when I drop my car off for service at big-o tires, so I end up working there for 1-2.5 hours and they are really cool.\n\nVery quiet most of the time, although a group can be chatty at any time. Most people seems to be there solo to eat and get a little work done or catch up on the latest international foreign affairs and world reports.  The TV is usually tuned to the news or a sports events, but not too loud.\n\nEnough seating in the mornings and they even have a comfy couch for sitting or lying down in the back room (no, not a seedy back lounge, just extra seats). Lots of windows everywhere to let in light - even though it's probably foggy in the richmond (I have sun blasting through the fog into my eyes at this moment though).\n\nThe only down side that I have noticed is one of the staff will walk out and chain smoke near the back door and the smoke can get into the shop. I noticed it a lot the last few times I was here and sitting in the front area, but not this time while I was in the back room. maybe that person has stopped, maybe that person was not working today, maybe I didn't notice from the back room.\n\nSince it's on the corner with lots of windows, there is 'some' people watching. Decent amount of walking traffic in the mornings. No this is not chestnut, castro, or market street, but there is just enough activity to keep you from getting totally bored (I mean focused on your work).", "author": "Ashleyanne T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-29", "description": "I ordered the NY pastrami and cheese sandwich on whole wheat bread, with a whole avocado, and it tasted really good! Despite the fact the woman who made my sandwich was a bit empty (like, \"Hi, how are you?\" would have been cool) the food was good regardless. There wasn't too many places to sit (maybe 6 one person tables) but I was able to find a spot. The price isn't bad, either.  I guess they have great breakfast here; I'd love to come back and try that to see for myself.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "Great back working space with wifi. Nice place, staff does not bother you, and the drinks are good. Nice place for the neighborhood.", "author": "Brent T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-19", "description": "I've been here 4 or 5 times. The service is always really cold, not rude, but not inviting at all. All the girls that work there are russian...or something like that. I'm not saying that's why they're cold, but it kind of fits the stereotype.\nThey get 3 stars only because of their sandwiches. If the sandwiches sucked they'd get 2 stars.\nPaid WIFI?? YOU WISH.\nGet a sandwich here and then go to Nani's up the street. Don't get the Mortadella Italian sandwich unless you know for sure  you like Mortadella. I didn't know what it was and assumed is was some awesome Italian cold cut, but its basically bologna, and nasty as hell. I choked down a whole big ass sandwich of it just now cuz I was hungry as fuck and I just about vomited.", "author": "Hank H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "PESTO-FETA BAGEL.\nThat's all I want to say:)\nQuite little place, 5 Stars!", "author": "Carlo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-09", "description": "I've had better Chai; service was not too friendly.  The pastries don't look very fresh.  \n\nThe exterior is under construction right now; but the coffee shop is open.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-26", "description": "I love finding out of the way places - a Royal Ground with a very intimate and quaint atmosphere on Geary.  Love the salads and sandwiches.  I would give higher marks but I think the people behind the counter need some lessons in customer service. Nothing is more annoying than someone who is working and talking on the phone!!!??? That is a no-no. Socializing with the customers to encourage loyalty is one thing - but just  gabbing behind the counter and ignoring a paying customer - someone needs to give them a clue.  I would give higher marks for better service!", "author": "Dee Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "As I live right across the street from here, it has become a staple in lunch study breaks.  Upon entry, the location provides a warmth that many of the larger chains have lost.  Whereas places like Starbucks feel like a hospital ward, Royal Grounds greets you with dark stained wood everywhere, with little antique coffeepots and grinders adorning their walls.  It has the feel of a local joint, and I was surprised to learn that it was in fact a chain that proliferates the city. There is a big bench lining the wall that is maybe 2 inches too tall to be completely comfortable, and could do with some padding.\n\nThe initial thought I had was that they must do their own roasting, because the smell of roast (read: burnt) is quite thick in the air.  \n\nThe entire place is staffed with Russian Batistas, and they carry the stereotype well.  Since I have become somewhat of a regular, they smile now, but it took melt the ice.  Regardless of their stony interaction, their service has been impeccable, and I've never felt like they ignored me.  My major complaint is that frequently they will take the order (especially for sandwiches) and start making them before the customer pays, leaving the customer standing there for a good while when they could go have a seat.  \n\nI've only had the house coffee, which is passable by any means.  I'm not a coffee snob and haven't been spoiled by Blue Bottle or the like, so it does the trick for me.\n\nThe reason I keep coming back is for the sandwiches.  They aren't by any means legendary, like Arguello Market's Turkey breast, but they are pretty healthy portions, and they are using Boar's Head meats, which I find to be a higher caliber than most.  For a deli sandwich to be good, the bread must be excellent, and here the Sourdough is top notch.  \n\nRoyal Grounds always has a some special (that I always get) that includes the sandwich and a can of soda, which seems to sweeten the deal.  \n\nCoffee or not, the Deli is what keeps getting me back here.", "author": "Richard Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-10", "description": "GREAT menu: Sandwiches, (HUGE) salads, cookies/muffins, fresh smoothies, hot and cold drinks\n\nWifi\n\nSuper friendly and fast service\n\nVery reasonable prices\n\nPerfect for a lunch break or a snack-- definitely refreshing!", "author": "Jen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "This place is a great deli, and I recommend the pepper turkey sandwich. It is much more chill than other nearby coffee shops. The only complaints I have are that they frequently run out of things. For example, all they had today were blueberry bagels... no plain. Also, they aren't the friendliest, but I prefer when they just leave you alone. I think they warm up to you once you become a regular. I like that they make the sandwiches extremely fast.... like faster than McDonalds serves you food. Arguello Market takes absolutely forever and frustrates me too much. I have an entire room to myself sitting on a nice couch with a view of Geary Blvd. It is a nice and relaxing atmosphere. It is also very hot inside, which I like. You can also get free parking at USF. I will be returning and like this place a lot more than Velo Rouge Cafe. The ridiculous amount of flies are really irritating.", "author": "Steve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-24", "description": "Boars Head Sandwiches - BOOM!!!!!  What else does a true thug need??  Maybe a nice Depth Charge to step my game up, BANG!!!!  They gots that too...\n\nRoyal Ground gets my Double Shot Salute - BOOM BANG WITH MY GLOCK 9 MM...  Thug Approved ina di Inner Richmond Hood!!!  Raspect!!!!", "author": "Ubique K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-03", "description": "I felt I should leave a tip since my roommate and I were studying for a bit, so I dropped my change in the jar even after my smiles were not returned when ordering my bagel and tea. As soon as my money hit the bottom of the jar, the clerk sure was friendly though.  Maybe it was just one of those days? No one was completely rude, so I won't write this place off. Just a heads up...no capers for Lox bagels :(", "author": "Jessyca M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-04", "description": "The first rule of coffee shop is: don't f*ck with the caffeine. \n\nIt's very simple: if an iced drink is a double, this should be written somewhere, or tell the customer, or, or, or SOMETHING. But please!! Do NOT give the poor unsuspecting a double shot when it's not expected!  \n\nEither way, though, I think their coffee is vile. \n\nI've had regular hot lattes, iced lattes, decaf lattes, and drip coffee, and it's all way too strong (and kinda burnt-tasting) for me, no matter how much milk I put in.\n\nThe prices of the iced drinks aren't listed anywhere, either, and are actually $1.25 more expensive. This is another fail, folks.\n\nAnd the owner (at least I think he's the owner) is, for the most part, RUDE. I never feel welcome in here, ever. Triple fail.\n\nTwo stars because the sandwiches are good.", "author": "Dina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-12", "description": "Royal Ground Coffee is a quaint neighborhood place on Geary with all sorts of coffee drinks, and a great selection of sandwiches and fresh pasta salads as well.  They have a number of small tables set up in their cozy shop, making it a nice place for sitting and enjoying a coffee, or taking something out with you.\n\nIn general, I've had good luck here, although I've found the service to be a bit disorganized at times, especially if there's a number of people being served during a busy Saturday at lunchtime.  However, the staff is pretty friendly and the prices are totally reasonable.  Having this place in the neighborhood is a nice alternative to the Starbucks a few blocks away.", "author": "Tim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "Nothing fancy, but a nice little neighborhood coffee shop.  The sandwiches were ok, but not the best around by any means.  The pastries looked delicious.  I had a cafe borgia and it was very good (very sweet though, almost like a dessert).", "author": "Chad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-02", "description": "I have still been going to this place since my last review as I live very close.  They have definitely improved their customer service.  Their sandwiches are still great and their coffee is still good. I will continue to go.", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-02", "description": "Boars Head sandwiches!! \nGrab your sandwich and sit in the Coffee shop or one of the more private rooms. This place is unique in that it looks like a converted apartment.", "author": "Janell D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "One of the best corned beef sandwiches you can get.  Nothing fancy, quality meat on some nice crusty bread, some lettuce, tomatoes, pickles and onions.  But that's the magic.  Keeping it simple and letting the food do all the work.  It's magic.", "author": "Bixby D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-17", "description": "Saturday morning. Early, like 7am. I'm on my way to a bicycle race and am on schedule. I'm in good spirits.\n\nI bound in and greet the gal at the counter. Let's call her SB for purposes I'll reveal later.\n\n* Me: Hi! I'd like a small cup of coffee!\n* SB: The smallest size?\n\n* Me (glancing quickly at a row of cup sizes to my right; I see two red stacks): Sure!\n* SB pours a cup of coffee into a tiny white cup.\n\n* Me: Oh! I'm sorry, I think I wanted the next size up, that cup sure is small.\n* SB: That's why I asked you. And You. Didn't. Even. Look.\n\n* Me, instantly dumbfounded and feeling ashamed. \n* SB transfers the coffee from the tiny white cup to a slightly larger red cup-- the one I thought I had eye balled.\n\nI give my money to SB and walk out to my car with my cup of coffee in hand, slowly realizing what just happened. Embarrassment turns to low-key anger. I put my coffee in the cup holder of my car and walk back in.\n\n* Me: Hi. I live literally around the corner. \n* SB (key snarky voice): Uh, excuse me?\n* Me: I literally live around the corner, so I have the potential to become a regular customer. You should consider that before scolding your customers for a simple mistake.\n* SB: I gave you your coffee didn't I?\n* Me: Yeah, but not without giving me a hard time.\n* SB: Shut up! Get out of my face! (We're talking instant firebomb here, folks)\n* Me: Just remember, I have the potential to help pay your salary.\n* SB: Don't talk to me any more, shut up!\n\nI walk out feeling a whole lot better about calling ridiculously self righteous and poor service for what it is and knowing where I WON'T be buying my coffee anymore... not to mentioned unbelievably fired up for my bike race and happy that I no longer need to contribute to the salary of SB. There's a kazillion coffee places in my neighborhood... the coffee isn't good enough here to ever risk dealing with SB again. Boycott in full effect.\n\nOh, and if you haven't guessed already, SB = Stupid Biz-natch.", "author": "Meredith O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-11", "description": "The setting is nice, but the actual offerings are sub-par. The coffee is only decent and the bagels are completely lacking any art. I got a slab of cream cheese on an old bagel.  \n\nThis bagel/coffee solution lacks luster, so much so that I'd rather ride the bus for 40 minutes decaffeinated. Not going back.", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-19", "description": "On days that we have time to spend together, my roommate (whom I just realized I mention uncomfortably often) and I ride our bikes down here and do homework. The couches are comfy, but the table is awkwardly too low for computer access because, obviously, it was not put there for this purpose. I guess people on the couches are actually supposed to relate to one another. Hm. A foreign concept. \n\nThis is really not intended to be mean, but one of the girls there speaks no English. I totally support English as a Second Language, but she didn't understand what we were ordering (a medium coffee with soy milk, and an Earl Grey). I felt bad being frustrated, but I was.\n\nThat doesn't merit the removal of a star, though. I'll try her again. Could have been a rough day.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-23", "description": "This place is cute and it's right across the street from my boyfriend's place, so we stop by a lot.  The service is always good, they have some small tables inside, and they put a whole big slab of quality cream cheese on your bagel.  Mmmmm.\n\nThey have lots of drink selections including fresh squeezed orange juice and great hot chocolate!  If you know my reviews, you know that hot chocolate quality is the most important factor while I am awarding stars.\n\nMinus one star because the girl who works there always flirts with my boyfriend.\n\nThat's right, you hussy - don't think I don't notice.", "author": "Laura W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-02", "description": "Popped over here quickly this morning as I was getting a battery replaced at Big O Tires across the street.  They were sweet enough to give me a coupon for a free tea or coffee.  \n\nWalked in and it was pretty quiet which is surprisingly nice on a Sunday morning.  Classical music playing which was very soothing.  Had an English Breakfast tea and bought some banana bread as I felt slightly guilty for going in for free - small piece of banana bread was $2.25 - a bit pricey in my opinion but as I don't normally get that kind of stuff, maybe it's on par with other coffee houses.\n\nSat down and proceeded to read SF Weekly - tea was good although just Celestial Seasons.   Banana bread was a bit dry but still edible.  They had a decent selection of sandwiches and bagels though, which looked good.\n\nAll in all, it's a peaceful place to go have a cup of coffee or tea, but nothing to run to.  And as it's not exactly close, I probably wont be back -but if you're in the neighborhood it's a nice place to get something.", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-22", "description": "My mission is to find and review new places where I can work on my laptop online and get good coffee / beer. \n\nPlenty of sockets on the walls. Good coffee, awesome staff behind the counter, nice seats. I can't complain, although the ventilation is a bit lacking and the window walls let the heat through.\n\nFree WiFi too. It's a bit crowded and slightly noisy so bring your headphones.", "author": "Jae K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-02", "description": "Royal Ground is around the corner from my old apartment in SF, and it used to be my most trustworthy morning spot for a quick Americano and a bagel.  The breakfast choices are limited, and they have a large selection of pre-made deli-like food items behind the counter, but I never actually tried any of them because one of the items were meatballs, which always kind of freaked me out...I'm still not sure why but I think it's because I was never quite sure if they were fresh or not.\n\nAnyway, the boy and I used to go there and sit in the back room, where there's a chess table, big windows, and couches.  I also like the atmosphere in the front room where it's always fun to sit in the window seats and people watch on Geary.", "author": "Stefanie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "I moved into this area with no idea as to where a good coffee shop would be and hence where I would spend most of my Sunday mornings. This place caught my eye when I walked past one day and it has since become a regular spot for me.\n\nThe atmosphere definitely provides something that Starbucks or Peets painfully lack. There are wood floors and benches, an aroma that only sinks in after a few good years of spilt coffee, and a laid-back clientele of USF students and young families. It's a great place to spend an hour relaxing or catching up on e-mail.\n\nThe food is standard San Francisco deli or bakery options, but you can get a good sandwich or bagel, for sure. The coffee is totally decent - nothing fancy but it gets the job done.\n\nFor all its virtues, the place does have its drawbacks. The staff is pretty cold, but if you show your face a few times they realize you're not so bad and might smile. Also, the only music they every play is classical, which is all well and good, but a little variety and more \"coffee house style\" music would be nice.\n\nOverall, I'm happy with this as my go-to neighborhood place, but jeez, cheer up guys!", "author": "Conor D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Ducked into this Royal Grounds yesterday, just after dark. \n\nI didn't realize they have free wi-fi; that's a good thing.\n\nThe location is great, and I like the pint size feel of the place. It provides the sensation of it being urban, almost edgy. \n\nThe barristsa, was spunky and a little in your face. That was cool.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-01", "description": "this is a very small place with a few tables and wifi. they sell a sandwiches, bagel, smoothies, cafe, cookies, snacks, these items take up half the space in this cafe.  i didn''t care for the house blend coffee. too bitter.\n\nentree: large coffee (1.75)\n\nrating: coffee 2 stars+ 1 star ambience= 3 stars", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "This place is a good standard cafe.  Almost everything is right about this place, so I'll list it.\n\n-Classical music playing in the background\n-Good coffee\n-I really like the staff here, too.  That is, I don't feel anonymous when I come here, and everyone working here seems sincere.  \n\nBasically this place is nice and quiet and tranquil - a good place for reading, or studying or what have you.  \n\nI would give it five stars except for the huge television screen playing ads that they recently installed.  Try as I might, I find it hard to resist.\n\nUpdate: This morning I went there and a television was on, so I decided to go somewhere else.  I've had a lot of good times there, though, so I'm willing to forgive.  Please get rid of the tv sets - bring back the classical!!!", "author": "Mark W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "Delicious Salad, nice place to hang out, best Chai Tea Latte I ever had :)", "author": "Tim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "Great place. The workers are very nice and pleasant. I come here 2-3 times a day  during the work week. Love the cracked pepper turkey sandwich. Bravo!", "author": "Yuriy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-05", "description": "This was my first coffee stop/shop in the city.  I was very happy visiting it everyday.  Simply good coffee drinks, including a great drip.  The overall setting was very coffee shop, but not over-the-top, a la Freinds style.  Window seats are pretty neat for watching Geary St. whiz by.  Tables outside are not too desirable, but can get warm w/ a few hours of direct sun.\n\nI love the pastries.  The selection is not great, but man are they tasty.  Apple Danish was orgasmic on certain days.  I would wig out at work when I ate it.  Like an interpretive eating scheme to breakfast pastries.  Yum.", "author": "Kevin Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-15", "description": "i used to live right around the corner from this little joint and i'd make the stop here on the daily before class.\n\ni love their coffee, it isn't too sweet like starbucks. i'd kill for one of their lox bagels because i can't find any other lox bagel around the bay like the ones they make here. whenever i'm in the area and i pass this shop, my mouth starts drooling just thinking of the lox bagel. \n\nits a quiet little coffee shop, great to study and do work or read. the workers are so nice and always make conversation if its not too busy.", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-04", "description": "We stopped here on 8/3/11 at about 11:45 for a quick lunch and coffee.  Basically, I didn't have a problem with the food or coffee, but the lady that was running the place had about the least exciting personality ever.  No greeting, no smile, not even a hint that she enjoyed living on this planet.  Maybe she was having a bad day, but she just seemed to be the type of lady that doesn't have the manners to actually be nice to other humans.  Maybe she just needed coffee.", "author": "Coopdawg C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-08", "description": "Small, cozy, cute, mellow music, free wifi and power outlets (on one side of the cafe). The staff is nice and I liked my experience here. There are only about 9 (2 top) tables, so it is pretty small, and if you dont have a computer, they have a couple of pay as you use pc's.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-11", "description": "This place honestly makes some of the best sammiches that I've had in awhile and If I still owned a business in the area I'd make it a point to go out of my way to stop by and get what I need. The fresh pastries are to die for and if you get them the next day they are in the dollar bin of tasty things that need a good home in your stomach.", "author": "Muhammad R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-08", "description": "Best soy chai tea latte I have ever had!  I love walking here on a lazy Sunday and getting my hot drink fix =)", "author": "Jen Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-30", "description": "Service was fast and efficient, plenty of vegan cookies from Kerrie's Kreations.  All hard seating, not much atmosphere, good for a stopover before seeing a movie at the Landmark Bridge Theater across the street.", "author": "Bob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "mango smoothie $3.50....damn, that was one expensive ass smoothie. but it was really good.\n\nbtw, their sandwiches are just okay.", "author": "B B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "Great avacado sub and excellent coffee. Their iced coffee is probably the best in the neighborhood. Unfortunately, their hours are listed incorrectly.\nNOT OPEN at 7:30am on Sunday, they were definitely closed at that time. Someone please update their hours (or open your darn business on time).", "author": "Bob B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "This is a quaint cafe with great coffee and sandwiches. This particular Royal Ground usually isn't as busy as some of their other locations and there are some nice window seats in the front. There is also a back room which looks secretive and private. On a sunny day, the outside tables are a good option since they never seem to get the cold wind that Geary Street is subject to. Also, this cafe is right across the street from the Bridge movie theater--a good place to go afterwards and chat about the film!", "author": "A Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "Royal Ground Coffee has fast become one of my favorite lunch spots around my office.  I'll come in for breakfast--usually a bagel with cream cheese and a chai tea (very delicious and sweet).  They offer a plethora of different sandwiches from homemade chicken salad to prosciutto to more standards such as  ham, turkey and roast beef.  The ingredients are always fresh and nicely cut...I'm hardly ever having to readjust lettuce or tomatoes.  The service is excellent--fast and efficient.  The owner, Joe is great and their regular server (Asian girl) is too.  I used to go to Royal Ground Coffee out of convenience, but once I found out that the food is good and consistent, again, it has fast become a staple in my work week lunching.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "pros:\n- best turkey sandwich in sf \nlettuce, mayo, pickles, dutch crunch.\n- thirst quenching black cofee\n\ncons:\n-saw some flies trapped in the cookie jar area before.\n- not the cleanest place in the city..", "author": "Bobby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I go to Royal Ground almost every other day for coffee and a sandwich. I highly recommend the Turkey Bacon Club w/ Avocado, finding a window seat and enjoying the warm atmosphere and dedicated staff. I'm confused by all the reviewers that seem to have gotten their feelings hurt by the supposedly \"unfriendly\" staff. I think patrons are becoming too accustomed to the overly cheery 'hellos' and fake smiles from the Starbucks employees. Or maybe some prefer the ultra cool, hipster-lite crowd working behind the counters at Peet's. It's a mystery to me. Royal Ground has very friendly workers that I've had several genuine conversations with. I hope a few hyper-sensitive reviewers that had a bad day and decided to take it out on these staff members doesn't deter anyone from checking out this great spot.", "author": "Tobias G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-01", "description": "I live across the street and work from home, so I go to Royal Ground every day for food and coffee. This is partially a matter of convenience, but also because, for the bit of every work day when I have actual human contact, I want it to be with people I like. Every time I go inside, I get treated like a real person, whether it's a short conversation when no other customers are waiting or simple speed on the order when there's a rush. Often, they even pour my coffee before I've ordered anything. They value my business, but more than that, they're genuinely personable, not some people who were trained on how to act towards customers at a day-long training seminar.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "Love it here - the warm, darker décor is inviting and the extensive coffee grinder collection is fun to see.  Welcoming service and good coffee... the Russian young lady behind the counter is friendly and the owner is the nicest guy.  Glad I found this place!", "author": "M M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "I did not have the best experience here. My order was mistaken, the internet isn't free, and there are few outlets. The service was somewhat unfriendly. I will avoid this location in the future.", "author": "Mel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "this used to be my neighborhood coffee house so it will always have a place in my heart. the white mochas are aammaazing!! and i usually don't like super sweet coffee. the meatball subs are delectable! however their bagels kinda suck...small, hard, and not many choices/they used to run out all the time. we used to get them anyway because it was so damned convenient. but yeah other than the bagels everything here is awesome!", "author": "N. M."}
