{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "Very nice coffeehouse near my hotel.  High quality coffee and sandwiches even breakfast items.  Great location, very clean, good customer service, and busy at times.  Just a little bland kinda customer service for a coffee joint but it's Sf so it can be expected.\n\nDefinitely be back for the coffee, just very high quality, not the highest but great.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "Great corner store coffee shop with plants galore! It's everything you'd imagine a hipster coffee shop to be, avocado toast and all. \n\nI came here on a Saturday and while most tables were full, it wasn't packed at full capacity. This place can be a little tricky to navigate once inside because since it's a corner shop at an angle, you find yourself dodging patrons and tables.\n\nI ordered the avo toast about $4 plus $2 extra for the poached egg addition and a regular chai ($4). With tip my breakfast came out to about $14. SF is pricey even for a slice of bread with earth on it :)\n\nThe avo toast was a Pinterest dream with slices of avocado, salt, pepper, and an egg. The chai was light and airy although I preferred my chai a little stronger to be honest. I'll have to return again to try the rest of the expresso offerings to be a solid review but for now my love of plants and people watching way this is a solid coffee shop. I would come hither again!", "author": "Connie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Favorite coffee shop ! \nDelicious Shakshuka, beautiful avocado toast, breakfast sandwiches are super tasty . \nFood arrives fast, clean, fresh.\nKnowing the taste of Réveille's coffee, I can't have coffee somewhere else. \nStaff is always friendly, welcoming, interesting to talk with. The ambience is great.", "author": "Karina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "Matcha latte: I liked it how they didn't skimp on the matcha and the latte wasn't overloaded with sugar. However, there was quite a bit of matcha residue at the bottom of the cup. I found the drink to be quite comforting until I had to spit out a green tea stem from my mouth.", "author": "I L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Absolutely love the vibe and location here. I was staying just a couple blocks away for the weekend and a friend walked us here for our (very necessary) morning coffee. Over the course of the weekend I had a regular coffee, an americano, and a matcha latte here, each of which I really enjoyed. The shop itself is pretty small but really pretty. Everything from the fresh flowers to the branded cups to the light fixtures made me happy here.  \n\nThe only issue I had here is that I liked it so much, I came back the next morning on my way to run an errand. I showed up right at 8 am, which is when they open on Sundays, and the two younger baristas inside seemed annoyed that they had to unlock the door for me. They were also blasting John Mayer and none of the chairs were set up yet, so maybe they got in late or something. Anywho, not a huge deal and I'd definitely be back next time I'm in the neighborhood.", "author": "Megan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "My favorite neighborhood coffee joint in North Beach. Gorgeous interior (very modern, light, and lots of succulents). Their matcha latte is great and the avocado toast is delicious. So is the breakfast sandwich. Slightly on the pricey side, but very comparable to other places nearby.", "author": "Lillian W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "Great wifi, great drinks, and awesome service. My biggest gripe is they play their music way too loud that it defeats the purpose of me coming here to do any work. \n\nIt's difficult for me to take calls or meetings when I am working remotely because the music is way too loud.\n\nOtherwise, I love the food and coffee here.", "author": "Alicia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-17", "description": "I really enjoy this space as a nice place to catch up with a friend, have a coffee on the way to work, or take a long lunch break outside on the patio. In my opinion, the space/ambiance here is better than the food and coffee.\n\nI used to work around the corner from this location, so I've been a consistent and frequent visitor. I enjoy a good iced coffee, particularly on those Sept/Oct Indian summer days, but whenever I get one here I am always a little disappointed. It usually tastes overly acidic, like it's been brewed too long. It's not horrible (and don't get me wrong, I drink it every time), but when the price approaches $5 for a coffee, you expect a bit more. \n\nThe food here is also OK. Most are small plates, avocado toast, granola, etc., that you could easily make at home yourself, and thus feel overpriced. All in all, if you stick to the hot espresso or tea drinks and pastries, you will not be disappointed - and definitely linger to enjoy the space!", "author": "Kathryn P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-27", "description": "Réveille Coffee Co. \n\nWhat an awesome location on a corner and near Little Italy of San Francisco. \n\nFirst off, I highly recommend walking the streets of Little Italy and Chinatown. There are so many restaurants, shops, markets (with loads of fresh fruits and veggies). We took a free (name your own price) walking tour through the area and it was worth it (read my other review about it). \n\nAnyways, as I was saying. This coffee shop is located on the corner of a street and you can't miss it. The sun shines in the shop making it warm and bright. The menu is simple and I asked if the chai syrup was vegan and it was so I ordered a dirty chai with non cow milk in it. Making it vegan of course! \n\nThe baristas were very nice and made the drinks face. My significant other ordered a macchiato and it had beautiful latte art. \n\nThere's a restroom in the back and complimentary water station too! \n\nBack to the dirty chai, it was good, a little too foamy for my liking and I would have preferred a little more of a cinnamon taste to it. But I would come back again. \n\nAs always, \nGo vegan (or at least try)", "author": "Peyton C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-14", "description": "Ordered a regular cup of java. No specials.  My daughter brought me here because it's her regular coffee hangout.\n\nIt is located at the corner of Columbus and Kearny.  Prime location since it's surrounded by North Beach, Chinatown, Telegraph Hill, and The Financial District.\n\nThere is ample indoor and outdoor seating.  Very ....... chic.\nCoffee was good.  The coffee is strong enough to come through the added cream & honey, but not so strong like an expresso.\n\nI give an A-OK 3-Star because I've had different, not better, just different coffee.  Pricing is comparable at $3.25, but I'll take my Starbucks every time.\n\nWill I come back. Yes, but I will not go out of my way to return.", "author": "Randy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Bored at work, at home or in school? Grab your laptop and spend your day here! Make yourself comfortable either inside where the modern interior and unique architecture fulfills the cafe with daylight or outside where you can charge some vitamin D while getting your work done.\n\nIn case you'll get thirsty for strong and good coffee or hungry for a healthy lunch - no worries, they got you covered! Wi-Fi is available.\n\nSo what are you waiting for? Go and check it out!", "author": "Stefani K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-29", "description": "I've only tried the green tea latte here but it is pretty good. The flavor is on point and not overly sweet like the ones at Starbucks. You can taste the richness of the matcha, blended in with the creaminess of the milk.\n\nThe cafe itself is quite nice and relaxing, being right in the North Beach area. It is clean, and there is seating along the counters and in the back.", "author": "Tyler T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "New office space, new places to explore.\n\nReveille was the first coffee place on my list. Quite a number of coffee places on edges of streets; And this is one.\n\nI was drawn in by the hibiscus peppermint tea. A combination that doesn't sound like it works, but it does. It is so refreshing. If you have a sore throat, this is the perfect drink. Besides this terrific tea, they also have coffee drinks and snacks/lunches (sammies, salads, cookies, pastries).\n\nFor China Town area, this place is decently hipster. A good amount of stool seating.\n\nThe first guy who helped us at the counter was super nice. I mentioned the tea and he offered us a sample. My reaction was enough to convince my coworker to also get the tea. Yeah, it was good. Then my coworker asked another guy where to put his empty plate and the guy said \"The area in the back over there would be nice.\" Is that a bit of snark I suspect, sir? (it's all in the tone). Anyway, I thought it was funny. \n\nI love places with amazing tea, and I can't hide it. Returning for the tea. 100% rate of return (ROR).", "author": "Libby J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-15", "description": "A Réveille matcha latte a day would make me a very happy lady. I'd also be set back $2,317 a year. But what's adulting without budgeting for the important things in life?\n\nThis is a well-lit, hipster-chic space. Friendly, non-snooty baristas who make a mean latte. If you're lucky enough to snag a seat, it's a great place to work (if you're ok with music), catch up with friends, or a quick-midday coffee break.\n\nWarning: While there are 2 bathroom stalls in the back, the wait time can get lengthy. Plan bathroom breaks accordingly.", "author": "Deanna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "I love their beans! I have been looking for a nice rich espresso grind for a while and other coffee shops in the area have disappointed so far. \n\nIf you have a stovetop espresso machine like I do, the paradise espresso beans are great!", "author": "Hanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "If you look up the definition of \"hidden gem\" in the dictionary, there's a picture of Réveille in all its oval-shaped glory. Who would imagine that, sandwiched between a bunch of strip clubs and sex shops, there exists a coffee shop and breakfast spot so magnificent it practically defies description? Yet there it is, complete with delightful outdoor seating on a block that's chock-full of terrific people watching.\n\nWhat makes it so great? Let me count the ways:\n\n1) Réveille translates literally as \"wake up,\" and there is no better description for what will happen to your senses after a few sips of their coffee. I consume caffeine the way most people breath air, and one Americano from this joint lasted me half the day.\n\n2) I also ordered their veggie frittata, a side of three additional eggs and an arugula salad. The frittata was fairly flavorless, hence the missing star on this review, but the salad (served tossed with a delightful lemon dressing) and eggs (obviously cooked in real butter) were terrific. \n\n3) Without question, the restaurant's Pièce De Résistance is its almond butter and jam toast. Seriously. Order this even if you aren't hungry. It's incomparable.\n\nI picked Réveille on a whim after initially trying the coffee shop next door, which was inexplicably closed. Once I was done with my meal, I considered that twist of fate to be serendipitous rather than disappointing, and will gladly return to this place any time I'm in the bay area.", "author": "Charles G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "What a beautiful cafe! I love the natural feel of this place especially when just right outside it feels like a hustle and bustle all the time. \n\nI got the matcha latte and it was delicious. It tastes like good quality whole milk with matcha powder. The latte art was also beautiful :) \n\nI would probably come back to try some other items on the menu. I can't wait to come back and just relax here!", "author": "Joyce S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-17", "description": "Oh Reville, my dog, my around the corner cafe! I hate to do it to you, but I can't let our long term relationship determine this candid review. Never. Ever.\n\nYou're slipping. You served me a stale almond croissant today.\n\n I know fresh, and I know stale when biting into one and this was most definitely the later. So I asked to get get something else, a fruit cheese Danish. Yeah that looked great. Again....stale.\n\nThe person who helped me said they had a vendor that supplies baked goods to them. It really does not matter to me, the end consumer, who's to blame. The fact is this place is serving stale crap. And it's not cheap crap. It's expensive, stale baked crap.\n\nNo excuses, just hoping they please fix. Not sure how long until I get confidence back in this place, but for now I will be going across street to The Station Cafe as I have never gotten served old food there. Why risk it again when another option is so close. Sorry, but not sorry.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Chai!\n\nSo I tried there chai last weekend and it was delightful. It didn't give the spice down my throat that i personally prefer, but it also wasn't super sweet. \n\nthe joint itself was packed but had great lighting.\nthere is seating by the window. That prime location is perfect for people watching. \n\nThey do accept card (alot of places near here don't)\n\nthe price is average for what I am used to for Chai\nThe workers were decently friendly\nThey had coffee options that other people seemed to enjoy. \n\nIf you are walking from china town this is a good choice for you to stop at. \nThe interior is modern and chick. I saw a lot of people getting work done and enjoying there drinks. This seems like  plae you could spend hours.", "author": "Tabitha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "I've ordered a cup of java and a chocolate chip cookie. Not spacious, but the location and environment are great. Good access to Financial District, but not city side, you can meet up and chat with your friends or business people slow. Actually, this time I used this cafe to meet up with my old friend. We could enjoy talking there ;)", "author": "Shun Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Great atmosphere, delicious food, amazing coffee and excellent service! We had a lovely experience here!", "author": "Katelyn F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-15", "description": "I wasn't hip enough for good service here. AND It was $12 for 2 medium size bad specialty coffees.", "author": "Krista T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "The matcha latte was delicious! Their food items also smelled amazing! I'll have to try some next time.  I love that the shop has plenty of seating around with natural light from the big windows. If there's no avail seating inside, there are some seating outside. If all else fail, take your drink and walk around a bit. The location is within walking distance to Chinatown, Little Italy, or the Ferry Building, Embarcadero area ... all amazing places to venture with drink in hand!", "author": "Shong H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Yelp reviews brought me here and I am glad they did. \n\nThis coffee shop is is located in little Italy and it blends in with the beauty that is San Francisco. The large windows bring both natural light and the wonderful view of the city. There are counters along the windows and small tables people to study, chat, people watch, or just admire the view. \nThe drink menu is small but they do offer what you need along with soy and almond options for about 50 cents extra? I ordered the mocha (you can never go wrong with a mocha). It tasted different than the other ones I had in other coffee shops but thats probably because they roast their own beans at this place. The latte art was stellar. The drink was wonderful.\n\nI didn't get a chance to try their food menu but, they offer avocado toast, sandwiches, salads, and pastries. All of which looked appetizing so check them out. \n\nOverall, this is a wonderful place and I am glad I found it. If I am ever in this beautiful city again, this is the first place I would go to for coffee.", "author": "Yoandra V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "TL;DR hip coffee \n\nReveille serves a solid latte. They have a small menu, but they have the essentials. I got a latte, and everything about it was perfect, the espresso, the steamed milk, and the latte art! My friend got a matcha latte, and hers had a cute bear on top. \n\nThey have a circular layout and have a super modern feel w the large windows all around. Perfect place to get your Insta pic!", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "I tried Reveille Coffee in desperate need of a good caffeine kick last weekend, and had the best cappuccino I have ever had. I wish I could comment more about them but it was a quick in-and-out go. The staff was friendly and the place seems like a nice spot to relax with a book and grab a nice light breakfast or lunch. Can't wait to come back!", "author": "Doug P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Reveille has two locations in the city, and I picked this one solely due to it's good view (as well as a better decoration inside). I really loved the grand oval table and the better sunshine in the room. \n\nIt was not crowded at all during workday morning, so that I could sit down and enjoy some quiet moment. The coffee was nicely done too, loved the Reveille coffee bean.\n\nToo bad they do not carry skim milk, only 1%; but this is ok.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "On the corner of Columbus, this modern coffee shop fits right into its surroundings. I've been here several times in the early morning to work, and the table seating gives an excellent view to the cars, buses, and people in the morning.\n\nBeginning around 7:40AM, this place starts to get busy as people come in for their coffee. I haven't tried their food here yet, but it does look very appetizing. \n\nWhile the environment is perfect for work as there are two outlets on the walls (people don't really use them in the morning). However, the coffee here is definitely on the expensive side. My go-to drink at any coffee place is a latte. For $4.25, you can get one here. Add 75 cents for almondmilk. I was a bit shocked I paid $5.53 for an almondmilk latte. While I do like this environment, the price is a shocker. I suppose since its on the border of Chinatown and North Beach, that would result in the higher priced coffee. \n\nThe service here is great. At 7AM, the barista greets their customers with a warm, and welcoming smile. This place is 4 star worthy, but the price knocks off one star.", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "10/10 recommend their lattes. Very bold coffee without the bitterness and the location is decorated with plants & white tile making it a friendly and welcoming place. It's rather small so it's perfectly for cozy working or a coffee date with a friend.", "author": "Angella G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "This place has fallen flat on its face\n\nEmpty today. Really slow. Green Tea and Shakshuka. Took 42 minutes for the Shakshuka to show up - Cold.\n\nIt showed up cold 20 minutes after I followed up on the order.  When I followed up, They said there was some confusion. Confusion? - was a standard order.\n\nI want to support my neighborhood business, but with treatment like this.... it's hard to.\n\nStaff turnover is showing. This place was once awesome. Now... terrible. It's just sad it's this way.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Definitely one of the best matcha lattes in SF. The only other comparable place is CoffeeShop in South Mission/Bernal Heights.\n\nThe matcha latte here is consistently great, not too sweet, with strong matcha flavor. I take ppl here from out of town and always get a cup when I'm passing by.\n\nIt looks like there's wifi since some ppl settle in with computers. Also good outdoor park-like seating for when it's nice out, though it's kinda on the side of the street that doesn't get too much sun.", "author": "Jeanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Such a cute cafe. Love going here for lattes in the AM. Looks like a great place to meet up with friends or go to during work hours. So much room - lots of tables. Love the decorations / vibe.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "A solid Reveille outlet that makes good use of an otherwise irregular, triangular-shaped cornerfront venue. \n\nThe coffee bar is where the action is, and it takes up most of the \"bulk\" of the interior. That having been said, there's a modest amount of seating at counters and stools along the windows, and when it's nice out, there's even more seating inside.\n\nService is fast, efficient, and fairly friendly, and, of course, the coffee is quite good too. A great place to turn to for coffee in this area that's not a major-chain establishment.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Great coffee and an equally great ambiance! Came here on a Monday at around 8am and it wasn't too crowded. I got a mocha, and it wasn't too sweet, which I was kinda bummed about since I have a huge sweet tooth, but it wasn't anything too bad. I sat by the window, and the music in the background added to the great chill atmosphere. The service was quick and efficient, and I would definitely come back if I'm in the area!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "I first spotted Reveille on GMaps/Yelp when a friend and I were looking for a quick place to stop and recharge (ourselves and also our phones, heh) before dinner. It's a well-designed space that's in the middle of SF, with huge windows and tons of natural light.\n\nWhile my friend and I weren't in the mood for coffee, the drinks they had looked pretty good. We ended up getting the Ajna tea (with flavors of anise hyssop, tulsi, and lavender) and one of the bottled rose lemonades. We found some space up by the bar and settled in.\n\nAnise hyssop tastes and smells like anise, but are part of the mint family. Tulsi is better known as holy basil. The tea was super light and you could taste a little bit of licorice flavor, but the basil wasn't super strong. The lavender, however, was very prominent. It was a super light tea. The rose lemonade was, however, my favorite! It's carbonated too, so the rose, ginger, and lemon flavor was light and refreshing. I'm quite glad they stocked it.\n\nI'm looking forward to coming back here and being able to try the coffee and food (the kitchen was closed when we came). If you come here, take some time to soak in the atmosphere and the SF views outside the window. Try to come early though, so you can snag one of the rare outlets inside.\n\nAnd for those who need it:\nWi-Fi: paradise\nPassword: espresso", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Enjoyed my breakfast. Cool, friendly vibe. If you can, get a nice seat by the window for some people watching.", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "Such a cute little coffee shop in the middle of SF. The barista was friendly and helpful and my matcha latte ($4.75) was perfect for the chilly day.", "author": "Annie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Quick and tasty foods! I had chocolate croissant, sandwich and latte! I love the interior design and up beat energy in the cafe!", "author": "Tsendsuren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Stopped by for some coffee after lunch. I got the Matcha Latte and he got the regular Latte. I'm not picky about drinks and I often judge on the latte art, which was top notch at here.\n\nWe sat by the window (there's ample seating all along the bright windows). We chatted and people watched. I wish I had more time to sit and enjoy the afternoon.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Small coffee shop with great design and outside seating. Coffee was great and I also enjoyed the music playing in the background. Perfect for the work I was doing. Seating was tight inside, but they definitely maximized the space in this small shop. They had a lot of countertop space with shades for the windows to minimize lighting.\n\nRestroom is shared with other restaurants (wine bar) and was clean and easily accessible. Outdoor seating was spacious and I would have sat there (great day great weather) except i needed an outlet.", "author": "David Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-17", "description": "I just had the most awful breakfast sandwich. It was the sandwich named after the place. It had a fried egg, leeks and kale. Its taste and texture strongly suggested it had been made hours before and briefly (although ineffectively - all ingredients were lukewarm to cool) rewarmed. Admittedly, it was a quarter to 2pm when I ordered it and they serve breakfast until 2 on Sundays. But if you are incapable of serving something edible, I believe you should not serve it.\n\nThe bottom toast was soggy and the top toast was crusty and stale. The egg peeking out from the hole in the center of the top toast had formed a thick rubbery crust on the yolk. Maybe it would have been good a few hours earlier. I had two bites before deciding I could not eat it.\n\nAlso I'm suspicious of the plate this was served on because it was a round, flat slate with a cushioned bottom, so I know it can't go in the dishwasher and I doubt it can even be submerged in water.\n\nThe BF had ordered a shakshuka, which is the source of the only stars in this review, as it tasted good and the poached eggs in it seemed like they had recently been poached.", "author": "C J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-31", "description": "In terms of hipster coffee shops this place is pretty standard with its soothing indie rock and coffee options that don't really mean much to an amateur like me. \n\nWhile I can't really comment on the coffee beyond the fact that I can tell it's at least in par with other comparable shops (Philz, etc.), I can appreciate the ample amount of counter space and outdoor seating available. This is aided by the public parklet that is on the sidewalk by the shop. It seems that there are outlets inside for those wanting to do work, while outside is nice for people watching as it's quite a busy intersection. While I was here there were plenty of people having informal chats, doing work, and just passing the time.\n\nThe staff is also really friendly, which is always a plus at a coffee shop. I'll definitely be coming back in the future when I'm in the neighborhood.", "author": "Jenny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Clean coffee shop in North Beach. The service is friendly and inviting. And genuine. The cappuccino was beautifully created but I could taste the bitterness in the coffee bean which I didn't care for. Good place to study and pleasant aesthetic", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-08", "description": "Came here on a Sunday afternoon to get my coffee fix. The cashier was very friendly and welcoming. I ordered an iced mocha and an iced americano. The iced mocha tasted good, but would probably be better hot because they use real chocolate (which is awesome) so it doesn't melt well in ice (oops, my bad). The americano, on the other hand, did not taste good and had a strange sour taste to it. For the cost, I was disappointed in the quality.", "author": "Jamie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-17", "description": "I really like trying new coffee places and I always get lattes. I think the coffee here was good. Not super strong, but it was good. My husband got a vanilla latte. The syrup for that is just simple syrup with vanilla extract I believe. It wasn't too sweet, which was perfect. \n\nThe service was fine, the place was cute. Nicely lit by natural sunlight so this would be a good place for studying and working.", "author": "Susan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Hell. Yes. Get the iced mocha and a croissant! Presentation is beautiful, the vibe in here is nice, and the location is clean and pristine. Would definitely recommend. Also, the staff is so pleasant.", "author": "Cody J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Was totally fine, nothing special but nothing wrong. I never like when places charge extra for soy or almond milks. Most people seemed to be working on their laptops and seating wasn't the easiest.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "I used to love coming here. Latest crop of baristas haven't been great unfortunately. Espresso shots have been really weak and served in paper even when there's plenty of ceramic. I get that they maybe don't want to do dishes but it's pretty unusual in SF to get espresso in paper. Hope they can up their game so I can remove this bad review.", "author": "Nathan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-06", "description": "Lukewarm sour tasting macchiato from a haughty barista. Cool location and store - perhaps to cool to give good taste and service.", "author": "S L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Your Americano had me at first sip.  I have to spread the news that your coffee is the best I have tasted so far in fog town!  Also, it's near both North Beach and Chinatown. I could do my shopping and enjoy excellent coffee.", "author": "Wing W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Visited this cafe during my visit to SF and purchased a bag of coffee bean. That is by bar the best coffee bean I've had. I'm a coffee lover and been to so many coffee shops in New York City but can't get any beans that taste as good Reveille's. Sadly they don't have a shop in the city, so I purchase the bean through their website instead. Despite the fact that the site charges you $8 worth of shipping, I'm still willing to pay for that!", "author": "Ally M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "This coffee shop is located on the outskirts of north beach, bordering the financial district. \nThe staff is always friendly and they make good drinks.\nThere are always people doing work on their computers here. They have free wifi.\nI would recommend their lattes.\nParking is hard, but if your on foot it's worth a stop.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "Really adore this place! My barista was extremely friendly and welcoming which was a great way to start my early morning day! Great coffee, lots of outlets, fast WiFi, and a yummy menu selection. Great place to camp out and work for hours.", "author": "Kaylynn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-22", "description": "This place is fine if you just want coffee and to work, but don't expect a satisfying breakfast to go along with it. They serve overpriced food for ants - their homestyle breakfast is a sorry, sorry excuse for a meal.", "author": "Hunter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "I love these little wedge coffee shops on acute corners... so acute!\n\n... anyways, the coffee here was quite good if you like it black, they don't bother you with annoying questions like \"would you like room for cream?\".  No, I'm here to buy coffee, not cream!  And the views from their giant windows show off some pretty hills, architecture, and skyline SF has to offer.  \n\nI think I'll need to go again on my next visit to try some other creations so I can get it that 5th star.", "author": "Matt C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Not that they need another great review, but the coffee here is some of the best! Came. Also, when you buy a bag of beans, you get a free coffee as well. And the last time I was there w a friend getting a bag to bring her family back home - we were both offered a free coffee. And the coffee was amazing, had undertones of marshmallow, was clean and crisp tasting - perfectly brewed! Will always be back if I'm in the area for a great cup.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Wifi, outlets, great lighting, even better coffee, a classy menu... what more could you want from a coffee shop?! This place has a wonderful atmosphere and vibe that is great for any number of social engagements. The street view is lovely and if you don't have to worry about price, I'd definitely suggest indulging in a pastry or some lunch along with your coffee. You're paying for quality and the aesthetics as much as you're paying for taste and quantity but it is good none the less!", "author": "Quinn Li O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "If you're looking for a great coffee in North Beach, then look no further than Réveille Coffee Co. In a neighborhood that's flooded with mediocre \"Italian\" espresso stands, it's tough to find a good cup of joe. Seriously, most of the coffee in North Beach is undrinkable in my opinion, so it's nice to have one option in the area. \n\nI'm a sucker for great espresso and usually order it at Réveille but, opted for a nice cold brew on such a hot day. The cold brew was poured over ice and just delicious. I'm pretty sure cold brew has a higher caffeine content because I'm always super wired after consumption. Side note, espresso is pronounced e-spres-oh. There is no X involved, so don't do it. It's one of my biggest pet peeves... :) \n\nThe parklet is my favorite part of this coffee shop. It's super cool and one of the larger set ups in SF. Grab a coffee, post up in the parklet and enjoy the free wifi. Boom.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "This is a beautiful coffee shop. The ambiance is what makes it stand out and worth visiting...It's very simple, mostly black and white with the exception of the few succulents adorning the center of the shop where the baristas are. One has to really appreciate the open layout - it feels like an atrium. There is plenty of seating in front of street-facing windows to do shit on your laptop and charge up while you people watch. The customers that come here look like well-to-do, young, trendy professionals. \n\nThere's also plenty of seating along the outside of the cafe. \n\nAs for the coffee, I'm no connoisseur. I had a cappuccino and it was very non-pretentious and standard.", "author": "Yenny Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "I've been visiting different coffee spots in this neighborhood to seek the best place, and I think I just found it. Right off the bat, I was impressed by the fast service on a Sunday afternoon. \n\nI really like the decor and esthetics of this coffee shop. The simplicity of the indoor and outdoor seating area provided perfect setting to sit and chat. Also has free Wifi for those who want to sit and work. \n\nWhat I like best during my visit was definitely the iced latte. The aroma was very plesant, not  right in your face like many coffee places. It's hard to find a coffee place that doesn't use scorching hot water and gives my coffee an underlying burnt taste or that uses too much milk that tones down the coffee flavor. No need to check out other coffee spots in this area, I will be coming back to try other items on the menu. \n\nDid I mention how cute the cups are?", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Absolutely love Réveille. The coffee is strong. The shakshuka is incredible. Nice atmosphere. I like having breakfast with a friend here.", "author": "Seth D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-04", "description": "Alright first off the lady I was ordering from was a fucking bitch. They got my drink wrong, which was just an iced chai. But what ever that happens. So I drink this chai and it tasted like Habanero hot peppers, damn shit made me start coughing, thought I was damn near poisoned. I'm fucking pissed it was almost 5$ and I threw it away. Stupid hipster chain don't recommend unless you like damn fucking ghost peppers in your chai.", "author": "Maddie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-28", "description": "Really disappointing cappuccino for a third wave outlet, twice now on two separate occasions and two different baristas. Milk was scalding and approaching Starbucks level frothiness.  Espresso Shot can charitably be described as a coffee flavor. Their coffee truck two blocks away is much better.\n\nTwo stars for location and ambience.", "author": "S G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "I stopped by Reveille Coffee Co. for a quick breakfast on my way to the airport last Sunday. They weren't busy at all, so I received my latte and prosciutto + poached egg toast within 5 minutes. The toast was generously topped with prosciutto, avocado, arugula, and a poached egg, but was definitely overpriced. My soy latte tasted alright but I was a bit bummed about the latte \"art.\" \n\nI can see myself dropping in for a cup of coffee if I'm in the area, but I don't think I will go out of my way to visit Reveille Coffee Co.", "author": "Helen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Awesome drawings with cream. Staff is great. Good price/quality ratio.\nThe coffee shop is good looking, wood and steel aspect, chairs outside to smoke.", "author": "Léo P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "Easily the biggest hipster asshole baristas in the city. This place sucks. Go across the street to station.", "author": "Dan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-08", "description": "3.5 STARS for above average coffee and espresso, and very mediocre (and expensive) avocado-egg toast.\n\nOverall, Reveille is a cute coffee shop, good for a pick-me-up, but not a destination cafe.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Great coffee and tea shop on the edge of North Beach and downtown.  Ambience is versatile, good for catching up with friends or casual business meetings.", "author": "Alfred C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "I'm a coffee Roaster who was visiting SF and checking out some Great Coffee. Reveille does it RIGHT. One of the Best Cappuccino's I've had and the staff was friendly. Two bags came home with me!", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "Stopped by Réveille for coffee on an early afternoon and opted for a matcha latte instead, and I wasn't disappointed. It was fairly busy but not overwhelmingly so. What made this place an experience was the environment. I love the modern stylings of this coffee shop and the vibes that come with them. I like its location on the corner and how everything is set up. Inside feels very welcoming, and the staff are all very nice. Outlets aren't difficult to find, and there seems to be enough seating inside with some outdoor tables as well. It feels a bit expensive, as was my matcha latte, but the ambiance and overall feel of the shop fit in perfectly with its surroundings in the city.", "author": "Anh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "We love everything about Réveille - the light and airy triangle building, mild and creamy lattes, and quirky friendly baristas.", "author": "Friea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-26", "description": "Cute little coffee shop. The coffee was delicious and the seating outside (sparse and on a slanted hill) allowed me a great view of my all time favorite building in San Fran. Plus I could sit and drink my coffee, do work, and people watch.  The people behind the counter were friendly for the most part and the energy inside was good. Great wi-fi connection.", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Thanks to previous Yelpers, I set foot in the streets of SF on my last visit to seek out coffee and downtime here.  I had an excellent pour-over and amazing Chia pudding from a lovely seat at the window looking up the street to Chinatown.  Excellent service, clean and cool and comfortable ambiance.  I will return every time I am in this area and now that I am back across the bridge am craving going back already...", "author": "DeliaDana Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "Another solid coffee place in SF. Reveille is an architecturally interesting cafe because it's at the tip of a building. But they've done a really nice job with the space, and the floor to ceiling windows add a nice touch of natural light during the day.\n\nReveille has solid coffee. I typically just go for a vanilla latte and it's fairly well executed. Nothing super particularly exceptional, but certainly another great coffee option.", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "I second Ben F's review - NB's coffee options are NOT GREAT. The third wave didn't seem to have arrived here yet, NB and coffee... it's kinda stuck in time.\n\nRéveille to the rescue! First of all - location. On the corner of Kearny and Broadway, with tons of natural light. The store design is kept bright which adds on the welcoming and clean ambiance.\n\nI always enjoyed their coffee - I'm more of a pour-over drinker, and their choices don't disappoint. You'll pay your $3-$4 per cup but hey, third wave.\n\nWorth it.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I decided to make a stop for coffee right after coming out of the gym. After passing by this place many times, I had intend to come in. Today, I came in for a latte and enjoyed it.\n\nFriendly staff team, clean cafe, plenty of seats available inside and outside. Most importantly, the coffee tastes good. I really like seeing latte art, it is pure culinary creativity. Plenty of reasons to come here and with outdoor seating available, this is going to bring me back. Sitting outside is the best way to enjoy that pastry and coffee especially bright sunny days like today. Overall, very good first experience here at Reveille.\n\nReasons for rating:\n- Seating available inside and outside\n- Friendly staff team\n- Clean cafe\n- Very good coffee\n- Free Wi-Fi\n\nWith this and another coffee shop across the street from here, there is always a place to get something to munch and sip on. Getting thirsty for a cup of coffee while waiting for the bus? Both coffee shops are here for you.\n\nFor those of you wondering what this unit used to be, I'll fill you guys in. This unit was previously occupied by a clothing store (I don't remember the name though).", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Reveille is a gem. Never overloaded with people due to its location, even though it's a great beginning to trekking around the shops and parks in North Beach. It's rarer for cafes to have all of these qualities now: great coffee, tea, seating, food, spacious, has wifi and outlets! \n\nStill good since I first was introduced two years ago. I'll always get breakfast or lunch, coffee, or use as a workspace for a few hours. \n\nI recommend the shakshuka and toasts!", "author": "Kathy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "My first French breakfast after 6 months in USA: croissants are not bad but I smelt it's not broiled enough, the coffee espresso is good and filled correctly not like Palo Alto \"store\". Interesting coffee because I have drunk a good seed I think:a little bit \"acid\" but natural. I saw also other cups I thought that they had a good formation as barista. They can draw a heart or leaf in the cappuccino...and between every ordered they washed elements with hot water and the vapor of coffee machine. Serious and discreet service.", "author": "Marie-Claire L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Came here on a day trip to the city with my daughter. Absolutely loved the vibe. We had iced almond milk lattes and shared an avocado toast. Both were delicious. Enjoyed the music and overall feel of the place. Baristas were friendly as well. Will definitely visit again the next time I'm in SF.", "author": "Brandie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "Cold brew was great! Also super happy they had WiFi and outlets!", "author": "Kasey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "I came here for breakfast and ordered an avocado toast with an egg and a coffee. The toast was crunchy but not hard and the avocados tasted fresh, and I liked breaking the runny egg yolk with my fork. That said, it wasn't anything I couldn't make at home, but was reasonably priced for an avocado toast in SF.\n\nThe coffee was flavorful, though. Though I usually put some cream and milk in my coffee, I drank this black, and it tasted good.\n\nThe place was clean and the service was fast and top notch. The seating inside seemed pretty limited, but they had ample seating outside, but it's right next to a busy street. The neighborhood is scenic (rugged neighborhood city feel), so it draws a pretty hipster crowd.", "author": "Marcy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Sandwiches. Sandwiches. Sandwiches. Both pre-made and made to order are incredible. Arugula is super fresh. Have yet to try coffee but heard great things. Staff is very kind and they move fast. Turkey sandwich with bacon was brilliant. Aioli is a must! Outdoor seating is casual and perfect on a nice day.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-08", "description": "I came in to study for a bit.. the ambiance was great, lots of natural light and seating. Theres regular tables and also high stool seating which work great if you're there for a long time and want to stand and work for a bit! I had the hot chocolate which was great, not overly sweet! The only thing I would say is that the music was a bit loud, so if you need peace and quiet to study then this wouldn't be the place for you.", "author": "Areeba Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "Réveille is beautiful! They do so many interesting things and play with their ambient light so well. They have a show or movie or something projected onto their high wall on one side, and it's mostly washed out by the light and there's no sound but it makes the place interesting and I love the idea! They've also got all sorts of cool, almost gas punk decorations going on, like giant industrial fans situated near their higher-level windows, but their materials are all sleek white or silver and such. \n\nTheir food is great too! Beautifully made, especially their garden of an avocado toast!\n\nDefinitely a nerd for their décor though. My summer in SF blew me away with how well-designed all the coffeeshops are, but this one was my number one. Just come in and feel gorgeous.", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "I love this cafe! The staff is so friendly and they always play great music. Also a great area for people watching!! The coffee and food are delicious. 5 stars all around", "author": "Anna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-18", "description": "Good coffee. Great interior, though hard to find anywhere to sit. Parklet outside right next to it has a good view of neighborhood.", "author": "Albert N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-24", "description": "COFFEE = 2 stars\nFor a place with 'coffee' in the name, I expected more than one type of coffee.  All I wanted was a cup of coffee, served black.  Call me a purist.  They have one option.  It was good, but nothing special.  I honestly didn't think it was any better than coffee served at a diner.\n\nI'm bumping it up to a 3 star \"A-OK\" because I did like that the volume on the music was appropriate.  I was able to have a conversation with my friend.", "author": "Chloe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "atmosphere unlike any other place. great spot to hang out and relax while enjoying a delicious cup of coffee. prices are reasonable and very worth it for the quality.", "author": "Francisco M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "I can't speak more highly about this cafe. The staff are friendly, helpful and skilled. They play awesome music. The coffee is consistently excellent, including bang on latte art. Service is fast, though morning lines can get long. The food is incredible and much higher quality than you'd expect for a place that's primarily know for coffee. Their breakfast items are all very good, arguably better than many primarily breakfast focused spots. They have very fast and reliable wifi. Excellent natural light comes in from the cafe's big windows. The cafe is also located in a busy area making for an interesting place to sit and hang out. There's also a \"parklet\" right outside if you want some nice outdoor seating. Overall, Réveille on Columbus is one of my absolute favourite cafes in San Francisco.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "This was just what I needed. It was all so simple and easy to understand the menu. The cold brew was perfect. It was just down the street from the city lights book store which is just kinda perfect for coffee/book people. down side is that city lights doesn't let you bring it inside but uk whatever. Great coffee!", "author": "Becca L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-12", "description": "Cute little cafe right on a corner on the edge of Little Italy/China Town. Perfect spot for people watching while sipping a great cup of Latte. But, if you're like me and here for work, well you might not be so happy. The internet was painfully slow, it was impossible to get work done. I'm not sure if they had a connection problem that specific day I was there or not, it just was wayyy too slow. \n\nLatte gets 5 stars, wifi gets 2!", "author": "Tamara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Excellent coffee, and the one time I popped in the server gave a coffee on the house after hearing that I had just spilled my previous morning coffee all over myself and my laptop- her kindness and the coffee made my morning!", "author": "E E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "This is a chill spot for working or having coffee. There are huge windows from which to watch passersby, 2 tables and outdoor seating. Food is very good. I recommend the quinoa salad and chia pudding. Service is great. House made cookies are nice. I'll return to try more brunch and lunch options.", "author": "Carol W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "I love the outside seating. Its definitely a study zone where you can grab coffee, ginger beer and other healthy bites. Coffee is extremely real and atmospheres is cozy. My study go to cafe.", "author": "海庆"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "My usual spot for office nearby the office.\n\nCoffee: 4.5* I usually get soy latte, its very smooth. Their coffee is tasted comparatively lighter than the others, if you prefer very strong taste, probably it's not a right place to go.\n\nStaff: 4.5* Mostly friendly, but sometimes they may be busy, and not paying enough attention to your order.\n\nEnvironment:5* I like they have indoor and outdoor seatings. Very modern and simple design, the interior allows lot of natural lights go in., Very comfy.", "author": "Natasha L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "This shop has a beautiful interior, with a lot of open space and natural light flowing through.  However, my coffee order disappointed.  I ordered an iced latte and it came in a tiny cup (I guess this is a norm in SF?) and the drink itself was way too milky.  I realize a latte has a decent amount of milk, but it shouldn't be so much that it overpowers any resemblance of a coffee drink.  In my opinion, a little pricey for a not-so-good drink.\n\nEgg toast looks pretty cool though.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "This was a nice place to sit for an afternoon with a laptop (there's wifi and power), though the place did fill up so seating could be an issue. My matcha latte was pretty good, at a steep nearly-$6. The interior does have a nice ambiance with natural light coming in. Too bad it closed at 5pm despite being advertised as open till 6. Would come back if I'm nearby!", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Very modern addition to north beach with tasty treats and a well designed location. Lots of people using it as a study location while the coffee is pretty good. Overall a great place for a mid-day coffee on a sunny SF afternoon or early morning if you live or are in the area. Recommended.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "Great Little Coffee shop. Stopped off to charge my phone, ordered an Americano. Baristas were super chill.", "author": "Payden A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Love love the ambiance and all the natural light! I also love the bar tables set along the windows, because they're so perfect for people watching ;) There are also outlets scattered along the wall, so I guess you could do some work between the people watching. \n\nCoffee here is solid. It's bold and strong and reasonably priced. \n\nMinus one star because the food here is just expensive and mediocre. At the recommendation of the barista, I tried the avocado toast ($4.50). The Acme bread slice was extremely thin and got a bit soggy from the avocado. Would not get it again as it really was nothing special.", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-30", "description": "Such a great location to grab coffee right in the middle of the city and way from the crowd! But unfortunately the staff is incautious, they mistakenly poured on one customer's phone that was ahead of me and did not care to take responsibility. Management could be better!", "author": "Anny U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Airy and uplifting environment and space, contemplative windows with an energetic feel, good people vibe and prompt personable service. I am not a coffee snob and only drink decaf but enjoy being in spaces such as these, not my favorite for catching up with a friend or actually working on documents, but good for stopping by to read the news or short articles. Recommend", "author": "Juls C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-08", "description": "Tasty breakfast toasts with lovely latte art - great way to start the morning!\n\nCame in before 8am and was served food and drink all within 10 minutes of showing up.  \n\nMinimalist decor and plenty of counter space makes it seem like a good place to spend a day working as well.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "OK this place already had expensive coffee and I find out today when I go in if they raise the price of their coffee by $.50 which brought the total to my drip coffee for $4.38 which is just going too far it's too much money!  I used to go here kind of often but has caused me to want to never frequent this establishment again. They got rid of their frequent buyer stamp card to save money too.... I'm sure they will be fine tho and continue to rake in the cash:/", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "Reveille is a very cute and small coffee shop. There are a couple of small tables inside , but mostly consists of counters along the walls. There are also some tables outside which give you a view of the intersection.\n\nI really liked the taste of the cafe latte as well as the cappuccino. I also ordered the poached egg with prosciutto toast. The egg was poached perfectly. It's good for a light meal and they  were very generous with the arugula. \n\nThe one thing that ruined the experience for me was the service. The cashier out the counter was very rude and made me feel uncomfortable as I ordered. He didn't acknowledge me at all when I came up to the counter and just stared at me as I ordered without a word. I'm used to coffee shops that have friendly baristas and cashiers and this guy was very off-putting. I wouldn't come back to this location if he's the one who interfaces with customers.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "The set-up at this triangulated North Beach operation is not the most ideal as it doesn't take much to feel claustrophobic amid the United Nations delegation of tourists who congregate here on a Saturday morning. And it was indeed crazy-busy when I attempted to infuse my cold body with caffeine. It's pretty clear the Newbury brothers take their coffee quite seriously judging from the high quality of the brews. It's hard to stand out in a city already saturated with Philz and Blue Bottle shops and on the palates of the patrons who would not be caught dead at a Starbucks much less utter that name on their lips. However, they brew a fine cup well worth tasting.\n\nThe Flatiron-style building is at the intersection of Columbus, Kearny and Pacific (photo: http://bit.ly/1AbWbdR), the starting point for many a traveller looking to explore North Beach. That would be me that morning, and I ordered a $2.50 cup of Americano to prepare me for my journey (photo: http://bit.ly/16WDTSO). It was deliciously scalding but with a subtlety in the beans and gone much too soon. They serve cafe-style breakfasts like egg sandwiches and cinnamon toast, as well as salads and sandwiches for lunch. I'll return when it feels less rushed in here with the cacophony of multilingual tongues filling the small space. That's where the nearby Station SF has an advantage as you can actually lounge a bit there. Here you honestly can't wait to leave.\n\nCOFFEE - 4 stars...a smooth whisp of caffeine with a bit of a bite\nAMBIANCE - 3 stars...nice modern interior but rather claustrophobic especially on a busy Saturday morning\nSERVICE - 3.5 stars...no complaints about the baristas\nTOTAL - 4 stars...the strength of the coffee here trumps the other aspects", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Excellent local spot featuring outstanding coffee and a creative menu. I had a delicious cappuccino and a prociutto and avocado toast. The Mrs had an iced latte and a biscuit with jam. All excellent. Nice seating both inside and out.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-25", "description": "If you are looking for a friendly coffee shop to go to in the morning as a quick stop before work, definitely DO NOT COME HERE. The baristas are extremely rude, unenthusiastic, and hate their jobs. Living in North Beach as a local for 4 years, I decided to switch it up and stop by Reveille and got the worst customer service. The barista taking my order looked like he did not want to even engage with customers, mind less take my order. Then he went on to get my order wrong. When I politely asked noted that I asked for my drink iced, the second barista making my drink responded with \"it wasn't on the screen\" and refused to remake my drink when clearly it was the miss on the other barista. They absolutely should not be customer facing. Their chai lattes....also a MISS. I will absolutely not be bringing any of my business back here.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "Bland, pretentious, and slow. Went to this place because I didn't want the usual starbucks coffee. This  place only offers one size and still charges around $6 for a bland coffee drink. We ordered a dirty Chai and a Mocha. Both were very disappointing. We would have been better off getting coffee from the donut shop across the street.", "author": "Ed P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Quinoa salad yummy! Hibiscus drink delicious! \nService, great! Person at register was very nice, warming and had opinions with my options. I like it. Thanks!", "author": "Denise L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "Terrible coffee (so sour), almost threw it away. Bathrooms weren't clean & service was so-so. Cute corner building, but probably won't be back", "author": "Shawna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Had a quick cold brew enjoyed a conversation and even found out that \"decaf espresso\" is a thing. A bit weird in my opinion but we are in San Francisco and there seems to be a trend where the weird is the norm. Anyways, if you got writer's block or just in the neighborhood, great place to charge up refresh. Ben was attentive and kind and there's a lot to be said about good customer service. humble opinion!", "author": "Curtis F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-23", "description": "Had an open sandwich with prosciutto, avocado, egg and rocket. Quality of the ingredients was really high. Latte was good. Worth dropping in if you're in the neighborhood", "author": "J.D. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "It is a really great place. Very very adorable.. The iced coffee was pretty good; the avocado toast was really yummy.. What I loved the most about that place is the exterior building -- it is painted in all-black!! Literally! I was in total awe. Anyone who knows me, knows that black is my happy color; white comes in second... the interior is mostly in all white/ black/ and brass -- it felt very vintage-modern, ya know.. The little tables outside the coffee shop are in color turquoise blue.. really cute! And the pigeons came to hang out with us (probably because I was spoiling them with bits of my whole-wheat bread lol - you shouldn't do this if you hate those innocent little fellas, I swear they are so harmless and beautiful but that's just me..) and the passerby's were so friendly and down-to-earth.. I even petted a little French bulldog puppy; that puppy's parents (human parents) had just gotten engaged merely minutes after meeting me! Wow, right? I just loved how magical that place is. One of my happiest memories/ days. I will most definitely go back again someday.", "author": "Kristi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Great little coffee shop located on the corner of two streets. I got a cappuccino and banana bread, both of which were delicious. The ambience definitely was my favourite part of the store: it's very well lit by natural sunlight, clean, well decorated, and had just the right amount of background noise to get work done.  \n\nThe only reason I am knocking off a star is that when I visited, the wifi wasn't functioning. Our entire table wasn't able to connect and while I wasn't working on anything that required wifi, my neighbors needed it and had to connect to hotspot.", "author": "Jiayi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "Great coffees and amazing burgers. The atmosphere is really nice and good for spending a quiet afternoon.", "author": "Mahsh I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Beautiful coffee shop in a cool building.  They're not snobby like some other baristas, so they really break down that stereotype!", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-02", "description": "Lady was a huge fucking bitch. Location was cute but  I got a iced chai and it tasted like spicy water. Nasty and trash. Do not recommend went with 3 people we all got 3 different drinks and none of us liked any of them.", "author": "Zoe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "It's kind of refreshing to find a good coffee shop in SF that also has wifi. Not only is there wifi, but there is also decent seating, making it likely that you will find a place to work. \nThe ambience is great - Reveille is located in one of the many Flat-Iron-esque buildings near Little Italy and China Town. Neutral colors and wooden bar tables are conducive to conversation and concentration. \nMy only gripe with the place is that the coffee is on the bitter side. I ordered a cappuccino which came with some very average latte art on top. While decently creamy, I couldn't get past the bitterness. \nI will likely be back, seeing as how hard it is to find a good coffee shop to work in SF.", "author": "Mikowai A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "Great spot for easy coffee and food. I love working here and people watching. I would recommend the avocado toast! Great staff, very friendly.", "author": "Linley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Kale salad for the win!!! No turkey for me - but heard it's good with it. Coffee is strong.", "author": "Antigone S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Cute coffee shop with plenty of counter seating and tons of natural light pouring in. It's perfect for people watching since there's big windows facing the sidewalk. It wasn't too crowded on a weekend afternoon. The service was friendly and the iced coffee ($3.50) was good!", "author": "Linda X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "Guy taking the order was rude. Girl making the coffee was slow.  They put one shot glass of espresso in my iced americano and very little ice, tastes like murky water. A hipster special for sure.", "author": "Chelsea K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "The continuation of #jennscoffeeventures...\n\nRéveille Coffee Co. boasts two brick and mortar locations (Castro and Chinatown) and one truck (Financial District) in the beautiful city of San Francisco. My first encounter with Réveille just so happened to be at the Chinatown location.\n\nThe space itself is unconventional, and seating can be a little tricky because there are only two tables available inside. (The rest of the seating is countertop.)  However, they've added a parklet to accommodate coffee lovers who are brave enough to face SF's violent winds.\n\nMy almond milk cappuccino was lovely. The avocado toast with fried egg was simple, but delicious.\n\nI'll be returning, whether it be to this location, the Castro location, or even the coffee truck!", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "This place was on my way home, so I figured I might as well get some work done in a new work environment. Turns out I got more work done here than I expected, so I will def be coming back here again. I sat inside facing the window (where all the other seats were facing). It was nice and sunny so that made the day even better.\n\n\nFood:\n\nI got an avocado toast with a Mocha for here. The avocado toast was good. Toast was super hard crunchy, but it def had a distinct savory taste to it. The mocha mocha here was good. Latte art on point, and lasted me until I finished my work.\n\nOverall, the interior and food was good. Really enjoyed the vibe & environment this place has. Looking forward to more check ins here.", "author": "Joanne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "As I'm currently in graduate school on the East Coast, I try to do as much eating and drinking in San Francisco when I get the chance. For my one-year anniversary with my boyfriend, we made a trip back in August so he could see all that I call home. Of all the places he wanted to try in San Francisco, Reveille Coffee was on the top of his list. I really liked the vibe the last time I came by in December 2014 so I was more than willing to go again. However, due to our tight schedule and unforeseen circumstances (stupid car rental place), we were unable to stop by. :(\n\nEven though we couldn't get to Reveille Coffee, I was determined to bring a little bit of Reveille Coffee to New Haven. I ventured on their website and was able to send an email directly to the owner(s), specifically asking if it was possible for me to purchase two bags of their whole bean coffee. Our ensuing conversation was quick, easy, and amiable. Within a few days, I was told that my coffee had been delivered and would arrive in a week (it actually arrived in 3 days!!). I was also able to pay through their payment platform which made it easy! My boyfriend is a coffee addict/lover to the max so imagine the look of surprise when he opened the package. :) The fact that the owners of Reveille Coffee were able to fulfill a special request for me made it all the more special. It doesn't hurt that the coffee tastes amazing! This really is customer service at its finest.", "author": "Kathy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Great latte and a great view of the Columbus tower!", "author": "Cynthia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-17", "description": "Excellent tunes first thing in the morning, along with a  sunny setting on the corner of Columbus and Pacific.  Best almond croissant in the City.  The cappuccino was simply stellar.", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "The tea is great and it's a good place to get work done- not too loud or too quiet. It's bright and sunshiney.", "author": "Claire G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Good coffee! It definitely stands up to some of the more premium coffee shops in town. So much better than any of the corporate coffee places nearby in the financial district. Lots of great big windows and natural light to sit and read. They have outdoor seating at the \"parklet\" out front on Kearny street. They offer almond milk for all drinks and on the bar next to the 1/2 n 1/2. Overall, a great place to sit and have a nice cappuccino.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Oh man, I love this place! Réveille is the perfect chic coffee shop. In addition to serving superior coffee and dishes, the staff are friendly and the space is aesthetically pleasing (I'm talking Instagram-worthy)! Réveille is my go-to for working on my laptop, meeting a friend, or for just grabbing a cup of joe when I'm out and about - and it should be your go-to, too!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-12", "description": "Outstanding Reveille:  Coffee is appreciated here, plus their teas and their food set Reveille apart.  What a delicious kitchen!  Outdoor seating and indoor design are great.  Avocado toast and shakshuka are highlights.\n\nDisappointing Reveille:  Service is interesting, with some great baristas and some with a heaping side of attitude.  \nIt can get really hot inside by afternoon, adding to the service woes as staff work for hours without even a fan.  \nKitchen is brunch only and staff is aggressive about it.  If you walk in at 1:56, your barista might have a leisurely chat with the customer in front of you for 5 minutes and then explain how the kitchen has closed 30 seconds ago and it's out of their control.", "author": "Eve H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-02", "description": "Like the one in the castro, they have the best iced tea. It's so good that I drink it all within like a minute and then realize that it was the quickest $3.50 I've ever spent, which makes me both resentful and makes me want another.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "Okay, I know I wrote in a recent review that I had one of the best almond latte's in a long time but now I change my mind (and I'll probably change my mind again, haha! I just can't make it up)\n\nSo after picking up a delicious old fashion maple donut from Happy Donuts (across the street), the group and I decided that we needed coffee to compliment our morning delight. I had Reveille before and for some reason I wasn't a huge fan. But today, today was the day that my eyes had been opened once more. \n\nI ordered an almond latte (surprise). It took about 15 minutes to get my drink, but it was early and there was a line and I was patient with my donut. I started to look around and I really enjoyed how they made the bar as their centerpiece of their space. You can easily watch as the baristas are steaming the milk, forming their coffee art, and even making slow pourovers, either way, it made my waiting experience quite eventful. The cafe overall is small but it's nice that they have side bar seating and small tables for people to enjoy the food and drinks. I love the open windows and their typography logo. And hey, if it's a nice day, some outdoor seating has been created recently and I think that gives this cafe an extra plus in my book.\n\nAh, 15 minutes pass and my coffee comes. I was really happy with the coffee art and the temperature of the coffee. The foam of the milk was perfectly light and fluffy and the espresso was surprisingly strong. The almond milk had a hint of sweetness that went really well with my donut. The latte cooled down within 15 minutes or so but it remained amazingly delicious. I would have to say that this is one of the best almond latte's I've had (for now). Yay!\n\nUpdate: the next day\nHad their $2.50 drip coffee! The cup is extremely hot so it was too hot for me to even consume! But then it hit me.... I didn't love Reveille too much before because I felt their drip had a sour tang. I commend them for having a strong light roast, but the tang is a no no for me. Going to add some non-dairy next time.", "author": "Linda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "A quaint but busy coffee shop at the corner straddling the cusp of North Beach and China Town. Iced latte was well made and in a timely manner. I like the vibes and music of this shop, and the unique outdoor seating is a great place for people to hang out and catch up...over a delicious cup of coffee!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "Cute little coffee shop conveniently located where the financial district, north beach, and chinatown meet. I've enjoyed the coffee, tea (try the green tea!), and OJ here. The interior's beauty stems from its minimalism, ample sunlight, and triangle-shaped floor-plan. Bear in mind, however, that the inside is quite small, seating is scarce, and the ample sunlight often leads to a very toasty interior. My friends and I often times end up having to sit outside, which in stark contrast, can get quite chilly.", "author": "Dalia Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-04", "description": "Very bad wifi, unreliable. Especially for the prices and the branding. The environment is really nice as is the outdoor seating and the view. The outdoor seating gets cold when outside in the shade.\nThe coffee is meh, bad for its price.", "author": "Tomás A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "Finally, a really good coffee shop has arrived in Chinatown; well, not really in the heart of Chinatown. But the newest coffee shop is located on the borderline of Chinatown and North Beach on Columbus Ave and located across the street from the iconic dive bar: \"Mr. Bing's\".\n\nI was here one rainy morning on my way to work. I have decided to switch from my usual frugal and bitter coffee and gourmet cocktail bun from the bakeries in Chinatown and upgrade into a lavish espresso beverage that I can enjoy for once. \n\nFor my debut, I ordered a latte. For $3.25, the barista uses their own brand of ground coffee bean into a \"sick ass\" espresso machine and add two shots of espresso into the cup. The barista also added steamed organic milk for the foam and a decorative creamy top. \n\nFor another $3.25, I also bought a delicious coffee cake. The coffee has a crumbly and sugary topping with a moist interior. Notwithstanding that I was dealing with the heavy rain, I still put a sunshine smile when I enjoyed my latte and pastry. My treat: http://www.yelp.com/biz_photos/cQfRu22j4nAuycKWHexAIA?select=coBRhhIuI2FDFJ8PTzabaQ#xf1ZWcjZK6zDWW-cPPF6ZA\n\nDespite having coffee shops up the hill in the heart of North Beach and competition with other local coffee company such as Blue Bottle, Philz, Four-Barrel, Rituals and others, this coffee shop has no competition in this part of the city.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-28", "description": "With their wooden floors, open kitchen, black high stools and having an ipad to act like a register, this is a modern touch to cafe shops.\n\nHowever, for a modern cafe shop, they don't have Wi-Fi.  A major let down!  I can't get my stuff on my laptop done here!\n\nI also disliked how their high stools do not have back comfort!  I had to sit straight and felt stiff, like a hardcover book, the entire time while trying to chill and sip on my cup of coffee.\n\nA bit on the pricey side for their coffee, but the plus is that they decorate their coffee on top.\n\nhttp://www.yelp.com/biz_photos/cQfRu22j4nAuycKWHexAIA?select=DBMSJ-N426cyKJHE-qWfRw#DBMSJ-N426cyKJHE-qWfRw\n\nFinal say - There are too many coffee shops in this vicinity up for competition with this one!  I prefer going to the ones next door or across the street just because both of those coffee shops have Wi-Fi and relaxing back support seats.", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-07", "description": "Love, love, love this coffee shop! It has the perfect cozy atmosphere to make you feel right at home.\n\nMy boyfriend and I came here for breakfast and coffee while we were in the city and were truly pleased! The lattes were delicious and I was pleased with their breakfast offering. \n\nThe indoor area is really cute and would be a great place to get some work done, and they also have some nice outdoor seating!", "author": "Caroline G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "Great coffee. Cool ambiance. Only complaint - usually pretty busy and seating limited. Otherwise, it's great and wifi is super quick.", "author": "Kieran B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "A bright, aesthetically pleasing space with mostly counter seating and a couple of small tables.  The noise level is usually at a good level with energetic but not headache-inducing music at a lower volume which creates a pleasant vibe. Great space to get some work done. The workers are polite and efficient with no pretentious attitude. On warmer days, It can get really hot inside the cafe though - all the windows with sun streaming in and it gets a bit stuffy. A little air would be nice. :)\n\nOne odd thing that I noticed recently is that the same drink costs different prices on different days.  It's not a big difference (about 25 cents) but it is a little strange.", "author": "whatever I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-30", "description": "With the Réveille coffee truck being closed for the holidays, I'm glad we stumbled across the brick and mortar cafe instead. Réveille definitely has one of the cooler spaces for a coffee shop that I've visited. It's literally located at a big intersection on the corner of Kearny and Columbus. The cafe itself has a rotunda floor plan with an island counter bar smack in the middle with seats all around. There are windows on all sides of the cafe, which let in plenty of light. But enough about the architecture and the aesthetics, let's talk coffee. \n\nDespite two shots of espresso per latte, I just didn't get enough strong coffee flavor. There was an abundance of organic milk foam, but it was just lukewarm. The latte art design was well done. If I were to order again, I would opt for the single drip coffee. They served Rwanda Coproca single origin drip. The flavor was distinct, but not too bold with just a subtle hint of acidity.", "author": "Bailey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "In the middle of this Chinatown/Downtown/North Beach intersection-madness sits this oasis with good coffee, good service, good space, and good wifi. On the East side of Reveille, there's an outdoor public sitting space for those nice days where you just need to spend some time outside.", "author": "Loretta C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "I'm staying nearby and was really craving some delicious cafe food like we have at home in Sydney. Love the kale salad with turkey, avocado, radish and Parmesan. Super fresh and healthy, a nice cafe too with all round chilled vibe.", "author": "Courtney F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "Came here on a Saturday afternoon after a trip around Chinatown. The place is a really interesting shape, but overall quite a nice place. Had a soy chai latte, which was pretty average -- nothing spectacular, but as how one would expect a typical chai. There's some seating options on the side of the street, and overall not a bad place to work (would look for outletted seats before just choosing to settle down anywhere).", "author": "Cindy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Reveil is my go to coffee place in the weekend. \n\nThe staff is SO friendly and knows their coffee shit. You walk tell them what you're in the mood for and they brew you something. \nIt's also a great place to stare at people through the big windows. \n\nI absolutely love this place, it never disappointed me.", "author": "Judith S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Dropped by in the morning for a coffee fix the week before the stupidbowl hit.\nThis is a fairly well regarded neighborhood coffee location in a city which is famous for it's superb coffee.\nThe inside is bright, well laid out and welcoming if not plush. There's no big comfy chairs but the counter seating has a wonderful street view and there's little tables tucked in for more intimate seating.\nThe coffee on order is most awesome. The espresso, drip coffee and latte's are all good verging on great. \nThere are the usual range of croissant and pastry options, and a limited selection of breakfast items (San Francisco what is the deal with avocado toast? Is it required by law  for every coffee place to offer it?) I thoroughly enjoyed my almond pastry but it might not be for everyone. It was  crispy on the bottom and chewy in the middle, almost soft. While I enjoyed the difference of textures and mouth feel I could see where another person may want a more consistent product.\nThe service was a little spotty. Two people were not quite enough to service a four person deep line in the morning. \nFour stars for the near perfect latte and the view.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-12", "description": "Great venue and great coffee. The space has amazing lighting, full of people working away or just hanging out and socializing. There is both indoor and outdoor seating, where you have the perfect view for people watching. The coffees are strong and delicious. Sitting here on a sunny day, while enjoying a cappuccino is simply perfect.", "author": "Aletta B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "Beautiful place , beautiful patio , taste of coffee is okay and i like it . However , please ! @Managers , put wood mixers instead of steel spoons . Because I dont feel clean with steel spoon in a coffee place . I would love to come back everyday If you do so. \n\n\nThanks !", "author": "Jay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Reveille has been on my to try list ever since I saw it when I hit up The Station awhile back.  Greg and I walked from our house (down by the ball park) to Reveille for a nice Sunday stroll and rewarded ourselves with a pour over and an iced coffee.  My Colombian bean pour over was fruity and aromatic, and it seriously hit the spot.  Greg, having now tried a number of iced coffee variations, put Reveille's version in the same hemisphere as Sightglass, albeit an itty bitty sized coffee.  If it weren't for me and dieting, some of the menu items looked absolutely delightful (yes, I'll admit to being that person who's OK with spending $4.50 on the peanut butter + jelly toast).  I can't wait to come back, the scene (and the little sitting area outside) is definitely my jam...pun intended!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "I love coming here because it makes me feel both hipster and trendy. (Sometimes I feel the need to pretend I belong) Your beverage is prepared by cool hipsters, and you know its gotta be trendy because there is a Castro location!\n\nHonestly, I can't tell the difference between their coffee and the Blue Bottle stuff served next door @ the Station, but it is delicious and the neighborhood is awesome. I've had both coffee & lattes, never disappointing. The breakfast sandwich is $9-10 so the food might seem a wee bit pricey if you aren't a tech schmillionaire.", "author": "Roger L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "SF has rare hot days and when I got here I was in the middle of one of them. However I solve this by having a nice cold brew. If you stay inside it's pretty muggy but the slanted outside sidewalk seating is nice. It's also great for people watching.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "This is your little cafe at the 'spot light' corner - it's situated at the edge of a triangular block and its door opens at the tip.\n\nInterestingly, this cafe is at the very border of old-school Chinatown but within walking distance from FiDi to serve the suits and ties yuppies from there. I personally love finding those little shops or cafes that seem somehow a little out-of-place - a bit of deviation from norm can be a refreshing experience, n'est-ce pas?\n\nIt was easy to tell that most of the customers are regulars. Latte is on the more milky side. Coffee quality solid.\n\nAlmond-shaped coffee house. Wooden counters and stools lined up around the windows. A round espresso bar (and a very friendly barista) at center of the cafe. Natural lighting. Simply pleasant atmosphere.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Great coffee and atmosphere. If you are in the area or even just passing through, stop and grab a latte here. The vanilla is delicious, but honestly these beans don't need it. \n\nThey of course have food - including the obligatory avocado toast - but you know damn well that what you really want are the donuts across the street.", "author": "Rob H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "A coffee shop with a very modern vibe, black-and-white interior, wooden floors, high stools, large windows, and hipster-ish waitstaff (who are very nice)\n\nOh, and fast wifi. The wifi password is also fairly funny, and aptly appropriate.\n\nA good, clean place to chill and grab a cup of coffee. The great location doesn't hurt either.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-10", "description": "Love this place!  Cozy and friendly staffs.  They have couple outdoor seating which is great for sunny days.\n\nLove the latte there. Very smooth and rich.  My friend tried the mocha and she said it was very good too.", "author": "Liza T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-18", "description": "I pass by this place every day as I walk to my new workplace. The cafe is bright, clean, and simple. When I came in to grab a cup of coffee with my coworkers, the experience and product didn't really meet what I was expecting from what seemed like such an inviting place. \n\nMy coworker as really craving their biscuit and after she paid for her order and was waiting, she was approached by staff who said they were out of biscuits. She substituted her order for the French toast, but it would've been nice to have a heads up before paying.\n\nI ordered a chai latte with a shot of espresso - a \"Dirty Chai\" if you will. $4 for the chai, $1.50 for the added shot of espresso and I added $1 for tip which came to a total of $6.50 for my drink. UGH WHY DID I COME HERE.\n\nThe barista made me a latte at first but the cashier noticed my confusion and they fixed my drink order. All the while they were joking about dirty chais which made me feel awkward waiting for them to make my.... dirty chai. I wish I knew they don't sweeten their drinks bc I hadn't tasted my drink until I was back at the office. I guess no sweetener is the healthier to go.\n\nThe workers at The Station across the street are much friendlier and the drinks are priced more reasonably so that is where I'll be going to get my Chai from here on out.", "author": "Bonnie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "I enjoyed my soy mocha here. \n\nMultiple pluses for this cafe! \n1. They have a clean restroom. \n2. They have good wifi. \n3.  They have outlets. \n4. They have large tables for when you gotta study hard. \n5. You can stay for as long as you want. \n\nI loved studying at this cafe and would totally come again the next time I'm home :)", "author": "Kayla O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Used to go here for my caffeine fix before my shift at Quince. Very friendly staff and the iced coffee gets the job done.", "author": "Marie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Just had their cold brew yesterday and it was delicious. There was no sour bite to it; mainly smooth with a soft rush through. I did add some half & half to add some creamy texture to it (a splash). This place never fails with their coffees and service. Always a great stop for coffee whenever I'm in the city.", "author": "Allister D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I'm not a coffee drinker but I heard great things about the breakfast here so I needed to try it out.  I got the egg sandwich with bacon and it did not disappoint.  My wife got the yogurt and granola.  Both were simple but oh so tasty.\n\nWe'll be back.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-19", "description": "Pros: Cappuccino and Macchiato were good\n\nCons: charge you $1.99 for having your coffee at their location without telling you. A \"for here\" charge.  If that was the case, I wouldn't have tipped! \nUnheard of at a Coffeehouse.  At least tell your customers...!\n\nProof is in the e-receipt screenshot....", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Just great and fresh coffee, it is just a great cofe that it does not need any flavors or sugars. For sure recommended!", "author": "Custo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "Great little spot for a morning cuppa. \n\nGood lattes and by the looks of it, a pretty good hot food selection too. I've only had the cold pastries, which I'd assume are brought in. \n\nInteresting circular layout and refreshing decor, light and airy, which is nice to have in the morning. A lot of natural light as well. Outdoor seating is also available.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "Nice location and ambiance but:\n\nThey need to fix their flaky internet! It's really annoying when you go for internet and it's down for just that day. \n\nThe coffee here tends to taste sour for some reason.", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Very good coffee...nice blend from columbia ethiopia and ruwanda...good skills...very very nice interior! !!\nThe bar is designed well!!!\nThumbs up!!!", "author": "Moritz W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "The shop looked really modern and seemed like a place where you can get work done. However, you don't always get wifi, depend on where you sit and how many ppl are using it.\nThe latte I got was really delicious and so was the sandwich, however, it's a bit on the dry side.", "author": "Mark Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "Great coffee, but bad food. We had two egg dishes and the eggs were heavily undercooked. The ingredients tasted cheap and the flavor was bland. The girl giving us the food was rude.", "author": "Captain B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "the interior reminds me of La Colombe locations in NYC (this is a good thing :) )- bright, airy, high ceilings with the coffee \"bar\" in the center of the cafe. i tried their house roast, black, and thought it was decent. the line moves quickly in the morning, looks like mostly people on their way to work, and the cafe is fairly quiet. there's some seating along the perimeter if you want to sit for a few with your coffee.", "author": "Meryam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "It was a spur of the moment call to stop here but I'm glad we did. We got 2 cappuccinos - one with whole milk and one with almond milk. Everything was great, except the drinks could have been a bit warmer. The whole place is cute though, and a great spot for people watching.", "author": "Renee P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "When I arrived to San Francisco from Los Angeles, first thing I planned to do was stop at a few coffee shops. I did my fair view of research and Reveille was my first stop. First off great ambience, really cool setup. The chick at the counter looked like she was forced to ask you how your day was. Got my mocha to go, and as for that I'd give it a 2/5. Something was missing. Felt watery. Eh.", "author": "Fatima A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "Great coffee of the well-curated variety.  Think:  3D wave coffee served on clean and white surfaces rather than the typical North Beach \"great coffee\" of the type Kerouac drank.  The cappuccinos go a little toward the milky.  The seating can be tight, as one of the draws of the location (the cool triangular shape) also messes with how you can maneuver around the place.  I like the outside tables, though you want to be careful of your coffee on the tables that have to balance on the steep hill of Kearny.  There's a cleverly-designed outdoor parklet, but wow it can get windy and cold there.  Nice place to hang out with a book and watch the people on Columbus.", "author": "George G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-12", "description": "First, I really like their coffee, but that is a matter of taste. I also like their food-fresh, tasty and quick. I come to San Fran a few times a month and this has become my regular stop, but not for long. What they can't seem to accomplish is to get my coffee up before I get my food,  then wait while I hope my coffee gets ready, wait some more until my egg gets cold, decide to go ahead and eat, finish eating and clean up my dishes...still waiting for a cappuccino. This has now happened the last three times I visited, at 7 AM and generally only 5 or 6 customers in the place. While I appreciate the attention to detail, the pace has to pick up just a bit. The kitchen is holding up their end of the deal...maybe I'll just stick with buying a bag of beans to grind at home, because visiting is starting to get annoying.", "author": "Dan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "Loved this place. Great atmosphere and beautiful avocado on toast. I love wish that more places would have such delicious, simple dishes.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "Great coffee place!  I Love the lattes here.  This is a great alternative to Blue Bottle (my personal favorite), plus the line here is much shorter then Blue Bottle.  They have some backed goods up front for sale, and during the week have meals, but on the weekend, when the kitchen is closed, they let you bring your own food in. Plus they have ceramic cups for people who stay there, even if it is at they outside seating area.  I personally like this because it feels more like at home with a ceramic cup over a paper cup. \n\nThey offer free wi-fi and they have plenty of seat, which makes this a great place to get your work/study done at.  There are a ton of windows the let a lot of natural sunlight in, but because of that it can get a little warm and stuffy.", "author": "Rose Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "Came here after lunch in North Beach - the ambiance is great. Lots of natural light, big windows, and good coffee. I had the chai latte and it was delicious. Came with my laptop to get some work done and the wifi was super fast. Great experience!", "author": "Wei W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-25", "description": "3.5 review.\n\nPerfectly nice cafe in a great location on Broadway/Columbus intersection. Pro-tip: perfect Insta-moment if you look directly out the window.\n\nThe cafe itself is bright and lovely, I love the modern touches, and they have almond and soy milk options available. I've been on quite a cold brew kick lately and I have to say that I was a little disappointed by theirs. It has the tell-tale sourness of too much acidity that can get in the coffee, which I tend to dislike. In a city full of third-wave coffee options, I think Reveille is trendy but not the best.\n\nTheir food options seem quite abundant though, and they do have lots of pastry and sandwich options if you're looking for a light lunch.\n\nFree wifi available and lots of counter seating.", "author": "Kate M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "This place is tied for my favorite place in SF to get an Almond Cappuccino! It's flavorful, smooth and uplifting. The vibe at this location is very hip and busy. Their chocolate chip cookie is also very delectable.", "author": "Oscar C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "I had the cold brew iced coffee to stay and it was great.  I'd definitely go back there later on my trip, worth the stop in north beach.", "author": "Brad H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "I think I come here mainly because I love the interior lighting so much. It's at one of those 5-way intersections so depending on which edge of the cafe you sit, you can get a great view of eccentric SF and the tourists that walk by on a daily basis. \n\nNo Wifi but their coffee is good. They close relatively early (5/6) but are open usually an hour later than the Station across the street so that is a plus.", "author": "Audrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "Reveille Coffee does drip coffee (3.75) with a four minute wait.\n\nmenu: breakfast (toast, granola) lunch (sammies, baguettes), expressos\n\npour: rwanda coc.....(sm. 2)\n-smooth, mellow medium roast, probably organic\n-great coffee as standard cup.\n\ndrips:\n-reviews mention no wifi here\n-mostly stool seating next to windows\n-no decor, glass all around, good window watching.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Four overlapping pokestops actively loaded with lures make a compelling argument to drop in for lunch. Unsure whether Reveille is leveraging their convenient location for trending ARG by loading lures throughout the day, smart play if so.", "author": "David G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-15", "description": "I got the mocha coffee w Soy milk. They use mocha powder and mix it with the espresso before pouring it into the cup of Soy milk and ice.  The barista didn't mix the powder well because there was chunks of powder in my drink. Treated very grainy at first until I realized it was powder that hadn't melted in the espresso", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "This cute little corner coffee shop is so pretty! Very well designed, and very ~cool~. The baristas helped me with my selection by making a quad espresso so as to attempt a heavier roast in opposition to their selection of more floral/fruity/acidic coffees on pour. I appreciated the attempt, and my friends liked their drinks, so I think four stars is a good rating.", "author": "Jacob S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-07", "description": "My partner and I frequent this place a lot during the weekends. The place is right located around the corner. Like the decoration and Windows all around.  A nice spot for people watching and maybe bring your laptop/ work on your coding ?:)", "author": "Alanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I really loved the vibe here. The people were down-to-earth and friendly, and the food was really really good. I had a breakfast sammie with egg, avocado, and cheese; I also had a choco chip cookie (yum!) and a cappuccino.\n\nThere's not much I can say about this place except you should visit if you can. It's a great spot to spend part of your afternoon or morning.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-30", "description": "The Reigning North Beach Latte.\n\nHave attempted to frequent as many of the cafés in North Beach as I can, and Reveille is in the highest tier, edging out Greco and Beacon by a subtle but perceptible margin. These people live and breathe espresso, and it's clearly of a finer quality than their competition. Smooth, flavorful, exquisite. \n\nGo!", "author": "Bosie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "What an amazing little coffee shop! I got my usual soy latte, but I have yet to come back and try their pour over coffees. The people here are also really nice, the cafe is really big so you can bring some work and sit in the corner, and it's in a great location to people watch! \n\nI also ordered their turkey brie sandwich and it's amazing. Delicious buttery brie with arugula and healthy turkey on a delicious baguette. They only make a set amount everyday so when they sell out you can't buy anymore, so make sure you come early!", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-29", "description": "Reveille, deserving of its name, a pleasant \"wake up call\" to your morning grogginess.\n\nWith stools set up by the window that runs through the whole shop, it is an ideal and bright space for people-watching and book-reading. I love how the shop is fixated next to a low incline hill. Unlike other coffee shops, you can enjoy the seclusion of a sidewalk view without passerby awkwardly staring at you. \nFor $3.5, the price is pretty average for a cappuccino compared to the many many coffee shops in North Beach. I have to admit that I was not impressed during my first 2-3 visits here because I thought their coffee was too milky bordering on bland. Recently, I frequent this place very often and have seen some improvement in flavors. It might also be because I have grown tired of the Italian dark roast and like something more bright and fruity. \n\nNot to mention, the staff is always personable. Let's just say, I can always depend on a good morning at Reveille.", "author": "Anh L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "Bad attitude from the barista!!!!!\nNo welcoming \"hi\" or even look or a smile!\nShe treated us like we were not paying!\nThe coffee and food were fine, but the bad attitude just ruined our experience. \nWe were really excited and looking forward for something better.", "author": "Meem S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "Wooww.. I'm disappointed!  The barista made my cappucino with leftover milk. She steamed the milk like Starbucks barista. Reveille, I think you will need to train your barista hard. No passion at all. I asked her to remake my cap but she was not pleased, I can see from her face. She made my second cap, lukewarm. I threw away before I drink it. Ruined my day. 11am 8/8/2016", "author": "Christophorus Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "Coffee tastes great! Although their drip coffee was unbearable,  the lattes were delicious. Their customer service is pretty bad as well. They close up their espresso machine 15 minutes to close. I had come all all the way from Napa, and my daughter came all the way from Idaho to try their coffee, but we came 15 minutes till close and we couldn't get a simple latte. This was very disspointing. So we decided to get drip coffee. This was was a big mistake. Their drip coffee was so bad, that my daughter didn't even drink it. (And she loves coffee)\n\nAbout a month later we decided to give it another try, but to our surprise, the machine for decaf coffee... was Of course,  broken. Again we were disappointed, but nevertheless we decided to get a latte. When I order a latte, I typically get a 16 oz. But again, to our disappointment they only served lattes in a 12 oz cup even though they do have 16 oz cups. \n\nAnyway, like I said the lattes are good, but it's up to you to decide if it's worth the cons of ordering a drink there.", "author": "Yana M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-21", "description": "Pretty mediocre coffee but the windows seats have a nice view of the street and pedestrians if you like people watching.\n\nMy coffee just didn't come very hot and they didn't have a great selection of beverages or snacks and food.", "author": "Loryn F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-25", "description": "Beautifully designed space with excellent coffee. \n\nIt's not designed for large groups to hang out -- it's mostly bar seating with stools. That said, it's an excellent place to work out of. It's a great place to get your creative juices going (though no wi fi). \n\nThey don't have non-fat milk and no tea, but what they do have, they do well.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Yummmm.... I love the turkey and bacon sandwich. I come here quite often for lunch and I am never disappointed. They have a really good menu to choose from. Pastries are delicious as well. Best thing is they carry almond milk-when I fwel like a latte or hot chocolate, I can walk right down and get one =)", "author": "T A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "The coffee hereis solid. Even the decaf is very flavorful. They use whole, organic milk for the most part, so if you order lattes, macchiatos, or anything other than black, you're going to get some nice, creamy froth. It's fantastic. Prices are definitely $1 or so more expensive than other places, but the coffee is definitely. The only question that you have to ask yourself is - Reveille, The Station, Brioche Bakery, or any of the other local North Beach cafes nearby? They're all very good. It's just about preference. Haven't tried any of the food though, so can't say much about that. Service is great, and if you come in the afternoon, then you won't find any crowd or line. I love their window seats. Just saying.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Fantastic food, good coffee/tea, pleasant atmosphere and nice to our 5-year-old. Couldn't ask for much more.", "author": "Meredith O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-21", "description": "Atmosphere: lots of natural light, casual, good music. \n\nService: really nice baristas.. And they brought the drink near me after I already sat down. \n\nDrink: ordered an Americano, a staple. And they delivered. \n\nPrice: average. \n\n4 = good purchase. I would probably come back here if I'm in the area.", "author": "Alvin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "I really like reveille. It's one of the few coffee shops in the china town/downtown area that's central, cute, and serves tasty breakfast sandwiches. And easy to find a seat if you're willing to sit outdoors. Just not that most of the seats are in fact outdoors. Perfect for a nice day. \n\nBut beware the teas are steeped real time and take 5-8 min so don't order if you're in a rush!\nI was pleasantly surprised by how filling my bacon egg cheese was as well!", "author": "Kaego R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Having enjoyed coffee from their truck I was excited to see Reveille open up a coffee shop.  \n\nI normally get a Cappuccino and for the most part they do a good job.  Once however,  when I had my cappuccino in the cafe, there was a bit more milk than i would like so it kind of turned into a latte.  Another time the shot pulled was a bit acidic so it wasn't as smooth as i've had it previously.  A friend have suggested that we should only go when the two brothers (owners) are there as they make a more consistent cup and they know what up.  \n\nI've also tried their Egg Sandwich, with Bacon and Kale.  Which, along with the inconsistencies why i'm dropping it a star from a full 5.  The sandwich was pretty good. It looks cool since it was \"egg in a basket\" but the $3 extra i paid for the Bacon and Kale was a little too much seeing that it was a ton of kale and what amounts to roughly 1 slice of bacon broken into 3 pieces.  Needless to say I was slightly disappointed on that front.\n\nI do enjoy the minimalist design of the interior and love the center island coffee bar.  The metal beams that are both structural and decorative. Extremely hipster trendy.  I want to say that there is seating upstairs for people who plan on staying longer (i've only seen people upstairs from the outside), but i'm not sure.  The downstairs counter seating is good for people coming in and out for 30 mins to enjoy a cup of coffee, people watch or have quick conversation.  The high traffic around the island makes it not feel like a sit down for hours type of room.  \n\nI work around Jackson Square and come out to church in Chinatown on Sundays and for the longest time my friends and I've been looking for a good coffee shop to enjoy a cup on Sunday afternoon.  With The Station literally across the street, coffee patrons around the North Beach/Chinatown/FiDi area can now enjoy either Four Barrel (Reveille) or Blue Bottle (The Station SF) coffee on the corner of Columbus, Pacific and Kearny.", "author": "Donald M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Great atmosphere, reasonable prices, tasty food. Good selection of breakfast/lunch/snack items. I had the breakfast sandwich, and it was probably the best breakfast sandwich I've ever had. It was simple and well made. My friend had a slice of avocado toast and a chia seed bowl, which I thought was a little expensive at $8 a bowl.", "author": "Chantal T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Was on a trip in SF and wanted to try all the local coffee places. My hotel was near so I walked here and it was everything I wanted! Very fast, kind service. The interior was very modern, coffee was great.", "author": "Esther P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "Lost a star. Bummer. The main reason has nothing to do with their coffee. It's their sea salt chocolate chip cookie. While still very large, it's far inferior to the way it used to be. It now has only lots of tiny flakes of chocolate - no larger chunks like it once had along with the flakes. And, my most recent cookie was quite dry - sandy almost - and the sea salt on top was in a large clump in the center. That's not palatable. I'm not doing tequila shots - the salt should be a light sprinkling all over the top so every nibble has some. Something has changed with their baking supplier - a new employee, or?\n\nAlso, I don't think the barista was told of my drink by the cashier. The barista was super friendly - with one of the best smiles I've ever seen -  but she had to deduce that I was waiting for a drink (and asked me) instead of knowing about it via the cashier. Minor stuff. Great coffee.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "Great coffee tea and pastries, nice people, great atmosphere, really nice parklet, what more could you ask for?", "author": "Larisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "Nipped in for a quick cup to rest our tired feet. We had chai latte (with almond milk) and a regular latte. Compared to other establishments like Philz Coffee, theirs was forgettable--but decent. Ambience was chill, relaxed, minimal. Good place to read a book / get some work done.", "author": "Shannon E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-11", "description": "Rude service. The barista(the red head)  was incredibly rude, and despite having reminded her nicely for my drink (which she had forgotten to make), made it with a lot of attitude (like she was doing me a favor). I get that coffee shops can get customers who are difficult, but maybe you don't take it out on the ones that are nice to you.\nOh - and the espresso was lousy.", "author": "Parth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Love the coffee and their art cute out side you will forget this is part of China town. Beautiful clean setting. Very calm and relaxing in the city . Urban oasis here gotta love it ! Cup of tea and coffee . You feel little peace .", "author": "Yuri N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-30", "description": "Great coffee at a quaint location, facing the iconic Columbus tower. Nice modern decor.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "First off, this is not in Chinatown. It is North Beach. Sure the Chinese would like to claim it, but it is still (holding on tightly) in North Beach. For me, the location is great. It has good views and excellent people watching with plenty of outdoor seating. The staff is wonderful. Smiling beautiful women abound. There is one thing off for me: the coffee. I just don't like it. Maybe I am accustomed to Peet's, I don't know. However, I am sure many people will like it. My friend who I go with, thinks it is top-notch\n I will still go because all the pluses outweigh the minuses. It would be so nice if I could bring my own home brew here.", "author": "S. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "This is totally my kind of coffee shop. I love that the building is black. When it comes to coffee shops, one big thing for me is natural light... and this is place surrounded by windows. +1. There's also a parklet just outside. +10. Outdoor seating in SF doesn't get much better than this.", "author": "Sawsan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "Asked my BF if we could stop by to grab a coffee after we had lunch in Chinatown, and he bought me my latte! =D\n\nReveille is very close to Chinatown and located on an interesting corner. I liked the interior with the very big windows that allowed you to look out and enjoy the scenery. Definitely a good place to people watch, chat with a friend or just chill with a good book while nursing your coffee. The lady at the register was really nice and happily prepared my iced soy latte which tasted a lot better than your average chain coffee. They don't add sugar but there is simple syrup and lids for the cups in the back.\n\nThis coffee joint is cute but it's pricey and a bit out of the way for me. If I'm in the area I may swing by, but I think the charm of this place is best appreciated if you stay and sit awhile.", "author": "Sam F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-17", "description": "Ok coffee. The truck is too high for a short person (5' 1\") like me to reach to sign and pick up the coffee. The ladies managing the truck didn't bother at all that I couldn't sign. She just turned around and upon requesting signed on the iPad herself. Weird. Didn't even bother getting the coffee to me. First time I have experienced something like this.", "author": "Divya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "At many a strong-coffee outpost in this city, I feel like I'm putting the counter staff through some sort of unfair test when I ask for a cup of tea. It felt like that at Reveille, but I liked it here just the same. \n\n\"Of course we have tea,\" he assured me when the posted menu did not, but he wasn't sure what kind. \n\nI made it easy on him: \"Anything herbal, like peppermint or chamomile,\" I coached him. \n\nHe offered an unsure smile and set out to find the tea. \"Herbal Medley?\" he asked, holding up a several-pound sealed bag he had ransacked the cabinet to locate. \n\nIt was delicious, and he served it on a bamboo tray in a fine little glass press that didn't smell at all like coffee. I took all it outside and sat in the delightful adjacent parklet to write in the sunshine. Perfecto!\n\nIt looks like a posh assortment of pastries and plenty of indoor seating too. I'll be back.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-10", "description": "Wow I've been coming here every day on my way to work to grab a cup of coffee in the morning.  I tend to bring my own thermos as not to waste their paper cups.  This is the first time a barista has ever measured out a 12oz of coffee in a paper cup then poured it into my thermos.. .WOW.  Thanks for wasting a paper cup I was trying to save AND make me feel like   I'm trying to be cheap by bringing in my own thermos.  \n\nI am so appalled I may never go back.  Put a bad start to my morning.", "author": "connie h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "I finally tried a pastry, and was not impressed. I had a giant cookie because it looked awesome and giant, but I think it was under-baked. But that won't stop me from coming because not only do I love this place for their delicious lattes, I also love this place because the guys that work there are oh, so sexy.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-10", "description": "The atmosphere and presentation of the place is good, but the coffee is absolute rubbish. I bought a cappuccino which was so awful, I couldn't drink it & so I took it back. Got some attitude from the guy taking the order and was then presented with fresh cup of luke-warm, sour tasting garbage. \nDon't go if you like good coffee.", "author": "Ash S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-31", "description": "I guess I'm not sure how I should approach a review of Réveille, if you like over priced, hipster, fair trade hand dripped coffee than this is a great spot. \nIf you are perfectly comfortable in a Starbucks,  than I don't see what all the fuss is about. \nThe location is killer though. Right at the foot of Columbus.", "author": "Jack W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Always a beautiful espresso.  I sometimes have to have a second right after the first, it's so good.  Always a nice atmosphere. Great to sit in the window, and watch the world go by, or get too involved in your book. A classic cafe where nearly the whole place is a window to the world.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "I had not written a review in yelp since 2007 but I have to say that I just had the best breakfast sandwich i've ever had in my life! Its a gem! Simple but delicious...Kale, melted gruyer, bacon and one egg sitting on top! I recommend splitting it down the middle and let some of that egg white and yolk drip and soak into the sandwich. \n\nHeads up, it takes a while to make so I if you are in a hurry probably not a good idea to order it. Also it should be ingested slowly enjoying each bite, not like your regular egg muffin or bagel. This took some time to make so take your time savoring it.\n\nFYI the coffee is pretty good too. Its no blue bottle but definitely a righteous competitor.\n\nThis new option on yelp that allows me to write a review from my phone is pretty cool.", "author": "Hector S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-08", "description": "I've come here a few times before and have had better experiences. This morning, having gotten avo toast with an egg, I was excited to settle in for a productive morning. Unfortunately, they have no wi-fi, which means getting any work done will be tough. They also took 18 minutes to bring out my toast (the little sign with your order number also records the order time), which was both cold and burnt. I'm not going to give it two stars because the coffee is usually good, but seriously Réveille, step up your game - there are too many alternatives for you to compete with.", "author": "Katie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Oh my goodness, awesome. Really great coffee, beautifully made, right temperature, extraction, lovely barista. Few outlets for the laptop huggers, big windows that let in natural light.\n\nLove the simplicity of the place. Clean wooden decor, spacious layout, centered service area, you're instantly seen and greeted by the staff. Even the menu board hanging above is straightforward with just its core offering - coffee.\n\nIt even has a nice comfy out door area (benches) with seatings that seats large group, which is rare in the North Beach Area ( cafes there mainly have small tables that seats only 2-3).\n\nThough I'm quite certain the ready-made Turkey & brie sandwich i got (from the counter wrapped in brown paper - marked with a T - for Turkey ) was actually Ham. \nThe piece of protein i was chewing was pink, and didn't really taste like how turkey usually tastes). Luckily, I didn't offer it to my muslim friend who I was buying lunch for, and had it myself instead.", "author": "Lianne M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "My Favorite Coffee Shop in Town\n\nI am not a frequent reviewer but my time at Reveille Coffee shop has prompted me to write this. Walk into this coffee shop and expect to find the following:\n\n- Friendly Staff - Especially Jamie. She's awesome\n- Great coffee. \n- Impecable service \n- Beautiful service ware - cups, mugs, tea diffusers etc\n- Brilliant setting - windows EVERYWHERE\n- Amazing food - check out the quinoa bowl \n\nThis spot is doing it right!", "author": "Jason H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "Fresh pastries. My husband and I ordered the pecan pie tart and shared it. Fairly expensive but it was really good. Not great, but really good.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "The structure of the shop felt welcoming with natural lighting coming in from both sides of the shop.  The cashier and baristas were friendly, and the latte was delicious.  Plus, they made a heart on my drink.  As much as I try to hold my poker face, deep down inside, I die of happiness when baristas make pretty art on my lattes.", "author": "Lynn L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Réveille is my go-to sit down coffee shop when I'm in the North Beach area. The inviting space is airy, cozy and filled with abundant natural light. Ample seats are lined up against large windows along two perimeter sides of the shop, allowing patrons to coffice away or people watch at leisure with great views of the surrounding neighborhood. My usual cappuccino order here has always been executed well, with impressive foam art to boot, by friendly and efficient staff.", "author": "Jay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "This is a review for their quinoa bowl only! I was disappointed with the portion size, the amount of headliner \"quinoa\" in the box, and lack of flavor. The amount of quinoa sprinkled on was similar to the amount of other toppings: pumpkin seeds, acorn squash, and grilled cauliflower. The flavor for the entire salad was bland, the dressing was more oily than lemony.  Other than that, the warm environment, the compostable utensils, and large windows made this newfangled coffee shop cute and worth going back for their latte art.", "author": "Nancy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "Great folks-thank you for not being pretentious baristas!!! Tasty coffee, very pricey but at least it's good! The music is pretty terrible but that's what head phones are for. Really excellent location! High marks for these peeps!! Thanks!!", "author": "Nik H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-10", "description": "I used to be somewhat obsessed with this place when it opened because it was the best coffee in the immediate area, but have since fell out of love with it.  The main reason is that over time they have created this atmosphere that feels a little exclusive, a little pretentious, and maybe a little unwelcoming.\n\nThe people behind the counter aren't necessarily mean, but I always get the sense that they're just being \"friendly enough.\"  I don't know, perhaps I'm not the type of clientele they're trying to cultivate.\n\nI would say the coffee is certainly better than The Station (next door), but in my opinion it is not better than other FiDi spots like Coffee Bar or Coffee Cultures.  It certainly is no Blue Bottle.\n\nIf you're going to go here, I actually recommend going to their truck, which is like a 2-3 minute walk away.  The coffee is still good without the weird cooler-than-thou feeling.\n\nBut really, ever since Coffee Bar opened their location on Kearny, I don't find that there is much of a reason to come here anymore.", "author": "Jon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Great spot for a quick coffee, reading a book, catching up with friends, sitting in solitude, grabbing a quick bite.....Reveille has an open and airy space that can be deceiving from the front door.  Located on the corner of where Pacific, Kearny, and Columbus meet, the front door is the tip of a triangle and that tip opens up as Columbus and Kearny spread their separate ways.  When walking in, don't miss the doggy treat jar if your dog is waiting outside for you!  Excellent coffees and food menu items.  Brunch favorites include the egg sandwich with bacon & kale (add avocado and ask for it to be cooked with olive oil instead of butter for a fun twist!) and fried egg with avocado on toast (i like to add the kale and leeks to it for more of a filling brunch option).  \n\nReveille also has a truck just a couple blocks down on Pacific/Sansome that opens up bright and early every weekday (at least it's always there when I walk down to work around 7:30am).  The food truck has coffees and pastries for morning cravings.", "author": "Naomi P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-05", "description": "If I were rating this place on the quality of the food/drinks and ambiance, it would get a 5.  I could even look past the ridiculously high prices as I realize this is San Francisco and the cost of everything is ridiculous.  I cannot though look past the rudest customer service I have pretty much ever experienced. Each person I have encountered has been so unfriendly and rude that I almost feel guilty for asking for something to eat or drink.  They seem to have a new person working the register every week: Guys, something is wrong that you have such high turnover and each person is just as rude as the last and you should definitely fix it.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "Delicious coffee. They know what they are doing here and it shows in the espresso drinks and straight up drip coffee. \n\nI also love they're breakfast sandos. Eggy weggy with avocado on buttered toast? Yes! Really nice sheeps milk yogurt with granola and fruit too. \n\nSome of the best people watchin' in the city when seated at the window facing Columbus.  All walks of life at this crossroads of coffee, Italian food, strip clubs, techie offices and financial district thugs in their enviable attire.", "author": "Dusty B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Nice, elegantly simple coffee house. I was a bit disappointed in the pastry selection just because I was craving something different but then the girl said to try the biscuits for breakfast and it was divine :)  - soft, flakey with jam mmmm", "author": "Tere C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-06", "description": "Bad place to work or to have a  drink. \n\nThe place close at 6pm, the kitchen close at 3:30. At 4:30pm the staff already start to clean the place. Moving chairs next to you. Mopping, cleaning the kitchen, the coffee bar, everyone around you gives you the feeling that you need to go and you disturb them and there is still at least an hour before closing!\n\nI will never return and it's too bad because the coffee was good.", "author": "Shay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "One of the best stops for latte and quick snack. The atmosphere is super Brooklyn-Hipster and the coffee is top notch. There's plenty of searing to relax and look out into the street, great location with he view to the Financial District, and all the tourists that pass by. Don't worry they won't come in, as those creatures only drink Dunkin Coffee for $1.75. Come on in, experience what real espresso and latte should taste like.", "author": "Vladimir G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "Savory sweet.\n\nHomemade granola was three stars. Rich and crunchy. Accompanied by slices of strawberries. Whole milk yogurt on the side. Bit heavy for my palette.\n\nHomemade peanut butter was four stars. Available on toast but generously given as a sample when asked. It's a guilty pleasure. But a pleasure all the same.\n\nHomemade salted chocolate chip cookie was five stars. Each chip came alive with the sprinkling of sale. So good. Not cheap for $3.50. Yet almost two cookies in size.\n\nGood luck trying to save some for later.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-24", "description": "came here for lunch. nice selection of made-fresh options. sandwiches come with a nice side salad. they have a hibiscus ice tea which is really nice. prices are reasonable, the space is really sunny, open and airy due to the wedge shaped layout (it sits on the corner of Columbus and Kearny) and there is outdoor seating too, but in general it's not super comfortable to eat in if you're not by yourself as there are only a few tables. the rest is counter space. staff is friendly. probably worth slightly more than 3 stars but the lack of seating lowers it a bit.", "author": "Bob U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "Really good coffee (I prefer it over blue bottle) and major perk is they don't up charge you for adding almond milk to your cold brew or drip coffee! Food is freshly made and packed with flavor (try the chicken salad sandwich or home made biscuit and jam). Their sea salt chocolate chip cookie is my guilty pleasure. Conveniently located on Columbus Ave and everyone who works there is friendly. It's my go to mid-afternoon pick me up spot! Thanks for getting me through the work day!", "author": "Sally S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "The perfect spot for an easy Saturday morning. I've been exploring North Beach coffee shops for years and this is one of my favorites. Best roasted beans for home brewing.", "author": "Regina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "I can pretty much guarantee that if something is brewed, it'll make my mouth oh so very happy. As such, I dutifully travel from coffee spot to coffee spot consuming the liquid magic the bean yields. \n\nStopped here on Saturday afternoon. Upon walking in, my superficial self already liked this place. The design is impeccably done and feels modern and hip yet casual. I ordered my usual; a non-fat cappuccino. It was delicious and strong enough to keep me successfully operating on the 3 hours sleep from the night prior. I sat outside to enjoy the lovely bay weather. They had 2 tables and 2 benches outside if you wish to do the same. \n\nYet another SF coffee treasure. Boom.", "author": "Kim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-01", "description": "This is definitely one of the cutest little coffee shops around.  I love the odd triangular shape of the space with its contemporary designs and friendly hipster vibe.  It's conveniently located right in the North Beach/outskirts of Chinatown area and only a few blocks away from the Transamerica Building... perfect if you want a change from your usual Starbucks or Peets coffee.  They don't have a very extensive menu, but the few items they have are solid.  The lattes are delicious - so perfectly made and artfully presented.  Coffee - strong and definitely hits the spot, especially during that mid afternoon crash time.  They also have a nice little variety of pastries and cookies.  Yup, definitely going to become a regular here, when work permits...", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-04", "description": "Went in here got a regular coffee and a ice brew.  The girl at the counter pours the hot coffee and puts it on the counter in a manner that spills some out and doesn't even notice or apologize.  Doesn't bother to fill it to the top either.  Then she takes care of my cold ice brew that she didn't spill.  after putting in creme and sugar taste it and its SOUR.  Sour ice brewed coffee.  The person who ordered the hot coffee also said it was sour.  It is almost like they didn't even bother to try.", "author": "Stevezee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "I experienced Reveille Coffee Co for the first time yesterday. Everything hits you just the right way when you enter in the beautiful space- the space is bright, the roundness of the menu is perfectly approachable, and the cashier was delightfully friendly. My latte was perfectly pulled, and the chicken banh mi was super tasty. \n\nThe ONLY thing lacking is no wifi. I would come everyday from the opposite side of the city if they had it!", "author": "Kelly E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "Nice little coffee shop, with tasty pour-over coffee. I was disappointed in their breakfast selection. Their breakfast egg & bacon sandwich ($9.50) is small, leaving you still hungry & nowhere near as good as the croissant breakfast sandwich across the street at The Station. They also didn't have orange juice, so I had to make do with an orange soda. Overall this is a great place for coffee & a pastry, but not so great for breakfast/brunch.", "author": "David K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "Yay! Finally a coffee spot near my home AND on my way to work!\n\nYes, I suppose there are other cafes around this neighborhood but none that focus on quality coffee like Reveille does. I came in the first time with Danielle M. on a Sunday afternoon - they are open until 5. I ordered a soy cappuccino which was made perfectly. The prices seemed on par with the quality of coffee and service. \n\nThere is some bar stool seating but nothing too comfortable. I wouldn't 'work from home' here. \n\nThey do offer some food items which looked really good so I will be back to try those.", "author": "Sara P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "Apparently this was a coffee truck that started out serving Four Barrel in the FiDi, then moved on up, to the north side, to a dee-luxe tiny little storefront, on Columbus. They finally got a peice, of the vegan gluten-free scoooooooooooone!\n\nThe place was off-putting to me at first because the design of it looks a little too Apple People for me, and the baristas looked intensely hipster from a distance. They turned out to be a couple of really nice guys though. \n\nNever had Four Barrel before, it's that lighter, sweeter, slightly fruitier? loamier? style that I'm not really into, but it's quality and has a good caffeine high, people who like that style will love it. It was drinkable, I didn't feel like I wasted my money. And between the strong coffee and the James Brown blasting 1st thing in the morning you'll be fully equipped to get on the scene like a sex machine.\n\nOnly real issue is that like nearly everywhere else in North Beach, you have to take out a 2nd mortgage to pay for some breakfast sweets.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "Just coffee for me but looking around looks like breakfast is good ! Good atmosphere here !\nThe espresso is interesting. Well roasted coffee and a unique citrus like after taste and a bit of salt ?. I would not make it my daily routine. I prefer the nutty flavors of classical italian espresso but I aporeciate the craft !", "author": "Olivier M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-08", "description": "I work nearby. This place makes some decent coffee but not as good as the Station across the street. The $13 turkey sandwich with bacon is great, but it's $13. \n\nPeople have been commenting on SF's new expensive artisan toast fad. At RCC you can get a piece of toast with peanut butter & jelly for $4.50. It's that kind of place. Fried egg on toast, $4.50. \n\nFor good food or coffee I'd suggest Brioche around the corner or the Station across the street.", "author": "Melville M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "This place is fantastic, amazing environment, great service, and the coffee lives up to the fables!", "author": "Drew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "Super chilled out place to sit and read or work for a couple hours. The coffee beans are top notch and the baristas are really nice.", "author": "Ravi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "I loved this place. They have a small breaky/lunch menu and obviously coffee options. I had the chopped salad- romaine lettuce, peppered salami, hard boiled egg, provolone, cannellini bean, parsnip, carrot, and red wine vinaigrette. Great flavors & textures. Tasted very fresh & all the ingredients complimented each other well. I especially liked the little cubes of cheese & salami. Cool spot with several healthy food choices. Looking forward to going back & trying one of their sammies & the giant sea salted chocolate chip cookies I unwillingly resisted. \n\nFor the full review please visit:\nhttp://consumingcolumbus.blogspot.com/2013/05/reveille-coffee-co_8.html", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Reveille is a really cool coffee shop on the edge of Chinatown and the Financial District. It's nice and spacious with tons of natural lighting. \n\nThe baristas are nice and friendly. And they have real food. Like, real, real food for breakfast and lunch.\n\nThe quinoa salad and kale salad are SO good and fresh.\n\nDownsides: no wifi. No chai lattes.", "author": "Paulina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "One of my go-to coffee places since it opened. The service has always been friendly and quick when I stop by mid-morning for a coffee break. Love the latte art (and I'm a sucker for it too!). I like what they did with the open space with wood floors and large windows. Not many seats, but there haven't been many people in here when I'm here on weekdays. Good place to sit and look out on the street and get some work done.", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "My morning walk to work just got a little better. For the last six months I walked by the sign on the window that teased me about a new coffee shop opening up in the fall. I walked by hoping each day that that day was the day but my wish didn't come true. Of course the day that it opened I was out of town visiting my folks for Thanksgiving. Oh well. \n\nI was excited to walk by on Monday morning with a little extra time on my side. I stopped in and ordered a soy latte with a coffee cake. The space is nice and open and everything seems really clean. The staff was friendly enough but they all seem to have the same expression on their face as they greet you. It's as if they are wondering if you will become one of the regulars that they will get to know and befriend as time goes by or if you're just there to judge the new corner coffee shop. \n\nThere weren't many people when I stopped by around 8:20 and my coffee was ready in about five minutes. I had never tried Four Barrel Coffee before and I must say that I liked it. I love that when it was handed to me, it was the perfect temperature for immediate imbibing. I'll have to try it some more to really get a good feel for the flavor. I walked all the way to work sipping a little while i waited at red lights. When I got to work I still had about half the latte and the whole coffee cake. I'm so glad I got that coffee cake . It looks like it has pistachios and raisins. it has a great texture and consistency. It is moist but not too buttery and complements the coffee perfectly. \n\nI saw they also make breakfast sandwiches. I will definitely be stopping by here again soon.", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "Cool space - open, airy, bright with windows all around - great for people watching.\n\nHad the cappuccino, very interesting flavor with a nice fragrant.  It would have been great if it was hot, not sure why it was just warm since they made it to order.\n\nLook forward to returning and trying some of the food items.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "I am love coffee. I've had Intelligencia in Chicago, Blackbird in Milledgeville and coffee from all around. This is the best coffee I've ever had in my life. I can't believe it. You have to go to it. I had a latte.", "author": "Pete K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "BEST AVOCADO EGG SANDWICH EVER! That's hands down the truth.\n\nLucky for me I work around the corner from this place - I'm pretty sure it's just eggs over sliced avocados on toast but damn, there must be crack or something in that sandwich! It's F**KING OUT OF THIS WORLD.\n\nok the coffee is pretty damn good too!", "author": "Teresa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "i'm always on the lookout for new cafes.  this one was perfect for a rainy day of studying.  since reveille is on a corner, it gets a generous amount of natural light - yay!\n\ni walked a little over a mile to get here, but it was worth it.  coffee wasn't particularly delicious, but it absolutely got the job done, as i was pretty jittery after half a cup.  to be fair, i did have two shots of espresso before coming, but those two shots are a necessity as a law student.  as with most cafes in the city, i only wish this one were open later.\n\nfood is pretty good, but not cheap.  if you're not too hungry, the yogurt + granola + pomegranate is filling + yummy... and i don't like yogurt that much.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "I decided to take the day off work and wander around north beach. Looking for a place to charge my phone, and have a drink I wandered into Reveille. Im not much of a coffee person and it being a warm day out, I ordered an iced chai, not expecting too much...but it's absolutely great. A good mix of not being too spicy nor too sweet. I will be back!", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "I am so happy Reveille opened a store.  I'm a big fan of their coffee truck, but it's a little out of the way for  me to go to all the time.  This location is perfect for those of us who walk through North Beach to work. \n\nYes, their coffee is delicious.  What I wasn't expecting was for their food to be delicious too.  They've expanded their pastry selection that they serve at the truck and have added a small menu for breakfast and lunch.  I got the granola and yogurt, and it was hands down the best  granola I have ever had.  It's homemade, and has almonds, pistachios, honey, and they top it off with fresh pomegranate.  I can't wait to try the rest of the menu. \n\nWhat really sets Reveille apart from the rest is how nice the guys are that work there.  Not just polite and cordial, but actually friendly.  And they certainly aren't your average judgy hipsters that seem to work at most of the other fancy coffee shops in town.   It's 7:30am and I'm heading to work (yuck), I just got off Muni (double yuck), and I haven't had any coffee yet, so I  really appreciate it when the people at the coffee shop are friendly.    I have a feeling Reveille might become part of my morning routine.", "author": "Nicole G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "Add these guys to the single-digit list of 5 star espresso places in the city outside of the mission.\n\nOk Ok Ok, I don't go to the mission for coffee so that's why I'm qualifying this. I live on the north side of market and our selection is limited to what I've counted as 5 places. \n\nGet the espresso. Just.....Just do it. It's a really really good shot. They have the appropriate equipment that I only wish I could afford at my apartment. They have the skills and an awesome story about how they got to where they are now.\n\nThe guys there are amazing too. Really nice, they have the ability to remember my name like no other place in the city. \n\nThe space is gorgeous inside. A truly great espresso experience in fidi/north beach.", "author": "Roderic C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-16", "description": "I must be truthful: I am a hardcore Blue Bottle latte fan. However, Reveille has quickly gotten up to my #2 spot. Their lattes are creamy, the staff/owners are super friendly, and the service is quick. This is probably why I come to Reveille more then the above mentioned. \n\nI also like their space and atmosphere, and even though I've only gotten lattes/food \"to go\", I can see myself enjoying my time sitting on those stools reminiscent of my times at Architecture Studio.\n\nOverall thoughts: A solid, dependable, local coffee shop. I want to come here to try their lunch sometime.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "Lovely spot for a light lunch. I dropped in with a friend and we ordered a few small plates of salad with yummy ingredients like farro, goat cheese, beets, and such. I wish the outside tables were a little more sturdy but otherwise, have no complaints. The floor to ceiling windows alone are worth one star!", "author": "Erin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-20", "description": "Some of the best coffee in North Beach and the space is absolutely beautiful! I've tried a few of their breakfast options including the yogurt, which had fresh cranberries and homemade granola, and the egg sandwich. Both were a great start to the day! Would highly recommend!", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Seriously... Best Coffee... Coolest atmosphere... Great Breakfast.\n\nThey have WiFi... which many cafes in SF do not have, and the coffee and drinks are literally off the chart. I am a die hard Starbucks guy... who just started work at Google in SF and found this place. And this is my place now.\n\nCoffee is so smooth and the guys running the shop are the same one's who have been here for the last 3-4 months which is continuity in the coffee shop world.\n\nLOVE LOVE LOVE IT!", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Stumbled upon this gem after a stroll through the rain with my date this past weekend. I love that this place is so simple and unpretentious. Very clean in aesthetics with white walls, black lines, and a light wood bar that looks out to the street. It's a great place to people watch and people watch I did as Santacon took over the streets of SF. So many interesting characters. Staff was very friendly and helped my date get a bag to keep his roasted beans dry while we braved the rain without an umbrella. I'm not a fancy coffee drinker so I was impressed with the coffee art. My mocha tasted great and wasn't sweet at all. I would definitely come back to hang out if I'm ever in the city again.", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Walk by this everyday but finally decided to give it a go. Really good food and service. Tried the Prosciutto avacado egg toast and also had a cappuccino. Both were perfect. I'll be going back very soon.", "author": "Mike J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "They have delicious coffee and a decent selection of breakfast options. We've tried the avocado toast and biscuit with jam and both are delicious. They also have friendly service and outdoor seating!", "author": "Hi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "Jackson Square is becoming quite the coffee lovers destination. Now with the Reveille (serving 4 barrel coffee) and the Station (serving Blue Bottle) on opposite sides of the same intersection of Pacific and Kearny, coffee lovers really are spoiled for choice. \n\nI like the clean layout and circular coffee bar here. Great coffee goes without saying -- I really think 4 Barrel is the best coffee on the market. At this point, it's really hard to say which of the new gourmet coffee shops I prefer. I guess I'll just have to bounce around to both. Not a bad situation to be in.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Good spot with very knowledgeable barista in an area full of chains or drip coffee makers.  Great locally roasted coffee using a Kalita Wave for their pour overs.  If you're in the area, definitely stop by.", "author": "Austin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "Reallyyyy great location and modern vibe.  I got the latte... Was alright, not the best, also not the worst. Also ordered Egg and toast with avocado, egg was perfectly cooked and very flavorful. Would go back", "author": "Connor B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-29", "description": "Pro: good cappuccino.   \nCons: very bitter and unusual espresso. Tasted like vinegar. \n\nNice little trendy spot, but had really hoped for a great shot of espresso. What they poured tasted like vinegar. I ended up filling the demitasse up with milk in order to be able to drink it. \n\nI also bought a cappuccino for someone else, it was pretty tasty.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-21", "description": "It is a nice bright space to sit in, just set expectations low on the java. Hit or miss. Last time had a lousy macchiato, way under-extracted and the lowfat or steam-watered milk didn't help. For the price it's not up to standards. There are better options very close by - Chapel Hill comes to mind.", "author": "T B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "I like to run, so this morning I ran around San Francisco (as I'm visiting from Denver) and up to Réveille. It seems like a very hipster place to be. With a  sleek interior and hipster baristas, this coffee shop is great for on the go people and hipsters alike. The coffee is awesome and they have free wifi, but I noticed a bit too much milk in my latte (at least more than I enjoy) and a sort of cold environment. Everyone who came in was a hipster, businessman, or wifi seeking computer junkie, all enjoying he coffee. Would recommend a latte if you like a considerable amount of cream, but the drip coffee also looks fantastic.", "author": "Cole H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-07", "description": "Personally, I love Reveille's coffee. Their Avocado Toast is phenomenal as are their chocolate chip cookies.\n\nThe reason I'm writing this (my first review ever) is due to the disappointment of them raising their prices. When I first started coming to Reveille about 6 months ago, a 12oz coffee was $2.50. Perfectly acceptable for a coffee. You could pay more for a pour-over if you wanted. Refills were $1.\n\nThen, maybe 2 months ago, prices went up. $2.75 for a 12oz and $1.75 for refills. Still, not too too bad. I'll accept paying more than Starbucks for good coffee.\n\nOn Tuesday, I walked into this location and saw that they finally created a 16oz cup! How exciting! When I asked how much that was, they said $3.50...eh, okay, not great, but oh well. I then asked for my 12oz cup and saw that they had upped the price again (within 2 months) to $3.00. $3.00 for a 12oz cup of coffee that's from a large thermos??\n\nNow again, I love my coffee and have no problem paying a premium for a good cup. However, Philz allows you to pick a roast and have them brew it for you right then and there charges $3 for a small and $4 for a large. The fact that Reveille is charging this price is simply disappointing, especially since it used to be $2.50 three months ago. \n\nI'll probably keep coming, though definitely less frequently. Jackson Place is still at $2.75 for a great pour-over, and the Philz Truck is nearby on Sansome.", "author": "Zack C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Id say I had the best tasting cappuccino I've ever had here. Wonderful surprise as I've been to every roaster there is in the bay area and Seattle.", "author": "David D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-05", "description": "- This place gives me creeps.\n- Ordered at 7:50- 1 drip small and one egg sandwich. From Love child of Abercrombie & Fitch catalog model and dirty hipster.\n- 7:53 - Received coffee from fore-mentioned Love child of model and hipster.\n-  7:56 - Sips coffee and analyzes weird layout and strange procedures of coffee house.\n- 7:58 - Wonders why albino automaton doesn't stick a hook on to a broomstick to open the goddamn windows.\n- 8:00 - Feeling hungry and wants his $9 F'ing sandwich.\n- 8:02 - coffee is gone.\n- 8:04 - AB/Hips are staring out windows at worker bees. Looks of wide eyed eclectic fashion boredom unblinking in the bright morning sun. Freaks me out.\n- 8:07 - What the fuck? Where's my Goddamn Food?\n- 8:10 - Looks at 2 kitchen fools in the back furiously working on something.... Is that my sandwich? It better be amazing.\n- 8:12 - I'm late for work. Someone will die.\n- 8:15 - Ask the female albino robot about my egg sandwich? She tilts head in Japanese anime unnerving way and says, \"It will be ready shortly.... Beep\" WTF? Does she have cameras embedded in her robot hair?\n-8:17 - Finally! one of the kitchen staff is bringing something ...!\n-8:20 - .... He unloads 20 pre-made breakfast sandwiches into a basket at the front counter...... !!!!!!!\n-8:20 1/2 - The laser beams from my eyes scorch the circuitry of the AB/Hip robots and they turn and twirl like confused iRobot vacuums stuck in a hallway.\n-8:21 - I say.... \"Are you serious? I've been waiting 25 minutes and you couldn't make mine first?!?!\"       W.... T.... F.... !     I tipped you AF&H assholes!\n8:23 - Finally a trembling member of the kitchen staff brings me my bio-degradable compostable container with half-hour egg sandwich within.... And leaves it on the counter..... I follow his head with my death vision willing his brains to explode on the walls in a bright crimson spray of revenge!\n8:24 - Pick up sandwich and walk slowly out of that unnamed place that should burn to the ground.\n8:25 - Walk by SF Station and see more goddamn hipster robots !! They are everywhere! They congregate like flies around excrement!\n8:30 - Arrive at work half hour late and opens container. Eww... This gruyere stinks. \n8:31 - Throws sandwich into garbage in disgust. Raw ass egg! Disgusting KALE !!!! Mixed with a tiny amount of bacon. Tastes like shit!  ARRRRRRGH!!!!!\nI HATE ABERCROMBIE & FITCH! I HATE COFFEE HOUSES! I HATE WEIRD ALBINO ANIME ROBOTS WITH NO SENSE OF TIME, AND LATE SANDWICH MAKERS WHOS HEADS DON'T EXPLODE UPON COMMAND!!!!  Damn it~!\n\n..................   1 star for the coffee. It was good.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-21", "description": "This place is all about a show-- the cold brew coffee and hot chocolate are average, at best.  Last time I was there, the hot chocolate tasted horrible, like maybe there was soap or something in/on the equipment.  And it was cold.  I discreetly spoke to the counterperson and was told that they do not give refunds, nor did he offer to make the drink again.  He did suggest the off-taste was due to using dark chocolate.... North Beach has many fabulous places for coffee.  Don't waste your money at this one.", "author": "Kelli K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "Everyone knows coffee in America is terrible, but I'm glad I found a place with delicious coffee. Reveille loses 1 star because of the staff -- I come here nearly everyday, usually for hours (and I buy a decent amount of food and coffee) and not so much as recognition or a hey, nice to see you again! \nWhen you tip they say nothing, and so I stopped tipping because it was the same outcome! \nNot saying I'm a superstar or anything, but it's nice when local businesses recognise regular customers, especially when there is competition right next door (blue bottle coffee). There are some staff members in here when you walk in don't even smile. I only come here for the coffee and to work, but it would be nice to have a spot to work where you are surrounded by friendly faces.", "author": "E B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "There is no wi-fi here which is disappointing if you want to get work done, but that only means coming here indicates you came for the coffee.\n\nThe ambience of the place is great-- I want to say very modern. And of the course the drinks-- the drinks are fantastic. Perhaps the best coffee I've had.\n\nPerfect spot to meet someone for a drink. Would gladly return.", "author": "Ceasar B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "Best Coffee in San Francisco. Period. \nTheir food is awesome too. \nPlus the Decor is very cool. \nOwners and staff are super nice.\nWhat else can you ask for? :)", "author": "A. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Certainly a coffee spot worth visiting while in the city!  Enjoyed the mocha and hot chocolate, both creamy and delicious.  banana walnut bread was pretty good too, nabbed the last slice.  Would come back if i'm ever back come back from NYC!", "author": "Jimmy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-10", "description": "Cute trendy little coffee shop. I got an americano and my friend got a regular coffee. Both were a bit expensive, but also delicious. The ambiance is nice and there's one of those cute curbside public seating areas right in front so we just took our mugs outside to relax. Overall I'd say it's a bit too expensive, but the ambiance was great so that pushed it up from 3 stars to 4.", "author": "Carlos M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "BEST breakfast sandwich ever! The bread, the gruyere, the veggies, the soft-cooked egg, the bacon...it's everything you could ever want in a breakfast sandwich. \n\nI've tried a few of the drinks and they are solid: the ice coffee was super strong and tasty, the chai is nice and spicy, the loose leaf tea is decent.\n\nReally awesome ambiance - the coffee bar is like a circle in the center of a triangle room. The only unfortunate thing is that it can get really hot and crowded during \"breakfast rush hour.\"\n\nThe service is sometimes very friendly and sometimes snobby - but alas it's a hip coffee shop in SF, what can you expect?", "author": "Melissa O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-19", "description": "ordered nonfat latte. It was made with lowfat.  When I mentioned I had ordered nonfat I was told they only had 1%. if I order nonfat and you don't have it, don't take my order for it", "author": "Brad C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-04", "description": "pretty good coffee! got some good spots to work at. chill vibe. staff was alright. would probably go again if i were in the area.", "author": "Vicki T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-29", "description": "Usually a long line but they make a great cappuccino. A nice addition to SF's boutique coffee shop scene.", "author": "1 D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "nice atmosphere good tea good location outlets for your devices, free fast wifi....what else could you want?", "author": "Max S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-02", "description": "This place is awesome. Friendly staff, almond milk lattes, delicious food! Loved the braised kale egg sandwich (minus the bacon) but everything looked great. The atmosphere is modern and trendy - but not over the top. I can't wait to return!", "author": "Blaine A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-08", "description": "I came in for a quick drink and found the coffee to be as delicious as the place is beautiful. The marble countertops and the all black exterior got me all choked up before I even ordered my iced latte. The place is very quiet as most of the patrons are busily typing away on their laptops and enjoying a beautiful view of downtown. My espresso shots were tamped and pulled to perfection, this place is truly a dream!", "author": "Christina E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "If you're looking for a spacious place to study with internet and coffee to keep you up, you can't go wrong here. Pretty hipster for the area but after spending countless nights in williamsburg for late night studying, I find this place comforting. it's bigger than most coffee shops in the area and has plenty of desk space to do work.", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-17", "description": "The food is pretty good but the service was bad. Took almost 40 minutes to get our order. They eventually gave us the meal for free. Came back next day and they basically shut down making food between breakfast and lunch. Again another failure. Maybe they'll get their act together soon. Not sure when I'll revisit for food again. Bummed since the neighborhood could use a good location.", "author": "Lewis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "This coffee shop has huge windows that bathe the inside with a lot of sunshine, which I like when compared to some cafes where dark and dank are the norm. They have a good amount of workspace seating with bar stools and bar tables. The Americano was great and piping hot. They also serve food items as well.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Great coffee, clean, quality food and friendly knowledgeable staff. Space is very quirky and presents some challenges with seating and mobility. The new parklet just added is a major value add, although it is at a very busy intersection.", "author": "Stephen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-19", "description": "Excellent spot for the perfect Cappuccino + croissant = A+ Love their avocado sandwich with egg or without.", "author": "Jessica V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Wonderful triangle shaped coffee shop! Excellent Ethiopian coffee and delicious/healthful breakfast toast!", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-13", "description": "Their lattes and cappuccinos are very solid (comparable to Blue Bottle), but their service is what sets them apart from most other coffee shops their level (because apparently you have to fight for EVERYTHING in San Francisco).\n\n Today I ordered a cappuccino and it was literally out less than a minute after I finished paying (usually it's not THAT fast but still very good compared to the standard), so I was motivated to give them a 5-star review!", "author": "Sally S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-14", "description": "Service is so dismissive. The people who work there CANNOT be bothered. Watch out for the blue eyed crystal meth looking guy. Food is OK. But can never justify going back to a place where you feel like you are doing them a favor by being there. Hard pass.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "I like the coffee. Way better than Starbucks. Comparable to the other cafes in the area. Cool corner location to people watch. The staff is friendIy and the place is clean.", "author": "Evan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "We stopped in here for a quick breakfast.  Coffee was excellent.  I had the avocado toast with egg, which was excellent.  It consisted of one slice toast with tons of fresh avocado and an over easy egg.  My mom got the egg sandwich with bacon.  It was also very good.  My mom didn't like it because it is somewhat spicy.  She didn't know that when she ordered it.  They really ought to warn you!  Also, their bathroom is not very clean.", "author": "Susan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "I wandered in here because I was looking for some lunch and found that it was not too busy ( not a good sign). However I decided to check it out because I was looking for a quiet place to eat and read. Tuna salad was simple but tasty. Just the right amount of dressing a nice flavor combination. The cafe was clean and had a mellow vibe.  If I return to this area I will eat here again.", "author": "Lisse Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Updating my previous review to note that they now have a frequent buyer card (yay!), their espresso drinks are divine, and I am in love with their simple biscuit with butter and jam. They also just built a beautiful little parklet on Kearny--a great spot to enjoy your coffee on a sunny day.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "Today I had both an almond milk mocha and a cup of coffee, along with the pb&j toast and yogurt and granola. I bought a bag of espresso beans as well.  Don't expect a sweet mocha here, they're using spoonfuls of heavenly cacao nibs! Regular coffee has somewhat of a floral/berry note, although smooth and even a hint of tartness. As for the granola, it's unusually crunchy and contains chia seeds.  The yogurt is a sheep milk variety, super creamy and delicate, along with beautiful strawberries and blackberries. As for the pb&j today, it's one piece of dense bread with oozing house made peanut butter and succulent strawberry jelly. I ate it like a steak.", "author": "MariAnne J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-28", "description": "Nice location and service overall. Dropped in to grab morning dose of mocha. The coffee were decent, but I do preferred taste from other coffee roasters instead. More of personal preference than anything else. The mocha is smooth with a clear hint of cocoa. I tend to look for a stronger bitter taste, but I can see the coffee would work great for someone with different preference. Would love to try what they have to offer besides the coffee.", "author": "J Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-08", "description": "If you're looking for a fantastic coffee shop on all accounts, look no further! Reveille has top notch coffee, sweats, granola, and folks who work there. My coffee always tastes delicious, the pastries and granola always satisfy, and the staff are all wonderful!", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "They have the best food in the area for both breakfast and lunch. I've often get the avocado and egg toast -- perfectly fried as well as salt and peppered egg. The waffle is also amazing -- served with warm buttered *real* maple syrup. I had the egg, gruyere, kale/leek breakfast sandwich, recently -- incredible! Their lunch salads and sandwiches are awesome, too. Everything is flavorful and healthy.\n\nThe coffee is awesome and they can do almond milk. They also have housemade vanilla syrup. \n\nNew parklet takes this place to the next level. Inside seating is not so plentiful, but there is amazing light throughout the day because of its location.\n\nI love this location of Reveille, the staff is so sweet, and the food and beverages so comforting.", "author": "Shilps A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-09", "description": "Incredibly rude barista who refused to honor my request for a little more milk.  Won't return.", "author": "Federico B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Fell in love with this coffee shop's interior and abundance of natural lighting. I ordered an avocado with fried egg on toast, a latte and a cup of hot chocolate. All superb, in my opinion. Friendly staff as well. Two thumbs up!", "author": "Jess N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-28", "description": "Generic overpriced food and bad service.  Good coffee but you can get good coffee at a lot of place.", "author": "Kaitlin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "When I worked on the same block, I really liked this place, and I'm definitely a picky eater.  They have very good coffee, consistently so.   I don't recall how many lattes I got from this place, and I don't really like to drink coffee unless I absolutely have to, but often times I ended up giving in.   Out of 20 or so lattes, pourovers, and whatever else I got drinkwise, all but one were excellent.  To be honest, I don't remember what the flavor profiles were like- it's been a year, but when I think of reveille, I think consummate professionalism and clean european aesthetic.   They also made a deliciously nutty hot chocolate with valrhona! of all things.  I really have nothing but good things to say about this place.   Even the servers that I knew didn't like me tried their best to hide it, but having been in various service industries for most of my life, I don't really expect everyone to treat me nicely or even engage me when they are working.\n\nOn to their food.   I had one bad thing at reveille, and I'll mention it first to get it out of the way.  It was a banh mi.   It cost normal 6 or 7 dollar prices, but it had a weird mayo that made it taste wrong.  I would have rather eaten a 3 dollar banh mi from chinatown, but at that point I'd already bit the bullet.   There were no pickles on it, and I think they subbed in some kind of coleslaw, but whatevs, it's your classic anglo american line cook experiment to make something that looks like \"ethnic\" food without knowing what the actual food contains.  But then again failing at banh mi is an actual fail.   It's carrot and daikon pickle, mayo, cilantro, jalapeno, (maybe some maggi), maybe fish sauce, and meat.   That's all folks.   Not hard to replicate, unless you wanna go through the trouble of making a pate, which to most american palates, is strange, so only a few people ever really bother with it.  So what I meant to say was, if it's not new american and it's on this menu, avoid it like the plague.\n\nEvery regular menu item they had was pretty much delicious across the board.  There was a persimmon quinoa salad with arugula and goat cheese vin.  SImple, stupidly delicious, and it used to be cheaper way back in the day.   The breakfast sandwich was really nice   I think it was basically an open faced egg in the hole with kale and bacon.   really good ingredients, good execution.    They had pretty excellent baked goods too- your classic chocolate chip with sea salt and the gooey inside, kougin amaan with chocolate (probably starter bakery). \n\nAnyway, the food gets a 7, the service gets an 8, the coffee gets a  9.5, and really, that's as good as you can really ask for in a coffee shop in this price range.   the west o branch of blue bottle is pretty on par with this, and that place is as professional and clean as you could hope for in a business.   Although blue bottle is more hipster friendly, when you think real hard about it, they're both in the same category.  And lest you think blue bottle suffers no missteps, saffron *cough* vanilla *cough* snickerdoodles *cough*  I'm looking at you.  No offense, Ms. Freeman, but saffron is such a clean flavor, and baking soda so forwardly alkaline- how could you hope to combine the two in a good way?", "author": "Zoobs L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-17", "description": "What a tragedy. A clean, minimalist ambiance paired with a really interesting cafe menu provides s great opportunity for this cafe to be a neighborhood gem. If only their staff provided service with a smile. If you simply want good coffee, Reveille seems to be a good choice. If you want good service AND good coffee go to The Station across the street!", "author": "vinney a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Very good coffee shop to relax and have bite to eat. Coffee is excellent and so is their food. I highly recommend their Drop Biscuits with Jam and the Poached Egg Sandwich.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-19", "description": "If you crave a $12+ salad that is too small to actually fill you up and too salty for you too actually enjoy, then come here and order the prosciutto salad. What a rip off. Now I need to go find a cafe and get a little something to more to eat to get me through the day. What a rip off.", "author": "KC F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-07", "description": "My latte was made perfectly and the coffee was really delicious. I have gotten used to the blue bottles and and stumptowns of the world and Reveille definitely competes well. Service was friendly and the place had a good scene too. Check it out!", "author": "Navid T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-21", "description": "$4.50 for an average pour over?! I think i'll take the $2.50 Blue Bottle pour over from the cute coffee shop right across the street. Poor service. 2 stars because it's pretty. But...never again.", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "One of the best expresso which I have tasted. And good expressos are scarce in United States. So don't hesitate to go there. The cappuccino is also very good. FORGET STARBUCK ANYWAY.", "author": "Lonesome T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "Had the poached tuna sandwich. Pretty delicious, if a bit oily. The ice coffee is great.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "Great, affordable coffee in a thriving area of San Francisco. I can't believe the pour over drip coffees are priced at what they are compared to Blue Bottle and Ritual. What really got me stoked about this place was not only the coffee, but the friendliness of the staff. They were extremely helpful with educating us about their coffee selection and even helped pointed us towards our way back. Great atmosphere, quiet and peaceful ambience, also have a pretty excellent food selection. I'll definitely find my way back here when I'm in SF again.", "author": "Eunice K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "I do think the workers at Reveille make an excellent cafe latte, serve incredibly delicious house granola, and provide solid service but I must say their prices are a little ridiculous.  Everything on the menu will run you more than $4. I like to come here with work friends for a morning coffee sometimes as the atmosphere is pretty calm. Located in the prime of North Beach so it's easy enough to get to.", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "Consistently serves the tastiest and smoothest lattes I've had in the Bay Area. It's also really bright and clean inside - a nice place to enjoy a short break. Come for the coffee - even their Four Barrel beans taste better than when Four Barrel brews them.\n\nAdded bonus: the Blue Bottle yuppies & tourists haven't discovered this place yet, so the line is usually pretty short.", "author": "Jon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "Dog friendly! Your puppy will love the jar of dog biscuits!", "author": "dan d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-23", "description": "The wifi wasn't working and the guy at the counter couldn't have been more rude about it. I expect better customer service when I'm paying that much for coffee.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "Ambling down Columbus I tried to get into Brioche for lunch but it was SRO and long line; so checked out the new next door \"RCC\" or Reveille. Terrific brisket sandwich on crusty baguette with soft, gravy-soaked interior, whiffs of wasabi /horseradish, arugula, caramelized onion and black pepper. A nice tang but not a hint of jalapeño. And on the side, more of the arugula, with radish slices and a little tub of lemony vinaigrette. Four Barrel coffee, nice personnel, fast service and a clean contemporary interior with acres of windows to watch the Columbus action complete a favorable first impression. Will be back to try the bkfst offerings.", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "Amazing coffee - love their cappuccinos. They have food too. I'm determined to become a regular.", "author": "Krista P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-20", "description": "Réveille brings your idea of what a San Francisco coffee shop ought to be to life. It's beautifully designed with the central area reserved for making various delicious and potent blends from around the world. The tables along the sides, flooded with natural light from the big windows, make Réveille a great place to meet or just sit and think. The guys working there are all nice and accommodating and the food is fresh, healthy and tasty to boot.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-16", "description": "Feeling generous so leaving 2 stars.  Coffee-5 stars.  Service is pretty good-4 or 5.  But please do not order your lunch or snacks here.  I ordered a PB&J, thinking it would be a sandwich.  I realize the name said toast on the menu, but I didn't realize that I was going to pay $4.5 for literally a piece of toast with some sad PB&J slathered on top.  Never again.  I think I'll stick to the truck for my coffee needs only.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "Great coffee. Cool cafe. Staff is always very friendly. On par with all the other new wave SF coffee shops, but maybe slightly less hipster.", "author": "W W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "Great neighborhood spot in north beach/chinatown. They have a short menu but everything I've had has been great. Good coffee you can get anywhere so go here for the egg sandwich with bacon. It's got an egg in a basket for half the sandwich and the other side is sauteed kale with gruyere cheese and bacon. Add avocado because you should always add it when given the opportunity. Pb&j toast is solid too and not offered at enough places IMHO.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "Cute modern place. I don't know what was here before, but it's a nice addition. Their coffees are really good. Had a cafe latte and the milk was soo creamy and frothy!", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "My new favorite coffee shop in SF! The coffee is amazing, and the food is so delicious! They have great lunch options, and really yummy baked goods. A definite must!", "author": "Meg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "It would be forgivable if you assumed that this was another overpriced, slow, and pretentious hipster coffee shop at first glance. I'm guilty of that first gleaning.\n\nHowever, this has become one of my favorite coffee shops in the city. The coffee is really good, fairly priced, and the staff is always impossibly nice. On top of all that, before I can tell them how my weekend went, my coffee is already on the counter.\n\nIf you're in the mood for a fancypants drink, get the dirty chai on ice.", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "This is a great spot to grab a coffee and light breakfast. The drip coffee's are amazing and the the egg-in-a-hole and yogurt-n-granola make for a perfect snack to go along with the coffee. it's not a great place to bring a laptop and work for a couple hours due to the type of seating they have  but it's perfect for a quick coffee and some great people watching out the large windows onto busy Columbus street in North Beach.  I'll definitely continue going there.", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "Amazing Coffee, quick service, and pastries from starter bakery. Fuck Yeah!", "author": "Max R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "The cafe latte are always presented in a delightfully artistic manner. The flavor is no less impressive.  Smooth, creamy texture and rich flavor makes it one of the best cafe latte in town! Definitely worth coming back for...", "author": "S T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "Great coffee from 4 barrel. Modern interior design, well designed for the triangular corner shape of the space. Not too many tables, most of the seating is at the benches along the windows. I'd come here often if I lived in the neighborhood.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "Awesome coffee, amazing breakfast egg sandwich and super nice guys running the place.", "author": "Gilad G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "Four Barrel Coffee---my favorite. Great location and minimalist decor. Still working out a few kinks, but happy they're here.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "i love the coffee. no complaining. i have only had their coffee from their truck. haven't had a chance to stop by the brick & mortar shop but i am sure i won't be displeased. it's awesome that you guys are keeping up momentum and have a storefront!", "author": "Donald G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-29", "description": "Been working from the neighborhood for about six months, and I've always been let down by the morning coffee experience (Happy Doughnut was a warm, greasy welcome).  I went to Réveille Coffee after it opened, and it has been a godsend.  A nice, friendly staff serving pour-over or drip coffee and delicious egg and kale sandwiches (which tastes better than it sounds).  It has instantly become my new go-to coffee shop in North Beach.", "author": "Geoff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-24", "description": "Good Coffee and very unique touch of artistry on the breakfast food. .  My take\n- Artisan sandwiches , with nice touch of coffee will make your day.\n- Bit pricey but you pay for the location, presentation of the food.\n- Like the ambiance.", "author": "Rajesh S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-04", "description": "No wi-fi. Seriously? That was frustrating since I had already ordered breakfast and wanted to do some work while I had my coffee. And all their food is super overpriced. Not a bad place if you just come to grab a coffee to go.", "author": "Maddy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "Best latte in SF. \n\nVery nice shop, modern but comfortable.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-31", "description": "Best / most unique Saturday brunch menu I've experienced in a long time. The coffee is killer. This place is a must go!", "author": "Scott S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-19", "description": "I like how they don't use blue bottle and provide some different choices for cafe goers around the area. I however am not a big fan of the space, it's a great space if you like to look out into the room, I personally prefer space where I can see the people inside the room. When compare with station SF, I will def say I prefer station SF that's right across the street. I had the Rwanda drip, it tastes OK. Nothing spectacular about it thou. And at the particular afternoon when I was at this cafe, the cafe is filled with annoying heavy metal music, it might have been appealing for another, but for me, that was enough to warrant me not coming back here.", "author": "Fung S. O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-15", "description": "The coffee is good and the location is great. However major attitude and a hipster scene. I don't need the pretentiousness- just wanted a great cup of coffee. I found The Station across the street to be way more relaxed and friendlier. They also serve Blue Bottle. I would go there instead.", "author": "Laurene R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "Best almond milk capp. And their pour-overs are usually very good, too. Nice interior, great parklet for seating outside.", "author": "Esther L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Had a soy vanilla late,  very good despite not being the biggest fan of vanilla late(more of a Carmel late person) it was surprisingly good. Excellent late art also.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-19", "description": "Love this delicious coffee.  Perfect temp.   Smooth.   Now I don't have to drive down to Hayes Valley for Blue Bottle!", "author": "Lee M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-11", "description": "pretty huge fail. \n\ni stopped by last week, ordered 2 sandwiches for my husband and me: the brisket ($12) and the turkey ($11). we shared the brisket first. it tasted ok, but it was TINY. like, doll-size. this might have been acceptable had the filling been generous, but it was not. (now, Little Vine's sandwiches are spendy but at least you get good value for the price.)\n\nthen, the turkey. a bite in, and both of us were, \"wtf?\" not turkey. it was some kind of fish thing, which we would have never ordered. turns out it was \"fish conserva,\" which, according to the menu posted at the store, included swordfish, olives, capers, and red onions. my husband felt sick from eating it. i ate mine, only because i was starving, and only because it didn't, thank christ, have the advertised red onions in it. (i guess they thought red peppers were close enough.)\n\nhere's the thing: when i'm paying $12 for a sandwich, i want it to be of value, either in terms of size or contents. and i want it to be presented as advertised. and finally, i want it to be the freakin' item i *ordered*. fail x 3. (and no, it was not possible for me to trek back to the cafe and say, ps: you gave me the wrong food. also, i know people make mistakes but the cafe was pretty empty so it's not like they were slammed with customers.)\n\nalso: the sandwiches came with a choice of a side. i ordered the farro and quinoa salads. the farro was bland, even though it came with some of my favorite ingredients (brussels sprouts and pumpkin seeds). there was also supposed to be yogurt in it, but good luck finding that. on the other hand, the quinoa salad, which  included persimmons and pine nuts, was fantastic. supposedly there was goat cheese in the dressing. couldn't tell, but perhaps that's what made it so delicious. unfortunately, portion size was again lame. the salad came in one of those small plastic containers that you get at the deli counter at whole foods, only it was half-filled. seriously chintzy.\n\non the plus side, the people who work there were very nice, and it's a beautiful space. but overall, a real disappointment, and at $23, a rip-off. i'd rather go to Station SF, where the food and coffee is fantastic and a much better value.", "author": "m r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-28", "description": "Best coffee in town.  I was a regular at their coffee truck since it first opened and am thrilled that they've also started a coffee shop.  Great location and beautiful space.", "author": "Anne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-22", "description": "These guys are awesome, their coffee is good. They have treats for local dogs. Soymilk available. No IV service yet but when they come up with that I'll sign up.", "author": "Erika L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "Nice, clean and friendly place. Staffs really relaxed, coffee is always great. Three outside bistro tables on the east so you can sit in the sun in the morning and enjoy your breakfast. Bacon egg and cheese sandwich comes with kale which was great.", "author": "Harry F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "finally a small coffee joint with excellent coffee and no condescending hipster attitude!", "author": "Pan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-24", "description": "this people look like they are all new employees", "author": "John M."}
