{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "How did I get so lucky to have Réveille Coffee Co. as my neighborhood coffee shop? Réveille is the perfect mix of hipster, modern and chic and located in the heart of the Castro. They offer full breakfast and a wide variety of sweet and savory items, ranging from avocado toast (because duh!) to scones and almond croissants. Their coffee is top-notch and the baristas know damn well how to make a latte look like a piece of art.\n\nDid someone say, \"On Wednesday's we wear pink?\" because at Réveille, two charming baristas - Oscar and Dan - coordinate their outfits (which are always on fleek) and fill the space with energy and create a sense of community I'm happy to be a part of. If you have the time, be sure to give them a visit and leave a tip for their excellent customer service.", "author": "Bryan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-17", "description": "Host/ess: n/a\nCashier: 1.0\nFood-taste/presentation: 3.2\nProperty-ambiance/decor: 3.0\n\nA very fresh and refreshing breakfast destination.", "author": "Rrr V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Little bummed right now from the misleading yelp page listing free wifi. I came here specifically for wifi and ordered my food and drink. After unable to find a network name and asking the barista, I found out the WiFi is only available on weekdays.\n\nUpdate: They gave me a partial refund but I guess there still needs a way for it to be not misleading to other customers.", "author": "Gabriel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "A spot that seemed to be dominated by people working, Reveille didn't have the same warmth that other cafes in SF have, but they still serve up a nice latte. Literally every table inside was occupied by one person on a computer or a phone, all in a line facing the counter. It felt like a satire.\n\nThat being said, the area in the front seems better for gathering with a friend and feels a bit organic. \n\nMy latte was solid, though there seemed to be something missing from my friend's dirty chai, maybe a little less chai than expected, as it was missing some of the earthy and spiciness we usually associate with dirty chais. Can't win them all, but still a fine choice.", "author": "Jess L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "It's a modern style coffee bar in the heart of the Castro district. I came here for breakfast one weekend morning and had the \"Shakshuka,\" a bold breakfast item that consisted of a poached egg that was swimming in chickpeas, some spicy tomato sauce, which I think had some jalapenos even, although my memory is a bit fuzzy. I also had one of their very smooth and strong cups of coffee.\n\nLet me just say that the Shakshuka and coffee did not go together like two peas in a pod. Next time, I'd probably opt for the more traditional breakfast sandwich (which looks delicious from the pictures), but I did enjoy all the flavors of the Shakshuka; it was great to try it once, but it just felt weird eating something like that for breakfast with a hot cup of coffee. Guess I'm just not used to it.\n\nA+ gold star for myself for a healthy choice though! I enjoyed the atmosphere here, especially in the morning with the electronic music playing; felt like I was in a fancy hotel lobby or something..ha.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "The epitome of the perfect coffee shop! Gorgeous interior design, friendly hipster staff, super high quality coffees. Great place to work with WiFi during the week- no WiFi on weekends! Only downside is their pastry selection is quite stale and boring, however the food menu is awesome. Order a PB&J...", "author": "Sandra L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "I love this place and they know it! It's mostly because of the outdoor seating, or the coffee, or the avocado toast ?!? Well I love it all... besides... 90% when we order to the table, there is some item that never gets to our table and then we need to go back and ask for it and realize that our avocado toast never went for order?! Not sure if it's the machine behind the orders or what but that part has happened so so many times while rushing to work that it's not even funny anymore! Oh well let's see how it will go next days, I will keep returning! Also, really do get the avocado toast or salmon one, is the bomb!!", "author": "Irina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "It is supposed this place opens at 7 am. Third time in a month I went to grab coffee at 7. 20 am and they are not open. They said are having some troubles with coffee machine. If this happens so often they shouldn't advertise they are open at 7 am everyday.", "author": "Monica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Reveille is an adorable coffee shop. There's a gorgeous outdoor seating area that's literally covered in leaves and whatnot from trees (it's even prettier when the flowers are blooming!). Great spot for people watching or doing some work. There's ample seating indoors too. It's a hip establishment serving up delicious coffee, and the staff are super friendly as well! \n\nI've tried a few items from Reveille. The coffee is pretty great! Not the best I've ever had, but it's a solid cup of joe. I've also had soy cappuccinos from here and they're delicious as well -- strong but not overwhelming. I had the avocado toast here the other day with a fried egg. It was lackluster PRIMARILY because of the toast. It was far too stiff and crunchy, which, with how it was served, made it very difficult to eat (had to cut it with fork and nice because of the fried egg). Mind you, the presentation was beautiful. It came out on a black chunk of wood. So hip. Ya know how we do in SF. If the toast was served on a different type of bread or better bread ya know, it would be perfect. Good amount of avocado and the fried egg was perfectly cooked. That's my only qualm. Wouldn't order the avocado toast here again but DEFINITELY would come here for coffee. Often.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "Beautiful place, very cozy, delicious coffee. Keep in mind that they stop serving food after 4pm.", "author": "Art K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "The coffee was phenomenal.  Though, I ordered to-go and they had me in a cup to stay.  So, I stayed.  I enjoyed.  It was nice, busy.... but nice.\n\nThe food looked amazing, but maybe well try that next time around.  The neighborhood is lovely, so you can also grab a to go latte and enjoy a walk around.  Again, coffee was delicious.", "author": "Susanna O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "Always looking for a great coffee shop to walk into. They have a beautiful entrance and outside sitting area and the baristas are very helpful. The coffee is very well made and the to go cups are creatively made! \n\nProbably one of my favorite places to go for flat whites. The inside sitting area is a little tight, but you can stay and study if you don't mind the limited space. There is WiFi but only on weekdays. I'll definitely recommend this coffee shop if you don't want your Phil'z down the street or Starbucks next door. \n\nI will definitely be back to try the food; which looks amazing.", "author": "Daw M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Delicious . Great price and high quality. I love this place. Lovely staff. \nRecommended!!!!", "author": "Hani G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "I keep coming back & I keep mostly getting an overly hot, unbalanced espresso drink for my troubles. Every month, or so, I try again. I'm either an optimist or a dope. Probably the latter. \n\nOther than inconsistent espresso drinks, this cafe is fine, but the outside seating is what does it for me. Without that bit of light and air, one would be relegated to a boxy, dark space (that I think actually is a garage-conversion) that would make a claustrophobic feel anxious. The often groovy, but just a tad too loud music doesn't help. It's a small space where patrons often come to chat while they eat/drink & one should set the music level accordingly. The test is if you can't hear what the chick at the register not two feet from you is asking, then the tunes are too loud. \n\n*good location\n*fairly clean loo\n*hit or miss on the espresso drinks", "author": "Bea B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-23", "description": "Very bitter coffee, not that friendly staff, and bad wifi. The opposite of what you want in a  coffee shop. Good vibe in general but lacking on the basics. They can do way better.", "author": "Noel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Great coffee and a good menu for food and snacks for being a coffee shop. I had a salmon and cream cheese toast with capers on it and it was delicious! I could have devoured two more. This was prepared already, or you can order other food items from their menu. Coffee selection was great as well and a very cute cafe with an outside patio!", "author": "Xi-Er D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Réveille Coffee is my favorite in the whole city!!!\n\nI usually go to their coffee truck in FiDi, but I ended up at the Castro location.\n\nI ordered the Quinoa Salad and the Avo Toast, which were both excellent. I was also pleasantly surprised by how big the salad was.\n\nService was excellent and the location itself is beautiful. I love the outdoor seating in the front. Perfect for the warmer weather. The only bummer was that they don't have WiFi on the weekends, so I couldn't really get that much work done.", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Really enjoyed the interior of this place but hot damn does this small space get busy. The coffee was pretty darn good and I thoroughly enjoyed the kind of decor on both the inside and outside. It all felt very comfortable to me!\n\nThe service was great, everyone was super friendly. However, when this place gets crowded you really do have to box your way out of this small space. Nonetheless, still an excellent option to grab some food and a drink!", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Cute coffee place in Castro. Stopped by for a latte and cappuccino the other day. Nice vibe, great coffee and bright place to get some work done.", "author": "Sudipto G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "Cute interior and exterior, lots of seating inside and outside makes this place optimal for getting work done. BUT there's no free wifi on the weekends -- probably because it gets crowded and they want to keep the flow of customers rolling. \n\nI had a cappuccino and avocado toast, both were good but the cappuccino wasn't as warm as I would've liked (nbd). Some of the customers and staff are kind of snooty here, I didn't get good vibes which is something I look for at local coffee shops. :(", "author": "Hana S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "Hey Reveille,\n\nSo I was looking for something for breakfast.\nSomething to jump start my day of work.\nSomething quick, something simple but also something good and somewhat hearty.\n\nThen I saw you. So I went. The Reveille Breakfast Sandwich looked pretty good so I ordered.\n\nIt was pricey, more than i was hoping to pay for my morning meal, but hey it was my first time with you so just this once and...\n\nThe breakfast sandwich was pretty darn good and it looked fancy with the egg baked into the bread and all. \n\nUnfortunately I can only speak to your sandwich because that's all I ordered this time. Yea I didn't order coffee. I know I am an evil human being. Next time I promise! Decor was nice, simple, quaint. I'll visit again soon.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Perfect place to study, bullet journal, read or fit in me time! The place is very cute and the perfect amount of loud. They have a very simple menu which I can appreciate. The avocado toast was amazing. Crunchy and a good amount of avocado! Not that mushed up BS where you don't know how much avocado is going on. It's simple with olive oil, salt and pepper. The coffee was good and perfect temperature. I hope to try the other breakfast items because they look amazing and smelled even better.", "author": "Caitlyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "This is one of the Reveille locations, which is located in Castro. I've been to the other location in the Dogpatch area and really liked the vanilla latte and the ambience at that location. Here at the Castro location, it is a lot smaller and dimmer. The venue itself is more crowded. There is seating outside which looked pretty cute but inside there's bar seating in the center and table seating lining one of the walls. \n\nI ordered an iced latte and it came in a very cute glass cup. The coffee itself wasn't very strong and the flavor got diluted by the ice very quickly. You can ask for the wifi password, and the internet here is very fast and reliable. There are no outlets here however so you should come here with your laptop fully charged if you plan on getting work done for a few hours. The music here wasn't my favorite so it got a bit distracting after a while and overpowering compared to other cafes. Overall, this wasn't my favorite studying environment although wifi was good. I do prefer the other Reveille location to this one.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "This is the extremely very close to castro street edition of reveille coffee.\n\nParking? You wish. There is the usual and semi mythical street parking, but like lot a lot of other things in the city you are best served by getting here some other way that does not involve driving. \n\nThere are a lot of two spot type table chair combos along with a long center counter/bar and a limited amount of super awesome outside patio style seating. Unusually for the area the outside seating is wooden counter and bar stools or ledges. That along with some excellent landscaping make the patio seating a very nice option. The inside non counter spots tend to fill up with laptop campers, but even so there is generally room for one or two more.\n\nThe decor is brand new and very welcoming. Lots of earth tones, warm colors and low lights, not to mention the rotating local art adorning the walls. The overall effect is very welcoming. While the coffee trends towards slightly better then starbucks quality that's not all that big a deal in a city with some truly epic coffee places especially given the starbucks level pricing. The menu items tend to be better then you might expect. The avocado toast is pretty much always a win, and is highly recommended as a noshable  selection. Service is the by now standard of order at counter and wait for order to be called out model. There may be a line but it moves quick and if it's busy they'll just bring the food out to you.\n\nSo with wonderful ambiance, a great menu and good verging on great coffee this is overall a great coffee hangout.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Very good and strong coffee. I drink it black and it wasn't bitter. I also enjoyed the tasty avocado toast. Croissants and pastries also are consistently good.", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "The coffee is so yummy!  The cappuccino art is on point!  The wait is not usually long, but there is often a wait as the coffee is very good.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "I am a huge fan of Mark Rothko's art, so naturally I was drawn to the branding of this coffee roaster. While visiting, I gave their cappuccino a try and I absolutely fell in love. It was wonderful to say the least. The cafe has wonderful interior design, but this time I had to opt for the outside seating - which was absolutely magnificent and in a great neighborhood of San Francisco!", "author": "Andrew U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-18", "description": "They don't have WiFi on the weekends nor allow you to get on your hotspot - a little passive aggressive. Good avocado toast, though.", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-10", "description": "Close to my house, but this is first time come here lol. The most impressive​ thing about​ this store is the pink table. but I actually​  like inside of this store,  from the design style and the food and the drink.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Reveille is a modern, hipster, and spacious cafe that makes one of my favorite cappuccinos ($4) in SF.\n\nTip: Free WIFI is only available on weekdays. For weekend visits, there's a speedy Xfinity hotspot for Xfinity/Comcast subscribers.", "author": "Hao H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "I joined a friend here the morning of Memorial Day and the place was \"line out the door\" packed. First sign this place was going to be good. The second good sign, the cute decor. The ambiance is very inviting without being hipster pretentious. Plus the staff is super friendly and helpful. \n\nLuckily even though it was crowded we found a small table in the corner. My only complaint here would be that seating is a bit cramped so this definitely wouldn't be a place I would want to come to work out of if busy. \n\nI ordered an Americano and Avocado toast. Even with as busy as it was both came out quickly  and were delicious! I think I may have found my new favorite coffee spot in the area.", "author": "Tarah P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Réveille is a spacious and cute café great for lunch, brekkie, or a quick cup of coffee/tea. At any time, you can find friends chatting over some coffee, individuals reading or typing away on their laptops.\nThe quality of their coffees and teas are excellent. Their salads and sandwiches are also great. The smokehouse chicken sandwich is delicious. The almond milk chai latte is rich and aromatic. I highly recommend if you are in the area.", "author": "Jem S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "I love so many things about this place. It's chill and all the food is really fresh and delicious, and it's a nice place to work with free decent wifi.  What a vast improvement over the nearby Starbucks. \n\nI'm dinging them a star because -- maybe this is petty - their farro quinoa salad has no farro in it. I've ordered that salad five times. It's a nice salad. But it's clearly \"farro and quinoa\" and there's never farro in it. Yesterday I even asked the cashier for the farro salad, and he said \"you mean the farro and quinoa salad?\" I said, \"Yes, please - there's farro in it though, right?\" and he confirmed. Alas, there was no farro in the salad. \n\nI really fucking like farro.", "author": "Becka R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "It had been a while since I was in the Castro, and I was on the lookout for a cafe.  Réveille is located on 18th St near Castro Street, and it's a moderately sized cafe.  During the times that I visited, I've noticed many people working on their laptops, and I've found it a good place to read; though it often seems popular, it's never seemed noisy to me.  The wood panelling and soft lightening makes it an attractive place to sit for a while.  \n\nMy go-to coffee drink recently has been the Americano, and I've liked the Americanos that I get here.  Sometimes, baristas can pull espresso shots that are too bitter/acidic, but so far, that has not been the case at Réveille.  They do offer a food menu, and while I haven't tried any of their items, the salad at the table next to me looked pretty good.", "author": "Keith H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "$4.60 and some change for the worst 10oz iced coffee. It's just ultra bitter and the service even more so! \n\nWake up Castro, this is not worth slurping down. Do yourself a favor and pass on this place. You're better off heading to nearby Philz or making your way to Four Barrels.", "author": "Brandon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Very nice and modern cafe and a go to when needing an afternoon latte or one of their delicious salmon toasts.   Good music and friendly staff.   90% of the guests are deep into work on their laptops on weekdays, which is not my fave.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "One of my go-tos for a quick healthy lunch. The salads are great - I prefer the kale salad. The avocado toast is super simple - literally avocado on toast drizzled with EVOO - but sometimes simple is best. The flatbreads are large, but taste mediocre. Solid matcha latte.\n\nThere are a few tables along the wall that can fill up quickly, and a communal table in the middle. Additional seating outside underneath a canopy of green. Beware this place can get toasty when it's warm out. The service was not the friendliest. WiFi works well during the weekday. There is a lack of outlets besides the one by the counter.", "author": "Eva W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "I'm shocked I haven't' reviewed this place because I've gone a ton. They have my favorite ice tea in the city. There's this crazy mint elderflower concoction they got that's incredible. Sadly you'll probably down it in 5 minutes and it's probably too expensive to get two.\n\nI like the avocado toast well enough but while the slices look prettier than a mash, mash stays on the bread better.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "Great coffee. I would have given this place a 4 stars. \n\nBut I asked for a large pour over but they stick to a tiny cup of pour over coffee. I end up grabbing another coffee on my way home. Not cool!\n\nCustomer is always right - build or provide a few sizes of pour over coffee like other pour over places. Will not come back again.", "author": "Clint D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "A nice, modern venue that draws a younger, professional crowd than, say, the Starbucks nearby, there's a reasonable amount of room to park yourself for a short time, whether at small tables or a communal bench inside, or in their glorious front patio that enables lots of people-watching.\n\nWhether it's espresso drinks or pour overs, the coffee is decent, and they also serve breakfast items in the mornings, plus salads, sandwiches, and flatbreads in the afternoons. If it's not crowded inside, it would indeed be a preferred place for me to visit whenever I'm in the neighborhood, except for the fact that some of the servers can be indifferent at best or full of attitude at the worst.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-01", "description": "Start the new year with trying a new coffee place. Unfortunately, Reveille(& many recent coffee shops that seem to be popular with hipsters and techies)fail to serve HOT coffee or cappuccinos/lattes. \n\nBut, they can make a doodle design on your expresso drink. They also make sure they have an iPad payment system trying to push u into a high percent tip before even receiving your foods/beverages when paying with credit card.\n\nNo, I'm not an old geezer who needs his coffee and soups boiling hot. I'm just a guy who likes coffee(all forms) served the way it's supposed to be.\n\nSo if you like a tasty luke warm coffee or espresso drink this is your place.", "author": "L D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "I love their breakfast and tea.  My favorite is the avocado on toast or their peanut butter and nutela with bananas on top.   I also like their salads and egg sandwiches.", "author": "Parastoo E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "Great food, wonderful coffee, friendly and supportive staff. Cute, chic, classy cafe and coffee spot! Convenient location and warm atmosphere. Highly recommend.", "author": "Zoe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Such a cute coffee spot in the castro!! I've passed a dozen times but never knew the name because of the beautiful jasmine that lines the awning of the cafe. \n\nI finally stopped in today with my friend and we ordered a cold brew and cappuccino. The cold brew was really good and came out in a cute mason jar! My friend really enjoyed his cappuccino as well and said it was strong but not too acidic. \n\nWe sat out in the front which was great to people watch, and they brought out our food. I got (of course) avocado toast which tasted as good as it looked, and he got the flatbread which was surprisingly big for $10-- would def order this if you are on the hungrier side. Great place to bring a book and sit outside with your dog as well, which we saw many people doing-- I'll be back to do so myself!", "author": "Allie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Oh such a pretty site. \n\nIt's hidden under a Victorian house on Castro St and it couldn't be any more perfect. \n\nIt seems like an enchanted forest when you first enter - with all the vines, greens, and wood that it's surrounded by. The lights make it super festive and all you want to do is sit on the wooden bar stools outside and people watch all day. \n\nThe rustic feel makes it super cozy even on a chilly afternoon. \n\nAnd the coffee...well it's impeccable. Ordered a hot latte. Just the right amount of caffeine to keep you going, but not too much to make you feel as though you're on crack. \n\nMake sure to take your time and embrace what's around you.", "author": "Mary B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "This coffee shop is truly a gem, an awesome addition to the Castro District. I stopped in for a morning latte, it's always a wonderful way to kick start my day. Friendly team members behind the counter plus prompt service. I truly admire them for taking time to carefully decorating latte art on to each coffee. As a result, the art on my latte is beautifully decorated. Coffee that is carefully crafted and artistically decorated is worth enjoying. A true symbol or a promise from the barista creating the drink. It means they truly care about customer satisfaction.\n\nPros:\nSpacious coffee shop withe more seating available. More seating means better capability to accommodate patrons sitting to enjoy their coffee and pastry. Overall, positive first experience here so I'll definitely be back.\n\nCons: NONE\n\nReasons for rating:\n- clean facility\n- prompt service\n- friendly team members\n- spacious facility\n- seating available inside / outside", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "Nice space. Bigger than I thought it would be and clean. Also if it were nice outside, the outdoor tables looked good as well (a little noisy because they are on  18th, but still pleasant).\n\nGot an decaf americano.  It tasted like a decaf americano. Friends got tea. It tasted like tea - but did come in fancy glass pots. \n\nAvocado toast tasted like avocado toast - nice and ripe avo. \n\nI saw a bunch of food come out that looked really good. I'd like to go back form breakfast/brunch/lunch.\n\nWasn't too crowded on Saturday at noon, but maybe that's because it was raining.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-27", "description": "Adorable space with a delicious and well priced avocado toast for SF. Great to work but no outlets for your laptop. Unfortunately the coffee wasn't great- lacks complexity and it tasted like the beans the coffee were brewed from were stale and/or didn't spend enough time actually brewing with beans. Bitter and watered down coffee- I'm still sleepy!", "author": "Katrina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "Intimate, quiet, cozy, and great vibes. We ordered the Biscuit with house made jam, Avocado toast, and Egg sandwich. First let me applaud them on the portions of avocado. I actually, truly, enjoyed eating avocado with my meal and not having just a taste like every other place teases you with. \nOur two Cappuccino's were also incredible. The taste was just enough to wake me up and not too strong where I couldn't finish it. The design also had me taking pictures. \nKeep doing what you're doing, you've got a happy customer in me.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "Oh, pretty little cappuccino, you make my heart sing! \n\nI just love, love, love it when there is a caring, fancy, possible coffee snob, throwin' down some precious gifts of coffee and steamed milk for coffee feen/lovers/fanatics like me! \n\nYou can get your fancy cappuccino, latte or whatever kind of coffee you happen to be craving here, along with a variety of breakfast items. I opted for that nice nectarine danish... but another time, I might go for one of those exciting egg sandwiches or something sensational from their mesmerizing menu! \n\nCan't wait to return... YUM.", "author": "Cassandra E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "Reveille is a cute little coffee spot on 18th St, a stone's throw from the hustle and bustle of Castro St.  Tucked away under a Victorian, it's easy to walk right by and not notice it's there.\n\nAtmosphere-wise, it's absolutely lovely.  Friendly staff, cozy seating, and a small patio ideal for people-watching.  Even on a busy weekend morning, I managed to snag a place to sit without much difficulty.\n\nUnfortunately, the enjoyment ended once my coffee arrived.  I ordered a mocha, which was was bland and gritty.  This surprised me, since mochas are awfully hard to mess up.  (Coffee and chocolate?  How could that go wrong?)\n\nI also had a bowl of yogurt and granola, which was fine but unremarkable.  The portion size was shockingly small for $7.  It was gone in just a few bites.  That was stingy even by San Francisco standards.\n\nAll in all, I'd say that San Francisco has better coffee shop options than Reveille.  I guess my standards are higher in a city with one of the most competitive coffee shop scenes around.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Out of all the reveille coffees this is my favorite.  Great look, always perfect drinks and good food.  One of the best almond iced lattes.  Great service.  Eclectic customers, hipster.", "author": "Diane V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "I was debating on going to Starbucks or Philz while I was in the Castro, which are close by from this cafe, but I'm glad I skipped out and tried something new. Enjoyed a delicious almond milk latte and avocado toast. Steep prices, but not unexpected when in San Francisco. The aesthetics of Reveille was simplistic and clean. The service was very fast and friendly, especially during a weekend morning/brunch rush. Will definitely come back when in the area and visiting Roha: Center for the Healing Arts (few doors down the street - also highly recommend).", "author": "Sofia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Smallish inside but really cool little spot. The avocado toast was pretty crunchy but tasted great. Latte was great. Everyone was nice and they had some outdoor seating.", "author": "Nifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-12", "description": "Come here every weekend to see my friends and have a cup of latte. It's my favorite spot with one of the best lattes, I've ever had! \nLove their tuna salad - portion is huge, very delicious!!!\nPlace is cozy, always crowded - Especially crazy on Saturday and Sunday. \nBaristas and cashiers are nice, always smiling and sending positive vibes. Beka and Alina - my favorite girls over there.", "author": "Mariia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "This cafe has a really nice atmosphere for working or just chilling with your friends. Service was quick and friendly. It's pretty small with an average of two people per table. \nBreakfast is served only before 11:30am. I came around 10:30am and there wasn't a line, but it was packed. Luckily I found one table open. They also have a beautiful sitting area on the outside.  \nI got the avocado toast and a latte with almond milk. They weren't special, but I would definitely come back to try out more of their menu.", "author": "Grace Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Wonderful coffee paired with a delicious biscuit and jam! My go to when in the Castro. Staff is always friendly and lines go fast. Great place!", "author": "Danielle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "If you come here you do so for the ambiance. A cup of mint tea can only be so good.\n\nI like the place though. Fast friendly service in a clean bathroom. \n\nOnly reason for a 3, and not a 4-star review is the cigarette smokers like to perch outside so the whole restaurant is overcome with cigarette smoke smell.", "author": "scott h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Small, local, with friendly service and a beautiful outdoor space. Simply perfect! And the Tuna salad sandwich is to die for! Yum!", "author": "Randy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "This is a solid place to go get some coffee and a quick brunch. I got myself a Cappuccino (pictured) and a Shakshuka which was really great although not ordering the Avocado toast required more restraint on my part than I thought. \n\nMy only real gripe is that they can fill up quite a bit over the weekend which results in not much place to sit around if and relax if you're the type to read a book or get some work done.", "author": "Gouthaman K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-04", "description": "I have always enjoyed grabbing a latté or just a good cup of joe when in the 'Stro. The décor is nice and they recently covered up the front area in vines for some shade.\n\nAlthough I am usually fond of this cute coffee shop, they do not handle the rush well. It's pretty much chaos. The staff come off as rude and cannot be bothered attitude.", "author": "Myron J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "One of my favorite spots to get work done. They don't have any plugs to speak of so come with a full charge but they do provide wifi. The vibe is chill and friendly and they have a nice selection of food items so that you can eat and not need to leave in the middle of a work session without filling up on pastries. I understand the points the lower reviewers are making but those things just aren't why I love this place. There are so many different reasons to enjoy a coffee shop and these are mine! Enjoy!", "author": "Justin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Cozy little cafe in Castro. Very nice atmosphere, good latte and sandwich. Friendly staffs and all nice people skittle around me. Good chillax place. I like the outdoor sitting which I can bring my bird with me and seeing the neighbors. Good spot for coffee or brunch.", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "I came today out of spontaneity and to study with a friend. I ordered an iced vanilla latte and it was refreshing. I loved the way they made it and how quick. My friend got a soy vanilla latte and she also enjoyed her drink. I came on a Sunday (& Mother's Day) so it was pretty slow but I enjoyed it. I was able to do my work. They do not have wifi on weekends though! I definitely would come back again.", "author": "Angelyn M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Came here to meet up with some friends for coffee on a Friday morning. At first I didn't recognize it because the sign is set back behind the ivy surrounding the patio area. It's a super cute coffee shop that gets fairly crowded. There was a bit of a line when we went to go order, but it went quickly. If you order food, they give you a number and they bring it to you. If you order coffee, you just pick it up at the counter.\n\nI ordered a latte and it was pretty good (and cute latte art!).\n\nMy friends ordered the avocado toast and grapefruit brûlée (which comes as two halves). Both looked delicious!\n\nTypical SF prices and good coffee!", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "I ate the chicken sandwich (but with green goddess aioli instead of whatever spread it came with) and it was sooooo good. The bread had crusty texture and superb chew, the chicken was fresh and really juicy, even the side salad was tasty. This is just the kind of modern, albeit pricey, experience I want from the hip Castro.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "This is an amazing gem in the Castro.  Great coffee, yummy food, super friendly staff and a fun vibe. You'll find good music, people working, reading books and catching up over great food and drinks.  This is a good place to go to get energized, be inspired and eat healthy delicious food.", "author": "Jeffrey E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "Quintessential San Francisco coffee shop -- minimalist interior with $5 mochas. Pros: cool vibes, quality food/coffee; Cons: small space, weird coffee flavor \n\nFood: My friend and I came in here for a coffee break in the Castro -- ordered a latte (~$5) and a macchiato (~$3). Lattes are absolutely enormous, served in an almost-bowl mug. You can tell they have baristas that know what they're doing, but whatever beans they were using that morning had a really strange flavor. It was strongly citrusy which tasted somehow off with the steamed milk. However, I'd probably give them the benefit of the doubt and commend them on having coffee that actually has a flavor of some sort. Would try again. \n\nAtmosphere: Beautifully designed, all wood interior. Classic SF vibes. It's quite small though, so not a place I'd feel working at for extended periods of time. \n\nValue: On the high end for coffee... classic SF prices. \n\nService: Cashier was kind! No complaints.", "author": "Deena M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "Reveille has been a staple in the Castro and while their décor and atmosphere is very welcoming, the staff cannot handle rushes very well. I was also very surprised that a coffee place could run out of cold brew...During warm summer days in SF, one would think a coffee shop would be well equipped with gallons of cold brew at least. Luckily, the nice barista recommended an iced americano for me instead. Cute place, but their ventilation system sucks. It was very stuffy and hot inside the café when I visited.", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-08", "description": "Ridiculously cute cafe in a ridiculously trendy neighborhood. \n\nUnfortunately, the parking situation is an absolute nightmare. So hard to get to. \n\nAfter circling around three times in neighboring blocks to find parking, at a crawl because of the auto and pedestrian traffic, mind you, I gave up trying to \"sit and relax\" in this cafe. But I was still determined to try their drinks. So I got dropped off across the street while the husband circled around some more (no choice really).\n\nMint Hibiscus Iced Tea - Just the right blend of mint and hibiscus. I added a bit of their agave sweetener to play the hibiscus up a bit and it is now my new favorite tea. \n\nCafe Mocha - very good. Could totally taste the coffee AND the chocolate.\n\nLots of cute guys. \n\nLots of peeps on their laptops too. WiFi must be free but I couldn't stay long enough to find out.", "author": "Kislev A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-24", "description": "Pros: I really enjoyed the ambiance- when I went, it was very chill and not crowded at all.\n\nCons: The barista was very awkward and couldn't answer any of my questions. The iced tea selections were really subpar- just black and hibiscus. I asked to make sure the hibiscus has no added sweeteners, just tea. It came out tasting like cherry cough syrup or something. Gross! They also have no wifi on weekends, which was why I came here in the first place. I ended up tossing the $5 tea and going to Starbucks down the street instead. It's a pity because it's such a cute location!", "author": "Brenna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "Walking into the fresh smell of roasted coffee is always a pleasure. My friend introduced me to this little gem during my visit in San Francisco, and I'm glad he did! I ordered a macchiato (about $3.25) and he ordered a green tea ($4-6). The macchiato is not what Starbucks goers are used to... Instead, it comes in a small cup with a cute design on top. It is an easy way to wake yourself up! The green tea comes hot in a little teapot. After adding honey to it, it gives your heart a little sweet warmth in the chilling temperatures of San Francisco.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "This is a beautiful coffee shop. It's got a really nice interior and a small outdoor area. I love coming here to do work/procrastinate. Just wish there were more outlets!", "author": "Henry Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Excellent coffee, great people-watching location lol, and apparently great toast, though I have not had the pleasure of trying the toast here.\n\nI ordered an almond milk mocha and got some work done at the \"bar\" area.  The mocha was great...creamy, fantastic espresso beans, and you can tell they take time to make each beverage.  \n\nI like how the place is very welcoming, too-from the baristas, to the open door, to the fact that people who come in here seem nice-Yes, they may keep to themselves, but they're all there to be at this it-spot (for the coffee, for the toast, to get work done, to hang, to check people out, and the list goes on).\n\nI was shocked at how many people came in the 2.5 hours I was there.  I have only been here twice but I like the area it is in and I like the coffee.  Will be back fo' sho'!", "author": "Monica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Awesome vibes with indoor and outdoor seating. Great for a few hours of work or grabbing coffee/tea with a friend or two. They even had looseleaf tea that comes in a teapot and mug - I had the puerh which was decent. \n\nNote: wifi is fast, but there are no outlets, so come fully charged if you're trying to work.", "author": "Inga C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "On a Saturday, mid-day, I was in the Castro looking for a coffee place. I first stopped at Philz but the line was too long and there was no seating. The typical Tesora would have been nice but I left exploring for somewhere else. \n\nI decided to stray from Castro St, and walk down 18th. That's when I encountered this gem. I noticed people chillin' in the vine draped patio area, drinking cappuccinos or having a late afternoon hot meal. Although this place appears to be primarily a coffee shop, it has a few hot dining options as well. Which is a bit hit or miss because when I'm having coffee, I don't really want the whiff of mustard. \n\nCool vibe inside--mellow acoustic guitar in the background, the patio greenery flowing inside, industrial looking grey concrete flooring, a long white bench with soft cushions, and most curiously wall-to-wall light brown wooden tiling which extended across the ceiling. In a way, it felt as though the ceiling and floor should be reversed. The trippy black and white tiling all across the counter added a nice contrast to the overwhelming wood theme. A bit on the loud side (with the typical inane chatter in the background), and the lighting is dim, so I'd say it's a place that's better for catching up with friends than working on anything requiring your focus. \n\nI ordered the latte and chocolate chip cookie. The latte was satisfying, smooth medium blend. The chocolate chip cookie was thick, with salt pieces on top; also satisfying. \n\nOverall, not a bad choice if you're looking to find a unique spot to meet up with a friend on a Saturday afternoon.", "author": "Behnam S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-09", "description": "I only come here when my favorite barista is working, and now that Rebecca has left I have no reason to be back. Her face is always so sweet and welcoming, and she takes time with every drink. She even remembers tons of regulars names and orders! \nI've been here tons of times when others have made my drinks, and everything was mediocre and/or had to be adjusted to be drinkable. \n$9 for burnt granola and $4.25 for a latte are a little more painful when Rebecca's not there!", "author": "Emma G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-13", "description": "This is San Francisco. You can get some of the best coffee in the nation here. Don't settle for Réveille. To me at least, the espresso is overpriced, lacking in flavor, and weak.\n\nThey've also branched into juices and juice shots. This means you can now pay $4 for a couple ounces of water mixed with turmeric.\n\nAnd the food is even worse (to me, at least). I've tried one of their breakfast sandwiches (the one with merguez), and on another occasion, my friend tried a different breakfast sandwich. Both were doused in an overpowering sauce and were just not tasty.\n\nAlso, some the staff can be pretentious. Asking for any modification to anything can get you a sneer. I once asked if they do iced cappuccinos, and was given a lecture on how they don't do that because it requires throwing away steamed milk. Couldn't they just not throw it away, or increase the ratio of foam to steam? Another time, I asked if it's possible to reduce the sugar on my matcha latte order, and was just told \"no, sorry\" (no explanation, though I'm assuming they pre-mix their matcha with sugar, which is fine).\n\nThat all said, the one thing that is worth trying, if you're already here, is their matcha latte. I get it iced, and it's delicious.\n\nFor people who work around Mission Bay, there aren't a ton of options. For people who live anywhere else in SF, I suggest trying something else.", "author": "Sravanthi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-15", "description": "Love the toast with avocado on top. They also have almond milk. Sweet decor too :)", "author": "Freya-Loki O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "This was my WORST coffee experience EVER. Worse was that it was my friends as well. We both are coffee enthusiasts and very disappointed by our drinks. The employees (both male) were not helpful at all. The register boy didn't know anything about the pour overs and the so called barista sucked at creating a simple latte. I ordered a $7 pour over and the register kid reacts with \"you sure you want that one, you know it costs $7???\" Man I know what I ordered don't need you to tell me how much money I want to spend on MY COFFEE. Oh and look at the bad quality latte I ended up picking off of the counter...", "author": "Citlali G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "Compared to the cacophony of the Columbus Avenue location where United Nations delegations pass through at alarming rates, this Réveille has a downright low-key vibe, and this is the Castro for Harvey's sake. It may be because I was here a half-hour before closing when all the overly caffeinated hipsters were already in rehab shelters for the night. I liked the look of the place with the front patio made for serious gawking and the neo-vintage cross-hatch wallpaper and faux-firewood accent wall made for the interior decorator in all of us (photo: http://bit.ly/1IlDYeL). I've heard tell of the fabulous Avocado Toast ($4.50/$6.50 with fried egg) and Shakshuka, a pricey poached egg with roasted tomato and chickpea ($11).\n\nBut alas, I never think about having an actual meal at Réveille, but I'll fix that misconception at some point. In the meantime, I decided to saunter in after a hearty bowl of Spicy Oxtail Pho at Mekong Kitchen across the street. There were only two laptoppers in the place, so I had plenty of choice as to where to sit. The $4.50 Mocha calmed my fiery digestive system in no time at all (photo: http://bit.ly/1OMqyMB). The Newbury brothers, Tommy and Chris, started Réveille in a delivery truck five years ago, and while they're not yet in the same playpen as Philz or Blue Bottle, I like the richness and finishing style they display with their coffee. Besides, they're not nearly as pretentiously elitist as they are at Sightglass. Oh no, he didn't. Oh yeah, I went there.\n\nCOFFEE - 4 stars...silky goodness in that mocha\nAMBIANCE - 3.5 stars...the trendiness comes off as trendy but somehow it works\nSERVICE - 3.5 stars...nicer than anyone at Sightglass\nTOTAL - 4 stars...give it up for the Traveling Newburys", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Avocado, egg, and coffee. Throw in a cute little shop with a cool ambience and friendly workers. What else do you need? When you walk into Reveille (reh-vay) coffee co, it gives you that feeling like you just found a good one. \n\nI don't know what it is about avocado toast that makes it so amazing. Yes I could just make it at home, but eating it at a cute shop is always better! There egg in a hole toast sandwich thing (actually just called egg sandwich) was super filling and delicious. It had bacon, braised kale and leek, and gruyere. The bread is toasted to perfection and the top piece of bread has an egg in it. So much simplicity going on, but so good.\n\nOnly downside would be parking and space to sit. It gets crowded so you may have to stalk people to get a table.", "author": "Maleah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "love this spot. \nGREAT coffee \nand good food. \nand an outdoor area!\nand the staff is 99% great as well. \n\nthey get 5 stars for that, but there is one french girl who is a total buzz kill. like she's too cool to smile or talk to anyone. she's such a downer that if i go in and she's working i actually LEAVE or wait for someone else to take a turn at the register.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "The avocado toast. \nIt's so simple, but so good. \nIt's so simple that it's actually kind of dumb how fantastic it is. \nIt's so simple that I fooled myself into thinking I could recreate it at home. \nI was wrong. \nSo very, very wrong. \nEverything I make looks like cat food. \n\n\nIngredients: Avocado, Salt + Pepper, Olive Oil, Acme Levain\nIt's $4.50.\nYou can also add a fried egg (I do) for an additional $2\n\n\nThis place is within' a downhill walk from my best friend's place.\nPerfect for those sudzy nights where I need to couch crash. \nEven better for those hungover mornings where calories and single-stall bathroom with a good flush are necessary.\nThey have great coffee here.\nSo great that even a person like me who appreciates creamer more than coffee can stomach it black. \nThough their iced tea is pretty on point and far better for the hangover curing process than a mimosa. \n\n\nThey have a few tables inside and a really nice, sunny patio.\nIt's super casual.\nOrder at the counter, wait with your number, then get brought back to life with this delicious dish. \nOne day I'll get something else here.\nLooking at you Shakshuka.\nBut until then, avocado toast dreams all the way.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "I had a rough morning at work, and decided to treat myself to lunch at Reveille Coffee.  I ordered the Chinese chicken salad, which was $12.50.  It turned out to be a pretty big salad, probably good for two people if they weren't too hungry.  Even though I was starving, I found myself to be really full after eating 3/4 of it.\n\nThe rice wine vinegar dressing is what I liked most about this salad.  Having fresh ingredients helps too.\n\nThe vibe, at least on a workday afternoon, is pretty chill.  Everyone kept to themselves on their devices.  I needed the quiet though.\n\nIt was too late for me to drink coffee (I'm sensitive to caffeine) so I will have to come back earlier in the day and get a cup.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "The matcha lattes were a delight. This underground joint isn't really the Castro vibe but is still hopping with the sleek urban outfitters wood vibe. Great service they really picked me up after having a bad experience at the nearby Philz coffee. Most of the people sit on the nice outside patio giving it a more pure ambiance.", "author": "Carmen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-24", "description": "Ordered a breakfast sandwich, they had a discussion in the kitchen and with the person who took my order, but never came to speak to me. So instead of bringing what I ordered, they brought it the way they thought it should be with no explanation. Even after I tried to correct the error they did declined. I returned the sandwhich and left, unhappy to have paid so much, and a $3 tip on top of it. \n\nThe place remains popular, but I won't be back. Therre are plenty of other places that serve with a smile to those willing to shell out $20 for a quick breakfast in SF.", "author": "Scott N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Very cute tucked away coffee house with food and excellent coffee. Nice friendly people work here! With outdoor seating this is the perfect place to relax and get a coffee or snack.", "author": "Victoria N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "The coffee a cafe reveille will wake you up and turn you around. \n\nNo matter your stripe, you'll feel right after this.", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "Cute little millennial spot on 18th Street.  I don't think I saw anyone over 25 years old there....working or sipping.  Laptops everywhere and nobody in any hurry to leave....\nVery SF with a hint of tattooed attitude.  The coffee itself was very good but not sure why they couldn't bring it to us considering we were sitting at the small counter as soon as you walk in.  Instead, I had to maneuver through a tight space when they called my order and pick it up myself.  Making my way around a tight corner filled with people in line waiting to order,--- when the coffee maker was less than 2 feet from us--- just pissed me off. This happened twice--once for the macchiato and again for the latte.  They served us the coffee cake and pound cake at the counter--not sure why coffee would be different.\nIt's these little things that annoy consumers. \nBlame it on clueless customer service.\nIt's amazing that yet another garage on this block has become a business.\nhttp://www.millennialmarketing.com/who-are-millennials/", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "They have excellent coffee, delicious hipster egg dishes on artisanal bread, and decent wifi. Prices aren't cheap, but what is in SF?  It's especially popular on weekends, but pretty easy to find a seat mid-week.", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-14", "description": "See my photo of the $4.50 avo toast I bought here that had a big fucking hole in it. Take your business elsewhere - I certainly will from now on.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "This place has definitely got the hipster vibes going! Definitely a nice place to go if you like cafe background noise when you're studying. \n\nI got a mug of coffee (love places that offer this) and an amazing bacon biscuit. Yum. They do eggs and other stuff for breakfast as well. We also snuck in one of the deadly cookies - yum! One of the cashiers is Danish - not sure why that's relevant, but it made my Danish husband very happy.", "author": "Jennie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "I came here on a Saturday morning around 9 a.m. and it was already starting to get busy! Modern, minimalist interior and a beautiful patio to enjoy your coffee outside. They serve breakfast until 1 p.m. on weekdays, but all day on the weekends!\n\nI ordered the avocado toast and a latte. The latte was good, but the avocado toast was amazing! They're very generous with the amount of avocado that they give you and the simple seasoning really brings out the flavor. The dish was beautifully prepared as well. Definitely looking forward to spending another morning here.\n\nUnfortunately, they don't have wifi on the weekends, so if you're looking for a good weekend study spot, you'll have to look elsewhere!", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-09", "description": "$4.80 for a cup of tea is bullshit, but it caught me off guard and so I did't walk out like I should have. The bitch at the counter took my $20, handed me $15 in bills and then dropped the two dimes change directly in her tip jar without even looking at me, and then told me to steep it for four minutes. Fuck this place.", "author": "Dale W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "We met a human here! My girlfriends and I needed some caffeine after a long day walking the sinuosity of the SF streets. We checked Yelp and this was the closest coffee shop with character we could get in Castro area. Then...deception...one person per table not even consuming a drink and occupying the space with their tablets. Horrible situation and metaphor of the online connected/out of line disconnection with other people. \n\nAnd then we heard a voice. \"Do you want to sit here, I gave you my table\", murmured a soft spoken Chinese from NY just transplanted to SF. At this point, the rest of the coffee shoppers were like asleep in front of their devices, so un-romantic. Honestly, Reveille..reveille-toi! this should be a place to gather, drink, chit and chat, not an extension of your work stuff. Anyways, coffee was awesome and all nicely designed, plus guess what? We became friend of this gentle guy who invited me to go next week to see the awesome views from his Jackson Towers apartment (check my review and get jealous:).\n\nNow that I think twice...this does not even seem a review for Reveille Coffee Co, but it is. I had a good time there, a nice drink, and the beginning of new great experiences. Keep it up and sack those who have roots in those chairs (without consuming).", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Really enjoyed the atmosphere - great location. Avocado toast was so flavorful and the orange juice was fresh squeezed. Great cappuccino as well. Next time will add the egg to the toast!", "author": "Tyler G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "One of my new favorite coffee shops in San Francisco with delicious, reasonably priced food that rivals some of the better restaurants / lunch spots, a great ambiance, beautiful decor, and good coffee. What more can you ask for? (Other than WiFi on the weekends, but I can forgive that because it has everything else that I want)\n\nMy favorite thing on the menu is their salad which is full of seasonal vegetables (usually roasted potatoes, brussel sprouts, etc) and parmesan cheese. For $11-12, it's filling and satisfying enough for a meal. I could eat this every week and probably not get tired of it.\n\nI've heard their avocado toast is also delicious and I'll have to try it next time I'm here. But definitely a great place to come for lunch, a coffee, and do some work or reading. One of my favorite coffee shops in SF!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "Great coffee - love the pour overs!!\nWould love to try their iced coffee on the next warm SF day.\n\nAmazing avocado toast. Definately need to go here more when I am in the area.", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Reveille Coffee Co. carries the best vanilla latte I have ever tasted! My love and infatuation for vanilla lattes have taken me from coffee shop to coffee shop around the Bay Area, but I think I've found a winner! My vanilla latte contained just the right amount of sweetness. In the opinion of a sweet tooth, I would say that this vanilla latte was more on the sweeter side, as some vanilla lattes I have tried can taste quite bitter.\n\nAlso, I really loved the outdoor decor of this coffee shop, as it felt very welcoming with the surrounding vines, modern wooden tables with stools, and beautiful hanging lights. The inside was very modern and organized as well. You can definitely come here with your laptop and get some work done, as I've seen more than 50% of the crowd here accompanied by their Macbooks - don't ask me about the Wifi though, I haven't tried it haha.\n\nIf you're ever in the Castro area, you HAVE to come here!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-22", "description": "Great coffee and good food but the prices are sort of offensive. Great ambience. Just wish they'd be a bit more reasonable in pricing.", "author": "Urban S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "I went today for lunch at their new location on Waller and Steiner.  It was really a great spot for a wonderful salad - and I saw a lot of great looking sandwiches at other tables.  I am a fan - I will be back. Nice neighborhood spot.", "author": "Marina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "My new fav place for lattes, great staff, sandwiches, and of course avocado toast if you're in the Castro, skip Starbucks and come here. They've also got giant yummy salad bowls. Didn't try them, next time for sure!", "author": "Christine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "In search of good coffee....excellent cortado.  Great artistry and strong tasting.  This Reveille is nestled between Starbucks and Peets on 18th. Street in the Castro neighborhood.  Definitely worth walking around to find decent, good coffee!  \n\nSeems like every barista works on perfecting the crescent!", "author": "Jewel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "It's so hard to keep up with these new coffee shops that specialize in espresso handcrafted drinks popping up in San Francisco, but I managed to finally come here after noticing the cute atmosphere the exterior provides with the string of lights over the outdoor seating. \n\nThe interior reminds me of say, if Urban Outfitters had a coffee shop. It looks like it takes place in a garage under a house and has a very clean and cool feel to it. My friend I was with got their regular cup of house coffee while I opted for the mocha. I don't think their mocha is for everyone because it's not really sweet but more rich in chocolate, but it was just fine for me. It seems that this is another popular spot for coffee, as barely any seating was available. They also serve cafe food here such as sandwiches and salads which is a plus. I wish this kind of coffee wasn't expensive, but if I had the right budget I would probably come here often.\n\nNext time, I'm going to try the dirty chai!", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "I wish my garage was this chic. Surprisingly bright and cozy, black and white Moroccan tiling, tables and stools perfect for some company or going solo. There's also some outdoor space in the front - perfect for people watching. \n\nI ordered the avocado toast (without the fried egg this time, but count me in on my next visit!) and a capp. The coffee was good, and the food was even better. I saw a dad cut a pastry in half for his daughters, and I have to say that I'm also looking forward to ordering some sugar behind the glass case.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Love this place. Super casual. Short menu but great food, smooth coffee and strong tea.", "author": "Nicolai S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Might be the almond milk latte I've ever had and I'm from Seattle. It's pretty damn good.", "author": "Elle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "A nice, modern venue that draws a younger, professional crowd. Such a cute coffee spot in the castro!", "author": "Mega Team R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "A great coffee shop in the Castro! I came here with my friend on a Saturday morning and we got two cold brews, an avocado toast with a fried egg, and yogurt with granola. The cold brews were great - not too acidic. The avocado toast had good bread and the egg was also cooked nicely. I don't even like eggs normally, but my friend insisted on protein and toast to nurse my hangover. My friend's yogurt was super filling - big bowl with lots of granola and fruit. Also sheep's milk yogurt is used and is very good.\n\nGreat ambiance - super chill baristas, crowd of people, and fun music. People were here doing work, catching up with friends, or just grabbing coffee on the go. \n\nWill be back for sure!", "author": "Steph V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Reveille is one of the most efficiently packed coffee shops I have visited... talk about maximum seating capacity. With free WiFi, delicious food, and fresh coffee, how can you NOT be tempted to spend an entire morning or afternoon here?\n\nFor breakfast I have tried the Fruit Waffles (MMM so delicious and fresh) as well as the Brulee Grapefruit (simple but now my favorite menu item). On another Sunday just after they stopped serving breakfast, my friend and I ordered their flatbreads. I had the Seasonal Flatbread ($6.95) which had asparagus, mozzarella, and olive oil. Simple and tasty! Perfect coffee shop foods, along with their salads and sandwiches. They serve generous portions of everything, which is awesome. \n\nCute decor, great music, friendly service, and a cool Castro vibe. The line moves pretty fast since their beverage and food options are conveniently posted and easily located as you are waiting in line. I especially love the little signs on each table that say \"Hi! Please join me at this table.\" It's the little things, right?", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "My friend has enjoyed this place so I decided to finally check this place out. Figured I should support some local restaurant especially places with good food and coffee. \n\nThe first time I went I got the avocado toast with a fried egg on top. Delicious! I know it's something I can make at home myself but it was reasonably priced and something healthy. I also got the black iced tea which was great for the warm days in SF. \n\nI've also gotten the prosciutto and poached egg, bruleed grapefruit, and the cheddar biscuit. I'll definitely say I'm in love with a biscuit.  \n\nDelicious food and very enjoyable.  People are nice and a great area to hang out (inside or out) and grab some great food. \n\nProtip: find a place to sit and grab some food.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-26", "description": "Orange juice too sweet (\"squeezed in place and we add no sugar\" yeah right!) espresso to sour, no wifi! No reception of LTE.\n\nOVER PRICED, OVER PRICED, OVER PRICED!!!!!", "author": "Avi J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "The selection of brunch items, teas, coffees is simple and exquisite. Plenty of indoor and patio seating.", "author": "Grey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Of course being the coffee addict I am, this is one of my favorite places to hit up when I'm around the Castro (Aside from Philz, of course)! \n\nWhile the entrance to this quiet and intimate cafe can be easily walked past, look out for the wide entrance and people lounging in their outside seating, plus you can't miss their deliciously inviting aroma! Once you enter, you'll realize how simple their place and menu are, yet it still feels very cozy and comfortable inside without ever feeling cramped or hot. \n\nTheir service is very friendly and fast, allowing me to grab my perfectly crafted drink before I even finish paying! Next time I'll definitely come back to try one of their enticing brunch toasts I keep seeing everyone relaxing inside eat!\n\nThis place is the perfect stop along 18th to or from Dolores Park, and I always make an effort to pop my head in and I never leave disappointed!", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Love this place!! Delicious coffee and food and the staff was very friendly. Will be back next time I'm in the city. There are such beautiful people there too.", "author": "Monica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Out of all the coffee shops I've been to in San Fran, Reveille has to be my ultimate favorite. At first, I fell in love with the modern design, then I shortly fell in love with the coffee and pastries (the most important part!). Located on 18th in the heart of The Castro, Reveille offers a variety of pastries, toasts, waffles, eggs, coffee and more. \n\nThe staff is extemely helpful and nice and there is ample seating inside and out. Looks can be decieving from the photos online... they don't give any justice to how big the space is inside. We opted to sit at the hightop counters that divide the counter from wall/booth seating... if you don't mind being close to others, this is a perfect spot.\n\nTheir cappuccinos & pour over coffee were divine, but I just couldn't get over the pastries. We ordered a Kouign Amann, which is essentially a cronut on crack and a biscuit with jam (homemade deliciousness). Even though I was a bit full from snacking on these items, I could have easily ordered another to go. They have 3 locations, I think the other two are in the \"city\". If I'm ever back in SF I will make an effort to check out the other locations... I miss everything about this place and highly sugest to all coffee & pastry lovers out there. Enjoy!", "author": "Juanita D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "If you're going to eat and work on the internet try durning the week or go somewhere else. Decors amazing, great atmosphere, food looks good, wanted something fruity so I ordered the hibiscus mint tea.... that just taste like mint, wouldn't recommend. I gave it only three stars bc I came there to be able to work and eat. But they turn off their internet on the weekends. I asked them if I could use it and they replied with you can try if we didn't already turn it off. Unfortunate they couldn't turn it on for me when. Not really interested in coming back bc of I just find that to be poor customer service. I wish I could have just returned my order and go somewhere else", "author": "Paige E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-29", "description": "Cute coffee shop in the Castro.\n\nThey offer a decent selection of coffee beverages and a clean space, although in my opinion can be a bit dark on the inside. Staff is very friendly and welcoming. If you plan to study here, come early or wait out. All the seats fill up quickly. I always come here for the good coffee and decent looking baristas :P\n\nPark further down the street, parking in front is rare to find.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "Definitely a go-to place for people looking to hook up and have coffee in the Castro. $5 drinks which may come with some coffee art. No free wi-fi on weekends (probably to discourage idlers taking up tables). Good luck finding parking.", "author": "Gerald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "In addition to their great coffee I love that they have a full kitchen with an excellent menu offering up very nice options that I've ever seen in a coffee shop. The gruyere, kale, bacon and egg sandwich is particularly satisfying and is now my ideal breakfast sandwich. The avocado toast was also very nice.\n\nI felt like we stepped into some cafe somewhere in Scandinavia. The inside decor had a slight retro vibe and the outdoor seating offers a nice hangout spot; perfect for people watching whether sunny or gloomy out. Also the staff are quick and efficient to boot. \n\nA great addition to the neighborhood.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "A small, busy, but clean space to work or catch up over coffee in the Castro.\n\nI had this placed bookmarked, and found myself near enough to try. The outside was bustling with customers who had just picked up their coffee and were either talking to their friends or headed off for the day. At 4pm on Sunday, this place wasn't too busy and seemed only 2/3 full.\n\nService:\nThe barista was friendly and very prompt at taking and placing my order. The drinks took some time to come out, but not terribly long.\n\nSpace:\nYour basic wood + white decor. Having some clean watercolor art framed along the walls gives it a nice, homier feel.\n\nDrinks:\nI ordered an herbal tea, and the person I was with ordered a mocha. While I loved my herbal tea , I wasn't a big fan of the strong coffee taste in the latter. Perhaps it's my undying love for chocolate, but there could have a been greater balance between the two flavors. One note: the barista wasn't able to fully explain the ingredients in the herbal tea. I'm not really sketched out by them or anything, I just wish they had a better explanation than, \"Oh yeah... it's... grassy?\" (Still highly recommend though!)\n\nExtras:\nYou'll have to ask the barista for the WiFi password!\n\nThe menu for food doesn't seem very extensive, but I might try some of the savory items in the future. I won't go out of my way to return here, but it isn't a bad option at all. 3.5 stars rated up.", "author": "Kat P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Surprised by how much I liked this place, since I'm beginning to shy away from the \"hip\" coffee places, because they tend to feel too sterile and get too loud. But I really liked this places vibe--dim lighting, aesthetic interior, moody electronic playing. Good coffee of course, and the coconut chia pudding was also really good--just coconut, almond milk, chia seeds, berries, and cocoa nibs, so didn't have the over-sweetness that you usually get with \"healthy\" desserts. Good wifi.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-04", "description": "Reveille's coffee is decent at most! The staff here is oddly pretentious, cold, and unwelcoming. It's a shame that their food menu is delicious! I often get salads here. Difficult to find healthy salads elsewhere in the Castro. Unfortunately, the coffee shop across the street closed, so I come here by default while doing laundry. I guess Starbucks is another choice.", "author": "John Philip B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-27", "description": "5 stars for cold brew so yummy\n1 star for the sad imitation of avocado toast + poached egg that cost $6.50 and made my heart cry. The avocado barely hung on to the disappointingly thin piece of toast.\n\nCute space. Most people in workout clothes on a Sat morning.", "author": "Carolyn F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "This is, hands down, The Best Coffee In The Castro!!!\n\nI say this having tried coffee from every other coffee shop in the neighborhood...There are other good places, but this is The Best.\n\nThe lattes are creamy, rich, fruity, and never bitter...just perfect!  \n\nThe baristas are friendly, fun, and go out of their way to be helpful, which really makes a difference to me as a customer.  For example, they aren't afraid to bring your coffee to you, if you are in a wheelchair...believe me when I say that's a rarity in this city!!\n\nSpeaking of which, Reveille is fully WHEELCHAIR-ACCESSIBLE...by which I mean that not only is this cafe set up to be wheelchair accessible, but it actually is in practice, too, because there aren't tables and chairs always blocking access.  And there's a good bathroom.  That's right, y'all.\n\nUnlike many of the other more hipster coffee joints in the city these days, Reveille has FREE WI-FI and no maximum-sitting-time.  They serve food, too, in case you're hungry.  I've only tried the plain cheese flatbread, and while it was tasty, I was surprised to find that it was spicy, as though there might be an ample amount of something like white pepper or possibly chili oil on it...This was not mentioned on the menu, and I wouldn't have ordered it if it had been, since I'm a wimp when it comes to spice!\n\nThe outdoor patio area is quite possibly my favorite people-watching place in the city, as it is slightly set back from the sidewalk, and therefore protected from the various degrees of cray-cray that one can encounter walking by!  \n\nDrink a lot of coffee?  They have a frequent coffee drinker punch card...Nice!\n\nThe only thing I would change about this coffee joint?  I wish it would stay open later than 8 pm!  Ahhh, c'est la vie, you can't have everything in life!!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-22", "description": "I paid $5.25 for a pour over that took 10 minutes and was halfway to lukewarm. It did taste good.", "author": "Alan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "This Reveille makes up for my \"meh\" reactions to the North Beach location. The couple times I've been to its \"O.G.\" store on Columbus, I've walked away with a humdrum reaction. Even before you walk in, the Castro shop exudes warmth and welcome. I recently dropped in and saw all these \"happy, peppy people\" (I sound like Lucille Ball) sitting outside sipping coffee and nibbling on toast. I figured, \"This has gotta be a good sign.\"\n\nI entered Reveille and immediately noticed the charming interior. Funky patterns, interesting prints (very West Elm-ish), light furnishings, and an open layout (albeit a somewhat low ceiling) make for a pleasant cafe experience. Not to keep bringing it back to their North Beach location, but... there, though they are surrounded by windows on a corner and the ceilings are high, the Columbus store is incredibly hot because of poor ventilation... not to mention the awkward shape to that store. The Castro location has a better and clearer set-up and plenty of fresh air shooting into the store thanks to a big open entrance. \n\nI recently had their chai latte ($4). It was tasty, spicy, and not too sweet. The baristas are friendly and maintain the cafe well. There is a small selection of newspapers for reading (I love that! I personally will always be loyal to print.). I will note that the place gets quite busy during lunch hour. I recently stopped by on a weekday around 11, and by Noon, it was crowded. I would also advise lunch-goers that this isn't the place for a quick bite. It appeared most folks' food took some time to come out, but they did look very appetizing. I'll have to come back to try some of their dishes some time. \n\nOverall, I'm impressed and pleased by this Reveille location. Whether you want to relax with a newspaper and a latte or catch up with friends over a light meal, this appears to be the new \"hot spot\" in the Castro.", "author": "James Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "I came here on the weekend a little after 11AM hoping to relax with some reading and a good cup of coffee.  I had no intentions of going inside since I always seemed to not notice it while walking in Castro.  It was pretty much chance that I saw this little shop wedged in the gayborhood.\n\nAll the seats were taken outside and when I got inside there was a lot of hustle and bustle.  Definitely a busy coffee shop.  Lots of gossip and \"what happened last night?\"-'s.  Anyhow, they have a very kempt and fresh staff.  Handsome, cute, etc.  I'm here for coffee though.\n\nInside, it was pretty compact.  Every chair and table was taken but there was an empty seat on the community table.  It had a pretty modern, sophisticated feel.  The black and white patterns were complimented with light stained hardwood.  I felt like I was in an open house for a fancy but affordable apartment that all of San Francisco had to go to.  Loved the overall design of the establishment.\n\nThey struck conversation with every customer; usually short and sweet but the customer in front of me had a pretty involved one.  I was mildly jealous that I wasn't part of it.  Though when I did end up ordering my coffee, we had at least a brief, warm, and welcoming exchange.  Hi-5 on the customer service.  I did not order any food and I felt a little too self conscious to order the chocolate chip cookie.  Kept thinking that everyone was saying, \"he's going to order coffee AND a chocolate chip cookie?\"  Eye roll.  I decided to only order the coffee.\n\nCoffee was a delicious brew from Heaven.  I just about set myself up in the perfect position to enjoy my book.  However, it was impossible to read in that cafe.  It was loud.  Very loud.  I constantly had FOMO feelings that I missed something important from all discussions around me.  I left after reading 2 pages.  Maybe I came at an impossibly busy time?  The pictures uploaded here seem to show a less crowded space.\n\nOverall, yes, I will come here again; but with +1 or +2 to save face.  You will have a good time with friends and possibly meet a new group of people to share stories.  I do hope to try the food next time.", "author": "Jared F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "My favorite coffee shop in SF! I love their environment, decor, amazing coffee and delicious food. I'm usually picky about coffee but this place just has the best beans! I got an almond milk latte and couldn't stop drinking it. For brunch, I ordered their breakfast sandwich which is the best breakfast sandwich that I've ever had! Not too oily and extremely flavorful. Their egg is on top of the sandwich! They also have brûlée grapefruit which was super refreshing and topped with candied kumquat (amazing!!). Definitely my go to spot in SF", "author": "Erica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Great coffee and amazing salads and sandwiches. We've lived in Castro 7 years, and this is definitely one of our favorite spots to open in the neighborhood!", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Réveille combines my two loves in SF: coffee and The Castro.  Modern, clean with friendly service and solid coffee.  I didn't try any of their food goodies, but just a plain old Americano while my Italian friend chose an espresso.  \n\nThe name is apropos... waking up on a Saturday certainly doesn't suck with Réveille.", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Great coffee, excellent and friendly service.  The food is quite good as well.  My favorite is the avocado toast with an egg on top.", "author": "Larry R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "Really cute place in Castro! I'm surprised the Starbucks next door gets as much business as it does when Reveille is right there. It's a pretty small place - if you're walking quickly, you'll easily pass right by this place. There's a beautiful sitting area just in front of the entrance that I'd love to enjoy a book at. It's also doggy-heaven here, inside and outside, so bring your furry friends!\n\nNo wi-fi on the weekends, so really do bring a book. The iced vanilla latte was decent and at SF price (AKA expensive). However, I'd come back just for the ambience/atmosphere!", "author": "Stella A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Nice little cafe to the side of Castro, I love the seats outside and the clean, minimalistic decor. Cool that they're open so early, and with wifi of course. But it's weird that you can't use their outlets to charge your phones/laptops so this was a minus for me. Also the wifi password cracks me up every time.", "author": "Katherine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "This was a very spacious place to grab a nice cup of coffee and a light breakfast. The avocado toast and egg sandwich were very good.", "author": "Jen G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "This place abounds with potential. Great location. But must we have techno music pumped into our faces? Should we have to shout to hear each other in a neighborhood coffee shop? And with network reception being consistently weak inside the shop, it's kind of important that wifi be made available. But it is turned off on the weekends. Hence the emptiness of the place today, Saturday. These days, I feel like if I'm going to spend over $20 on coffee, oj, and some food, wifi should be available so that I can sit and get a bit of work in while I eat. Kinda strange. Good spot during the week. Average food. But disappointed today.", "author": "Ed S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "Came here while visiting from out of town. My boyfriend and I both got the egg sandwich and both thought it was delicious. The sauce was so delicious, and really makes it stand out from other sandwiches. It was the perfect place to grab a quick breakfast while staying nearby. If I'm ever back, I'll certainly try this place again.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "A cute little cafe in Castro! The cold brew is solid here and there's a good amount of seating. When I was here though, it was a little warm... I don't think they have a/c? So it's probably not the best choice to go to spend a day getting work done on a hot day...", "author": "Janet H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Went to get some work done. The music inside was pretty loud, but the shadowed patio and the coffee were optimal. Nice avocado toast with the perfect touch of olive oil.", "author": "Riccardo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Good place to meet someone or get work done. Medium sized place with indoor and outdoor seating. Cafe hipster vibe. Order at the counter, and they bring the food to you. They have the usual cafe drinks with some brunch/ lunch food options, as well. Avocado toast is a popular item. Ah toast- 'tis thee overpriced rage these days.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Absolutely sublime - homemade (not too sweet compote/jam) slathered on a freshly cooked, buttery biscuit. Shoot me!! Soooooo good.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Ok, I like this place buuuuuut they only have two outlets! I just moved to this part of neighborhood and really needed to use the internet for work purposes. Soooo remember to charge your laptops!", "author": "Yvonne O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "Here a muscle bear, there a muscle bear. . . everywhere a muscle bear. . . Want to be able to actually sit at a nice little outdoor counter instead of being crammed inside the Country Bear Jamboree a couple doors down?. . . step over here guys. It's a great atmosphere and comfortable for all.\nOh, and the coffee is great as well. . . Everyone was really friendly (duh) and they have what looked like some pretty good sandwiches and salads going on. (I was interviewing while a trolled, I mean relaxed with my coffee)...", "author": "Greg S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Love this place! This swanky coffee shop has good coffee and food and even better vibes. Definitely one of my favorites after a ride at SoulCycle down the block.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-07", "description": "Having walked by dozens of times, I began to look for happy faces on the patio, and there they were! Bunches of them, happy people eating and drinking. That's always the best advert a biz can have, so in I went today.\n\nChill vibe, not over caffinated or anything like that, and the menu was interesting. And then I saw it; avocado toast, with optional egg...suddenly the air was filled with Ludwig van and I swear next time I'll take photos, but not today...gone too soon.\n\nAnd with a Dirty Chai (featuring that all time fave Espresso Shot), I'm one happy fellah!\n\nEnjoy!", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "So much yum, very yes! This place is super pretty, the food is great, especially the brûléed grapefruit and the avocado toast. The coffee is really good, and in my opinion, everyone who works here is really attractive. Maybe that's weird of me to say but I don't care, well done Reveille!", "author": "Allison H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I first came here on a Thursday morning to meet a friend over a coffee. The outdoor seating has great curb appeal, especially on the rare sunny day I went. The indoor seating was rather full every minute in the 2 hours that I was there but the vibe is awesome.", "author": "Eduardo P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Great place. Awesome people, brilliant food and amazing music.\n\nDefinitely recommend the herbal iced tea.", "author": "Keshav D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Hidden gem. Great coffee with even better fresh breakfast snacks. Love the avocado toast with a poached egg and the frittatas are perfect 'on the go' treats. Nice cozy comfy neighborhood spot.", "author": "Doug L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Located on the Castro! \n\nMy friend and I spontaneously decided to drive up to San Francisco, and we knew we wanted to hit up at least one coffee shop whilst we were here... Unfortunately, we had decided to be spontaneous around 7:00 pm.. so most of the coffee shops were already closed by then. HOWEVER! This lovely little place was open for a little less than one more hour! The kitchen was already closed up so we were unable to try their delectable looking avocado toast with Mr. Poached Eggu on top, but we were already thankful enough that they let us sit and drink coffee in their while they cleaned up. \n\nI got a pour over, and it definitely hit the spot. Made me feel prepped to conquer the world. My friend got the Dirty Chai which is basically a Chai Latte with a shot of espresso! The Dirty Chai had that unique spice to it! Tasted like a hint of cayenne pepper? I'm not too sure! But it definitely added a kick to the drink. I wouldn't be able to finish it all on my own though. \n\nBut forreal, this place is super nicely decorated inside. There is an obvious love for wood, and it made me feel very cozy and warm with my coffee. I thought the wall of timber was super appealing to the aesthetic eye! I would want a wall like that somewhere in my future home.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-20", "description": "I've been visiting Reveille regularly since they opened and the food is consistently delicious. I am very grateful to have a place with fresh greens and interesting sandwiches in the neighborhood. The orders take some time to prepare, which can be slightly anxiety inducing when on a short lunch break, but it's always worth it.\n\nThe weekday clientele knocks my rating down one star though. Maybe one of the self-absorbed  jerks manspreading at a four person table could create an app that would calculate how much food and drink he needs to purchase per hour of sitting there to make the business sustainable. How do they not understand that a cafe makes money by turning tables? Stop treating it like your live/work loft unless you are going to pay the rent. The next time i have to take my lunch to go because the place is an ibook parking lot, I might accidentally-on-purpose spill my coffee on a laptop so that at least there is one beverage on the table.\n\nThe new policy of no electrical outlets while still maintaining free wifi will surely strike the right balance.", "author": "Jenn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "Thanks for the excellent coffee,\nWith love,\nCoffee snob.", "author": "Kristie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Cool venue in a great part of the city. Vibe is chilled and doesn't have the myriad white boys with Macbooks trying to be the next big thing in Tech that most coffee shops in the city have.", "author": "Mia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "I tried really hard to hate on this place because there's so much damn coffee in the Castro (and now even more) but I caved. First of all, their patio is almost always in the sun and there's a nook my mutt just loves to curl up in for sunbathing while we sip. I'm a big fan of the ice lattes and cold brew and the staff is really great. We've since been in a lot and I appreciate how they always seem to go the extra mile (even if my husband heard my order wrong and told them the wrong thing or when our ticket gets lost and there's a bit of a delay). For breakfast food you can't go wrong with the egg sandwich, the toast with egg and avocado or the perfectly crispy biscuit and jam. \n\nCongratulations, Reveille you won over this little hater.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Delicious Haas avocado on levain toast with fried egg, salt and pepper and olive oil for the win. So simple, yet so amazing. You may think it is simple enough to recreate at home, but they are so good at making perfect toast and deciphering avocado peak ripeness. I could eat avocado toast with or without fried egg for breakfast, lunch and dinner, especially with Kayla Itsines' army of bbg girls instagramming lovely pics of avocado toast. Great coffee, too. A friend who lived in the neighborhood introduced me to this place. He knows my style, and I was definitely happy with the menu offerings, tasty food and hip setting.", "author": "Liv K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Great spot.  Love the menu.  Downside is when you walk in and every table has one girl sitting there with a cold cup of coffee and a laptop....clearly there for hours.  Staff could be a bit friendlier.", "author": "Randy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "Good coffee. Kinda neat little location.  Sunny seating in the morning.  I was not a fan of the egg sandwich because it seemed greasy, but I liked that the egg wasn't scrambled.  \nProsciutto sandwich is good.", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Just as expected: excellent coffee with great service. The open-air feel of the place does not disappoint. Neither does their coffee, or the pastries, or the kind employees.\n\nI opted for a soy latte and a chocolate kouign amman (no, it's not from B Patisserie): http://www.yelp.com/biz_photos/r%C3%A9veille-coffee-co-san-francisco-6?select=FjVbqJic7vXFo9JN7X1Dgg#zGnfrj1hZ3GNVf7rpm41vw It was splendid!\n\nWith free wifi, plenty of indoor and outdoor seating, it's a nice addition to Castro. \n\nWelcome to the neighborhood, folks.", "author": "Adena B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "While visiting friends in the Castro my boyfriend and I checked this place out.  Everything was top notch--the coffee was delicious, my tea was excellent.  My boyfriend had the avocado toast, and I had a pastry.  We were very pleased with our order.  Like any other big city the prices are slightly on the higher end, but we felt it was still worth it.", "author": "Rourke S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "Stopped by for a quick breakfast, loved my meal, did not know what I was ordering, but it ended up being delicious. Had a hot chocolate with a perfect temperature of milk! The outside is so beautiful!\nAmazing spot", "author": "Sofia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "EXCELLENT COFFEE, SUPER FRIENDLY STAFF. I always feel like I'm visiting friends when getting my morning latte. Though pricey and can be a wait for your drink, it's worth it. Also is a relaxing chill environment with a nice outdoor patio area. They have WiFi and water available on the counter without getting in line. Been going for several years daily and have never once had a bad latte!", "author": "Darrin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "Love the chai here.  Great place to sit outside and sip on your beverage of choice while people watching.", "author": "Sondra H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-26", "description": "Great space to spend a relaxing morning. Ordered an avocado toast with egg and a dirty chai and spent 2 lovely hours here on a weekday morning (not sure how packed it gets on the weekends, but it wasn't hard to get a table when I went). Food was yummy, but not extraordinary. I've definitely made the same thing at home myself. I'd love to try their breakfast sandwich next time, though!", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Didn't get to try their food - I was strictly there for their coffee.\n\nJaime and I were strolling around the Castro mid-afternoon when my crankiness was setting in because I hadn't had my daily caffeine fix. As we were walking around a hip little neighborhood, my nose immediate caught a whiff of espresso. The heart wanted what it wanted at that moment and it came in the form of a dirty chai.\n\nFrom the outside, it's a cute little coffee shop. Inside, it's a cool little cafe with communal tables and some pretty delicious looking food. Having just finished a massive lunch, I needed something to keep me chipper - that's why I added an extra shot.\n\nThe process was quick, easy and the staff was friendly. Within a few minutes we were presented with our drinks and back out into the city we went.\n\nThe flavors of the chai and bold coffee flavors represented themselves well and I inhaled that beverage super quick. That's always a good sign when you reconsider going back for more or just wishing that you had ordered a larger size.\n\nI'd definitely come back - especially for food!", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Great coffee (latte), friendly staff and an good atmosphere off Castro Street. Good number of tables insides, particularly if not busy during the week. Service is always fast in the morning if your on the commute.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "How can you say no to five dollar toast!?\n\nSerious!?\n\nSan Diego is really behind the food trends these days. I'm just waiting for a toastery to open down the block so I can enjoy toasted bread all day, every day, forever. \n\nThe toasted bread... Was it wheat? Or sourdough? Perhaps it was white bread. So exquisite. And toasted to perfection. The chef really has this skill down. Not too toasted. Not under toasted. But just right. As far as culinary delights are concerned, toast is the new bacon. Or is it the new cupcake?  Or new cronut? Whatever it is, it's nothing less than revolutionary. Thank you chefs of San Francisco!\n\nAnd the coffee... So stinking good. \nAnd the people watching from the patio is the proverbial 'cherry on top'. What more can you ask?", "author": "Jade D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "Great coffee stop.  Typically we stop at Philz, but opted to try something different as we live just a couple of blocks away from the Philz on 24th.  Glad we decided to do so, as their coffee and espresso was quite tasty. \n\nI ordered an Americano and really loved the flavor.  My husband ordered their coffee and loved the robust flavor of the beans (I believe they use Four Barrel beans, if I remember correctly).\n\nThe place has a cute atmosphere, and we made a mental note to stop back in for a casual lunch or brunch sometime.  The few menu items we saw people order looked very fresh and interesting, so we definitely will be back again to try out their food as well.", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Great coffee.  My friends rave about the breakfast croissants, but I have found them only so-so.  I prefer their avocado toasts or kouign amann, both of which are excellent.", "author": "Herb G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-08", "description": "Love this place -- cannot believe I hadn't been there before! Met the daughter for coffee on a recent Sunday and sat outside facing the street and watched the trendy world go by. Avocado toast? Sublime! The coffee is perfectly brewed with just the right amount of jolt. Great mix of people, relaxed feel - what more can you ask on a chilly Sunday. And yes - you can bitch about the parking, but I found a spot just around the corner (a miracle, I know) and after all, it's our lot in life living here isn't it? This will be one of my new go-to spots in SF!", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-16", "description": "5-stars for their chocolate chip cookie. It was soft and gooey and super delicious. Four days later, I'm still thinking about it!\n\nOverall, very friendly and relaxing cafe. It was perfect to just hang out there, drink a coffee and eat a cookie. The Chai Latte wasn't the best I've had, too spicy for my taste, but some people like it that way. The Hot Chocolate was much better!\n\nWe'll be back!", "author": "Malin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-09", "description": "I was walking by this location and the decor drew me in. I received excellent service from the order taking to the quality of the food. I had the egg sandwich and a latte. The freshness and taste were great. I look forward to going again soon.", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Delicious espresso!  Best coffee in the Castro. It's a cool converted garage with wood benches in the former driveway.  Able to bring my dog.  :)\nThe BLAT (BLT with apple and avocado) is yummy albeit pricey, but everything in SF is expensive.", "author": "Jamey F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-01", "description": "New coffee shop in the Castro. Coffee is excellent. Tasty, yum. \nDecoration is nice and pleasant. \nOn the downside, the coffee cups to go only come in two sizes... Small, which is really small and Large, which is more like a medium...\nTables are mostly occupied by only one person and a laptop. So its difficult to sit by yourself and enjoy your food, which by the way, is not that terrible. Music is very loud. \nI recommend sitting on the front patio and enjoy the scene.", "author": "Gabriel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "Cute little indie coffee shop. Not being a bear, the Starbucks two doors down always makes me feel a little 'fish out of water', not being particularly hirsute or obese. It's nice to have a nicer option.\n\nA bit pricey, but not really out-of-line with other indie coffee shops in the area.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-15", "description": "A very cosy place! Their vegetarian sandwich made my day and the service was really nice, too.", "author": "Aleksandra Ć."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "My favorite hang out spot in the Castro! Staff are pretty friendly once you get to talk to them longer. There's usually a line, but I've never had to wait more than 5 minutes for someone to get my order. The atmosphere is pretty relaxed and the drinks are very affordable. I would not want to recommend this place just because I don't want more people to come.", "author": "Sebastian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "One of the top roasters in town. Coffee so good I usually drink it black. Finding a seat can be tough at times in a sea of laptops but that's the way it goes when a place is this good.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Great coffee, nice place. I could work from there all the time if only the music wasn't far too loud to focus", "author": "Celia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Love the coffee shop, hate the coffee. \n\nthe space is bright and modern with outdoor seating. Perfect place to catch up with a friend, study, work on a project, etc.  I loved the ambiance.\n\nI ordered an espresso and it was so bitter that it was sour. and I grew up drinking espressos. Either way, I'll likely be back if I'm in this neighborhood because it's just such a delightful location!", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Came here to work one day when my internet was out, and I'll definitely come back. The vibe is super hip, coffee is delicious, Internet is fast, and I had one of the best chocolate chip cookies I've ever tasted here. The seating is a tad bit uncomfortable for a coffee shop, but there is plenty of it. I want to go back and try some more of their food.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Reveille Coffee is my favorite cafe in San Francisco. The latte is one of the best in the city (definitely on par with a Blue Bottle, Four Barrels, etc.) and it comes without attitude from friendly staff. The atmosphere of the cafe is quaint both indoors and the front patio outdoors. The food is delicious. During the week there's free wifi; however, there are no outlets to plug in.", "author": "Carol N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-18", "description": "I was inspired to stop by Réveille Coffee Co. after an espresso review of SF done by BuzzFeed (The Taste Buds reviewed 'Espresso A-Go-Go In San Francisco Co. 2k15!'). \n\nThe café is unobtrusive and outwardly unremarkable - In my search for the café, I walked by Réveille twice without noticing. The interior had a clean and geometric feel to it. Despite the off-peak timing, most seats were occupied, so I felt fortunate to snag a seat at the café bar. \n\nI ordered my espresso and took my seat. Unfortunately, despite the lull in clientele, the staff somehow forgot to make my espresso. After ten minutes, I had to remind them that I had not received my order. \n\nMy espresso was served alongside a glass of carbonated water and a spoon (I appreciate not having to ask for these items). The espresso itself was good. It had bold flavour and good crema. Espresso lovers that are partial to high acidity will love the espresso here - those who prefer milder espresso (or those with perhaps more delicate palates) may not like Réveille's espresso. \n\nMy experience here was okay - their espresso is pretty good, but I was disappointed in the inattentive customer service. Comparable espresso is abundant in the area, so I am likely to visit a different cafe with better attention and service to patrons. \n\nVerdict:\nSomewhat disappointing. I probably would not revisit this establishment.", "author": "Laila A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "Perfect little meal + coffee after Sunday morning Farmer's Market.\n\nGreat cappuccino - and the barista was super nice.\n\nAlso had the avocado toast + fried egg. The egg was cooked perfectly. Priced perfectly as well. \n\nLike the vibe of the place, the decor is friendly/warm, and the seating lovely. We sat at the counter, and had a warm snack.", "author": "Amy O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-27", "description": "The coffee, pastries and food at Reveille are actually decent, especially for the Castro.\n\nThe reason for me so-so review is the atmosphere. When I take a break from work and head out for breakfast or a coffee, the LAST thing I want to see is a crowd of people on their laptops, and that's pretty much all one finds at Reveille. Call me old fashioned, but staring at my OWN screen for 12 hours a day is enough. I don't need to see everyone else's, or hear their business conversations. It's always impossible to get a seat as the crowd settles in with their laptops and STAYS. Hey good for them. Not so good for me.\n\nSo yes- fine coffee and all that, but I'd rather head to Thoroughbread on Church for their amazing scones, or up to Peet's on Market for just coffee. Or even Four Barrel if I'm feeling trendy.\n\nOne note on the food- Reveille's Shakshuka is tasty but it's not really Shakshuka. It's more of a Mexican version. Spicy and good, but not the real thing.\n\nI did quite like the Avocado toast. But count me out as long as the laptops reign supreme.", "author": "Carl M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "They turn the wifi off on the weekends, because \"it gets too busy.\" I would not be writing a bad review if they had kick ass coffee, but their cold brew sucks also. So help them cut down on the traffic in-store I will not be returning to this basic coffee shop.", "author": "Keaton S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Awesome ambiance, awesome coffee, awesome food, awesome people. Really great place for those looking for somewhere to get work done, but get here early as all the spots-though numerous- get snagged fast. Also, there is an outdoor, greenery-coveree patio where you and your dog can enjoy the space!", "author": "Cassie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "Reveille is such a cute coffee shop!  Upon entering, their space is welcoming, homey, modern, and clean all at the same time.  I ordered a mocha to go and it came flavored perfect.....not as hot as I usually like it, but good nonetheless.  They have indoor seating as well as outdoor seating and I LOVE the music they play.  I would return on the music alone.  Yes I know you don't go to coffee shops to listen to music, but you know you like a place when you go and you're just feelin it....singing along to the songs.  Do I ever get that happy visiting a Starbucks?  I think not.", "author": "Christine D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "This place is good, has a nice atmosphere, but I'm not crazy about it. The prices threw me off. I had one of their grapefruit dishes where they use a torch to roast the top of the two grapefruit halves - it was pretty tasty but the price was over the top. My wife had one of their power bowl style quinoa/pomegranate (I think) bowls. She liked it. Cappuccino was good.\n\nOverall, it was good but we spent as much money on a very tiny breakfast as we do on lunch...", "author": "Ian S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-28", "description": "Coffees and teas are fine . It's pretty expensive which is expected  . If you are the one who would spend time in the coffee shop reading books or working or even talking to your friends , you can't sit here for a considerable amount of time. They are sly enough to reduce the temperature in here or open the doors so that it gets cold enough that you would decide to move out !", "author": "Ganesh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "The male barista here is super racist. I asked him for wifi password and he said there's no wifi in the store. The weirdest thing is everyone inside the store is using their laptop to check FB and IG. Finally we found wifi password by ourselves. Will I visit here again? Definitely NO!!!!!", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "My new coffee shop in SF. Well made, good tasting coffee. I especially love their vanilla latte and avocado toast. Friendly baristas work on your coffee. Well apointed shop with inside and outsude seating areas. Recommended!", "author": "Steff T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "Stopped here for a quick cup of coffee while walking around the Castro area. Having already had a latte earlier in the day, I decided to go for a cold brew. It was a tad bitter for my taste, but cold brew usually is, and somehow I always forget this. The coffee shop itself was really awesome, and the environment was pretty laid back for the most part. There was some outdoor seating that we grabbed, since we had a dog with us. Quietly chatting, the person next to us started giving us looks and putting his fingers over his ears to show his annoyance with us. That was my only qualm with the place. The food all looked really tasty, but I was pretty full at this point. I definitely suggest checking out this spot! Seems like a great place to relax or do work, if needed.", "author": "Dayna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Really nice coffee shop with nice baristas. Legit quality coffee but just a little noisy.", "author": "Yushi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "\"Do you guys do drips ?\"\n\n\"Noo .. uh .. we just have them because they're pretty\"\n\nOk, I meant do you have options, just one coffee, a menu.. what's the procedure ?\n\nAlso my friend wanted to charge her phone for 5 minutes, from one of the clearly visible outlet and was told \"honey, this is not going to happen\".\n\nI get it, you're too pretty to be serving coffee. But you don't have to take it out on us.", "author": "Matthieu T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "I've been here a couple of times. \nI really like their coffee and it's a very comfortable space to hang out, relax and drink the coffee.  Great location too. Definitely recommend checking this cafe out.", "author": "Eleanor L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Fell in love with the cold brew and biscuits. Great place to sit and work and people watch til the laptop battery runs out.", "author": "Kate F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "I really enjoyed this space. I've been here a couple times and am always impressed with the calm customer service from the staff. During this visit their was a nice woman behind the counter who clearly cared about the beverages she was making and took care in pride in her service. \n\nI ordered an ice tea and was very happy. It's not cheap iced tea that often has a bitter taste but flavorful and kept me satiated. \n\nThe atmosphere was pleasant and the interior design was on point. It also wasn't very loud which is often a deterrent for me. I'll definitely be coming back here.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "One of my favorite cafes. Never crowded, has wifi, serves EXCELLENT sandwiches, excellent granola and yogurt, AND has a great environment for working. I have a big soft spot for this place.. It is a smaller space but I've always been able to sit myself there without waiting. There's also tea, served in a glass pot. I adore this cafe, I hope it doesn't ever turn into an overcrowded place, I think it's a better fit for a slow routine.", "author": "Kathy Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-03", "description": "Food is overpriced. Coffee is good but be ready to wait at least 10 minute for it.", "author": "E T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "Their coffee is phenomenal. I came here twice and the coffee is just really really well brewed. \n\nThe only downside is the no-wifi policy on weekend. I think that sucks. I didn't eat lunch here because of that.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-28", "description": "Amazing macchiato in the Castro! The service was very friendly and they grind the coffee in house. Me and my wife had amazing coffee here. If your in the Castro consider a coffee in this joint.", "author": "Emmanuel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "So lucky me when I saw the SFist's best breakfast sandwich list (http://sfist.com/2014/02/26/the_best_breakfast_sandwiches_and_b.php) and one of the items on the list was at the new Réveille Coffee down the street from me. \n\nFor clarification, even though the 18th St location isn't listed on their website, it's there, it's open and it has the exact same menu. Breakfast until 11:30 but you can get takeaway and essentially make the breakfast sandwich your lunch, as I did because I can't ever get up early enough to have that big of a breakfast followed by a lunch.\n\nThe sandwich is the first one on the menu - Egg Sandwich w/ Bacon (fried egg, braised kale + leek, and gruyere on Della Fattoria levain). There are two prices $7.50 (egg sandwich) and $9 (w/ bacon). Not as apparent as they might have thought because I had to ask. \n\nI have to admit, when I opened the takeaway box and saw a plain looking sandwich I was a little disappointed. It just looked so plain. It looks exactly like the photos so I didn't feel tricked, I think I just wasn't paying attention. However one bite and my mind was blown. Such attention to detail really made an amazing sandwich. #1 - the slices of bread were toasted/grilled with butter/olive oil on both sides before being assembled into a sandwich. #2 - the bacon was perfectly cooked to crispy without being burnt. #3 - they use some quality gruyere because it had a whiff of that stinky funky cheese smell. I kept sniffing like what's that smell then realized it was the cheese. #4 - the cheese was melted into the kale and leeks while the bacon was kept crispy. And of course #5 - a soft cooked egg in a hole on top.\n\nSeriously good breakfast sandwich and it's so close to me! I'd put it up right up there with my other favorite breakfast sandwich at Devil's Teeth Baking.\n\nPS This is a small place and by the time i showed up at 11:15 all the tables were taken with (surprise surprise) people on laptops leaving just the outside tables and inside bar free. Though that's fine with me it felt a little weird to be the only person eating there so I got mine to go.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-25", "description": "A supremely dry and stale bacon cheddar biscuit and coffee cake, very ok coffee and rather unwilling to serve 'servers' all for 17 dollars. Nope, never coming back here!", "author": "Roma T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Sadly, they no longer have wifi on the weekends, which is disappointing. I don't stay long after I finish my coffee and sandwich, but maybe other people were. Even without a laptop, the wifi was necessary to use my phone, because it's hard to get a cell signal in the Castro. I'll still go weekday mornings before work, but looks like I will need to find another place to go on the weekends.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-02", "description": "This is my second coffee shop visit in the Castro so I don't know much about the alternatives, but compared to NYC, this cafe was great, and the service was straight forward but polite. Prices reflect the area and I adore the outdoor seating area in front. If you can get a seat, it seems like a great place to break during the day!", "author": "Morgen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "Great orange juice, great food, i was able to find a table pretty easily, it was generally a super nice vibe.", "author": "M T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Fantastic food, fantastic coffee, fantastic service! This place is just fantastic! I highly recommend the lattes and the kale salad with turkey.", "author": "Cloud G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-14", "description": "Had the blap sandwich! Dunno how a bunch of basic ingredients made such a yummy sandwich but it happened! Side salad was good too!", "author": "Monika L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "One of the best lattes I've ever had in my life!!! No more Starbucks for me! It also has a very cool relaxed atmosphere.", "author": "RD R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Service is pretty quick, and gladly they serve coffee right away as you wait for your food. Cute venue.", "author": "Ameryl L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "Horrible places. I feel like I am being discriminated being non-white and all. The service is slow and unfriendly. No matter how hip this place pretends to be, it can't be more non-welcoming", "author": "Ken C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-11", "description": "Great ambiance, helped by the fact we were able to land a sunny table outside. Indoors seemed a little claustrophobic... some might consider cosy. Had the BLAP sandwich, with the A and the P accounting for ripe Avocado and Pear on a perfectly toasted levain with creamy citrus aioli. Nicely-dressed simple salad with radish accompanied the sandwich, including a sparkling water made for a $12 lunch.\n\nMy only complaint was the sole food menu placed on a small stand next to the cashier which forced each customer to hover behind the person in front of them. Just one more on the island table in the middle of the cafe wouldn't kill the cool and clean aesthetic.", "author": "Jake H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-18", "description": "Had their avocado toast on acme levian and hot cocoa. I search endlessly for the perfect hot chocolate and I believe my search has ended. Love the cute sit out area. Would highly recommend this place", "author": "Vasini G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "The space itself is awesome - the inside is cozy with a small outdoor area right by the door. The low rating is for the coffee drinks. I ordered lattes the two times I've been here and both times I ordered them extra hot, only to receive a barely-luke-warm drink. My friend's drink ended up being worse - borderline cold. I think it depends on the barista working at the time, but at this price point, I'd expect a little more. \nThe second time I was here, my friend and I threw away our drinks and went to the Castro Center next door to finally get what we wanted - some hot caffeine on a cold day.", "author": "Patricia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "I stumbled upon this coffee shop while walking around the Castro District. What a lovely place with beautiful decor and amazing coffee. I stayed there for a while reading my book, and I will definitely go back on my next visit to San Francisco.", "author": "Julia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Was bummed that I didn't make it in time for the egg breakfast sandwich, so I settled with the turkey sandwich which was delicious! It also comes with a side of green with this lemony dressing that I loved. I also had the cappuccino, but it was nothing special.", "author": "Yanni C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "I had the Guatemala retan roast coffee. It was sweeter than I anticipated but tasty. I also had the almond croissant and bacon biscuit. The almond croissant crushed the bacon biscuit. They would benefit from warming up the biscuits or at least offering the service. The cost is the main reason for losing the 5th star. $13 for coffee and 2 pastry's. Highlight of the experience was the almond croissant.", "author": "Ryan O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "It has a lovely entrance. I had the vegetarian sandwich, which was great. I wished the tea pot was bigger though. There's also free wifi.", "author": "Azer K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "I was looking for a cafe to work on a Sunday. Unfortunately, after I ordered a drink, there's no wifi during the weekend. I felt they do not welcome people working in their cafe and sitting too long.", "author": "Meiteng L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-11", "description": "Consistently great espresso, one of my fave places to go sit outside and soak up the sun while a nonstop parade of people accost our dog and ask us what breed he is (a mutt from the pound, who looks like a tiny chow chow crossed with arctic fox and perhaps wombat). Our locally famous wonder dog soaks up the accolades as we sit there like chopped liver, sipping delicious beverages and enjoying one of the last San Francisco neighborhoods to have any character left at all.", "author": "Cleo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "My favorite coffee shop in the Castro for many reasons. Drinks are great, food is delicious. Most importantly, the staff is extremely friendly and inviting. I live nearby, and this is absolutely a place that I'm going to be multiple times a week for that very reason. I pay a lot of attention to the way that staff treats its customers, and am happy to say that everyone who works here is incredibly present, seems to enjoy what they're doing, and is incredibly attentive and inviting. I can't say the same for all coffee shops in the area.", "author": "Lillian N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-28", "description": "I would usually go to Philz across the street because it's consistently awesome, but it is the day after Turkey death and was overpacked. I had been walking by this spot for a few months and was meaning to try it , and it didn't look too bad so I went for it.\n\nCoffee: pretty good. \nService: register person super friendly, barista squad I didn't like the aura I peeped on you all . \nFood: ordered the egg sandwich WITH bacon. It was 9 bucks with BACON. Shocking (not shocking) when I finally got to eating it having took it out, there was no bacon added to the sandwich.So I paid 9 bucks for two pieces of toast with the middle cut out for an egg and spinach . NOT EVEN CHEESE!Get your bs together , you're not that dope", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "I came here with high hopes because of the raving reviews from everyone. Had the avocado, egg and a latte. Breakfast was extremely average. Can't complain about bad food but it was nothing to rave about. Sat down and there was no sugar on the table. It was put at a station that was out by the door. Then, the latte is served in a Cappuccino cup, rather than a latte glass. If this is a place that raves about its coffee and wants to be known for its coffee, then serve it right. I'd like to try the other location before coming to a final decision of whether i'd go back or not.", "author": "Van-Anh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "Loved my two visits to Reveille Coffee co. \n\nFirst off, the space is gorgeous! There is plenty of room to move around and the overall look is enticing. \n\nI had a pour over and the avocado toast and both were incredible. I was a little sad that I couldn't just sit there all day because I probably would have. Dog and people friendly. The service was great and everyone was upbeat for an early Monday morning. \n\nI came in the second time and have a cappuccino (wonderful) and an almond croissant. I am very picky when it comes to coffee and baked goods, and although the croissant didn't have too much flakiness to it and was a little too moist, the taste was overall very good.", "author": "Lexi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "On our trip to San Francisco in November, we tried Reveille Coffee Co. It was our last day in the City so this was our last stop on the way to the airport. It was pouring that morning so before we headed to the airport we wanted warm coffee and breakfast. With packed bags we show up to Reveille Coffee and it did not disappoint. This place was cozy and warm. Their egg sandwich and mocha were delicious. So glad we got to try it before we left. Give them a try if you are in the area.", "author": "Angelie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-23", "description": "Coffee good, lackadaisical staff and inability to move faster then a snail, horrible.  If you can't make coffee and talk shut up.", "author": "Heith M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-07", "description": "I have been to the Castro location a few times and the staff has always been friendly. It is located in the downstairs of a building with a little front patio overlooking 18th Street. \n\nThe latte has pretty latte art but the coffee is too acidic for my liking. Have tried latte on a few occasions and the coffee is acidic. Food is the highlights at Reveille. Simple and healthy. I like the avocado toast and the \"egg-in-a-hole\" breakfast open-face sandwich.  \n\nAmbiance is great. Relaxing and comfy, but laptop people hog up most of the tables. I would come here early before they get there and enjoy the morning.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "Great coffee and food, I only wish they had a bit more seating available. It definitely seems like a place where people just come by and occupy the seating for hours.  But the coffee and food are great.  The baristas really seem to know what they're doing.  The food here is great, they have an amazing breakfast sandwich with an egg cooked into the bread, it'd definitely worth trying.  Though they do have some quick pastries to go here, they often times seem to run out of these so don't expect to really find any in the evening.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-23", "description": "The food, coffee and ambiance here are great. I especially love the kale salad - nice flavors and very filling. Free wi-fi and nice outdoor seating. \n\nThe first time I came here, would have rated it 5 stars. BUT on a re-visit they messed up my food order, and when I politely asked the lady who was working to fix it, she gave me some major attitude. Wowwwwww. First she tried to convince me I was wrong, then when she realized I was right, she gave me a nasty look and asked if I still wanted them to fix it. Um, yes? I will say that the other guys working were really nice. Maybe someone had a case of the Mondays.", "author": "Monica O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "I love eggs so I went to Reveille to try the famous breakfast sandwich. I didn't like it very much.  I also had an iced tea which I paid $4 for (realized what the price was too late) .The price/value is low and although the environment of the cafe is cool I will not go back.", "author": "Flora F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-25", "description": "Delicious artfully prepared, but pricey food and coffee, lattes.\n\nMy only complaint when I sit down for nice quiet brunch I don't think Sid Vicious music is exactly what I would select.", "author": "Jeffrey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "Great coffee and breakfast items.  A little warm inside during the summer and a canopy over the patio would be more than welcome.\nNice addition to the Castro.", "author": "Bob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Great coffee shop. Delicious breakfast. Lovely outdoor seating.", "author": "Megan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "The cappuccino was exactly what I expected a good cappuccino to smell and taste like.", "author": "Elvin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "Traditional espresso with a taste that differs slightly from the other SF coffee giants. It's a great spot with a super cool interior and delicious coffee.", "author": "Eman A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "I cannot express how happy I am that this place moved into our neighborhood. Great atmosphere, coffee, and food. Some quick reviews of specific items:\n- Breakfast sandwich - great but the kale makes it taste too healthy for me\n- Waffle - So much butter but also so delicious. I felt like I might have taken a few weeks off my life but it was also worth it.\n- Quinoa Salad - Delicious and healthy. My go to lunch in the neighborhood as it not only tastes delicious it also leaves me feeling good about myself.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "I love the coffee here. Usually get a breve macchiato.\n\nThey use Four Barrel beans so their coffee is delicious.\n\nThe hot chocolate is a bit too modest for my tastes.\n\nAlso, one beef! The word is an American word with French origin, but they prefer the French pronunciation.\n\nI think \"Revili\" sounds way better than \"Rehvay\" :P", "author": "Morgan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "This location isn't as good as the location as the location on Columbus; or at least the barista that served me wasn't as good as the one at the other-- which is to say the art on my cappuccino was an unflattering broken mush.\n\nUnlike the place on Columbus, this location has wifi and people who use it. It seems to be pretty sceney; many people sit and work in the outdoor seating area as if they want to be seen. I actually kind of like the one on Columbus had no wifi, since it's somewhat unpleasant to see people working on their laptops.\n\nI did like the wooden interior and the \"Please sit with me\" signs on the tables. Cool idea.", "author": "Ceasar B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "yummy yum yum: here's an example where the pomp of hand dripped coffee pays off. It's good! And so is the food: my toast with the real-deal jam was over the moon amazing, and my girlfriend's breakfast sandwich with a perfect egg also incredible.\n\nIt's super close and sadly always crowded. Because it's GOOD!", "author": "Diane B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "The coffee here is so good that in typically hold my nose and put up with baristas who are much too cool to actually wait on you.  Today imagine my pleasant surprise when Gene and Chris turned out to be so friendly.  I'll come back again hope I luck out and get them again.", "author": "Bob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "This place is fantastic. The ambiance is great, the food is tasty, and the coffee delicious. \n\nAlso the employees are all very attractive. Not complaining :)", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "I had the quinoa veggie salad here. It was fresh and delicious. I would totally order it again.\nGreat place, with wifi and places to sit", "author": "Billie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "I must admit that there have a been numerous times in which I would walk thirty minutes just to have their coffee and catch up with work and/or friends. If that doesn't show how much I enjoy going here, then I don't know what does.\n\nThough it can feel a little stuffy in here and has the tendency to get progressively warm inside, they also provide a lovely outdoor patio in which you can enjoy the sun and fresh air.\n\nThey have a really great staff and that definitely helps with creating a great environment. But the empty seats fill up quite fast so if I can provide any suggestion or tip, it's to make sure you go early!", "author": "Armando A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "cool place. good vibes, good coffee. lots of people and there was a line, but it went quickly. we had the chia seed pudding and the hot cakes. definitely would go back.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "Hip is the last word that comes to mind whenever I think of an establishment in the Castro but that's exactly what Reveille Coffee is. A great addition to the neighborhood, Reveille offers Four Barrel coffee but really separates itself with its fantastic breakfast and lunch options. I had a Bacon and Kale Sandwich with a sunny side egg that really hit the spot. There are other options like Creme Brulee Grapefruit, Avacado Toast, and Spinach Egg Scramble which I will need to try. It's an awesome place to chill as they have bar, outdoor, and bench seating. Great music, friendly staff, and comfy interior design round up this 5 star establishment. Try it out!", "author": "Charlie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Ordered the dirty chai as recommended from fellow yelpers. Crazy spice bomb. Awesome flavors, yet a little on the watery side. Which it was a little bit more creamy. Decided on the peanut butter and toast to accompany it. Decent, but The Mill doesn't have anything to worry about. Considering they are both $4 save your money for the next time you are on Divis. Heard great things about the avocado and egg toast, just wasn't feeling it this morning. I may come back to try that, as it has raving reviews!", "author": "Victoria O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "Ambiance is fantastic, and if you're looking for the best pour overs and lattes in the Castro, you can't go wrong here. Great place to study, people-watch, or dog-watch. They don't have the same setup of coffee selections as philz across the street, but I think they really compliment their coffee offerings with philz.", "author": "Polina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "their vegetarian sandwich is amazing 10/10. it has asian pear, avocado, arugula, lemon vinaigrette, candied walnuts herbed goat cheese served on Acme levain bread. I tried it for the first time today and will probably be back this week to get it again. the ambiance and energy of the cafe is amazing as well.", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "Good food, great drinks and a nice build out. It does get pretty crowded on the weekends since it is one of the better coffee shops/light breakfast places in the area.\n\nI did knock off a couple stars since unfortunately they have hired a few guys with pretty nasty attitudes who are too above it all and should not be working in the service industry. Most the staff is pretty nice though and while I have never had issues myself I have seen one staff member in particular go out of his way to be rude to patrons multiple times who are mostly older and not fabulous enough apparently. Hopefully management is paying attention or this location will get a bad rep.", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "My new favorite place!  I travel out of my neighborhood (DT) to get coffee here, almost every day. The baristas are friendly, playful & fun, and now know me by name + drink order, always offering a warm welcome.  I love the interior design of the space; it's well played for the space constraints (low ceiling).   Reveille is new, sparkly and always pristine inside. To that end, yesterday Allie and Jasper were cleaning baseboards and that nice patterned tile between customers when I arrived.  (Putting the baristas' names on the board up front is a great idea!) =-)\n\nSo, if this place doesn't get five stars, what do you have to be?  The Castro has really needed a cafe like this--so glad they're here now.\n\nP.s. A person below update her review from 5- down to 4-stars because people camp out with laptops--is that fair? Would a 5-star-worthy neighborhood bar get downgraded because people like to come, stay & chat for happy hour? Protective laptop camper guy, here! =-)", "author": "Brian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "Kind of disappointing.   4.75 for a lukewarm cup of coffee. \"It will take 5 minutes.\"  How can pour-over coffee take that long?\n\nI think she was new...\n\nNo dark roast - WTF?", "author": "George H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Great espresso drinks and the best service. Liberty behind the counter is wonderful. Thanks for making my day better whenever I stop in, Lib!", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Just started going here about a month or so ago and I'm definitely a fan so far.  My partner and I have started going here on Sunday mornings before we take our boys to the dog park (our four-legged boys, that is) and we've come to enjoy their espresso drinks and pastries.  \n\nWhile I've not sat inside, so don't know if they offer plugs and wifi to make it a good work spot, it does feel cozy and comfortable inside, with a small patio area out front, which promises for good people watching.\n\nRight now I'd say this is probably the best coffee shop in the Castro and will continue going here until they prove otherwise - especially since Peet's was acquired by some German firm and is making questionable product decisions.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Fantastic coffee, excellent service, good pastries (today our bread broke on its way out of the case, so it was given to us on the house), and a great layout, providing lots of seating and good flow in a relatively tiny space. Reveille draws a really good crowd too. I've always had friendly interactions and my toddler acts really at ease sitting at the banquettes, watching the crowd and munching a snack. Bonus points for being kid-friendly, and it's loud enough that little ones don't violate the vibe.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "It's pretty ballsy for another coffee chain to go up against Starbucks but this coffee shop is a few doors down from a Starbucks on the Castro. As a non-coffee drinker, I wouldn't be able to comment on the coffee. I came with a friend on one of the warmer days in San Francisco and it was already busy. Unlike Starbucks, they cook food. They were switching from the breakfast menu to their lunch one which provided me with different options. I went for the Grilled cheese and liked it. It came with a salad that was so-so, but I applaud the effort. The staff was sharp but friendly, my friend opted for the coffee and a muffin which he liked too.\n\nOverall an ok place and alternative option to coffee lovers and non-coffee drinkers alike.", "author": "Johnas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Stopped in around 11:30 one weekday morning by myself, and loved the design and bustling atmosphere and menu.  I had the BLAP (like a BLT with pear and avocado) and really enjoyed it (I wanted the avocado toast with egg but breakfast had just ended).  \n\nI hate to be that person, but I wish they'd limit the free wifi.  I barely found a place to sit because every spot had someone camped out with their laptop.  There's a long row of tables for two, and each table had just one person ... and their laptop.  Or maybe they could add a communal table for folks with laptops.  I'll definitely be back, but I'm not looking forward to the seating situation.", "author": "Lynn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "My hunt for the ultimate coffee shop continues, and so far, Reveille is in the lead :D I've been a Philz phanatic for years, but sometimes I really just need a latte. Wandered down the street to find this place. Not only are the lattes here top notch, but they have the PERFECT breakfast/lunch menu. Had the Egg and Avocado on Toast for breakfast, then stuck around for lunch and had the Kale salad. Kale, eggs, and avo are pretty much my favorite foods, so this place is heaven sent :)) Not to mention the super friendly, non-pretentious staff and great chill music selection.\n\n I've spent about three hours here now, and moving to the Castro has crossed my head multiple times :P", "author": "K C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Great atmosphere, yummy quinoa salad, avocado toast and iced almond latte :) free wifi pass longhairdontcare ;)", "author": "Aga S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Join me.\n\nFor coffee: http://www.yelp.com/biz/r%C3%A9veille-coffee-co-truck-san-francisco?hrid=4IKsT7Ne77UHcEyn1Lbr4g\n\nFor homemade granola, peanut butter and cookies: http://www.yelp.com/biz/r%C3%A9veille-coffee-co-san-francisco-5?hrid=LmYwvodmncQBm_49EWvgmA\n\nFor flatbread: Unique to the Castro is an impressively large (six pieces) and impressively tasting thin crust topped with homemade marinara sauce, mozzarella and basil. Just $8.\n\nAlso topped with olive oil along with more given on the side but overall surprisingly light.\n\nThis location also includes a small entrance patio, wood tables, free WiFi, beautiful lighting and conversation starter table signs that say \"Hi! Please join me at this table.\"\n\nConsider yourself invited.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "The coffee and avocado toast were amazing, and the girl at the counter was really nice. Though it was crowded we were able to find a seat on a bench in front. Overall a good experience", "author": "Olivia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "I was very excited to find this place in the Castro today. Fantastic almond milk latte. Beautiful, clean shop and friendly baristas. Cute little outdoor area. What more do you need?", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Their coffee has one of the finest flavors I've found. Hard to describe the purity of taste and perfect preparation. The employees make you feel welcomed and appreciated.", "author": "Henry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "A bit of a crowded place but servers delicious espresso drinks with almond milk. Richeon frothy. Good places to set but acoustics makes it hard to hear. Still a great place to check out.", "author": "around town e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "I've gone on a tour of cafes recently as I looked for the perfect place to study. This place gets all five stars.\n\nThe pros:\n\n+ The ambience is fantastic. The lighting is bright and the interior design is sleek. It feels both modern and safe\n+ The wifi is free. Unlike cafes like Sophie's which charge you per hour, Reveille offers you an unlimited stream of wifi. For the most part, it's fast, too\n+ The wide selection of food and drinks. To be fair, I haven't had any food besides the Chinese Chicken Salad, which is 3/5, but the number of options seems favorable\n\nThe cons:\n\n- Always busy. I've come at all times of the day and have rarely found the cafe not totally packed. If you're looking for a lot of space to call your own, this may not be it\n\n- No outlets. If you're a student or someone who needs a fully powered laptops for hours to complete his work, beware. There is one outlet in the entire cafe, and as you can imagine, it's usually taken. Consider yourself time-limited\n\nI can tell you this place is the best in the neighborhood. Illy Cafe is behind it. Sweet Inspiration behind that. Sophie's has a ridiculous wifi policy (1 hour per purchase), so i wouldn't recommend it if you value wifi", "author": "Aj P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "Coffee is strong and good. Yum Yum.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Simply one of the best places for coffee and people watching in one of the best neighborhoods in SF. Amazing staff and cool atmosphere.", "author": "Jed R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Great place to meet a friend, or work all day. Order the PB&J and a glass of milk and you'll be both full and happy. While getting a seat can be hard given its small size, once you score a spot you never want to leave.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Loved this place right off Castro. Definite order the PBJ as a snack. I needed a little pick me up late in the afternoon and it was perfect.", "author": "Alvaro M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "Super hipster cafe. The cappuccino is pretty tasty and also very presentable, as you can tell from all the yelp pictures. Kind of overpriced, but you pay for the environment. The tables are big, lighting is good, free wifi, and there's a good amount of space both inside and outside. Also, the people who work here are nice (because they complimented me on my necklace hehe).", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-11", "description": "Everything is amazing, especially the staff!!!\n\nGreat place to work or study. \n\nEmployees are happy and upbeat and nice. \n\nCoffee is good!", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Small, low-key, and quality-conscious.  Pleasant staff.  Robust house coffee.\n\nIt's OK that it's a limited menu - they did a good job of our two meals.\n\nAvocado, bacon & egg open-faced breakfast toast was fresh and tasty.  Chia pudding topped with fresh fruit was overpriced yet pleasant and mild.", "author": "Anne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Delicious food. Delicious cappuccinos. Cute, clean, simple spot. Friendly service, and festive atmosphere! Outdoor seating is great for nice weather.", "author": "Mely M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Good coffee, food, music AND a friendly demeanor are a winning combo to help a customer start their day right. The cold brew coffee tasted balanced and velvety -- not bitter or acidic like at some coffee shops that leave you wondering if it's actually just regular coffee on ice. The Shakshuka (poached egg/kale/tomato/chickpea/feta) breakfast bowl was delicious and filling. Generally I would cast a side of toast aside but even the Starter Bakery levain that came with the dish looked (and was) too good to pass up. Also they were playing music by FKA Twigs and two people working there complimented me on my outfit.", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "This place has a great vibe, excellent coffees,  teas and food. They have a little front patio ideal to sip your drink. Nirvana was playing when we went there!", "author": "Valentina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-30", "description": "I just recently found this place (even though it's a block from my house), and I LOVE IT. The food, the atmosphere, the staff ... everything is amazing. They have a brunch menu that switches out to lunch at some point in the day - they are both pretty small menus, but all of the food I've tried so far has been delicious. \n\nIt's an order at the counter kind of place - very relaxed. My only gripe is that it's always busy, no matter when I come in. Yet I still magically always manage to find a place to sit (they also offer little table share cards so you can let others know when you are open to sharing your table). \n\nThey have a cute little outside patio area which looks out onto 18th street - a nice respite from what can be a pretty grimy part of the Castro. They also have free WiFi, and their Chai's are yummy.", "author": "Julia O T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "The coffee was wonderful and the food choices were all a man could want. It also helped that the staff was adorable", "author": "Isaiah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "These people are busy and friendly (most of them) and again, their coffee is great. This place feels nice to hang out in, though I wish customers were a little more social. \n\nStill growing on me and ignore my past reviews, haha, must have been a bad day.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "A great addition to the neighborhood.\n\nExcellent coffee, especially the pour-over. What makes this place special is the food menu. Breakfast sandwich? Yes, please!\n\nThe interior is clean, modern and cozy; plenty of tables and chairs to go around.", "author": "Charlie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "What a great little coffee shop! \n- The interiors are all wood panels and white benches, giving it a really clean look. \n- We ordered a mocha, coffee and the seasonal flatbread, which had grilled asparagus - yum! The mocha was good, a little strong though. \n- The staff were really friendly and smiley :)\n- Only downside was that it got a little cramped for space. Otherwise, it's a nice place to sit and enjoy your drink. Definitely recommended!", "author": "Pooja S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "City by the Bay has many coffee shops to offer San Franciscans from small locally owned stores to large corporates. However, due to current movement of producing high-quality coffee, so many coffee shops opened up that serve amazing coffee. One of them is of course Réveille Coffee Co. This truly unparalleled coffee was first served just few years ago by two brothers through a delivery truck. Once you try third-wave (high quality) coffee, you just can't go back, especially if you tried Réveille coffee. \n\nThis particular Réveille Coffee location in Castro offers a small store with plenty of seating for a small space. Also, there is a tiny outside area where it is so nice to have a cup of coffee on a sunny day. The baristas are fun at this location and always are welcoming. \n\nIn addition to serving amazing coffee, Réveille offers a wide selection of sandwiches. Despite the fact that there are plenty of food items to choose from, I always ordered the same chicken sandwich whenever I ate at Réveille.", "author": "Aigul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Great mix of music, great coffee, great black and white wall paper, great place. I even got a big lemon cake for free, since they closed a little earlier.", "author": "Kristina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "What a lovely new coffee shop! The atmosphere is beautiful, clean, modern and cozy inside.  The black and white tiles behind the counter are great.  There is wi-fi, but no electrical outlets. \n\nI had the vanilla latte- wow, definitely the best latte I have ever had.  The vanilla flavor is made in house.  The service was friendly and quick (no snobbiness or annoyance at questions- which drives me crazy in SF). The barista was really smiley and seemed to really enjoy making latte art and watching us compare art with the patrons at the table next to us.\n\nThe food looked good, but we didn't try anything.\n\nI will definitely return.", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "One of my favorite cafes in sf. Very friendly stuff, delicious food. Salads and sandwiches are way better than what u would expect from a cafe. Nice atmosphere but charging your laptop or phone is a problem here.", "author": "Çağlar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Great coffee and snacks (PB&J Toast is awesome). Lovely atmosphere with a few seats outside in the front. The staff are friendly and on top of everything. Highly recommended.", "author": "James B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Hip spot with morning sunshine and some outdoor seating, serving breakfast til 1 pm. I love breakfast sandwiches  - which makes for a great crossover menu item if you are looking for lunch early, as I was today. Breakfast sandwich with egg and avocado on freshly made toast was delicious and served quickly.\n\nAwesomely courteous and attentive staff. It's President's Day, and he toasted to a woman prez, coming soon to a country near us! Me and my friend appreciated the woman shout out.\n\nFamily-friendly too.", "author": "Roxanne D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Nice staff, cool music, clean cafe and they open early on Saturdays! The coffee is very tasty. I will stop by again next time I'm in the neighborhood.", "author": "Marc R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "One of my favorite cafés in the city. \n\nFree wifi, genial baristas, and an incredible atmosphere. Lighting, music, decor, and taste of the coffee - everything pretty much just works!", "author": "Tony D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-18", "description": "Pretty place & perfect location. Service was 4/5. However, the main part- the coffee was a 1/5. I got a mocha & thought it was overpriced and horrible. Even my friend who got HOT CHOCOLATE hated it. How hard is it to make hot coco? Everything but the coffee itself was great. Most likely not going to come back.", "author": "Pavnit K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "Nicest baristas in the city, and great food, too! Love hanging out in the sunny sidewalk seating on the weekend. Protip: sun hits that side of the street around 11am. \n\nBring your sunglasses and workout shirts, it gets really hot!", "author": "Jessie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-25", "description": "Stopped into Réveille for coffee and a snack on a Saturday afternoon. As expected, it was busy, but I found a spot at the bar in the center of the café. Even with six people's tickets ahead of mine, my latte was ready in just a couple of minutes. Carefully poured and plated. The avocado toast came out quickly afterwards, and was well seasoned, although the bread (a French country?) was surprisingly dry. Excellent customer service: while working quickly, the three counter people were all really nice and conversational. Cool location, too, as it's conveniently tucked into the ground floor of the building and away from the street, with clean, contemporary decor. I'll be back!", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "A really cool coffee shop. I got avocado toast and a cold brew. The avocado toast is great- they don't skimp on the avocado. The cold brew was also really good- sometimes a cold brew can be too bitter but this one didn't have that problem. It has a good environment there- good place to come with a book or laptop (though I'm not too sure about wifi or outlets).", "author": "Kim V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-19", "description": "I was so stoked the first time I came by. I've worked in the hood for 3+ years and it's been nearly impossible to grab a fresh, delicious lunch anywhere on the street. The food in the Castro available during lunch is dismal at best. So when I tried the oh-so-amazing goat cheese salad I almost did a backflip from excitement. I could eat here every day of the week and don't even mind the $15 price tag for a salad + chai tea. \n\nBut, honestly, what's up with the customer service? You walk in to a bunch of kids milling about behind the counter, receive no greeting, no welcoming, no \"what can I get you?!\". Instead it's just blank stares all around. So extremely awkward! Each time I go back it gets worse. My coworkers who I've recommended the place to got the same reaction. One friend even walked right out. \n\nI'll stay neutral at 3 stars but pull it together please! This neighborhood needs you!!!", "author": "Shawna Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "I like this place a lot.   Only major complaint is that  I am a tea drinker and it would be nice if they have a more generic  black english breakfast tea but can't be too picky.\n\n Just had the chicken sandwich and it was as good as a chicken sandwich could be.  They used real rotisserre meat, good quality bread (think it was acme), not too much cheese, and arugla side salad was dressed perfectly with right amount of acid.  I hate how places  put too little acid in dishes.\n\nAlso people said the service is lacking in their reviews.  I could not disagree more.  The service is amazing here on all four different visits and I am NOT a pretty castro boy or girl just you average joe person.    The only thing I would dock them for is value.  The value is not bad but not amazing either..... its acceptable,  but on the other hand the quality of food is better than starbucks and you get more so I guess you get what you pay for.\n\nOne more thing the crowd is not as disheveled  and roudy as the starbucks  on 18th street.\n\nFood 4 Stars\nService 5 Stars\nAtmosphere 5 Stars\nValue 3.5 Stars", "author": "Christopher T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Delicious yogurt with homemade granola and cold brew coffee. $10 is not a steal, but it seemed worth it at the time (especially when my other option is Starbucks). Pretty crowded on a Monday at noon, so I can't imagine what weekends are like (but understand why they would turn off wifi on the weekends).", "author": "Janelle F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "Exceptional service. Really tasty food and coffee. HUGE fan. I come here all the time.", "author": "L A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "So far the best coffee I've been directed to in the area. Service is usually pretty good if a little San Franciscan (low key and somewhat indifferent). Sandwiches are also good if you're in need of food. When it gets busy, as it often is, there is little available seating and the temperature makes you wonder if you're next to a boiler room. This being SF there is usually a bevy of people working (or not) on laptops and sundry devices without regard to their environment.", "author": "G A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-04", "description": "I think  that the only good thing about this place is the Wifi, coffee itself isn't good actually has a weird sour taste (i know taste is subjective, but......)\nThe eggs sandwiches didn't came out as the menu says, the attitude in general was no nice, but probably this is the new way to interact with costumers.", "author": "Frank C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "Great espresso drinks, award-winning breakfast sandwich, nice space, though Very Loud. I'm happy they are here, as they make for a nice breakfast experience and chat and they have a fair amount of space, though your ears will be ringing when you leave if they are at all busy.\n\nService is mixed, sometimes they can be very friendly, and sometimes really brusque and a bit hipster. However, they are better than so many four star locations that I can't help but give them the 5th one.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "This new cafe is too nice to denigrate with a \"hipster\" label, as some of the earlier Yelp reviewers have done. (Don't you all know hipster = bad?)\n\nGood coffee, beautiful interior design and -- tah-dah! -- it has that rarest of Castro amenities: outdoor seating.", "author": "Jim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "Great coffee, friendly staff and sun-drenched (tiny) terrace in the heart of Castro make a great trio", "author": "Olivia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Latte was really good.  Grilled chicken sandwich is another recommendation.  Very trendy. Had outside seating too.", "author": "Hiral P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "Wow... That was the best dirty chai I have ever had in my life! The spices so nice and the buzz was so elegant :) The business itself is very clean and carries a classy and elegant ambience. Will be returning!", "author": "Erik C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-30", "description": "More sour coffee for the $8 toast crowd! If you're drinking here...you're like 20 feet from Philz. Go to Philz.", "author": "Luke M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "Love this new place in the Castro. Beats Starbucks any time of the day. Wonderful ambiance and super tasty coffee. \nStaff is beautiful.", "author": "N H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-28", "description": "Great coffee, but waiting 35 minutes for a basic chicken sandwich at 2pm- when it isn't crowded is unacceptable. I asked them to check what was talking so long, and they came back and didn't say anything for another 10 minutes. The ONLY reason I am writing this review is because this is the second and LAST time that this is happened here.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "Simply wonderful! The staff is friendly and knowledgeable. The space is open, inviting and spotlessly clean. The coffee was smooth, rich, and heaven to drink. I have found my new favorite coffee shop!", "author": "Picture M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "Great space, good coffee and although way too sweetened almond milk...much else pretty good. Thanks for coming to the Castro.", "author": "Kate S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-05", "description": "I've been religiously going to Réveille Coffee Co for months now in Castro. I love it because they have free wifi that's fast, delicious coffee (and I hate coffee), food that is worth every nickel and a down to earth staff that makes you feel at home. One of the cooks named John created this watermelon salad that isn't even on the menu (yet) but is a must try. Bottom line, I've been living in San Francisco for 8 years and this is the only cafe hands down that you'll want to come back too very often.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-25", "description": "All the gays come here. Okay some of the gays come here. You'll get a couple of dykes, and hipsters. The coffee is great, and the tea is a bit expensive. Just go to Starbucks for the tea. Just saying.", "author": "Vinson H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-19", "description": "After seeing this today I'm no longer buying coffee here. No other business in the area is blocking parking on fri night except them. Really disappointing when a business take a political stance at the expense of the neighborhood. Many people/customers drive into San Francisco just to support and spend money on local businesses. I don't even own a vehicle but it's Poor judgement and taste to setting up tables and chairs to block parking to advertise and make a profit. for your companies gain. These people were pretty nice it's surprising they are having their employees sit out there to give the appearance of customers blocking the street. There's many options within a 1 block  radius to purchase $4 coffees. No one ever blocked parking for the 18 months it took for the construction to gut out the garage to make this company. Was a lot of dirt, dust and noise for us in the neighborhood and this is how they are choosing to show their gratitude to the locals and surrounding neighbors.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "And now on one block there's Philz, Ritual (at UB), and now Four Barrel here at Reveille. Goodness. I can't say it enough but the low hanging coffee fruit in SF is some of the best damn fruit around. I'm not sure how busy the other location in North Beach gets... the couple of times I was there it was sparse, likely because tourists don't always know a good local business when they see one at first glance. Here in this neighborhood though... there's already a line and a buzz about this location. The kitchen is serving some serious breakfast sandwiches, and a sunny (read: often in the Castro) day, there's some patio space, and a line out front. I'm sure that the coffee chains will always have a small foothold in the competition but it's becoming easier and easier for anyone to get a good, quick cup of coffee without having to order their preferred method of brewing and without having to order something that's not the seven letter word of joy. Simply: Hi. Coffee. Please. \n\nNote: communal two-sided wood bar for quick, easy seating.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-22", "description": "I wanted to like this place so bad, I really did. Went in around lunchtime on 3/19 with my cousin visiting from NYC ( i was excited to show her the new coffee spot in the neighborhood) and was greeted by no one. The guy behind the register just stared at us when we approached, no even making eye contact and making us feel super uncomfortable.\n\nAfter we got our drinks from the barista, I asked for some cold almond milk (big mistake) to add to my triple espresso. After adding the milk, the espresso curdled instantly and was undrinkable. I approached the vacant guy at the register again and he simply pointed to the barista. I explained what had happened to my drink and the barista went and got the \"manager\" He told me that their coffee tends to curdle when it comes in contact with almond milk and then proceeded to pour out the almond milk into a glass and taste test it in front of me and saying that it tasted fine to him. It was like he was trying to place blame on me or something. I don't need a lesson, I just want to get my coffee and head to Dolores Park with my visiting cousin. 20 minutes after I first placed my original coffee order, I finally got my replacement triple shot served with an overwhelming side of embarrassment and feeling like I should have just gone to Starbucks.", "author": "Will K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-13", "description": "It is a really nice space, but I don't know why they'd overlook readily available power outlets when designing the space. That'd probably keep me from coming back.", "author": "Eloy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "So originally I started going to Reveille when they opened.  It was completely 5 stars.  I will say that the staff there has always been and still is 5 star.  Unfortunately the quality of the food has steadily diminished.  The biscuits, a signature item here, use to be light airy and deliciously buttery.  I don't know if they completely abandoned their old recipe for a new one...but disappointing. Before I didn't mind paying a bit of a premium for the food here....now not so much. Happy to pay for great food, unfortunately this is no longer great food.  Ugh....the search for an amazing coffee shop begins again.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "First time here and may I say it was fantastic! Good people and good vibes not to mention a pretty awesome menu! Most definitely 100% customer satisfaction for me!", "author": "Shaniah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Good coffee, wifi, nice ambiance, and friendly staff. I like the \"share my table\" signs. Good place to go get some work done!", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "A bizarrely 2nd-order coffee place. Beautiful interior with excellent furnishings but one gets the unmistable sense that the place is lined with money in a vaguely treacly way. Like a slightly nauseating ability to perfect an aesthetic derived from a glut of misallocated general social funds. The coffee's good but only insofar as you enjoy light-medium roasts as this is a place that makes a fetish of the lighter roast. To be honest, go get yourself a less expensive cup. Good but not going back.", "author": "Houston D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "I use to go to Reveille every weekend while I was doing laundry.  The atmosphere is great, and the employees are the best.  Their coffee prices are about $1.00 more than Starbucks or Peets, but I went anyway as I enjoyed the vibe.  Recently they decided to turn off wifi on weekends.  A coffee shop without wifi on weekends?\n\nI no longer go to Reveille, although I miss it.  I hope they decide to change their policy on wifi, it shouldn't be all about getting customers in and out as quickly as possible.", "author": "John .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Perfect addition to the neighborhood.  Outstanding and attentive service. Smart crew. Excellent breakfast sandwich (I've been thinking about ever since). Decor is slick and sparse. A definite cut above for this neighborhood. And a great soundtrack.", "author": "Monster B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "The coffee is artisanal and delicious while the decor recalls the mess hall of a 19th century Danish whaling ship. Get the breakfast sandwich with braised kale and leek, Gruyere and bacon. The staff are courteous and cordial.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Love the ambiance,  strong coffee & strong wifi. Avocado toast is delicious, the egg sandwich beautifully constructed. Only missing one star for the dearth of outlets!", "author": "Emily R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Friendly prompt service. The soy latte was OK. The food looked delicious; I'll have to come back to try it. Cute coffee shop to get some work done!", "author": "Sneha P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "I really liked their new location in Castro and found it better than the one in north beach. Interior decor is so bright and modern, they have bunch of good options plus outside seating are under Castro sun. I'm sold!", "author": "Beril Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "Great coffee, nice outdoor area and funky indoor area. Great service and the food that was coming out looked great too.", "author": "Livia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "I was pleasantly surprised by Reveille in the Castro. It's tucked away in a really interesting renovated garage space on 18th Street and it carries a cozy neighborhood vibe, serving as a calmer alternative to bustling Castro Street. The line moved fast and, even on a Saturday afternoon, there was plenty of seating. There's also a cute outdoor seating area out front if you want to people-watch. I had a delicious iced latte and the cold brew.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-02", "description": "This place is quite pricey for coffee, but, hands down, they've got the best almond milk cappuccino I've had in the city. Their egg/bacon/kale sandwich is delicious too. Cute and comfortable locale.", "author": "Shahrzad K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-13", "description": "I'm sure the coffee is good, but my lunch was inedible and the service matched the food.", "author": "Sanford S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-08", "description": "Great space, questionable service. Stopped by for coffee. All milk containers were empty and when I mentioned it to the guy behind the counter he didn't really to care or ask if I needed any. The coffee is ok but Philz doesn't have anything to worry about. I think it may be an ok place to spend some time chatting with a friend, but it's nothing special.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "The avocado toast is amazing! The only problem is one is not enough! The avocado toast is so good I want to eat like 10 of them which is sort of a problem, because its almost $5 each....", "author": "Moran G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "Fav place for great coffee, imaginative and tasty food, wifi/working space, and third-place meetings in the Castro. Plus the staff is consistently engaging and efficient.", "author": "Tim J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Nice hipster coffee shop with a bit of everything and a lot of personality. With a bit of luck this will place will steal plenty of business from Starbucks. After Starbucks up the street remodeled becoming a cold and boring corporate location this place is a breath of fresh air.", "author": "Bartholomew F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "The coffee is still good, but there are too many people here working on their computers for this to be my favorite cafe any more. Too bad, the coffee and the food are pretty good.", "author": "Meredith G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Great coffee!! Egg sandwich is amazing! But expect to wait a long time if you ordered breakfast. Two times in a row I had to go back to the kitchen to check on my order after waiting for more than 15 mins.", "author": "Shelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Went here for the first time today with a friend. The prices are shockingly inexpensive for being a hipster place in the middle of the Castro in the US's most expensive city. I didn't have coffee, but the avocado and egg on toast was delicious. The only downside is that the cashier was a little \"yeah, whatever\" and didn't seem too interested in the customers, but as it was a Tuesday morning, I don't blame him.", "author": "Lia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "This is sort of like the heaven of all coffeeshops. It feels peaceful here, even when it's bustling. I like to sit here and read \"Pride and Prejudice,\" or take a Spanish lesson on Duolingo, drinking a hot tea and eating something delicious. I'm a fan of the roasted chicken sandwich and particularly the BLAP, which, though it sounds like something unfortunate that happens during sex, is actually a sandwich that involves bacon and avocado, two of my favorite things.", "author": "Kent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-30", "description": "Reveille came to the Castro and immediately drew a crowd. I stopped in on the first day and was impressed with the service and clean lines of the decor, had a hushed and leisurely chat with a friend in the corner, and left happy. I came back a week later and it was standing room only. Good for them! Prices are the same as every other coffee shop in the city (meaning you are lucky to escape for less than $4.5 for a hot beverage), but they do have a frequent buyer card where you get one free beverage for every 13 purchased, so be sure to ask for it if you plan to be a regular.", "author": "Marie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "Best coffee shop in San Francisco. I've always met interesting people here willing to strike up a conversation. Their PB&J toast transported me to another plane of existence. Employees are crazy friendly and the coffee is super good. Also, lots of good lookin' gays. Just sayin.", "author": "Caleb Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "I really didn't want to like this place. It's super pricey. $2.50 for BYO mug drip coffee. Hm. That's a lot. They baked goods - wow! And the coffee is REALLY DELICIOUS! It's just so expensive and trendy and crowded and I have the same haircut as all of the boys working", "author": "Megan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "I'm a totally fan of lattes that go down smooth, are strong, and do not require me to add sugar! And Reveille Coffee Co. has that! They have a cool space with good vibes, just be sure if you're coming here to work, your devices are fully charged, there is literally one plug/outlet to charge up.", "author": "Josie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "This place is super laid back with plenty of locals. Lots of beautiful people. We almost could not focus on our food die to the hotness  try the avocado fried egg breakfast. One thing I do not get is the add on tip when you are paying at the register. But it is a nice spot so enjoy.", "author": "Yaya L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-13", "description": "Enjoyed the hearty egg sandwich here. Also love the service and ambience of the place.", "author": "Xteethx B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "Newly opened (as I'm told) I sought haven from the downpour at this Castro cafe. Slick modern monochromatic tiles greet you before you're met by a chipper young chap behind the counter who takes your order. Using this as an opportunity to grab brunch, I order a cappucino and a grilled chicken sandwich (it had me at apple slaw!). The small 2-person tables against the back wall were, as I imagine they often are, occupied by the laptop army so I perched myself upon a stool at the communal bench. I was overcome to see my sandwich came with a side of salad and not chips! The coffee was perfectly poured and stands out as one of the better American coffees I've had.", "author": "Lani P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "The availability of healthy choices in the Castro is limited.  We have plenty of burritos, pizza, and sliders - and now finally we have fresh sandwiches and salads.  Reveille bills itself as a coffee house (and the coffee is amazing) but the magic is in the quinoa salad (pro-tip, add chicken) or the toasted B.L.A.P. (the P is for roasted pear).  The staff is friendly and unpretentious, and even when the line is crazy and the seats are all taken, it's the best bet in several square blocks.", "author": "Jeffrey M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-23", "description": "So chic, cute baristas, good chef, open, white-washed, Franco, and modern; it's your bourgeois-hipster alternative to Starbucks.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "The space, the staff, and the food at Réveille are top-notch. It's a great addition to the neighborhood. The espresso (both regular and decaf) are consistently excellent.", "author": "Christopher B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-20", "description": "$2.50 for a cup of in house coffee and $1.50 for refill?? Are you serious and the coffee was not comparable to the North Beach standards. Next time I will just go up a few blocks and  get the real stuff and leave this place to the hipsters and tourist......", "author": "R H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Yes, I'm a fan.  Great addition to the 'stro and a fantastic alternative to Starbucks just down the block.  Coffee is great, but the food is awesome - I shared one of the flat bread items and it was delish.  Also great breakfast sandwiches.  I'll be back.", "author": "Jim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "Great coffee. Great vibe. Great staff. Great atmosphere. So happy to have them in my hood", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "2nd time here, still a great place for coffee, though a bit tough to find a seat to do work in the middle of the afternoon. Thanks again to that cute barista who claimed I'm \"rocking my hoodie\". Nothing beats good espresso and free compliments!", "author": "Rodney A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-25", "description": "The place is nice but the people are not. I asked for the wifi password and was given it. After I couldn't find the network, I asked for the name and a female barista nastily said it was turned off. No explanation. Don't come here for the wifi !!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-26", "description": "Good coffee for commuters. Not a great place if you have to log in to do some work briefly as it has no internet connection -- I our case. Barista said that hr Internet was not reliable and didn't comp the drinks as we clearly went there to catch up and jump on wifi briefly.", "author": "Angel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "Having been in the US for 12 days (this time) it was very refreshing to come across two coffee bars in the same day that serve real coffee. No offence to any US citizens but ordinarily, coffee is no more than a brown novelty drink.  Reveille however, knows and understands how to serve coffee. We ordered two espresso which were served with a courteous smile, and followed by a very knowledgeable conversation about the origin and mix of the beans that went into our drinks. After chatting with us our server offered us a free espresso and joined us to hear our comments and offer her opinions on it depth of flavours. If you know anything about coffee you will know that this is a place to go and that the neighbour two doors away, is to be avoided at all cost. I only wish this place  (just 2 months old) a long and prosperous life, and that it has thrived and grown before our next visit.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-17", "description": "I am disappointed to report that Réveille Coffee has come back on their promise to serve their granola/yogurt dish in the afternoon. On 3/4/2014 their chef promised to me they would not limit it to breakfast time, and I filed an excellent review based on that.\nI am removing one star for Réveille not serving a dish that most cafés in San Francisco offer in the afternoon, and another star for lying to me. Granola with yogurt is a very healthy and enjoyable afternoon treat. Cafés should set their rules based on customer satisfaction. Boo to the Réveille management for choosing to set up rigid rules.", "author": "Guillermo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "In the 6 weeks since my first review, Reveille has really stepped up in the service department.  I see the same, friendly, competent faces, and the line moves now.  The food continues to be fantastic.  As is the coffee.  This is a high end cafe.  So expect to pay more.  This is now my go to lunch/coffee place.  Just wish the table hogs sucking up bandwidth would limit their stay to under an hour. How does 1 coffee, equal taking up table space for 2 hours???", "author": "EC N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "Great coffee and the best kale salad!!!  I have one every week .. And often must add a flatbread for good measure.  A highlight of our weekend.  So happy this coffee house/eatery has moved to our neighborhood!", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "These guys are great. Good coffee, very tasty food. As a recent Aussie transplant I've been looking for my weekend breakfast spot and Reveille tops the list for me right now. \n\nFavourite items on the menu are the egg and bacon sandwich, the kale salad with turkey and the flatbreads. \n\nOne thing: I wish they had juices. Everything else I am digging. Keep it up!", "author": "Verne S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "Overall I really, really like Reveille. The place itself is really cool and comfortable, everyone who works here is very nice, and everything is delicious. I've liked all the food I've ordered here and think they do a great job with their coffee. Unfortunately they recently raised their coffee prices and I personally think it's now far too expensive. $3 for a small, already-brewed-sitting-in-a-giant-carafe is way too much. I used to go here a few times a week but now I go once a week or less.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "A beautiful coffee shop in the perfect little spot. It's a great alternative to Starbucks in the Castro. The quality of the hot chocolate and the teas are really excellent.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "I've only been once, so I don't have a lot to go on. Pros: good coffee, nice decor, outdoor seating. Cons: coffee is expensive, too many stools instead of real chairs, loud music. Struck me as better for lunch with a friend, than as someplace you would want to sit with your computer.", "author": "Just R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-06", "description": "Nice coffee, nice location, nice decor, slow-slow-slow service. Consistently this coffee place takes their sweet time to make any of the drinks and they are consistently very nonchalant about it. Philz can take the order, grind the beans, mix it how you want it and take half the time of Reveille.", "author": "Dr F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "DONT COME HERE! ...I want it all to myself :)\n\nSuch a rad spot with super nice staff. The menu is a little hidden next to the register, so if there's a long line you best look it up because there's lots of amazing food to pick from!", "author": "Will T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "Hipster cool and simplistically clean decor (white and wood) is a nice compliment to the robust and smooth coffee!", "author": "Stef G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "It's about time a nice fashionable low key place opened in the Castro. This is exactly what the neighborhood needed. Great decor. Friendly. Good food and coffee.  Definitely go. You'll love it.  And if you don't, well you should.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Fresh and modern, those are the two words that define this amazing cafe! There food is amazing, its officially my new dinner spot!", "author": "Adedai K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "Used to be amazing, sorta gone downhill in recent months. On the most recent visit, the cafe interior smelled extremely bad, the coffee was bitter (not in the good way), and the music was boring.", "author": "Viren J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "Just stopped by for my first time this morning for some coffee and breakfast. \n\nVery friendly staff (although for some reason there were ONLY men employees, no women, which was a little weird to me) but despite that they were all very friendly, very beautiful interior design (great ambience, very clean)-they even had a cute ass bathroom.\n\nThe coffee was great, I ordered a latte. I usually like my coffee sweet but I didn't need to add any sugar, the natural flavor of great coffee and milk was just right. For my breakfast I orderd the egg sandwhich, it was delicious! The bread was amazing, the egg, kale, (and I think cheese was in there) were all very flavorful-it kind of tasted like a quiche. My meal cost me $12.\n\nThis place has great coffee and food and a beautiful interior/ambience. This place made me feel classy. If you're ever in the Castro I think you'll have a good experience here.", "author": "Jena W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "Nothing wrong with a good ol' hipster cafe. When I asked how it was pronounced, the guy behind the counter said it was \"ri-Vay\": \"Ri\" as in ribbon and \"vay\" like \"Oy vey!\" Anyway, I'm not a coffee drinker, I come here for the tea. I could see it being kind of annoying, but I actually appreciate the fact that they seep your tea for you (assuming they aren't re-seeping the same leaves after someone else's order.)\nEdit: After going back to try Reveille as an internet cafe, I was annoyed by 3 things: One: Though they clearly encourage people to work on their computers, there are NO outlets. Once your computer runs out (very quickly for mine) then you'll have to move on. Two: The shakshuka, which was recommended to my by a friend, is not available after breakfast. Instead I had the avocado toast, which is pretty good. For some reason they treat it as a breakfast item. Third: I'm from the south, and I don't particularly like my iced tea to taste that floral.", "author": "Nik K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-14", "description": "$3.00 for a small cup of iced tea.  I didn't know that gold can be made into iced tea????  wow", "author": "Bennie F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-15", "description": "finally! a nice relaxing coffee shop in the Castro with lots of decent seating (including a nice front patio), music that isn't meant for a dance club, good pastries, friendly staff, and open past 7pm. hallelujah.", "author": "LA M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Tasty breakfast options (if a smidge limited). No decaf iced coffee, but they can do iced espresso drinks so that works. BEAUTIFUL space to sit and enjoy your coffee/food, either with your existing friends or with new ones at the communal tables.", "author": "Roger G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-24", "description": "great coffee and great staff. I went in for a late night coffee and after I put in sugar and milk it was warm. I love hot coffee! Maybe it was their last pot. I asked if they had any way to warm it up. I was offered another cup and after trying it black it just was not hot enough. The barista asked if I would like an Americano. I took a double Americano and yes it was piping hot!! They were awesome and I felt they were really concerned and were happy to help. Thanks Revielle coffee! They also serve breakfast and lunch. I'll be back!", "author": "V M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-08", "description": "Hipster ditch cafe filled with CAMPERS that hog the tables for hours with their laptops. Too bad, because even though the coffee is bad, the food is great!", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "Their iced lattes are anything but watered down. It had the perfect balance and I actually liked it better than the way they make it at four barrel even though they use the same beans. Tried half of the egg breakfast sandwich and half of the avocado toast with egg and they were both very flavorful with perfectly cooked Sunnyside up eggs. This place will definitely be receiving a visit from me in the near future!", "author": "J M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-15", "description": "I was in the City and thought I would try something different. REVEILLE COFFEE looked nice. Long line, must be good. Turned out to be a long line because it was a slow line. I agree with others about the attitude...and so early in the morning. Asked for the wireless password, which turned out to be a phrase with the word \"don't\" in it. I spell don't with an apostrophe. Not them. I asked a second time and got a good dose of the acclaimed attitude. I guess they don't put an apostrophe in don't. Had a looked-good-but-just-OK egg sandwich for $7.50, with a cup of black coffee, $11.15 total. Ouch. But OK, it's San Francisco. However, the oddest thing they do is, after they enter your order into their computer screen, they turn the screen towards you and have you then choose a tip amount from three choices on screen. It looked as if it was -$1-$2 -or $3 if you got just a drink, and 15%- 20% -or 25% if you got more than just a drink.  I can't say this for sure, but it's my best guess. And of course everyone in line is watching you, so you don't dare be cheap. This place may be trendy, but not for me.", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "mmmmmmm I like love this place", "author": "Frustrated W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Ohh so nice and so clean...live the vibe the coffee and all the helpful & eager staff. I know it's new in the neighborhood I just hope it doesn't loses it's charm. Staff is great and the vibe is nice.", "author": "Elena T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-11", "description": "Beautiful space, very tasteful ! Now, the staff needs to be more hospitable, friendly and not so \"cool and hip\". Smile ! Take away that \"attitude\" or nonchalant behavior, as if you were so \"unique\". It's just coffee ! I'll give it another try and hope they get it. Or hire better employees with a more friendly personality.", "author": "Jorge A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "very well designed space, indoor and outdoor seating with a cool atmosphere and delicious food.", "author": "Allison R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-10", "description": "IKEA meets attitude meets yoga studio. This place was weird, to say the least. Came in with 2 other friends. One ordered tea, and the rest of us lattes. The women at the counter was vert \"peaceful\" and pleasant and presented out Tea friend with a very nice tea set, if you will, which was very cool. Sh said we should wait for our lattes which should be ready shortly which she be readyin a bit and to have a seat. No worries, of course, so we had a seat. And we waited. and waited. and waited. and waited. there were maybe 10 p[eople there. No one waiting. Suddenly we barely here the barista (I use the term lighetly) say it was ready. We go and grab them and they were barely warm. he said he had been calling is for some time (?!) with an attitude (I think he is Brazilian  (I am South American myself, so I think I am pretty close). The furniture in that place if it is not IKEA it is VERY close. We start talking and the staff ( NOT the patrons) look at us like we are talking through megaphones) after 15 minutes we get up and leave and head to my Tea friends house. Unless you want to be completely alone and just plug away with your head set and deal with attitutd with cheap furniture, stay away. price wise, same as starbucks.", "author": "M F."}
