{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "They may not have the best dim sum in the city but service is excellent. It's always fast and attentive. Food are great.", "author": "J L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "Ate dinner here last night. Steamed chicken and Walnut prawns come out....... Then NOTHING. We basically finished it and had to ask when our other food was coming. Took a very long time and by that time we weren't really hungry anymore and were frustrated.\n\nI've been here for dim sum before and it was ok but dinner was a disaster. Only came here for dinner because the wait at Yan Yan was 1.5 hours which in hind sight would have been a much better choice.", "author": "William S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "S&T Hong Kong Seafood for Dimsum during lunch time is not worth it at all. All the dumplings and noodle taste very bland and a lot of the items tasted a little extra steamy like it was microwaved. The prices for eat dish was quite pricey, just heads up.\n\nThe waiter that helped us constantly went outside for a smoke break, and I never seen him wash his hands when he comes back...\n\nThe location here is quite small, apparently it gets busy on the weekend since this is one of the only Dimsum spots in Sunset area; definitely would drive extra 20 minutes to SF Chinatown for Dimsum next time. \n\nI wouldn't come back to this location, sorries. Hopefully their dinner is a lot better than their lunch menu.", "author": "Joey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "Came here at 1pm on a Sunday and the two of us were seated right away. Despite seeing reviews with vermin in food (which is usually an automatic no for me) we decided to give it a try.\n\nFood: every dish lacked one ingredient - flavor.\n- siu mai: no flavor, small & sad\n- baked BBQ Pork bun: filling was good, bun was bad. Very small \n- pan fried turnip cake: this was fine \n- shrimp stuffed eggplant: no sauce to help the flavor along. Tasted only like oil. Eggplant was slightly undercooked.\n- deep fried shrimp ball: smaller than standard but was well fried. Couldn't really taste the flavor of the shrimp paste and was pretty bland because of that. Doused it in sweet and sour to help it go down\n- Shanghai dumplings (Xiao long Bao): skin fell apart 2/4 of them because it was stuck to bottom of the tin. No soup and lacked flavor.\n- shrimp noodle roll: standard, which was better than everything else we had\n- har gow: also standard which is A+ for here\n\nService: I don't really consider service at dim sum places. Only here for the food. Water is $1 (legal?) and tea is $1.25 (not uncommon). Have to ask for soy sauce & chili sauce.\n\nI have dim sum every week in the bay area and this fell below even average expectations.", "author": "Dani T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Came here for Dim Sum on a Sunday. Above average standard dim sum fare for a reasonable price. I can't speak for the regular menu - but this is place is a good four star dim sum joint.\n\nFor the dim sum - you make your order on a piece of paper. I didn't see carts moving around but all the standard delicious standards are here.\n\nWould definitely come back again.", "author": "Doug R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-20", "description": "A decent dim sum and chinese food spot, but the prices here are insane! Coming from southern california/the 626 area, I can't imagine some of the prices I saw at this spot. \n\nThe food is alright, but for this price, there are probably a half dozen spots on the same street where you can grab a similar meal!\n\nThe service here also didn't leave the best impression on me. Slow and rude, and if you're going to have a stereotypical asian restaurant, you should at least have corresponding prices on your food!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "If there is 0 star, would definitely leave a zero for this place.\nThe waiting time for getting seats was not too bad, but once you ordered, it took long time for the food to come. We ordered 1 extra and waited for 25 minutes still not come, then decided to go so ask for canceling this one, the manager refused and added it to the bill, and forced us to pay because she said the food is coming and we need to take it. However, they took away our plates and cleaned up the table, we explained that we don't have time to stay but the manager brought new plates and asked us to wait for the food to come, totally ridiculous and she was giving attitudes and no apologies for the late of delivering food.\nSuper rude host and the food is just okay (if not bad), definitely not worth to come here.", "author": "Taier G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-11", "description": "Awful service, terrible owner who have a resting \"B\" face and screams at her staffs! \n\nOur was reservation at 5:30 and my sister was running late at 5:45. The owner comes screamed at us, we need to start your food, I need this table back @ 7:00?!? Why is that our problem?!? You should not have booked your reservation so close. To make the experience worst the waiter handed us the bill, we questioned if the tip was included he goes no but I'll add 18% for you.How is that illegal for CRAP food and service. \n\nBottom line: food is mediocre, dirty establishment and service is awful = will not be returning!", "author": "Tina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "One of the better Chinese Restaurants in the area with friendly staff (the owner can be loud but she's actually very friendly with everyone).  Their food is pretty yummy here and you get a  healthy portion of delicious food. The staff and kitchen can be real accommodating for dietary restrictions and everything comes out piping hot.  \n\nYou will pay a premium for seafood but you get good quality. We paid $38.00 a pound for Geoduck (was 4 pounds) and it two ways; sashimi style on the tail and salt and pepper with tofu for the head. Was made perfectly and the portion appeared close to 4 pounds. I always go for their soup of their day which varies but it's very good. In fact, I jokingly asked the waiter if we can have a refill. He came out with another pot! To be honest, I haven't had anything here I didn't like or that did not taste right or too greasy. My only complain is this place is very busy and the cleanness could be better.. way better.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "3.5 stars. Neighborhood dim sum in the Sunset District. The service is surprisingly decent because I think the owner is very hands-on. Food is also decent too. My family loved the meal!", "author": "L S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Ahhh.  San Francisco.  Late August, typical grey sky (Indian Summer had not yet arrived), a fresh chill in the air.  After circling the block several times, we got lucky and managed to wedge our car into a parking spot with a tinge of \"pink\" on one end.  And all for a late Saturday night nibble in a slightly seedy, little Cantonese restaurant in the outer Sunset that our Taiwanese AirBnb host had recommended.  \n\nWe had a brief pause to scrutinize the menu while sitting in the only two seats in a waiting area that accommodates 4.5 people, before they escorted us to our table.  They were busy, loud, and I was one of only two non-Asians in the lot.  That was a good sign.\n\nAnother \"ahhh\".  This was my reaction as I slowly sipped my intensely fragrant jasmine tea.  I started dusting off cobwebbed memories of \"SF past\" , the smells, the tastes, the feelings that had been lovingly stored away, ready and waiting to emerge when I finally returned to The City.  I'd been gone way too long and I had only 4 days to make up for lost time.\n\nWar won ton soup on a crisp night was a given.  The delicate broth with delicious meat filled dumplings, sharing the bowl with shrimp, scallops, squid, bbq pork, chicken, and bok choy was so satisfying.  We were good. We slurped in peace.\n\nWe added a pork and oyster pot dish that also featured tofu, shitaki mushrooms, whole garlic, and ginger.  Lets not forget the one bowl of white rice we shared, as we unsuccessfully tried to avoid white starch.   Just can't do that in a real Chinese restaurant.  \n\nMy frugal nature always dictates that leftovers not be left behind.  And while we had plenty, that's ok, we had a little refrigerator in our Airbnb room.  \n\nDammit, do these leftovers mean I now have one less opportunity to knock off a bookmark in SF?  Nah...not gonna happen.", "author": "Wendy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-20", "description": "This place used to be so solid. Food is still pretty good, but they used to be excellent. Dim sum is good. Place is getting really old and runned down. Really in need of a remodel or at least a thorough cleaning and overhaul.", "author": "Ming W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "I always come to S&T because it is near my house, and it is one of the more upscale chinese restaurants in the area. It isn't the cheapest place by any stretch of the imagination, but it's a good option for family style dinner's or dim sum lunch. \n\nThe service is the most subjective part of this restaurant as it appears from reading other reviews. I personally have not had any major service issues with the waiters and waitresses here. They are all quick on their feet and are almost always occupied; no one being complacent, standing around doing nothing!\n\nAs for the food, most options are pretty good, and the portion sizes are fair. It is a seafood restaurant after all, so definitely try out their selection of seafoods.\n\nI took a star off for the long wait times during rush hours, and the noise levels. It's sometimes hard to hear someone from across the table here, so you feel left out in conversations :(", "author": "Golden H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "I guess I would consider my grandparents high rollers of ST Hong Kong Sea Food. Our family has been going here since the 90's. The waiters always take good care of us and are very attentive. They give us new plates when its piled with crab shells, refill the tea pot when it's empty, and sometimes even give us free dessert. \n\nFood is consistent, never had any major problems when we come here. Always looking forward to lunch or dinner here with my family.", "author": "Nicole Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "Good basic Chinese food in outer Sunset district of San Francisco.  The restaurant prepares the basics well- Mayonnaise Shrimp with Walnuts, Ma Po Tofu and Beef with Radish Soup.  The deep fried Flounder with. Soy based sauce was good.  I especially like the Abalone Mushroom with Broccoli in Oyster Sauce.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "This place has rats and roaches. The tables in the back of the restaurant are especially dirty and the carpets are stained from years of... something. Would not return until they clean up.\n\nOwner lady can be somewhat of a b*tch with her attitude. The waiters are great and nice though.\n\nFood is pretty good.", "author": "Gordon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "I've been here a couple times and, for the price, this place can satisfy your cheap dim-sum cravings.\n\nI like the sticky rice in a leaf, soup dumplings, siu mai, fried rice, and a couple more items but I can never remember exactly what I get as I just keep ordering and ordering. The calamari here is only $2 and it is pretty good!\n\nThe soup dumplings are not the soup dumplings you think.. They are actually dumplings in soup. I believe the Shanghai dumplings are the pork soup dumplings that many come here looking for! I only mention this because I came here and ordered the wrong item 3 times before getting the item I intended. \n\nThe service is alright. They get confused by what you're saying kind of easily, so make sure you're explicit with that you need and you'll be fine!\nP.S.: Big thank you to the servers who recognized me during my last visit and gave me a complimentary dessert! You rock!", "author": "Alexi G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-12", "description": "Price is expensive for what you get.  The restaurant itself looks fairly clean but looks can be deceiving.  During our meal, we happened to see a small mouse running around on the floor under the table next to us!!!  Felt pretty disgusted afterwards.\n\nWe told the staff and they just shrugged it off as if it was nothing.  Sigh.....", "author": "Alejandro M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Thanks to a hook-up, our annual friends-giving dinner was hosted here, with one unique aspect - they prepared a king crab that we had imported in from Norway. It was pretty fantastic - we got to see the crab, live, before it was whisked into the kitchen to be prepared several different, delicious ways.\n\nTHE OVERVIEW.\n+ Decent parking available on Noriega and up side residential streets\n+ Fast, efficient service, with almost too many dishes coming out at once\n+ Each crabby dish was incredible, from the salted egg fried crab, to the noodle-y dish, to the custard baked in the crab's head\n+ Extremely reasonable pricing for all the food our table consumed\n\nThis was a filling and delicious evening, for sure.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-03", "description": "The food here is very good. Not quite excellent but definitely what we had was flavorful and worth having again. But there are a couple of minor issues and one major issue that could keep me from returning. \n\nWe were there for a family dinner, Six adults, two toddlers and an infant. We had reserved a table and it was ready when we arrived on-time at 5:30pm on a Saturday night. I found it somewhat annoying that the server tried to dictate where the children should sit before they arrived. It was quite obvious that he was trying to maintain a traffic lane in a restaurant that they had overbooked with large tables. While this is not uncommon in Chinese restaurants, especially around Lunar New Year, the Fire Inspector might find issue with this. \n\nThe woman manager/owner? had a very bad habit of yelling across the restaurant at her staff as well as customers. Perhaps she has hearing issues? Either way, this is inappropriate and quite annoying in a crowded restaurant. \n\nThe worse is the condition of the Men's Room. We were there early in the evening and it smelled horrible. There was water on the ground, paper products on the floor. It needed a thorough steam cleaning and bleach disinfecting. I hope that the kitchen is a 1000% cleaner.", "author": "Dexter D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "I would give a ZERO star if possible. Worst experience everrrrr! Today is freaking Mothers Day, where all ppl should be happy and cheerful about! But the owner is so freaking rude and have people wait for freaking 1 hour straight without any food, despite the fact that you were already seated! The machines were broken, and the staffs just told people to wait wait wait without any compensations. Staffs forgot peoples order and have the customers waited without any apologies. Never come here if you want to have a good time. All frustration and drama!", "author": "Ryan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "So far I think S&T has been my favorite dim sum in SF. Dim sum is pretty hard to differentiate, it's all steamed or fried at the end of the day so the difference with each restaurant is basically quality of ingredients and execution. While other places I've tried in SF are overpriced, S&T is more fairly priced while still offering the same variety of dim sum options and slightly higher quality than what I've tasted around the city.\n\nHere, you order from a piece of paper, and waiters check on the list and bring items to your table. I think they also have carts around but I also like this paper method to see exactly what the restaurant has and so that you can easily order your favorite items. I tried the Chinese broccoli, xiao long bao, har cheung/shrimp noodles, ribs, shu mai. taro pastry, egg tarts, and all were tasty.\n\nIt does get really busy on the weekends, so come before 10:30 if you don't want to wait. Other than that it's pretty easy to order, has most of the options to satisfy a small or large group at dim sum, and is likely to become my go-to dim sum in SF!", "author": "Steven V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Adapted to local Hongkong-nese taste, EVERY dish is scrumptious. The chef is simply the best chef, not forgetting the excellent service!  Highly recommend pork feet, chicken, steamed/stir friend fresh grouper, spot prawns, and pork neck. Been frequenting for years--quality is very consistent.", "author": "Paulette T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "My family and I were looking for somewhere to eat around the neighbor. We were having late dinner since we just came back from a Labor Day weekend short trip. We felt bad asking if the places are still open for business at 830. Most of the places were not welcoming except for S&T! We didn't take our sweet time and we went ahead to order the entrees. We had seafood fried rice, BBQ pork, sizzling beef and chicken chow menu. The food was really juicy, tender and just flavorful. In addition the service was really friendly.", "author": "Kay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "Serviceable. I came here for lunch on a weekday afternoon. No wait since it was in the middle of a weekday. Their dim sum was okay. If you don't know much about dim sum, this place will be great for you. However, if you're Chinese and frequent dim sum restaurants a lot, this place is average. I've had better, but this place isn't bad. They made the fook kin fried rice pretty good, though.", "author": "Edmond T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "Great hot and sour soup and a huge variety of food. Wait can be long and the service is just \"ok\" but it's always packed so that says something. Very authentic and the seafood options are fresh and tasty.", "author": "Laurel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "Solid dim sum - gets busy by 11am, so if you don't want to wait on weekends, arrive by 10:30! I've been here with family a few times previously, and I think I had remembered the food being a bit better than it was... but on my latest visit I tried quite a few items:\n\nShrimp dumplings - good standby, wrappers seemed a little overcooked\nShiu mai - a bit more seasoning could be good\nShrimp and chive dumplings - I really liked how they executed these! Lots of filling and good pan-fried wrapper texture.\nBean curd roll with pork - Texturally really nice but also a bit underseasoned\nCalamari - A little greasy and underseasoned as well, but fairly cheap at under $3\nChicken feet - Tasty! Just wish the portion were a bit bigger for the price.\nSalted egg yolk lava buns - Had to get these since they're the specialty! Hot and sweet.\nSesame dumplings with peanut flour - Lacked uniformity as you can see from the photo, but the filling was sweet and the mochi was good.\n\nOverall, more flavor would really improve the dishes. Their menu is very extensive, though, so it may just be a matter of trying different items - which I will definitely do the next time I come by.", "author": "Delia Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "I had read the comments about the health issues but decided to give HK Seafood a try anyway. Well, turns out they were very true. Ordered some bok choy dish and each head was full of sand D: The other dish I got also wasn't as good. Bummed because I really wanted to like it as the workers are nice but unfortunately impossible...", "author": "Hello E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "There was a cockroach in the chicken feet. Glad that I wasn't that hungry and eat it immediately. So gross..", "author": "Justin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Before going on a Pokemon adventure, my friends and I had to fuel up. My friend suggested this place because it was his go-to dim sum place. \n\nThere are no carts or ladies yelling dim sum names. We filled out a sheet of paper and orders came out whenever it was ready. I guess this is more efficient, but sucks for people that don't know their dim sum well. \n\nThe one dish that I judge at dim sum places is the shrimp rice noodle because it is my favorite dish and so many places can't make it right. Not this place though! The noodles were soft and thin enough that when you try to grab it with chopsticks, it will break (unless you are super skilled with chopsticks). Not the silkiest noodle though but I still enjoyed it a lot. :) \n\nService was surprisingly good. They cleared the table quickly whenever they saw an empty dish. I don't expect much service from Chinese restaurants because I don't go to them for that, so this place certainly exceed my expectations. :)", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "One of the waiters was extremely rude. In the dim sum paper, it said water is $1 and that tea is $1.25 per person. We only requested for hot water and they charged us $1.25 per person. It is not a huge amount of money. The attitude of the worker was unacceptable. He said to go talk to the owner who isn't here, so I said that I shouldn't pay them since they can't resolve our issues. He just walked away and I had to request a different waiter to get the bill so I could pay. I'm not sure he knows what business he is in. This is a service business and people have many places they can go to eat. If you can't treat customers nicely, you should get out of the service business.", "author": "Janice L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "I went to S&T for the first time today and I felt like I went in a time machine to my youth.  Growing up Chinese and needing to be careful with money we were in places like this all the time.  If you are repulsed by spotty service, sketchy bathrooms, Dragon Lady owners, and all Chinese clientele, then don't bother.  To me, that's all part of the je nais sais quoi.  Those are all the things you ignore because you want a place that spends its energy on making excellent food.  \n\nHere's an example:  the roast duck.  A duck is not like a giant Costco chicken where you can pull off giant hunks of boneless meat.  A duck has a lot of bones in it.  You can pay $20 for the Peking Duck and avoid acknowledging that, but when you get the $6 dim sum plate, you're getting about seven pieces of duck and three of them are more bone than not.  But I put those pieces in my mouth and I remember... notice that this crispy skin is righteous!  Notice that the amount of salt is just perfect.  Note that the fat is cooked enough that you just want to suck on it.  Dealing with the bones makes you have your moment of Zen... you can't just shove it down and fail to appreciate these nuances.  Then you go back to the meaty pieces and really enjoy it. \n\nOr let's try the Chinese broccoli.  Sure it's a huge plate because vegetables are relatively cheap.  But it's cooked perfectly... all the bitterness is gone, but the crunch is just right, and the oyster sauce complements the actual taste of the vegetable perfectly.   They are artists back in that kitchen.  \n\nDumplings are good, but actual bite sized.  I admit I've gotten used to places where they make the huge ones, but dumplings are meant to be a one-bite experience.  Have it that way. \n\nI actually can't wait to come back.  I wish I could take my dad.  He would call it soul food.", "author": "G M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-31", "description": "My mom wanted to come here for dim sum on Memorial Day.  Yeah yeah yeah, it's gunna be a long wait time, it's a holiday, it's going to be busy.. whatever.  We still went out as a family of 5 to eat lunch.  \n\nThis isn't the usual place we go to get dim sum but we decided to try someplace new.  So we get a number, wait a little long to get seated but we were OK, we get seated, take our order on the paper (where you mark the quantity of dishes you want), then waited. And waited..... about 20 min pass and we ask 2 waiters to check on our order.  Nothing happens... Literally, the waiters didn't even come back to our table to inform us of what happened when they \"checked\" on our order.  Wait another 10 minutes and my mom physically gets up to go to the front desk area and ask the lady owner (definitely the owner bcus we saw 4 framed photos on the wall with lady owner IN the photos).  Once my mom asks, lady owner is INSTANTLY annoyed and starts barking in Cantonese (and I can understand everything) to all her employees and realize that our order was never even put into the ordering system. \n\nMy fam and I were patiently waiting, seriously, so patient that we had the time to check out the interior of the restaurant to look at the owner's framed photos on the walls..\n\nSo finally she says, \"1 minute, your food will come out\" and she starts off with dessert.  The almond jell-o dessert thing we ordered.  Which was fine.. but really... as our first dish... Alright lady.  We ate it anyways of course to pass the time..\n\nThen it gets worse, we wait again for a more.... hot dish... then a waitress takes out noodles (like an egg noodle chow mein dish), then sets it onto the table... my brother uses his chop stick to instantly dive into the noodle dish to put some on his plate.  Then ALL OF A SUDDEN the waitress says \"Opps wrong table\" and takes the dish back while my bro is MID-GRABBIN in the noodle dish already.  Literally noodles fall off of the dish and onto the table and the waitress picks it up with her hands and says \"It's ok, it's ok\" and puts it back onto the dish and walks back into the kitchen direction.  I was literally so disgusted.  I already know FOR SURE she was going to bring that dish back into the kitchen and serve it out again onto the correct table.  Fucking gross.\n\nSo my family and I are almost traumatized (maybe a little exaggerated term, but you get what I mean) at this point after everything that has already happened and then when another server was taking out some steamed dim sum to another table, the lady owner grabs the dishes from the tray while the waitress is holding it, checks all of the steam containers and whichever one we ordered she just threw them onto our table and says (in Cantonese) \"just serve this table first, they're whining and complaining.\" EXCUSE ME LADY OWNER????!?!??!? Omg at this point I really wanted to say something but tbh she prob wouldn't have understood me anyways with my broken ass Chinglish accent. \n\nAll the waiters and waitresses literally all seemed so stressed and tired out...  Probably cus it was busy but probably more because they have a barking boss lady that makes them all stressed out! Trust me, I was a waitress before, bosses need to chill and be coo if they want to run a good-serviced restaurant.\n\nBut anyways, woah lady owner you need to fucking chill.  Your food is coo but your attitude makes your restaurant disgusting.  How dare you go around to your CUSTOMERS and tell us that we're whining and complaining RIGHT in front of our faces, when you literally are the one whining and complaining to all your startled employees.. Super disgusting and rude. I give some serious props to your employees who work for you.", "author": "Tiffany Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "I love coming here for dim sum because I never have to wait in line!\nDim sum here is good AND it's inexpensive compared to Koi Palace or Dragon Beaux. Though they don't have any fancy squid ink dumplings or truffle buns, they have the classics, and that's all I need to leave full and happy. \nEach small dish ranges from about $3-$6 and come with pretty generous portions too. I usually come with one other person and our bill is always under $35 which is a STEAL for how much food we got. We had a lot of leftovers to bring home too. \nIf your usual dim sum spot is too busy, check this place out!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Average Chinese restaurant that serves dim sum in the Outer Sunset, you don't see many restaurants serving dim sum in the Avenues these days. From the best of my knowledge this was the old Tai Wu before the King Drive location. The furniture and decor is a little bit dated and there are a lot of pictures of the owner lady and famous people around the restaurant which makes it look a little tacky. The dim sum here is decent, you order off a paper menu and everything is made to order. We ordered the Spare Ribs, Siu Mai, Har Gow, Pork Blood, Beef Balls and Beef Chow Fun. The Spare Ribs had a weird taste, but the Siu Mai, Har Gow, Pork Blood and Beef Balls were on point. The service here was good, the waitstaff were very polite and did not rush us despite coming towards closing time. I speak Chinese, but I did overhear the waitstaff speaking good English with some of the customers. I had a good conversation with the staff during my meal and they seem to be very friendly and customer service oriented. But a thing they can improve on is their sanitation in terms of the bathroom and cleaning the carpet. Overall gets the job done for dim sum in the Avenues.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-01", "description": "I've been here for dim sum and dinner many times.  I am pleased with both meals.  Dim sum is good and fresh.  Best is that it's consistent time after time. My favourite dim sum here is the boiled tripe. It's very tender and easy to bite!  The shrimp dumplings, Siu mai, shrimp rice rolls usually come out piping hot.  Service here is also quite good. There are a lot of waiters on guard so it's easily to wave someone down.\n\nDinner is also very good. No matter what you order, there is a certain level of quality to it. Even when we ordered their house soup, it was delicious!\n\nThis is not your local cheap Chinese joint. This is pricier than most of the Chinese restaurants in the sunset. I think of them as the Koi Palace of the sunset. Not as pretentious but offering a similar level and quality of Chinese dishes.  I really recommend this place. Their food is excellent!", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-07", "description": "Open on Labor Day. \n\nThe dim sum was good. Pretty standard to what you will find in the Bay Area. Lowest priced dish is $3 and ranges to $11 noodle dishes. \n\nThe sticky rice wrapped in lotus leaf was my favorite dish. $5 for 2. \n\nThe service is curt and just trying to run the business. Hence... All waiters are on the struggle bus. Running around to place dishes, bus tables, refill waters all while trying to take more orders. \n\nOverall: pretty clean. Service wasn't horrible. But probably will not return.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "My extended family likes to come to this restaurant since the 10 course banquet meal is cheap and the food is good. I thought the food wasn't bad. It's your typical Hong Kong style food with the cold appetizers, steamed fish, fried rice, shrimp and walnut prawns, etc. The pumpkin and salted egg coated crab was the unique dish from the offerings. Food was saltier to me. Service was fine as the waiters were attentive to our party of five tables.\n\nSeparate men and women bathroom. They are smelly and have wet floors.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "Good food and pretty quick service! But dirty carpet and bathroom need a makeover for sure . It's become unattractive to customer. Recommend to anyone who doesn't care about anything else but good food.", "author": "Eindra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-16", "description": "Dim sum was good today. Better than I recall from the past. A bit salty as I felt fairly thirsty hours later. The waiters were nice and I saw the owner working hard taking care of the bills.\nThe 5 of us ordered doubles of 6 dishes and all tasted pretty good. I liked the bamboo wrapped sticky rice the best. It was moist and full of stuffing.  Siu mai and har gow were good. The special pan fried chow menu had too much gravy but tasted good with lots of shrimp and squid mixed with mushroom, bok choy and pork.  The fried taro balls were good too. Egg tarts were tiny and just Ok.\nI would consider another trip to try other things but will have to load up on water to flush all the salt or msg out.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-03", "description": "I could care less how many famous people have eaten at S&T.  I would never return again after eating there for dinner.  This place is too dirty and too expensive for the type of food, service and ambiance you get.  \n\nIf you are a new customer, they sit you in the main dining room, where the decor is nicer and the service is a little better.  Unfortunately, my grandparents have eaten there several times so we were considered the \"regulars.\"  We were seated in the other room which was incredibly old, dirty and completely unappealing.  Keep in mind, you get charged the same whether you sit in the nice room or the not-so-nice room.  All the chairs in the other room were so gross - upholstery stained/soiled, ripped and disgusting.  They have no shame as some of the chair backs have duck tape wrapped around them.  \n\nWe ordered 8 dishes, which was more than enough for our table of 7.  Every dish that evening was incredibly greasy and laced with MSG.  It literally gave me a stomachache.  The portions are huge but not worth what you pay.  Quality is just fair and none of the ingredients were that special.  Service was lacking and I was unimpressed by the owner's presence.  She is the lady with the short spiky hair in all the photos on the wall.  Overall, poor experience and regret having dined there (although wasn't my choice).  The total tab was $138.  I could have spent my money at a different Chinese seafood restaurant and gotten a much better meal and experience.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "Dim Sum on a weekday. Service was a bit surprising; there were some odd things, such as chili sauce and soy sauce seem to be in short supply - needed to request the small amount again and again. On the other hand, immediate attention to an additional chair to hold my brief case & my guests purse was appreciated not requested and UNEXPECTED. Service was a mishmash of tremendously great , and terribly bad. Since I like mishmash, it was fine. Hilarious encounter w/ a recent immigrant posing as a service person was the stuff of SNL, gotta just laugh and move on!\n\nThe owners picture w/ Mr. Ed (da mayor) on the wall, establishing \"credibility\". Thought the food (Dim Sum) was A-OK. not great, a couple of dishes a bit aged (cooked in a prior dynasty). \n\nOrdered a variety of Dim Sum dishes using the archetypal order sheet and pencil. Bill was $52.00 for 3 of us, w/ the rounding tip of $8.00 it was a $60.00 ante for an a-ok Dim Sum lunch for 3 w/ a few pieces left to take home. Nota cheap joint, but overall it was A-OK. \n\nProbably will be back if the Dim Sum mood strikes on Noriega, OR to sample their Cantonese fare; although their capitalistic restaurateur bent has caused Singapore, Malaysian, Thai style noodle dishes to appear on their menu. Its EssF so gotta love that international flare of fare.", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-30", "description": "We were kind of late for dim sum, but still few tables here. Looks like full of locals. I was hoping of dim dim carts, but not many places have carts nowadays. \n\nWe checked off some regular dim sums from the dim sum card, 3 of us, we ordered 8 items .. still have a bit left overs.\n\nChinese Chives with Pork Blood - I am not a fan or pork blood, but hubby and mother-in-law likes it.\n\nSteamed Rice Noodle with Chicken and Bitter-melon - I like the rice noodle, silky, smooth and chewy.\n\nNext was our typical items:\nSteamed Bean Curb with Meat, Steamed Malay Cake, Chicken Feet in Abalone Sauce, \nDeep Fried Shrimp Ball, Fried Calamari.\n\nOnly item I was very disappointed was the Chicken Feet in Abalone Sauce, chicken feet was hard! I think I will stick with my regular steamed chicken feet next time.\n\nFinally, my must get every time I can to any dim sum place (I should really learn how to make this): Runny Salted Egg Yolk Bun.\n\nThis place did a very good job. I love it so much!!!\n\nI would come back for this bun!", "author": "Sandi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "Came here for lunch on a Sunday around noon. The wait at that time for a party of 3 was about 10-15 minutes, not bad. \n\nHere is probably my main reason for writing this review; we were seated and a waiter brought us tea (tea is $1.25 a person...water...tap water is $1 a person....absurd!!!). If you order tea, water is free.\n\nThe quality of dim sum is okay, probably won't come back (when I came to S&T in the past, it was always for dinner). Portuguese egg tarts are kind of a rip off, literally the regular egg tarts with some char on the top. Highlight of the meal, as always was their char sui, always a must get, day or night.", "author": "Ray K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-11", "description": "What do you do when you want Cantonese food but don't want to brave the crowds or the dirty streets of Chinatown? You head out to the Sunset district and find a place along Noriega St.\n\nThe other reviews are true, the rice noodle dishes such as ha cheong (shrimp rice noodle) are done particularly well here. Lo bak go (turnip cake) had a nice crunch to it and definitely better than most I've ever had. Another staple 乾炒牛河 (Dry beef chow fun) although slightly under seasoned was at least not overly greasy.\n\nNo old ladies pushing carts around but my otherwise pleasant late lunch at 2:30pm was constantly being interrupted by the owner shouting detailed instructions in Cantonese to her staff on how to set the tables. Really? What's the big deal? I don't think the dinner rush is going to happen for at least 2 hours. And if you really need to tell your staff that when setting the table there should be a plate at each setting there is something seriously wrong. My mom suggested I should make a recording and play it back for the owner just so she can hear how silly it is for a customer to listen to this nonsense. Come to think of it, I may do that the next time I'm in town.", "author": "Glen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-19", "description": "Stopped by to have some dim sum since it was the closest place to where we were. Service was nice. The restaurant is not too big but they have large tables. Boyfriend and I had some usual good dishes: pork ribs, har gow, shrimp wrapped in rice sheets. Although we had some not so great dishes: the siu mai had a weird flavor of old meat probably from being frozen, the soup dumplings had no soup in them and the meat was all mushy along with the wrapper, egg custard tart's pastry was not baked long enough to make it crispy but the custard part was not bad. The dishes ranged in price from $3-$5. \n\nOverall, sadly we were not super happy with our dim sum experience here. We couldn't even finish two of the dishes.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-10", "description": "They don't know what a reservation means. Unbelievably stupid, owner starts yelling at staff", "author": "Wilson K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Food: Delicious and plenty of choice. \n\nService: Good\n\nParking: Not too difficult to find parking around the restaurant\n\nSpace: Reasonable space between tables\n\nOne of the go to restaurant for family gathering.", "author": "Chin Man L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-14", "description": "Dim sum spot that is less crowded than most in the city. We got seated right away around 12pm, which was perfect for a table of 5. We ordered a lot of dishes along with the lobster noodles. The lobster had good flavor, but the noodles lacked - so don't forget to ask for their hot chili sauce to go with it. The chicken feet was also very flavorful. The Shanghai dumplings were dry inside and weren't great because it fell apart easily too. Since it was a friend's 2nd time having dim sum, they enjoyed it. Easier to talk to the waiters in Cantonese if you can, but they were super friendly to me. Pretty clean for a Chinese spot too.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-25", "description": "This is the most authentic, Cantonese restaurant I know of in the city. Keep in mind that that includes the ambience, environment, noise-level, et cetera - you name it. \n\nFood: Good taste overall! I didn't get very thirsty after dinner. Yes, soy sauce chicken is one of their signature dishes, beef cubes are good, steamed fish used fresh fish (you can tell immediately from the texture), crab dishes were humongous, and beef brisket in soup in a clay pot was good.\n\nWaiters and Boss/Owner Lady: Awesome! I love the environment! Warning: Don't come with high expectations if you can't handle the culture. Many of the regular customers are close with and know all of the waiters and Owner / Boss Lady. They are nice and just joke a lot. They have pictures with famous actors, singers, SF Mayor, etc.\n\nWe've been coming here for years!\nOh yeah, best to reserve a table.", "author": "Michael Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "This is the best tastes and good service Chinese restaurants in San Francisco area.\nOnly the seat not comfortable.", "author": "Lin Da N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "the rating for their turnip cake compared to places in norcal and socal:\n\nauthentic / 5", "author": "Jeffrey Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-01", "description": "NEGATIVE Score. Not worth the money. Service was horrible and while we were packing our left over food, the waiters and the boss took away all our utensil. We ask if they could wait and they totally ignored us so they can give the table to another party. Then my husband shouted out Hold On, we need to pack our food and the boss remark was, why don't you pack the food that's on the floor as well.\n\nThis business owner does not deserve your money. Stay Away!!!", "author": "Dee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "Great fried rice, bbq pork, soup! Sizzling beef was a family favorite (although not mine).\n\nWould come back!", "author": "Heidi J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "Overall average Asian seafood restaurant in outer sunset, nothing too special. No line on a Thursday night for a party of ten people. Customer service are okay except the lady", "author": "Jasper K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Food: 3.7 out of 5\nService: I will give 4---today is a raining day, I am sitting next to the window. The sun just smiles at us for a second, and the waiter already walk to me and ask if I need the shade curtain down... very impressive...", "author": "Hao W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-16", "description": "I have been here 4 times, every time they over charged us. 3 people they charged us for 4 pepole, (3 times), we have to pay $1.25 more for the tea. 8 people they charged us as 10 people, we have to pay $2.5 more for the tea. They also charge ten cents for the plastic bag every time whether you ask for or not!", "author": "Joseph W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "Foods are great. I loved the mixed sea foods,salt & pepper porkchop, crispy fried tofu & mushrooms with oyster sauce. The waiter is so nice. He gave me free \"soup of the day\" to try. Everything was great! It was a good experience. And surely we will come back again", "author": "Bella A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-19", "description": "Their Dim Sum is hot and fresh. But they really need to improve their customer service! The waitress that wears glasses is THE worst server I've ever seen and not to say the others are better than her!\n\nAdvice to the owner: train your employees on their customer service skills and you will guarantee to have more business!", "author": "Jaylene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "Stopped by here around 10:30 on a Sunday. It's has all your standard dim sum fanfare sans the rolling carts. I felt it to be a pretty solid experience by SF standards.\n\nIn my opinion, its as good as the places in Chinatown. Perhaps just a hair below Koi Palace. Definitely less crowded and without the monster wait..", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "I came here for dinner for the first time today. The food here is delicious and the service is good.\n\nHere are some of the items I had:\n- Crab Meat Soup as a starter\n- Steamed Milk Buns (open from center) with Roast Duck\n- Broccoli with Mushrooms and Tofu in a delicious broth\n- A bowl of plain steamed rice\n\nThe restaurant looks clean inside and out, at least for this part it is cleaner than some of the Chinese Restaurants I've been to. I do like that wait staff keeps their plates, bowls, chopsticks, spoons and forks clean. This is always a good thing and I really like how they clean the chopsticks and place them in a paper holder. Overall, very good first time experience here. The restaurant looks very spacious so this is also a good thing. Clean and spacious restaurant giving a cozy dining environment is one feature many consumers look for when they dine out.\nI will be coming back for dim sum next time I am in the Sunset District. An updated review will be available once I try the dim sum menu items from here.\n\nI like how they have photos placed in frames posted on the walls, it is a wonderful idea. Come here for dim sum or dinner and see for yourself!\n\nParking: Street Parking*\n*Most of the spots are equipped parking meters so be prepared to have spare coins or a parking meter debit card on hand.\n\nPublic Transportation:\nMUNI Routes 71 Haight Noriega on Noriega St and 29 Sunset on Sunset Blvd", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "How many times have you gone into a Chinese restaurant and been treated like dirt. Rude waiters and waiting forever for a glimpse of service? Well not here. The wait staff was very friendly and attentive and understands how the customer should be treated. At one point they were dragging a hose into the kitchen and it was making scraping sounds against the sides of the door and the waiter came to our table and apologized for the intrusion....... In a Chinese restaurant!!\nBravo for the service!! Very good. The food was very tasty and the flavor of the dim sum popped in all the right places. Highly recommend", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-12", "description": "The food was good but the restroom is dirty. Someone should deep clean the restroom. The waiter made sure I gave him 15% tips or higher. He came up and complain the tip is not enough.", "author": "Thai D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "We has dim sum today. The wait for table  for 4 around noon is not bad. Go after 12:30 if you don't want to wait too long for a table. \n\nFood was decent. Food arrived pretty quickly. \n\nThe 2 star review is for the bill and poor customer from the waiter and the owner who was working as the cashier today. She double charged us- our bill for four was over $100. When we alerted the waiter,   no one apologized, owner grunted and yelled. So, check your bill before paying!!", "author": "Julie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "Sat down on five minutes and have been waiting forever for my food....20 minutes or so\n\nPrices seems to be like 20% more than Riverside..... Should hand gone there instead", "author": "william f."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "I have to say that S&T is one of the best dim sum places I have ever dined in. What makes S&T stand out for me is that this dim sum place is not like other ones  based on the fact that there are no ladies moving around with carts. Instead, S&T provides its customers with sheets of all the dim sum items and customers check off which items they would like and how many servings they want for their table. This ensures that you get what you want and do not have to wait around for the carts to come to you. I have had experiences where the carts never came to my table and I never got the items that I was looking for, but at S&T, you don't have to worry about that! \n\nThe food is always fresh and delicious! My boyfriend's family usually gets the dim sum staples like xi mai and har gow, but I love their sticky rice in the banana leaf! They don't skimp out on the meats and extra fixings in the sticky rice. I've been here twice already, and everything we have ordered embodied what dim sum is all about. \n\nI am absolutely in love with S&T!", "author": "Veda T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "Most of the dim sum is tasty but a bit on the oily side. Green onion pancakes were too thin, didn't taste like onions (too minced up) and reeked of old oil. The wrapper for the shrimp and chives dumplings were too thick. Salt and pepper calamari was reasonably priced at under $3.00 but it didn't have the salt and pepper taste. Took them forever to take our order (the paper menu we marked up) and we had to remind them of getting us the soda we ordered. Don't think we'll be coming back, even with a health score in the 80s compared to low 70 scores at other dim sum houses.", "author": "Ami K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "I usually enjoy coming here for lunch or dinner. So I took a friend here to celebrate a special day. We ordered fish porridge and discovered a short black hair in the porridge!!!!   OMG...that is why chief needs to hair net!!!", "author": "Ms R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-05", "description": "No way is this restaurant $$, because I ate a ridiculous amount and paid $12 including tip.  That is $. \n\nWas the food delicious?...as a non-Asian, trying to control my fat intake, and not a huge fan of oily foods...No. Not really. But as a non-Asian, with a ton of asian friends living in San Francisco, and knowing (kinda) that this is what legit Chinese food is...then yes. It is good.\n\nBut is it something spectacular? No. Not really. \nBut I would stand in a long wait for them for $12 all you can eat non-buffet.", "author": "Julianna I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "I didn't get a chance to scan all of the reviews for S&T HK, but it seems that almost 90% are about dim sum. Therefore we can conclude a few things.\n\n- Yelpers generally care more about dim sum out of a wide array of representative Cantonese cuisine delights.\n\n- Some might freeze panic like a deer in headlights if they had to take over the reins of ordering at the dinner table (when no dim sum is around), and thus stay in shallow waters to avoid drowning in the deeper unknown even with a GPS and scuba gear.\n\n- S&T would be considered astronomical pricing in Chinatown or parts of Irving (which is why Ming Kee couldn't survive...old school locals preferred crappy quality and cheap pricing over paying a dollar or two more for top quality). Some probably would rather eat gourmet roach coaches, Go to MY China or Hakkasan, than spend a similar amount on a non glitzy decent Cantonese dinner. \n\nListen to Susy C. Dinner here is quite da Sh&T indeed. Try to show up after 6 pm without a reservation. Maybe you'll get as far as the waiting area by the stand where you see some Hello Kitty stuffed animals and mini plush dolls. No doubt this was the handiwork of the lady boss. If you are a real a$$ FOB you will notice various framed pictures of the lady boss with various celebrities from Hong Kong who have dined at the restaurant, hung across the upper walls around the main dining room. Definitely InstaBook worthy ego boosting material. Maybe some of you out there might know who Law Kar Ying and \"Fat Mama\" Maria Cordero are. Oh Ed Lee ate here too.  \n\nVery interesting that a restaurant of this stature and quality tried to open a branch in San Mateo downtown (HK Causeway Bay) and it flopped so bad, yet this place is still thriving and doing very well. Or maybe the feng shui in SM at that spot has been cursed for years.\n\nOK too much BS...let's get to the food.\n\nCheck the live seafood tanks to give yourself an idea of what they have. Then peruse the regular menu, but I find the more effective technique is to chat with the waiter, examine what others are eating, and also scan the specials menu. There is quite a lot of variety here that can slow you down.\n\nBBQ pork (cha siu) - arguably one of the most recognizeable of Cantonese roasties, and popular amongst expats. The rendition here is quite splendid and has all the right things going for it, such as a very natural color (no food coloring), thus more brown than red. The cut of meat resembles pork shoulder (mui tau) and has decent marbling, tender but with a good bite. The slices rest on a bed of yellow soybeans, which is a good traditional pairing. The \"nam yu\" sauce of the marination seemed a tad heavy, but a great effort indeed. Worthy of recommendation.\n\nPacific surf clam (gwai fei pong) - steamed with garlic, bean thread noodles, with soy sauce and some oil. Outperformed Brother Seafood easy, best one I'd had so far. The adductor muscle/scallop from the clam is good chit. A bit too much oil, but it was at the bottom of the plate. If they do this right, seafood should be good here too (but beware, $30/lb for a coral/sesame grouper...not cheap). Easy to see why locals just stick with salt pepper crab (even they stick with shallow waters during dinner...)\n\nslow fire soup of the day - a small pot is enough for 4 to 5 people. Saturday night's offering was stewed with papaya (for sweetness), chicken feet (none could be seen in the soup), peanuts, pork/pork bone, and snow ear funghi. The materials are cheap but the effect is solid. Soothing on a cold evening. \n\nyam leaf with garlic in superior broth - always good to ask the waiter what Chinese greens are available. Stir fry with garlic is way too boring these days, and too much oil and heat can cause issues....so cooking in superior broth is the way to go. Still a bit bland? Tell them to add garlic, which is stir fried first (browned) then throw in with the veggies. Tender, moist, juicy, yet a very light crisp on the stems. \n\nsoy sauce chicken - hint: this might be available only 6 pm or after, so ask before ordering if it is available if you arrive before 6. Ming Kee still makes the most stellar soy sauce chicken around, but until they reopen, S&T's version is still quite noteworthy indeed.\n\nComp house dessert - red bean soup. Slightly diluted in texture, but it turns out it was because of the ginger juice added which gave the flavor profile an extra dimension. Decent dried orange peel flavor. Great way to end the meal.\n\nGood stuff. I'll be back. An easy 4.25 stars for me.\n\nFortunately the lady boss doesn't need the celeb photo shots taken inside the restaurant, to prove that S&T is indeed da Sh&T.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Everyone seems to be complaining about the service here. It's a Chinese restaurant, people! Don't think of it as bad service. Think of it as an authentic experience. \n\nBeen coming here for years with family. Very good dim sum, especially the siu mai. Non dim sum fare is also quite good. Definitely worth trying if you're in the neighborhood!", "author": "Ada C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-15", "description": "Being Chinese and having gone to Chinese restaurants all my life, I do not have high expectations for service from Chinese servers, but today's experience hit a new low.  So low, in fact, I will not be going back.\n\nI came for lunch today with my 82 yo mother.  Even past 1 pm, the restaurant was almost full.  I didn't mind being given a table way in the corner near their take out counter next door.  I've been coming long enough to know this table is mostly used as a staging area for that takeout counter.\n\nWhat was a problem, however, was that the utility table had edges that made it look like it had been a teething toy for a lion.  As if the discolored table top weren't bad enough, the edges of the table facing the diners were chipped to the point where there were 2 to 3 inch chunks missing, exposing some grey matter underneath.\n\nEven then, I was OK with it as long as they threw a white tablecloth or square of white butcher paper over it, with which almost every other table in the restaurant was covered.\n\nThe server's response?  No need, because we wipe off those tables.\n\nMy response?  We can take our business elsewhere to a restaurant that has some minimal standards.\n\nI've been to HK Seafood many times over the decades, but I won't be going back.  There are too many good restaurants in SF to go to one that treats its 82 yo customers badly.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-02", "description": "Food is slightly above average, prices are too high, and staff is mostly rude. This part of the sunset needs more good food options, this place is not worth it.", "author": "M E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "Yum yum dim sum in my tum tum. :)\n\nThis is my family's favorite dim sum place in the Sunset. I came here on Memorial Day with a friend for lunch. It was delicious as usual. For two people, we split about 6 dishes and the total was $35 -- not bad at all! \n\nAdmittedly, not a dim sum expert and I get the pretty basic dishes, but they are absolutely delicious here -- siu mai, har gow, fried shrimp dumplings, shrimp and chive dumplings (did I mention I like shrimp?). Siu mai is probably my favorite. Great flavor. I also got the chow fun which I found a bit average.\n\nThe location is in the busy, Asian area of Noriega, so prepare to fight for a parking spot. The restaurant itself is your run of the mill Chinese place. It's usually pretty packed, but the wait is surprisingly pretty short, especially if you have a small group.\n\nI highly recommend this place for dim sum!", "author": "Greg J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-08", "description": "S&T's prices rivals that of Koi Palace and HK Lounge, and so I expect them to deliver Dim Sum of that caliber. Or maybe even something close.\n\nBut S&T is not even in the same league. There's no shame in making Dim Sum in the minor leagues, but it becomes a problem when they charge major league prices. We ordered more than 15 plates and couldn't find one that could be considered as delicious. Their dumplings instantly falls apart to the touch of chopsticks. Most of the time, I would be eating the Shrimp separately from the skin. Most of the things were also very bland. I'm not sure if I was there to taste Dim Sum or Kikkoman's soy sauce.\n\nBut this is a very well decorated place. The owner is also pretty boss because he/she got a lot of pictures with celebrities. I just wouldn't come here just because I can pay the same money for Koi Palace.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "I came here for dim sum a few times during the week. Their food is good and they offer a variety of items. If you don't speak or read Chinese, you can still eat here because they have English on their menu. The service is very good and the food comes out quickly. \n\nOne of the items I was super excited about was the \"low sa bao\" (spilling sand bun) but when I opened the bun, there wasn't much yolk spilling out. It still tasted good. The Portugese egg tart wasn't as good as the ones I've eaten in Macau. It was basically an egg tart that got burned. I really liked their \"ha gau.\" They give 4 pieces and there was a lot of shrimp inside.\n\nHanging on the wall in the restaurant, they have photos of the owner with Hong Kong celebrities. I'm not sure when those photos were taken but they look pretty recent (photos haven't faded yet). Iif you're a fan of HK dramas, you might want to come check this place out. Raymond Lam is one of those celebs.", "author": "Anna F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "I have come here a few times for dim sum. It was just okay from what I remember, but it's best to come here for dinner.\n\nOrdering large banquet dinners family style is the way to go. Way more economical. \n\nMy friends and I love the salted egg w/ pumpkin crab here. Oh lawd have mercy on my beating heart , for it will probably stop soon. \nCrab that's coated in salted egg yolk. When it's deep fried, it makes the exterior gritty and crispy. So delicious. Plenty of deep fried pumpkin that adorns it as well. \nMy face probably starts brewing zits the moment it touches my lips but it's so delicious.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-23", "description": "How often do you get to have dimsum for lunch during the week? I admit it's rare, but as my brother-in-law's only day off, it's a nice opportunity to spend time with him and the baby. Another friend joined us as well, and three men and a baby were off to find some dumplings at S&T.\n\nWe ordered a variety of items including pork spare ribs, Chinese broccoli, fried tofu, fried rice, and many more. My favorite was definitely the fried donuts wrapped in rice noodles. So delicious! Overall I enjoyed the meal though it might have been a little on the greasy side.\n\nParking is tough on Noriega so it's best to park on the side streets instead. Service was ok but not fantastic, but what Chinese place is? I think I prefer Daly City dimsum to here, but as a super local place, I would come back.\n\nFood: 7/10\n\nService: 6/10\n\nPrice: $$\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-21", "description": "Typical chinese restaurant with a notch up with decor.  Known best for their soy sauce chicken.  If you are with a big party, be sure to pre-order in advance as they do sell quick and run out.  Prices are average along the others on Noriega.", "author": "JADE L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "They know how to dim sum. This isnt my most favourite place to get dim sum but its near my house and they make really good shrimp dumplings. Im not talking about har gaou but like the deep fried ones. Ugh. So good. \n\nI have been here several times and I dont have any complaints. \n\nThey got all the basics down. Har gaou, siu mai, cheung fun, all dat good stuff. \n\nThis place doesnt do the cart rolling around and you pick what you want. There's a menu with all the stuff listed and you write down what quantity of the item you want. I dont really think that the menu is that english friendly but the staff isnt reluctant to help.", "author": "Becca W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-23", "description": "Went here because people rated it one of the best dim sum place but really it sucked. The food wasn't good and came out cold. \n\nIt was also the last thing my boyfriend and I are before heading back to seattle. We started feeling sick after a couple of hours of being there. We were on and off the toilet all night.  Think it gave us food poisoning.\n\nIf you're looking for a good dim sum place... Go to Hong Kong lounge 2.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-17", "description": "Service is horrible... \n\nFood was good, I love their peking duck and dim sum plates. It was a bit expensive but still very yummy.", "author": "Ames A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Services is about like any other places. I came here for dim sum and it turned out great. Fresh and hot...", "author": "Willie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "It's a local dim sum restaurant for me.  No frills.  I would give it 3.5 but I don't have that option.  It's not Koi Palace but it's doable.  The dim sum came out piping hot and fresh.  It claims made to order.  \n\nDinner is good, too.  I have no complaints.  It's not a fancy restaurant so if you're expecting that, don't eat there.  \n\nI have no complaints.  Typical service from a Chinese restaurant.", "author": "Ernest Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "Good dim sum at good prices! At little slow but the restaurant is spacious. No carts though", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-29", "description": "I love the freshness of everything here. The best Cantonese food in US for the entire decade I'm here. \n\nGwa Fey chicken - the quality of the chicken is comparable to Qing yuan chicken. Low fat, smooth skin, muscled chicken meat and good sauce. I wish the sauce is less salty though. $10.50\nGwa fey clam - steamed with silky noodles and garlic. $6.95 each. So tasty and fresh. \nSteamed cod fish - the meat is so fluffy compared to frozen fish that is solid. It's \"hung Lung cod\". The bad thing is that they didn't tell me this is $23.5 per pound. So ended up to be $48 for the fish. But so good and fresh. \nHour-cooked soup - not greasy at all. Tonight is pork chop with Chinese squash. I drank 4 bowls of it! $6.95. \nComplimentary green bean dessert - good and not sweet at all. \n\nLove everything but fish was pricey. My stomach is very happy :)", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "I just had a horrible experience here for dim sum.  When paying our bill, I saw a mistake and went up to the front to correct it.  The lady at the counter who is the owner started to scream at me for no reason.\n\nThe mistake wasn't her fault but there was no reason to scream at your customers.  My lunch was ruined and a horrible start to my day.", "author": "Stanley T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "I mean, the dim sum here is nothing special, but it was adequately tasty and filling. Plus, everything came out fresh and hot out of the kitchen so at least there's that. Also, not the most expensive dim sum I've found. Go elsewhere for better dim sum or come here for a solid meal.", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "Great place for excellent dim sum. Always hot and fresh. Price wise it is in the mid range but you won't be disappointed with the food. You can even get dim sum to go from the to go counter. Whenever I am in this area I make it a point to stop by for lunch or dinner.", "author": "Rodo A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-15", "description": "Came here for dim sum and it was not very good. \n\nThe soup dumplings (XLB) had no soup in them and they were really small and shriveled up. In fact, they looked quite sad. \n\nTheir shiu mai was also very disappointing. On the menu it's listed as \"shiitake mushroom shiu mai\" but the mushrooms were nowhere to be found. Instead, it was replaced with excess oil and soggy wrapping.\n\nThe rest of the dishes were okay - xo noodles, deep fried taro balls, chives and shrimp dumplings.\n\nFor dessert, we ordered their deep fried almond balls with egg yolk. It was interesting... it's pretty much exactly how it sounds. Sweet egg yolk in the middle of a sticky/mochi type ball, and covered with almond slices and deep fried. It's not bad, but at first the taste and texture is very confusing. \n\nIf I'm going to be driving out  this far for dim sum, I'd rather go to Hong Kong Lounge II which is much closer and much better.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-27", "description": "First timer here from LA. Came here for my gf's birthday dinner since it was nearby to her house. \n\nThe parking situation wasn't too bad since we were able to find a spot right in front of the restaurant. \n\nThe food was ok; we ordered five dishes. First one was walnut shrimp; the shrimp tasted alright, wasn't too amazing. I had better walnut shrimp in LA. Second one was ong choy aka morning glory. For $14.95, the quantity of vegetables was absolutely amazing. It also helps when it tastes good too. Third dish was sweet and sour pork. I liked this dish as it complemented well with steamed white rice. Fourth dish was mixed veggies with squid; the celery was a bit hard to chew otherwise it was a tasty dish. The last dish we ordered was a vermicelli hot pot with veggies. I didn't believe the dish looked appealing to eat since it lacked color. Not sure if I'll order next time. \n\nThe dessert was ok, wasn't the best green bean dessert I ever had. I might come back next time when I am in town.", "author": "Frank L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "This restaurant is underrated. My crew and I have been here a few times and we never dissapponte once!!! Must try Ox tail Stew and Special House Chicken. Their dimsum is really delicious too! The man here was so funny and helpful. We asked him about what to order and he honestly gave some comments about the bad dishes (that we almost order) and recommend us to oder the good dishes (not about pricing different because the one he recommended actually was cheaper). Had a great din din here, def come back", "author": "Nga N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "Recollections of stops at S&T always boil down to this.  When I bring someone here, that person always asks this first.  Who is this short haired Asian lady pictured with a bunch of random folk framed across the walls of the whole restaurant?  To most people, one of the only recognizable faces is San Francisco's current mayor, Ed Lee.  The others are an assortment of Chinese film and television stars (and some singers).  The short haired lady is either the owner or manager.  \n\nOn the weekends, this place is a mad house during the dim sum hours.  When the table is finally ready, don't expect to pick from dim sum carts because there are none.  They have their list of dim sum to choose from and you'll tag the ones wanted with the numerical quantity desired.  Below I made a mini set of items for first time goers of S&T:\n \nGET IT!\n*Pan fried taro cake - My favorite dim sum item here.  They make it different than a lot of places.  The taro cake is actually made up of shaved up shards of taro and then pan fried.  Can you say \"yummy taro in my belly?\" \n\nTRY IT!\n*Scallop dumplings - Here they're formed in a shape similar to a large tortellini.  The wrapping of the dumpling is a little thick, but the mixture of scallops and yellow chives make up for it.  Wish there was more scallop though.    \n\n*Steamed Chicken Feet - I don't always order this due to the oily nature.  What am I kidding myself?  Most dim sum is fatty in some way or another anyway.  They cut them into smaller pieces.  Two benefits come from this:  the juice gets sucked into the feet more and also they are easier to eat.    \n\nAVOID!\n*Green onion pancake - I couldn't hold back my yearning for a green onion pancake the last time.  I understand this is not supposed to be their forte, but come on.  Order at your own risk.  Mistake was made and I'm passing the message along.  \n\n*\"Special Order\" chow mein - Periodically, the dim sum servers will come around with \"specials\" that come with a \"special\" price.  One of them is the chow mein and you can order it by the bucket at a dim sum-to-go place that'll taste comparable.  \n\nCompared to some other dim sum offerings in the local vicinity, they definitely do a better job than their immediate peers.  When compared to a larger spectrum, S&T is a passable dim sum spot.  The restaurant also has a to-go dim sum area for a bite on the run.  Personally I wouldn't mind driving further for some better dim sum.  In a pinch, I wouldn't ever complain about coming back here.  Reasonably priced with an equivalent quality one would expect.", "author": "Arnold T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-11", "description": "Was passing through town in this part of San Francisco and felt like having Dim Sum.\n\nI stopped in with my brother and sister for a quick bite. The selection is about average for price and quality. The service and atmosphere definitely needs improvement for sure... But I guess most Asian place aren't known for services but for the foods.\n\nTypical Chinese Restaurant in the area compared with others I've been to in San Francisco China Town. \n\nNo cart Dim Sum... All on menu which makes it easier to place your order all at once.", "author": "v v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-20", "description": "The lady boss there is horrible, the worst customer service I have seen so far, don't go there unless you want her to yell at you, customers should always right, remember her face, she posted her ugly pictures on the wall with super star from H.K. Bad bad bad customer service", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "Came here for dinner on a weds night.\n\nI had a fresh fish that I planned to bring to another restaurant but it was closed.\n\nI asked the guy if it was ok for him to cook it and he said sure.\n\n oyster tofu claypot was good\nsteamed pork cake with salted egg . It was good\nOur steamed fish came out perfect \nWe had steamed shrimp it was good but I think it was like $38/lb came out to 8 pieces\nCrab meat fish maw soup was nice and hot\nChinese broccoli was also good\n\nThe dinner chef knows what he's doing\nThe lady boss was nice to us too.\n\nI would come back for dinner if I was around the neighborhood", "author": "DOM d."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-01", "description": "Food was okay. Roast duck was miles behind Cheung Hing. Steamed spare ribs were very salty. Wait staff were not exact rude but were amateurish to say the least - what the Chinese would say diao er lang dang, if not liu li liu qi. I saw one of them arguing with a guy saying he didn't tip enough. They went back and forth for 2 full minutes. Really, business is so bad you have to beg for tips now?! What the hey? And the boss lady - yuck!", "author": "YM L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-10", "description": "Came here for CNY dim sum today.  The wait to be seated was long and ridiculous, but our order came out pretty fast so we were happy since we were all starving.  Their HK Crispy Noodles were pretty good.  The shu mai, har how, sticky rice, fried taro dumplings, shrimp rice noodles, pork buns, and XLB were all pretty good.  Not the best, but decent.  The turnip cake was a little too mushy so I would skip that one.  They even had Portuguese egg tarts, which is pretty rare at a dim sum place so we ordered it.  It wasn't too bad, but the inside was pretty soft.  At least the flavors were there.  \n\nDon't expect great service here.  We were here last night for CNY eve dinner and one of the server spilled quite a bit of sauce on cousin's jacket and all he said was sorry.  Didn't even make an effort to offer dry cleaning!", "author": "Erica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "the bitter melon beef dish, fish and tofu in a clay pot, white chicken with ginger dip on the side, any vegetable dish is a hit like chinese spinach stir fried, duck, crab, beef cube dish, chinese broccoli, duck tongue.....  all excellent, on dinner menu.\n\nLunch items, all is good, for typical dim sum stuff, but favorite include the beans underlain sweet pork dish (Cha Siu).  Flaky dessert durian, any long noodle wrapped with shrimp, beef, or dough.\n\nIt's not terribly hard to find parking.  There is parking along the side streets, and depending on when you go, you don't need to pay for parking.", "author": "J. W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Yummy dim sum and dinner. Prices in the mid-range. Get the soy sauce chicken...it's really good! Almost every table had it during dinner. Can be a half order if you have a smaller group. Sometimes they run out or not available for some reason, so call ahead. The BBQ pork is also very good. We tend to order items not on the menu, but everything still comes out fresh and tasty. Service is good when not busy. Can't wait to go back! Parking is pretty easy on a weeknight. Gets crowded for dim sum and dinner on weekends.", "author": "Lil D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-11", "description": "We had dinner here tonight.  Portions are pretty big.  The pluses:\n\n-bathroom is clean and is well stocked.  They even supply toilet seat tissue (this is a must in my book).\n\n-honey walnut shrimp was good\n\n-service is better than the average chinese restaurant\n\n-loved all the pictures of HK celebrities with the owner, who somehow doesn't quite face the camera in any of the pics.\n\nMinuses\n\n-some dishes were undercooked.  The fried fish filet came out undercooked and red.  The flesh was still stuck to the bone.  We really couldn't send it back cuz the waiter parsed it for us.  How do you refry that?\n\n-lamb stew could use 30 more minutes in the pot.  The lamb was tough but it was tasty.\n\n-fried calamari was pasty looking.  Not golden brown like you see at other restaurants.   There was also too much batter on the calamari.\n\nI think if they cook the food well, they can be very successful.  Impatience doesn't really work for a chinese restaurant.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-14", "description": "ABC's BEWARE!  \n\nThis San Francisco native ABC gets treated like dirt. Just because I'm not a fast orderer, flashing a Rolex nor go scurrying around like a chicken with their head cut off you get treated like dirt. \n\nThe four of us went to the back room and the hostess (if you want to call her that) flipped the menus on the table and scurried away.  OK, what's the matter? Too ABC for you all?  All four of us are ABC . . . well EXCUSE ME! \n\nSo the waiter comes right after that and asks what type of tea to we want.  We haven't even sat down. The wife orders tea and you'd think they have to get the leaves shipped from China. Soon the tea comes out and we haven't finished marking down the dim sum when the waiter stands by the table and grabs the other ticket assumingly to write down orders that are not on the dim sum menu. So he goes away and returns after he serves the entire restaurant.  FINALLY the order goes in.\n\nNow the food: from someone who grew up in Chinatown, the food is passable but not fantastic. The various dim sum items came out quickly and as soon as one dish was empty, somebody scoops it away. We ordered beef chow fun and for the prices they charge, it lacked taste, the beef was chewy and you'd think that there was a ration on the fun noodles.  I've seen bigger and tastier chow fun orders from the dive on Taraval. Oh but wait, this is supposed to be a fancy place.  Sorry, not impressed.\n\nSo why do I come here? We take our guests here since they want to go up the street to Chung HIng, the bank, Safeway and get fresh produce. The prices are not cheap and a bit on the higher side for this dive.  Ok - ok - ok.  Sorry for the rant but that's how I feel. If you are a non-ABC or a native from China, you'd probably get better service from the staff kissing up to you.  Hate to say it, but I get better service from the DMV.", "author": "Stefan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "Food's pretty good. Not bad at all. Funny waiter! If you understand Chinese, you might laugh all night", "author": "ABC Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-10", "description": "I had lunch and ate won-ton noodle soup at S&T Hong Kong Restaurant today around 12 noon. \n\nAt other nearby Chinese eating joints in the same neighborhood, the same won-ton noodle soup around this vicinity usually goesfor $5.95-$6.95.\n\nI was charged $12.95 for the same won-ton noodle. \n\nLesson learned:\n\n1)  I should have asked the price before ordering. \nSince I was not ordering something extravagant, I assumed the price would be similar to other restaurants nearby.\n\n2)   I should have stuck to my favorites eating joints elsewhere in the same neighborhood.\n\nI cannot help but feel that the restaurant waiter purposely charged me more than double trying to make a quick buck.\n\nI will never visit this restaurant ever again.\n\nPS: I am not Chinese.", "author": "Sachi N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-26", "description": "I've been coming to this restaurant for over twenty years and have never been disappointed. Great dim sum and courteous service.", "author": "H. S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-01", "description": "Came on new years day group of 2. People who came after us were done eatting before we were seated. Will never return. \nEdit: waited 2 hours before leaving, unseated", "author": "Wesley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-15", "description": "WTF are they doing back there...shrimping?...slaughtering pigs, chicken, cows for our food? Starving enquiring minds want to know...\n\nAs we sat there ravenous with our stomach growling, these were the questions running through our minds as we waited an HOUR for our food, yes, ONE HOUR!\n\nOn Saturday, 8.13.11, my friends and I came to S&T for dim sum (it was my idea to come here *sigh*) at 1:30 PM. Surprisingly there was no wait for a table of six. There's no dim sum carts at S&T; they have a paper menu which you just mark off which dim sum plates you want. They do have the ladies bring food trays around though it was not very often and in the 1.5 hours we were there, they only brought out two items.\n\nP R I C E S\nA little more expensive than most dim sum places and a notch cheaper than Koi's though the quality is not as good. \n*$2.50 Small (e.g. dumplings)\n*$3.20 Medium (e.g. buns)\n*$4 Large (e.g. meat dishes)\n\nThey charge $1/person for tea. \n\nF O O D\n*HAI BO (Fried Shrimp Ball) - 4 STARS: Warm, crunchy and succulently moist inside. \n\n*HAI GOW (Shrimp Dumpling) - 3.5 STARS: Filled with tender sweet shrimp with a not too thick skin. \n\n*SIU MAI (Pork Dumpling) - 3.5 STARS: Savory, tender and juicy.\n\n*LUILIAN PAO FU (Durian Puffs) - 3.5 STARS: Served warm, the puffs were crisp and flakey and filled with \"a pungent scent of a used jock strap sitting in butt curry\" as my friend described it. As the only durian lover in the table, needless to say, it was ALL mine!\n\n*FUNG ZHAO (Chicken Feet) - 3 STARS: Soft and gelatinous. \n\n*CHA SIU BAO (Baked BBQ Pork Buns) - 3 STARS: OVERRATED. Yes, it was crisp on the outside and fluffy on the inside, but there wasn't much cha siu in it. The Cha Siu Bao at HK Lounge is WAY BETTER!\n\n*NGAU YUK MAI (Steamed Beef Balls) - 3 STARS: Moist and juicy but lacked softness. \n\n*CHEONG FUN (Steamed Noodle Rolls w/ Shrimp, Beef, Donut) - 3 STARS: Noodles were a bit too thick. My least fav was the beef as it was more like a log of beef. \n\n*PAI GWAT (Steamed Spareribs) - 3 STARS: More cartilage than meat.\n\n*SUP CHOW NGAU HAW (\"Wet\" Beef Chow Fun) - 3 STARS: Gravy had a gloppy consistency; too much cornstarch.\n\n*FU PEI GUEN (Steamed Tofu Skin Roll) - 2 STARS: Savory, though veggies were mushy and it was filled with MSG.  \n\n*WU GOK (Fried Taro Dumplings) - 2 STARS: The exterior wasn't lightly crunchy and the taro had a texture of play dough. \n\n*XIAO LONG BAO (Shanghai Dumpling): I didn't try this one though my friend said there was NO soup in the XLB. What's a XLB without soup?\n\n*YEUNG HAI KIM (Stuffed Crab Claw):  Didn't try it.\n\n*HAM SUI GOK (Fried Meat Dumplings): Didn't try it. \n\n*NAI WONG BOLO BAO (Custard Filled Pineapple Bun) - Didn't try it.\n\nOverall, the food was \"ok\" but NOTHING really stood out to warrant a visit back. \n\nS E R V I C E\nSh*tty service is expected at Asian restaurants, but one good thing is the food tends to come out quickly. NOT at S&T though, service was painstakingly S-L-O-W! Since when does it take ONE HOUR to get your food at a Chinese restaurant that is NOT even busy?!?!? TOTALLY INEXCUSABLE! We asked several times on the status of our food and we got the same BS answer every time, \"Shou Lai Ah\" (It's coming). \n\nA M B I A N C E / D É C O R\nSeveral steps above your hole-in-the-wall Chinese restaurant that \"seems\" clean with the crisp white linens but I can't get over the disgusting brown and green mold surrounding the fish tanks. I can't imagine what's lurking in the back. GROSS!\n\nP A R K I N G\nEasy metered parking and fairly easy residential parking.\n\nNow I know what S&T stands for: \"SUCKS & TERRIBLE\".", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-05", "description": "The service was awful here. I can speak Chinese and communicate fluently with the waiters here so I know it is not a language barrier. So if you don't speak Chinese, forget about it. You will never get anything you ask for. We asked for ice waters, no ice waters. We asked for soy sauce and chili sauce, after the 5th-6th time, we finally got it and half our dim sum was finished. Here's a tip, if you don't want your customers asking you for condiments, then put them on the table. It's really simple and many restaurants adopt that practice. It's not rocket science. The part that makes this to be an unbelievable experience is when I just wanted to double check that our order went in because when I placed it, the waiter was all excited to see this kid walk in the restaurant so I thought he may have forgotten it. In my most polite Chinese voice, I just simply asked if the order was in and he said if you can't wait then box up your stuff and you can go. Omg! Needless to say, I got the tab, cancel those items, and that cocky waiter can get his big fat $0 tip for his poor attitude! We wanted to tell the manager/owner about our experience and she said she wasn't the person to talk to and we were like okay then why is your picture framed all over the restaurant with celebrities? Ok I see they could care less. I hope they enjoy the regular local customers because that is the only reason they are still in business. Their luck will run out eventually. It's SF, they won't survive. This place too cray cray for me.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "After spending all day shopping around downtown and then taking a 45 minute bus ride back to the apartment, my roommate was really craving some wontons, so we came to S&T Hong Kong Seafood Restaurant, where she'd had wontons with her dad before. We got there at around 8PM, and there were a good amount of people eating there, with a few large parties too. \n\nThe food: we ordered a seafood wonton soup, mapo tofu, and a spicy eggplant with fish claypot. Overall I think the food was average; perhaps not the most authentic of Chinese foods, but definitely filling and tasty. I was pleasantly surprised with the wonton soup; I was honestly just expecting some wontons floating around in soup, but it came stocked full of seafood, vegetables, and large wontons. \n\nThe waiter who was serving us (we never got his name) was really great too. He joked with us while getting us the check, and then after we stupidly left the restaurant without our $20 worth of boxed food, ran out into the street to find us. We had already gone by then, but luckily remembered and turned back. He had saved the food and joked that he had a heart attack trying to find us. So nice!", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-31", "description": "Decent dimsum was good..\n\nI found service very good compared to most Asian restaurants.\n\nNice and spacious between each table and I found the place relatively clean which was good.\n\nI would go back!", "author": "Sharon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-16", "description": "Longest wait EVER to get dim sum!\n\nOur party of 7 came here Saturday afternoon at 1:30pm.  To my surprise, we didn't have to wait for a table and were seated immediately.  \n\nWHAT TO KNOW:\n*Dim sum carts do not come around, you mark the paper menu\n*It took an hour for all our dishes to come out (yes, I was angry)\n*Prices are a bit above average (we paid $20 a person)\n*Unfriendly service (yes, I was complaining our food hasn't all came out)  \n*$1/person for tea (apparently this is standard?)\n*Dim sum stops being served at 2:30pm (we didn't get our food until AFTER they closed)\n*Seriously, IT TOOK AN HOUR FOR OUR DISHES TO ALL COME OUT!\n\nFOOD:\nAverage, I think I was too mad to even care, all I wanted was food.\n\nWORTH TRYING:\n*Steamed tofu skin rolls\n*Fried shrimp balls\n*Deep fried crab & shrimp balls\n*Pineapple buns with custard inside\n\nAVOID:\n*Shanghai dumplings - there was no broth at all\n\nPARKING:\nStreet metered parking.  My friend and I had an easy time finding parking.\n\nIf I wanted to waste an hour, I'd rather have been standing around waiting for a table at Koi Palace.", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "Not all Dim Sum is created equal... \n\nNot all Asians are friendly and welcoming to White people who look like they forgot where their tourist bus drop off point is.... \n\nThis is an incredible Chinese restaurant, we arrived during the Saturday lunch rush, packed, people waiting on the sidewalk and corner to get in. My sister went in and got us a number, the hostess said it would be about 20 minutes. \n\nWe waited..... and waited.... then the little one had to go potty, so we walked in the packed lobby, I asked the hostess where the bathrooms were and she directed us to the restroom. The hostess was polite and gracious, she could have said 'restroom is for customers only' which I kind of thought she would say since it has been said to me before and she didn't know we were there waiting for a table. \n\nAfter we used the bathroom I told my sister how nice the hostess was and my sister said they were really nice to her when she went in to get our number. \n\nWe ordered baked BBQ pork buns which the boyz loved, 3 orders of Har Gow, Shrimp noodles, salt and pepper squid, black bean ribs, and a Chou fried rice which I have never had before that is now a must order every where I go. We ordered other things off the tray as the ladies walked by, no wheeled carts here. All of it was wonderful. They even have a little Dim Sum togo counter, with a line out the door for that. \n\nService is fast and friendly, they are just the a excellent Dim Sum place that they are packed with people and definitely worth the wait! \n\nI found this place on yelp. Thanks my fellow yelpers!", "author": "Serra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-16", "description": "I haven't had chinese food for a week and I was hoping this would satisfy my cravings but blehhhh.  The food is bland and boring. It didn't look like the picture in the menu book", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-24", "description": "This place even charges $1.25 per person for cup of water, never seen that in anywhere else. \n\nThis is ridiculous!! \n\nNever come back again, cheap place!!\n\nWould give minus score if there is any.", "author": "Yiping W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-26", "description": "The restaurant could be cleaner.  Seems a bit run-down.  Restroom cleanliness was fine.  Waiter was friendly and funny (no name badge so can't give him credit).  The food was pretty good flavor-wise, but there were some unexpected findings:\n\n- Shells in fried noodles but there wasn't supposed to be any shellfish/seafood.  Did they reuse the same wok without cleaning it first?\n- Toothpick in food.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-21", "description": "I like the food. It was good. But the service was lousy!!\nI complained to the owner Miss Choi about the service. She was sincerely apologize for what had happened from the waiter name Danny .(Paul Yee Fung) . It was the most uncomfortable remark he made in front of the all the guests. \nm\nBelow is the letter from his explanation which is not quite acceptable to me. However I hope he is truly sincerely apologize and correct his behavior. \n\n\n\nFrom: \"Paulyeefung\" paulyeefung@yahoo.com\n\nSent: Sunday, July 21, 2013 9:44:10 PM\nSubject: Sorry!\n\n       , ,.", "author": "Marina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "Nom nom nom! This is my family's favorite favorite dim-sum place. They have a \"to-go\" mini store to the right of the entrance where you can just buy take-out dim sum if you want to skip the wait. Usually my family chooses to do that but we decided to dine in on Saturday. \n\nWe came around 1:30-2 so we totally skipped the lunch wait which was great because this place is usually super packed with a crowd outside. S&T stopped doing the dim sum carts like they used to (maybe because the restaurant is small or they added tables) but they do the paper order where you check off the stuff you want. This was particularly difficult when I came with my bf last time because we didn't know the english translations and only knew the food by sight (haha)\n\nBut this came I came with family and we ordered chicken feet, square taro cakes, sew mai, dan tats, rice wrapped in bamboo leaf, sesame balls with taro inside, lobster chow mein and ha churng. Plates and plates of dim sum filled the table. The food came out fast and we had no complaints.\n\n I'm still going to keep coming here but most likely ordering out next door  if the wait is long! :)", "author": "Vikki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Omg soooo good! Get the steamed pork buns! The fried beef dumplings were yummy. Such sweet service too. Good pricing.", "author": "Jenn R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-11", "description": "ok... food is alright. service is metiocre. great selections but it seemed as if every single dish was oily as hell. kind of gross... makes you want to stop eating after awhile. i'm taking away one star because they pissed me off with not knowing how to follow some rather simple instructions.\n\nso... if you're chinese like i am, you KNOW that there's always an issue when the bill comes. our crazy families always fight over the check and it's a bit embarassing. anyway, i was smart... my fiance slyly handed them his card before all the food came out. his instructions said... charge this table to this card. my fiance and i just wanted to do something nice for the family. ummm... then the bill came at the end of our meal. my dad and i were fighting over the bill. apparently, the idiots didn't know how to follow the simple ass instructions. ughhhhh.... ANNOYED.", "author": "Ann T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-06", "description": "The only decent dim sum place in the whole Sunset district. The place is getting a low rating because of how dirty the whole place is and how there is a ton of MSG in all their foods. \n\nYou will be drinking at least a gallon of water after eating here.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Everything was delicious! We think we had an entree skipped, but the food was great. Fit well for large party", "author": "Brittany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "This restaurant seems like another Hong Kong Chinese restaurant. It has a decent interior and enough space to sit many people. The service is good for dim sum. It's really busy on the weekend for dim sum. I've only had dim sum and never have anything to complain about. I like other noodle dishes. I think it's worth going to every now and then. XLB's are okay, fried squid really good, pumpkin fries were fun.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "Insanely expensive Geoduck! I ordered a Geoduck there for $84 before tax. CRAZY! But it was delicious! worth $84.. not really. i expeced this to be expensive but $84 for a dish is a lot! \n\nCame here for dinner with my family. We ordered the family set dinner. Every dish was huge. Food in general is really good. I just remember the salt and pepper ribs was a bit on the salty side. Other then that everything was very good.\n\nWe had enough even for lunch for the people that had to bring lunch. Even the leftovers were yummy! \n\nThinking about the geoduck, nicely steamed with soysauce makes me salivate...yummmmmm", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "Dim sum is awesome here.. we had fried chicken wings, pork rib porridge, rice roll with bitter mellon, fried bean curd paper wrap shrimp and some other stuff. All were really good and food came fast.", "author": "Cindy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "Just ate here recently for my grandmas birthday. It was delicious !!! Everything from the banquet we ordered was super fresh and presented in a timely fashion!\n\nI was just so amazed at how fresh the cold cut appetizer was! Usually, the bbq pork is a bit darker and dry and the jellyfish is chewy, however, here it was bright red and a beautiful gold color and had a slight crunchy texture to it! Highly recommended !\n\nI cPretty much all the seafood is recommended! I have never been so impressed before. \n\nService here is beyond the call of duty. We went on a Saturday night which is probably their busiest but they still managed to get everything we asked for in less than 3 minutes. They even changed out plates for us. They even presented us with mango moochis for my grandmas birthday. Each mochi was made with fresh mangos, a delightful way to end the night. \n\nThis has been one of my most pleasant dining experiences at a Chinese  restaurant.", "author": "Sue T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "The food was seriously mediocre. That's saying something cause I LOVE food and it's hard to get it wrong for my taste buds. We ordered the ong choy, ginger chicken, tofu and fish, swab, and shrimp. Maybe trying other dishes will change my mind on the food. The server recognized my grandparents so he was extremely polite and respectful. I would mention his name, but I forgot. The ambiance was delightful! Although, there is this fish tank towards the back of the restaurant that is leaking water. Personally, I don't like that because people can easily trip! Especially elderlies like my grandma. I hope they fix it before I comeback to try the rest of the menu with my family", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "My fam and I came here for a Christmas Eve meal. We tend to celebrate the holidays on the eve because we want to avoid the crowded restaurants. So, by showing up at 6pm, we avoided the rush, and people started lining up at around 6:30pm. \n\nFor a family of four, we ordered the $88/ 4 entree special. It included fake shark fin soup, fried pigeon, stir-fry veggies and beef, and a steamed fish. I always detest ordering the combo specials because they tend to come with some not-as-appetizing dishes. In this case, I could have gone without the fake shark fin soup and the stir-fry veggies and beef. They were simple and ordinary. At least the pigeon dish lived up to its name as being a Shek-Ki delicacy, and the steam fish was flavorful and light. \n\nAlso, we added a $25 lobster noodle as my mother raved about it. She said, from her previous visit, the lobster noodles included a big and succulent lobster and her foreign visitor ate it like a barbarian. But this time, my mother was wrong as the lobster was small. Despite it size, this dish was still good. My favorite part was substituting the ee mein with thin egg noodles. The thin egg noodles soaked in lobster juice and became my favorite part of the meal. \n\nI would def come back to this restaurant, either for dim sum or dinner. After all, I have been to this restaurant location countless times, even when they switched countless owners in the past 20 years.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Food was fresh and hot. Missed the carts, but could figure out the order by the description. They charge for tea and water. Recommend go to the store next door first. No carts. Bathrooms gross. Go before you come here.", "author": "C J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "Responsive staff, bright and airy with windows on two sides.  Avoid the table for two nearest the bathroom because it's hard to flag down the staff from there in case you need anything.   Dim sum came quickly after ordering on the paper menu.  Price is medium, definitely not what I'd consider cheap eats.  But, you pay for the table service.  Tea is $1.25 per person. Also high.    Egg custard tart had good crust, but some lumpy crunch bits that while not harmful didn't feel like the right texture.", "author": "Thom S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "Sunday morning dim sum, mMm yes please!\n\nYeah - the food. always find myself ordering the soy sauce chow mein since it comes out almost right away. lobster dumplings with the mayo is a no brainer.\n\nMeh - the service. never had an issue with the staff being rude or painfully slow. can't say they go above and beyond but I've come to not expect too much from chinese restaurants. \n\nEh - the wait/parking. like everyone else has noted, the wait (to be seated) can pretty bad, especially on sundays. add the fact that parkings sparse around these parts, you're making for some antsy patrons.\n\nI've been coming here for close to 15 years now, and through the many management changes, it's still the dim sum place of choice.", "author": "Albert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "This is for their dinner.\n\nThe food here used to be good. It used to be fresh, flavorful and we would be able to get unique items. Not so much anymore. The menu was kind of blasee and unimpressive. While their soy sauce chicken is good, it's not worth the $30. They even messed up on honey walnut shrimp, how can you do that?? I guess what I really wanted was foie gras, and alas have to go to Kitchen in Milbrae for that.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-04", "description": "TERRIBLE SERVICE!!! The waiters were rude and served us like there was something up their rear. We had to constantly ask in order to get any service. They were slow in almost every way imaginable. On top of that; they got our order wrong. PATHETIC!! The only good thing was their food; but their rude and poor attention to customer service made me drop them from the list. NOT PEOPLE FRIENDLY! NEVER GOING BACK!! \n\nI do NOT recommend S&T Hong Kong Seafood Restaurant to anyone!", "author": "Gnemok Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-16", "description": "Celebrated my aunt's 70th birthday here. We brought our own Sou Bao because we didn't know it complementary for large birthday groups so they gave us a $20 certificate! Long life noodles looked kind of plain and unappetizing but they were actually flavorful.\n\nLike any other Chinese restaurant, expect greasy food! Food here is better than most Chinese restaurants. Just look at the HK celebrities displayed on the wall. Raymond Lam, Bernice Liu.... Mayor Ed Lee?", "author": "Pansy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-05", "description": "Went here for Dim Sum this morning (saturday morning) with my aunt and mom.. it was alright..\n\nDim sum was a bit overpriced I thought, the service was definitely questionable. I watched a table behind us leave, and watched a waitress storm from the room yelling that someone had left! Did anyone know where the lady went?! Kind of scary.\n\nIt's in a good location... close to my mom's house and parking seemed better than irving or clement st., but.. eh. I'd rather go to Good Luck over on Clement.", "author": "Lai-Nin W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-18", "description": "5 Reasons to Never Eat at this Place \n\nbackground: firstly, I am a former food writer for AsianWeek in San Francisco + live/eat/travel/work between Hong Kong and San Francisco.  I know my food from the operations restaurant end to food tasting itself.\n\n1) recently, the restaurant has been closed for violations in terms of food safety and cleanliness\n\n2) boss lady. the lady with the mullet and her pictures all over the walls lacks service.my family member was eating at one table and she wanted to move them to another table abruptly asking with no courtesy. \n\n3) the operation flow is like a restaurant doll house.  when you ask for a number in the front, there is no systems. the front is packed and lacks a line. just horrible experience.\n\n4) cheesy.  the tables are plastered with Mickey Mouse stickers and the front has a trophy mantle case. bad taste.\n\n5) food. a few weeks ago, I ate steamed spare ribs for dim sum.  The pork was just simply rotten and I had to exchange it. I spit it out and luckily avoided food poisoning.\n\n__\n\nSo Yelpers just being an active member and giving you guys a warning.\nAvoid this place.\n\n  I usually dine at Koi Palace which is more pricier but heck, dim sum after all is meant to be an experience of chatter, banter, good food, service, and great tea.", "author": "Rayfil W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-11", "description": "COCKROACHES! count em' 1, 2, 3, 4, 5......\n\nJust running on the walls behind us. There were 2 at first, so they call a person over to smash them. Minutes later, 3 more appear from this little hole. \n\nThe worst part weren't the pests, but there was no apology or anything about them! RUDE and DISGUSTING! No wonder there was no wait on a Saturday afternoon.", "author": "kim w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "Everything was pretty good.\n\nA decent Chinese restaurant with good Dim Sum.  \n\nI'd definitely stop by again if i was in the area.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-09", "description": "The waitress who is tall and wearing glasses was having really bad attitude. She was not put down the food but more like threw the dim sum on the table. The sound of throwing the dim sum was awful. And she forgot to give the soy sauce to the dim sum, I had to ask other waiter to give me the soy sauce. The waiters were great, food is great but only this waitress made me had a bad day there.", "author": "Vincent C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "After a hard night of partying, you always crave that \"I'm going to regret this later\" grease. What better than some DIM SUM?!\n\nVisiting my friends in SF, I really wanted to give the SF dim sum a try. We just decided to look up the closest place to where we were staying (walking distance). \n\nWhen we first walked in, it's a pretty authentic Chinese restaurant with the decoration and the waitress uniforms. We were seated at what looked like a children's table, with Hello Kitty stickers everywhere on the table. I personally didn't care though as long as the food was good.\n\nMost dim sum places that I've been to have carts that are wheeled around and you just pick whichever one you want. Here however, they give you a list and you write down how many of that you want. I think this could be unbenefical for us later because we can't actually choose which plate we want. \n\nAll the shumai were delicious. I was pretty disappointed with the duck however because there was literally only 2-3 pieces with actual meat on it. The rest was pretty much just skin and bones. Also, we ordered some vegetables and they forgot about it. \n\nService was fine, they would check on us regularly but over all experience was tolerable for a rush dim sum craving.", "author": "Kimmy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "I used to frequent S&T for dim sum and never had any complaints. \n\nThe dining space is a reasonable size, but be prepared to wait in line especially on weekends.\n\nThey have a limited selection of dim sum, but what they do have is delicious.\n\nParking is super easy, plenty of street parking in the area.\n\nPricing is super reasonable.\n\nProbably one of my favorite spots for affordable dim sum in the city.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "Okay, this is the first dim sum experience for me.\n\nDim sum( hearts desire)\nA Chinese brunch experience. Basically a buffet that comes to you and you could choose from a list as well. \n\nThis list has many delicious favorites:\nShrimp dumplings, meat dumplings, pork buns, sesame balls, shrimp puffs, taro cakes, turnip dumplings...and it gets better and better. \n\nThis spot was amazing. We experienced delicious sensations with free presentation. \n\nHowever minuses are still there \n\nService was slow and the customer engagement was little. However that won stop me from coming. \n\nThanks Jenny for such an amazing time at s and t", "author": "Monty P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "Authentic Cantonese dim-sum / seafood restaurant. \n\nI stumbled in here without reading their reviews. I was in the area getting my SMOG test (76 sunset gas stn which is a great place by the way) and I'm glad I decided to check it out! :)\n\nHeres my scores for S&T:\nPork porridge w/ 1k egg - 8.5/10\nShrimp 'hargaw' - 10! (skin is of good texture/thickness, shrimp is fresh and generous and DE-POOPED)\nMaylay egg custard cake 'ma-la-guen' - 9/10\nShrimp noodle roll - 7/10 (nam-wa in ny china town is better)\nShiu Mai 7.5/10 (texture is too soft)\nSaltegg custard bun 10\n\nI'm loving' it.", "author": "Cheung L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "As someone from Hong Kong, I am always seeking the food I had from childhood, mostly cantonese food. This place is so far the best I have had in SF area. I went with relative form Hong Kong who live in outer sunset. We had a set menu for $189 which easily fed 8 people. HK style steamed fish was perfectly cooked. Ginger and scallion fried crab was smaller but tasty. A stand out was the dried scallop soup which I am a big fan. It's kind of acquired taste though.", "author": "Paul I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "As far as Chinese food places go, this ranks right up there with my favorites.\n\nIn SF where there's Chinese food on every corner, you really have to make your case as to why one place is better than the one just down the street.\n\nAs far as this place goes, it's slightly more expensive than your average Chinese joint, but you definitely get some value out of the added expense. The squid here is prepared perfectly... tender and flavorful, not bland and rubbery like other places. Also, there seems to be a little more refinement as far as the preparation and presentation go.\n\nI highly recommend this place.", "author": "Jeffrey J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-27", "description": "This place is just.. an average Chinese restaurant. Nothing the great, but not terrible.\n\nI tried their soy sauce chicken which they're supposedly known for. Although it was tender (although in a slightly odd way), the bones inside were still bloody, making me a bit uneasy in consuming it. Plus, there wasn't much flavor in the chicken either.\n\nWe also had their walnut prawns, salt and pepper short ribs, eggplant and fish, fried rice, soup and dou miao. I could go into a detailed review for each dish, but I'll just cut it short and say that the food is pretty typical Americanized Chinese food, filled with oil and corn starch. It doesn't taste bad, but it's not for the refined palate.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-05", "description": "I had chicken with crispy noodles. I don't think crispy noodles are something people order a lot from this restaurant. I was craving crispy noodles, I was in the area and it was on the menu, so gave it a shot.  The crispy noodles themselves were good, the sauce was perfect. The chicken was a little odd (soft and too white in color) but tasty. But I can't complain since it is clear that seafood and dim sum is their specialty.\n\nThe place was clean and the staff was attentive and efficient. The overall decor was little kitschy but not off-putting. I wish I could add a photo but unfortunately my phone went dead. \nI'm not sure I would return here but if I found myself in that neighborhood again?  possibly.", "author": "Gary B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-05", "description": "Hmm.....I'd have to agree with everyone else in that this place only deserves 3.5 stars.  \n\nFirst, we walked in before 10am and the place was closed.  Dim sum should be served early in the morning!!!!! Not after 10am!!!!\n\nSecond, I sit down at a table and there is a small bug walking around on it. Yuck.\n\nThird,  the dining area smells like a mix of sour and saltiness.  Thats the best I can do to describe the weird smell here. \n\nFourth, their chairs and tables are stained and/or peeling too.\n\nOn the plus side, the food was good. It was tasty and clean because I didnt have a stomach ache. Plus their bathroom is extremely clean! (I always worry about dirty bathrooms at asian restaurants).  The bill between two people was pretty reasonable, approximately $20 for about 7 dishes.", "author": "Janet E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "Had a feast with the fam here...  Everything was pretty darn good.  I was pretty impressed that the quality of each dish shined through.  Had the dungeness crab encrusted with salted duck egg yolk (Yummy), salt and pepper pork (tasty), snow pea leaves with garlic (fresh), letttuce wraps (refreshing), soy sauce chicken (tender), Steamed striped bass (fresh), chicken and salted fish fried rice (loved it).  Ended it off with their complimentary red bean soup (ok).\n\nI must say that I wasn't expecting too much, and was pleasantly surprised from our experience.\n\nHeard some good things about their newer sister restaurant in San Mateo - H.K. Causeway Bay.  Could be worth trying out their Dim Sum!", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-31", "description": "There are really good dim sum places, then there are places like Hong Kong Seafood Restaurant. The dim sum is average for some things and better for others, but you come here anyway because the location makes it the most convenient place to visit. I did have a few firsts when I visited this time.\n\nI tried pan-fried duck chin with maggi sauce for the first time. There isn't much meat on a duck chin as one might imagine, but the flavors were good. I felt like a dog chewing on a bone for the longest time just trying to extract any meat left on the bone, only to be disappointed. It makes me wonder how they procured so many duck chins to cook. The other first I tried today was the baked durian turnover. I've heard people who either love or hate this fruit. Andrew Zimmern has tried multiple times to eat this fruit only to be disgusted by the smell and texture. I braved up and tried a bite and decided it wasn't so bad. In fact, the taste was sweet and reminded me of pumpkin flavored cream cheese - I actually kind of liked it. It helped that it was baked into a flakey pastry. \n\nSome other highlights from dim sum was the lobster noodles, which had a ton of ginger and garlic. I also enjoyed the fried tofu and the deep fried balls filled with pork. Major disappointments included the super dry and soup-less xiao long baos and the mushy BBQ pork turnovers.", "author": "Bailey Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-18", "description": "Besides the other Chinese Restaurants that, I have been to like on Irving, Balboa, Clement, Geary, San Francisco Chinatown. \n\nS&T Hong Kong Seafood Restaurant is not that bad of a place. I have been here for lunch and dinner several times. The food here is wonderful.The food items that, I like would be the Sweet And Sour Pork Chops, Honey Glazed Walnuts With Shrimp With Mayo, Crispy Chicken With Shrimp Chips, Peking Duck With Steamed Bun.", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "I loveeeee this place. I went yesterday for lunch. It was dimsum and good. i've had better xlb's, but the duck here is good, the zha leong (?) my canto sucks, it's like you tiao wrapped in chang fun for those who know what i'm taling about, is delicious, I also had the pumpkin with salted egg yolk. this is a must!\nit's basically pumpkin fries in salted egg yolk batter and fried. IT DOESNT TASTE GOOD THE NEXT DAY SO BE SURE TO FINISH ALL THEM PUMPKIN FRIES. \n the chicken feet in abalone sauce was really good too! these were kind of my highlights, if I think of what else I ordered I'll revise this post. \n\nAnd the food looks so pretty and elegant. I forgot my phone at work the previous night and so I couldnt take pics or else I would have uploaded a buncho pics. I'll go again just to take pics and upload them here. \n\ndimsum is always pretty cheap, and it's best to get dimsum when you have a big party so you can order/sample more stuff.", "author": "Emily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "The bomb!!! I got a rec from a friend who grew up in the area and has some authority on authenticity. She told me to \"skip Chinatown because it is overpriced and low quality\" and head out to Sunset. I followed here advice a few years ago and was very pleasantly surprised. Came back with the wifey last week and was again impressed. We ordered a lot so strap on your seat belts. \n\nWe ordered the Har Gow (about $3 I think), Spinach and shrimp dumpling (about $3), BBQ Pork Bun (about $3), Roast Duck ($5), Fried Calamari ($5), Fried Chicken Wings ($5), and the Singapore Noodles ($11). You are probably asking yourself, \"Was all of that really necessary?\" Well the waiter was asking the same thing. We didn't finish it, but I am sure that it made for some really tasty left-overs for this one homeless man back in the Mission. \n\nAnyhow, The Har Gow were amazing. Perfectly flavored and so delish. The spinach and shrimp dumplings were really good too, but not quite as good as the Har Gow. The BBQ pork buns were the best I have ever had. It was not that cheesy looking died-red meat, but was very tender and flavorful, nice sized chunks of pork. There was a great meat-bun ratio and the bun was really good. The wifey loved it, which says a lot because she does not care for these typically. in fact, i have never seen her eat one before. \n\nThe roast duck was probably the best, if not definitely in the top three, that I have ever had (http://www.yelp.com/biz_photos/TR5FbzexqkO0jJ7Sc3MsMA?select=WdpmXuCeUTBLG-qaHsI6uA). i had some good duck in Singapore and in Malaysia chinatowns, but this was cooked with care. The skin was very crispy, the meat was perfectly seasoned, and it was cooked perfectly. A+! The chicken wings were one of the few things that we though we could have lived without. They weren't bad by any means, but they just weren't amazing. They were basic salt and pepper fried chicken wings. The calamari was quite exceptional though. Perfectly seasoned and battered and cooked to a perfect tenderness. No chewiness, which is amazing. I questioned whether or not it was really calamari. \n\nThe Singapore noodles (http://www.yelp.com/biz_photos/TR5FbzexqkO0jJ7Sc3MsMA?select=_Kz5XRhmIkJBcj23vVEUiQ)were very aptly named. Very thin rice noodles pan fried with curry powder, char siu pork, shrimp, and egg. They were so flavorful and delicious and really showed a nice mix of Indian/Indonesian, Chinese, and native Malay seasoning. It brought me back to the place for sure. \n\nThe chili sauce that they served was phenomenal. Hands down, the best Asian Chili sauce i have ever tasted. It was so deep, layered and flavorful, I could have just eaten that with some wonton chips and been happy. The mustard was really good too, cleared the sinuses right out. \n\nI do not know the Chinese names for the things that we ordered, but I bet you everyone else in the restaurant did. We were the only non-Asians and, it seemed, the only folks that did not speak Chinese. Experiences like that are some of my favorite aspects of America. I hope places like this continue to thrive and welcome foreigners. All of the staff were extremely friendly, welcoming, and helpful. The service was quick, but they also were not too busy. Definitely make the trip out to check it out. It is so worth it!", "author": "Miguel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-29", "description": "S&T Hong Kong Seafood is hands down the highest quality Chinese Restaurant in the Sunset District.  Located on Noriega and 30th near a slew of competition, this place is by far the best.  The service is fast, top quality, friendly, sincere, and memorable.  Simon, the waiter who took care of us talk about interesting culinary details of the dish.\n\nFor $80, you can purchase a five course dinner for 4.  With that order was an amazing shark fin soup, a vegetable and beef order that was excellent, a whole steamed fish seasone with green onions and ginger that was hearty, a vegetable dish, and there was one other dish that was quite good.  The atmosphere is classic Hong Kong style and reminiscent of many restaurants I frequented when I visited Hong Kong many years ago.  Classic bright lights, fast pace, yet very professional service.\n\nThe wine was superb and my friends and I had an excellent time.  One interesting detail was a newspaper review from the Chronicle which indicated that S&T was the best Chinese Restaurant in San Francisco.  The restaurant critics from the SF Chronicle are known to be very picky.    If you have been here in the past and have not enjoyed the experience, the management has changed many times, but, over the past 10 years, it's been under the same ownership.  I met the owner, a woman who was very sincere and had the energy of a person who abides by high standards.\n\nThe waiter who took care of our table, a very friendly man, was a sincere host who gave us an excellent complimentary green bean soup for dessert at the end.  \n\nThe wine, the food, the service, and overall \"time\" was an enjoyable experience.  I cannot wait to come here again.  Even on a slow weekday late at night, the place was crowded and filled with life.", "author": "Tony U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-04", "description": "I give this place 2 stars. Very small portions and expensive. Not appetizing either. I came here with my boyfriend. Note: If you're not Asian, don't eat here. Everyone in that restaurant kept staring at us. Very rude and uncomfortable experience", "author": "Glacier M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-20", "description": "one of the best dimsum place u can find in SF, service might not be the best sometimes.", "author": "Zack Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-19", "description": "I don't understand why so many Chinese places have names like this. S&T, D&A, ABC.. huh? Anywho... \n\nWoke up WAY too early but I was bribed by family to get out of bed for dim sum. Glad I did!  We were seated promptly at 9am by some man in a gray vest. Reminds me of all dim sum restaurants and their outfits. They always wear vests which I find kind of cute. Dressing up for breakfast! Place filled up fast so don't drag your feet if you want a seat here.\n\nIt's more expensive than the average dim sum restaurant but they sure give you your moneys worth.  It's the subtle things that make a restaurant earn extra brownie points. I knew it was going to be a good meal when I noticed they added cilantro in the bbq pork rice roll, which is just a little something more than usual.\n\nAlso loved the bean curd roll.  It was filled with pork and shreds of vegetables that combined all the flavors so nicely. The Chicken and Rice in Lotus Leaf has always been a favorite of mine.  Lovin' the egg yolk and Chinese sausage they added in.  It's like a little surprise when you dig through the rice :) I don't normally order egg rolls but they make them extra crunchy and when you dip it in the spicy red sauce your mouth just waters! Their beef chow fun wasn't greasy at all and I happily finished my meal off with a Egg Custard Tart.  Skip the Shanghai Dumplings here though.. save that order for Shanghai Dumpling King in the Richmond district.\n\nOh. And something unfortunate happened during our meal.\n\nMy mother: *facing the window* Omg. They're going to take the trash in through the front..\nMe: ewwwww\nMother: Really.\nMe: Eeeewww! *Turns around*\n\nIsn't it a health code violation to drag the trash can THROUGH the restaurant?! I wasn't thrilled to see some smelly can dragging next to all the food and people. Even so, food was great and I'll forgive them if they never drag another trash can through the restaurant while I'm there again.........Ignorance is bliss.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "I went there with my mom on a weekday and we were seated immediately. I scanned the list of dim sum items to order and yes, it is a bit pricey.\n\nWe ordered the basics; pork sui mai, shrimp dumplings, baked bbq pork buns, the egg custard steam bun and an order of Chicken, Gui Long (Chinese broccoli) chow mien. The food was great - the pork sui mai was larger than at other dim sum restaurants, the egg custard bun was my favorite and it was delicious. \n\nOverall, the food is great, but more expensive than at other Dim Sum restaurants. I'm curious to see the wait time during a busy weekend lunch. I'm glad I tried it and I was pleased with the food, but I would probably come here as a treat or for special occasions.", "author": "Allie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-10", "description": "My experience in this restaurant is awful! The food was great!! I would give 4 stars for the food, but the customer service was terrible. The waiters were nice, but there was one waitress really pissed me off. When she served me food, she just threw the dim sum on the table. She was showing a very bad attitude. And then she left without saying a word!! I will never come back here again!", "author": "Sharon H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-07", "description": "No rubber food here! The squid and scallops were tender and perfectly cooked. The was soy sauce chicken moist and delectable. Every dish was excellent! A kitchen that cares about the food... wow! And on top of that... great service! Not just from one waiter, but the entire staff! \n\nWay to make us feel welcome and leave us well fed and happy!\n\nThis is DEFINITELY one of our go-to places for family dinner.\n\nOh and one more thing. They charge tip for large parties, but make it very clear in English as well as Chinese, the tip charge. I like that!\n\n(note: no AmEx, but Visa/MC ok...learned by experience lol)", "author": "Kenneth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "Dim sum review only:\n\nthe dim sum here is actually really good. It used to be worse but it's been under new management for a while and the last few times I've been, the food has been good. Always start out with some jasmine tea, just because. Then it's onto the entrees:\n\nShrimp dumplings: They always have them fresh and piping hot, and the skin doesn't just fall off the shrimp when you try to pick it up, like at other places. One of my favs.\n\nPork Siu Mai: You can get it with or without the shrimp but so many other dishes have shrimp, it's better to get it just regular. Plump and juicy pork in every bite.\n\nChicken feet with black bean sauce: Maybe it's a Chinese thing but why WASTE a part of an animal...jeez! The sauce makes it really good, just imagine you're spitting out like fish bones or something...\n\nAnd whatever else satisfies your craving. Also we haven't ordered it the past few times but I do remember they used to have some cheap ass lobster chow-fun during dim sum time.", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-04", "description": "02.27.11\n\nDim sum with mom and pop.\n\nNo dim sum cart ladies.  They will occasionally bring dishes out on a platter.  You do your ordering on a menu.  It's pretty high tech for a Chinese restaurant.\n\nAlmost everything we ordered were excellent.  Go for the siu mai, hai cheung, and the soy sauce noodles.\n\nSkip: green onion pancakes, even though they're only $1.99.\n\nWill be back!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "Good dim sum. Lines can be long. Mediocre service.", "author": "Yelp R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-08", "description": "0 Star\n\n\nA bitchy owner just yelled and cursed before rudely asking us to leave her restaurant.\nThis was because we sent a fried fish back to a kitchen due to its bad smelling.\n\nShe loudly said in Chinese translated to \"This is a frozen fish. If you guys do not like the smell, never ever come back to my restaurant.\" \n\nIt was so serious that we were about to call a police. However, we were nice enough to pay for what we ate before we left.\n\nAnyway, we are going to report the Health Department. Most importantly, we wanna tell her to do something else if she hates to service people. Servers were nice to us though.\n\n\nIf you want to eat a real frozen seafood with unexpected services. \nTry this HELL Kitchen.....", "author": "Ari C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-12", "description": "Big family reunion (15 of us!) at S&T Hong Kong Seafood Restaurant, we were packed like sardines at the table, but we had a ton of fun.  We ordered the traditional chinese banquet dinner and it was pretty good...Not Koi Palace or R&G good, but still quite respectable, probably the top pick for traditional Chinese dinner if you live in Outer/Inner Sunset.\n\nCheck out my snapshots, they speak for themselves.\n\nI heart family!", "author": "Burrito M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "My family opened the Lunar New Year by having dinner at S&T. I don't think I've had this kind of quality Chinese food in a long time. We didn't order anything exquisite because we're not made out of money and that's just it. Average people food that taste excellent is just what people need more of these days. \n\nWe ordered a Crab Meat and Fish Maw Soup, House Special Chicken (aka Empress Chicken), Salt and Pepper Spareribs, Fish and Tofu Claypot, and a Lotus Root and Baby Fish Stir-fry. You get what you ask for. They do not skimp on any of the ingredients and it was strictly no frills, solid, good food. \n\nThe crab meat in the soup tasted fresh and sweet; the chicken meat was tender and springy; the spareribs were lightly battered and salted perfectly; the claypot had literally only fish and tofu but it was full of what Chinese people call \"breath of a wok\" meaning it was piping hot; and the stir-fry was interesting but very delicious. \n\nS&T is a little bit more expensive than other restaurants but you get what you pay for. For an extra couple of bucks for each dish, I don't mind eating some quality food. I know everyone in the packed restaurant that night probably agreed with me too.", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-06", "description": "Food is ok typical.  Customer service is nothing to really write about because of the people are very inconsistent.  Soy Chicken or Tea Chicken is tender and juicy but quality has changed.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "Above standard Chinese fare. Prices are very reasonable. Food is fresh and well prepared. Place is a little dated, services is like any normal busy restaurant. Dim sum is good. The only negative is that the owner is always skulking around with a scowl on her face. If she gets to know you she can be quite nice, but if she does not recognize you, beware.", "author": "K M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "So I came in here with a friend on New Year's day to fill my stomach up since I threw everything up the night before. I was pleasantly surprised. \n\nGot in here at about 10:30, didn't have to wait for a table, and ordered some of my usual dim sum favorites. Cha siu sow, Chinese broccoli in oyster sauce, ha gow, siu mai, etc. We also ordered pei dan jook, which was great for the first hangover for the year, though it did come out a little too salty for my taste.\n\nOne of the things that sets this dim sum restaurant apart is it's take out window. Sandwiched behind a paper screen and what would be the fire exit are a couple of glass cases with a few additional dishes you can order without even stepping in. I didn't see any of the waitresses carting those dishes around. Something to ask about the next time I come back.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "Had my grandfather's 80th birthday party here with about 50 people who came. This place was really popular because they had at least 3 other parties going on that night at the same time. Worked with Teresa to hammer out a menu. 11 courses and in some cases, tables with kids, 12 courses all for around $271 a table. She was really friendly and helpful, even gave us her cell number in case we had any extra questions. The food was delicious and everyone left completely filled. At the end of dinner she gave us steamed peach buns, they were the BEST buns i've ever had.\nI will def tell everyone to come here for their parties, extremely helpful and friendly, she gave us our own half of the restaurant from 5pm till closing and even let me in early to set up everything I needed to. She places special red table cloths on all the tables and even did seat covers for the head table!", "author": "Brian J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "Good dim sum, but not anything special. A big drawback for me is that they don't have carts zipping around and everything has to be ordered from a checklist. Standard dim sum fare, but their soup dumpling was pretty tasty. For one order, you get a mini-tureen of two loosely-wrapped dumplings and a chunk of shark fin (I know, no Pee Cee). Very rich  chicken broth and a dash of vinegar goes well with it! I also liked their pig liver sashimi. Really thinly-sliced pieces of liver steamed on top of bean sprouts with an oil and soy dipping sauce. Surprisingly tasty umami bombs.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "Well my sister Serra N. was more generous on her review of this place than me... Yes, the service was wonderul and the dim sum was \"good.\"  The mark down comes from them charging us $1 each for tea... when only 2 out of 6 of us drank any.  They didn't even ask if we wanted it.  Like my 4 year old niece was drinking tea even if my sister said it was OK? NOOOOO.  I eat dim sum at every opportunity and theirs was good not great... and to really top it off... it was pricier than I have ever paid anywhere............ go figure...", "author": "Lydia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-04", "description": "Whenever I have a day off and have lunch plans with my mom, this seems to be our default place. This has also been a default place for dinner when we can't decide where to eat at. I've been less than impressed the last couple times I have been here. \n\nIf you do make reservations for dinner, be sure you get there on time or else your table will be swooped by another family who doesn't understand that reservations come before those who don't have reservations. Food is alright and I must say really expensive. I guess it's probably the fact that the place looks nice and doesn't look like a hole in the wall-- but honestly you can have some really good (and cheaper) food at a hole in the wall and be treated much better than the workers here.", "author": "Eugenia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "We went here for some dim sum and thought the dishes served were pretty good - not amazing, but for the price, its a great value. They have some off menu items that my host knew about (some kind of dumpling in soup) with shark fins... \n\nMmmm, food always taste better if you know that they are becoming endangered...On the wall, you can see photoshopped images of the owner with various taiwanese, HK singers and stars which make for great conversation. As per most chinese places, service is served with no smile and a little bit of attitude.", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "I have been coming here for years. My family usually comes here for dinner, but this time, we got dim sum. We got cha sui chong fun, sesame ball, woo gok, hahm suey gock, custard tart, and portugese tart. Dim sum is pretty good here. \n\nDinner is better. We ususally get the sizzling beef, honey walnut prawns, mo po tofu, curry crab, chicken, sometimes duck, and spareribs. \n\nEverything is pretty good here. Service is ok, however sometimes they serve rice at the end of the meal which doesn't make sense. OVerall solid place to come.", "author": "tracey l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "So Fantastic you need to keep this place a secret. Complex, mind blowing flavors entice you out of your comfort zone to an adventure of exquisite food.", "author": "P. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-20", "description": "I've lived in the sunset for a good chunk of my life and have recently rediscovered this restaurant. While most people come here for dim sum (which is pretty good), I'm going to write my review about dinner.\n\nAs others have said, a MUST HAVE is their Soy Sauce Chicken. While it is a bit pricey at $10.85 for half a chicken, the quality more than makes up for it. The meat is tender, smooth, and flavorful. They also give you their own soy dipping sauce (not plain soy sauce) which only enhances the dish.\n\nFor soups I would recommend their Crab Meat with Fish Maw soup. Now this is on the more Chinese end of soups (compared to the way Americanized Egg Drop Soup). For a decent price, you get an abundant amount of Crab and Fish Maw in a nice hot clear soup.\n\nEverything else on their vast menu is at the very least decent, but I have yet to try too many of the dishes. So far I haven't come across anything that I absolutely didn't like. I would've given them 5 stars, but they lost 1 because they are a bit pricey for a Chinese Restaurant.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-24", "description": "Yummers! I just had dinner tonight and the 9 course meal was pretty good for the money. Large portions too. I really like the shark fin soup they made, it was smooth and the soup was flavored just right *no need to add soy sauce!*. Yes, I know they're banned, but this was my last hurrah in that delicacy...and thanks to this place, it was memorable.\nI thought the honey walnut prawns were okay (more mayonnaise flavor than most places, and the fried mini strings on the nuts were too hard to chew), the abalone mushroom with baby bok choy was also a hit at my table, and the fish was moist and flaky. The bowls of noodles had a good chicken base flavor and the texture was perfect.  My favorite dish was the stir fried garlic lobsters...OMG, they were awesome with lots of ginger and garlic clinging to every morsel.\nMy parents really like the dessert which consisted of freshly made peach buns with yellow mung beans inside, and the green bean sweet soup which wasn't that sweet...so it was perfect for the diabetic seniors at our table.\n\nService was brisk and they changed our plates quite often. Parking is metered along the street so you have to make sure to grab what you can, when you can.", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-27", "description": "We had dim sum here yesterday. The first thing we noticed was that the chair height was too low. We had to stand up to get food because the table was too high and there was no lazy susan. The best dish there was the steamed custard bun. The custard was nice and smooth and not to sweet. The shrimp and mushroom crepes were good, but the hahm sui gook and egg rolls were under fried. The prices were higher than most places. \n\nAs most people mentioned, the service was terrible. The waiters and the owner were running around like chickens with their head cut off with nothing getting done. We waited for them to take our order for awhile and for the food to come out. They should maybe have more people in the kitchen helping to get the food out than all the distracting waiters shouting to each other across the room. \n\nWe will stick with the Grand Palace in SSF. There's plenty of parking, a variety of food comes out fast on carts, and there is comfortable seating.", "author": "Anna K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-25", "description": "Ok this place got so much better. I think they read my review ahaha jkjk probably don't care even if they read it.\n\nOk last time i came here, no one cared about what I wanted, this time they actually do care now. Because they want TIPS. If you don't give 10% or more.. they will follow you out and ask how come we did not get over 10% TIP ATLEAST!!! True story. \n \nOn to the food now, I only come here for DIM SUM, By far the best place i've tried on noriega. Been here a couple of times now, but i still believe they can do better. \n\nKeep up the good work and improve more and more", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-09", "description": "We have dined at the S&T Hong Kong Seafood Inc. Restaurant in the Sunset more than a dozen times in recent years, and found the food delicious each time. Regardless of what course we order, we have never been disappointed (except for the steamed fish on Oct 7). I would give 5-star for the cuisine and the presentation. For the quality and portion, the price is reasonable.\n\nThe waiters are nice and helpful. They have a sense of humor, too. I give them 4-star for their service.\n\nHowever, our experience with the owner, a short-hair woman, turned out to be most unpleasant. And I wish to give a negative star for our experience. Our dinner reservation was at 7 pm.  Our friends arrived at the restaurant before 7 pm. We showed up around 7:05 p.m. We waited around for a while, and assumed our name would be called when our table was ready.\n\nSince no one came to our group to let us know how much longer we would have to wait, my husband checked with the woman owner if our table would be ready soon. She snapped and shouted \"this is the THIRD time you (guys) have asked!!!\"  My husband was caught by surprise by such rude behavior and said \"this is my first time checking on our reservation.\" The woman owner kept the same tone and demeanor \"Your table is being cleaned right now!!!\"\n\nWhen our food was served, I asked the waiter why the woman owner would treat her customer(s) with such bad attitude. He explained that's how customers would remember her. I then commented it would be awful to work for someone like her. The waiter's response was \"we have learned to ignore her.\"\n\nFrankly, I do not understand how one can stay in business if the owner can treat her customers in such way.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "This place is close to my parent's house in Sunset.  I love coming for for Dim Sum and dinner.  \n\nThe food is very authentic.  One of my favorite dish is Crab with Salty egg deep fried ($22.95).  A must try if you like crab.  Shark fin soup, beef pan fried noodles, green mustard with garlic, deep fried tofu with shrimp, dried scallop soup, peking duck with buns are also really good.  \n\nI had my Mother's 70th birthday here December of last year.  Everything was wonderful.  We reserved 5 tables and all the food was excellent.  Hardly anything left on the table to take home.  The banquet menu with tax and tip come to $1350.00, which was a great deal.  \n\nThe service is descent. Parking can be challenging depending on time of the day you come here.", "author": "Rose F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "I enjoy coming here for dim sum with my family. The dim sum always comes up piping hot and is very fresh. I appreciate that unlike many dim sum establishments in the sunset, they use fresh ingredients and the quality is high- expect distinguishable ingredients in all their dumplings PLUS nice, thin wrappers. Service is good, but not the best. Bathrooms are clean.", "author": "Carmen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-27", "description": "I've come here quite a few times with my parents this year; they seem to favor this place for the convenient location to my apartment, the service, and the food. So I'll simply summarize my own thoughts from my multiple visits here:\n\n1) Dim Sum - Can be a little slow in bringing them out, but the food has been satisfying; I like the plates of vegetables we can order with regular dim sum dishes, e.g., shu mai, pork buns, etc. Sometimes the food can be a little greasy though.\n\n2) Lunch/Dinner - Love the fish here, and the various meat/vegetable dishes are also satisfying. Big family-sized portions; definitely meant for groups.\n\nService has been varied, but the servers are generally polite with requests from my father. Once, a waiter gave us a hard time for not finishing one of the specialty dishes...but of course he was just picking on us in jest. We just laughed along with him.\n\nThe clientele of this place is heavily Chinese, but they talk with us in both Cantonese and English depending on the server.", "author": "Helene K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-20", "description": "Do not come here. After being one the first to be seated, waited 45 minutes to get our food. At a dim sum restaurant u would expect to see carts. No carts at all! Order by menu. Check out other restaurants before.comimg here.", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-06", "description": "Cheap dim sum, service is typical (as in grunts), and their food is okay for the prices.  \n\nI love their rice noodle rolls with XO sauce!  I'll admit though that some of their dishes are too greasy, and they have dim sum, via pre-ordering.   \n\nParking is an utter pain...but you need to look harder.  \n\nI come here, if I am too lazy to drive to the other side of the park for better dim sum.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "They serve delectable dim sum hot and fast, so we weren't waiting too long in between dishes. I particularly liked the shrimp dim sums, such as the deep fried shrimp balls, pan fried shrimp & chive dumpling, and shrimp dumpling (hargaw). I didn't really care for the donut with rice noodle roll and the BBQ pork noodle roll because the donut and pork didn't taste fresh.", "author": "Cliff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "Came here for a friend's birthday dinner last weekend.  The signage out front threw me off since I was scouring Noriega for \"S & T\", and apparently this restaurant is known by everyone on earth as \"Hong Kong Seafood\".   Oops.\n\nWe chose one of the many set dinner options for ten, which came out to about $24 pp.  Feasted on what felt like a ten course wedding banquet, which included cold appetizer plate, sharks fin soup, walnut prawns, veggies, salted egg crab, steamed fish, etc. etc.  Your typical Cantonese style seafood, but done well.  And a ton of food for the price.\n\nService was surprisingly good with the wait staff being on top of service, cracking jokes with us, and cutting up and serving the birthday cake without qualms.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-09", "description": "This place is alright. It's no Hong Kong, but it's better than some of the other dim sum places in the Sunset/Richmond district. Decent variety and reasonable prices.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-12", "description": "I came here for a family dinner on a Sunday evening, waited for about 10 minutes before seated.  The last time I came was 10 years ago, I heard they are under new management and lots have changed.  \n\nWe ordered the half soy sauce and white chicken.  The soy sauce chicken was excellent; white chicken was just okay.  The black pepper short rib was delicious.  We also had the crab meat and fish maw soup, it was really good as well.  The only thing I didn't like about it was the food was very greasy, but I guess that's what makes it good.  The price is a little more expensive than other casual Chinese places, but quality makes up for it.  I will come back someday.", "author": "Jamie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-23", "description": "Meh. Cheap dim sum, comes to around $10 pp with tip, but the service was hideous. Absolutely rude. The food was fine. If the service was just normal, I would have given more stars. \n\nWe ordered shrimp fried rice which was tasteless.\n\nOur tea was empty, and the top was opened. No one cared. We had empty dim sum plates, and they just put down more food without removing the plates. Surprisingly, they were packed on a Tuesday afternoon. I will not return.", "author": "Goshen F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "Hungover, sleepy, and not wearing a bra. That's me on Sunday morning when my roommate's boyfriend dragged me out of bed b/c he was stood up at the cliff house. \n\nI managed to brush my teeth and find the ray-bans and was kidnapped to this place. I should note that it was bay to breakers day and I was NOT IN THE MOOD TO DEAL WITH TRAFFIC so my rules of sunset only were abided by. *sort of*\n\nAfter waiting for close to an hour for a table and running into several relatives of my dining companion, we were seated. The thought of anything other than coffee made me less than enthusiastically mark a \"1\" next to the Shanghai dumplings. However, my companion ordered EVERYTHING and a tsing tao. \n\nNot knowing my bullshit detector, he but some meat on my plate and said it was \"beef\". I'm f'ing hispanic which means I know for damn sure what tripe is... oh well.\n\nAfter the third Tsing Tao, I had eaten the blood jello, frog, chicken feet, tripe, pork ribs, duck, shark fin, and lobster... a whole menagerie of animals if you will. Sometimes I just wish that eating with the chinese anthony bourdain could've waited until after four. Beggars can't be choosers, I guess. \n\nP.S.-- our bill came to well over $200 but that's just b/c we kept buying startled elderly diners tsing taos in an effort to liven up the joint. i heard myself referred to as \"crazy white girl\" which to me is a compliment and well worth the check.", "author": "dr S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "I drove by this place plenty of times thinking it wasn't really good but just a place to go to...surprisingly i found parking on a SUNDAY! i guess i went early enough..\n\nthis place is pretty packed...really hungry older Asian people who are willing to cut you in line to say that they are first (I'm Asian so i can make fun of ourselves)...\n\nthis place no all that eye catching...the seats had duct tape on it and looked almost run down..but the food is amazing!\n\nyou can order off the piece of paper and its easy to read...for all you non-chinese reading people (including me)....the best was the fried chinese donut with the noodles wrapped around it...i also liked the tripe and shrimp and beef noodle...it was pretty good! i must come here again..but if someone cuts me off..im gonna go crazy!", "author": "Brendan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-10", "description": "The food is decent enough to garner local support from the Chinese community for a cheap to moderately priced menu. The dim sum is good for the price you pay, but don't expect anything fine or special. I would give this place a 3 stars rating in comparison to Chinese restaurants of its class (local family eatery). The one star is for the dining experience because the waiting staff was really rude on the day of my visit to the point of being hostile. I went in for a no frills dim sum lunch and was delighted to see that they had Vietnamese style egg rolls on the menu and ordered it with great anticipation because I just happen to have a craving for Vietnamese imperial rolls. What came out was regular Chinese cabbage egg rolls. When I asked a waiter what it was, he admitted that they were Chinese vegetarian egg rolls and they didn't have Vietnamese egg rolls. So I wondered why they would attempt to serve me something I didn't order without first informing me and this led the waiter to talk to his manager before he agreed to take the dish back without charge (luckily I had not eaten any of the egg rolls, because it was obvious they were not Vietnamese style egg rolls and I thought a simple mistake may have been made). As I was leaving after finishing lunch, another waiter stopped me (literally blocked my way out) and told me in my face (really loudly) that no one should expect a Cantonese seafood restaurant to actually serve Vietnamese egg rolls even if it's on the menu, just like no one should expect to find authentic Shanghai dumplings in a Cantonese restaurant. He warned for me to even harbor such an expectation was a serious mistake and I should not do that again. Of course this was total nonsense. The restaurant not only misrepresented itself in writing on the menu but it's the customer's fault for questioning something that wasn't ordered? By that time I just wanted to get out of the place as I was afraid of getting hit. So I apologized for being an idiot and thanked the waiter for his advice and was then let go. Wow! These people need some serious crash course on customer service. And please get the Vietnamese style egg roll off the menu if you don't have it. Oh, BTW, lots of Cantonese restaurants serve great Shanghai dumplings as well as Vietnamese style egg rolls.", "author": "Giovani T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "Mmm! I bring my nonchinese friends here, it's a good place to intro them to dim sum. One of my friends is addicted now! The prices are higher than other dim sum joints but the quality is great. Large restuarant. Gets crowded on weekends. Eexpect a wait.\n\nget the shrimp dumplings!", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-23", "description": "Food is hit or miss here. \n\nThings you should go for.\n\n1.Some sort of Tempura fried with \"salty egg\".\n2.The crispy skinned chicken.\n3. Mix mushroom plate\n4. Eggplant and fish pot.\n\nDouble check your bill, since they overcharged me twice here.", "author": "Dorian T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-04", "description": "Good selection of dim sum but arrive early If having a large party it tends to get busy after 11am on the weekends, dinner was delicious too doesn't taste too oily, would come again.", "author": "Linh D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "Good Dim Sum. Very clean. Good service.\n\nAlmost sounds like a jackpot, isn't it? They have great variety, and they were all very good. Very fresh, and this place is not overly crowded.. so everything came out fast. I heard the owner used to work in Koi Palace which kind of explains the higher standard quality. Plus they have pictured of famous HK actors and actress on the wall, hmmm.... \n\nFinally found a good dim sum spot around outer Sunset.", "author": "Marlis T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "I live really close to this place so my parents and I come for dim sum quite often and I had dinner there recently to celebrate my mother's birthday. It's like any typical Chinese restaurant unorganized but the food was still good. I go to places like this not for the service but for the food. The one down fall is the long wait on the weekends. My parents enjoy their dim sum because it's not too salty, which is a change from a lot of other Chinese restaurants.   \nLike I said the service is not that great, but during my mother's dinner it was a whole new level of horrible service. My mother asked if what we ordered came with rice and the waiter told me my mom very rudely, \"No, of course not what do you think rice is not automatic with the meal\". It was in his tone of voice belittling my mother's question, which made me very upset.  \nThe worse part of it all was, the food wasn't even that good, which is the reason for the mediocre rating. \nThe sizzling seafood rice soup we order lacked any sizzle and it tasted more like instant soup with seafood and snap peas. It took them a long time to serve us, which it's normal due to the weather and being I was there for dinner on a Saturday night; however, I was not pleased with the food; the Peking duck we ordered was way too fatty. \nOverall their dim sum is better than their dinner and the service there is not great. The waiter we had was obnoxious and we will probably not choose to go there as often anymore.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "I'm a fan.  Service was actually pretty good contrary to other reviews.  Perhaps its the cantonese.", "author": "Koalie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "The price is right and the food is very delicious!!\n\nThe servers are okay, but they take cares of elders, try to let them sit down as soon as possible~", "author": "Vivian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-14", "description": "They could have gotten a five-star if their prices are better. \nI mean $3 for a dim sum dish? come on... \n\nOtherwise, this place is good for a dim sum lunch! \nThe Peking Duck is delish! \nThe veggies are fresh and delicious!\nMy friend ordered 2 more dishes that I have eaten before but just never got to know the name. \n\nI feel welcomed here, but there is a stigma that comes with being Asian and not being able to speak Cantonese. Thank god my friend speaks Cantonese or else I would try to communicate with broken English and hand signals. \n\nThat would be fun. lol.", "author": "Miss C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "Pro: good food for a decent price and they can almost never mess up on your order because they give you a menu to mark up what you want. This way your food comes out nice and hot too.\n\nCon: I almost always get dirty looks from the waiters until I start to speak Cantonese to them. The service is okay... But you can't really expect much.\n\nonly come here for the convenience.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-16", "description": "Beware they charge $1.65 per person for steamed rice. It doesn't sound like a lot but when have a group of 6 or more wait til you see that $10 or more for that covered bowl of steamed rice. What a rip off. Rest of the food was ok. Their soy sauce chicken is alright. expensive place try others for better value or quality for the price", "author": "Al S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-18", "description": "I went her yesterday night for dinner with my family after coming back from The California Academy of Sciences in Golden Gate Park. We came to this restaurant randomly, because we were tired of driving around to find a place to eat. When  we arrived at the restaurant, there were only a few table dining, and we were seated right away as we entered. We took a look at the menu, then we ordered. We ordered in Chinese, a Crab, Spareribs with XO Sauce, Oxtail in Red wine Sauce, and Crispy Chicken. We were asked if we wanted rice and we said yes. The waiters also came by and changed our plates and gave us new ones. The family liked the crab, the Spareribs were okay, not the best I've had. The Chicken I thought was a little dry, and as for the Oxtail it was decent. Overall, I'd give this restaurant a  3 stars.", "author": "Mystery M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-16", "description": "Gave this place a 2nd try & ate here on a Sunday and still don't think it's worth a line to have dim sum here. the food was not that great where I was still burping the food I have intake till the evening. \nIts the only one out of 2 dim sum restaurants in Sunset, but it's more worth traveling to other district such as Richmond or down South in Daly City or Millbrae areas for dim sum. This place is trying to hot sell it's place with HK celebrities photos taken with the owner of this restaurant, which makes me wonder what was the criteria determined to be a good restaurant for them to consider coming here.\nI really don't think the celebrities who took photos with the owner would've came all the way out to Sunset to eat there, I'm sure it's at a different location in San Mateo perhaps to attract more Asian customers in the area.\nThe ladies who were dropping off my order also has an attitude... Its worse than going to Chinatown for dim sum.", "author": "M W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "This place was SOOOO good! I recommend going with Cantonese-speaking friends that know their dim sum. We were seated relatively quickly (maybe a 5 minute wait) even though there seemed to be a lot of people and the restaurant is quite small. This restaurant had a great variety of dim sum, more than any other I've been to in the Bay Area (which, granted, isn't that many). I tried a lot of new things and I was really stuffed by the end. We even had to take 2 boxes home. For 5 people, came out to be about $15 per person including tax and tip.\n\nI was really happy with this restaurant despite there being only one restroom and women are soooooooooo slow when using the restroom. \n\nI would definitely go here again!! (we parked on the street)", "author": "Esther Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "The waiters/waitresses have always been kind.  I believe this is a higher end Asian restaurant.  It isn't as rude as other places! HAHA.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "Christmas Eve morning and kids say \"we want dim sum\".  Mom is at the gym so we roll over to South Sea Village.  What....closed.  I mean it's 10 'clock am.  What gives.  Ah, Friday.  OK Plan B.  Call over to S & T and they say of course we're open.  We roll.  Place is pretty full at 10:15, good sign.  100% Asian clientele, generally a good sign.  We order Haw Gau, chow fun, baked and steamed BBQ pork Buns, Soup dumplings, Pot Stickers, \"Sticky Rice Rolls\", Salt and Pepper Calamari, BBQ pork.  \n\nService a bit slow, probably due to the fact that they aren't used to being busy on a Friday morning.  Both the BBQ pork buns were very good.  Big fresh shrimp in the Haw Gau, Soup dumplings not bursting with soup, but juicy and well seasoned.  BBQ pork was OK, but not much meat and too many of those bean things trying to make the plate look big.  Sticky Rice rolls were a bit weird.  A first for me.  Steamed dough rolled with sticky rice and spanish peanuts - Meh..... Calamari was a bit greasy and underwhelming.  Pot stickers were better than average.  $40 with tip out the door.  \n\nOur ordering wasn't that adventurous, seeing I had my 6 and 8 year old kids with me, but they are more willing to try new stuff than most.  Overall 3 1/2 stars, but rounding up on this one because they were nice, it was cheap and they were open.  Check um out.", "author": "Aaron N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "Dim sum here is decent...my cousin is the Mayor here!  But Koi palace is still my favorite (and more pricey)", "author": "Joshua L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-04", "description": "As a native San Franciscan and have dined in dozens upon dozens of Asian restaurants in this city and along the peninsula corridor, plus traveling overseas and dining at non-touristy restaurants there, estimated 95%  local Chinese restaurants serve, by their own admission, American Chinese to placate white American customers if they need that type of customer type for their profit line. Hong Kong Seafood Restaurant chooses not to compromise the choice to maintain authentic Hong Kong traditions.  Even when they include sweet and sour pork, it is prepared with higher quality than the syrupy, fatty, pineapple overly dessert sweet versions elsewhere.\n\nHong Kong Seafood restaurant deserves five stars, even if not consistently perfect, if compared with most other restaurants on several levels. We dined there this evening, Feb. 3 as we have previous times before. The restaurant is not fancy but cleaner with warmer lighting than 96% of the others in this city. Most Chinese restaurants are notorious for filthy bathrooms and kitchens.  This restaurant even has a vase of fresh beautiful flowers in the ladies restroom and clean.  The fish tank water is clean, whereas many other restaurant fish tanks are yellowish and murky looking.  Food here is as close to Hong Kong authentic style as can be found in this area.  I recommend trying their sauteed geoduck with bright, firm, flavorful accompaniment of vegetables.  Their House special seafood soup is generous with large tender scallops, perfectly cooked large shrimp, whole baby bok choy, pork filled wonton dumplings and other delicious ingredients in a tasty broth.  Our other dishes were deliciously memorable as well.  Whereas most other restaurants service chicken and call it minced squab with lettuce cups, Hong Kong Seafood Restaurant offers real minced squab with fresh, crisp, perfectly trimmed lettuce cups as an appetizer, but portion is generous enough as a dinner entree.  Every time we dine there, we are never disappointed.\n\nOther Yelp customers complain about unimpressive service, but if customers fail to be courteous and gracious to the wait staff, waiters do not earn enough to suffer boorish customers.  We have always had positive experience with the service, but then we show respect and appreciation to earn pleasant service every time.", "author": "Lizabeth G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-15", "description": "Now that Fook Yuen in Millbrae is closed, I've been going through dim sum withdrawal. The Kitchen and Koi Palace are okay, but I really grew to really like Fook Yuen.\n\nSo it was time for me to move on, and not compare current dim sum with my ex-dim sum ;)\n\nWas visiting my sister in the Sunset, and I finally ate at S&T on Noriega. The dining room is small and the decor is pretty much your standard Chinese restaurant aesthetic (read: carpet, bamboo plants, pastel paint on walls).\n\nThe prices aren't the cheapest here -- with dim sum dishes ranging from $3-$5.80. Like in most dim sum restaurants (save for the big teahouses in NYC), you mark on a sheet of paper what you want. There are ladies that carry trays around with food, but on this visit, I didn't see women pushing the steaming carts of dim sim.\n\nWe ordered the basics, ha gow (shrimp dumpling), cheung fun (shrimp noodle crepe), steamed pork buns (which tasted very much like the ones you get in Hong Kong or Guangzhou), pork spareribs, two kinds of tripe (my sis's picks), soy sauce egg noodles, et al.\n\nAll in all, the food was good; nicely seasoned, served piping hot. I'd like to return to try their dinner menu.  \n\n(N.B. If you do go for dinner, plan to wait in line for a table.)", "author": "May C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "I came here for Chinese NY dinner and it was good. The place was CRAZY crowded, felt like a zoo. The waiter we got was kinda funny and personable, unlike most Chinese restaurants. He was joking around with the tables and the food came out pretty fast, they were getting the food out fast so we could leave ASAP for the next customers. We ordered a prefixed menu with duck, appetizer plate, scallop fried rice, lobster, vegetables, lettuce wrap, soup, yes and the list goes on. I have no complaints for anything, it was all good.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-04", "description": "The dim sum here is okay but the service is horrific; even for a Chinese joint.  We literally waited 40 minutes for all our dim sum dishes to arrive.  Additionally, when we asked the servers what was taking so long, they were annoyed that we asked them and claimed that it took a long time to steam which is total BS because I've been to dim sum places over 100 times by now and it has NEVER taken this long.  I will never come back here again; especially since there are so many dim sum joints in SF.", "author": "Weston T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-05", "description": "This is one of my favorite Dim Sum places to go to in the Sunset. It's not expensive and the food doesn't take long! However, waiting for your table can take up to 30 minutes on those busy Sunday mornings. \n\nGet the Beef Noodle Roll! And the Eggplant stuffed with Shrimp! The Shanghai dumplings suck here, the bottom was so soggy. Yuck. I wana name more things, but I only the Chinese name for it!", "author": "Amy X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-07", "description": "The shrimp dumplings were fantastic and flavored with sesame oil, scallion pancakes were very greasy and not that great, chow mein was ok, fried squid was pretty good, the cucumber salad was drenched in chili oil and fresh garlic... which I'm still tasting.  A long wait for an average meal, next time I might just get their take out.\n\nNo dipping, soy, or chili sauce available on the table or brought with the dumplings.  A little cheap for a place like this.\n\nEven cheaper still:  Why are all the pencils here from San Francisco Public Schools? Not a big deal but kind of cheesy.  Our tax dollars hard at work?!  Come on people!", "author": "Fredricko B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-16", "description": "OK, so I wanted to take my dad out for father's day around the Sunset District on Saturday night, but unfortunately, the orginal restaurant I wanted to take him to was completely booked so I found this place on Yelp.  Most of the reviews were about Dim Sum, which was fine.  I decided to take a chance.\n\nAs it turns out, worst choice ever made.  Initially when we walked in, everything seemed ok and noticed that there was a couple of tables that had some peanuts on their table so we asked if we can get some.  This lady, the owner, told us that you have to order it and it's $5 with a really crappy attitude.  Really?  $5 for peanuts, so my first thought was you can shove those peanuts right up your a__!!!  So, as it turns out, this lady had opened a restaurant in San Mateo that went out of business and now I know why!  She made a smart ass comment about people were ust eating up all the peanuts at that restaurant which was one of the reasons she went out of business so if we wanted peanuts, $5!  Can you say, \"Beeeeyaatch!\"\n\nHow can a business owner be so loud and obnoxious????  Throughout the entire dinner, she was just rude to other patrons who had a complaint on their dishes, talking crap loudly.  Now, I grew up in a restaurant environment and just apalled on how this lady can treat her customers.  Damn shame!  She was rude, unprofessional as hell, scowling throughout the night, abrupt and didn't even have the common courtesy to say Thank you and just plopped the check on our table.\n\nIn fact, one of the dishes we ordered didn't come out and since we were almost done with the dinner, we asked the waiter to make sure that we cancel it.  The waiter told her and she responded in a loud tone, \"Oh well, whatever, just give them the check!\"   Wouldn't the professional response be, \"Oh, I'm so sorry, but definitely, I will take it off your check.\"  NOTHING BUT RUDENESS!  \n\nI would never ever, ever, ever come to this place again!  In fact, I hope they shut this place down like the San Mateo restaurant.  Although, the waiter was nice which is the only reason why I left a tip.  It was his fault!  In fact, as we got ready to leave, he apologized for his boss' behavior.  I don't see how these folks can stand working for her....  but then again, I guess they got bills too!", "author": "Bonnie J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-12", "description": "Maybe the food is ok, but the service is terrible!  The captain of the waiter is harassing my parents!  I will never eat there again!  Including all my extended family and my friends!", "author": "Irene W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-14", "description": "I made the reservation for a party of six to have dinner with our family at this restaurant on Mother's Day.  After we sat down, we wanted the menu to order our favorite dishes.  However, the waiter informed us the regular menu was not available on Mother's Day.  Instead, we could only select from one of their dinner packages, which was based on the number of people in a party.  For six people, they offered two selections: one package for $178 & the other one for $189.\n\nI wish the restaurant would inform me of this limited selection when I phoned in to make the reservation a couple day before Mother's Day.  That way we could have a chance to decide whether to still go & order one of the two packages or go somewhere else.  Instead they told us when we sat down and ready  to order!\n\nWe had no choices besides the two predetermined packages at $178 & $189.  The final bill came close to $300 for six people.  The worst part about this was that my family didn't even enjoy most of the dishes from the dinner package preselected by the restaurant!\n\nI understand the purpose of business is to try & make a good profit.  However what they did was deceptive, gouging the customers.  I will never go back to this restaurant again!", "author": "Mary K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "I've been here quite a few times and I have to say, I've never had a bad experience with the food. The wait's never really too long, but the seating could be a bit more comfortable compared to other dim sum places. There's not much to say if you're a yum cha regular because everything's good, but not super good and not super bad. It's pretty decent. Especially for the price. I prefer yum cha over dinner here only because they're busier during the day, and at night they tend to stand near your tables and pay special attention to you. Some people like that, but I prefer some privacy. All in all, it's a good restaurant. Will keep coming here with the fam for sure.", "author": "Cindy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-24", "description": "This street corner restaurant has a surprisingly great selection of dim sum dishes.  The sweet soy sauce served with their rice noodle roll dishes is simply delicious.  Prices are average ~$50 for 3 people and service seemed decent.  The food here almost makes me miss living in San Francisco.\n\nMy Dim Sum Rating System:\nBBQ Turnover=5\nBean Curd Skin Rolls=4\nDeep Fried Taro Dumpling=4\nRice noodle roll w/ beef=5\nRice noodle roll w/ shrimp=5\nShu Mai=4\nSweet Soft Tofu=4", "author": "B F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-14", "description": "For $40 two people stuffed themselves on the City's freshest, most reliable dim sum. Oh, there were leftovers. Other places seem stale and uninspired in comparison to this Sunset gem.  Best to avoid weekend crowds. Best bets: pork, Chinese broccoli, stuffed eggplant, fried lobster dumplings, green onion pancakes. One negative: bitter jazmine tea. Order poneh\nThere is a reason why this out of the way place appears on many \"Best of SF\" lists.", "author": "Fred  D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-03", "description": "This place is the spot to eat chinese food in the Sunset.  I am not Cantonese, and not a big fan of Cantonese food, but the quality of the food is superior here and the prices are reasonable.  I am willing to pay more for better quality food.  This place is always packed - both for dim sum and dinner.  We normally eat dinners here and I try to call in advance to make a reservation.  Tried and true favorites are the soup of the day, steamed whole fish, walnut prawns and their fu jian tofu.  We also enjoy the pork and kabocha pumpkin stew.  We never leave hungry.  They normally throw in a complimentary dessert as well (usually red bean soup which we always enjoy).", "author": "lucy w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-01", "description": "All the items in the menu were first listed in Chinese and underneath listed in English.\nAt first I thought that was real nice,being a English person. I ordered pot stickers to\nstarted which in english said 6 pieces for $6.75. When they came there was only 4.\nI pointed this out to the waiter who brought a menu and pointed to the Chinese wording and said it says 4 pieces. I pointed the english printed under the Chinese\nwording that said in English 6 pieces. He kept saying 4 pieces and I kept saying 6 pieces. So he YELLS across the dining room to the owner and turns to me and\nsays ok. Food was not bad, but the restaurant is dirty. The carpet is at least 25 years old and VERY DIRTY. The mens room smelled of rotten food and the cabinets were\nvery dirty and the room could use a serious cleaning. There is large pictures of her\nall over the restaurant with different public people. Sucking butt big time.. But to \nthe 4 tables around me who complained about over charging when paying the bills, she was condescending,rude and abrubt. After this experience I understand why\nin this block on both sides of the street every restaurant was full of clients and this\none was nearly empty.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-27", "description": "Food is decent, but the place makes me feel dirty. Plus, at least put some table cloth over the table. Had Dim Sum on a Sunday afternoon, the freakin table had Disney princess print on it. Did I sign up for \"Dim Sum with the princesses\" @ Disneyland? Very bad place, will return only if it's my last resort.", "author": "Aaron K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "It's been several years since I've been here for dim sum, but I remember it being pretty good.  I especially liked the cha siu bao (bbq pork buns).\n\nI most recently went to HK Restaurant for dinner with about 20 relatives, and the food we ordered was decent, but nothing spectacular.  The Peking Duck was good and I liked the deep fried fish fillet dish.  A little odd that we had to ask for ginger dipping sauce for our chicken, and that we didn't get extra hoisin sauce for the lettuce wrap dish.  We also ordered yi mien and ended up getting a plate full of lo mien.  \n\nAll in all, HK Restaurant is OK for dinner, but there is room for improvement.", "author": "Rogelio H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-24", "description": "WOW! Had a great, delicious bday dinner for my grandma (happy 84th! :D) here last night with the fam - just awesome!! It was our first time here for dinner and after last night, I think we would definitely do it again! \n\nWe had the:\n\n*house soup (watercress, carrots, pork? sweet and homey)\n*cold half chicken (with a ginger/garlic/green onion relish - I didn't try it but it was a hit)\n*honey walnut prawns (perfectly cooked shrimp - not too mayonnaise-y, crunchy walnuts)\n*spicy string beans with pork (the ground pork was so savory! and I don't even like pork!)\n*ma pao tofu (deeeeelish! they do it RIGHT here!)\n*gravy chow fun with beef, mushrooms and bean sprouts (i LOVE gravy noodles! even better than fried!)\n*steamed fish (the soy sauce/broth in the dish was so delicate and delicious - complimented the fish so well)\n(all with some good ol' white rice!)\n\nand..\n\n*taro/tapioca/coconut soup dessert! a GREAT ending to an awesome meal! really warmed up my soul.. terrific!\n\nPrice-wise, it'll be about $22 per person for this meal for 6 people. Not bad in terms of dinner but on the high side for a Chinese meal because right around the corner or up the block you could get a set dinner for about $60 for the same amount of people. But you wouldn't necessarily get the flavor, the service, the decor (they had the most beautiful salmon colored napkins! not the usually pepto-pink), the quality in the care that they take with their food. \n\nCan't wait to come back again for another amazing meal!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "Pretty good variety of dim sum. Enjoyed the porridges, buns, niu rou qiu, xia jiao, etc (basically the generic menu) It is a lil bit pricer than other dim sums but food was pretty good and well worth it. The place/utensils could be a bit cleaner though....found some lovely food particles waiting for me on my \"clean spoon\" and bowl. Easy parking though.\n\nBottom line: Was aiite, prolly wouldn't bragg about it but if you're around the neighborhood and got some bucks to spare, definitely worth checking the place out.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-27", "description": "LOVE IT! The place looks quite small, old, and usually crowded, but looks can be deceiving! The food here is DELICIOUS! One of the best places in SF for Chinese food.\n\nI loved Shrimp Rice Noodle Rolls. For me, to determine whether a restaurant serves good quality food or not, the rice noodle rolls are the indicators. This place TOPS it! Never have I tried such soft, smooth, and tasty rice noodle rolls than this! Not even back in Hong Kong! Another indicator of a good Chinese place is... seeing Chinese bringing their non-Chinese friends here!! \n\nHad dinner at this place for a couple of times too. The food is outstandingly good. All authentic Chinese food!\n\nThe food is worth the price. It isn't really that expensive at all. However it cost more during dinner time. Our family loves coming here for YUM CHA every weekends. However, I suggest that you come earlier. Like any other Chinese restaurant, you will have to expect line ups for table.", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Good dim sum there...and they have a take out counter as well.  Their Sanpan Jook (congee/rice porridge) is really good and packed with seafood...one of the best that I have had...that is if you like that dish. Like most of the dim sum places these days, you place your order from a sheet and they bring it to you.  I miss the days when all the dim sum places hand carried or carted out the dishes for you to look  at to say yay or nay. It allowed you to be more adventurous, and is helpful if you don't know the name of the dish. There are still some places like this but not enough for my liking.", "author": "Stanley H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "In my opinion, this is possibly the best HK seafood restaurant (especially the dimsum) in Sunset.\nMy method of rating dim sum is based on one dish. If it's good then I would have high remarks for the place. If not, then vice versa.\nOk, so my system may have a 99.9% chance of error, but from my experience with dim sum, if the beef tripe is good..usually the rest of the stuff are good.\nHK Seafood restaurant makes good beef tripe. I repeat. HK Seafood restaurant makes GOOD beef tripe!\n\nMoving on,\n\nIt can get busy during popular times (the case with many quality dim sum restaurants), but that's normal. \nThe couple times I've been here, the parking situation is decent and you can usually avoid paying meter by parking along the residential streets.\n\nOverall, *Thumbs up*", "author": "Jason N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "Been there twice this month. The food is that good! This review is for dinner only cause it's a long drive for me South Bayer to have dim sum an hour away.\n\nWe had:\n\n1) Soy sauce chicken -- tender and juicy, good flavor and just the right amount of saltiness.\n2) Walnut shrimp -- had it twice and soooo good! Walnuts are fresh and crunchy, not greasy at all. Shrimps are yummy as well.\n3) Steam tofu with meat sauce and reserved veggie -- good flavor, tofu could be smoother/silkier.\n4) Soup of the day -- Good, homey.\n5) Crab and fish soup -- Tasty, good amount of both.\n6) Rice -- I ate two bowls each meal! I usually eat 1/2 bowl at home. \n\nWill visit again! Service was good too. Decor a little old but good food make up for it.", "author": "Betty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "Picked up an order of Portuguese style egg custard tarts yesterday.  Been quite a long time since I've eaten these.  They were some of the best.  Tart shell is the many layered type and the filling was velvety, not rubbery like some others where they've used gelatin.  These were just eggy goodness!  Haven't been in for actual sit-down dim sum in a couple of years so can't address that.  Back then we enjoyed it for what it was.", "author": "Karen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-14", "description": "Service is absolutely horrible. Waiter was super rude and condescending. Made a mocking comment towards our big party. I will never come back here again with my family and I really won't be surprised if they close their business. I wish them down the hole. I dont like them at all", "author": "P T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-12", "description": "It was average at best and it's really nothing to rave about.  It's just your average dim sum house in the sunset district.   They have a \"to go\" place right next door for those of you who don't want to wait in line.  I came here because I had my hair cut today and this place was close by.  Plus I didn't want to go back to the North Beach district because of the Columbus Day or Indigenous People day parade and the blue angels.  Thank God this weekend is over with.  Couldn't even get into my garage because of the traffic.\n\nBack to the food.  The decor of the place has been updated and the staff are pretty decent.  They came back to get rid of the empty plates and baskets but they never refilled our water.  I think they just wanted us out of here as soon as possible.  Can't blame them though..........they are just trying to turn tables on a busy Sunday.  Really can expect much of this place.  It aint Koi Palace and it aint as pretentious as Tong Kiang.  I don't think I can eat dim sum in the city anymore.  Too many average dim sum houses in the city.\n\nbeef roll\nhar gow\nsiu mai\ntripe\nsticky rice\nsalt and pepper chicken wings\nchicken feet with black bean sauce\nshanghai dumplings\nshark fin dumpling soup\nChinese broccoli with oyster sauce\nduck tongue\nvegetarian goose(this was actually good)\n\nEverything was just OK", "author": "jason g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-18", "description": "Dinner in San Francisco may be thoroughly domesticated, but a good brunch, more often than not, is still a beast that must be hunted.  With reservations a rarity, it requires patience and planning, and those who rely on serendipity may wind up going hungry for a long time.  Of course, once you're familiar with a few good hunting grounds (and parking spots), it's not too hard to land that perfect omelet or pancake.  \n\nBut of all the brunches, none is quite as elusive, or deadly, as Dim Sum; and the dumpling hunter can all too quickly become the prey.  After all, how many people's Sundays have been laid to waste by the lines at Koi Palace?  How many would-be feasts abandoned in despairing fatigue and exchanged in famished desperation for a Starbucks muffin or (God forbid) a McGriddle?  And even those that do score a table must ask: at what cost?  For the receipt oft tallies a dim sum indeed (sorry, I just had to).\n\nThus, S&T Hong Kong Seafood is nothing short of a miraculous find, so much so that I really do hesitate to share it (but I'm a total review count whore, so what can I do?).  Conveniently located (for me, anyway) at 33rd & Noriega, our party of 5 showed up at 11 AM on Sunday and only had to wait 15 minutes.  Luckily one of us spoke Chinese and handled the ordering; we wound up with 16 delectable plates that we were just barely able to finish.  All in all, a perfect Dim Sum feast.  And here's the best part: the final bill was (drum roll, please) $56.  For 5 people.  Who couldn't possibly eat another bite.\n\nPerhaps the Dim Sum wolf can be man's best friend after all.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "definitely a small/local place. i really dont mind that there's no carts being pushed around b/c it makes ordering food that much more efficient. however, for those that dont know the food by name, may be difficult to order. we ordered a shit ton of food ranging from the usuals to the uniques.\n\nshrimp dumplings\npork dumplings\nbeef, shrimp and char siu rolled noodles\nsticky rice in lotus leave\nchar siu steamed buns\ntaiwanese pork buns\ngreen onion pancake\nchicken feet\nshrimp and chives dumplings\nradish cakes\ntaro cakes\nsesame seed balls\nfried minced meat balls\n\ni dont know if i was just hungry or if everything really tasted that good but it was delish. minus the rolling carts, everything is to be expected at a traditionally good dimsum place.", "author": "Selena H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "I've been here countless times over the past year, and each time I leave feeling very satisfied. \n\nThe dim sum is great, and I've never had a 'bad' dish. Because prices are so reasonable, I've been trying alot of different stuff each time I go, and nothing has disappointed. Just can't really remember what they're called. \n\nDinnertime is good too. I really like the salt and pepper crab, the garlic fried pea sprouts, fried soy sauce noodles, chinese boiled soup, duck, chicken, fish... oh well, basically everything. \n\nThis restuarant just sits right with me.", "author": "Chloe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "Definitely one of those places where you have to come early if you want to eat lunch or dinner on the weekends. \n\nLuckily, I've usually been here for lunch and hardly wait for a table. Our waiter often greets us in Tagalog, which I find funny and kinda sweet at the same time. My mom and her friends have been dining here for years and they don't forget about their loyal customers. \n\nI actually like ordering the fried rice with salted fish from here because it's not too salty. You know what I mean? Subtle enough to actually taste the other components of the dish. Dim Sum is, obviously, quite tasty here. So you can't go wrong with what you order.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "This is a great place to go with large group (as I did for dinner).  Tables for 10 with lazy Susan's. Owners are very friendly. The food is very good as well.  Had many dishes.  The memorable ones were the pepper beaf, eggplant hot pot, and salted pork.  Red bean soup was very good as well.  All at a reasonable price.  I will definitely be back", "author": "p w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-26", "description": "My family ate here on Christmas Day and had awful service. You should AVOID eating here although the food tasted decent and I liked the fish. Here's what went wrong:\n \n1. We preordered a 10-person dinner. When the first people in our party arrived, they were seated in the back room. About 10 minutes later the owner lady came to the table to find out who we were because apparently we weren't supposed to be sitting there. Without any explanation, she told us this was not our table --like it was our fault that we sat there-- then moved us to a table in the main dining room.\n\n2. When our party was complete a few minutes later, we told the waiter we were ready to eat. We had 9 people although we had preordered a 10 person dinner. 20 minutes passes and no food. My mother went to the lady owner to ask why after 20 minutes we aren't getting any food, and the owner lady had the nerve to tell her that we just arrived there when it was her that 25 minutes ago made us all get up and change tables so obviously we didn't all just arrive there. It's amazing that the lady owner can be so rude to her customers.\n\n3. A waiter came to our table, no apology, just removed the extra setting and said he thought we were waiting for someone (just an excuse because we already told the waiter 20 minutes ago we were ready to eat).\n\n4. At that moment another waiter brought an appetizer plate to a table next to us, and those people started eating it -- even though they were already 2 courses into their dinner. We told the waiter it looks like our appetizer is at the next table. The waiter then took that plate off their table and brought it back into the kitchen. A short time later we received our appetizer plate, and hoped it was not the one they had just brought back.\n\n5. When the waiter brought another table next to us their dessert, the people said that they had not yet been served all their courses. The waiters huddled together, I guess to decide whether a dish was missing or not. The conclusion was that they were missing a dish and later the waiters brought them a chicken in a take out box. Then we started tracking the dishes for our dinner.\n \n6. At the 2nd to the last course my mother mentioned to the waiter that we still have a dish besides the fried rice, which is typically the last course before dessert; the waiter said he would look into it. When they brought the fried rice, my mother again told the waiter that we were still missing a course (wow, is that a coincidence?!)  The lady owner then came to our table to see what food we were having and told us that the kitchen claims they cooked the dish. She also said nobody admitted to eating our dish. The lady owner thought maybe we already ate the dish. We told her to look at our table of food that we didn't get that dish. We wanted the dish but lady owner didn't want to give it to us, and said she will refund some money for that dish. We had been there almost 2 hours already, and there was an empty table next to us so they didn't need our table. You would think lady owner would want to serve us the dish and make money on the dish we preordered but she refused.\n \n7. For our trouble, they brought us a complimentary dessert of some mango sticky ball, which was nice until they tried to add it to the bill later.\n\n8. When the bill came they tried to charge us tax and tip on the dish that we never received. They only deducted the amount of the missing dish after tax and tip was included in the original total. While speaking with lady owner that we shouldn't be charged tax and tip on a dish that we never received, she said that she would fix it but she decided to add the \"complimentary\" dessert to the bill so that we can pay tax on it, stating that we need to pay tax to Obama. The amount that she added to the bill for the \"complimentary\" dessert was almost as much as as the cost of the missing dish. Isn't that rude to try to add things to the bill to make us pay tax on something we never ordered? Owner lady rudely states she's spending a lot of time redoing the bill to make me happy.\n \n9. After asking a waiter's opinion of whether she should charge tax and tip on the complimentary dessert and missing dish (don't ask me why she is asking a waiter), owner lady redoes the bill back to the original then manually deducted the missing dish and the tip on the missing dish. She was still not deducting the tax on the dish we never received. I got tired of trying to get her to deduct the tax. \n\n10.We decided we're never coming back to this restaurant!", "author": "B L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-24", "description": "I feel that many of the negative reviews of this restaurant are unfair.  I am not Asian but I love Chinese cuisine and know it well, and this restaurant does a great job.  Yes, the woman in charge is quirky and moves you right along, especially when they are busy.  Yes, there are few Caucasian customers but the service seems the same--prompt and efficient--for every customer.  Yes, their prices are higher than Asian restaurant average in the Outer Sunset but they give you outstanding quality and very large portions.\n\nI notice that many of the complaints concern their Dim Sum.  This is not a Dim Sum place and so why go there for that when there are restaurants dedicated to Dim Sum all over SF.  At this restaurant, I always order from the Chef's Special list (BTW they should put their menu through an English language spell-checker).  The Frog's Legs dishes are outstanding, particularly the one in hot ginger.  Also their vegetable dishes are excellent; try the green beans one.  For an appetizer, the Mu Shu pork is tops--huge portion.  I like spicy food and always ask them for some hot sauce.  Instead of plunking a plastic bottle of Thai hot sauce on the table like many Chinese restaurants do, S&T Hong Kong Seafood gives you a bowl of their own freshly prepared hot sauce.   And it's really good.  It's touches like that that makes this place special.", "author": "Murray S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-07", "description": "I know I shouldn't write a review about this place because now all you will go there and I won't be able to find a seat. When it comes to Dim Sum, we all know we want Koi Palace and House of Banquets, but is it worth the wait. I hate waiting especially after a long night of drinking and an empty stomach, where would you go for food? \n\nThe only solution would be a nice bowl of noodles or Dim Sum. I learned about this place through a friend and now I'm a fan. I've been here three times last month and it's fantastic. Fresh Dim Sum at low prices. Sure, the location is a bit far but parking is easy to find and if you have a small party, the wait is not bad. The service is decent just like all the other Dim Sum places, but you find that anywhere.\n\nAlways order the shrimp and pork dumplings, the tripe isn't bad either. If you like chicken feet, knock yourself out, I rather bite something else than that. Eww...how can you eat that? That is gross!", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "Awesome Dim Sum, every dish was perfect, tea was filled quickly. It was a little odd that the owner put pictures of herself up everywhere but whatever, it's her restaurant. I would definitely make another trip here.", "author": "Don W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-10", "description": "After waiting for TWO HOURS at the doctor's office with my grandmother (see previous review), we were starved, so we walked over here for lunch. I'd been here several times before and it was typical dim sum. The manager, or whoever the hell that snooty man in the suit is, seated us quickly. Fast forward to an hour later, when he walks by and ignores us when we are clearly trying to get his attention. RUDE. I don't care how good the food is; if customer service sucks, nothing can make up for it. Don't get me started on how they screwed up our orders. AND THEY WEREN'T EVEN BUSY. It was a Wednesday morning. Imagine how it is on the weekends!! We ordered some kind of Malaysian noodles for my uncle and specifically told them we wanted it to-go, but they served it to us. Understand that my aunt actually told them in Cantonese so it's not like it was me giving them instructions in my broken Canto. \n\nThe manager (owner?) was so pretentious, you'd think they were serving gold-covered shrimp dumplings here. Not even close. It was average--not all that and a bag of chips. Anyway, his pictures are hung everywhere in the restaurant, so he must be someone important. Guess he forgot about the little people on his way up.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-18", "description": "I just ate there for dinner today, and they were packed!  However, we were lucky to have reservations.  I will not rant on about what they do/ do not have to offer, as the list will go on and on.\n\nIn the restaurant, there are two sides.  The side on the left, where you enter. . . and the side to the right, where there is another room.  Normally, I am seated to the right, where two waiters serve you.  (If you've read my previous review, this refers to the two waiters.)  However, I was seated on the left side, where there were another two waiters, and a waitress.  Service, I must say, was great.  They were much friendlier, and did not constantly pester us to order the \"larger\" plates.  Also, they changed our plates three times.  I am unsure to why service immensely improved - because of the different waiters/waitresses, or because that we were a party of thirteen?\n\nNow, onto the food.  Their dim sum is a favorite, secondary to the expensive and packed Koi Palace.  Their siao long baos almost match those of Koi Palace, and this place's shrimps puffs are definitely the best.  Just don't order pot stickers here, they aren't that tasty, and lack that delicious crisp.\n\nDinner time!  Some waiters, as mentioned above, tend to insist that you order a larger portion.  Bigger = more expensive, like the customer doesn't know that.  When you reject his suggestion, his friendliness lessens.  Still, their food is yummy.  Again, I love shrimp puffs - I order them every time.  Their crab and lobster are delicious, and almost all dishes are satisfactory.  This is one of the family's first choices for family dinners.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-11", "description": "THE SERVICE HERE IS HORRIBLE!\n\nWe waited over 2 hrs for a table, and when we finally got our table, it took a long time for our food to get served. After finally getting our food, and finished eat, we asked for our bill. On the bill, they wrote down and CIRCLED the time we spent at the table. They noted that we spent over an hour at the table and required us to pay a 20% tip because we spent a long time eating.  Of the many dim sum restaurants that I have been to, I have NEVER been charged a mandatory 20% tip fee for \"taking too long to eat\", and half the time was spent waiting for our food. Not only that, but they swiped my credit card and did not ask me for my signature. I had to ask them for a copy of my receipt and that was when I realized they automatically charged 20% tip WITHOUT my signature. I told them there was no sign or anything written down that requires a mandatory 20% tip, and they told me never to come back. \n\nI DO NOT RECOMMEND S&T HONG KONG RESTAURANT TO ANYONE!", "author": "Angela W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "This review is only for the lunch time dim sum.  I've never tried their sit down menu for dinner.  It's one of the few dim sum restaurants in the Sunset. Decent food at decent prices.  The wait can be quite long on weekends, so get there early.  It's my go-to dim sum restaurant when I don't feel like venturing out too far.  Lazy weekend stop.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-15", "description": "My review is actually for 3 1/2 stars and it is mainly for the food itself (dim sum). \n\nSo, this is the new favorite place for the in-laws. After hearing about the delicious shrimp stuffed tofu, we had to give it a try. We went at about 11:30, which was prime time for dim sum diners. Even though the hostess told us 15 minutes, we waited for at least 40 minutes.  Anyhow, not much room to wait inside, so be prepared to wait on the sidewalk. I wouldn't mind, but you can't hear the numbers being called outside, so you have to send a scout inside to brave the crowd. \n\nWhen we finally got seated, I have to say it was worth it. You order via menu (no carts here). Which, has its pros and cons. Pros: the food comes out HOT! And, you fill up on what you like, instead of eating squid and jelly fish cause that is the only cart that comes by. Cons: not all the dim sum items are in english. Some are only written in Chinese. So, you might miss some tasty items if you can't read Chinese. \n\nOverall, the dim sum was great! Service, eh. A return trip definitely.", "author": "Mashi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "Love love LOVE their dim sum. I also enjoy having the option of take out instead of eating in the restaurant. The quality of the food is just as wonderful compared to eating in. I get amazing service as well! Best place in the sunset!", "author": "Jenn G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-25", "description": "Upping to four stars based on the quality of food at dinner. Recommended: salt and pepper crab, black pepper beef on a sizzling platter, Peking spareribs, vermicelli and satay beef in a clay pot, and the roast duck.  The latter comes out with crisp skin on a bed of  soybeans.  The West Lake beef soup is quite tasty as well.\n\nThey fixed their dim sum menu and now everything is listed in English and Chinese.\n\nThis place is relatively expensive at dinner. Non-seafood main dishes are in the $10-15 range.  S&T Hong Kong is probably the best Cantonese restaurant in the Sunset/Parkside area.  It was packed at dinner on a recent Tuesday night. That's quite a feat in this day and age.", "author": "Eating Sleeping T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-24", "description": "Good option for Dim Sum in the City. Prices were a little higher than what I'm used to seeing since I normally Dim Sum in the East Bay, BUT, the dumplings were quite big, packed with Shrimpy, Porky goodness. My party of 4 went nuts and I believe we ended up ordering around 16 dishes, which is WAY too much, but it's just so easy when you're checking off all the things you want to try on their order form. Service was pretty good for dim sum, and the staff was friendly though pretty harried throughout the restaurant. Even with all that we ordered, the total bill came out to about $15/pp, which is still quite reasonable.", "author": "Phuoc K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-08", "description": "Solid three star restaurant.  \n\nService: It was brisk, but not rude or whatever everyone else below has said.  They forgot one dessert, but it was fine as we were all totally stuffed by then. \n \nPrice: Went with a group of 6, and we ate and ate and ate and ate for $25 a head... \n\nFood: Great XO noodles and noodle rolls, the shitake shu mai didnt seem too different from regular shu mai, the prok buns were right there, the potstickers were huge, not to be confused with the fried pork dumplings which were deep fried balls of dough with porky stuff inside... I had a lobster roll too which was good, but deep fried.  I prefer steamed to fried as it is less filling and I can try more stuff!! The desserts were good- there's a deep fried bread/dough strip that I guess usually comes with sweet milk, but was served plain- could have definitely used some powdered sugar at least.  \n\nProcess: I liked the fact that we ordered from a list, as my friend put it, you're not waiting to see if your favorite thing comes out- takes the apprehension out of it, you just wait and eat and dig the goodness.  \n\nLocation: I live in Oakland so this was kindof a schlep, but I will vow to take my dog to the beach more and pick up some to go stuff from here, fun Sunday outing!  Parking wasn't awful at 11am, one circling of the block and I got a spot dead across the street.\n\nTry it, and if you are scared of the service- do take out.", "author": "Catherine R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-22", "description": "I've been here twice for dim sum. The place has been crowded both times which speaks for itself. We had to wait a bit, but it was nothing absurd. The dim sum are all pretty good and they are fairly attentive. It's definitely worth a try, but do get there early!", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-17", "description": "This is the best Dim Sum in San Francisco (and Koi Palace, because everyone compares Dim Sum to THAT place).\n\nFirst, this is good Dim Sum, not 'In and Out.' Expect to wait at least 30 minutes during peak times. Dim Sum is meant to be done over a period of longer than a hour with friends, delicacies and tea.\n\nThe ingredients taste fresher (and probably are due to volume) than other Chinese restaurants. You can taste the subtle differences when the flavors explode in your mouth. It is really hard to quantify good dim sum, but this is it. The tea doesn't come from a bag, the dim sum is cooked fresh and the service is quick. The hot sauce isn't from a jar on your table that has been sitting around for 6 months.\n\nMy favorites here are:\nPan Fried Chive Dumpling: A shrimp and chive cake that has been grilled on both sides like a panini to add in flavor.\n\nShrimp Dumpling: Yeah it just tastes better here. No lies. I mean this is the real litmus test of a restaurant. For those of you not in the dim sum know: This is what it sounds like, shrimp with a bit of oil, starch and salt steamed in dumpling form.\n\nNoodle Rolls: Probably the big stand out. Most dim sum places offer shrimp noodle rolls and beef noodle rolls but this place has a bunch. And it is of note because they really pack a bunch. I recommend the BBQ noodle roll and the chive noodle roll (vegan). Not in the dim sum know? These are rice noodle rolled around a filler and then drenched in soy sauce. The medley is very tasty with the right mix of acidity and sweetness.\n\nI'd add those on with your favorites and enjoy.\n\nAlso their signature is a soy sauce chicken (12$ half/23$ whole). Another thing I cannot explain, but if you go here for dinner be sure to order it. Again it is what it sounds like, soy sauce and chicken! But they must have some secret process to bring out the flavors.", "author": "Joe Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "For a white male just looking for some good dim sum, this place is great. They had everything I wanted, and even the stuff I didn't (cold chicken feet? ew!). Other than the crummy service and \"White devil\" stares I was receiving from the other customers and wait staff, this place is fine by me. To me, if you have good food, then I don't care if you have dog-shit service.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "I've dined here with my family's  friends; who introduced us to this restaurant.   They dined here  frequently since  we've gotten excellent customer service from the staff.\n \nI've had dinner and lunch here. Their dim sum was very good. \n\nSince they ordered the meal, i can't recall  what  they ordered. But it's been very delicious meals and a great experience here that when my family (we're from the south bay) are in the area; we make an effort to come to this restaurant. \n\nBut one unique  entree is their (ju gang yuk)  pig's neck.  It looks like char siu, but very  delicious.  This is an entree that we often order from this restaurant.  \n\nIt does get  busy on Sunday evenings.", "author": "Evelyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-17", "description": "They have a side door for dim sum to-go. I was walking by around lunch after buying a roast duck and pig ears down the street.\n\nI decided to duck in to take a quick look at their goodies. While the lady behind the counter wasn't the nicest and the food was in a glass case, when I brought it back home and heated the items on the stove, they were actually pretty damn good.\n\nI got a set of turnip cakes, chive & shrimp dumplings, and fried sticky rice savory dumplings. They were all pretty good compared to other to-go joints that I've tried along the 28/29 MUNI routes.\n\nI won't go out of my way for them, but I'll visit when I'm in the area.\n\n====\n\nRubric: 5 = Mindblowing 4 = Excellent 3 = I see the charm 2 = Disappointing 1 = Never again", "author": "Eric K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-03", "description": "The staff services were awful, rude and horrible on Chinese New Year.  I don't want to talk back especially on CNY.  I know think they care on if I return back for dim sum or not since they have enough neighborhood business but I felt I need to speak up this time. I noticed the portion is getting smaller and okay.  Well, anyway they need to provide better services and talk less.   The chop sticks, plates and cups need to be little cleaner.", "author": "Love To Eat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-16", "description": "Edit 01/23/08\n\nI'm excited to see all these new and positive reviews for this place! They're such nice people. I hope they get more and more business!!\n_______________________________________\n\nCame here for dinner. Service was excellent! Food was just absolutely yummy!! Every dish I had was made perfectly. Good cantonese restaurant. I want to try their dim sum...\n\nThe waiters are hilarious!", "author": "J T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-27", "description": "I went to S & T Hong Kong Seafood Restaurant for Dim Sum with my family this weekend.   There was not really a very long wait, but it was a very hot day and the place does not have air conditioning.  When we got our table, the first thing I noticed was there were still food stains at the edge fo the table.  The bus person must not have wipe the table before turning it over to the next guests, which was us.  The dishes and bowls also had food stains on them.  I have to rinse them off with hot tea.\n\nThe food there was just OK and the service was so so.  There were flies everywhere, but that is what you expect when you go to a Chinese dim sum restaurant.  There was only one bathroom and inside was so dirty, paper on the floor, and the floor was wet.  There were also little critters living inside the walls which I don't even want to say it, you know what I mean.\n\nI wish the owner would take better care of the place and not be cheap. It used to be a very good place in the Sunset District, but I will not be coming back to this place anymore.", "author": "Angela T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-04", "description": "Uh...when did this place get so bad?  I've been here multiple times for dim sum and I remember it being pretty decent.  However, I went on Friday with my parents and the food was horrible.  We were seated right away because of our small party but the service went downhill after that.  Our food took forever to come and the waiters were very hard to flag down.  I even heard other parties complain about the service.\n\nAs for the food, we ordered har gow, shiu mai, ja leung, chicken feet, siu long bao, shrimp roll, shark fin soup, and salt and pepper calamari.  The most disappointing dishes were the ja leung and siu long bao.  The ja leung was literally just the donut wrapped in noodle.  No dried shrimp or green onion...ugh. And the siu long bao was very dry.  There were no juices inside the dumpling at all!  The best thing was the calamari.  Is it a little weird that their calamari is better than their dim sum?!?\n\nI am never coming back here for dim sum!  There are definitely better places to go in the city!", "author": "Helen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "There aren't many sit-down dim sum restaurants in the Sunset...so I pretty much come here with my family by default. It also helps that I only live two blocks away. \n\nThe quality of the food here doesn't compare to Koi Palace...but it's above average and it gets the job done. There are also a few items you can get that's under $2...like this deep-fried tofu we always get. \n\nThere are a number of items that are written only in Chinese...so it could be hard to mark off what you want if you can't read it. Good thing my dad is always there with me. \n\nDefinitely try to avoid the typical lunch hours on weekends/holidays...you'll be waiting for quite a while if you don't come early. Parking also sucks...so just park at my house and walk over! \n\nThe service here kind of sucks. Unless you know them, they can be pretty rude. Some of the ladies who bring out your food are nice though...so be nice and show some gratitude. I think I saw one waiter work with his Ipod on...I really hope I was seeing things.", "author": "Allan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-17", "description": "Usually, the service at Asian joints are mostly insanely fast coz they wanna get you in and out quick to get more turn around. This place is NOT the case.\n\n-Slow service (some people need chili dammit! now!)\n\n-Food was alright. Not great. Came out very slowly unlike most dim sum joints.\n\n-Half the menu was in mandarin, not translated. So we had to point like monkies to the dish from the next table.\n\n1 star to the excellent egg tart. flaky pastry...YUM\n1 star to a fairly cheap meal\n1 star to the shrimp-paste-stuffed-in-a mushroom-that-we-don't-know what-its-called-coz-it-wasn't-in-english. \n\nI'd give this place 2 and a half stars. Minus half for the slow service....they have a lot of wait staff to go around so no excuse compared to smaller restaurants.", "author": "Marcia O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-04", "description": "Yum dim sum. You can't really go wrong with dim sum. We didn't really know how popular this place was until we got there. There was a line, but as with almost all Chinese restaurants, they go by quickly. We waited probably only 15 min or so, but we also did luck out with a party of 2 who didn't show (and what do you know, we're also a party of 2). \n\nFood was good, dim sum, again, is yummy. The only thing that bothered me was the ridiculous amount of flies next to the window where our table was. The flies didn't bother by flying around, but they were just there, on the window, staring at us (or not). The prices are a little steeper (a small is 2.20, medium is 2.80, large is 3.80) but that's because I'm accustomed to the cheap so-cal dim sum of 1.80 for all sizes. \n\nCan't rate the normal food (I'm guessing seafood is the specialty?) but check out the dim sum for lunch.", "author": "Yosie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-31", "description": "We just tried this restaurant for the first time and I think it is the  BEST dimsum place in SF.\n\nIt is SLIGHTLY higher priced than other places but totally worth--everything from the dishes (which includes some unusual Malaysian dimsum/dishes) to the tea (even the hot mustard and chili sauces) was outstanding. AND friendly waiters/waitresses a bonus!\n\nLet me describe to you the sublime taro cake and malaysian steamed cake:\n\ntaro cake: many julienned slivers of REAL taro pressed together in perfect thickness (about 1/2 inch) and fried to crisp brownness on both sides; tender and tasty inside.  Like a thick delicious taro hash brown!\n\nmalaysian steamed cake:  yellow, soft, pillowy, not too sweet, slightly lemony filling.  Rolled up like a jellyroll.  3 in a bamboo steamer.  Beautiful to look at and delicous to eat.\n\nFriday afternoon at 1:30 pm was perfect--no waiting, waiters/waitresses were all chill and friendly and attentive, parking was super duper easy, etc.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "Food-wise, I am impressed! Decor and restaurant itself need work, but we're here for the food. I've gone here many times with my parents when I used to live in the Sunset. I'd pick HKSR over Koi Palace any day. Food here is less expensive and good size portions. My dad took me out today and we had the following: egg custard (Portugese style....much better than regular ones), eggplant stuffed w/shrimp, pan fried taro, preserved egg/pork porridge, shrimp dumpling, and bitter melon wrapped in rice noodle. All was good and I'm sure the rest of the usual dim sum items are good, at least they looked good when they passed by our table.", "author": "Marcus Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "Authentic Cantonese food and decent service. Decor remodel is about a decade overdue; its falling apart. That said, the wait staff was friendly and attentive. Food came out piecemeal, but it was delicious.  And, they take reservations.", "author": "Ike K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-15", "description": "I would only recommend this place if only to remind you why you appreciate the good dim sum places. Why? Let's begin my sordid tale of mediocre Chinese dim sum. \n\nThe gf and I had some errands to run, and it just so happened that we were in the neighborhood. Instead of the typical run to Mongkok Dim Sum, we came here, figuring that we could sit down and actually eat something, instead of on the go for a change. \n\nWe ordered, har gow, some Chinese garlic spare ribs, shanghai dumplings, donut noodle roll, shrimp noodle roll, egg rolls, deep fried shrimp balls, and chicken feet. Everything was ok, not special. But when I tried the spare ribs, I started to tank. I felt queasy in the stomach, and need to take in some air. The plates weren't really cleaned, and the cups that I drank my tea in had a greasy film to it. Even though it's listed as a 98 in cleaniness, I think the REAL score is more like a 78. There's no way this place gets a 98 in scoring, unless they're kicking back some cash to the inspector. The tables are dirty, dishes are greasy, and the people who bring you food to your table, NEVER wipe or clean the utensils which they use to cut up your food. \n\nService was way below average. There wasn't many people, but apparently it took them over 20 minutes for us to get our check, and they forgot to bring us our deep fried shrimp balls. I wish I had avoided this place, but I can't help but feel that we got screwed over in service, and in the quality of food. The prices are definitely not good, as in I can get better service and quality of food elsewhere in the city, and be content. \n\nIn the end, this place isn't worth it, and I really don't see how people still rave about this place, when it's obvious it's not.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-20", "description": "Jackpot!\n\nOne of the best dim sum places in San Francisco that I've found so far!\n\nWe cautiously tried this place after seeing the reviews on Yelp - and we were pleased!  (What luck - my Japanese friend is forever hooked on dim sum now!)\n\nConveniently located on the 71 line, and plus there's lots to walk around in the area if you're waiting for a table on a busy Sunday morning (always a good sign though!)\n\nThanks Yelp!", "author": "Haywood H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "This review is for dinner only. Pricey, but the food was alright. We had the banquet/family style menu for dinner for 2 big tables. There were different prices to choose from. The $298 per table one was yummy -- had lobster, scallops, abalone, shark fin soup, cold platter, fresh fish, etc. The soy sauce chicken is REALLY good!!!\n\nIt was a week night, so the restaurant wasn't too busy and the service was very very good. The waiters and the manager lady were very welcoming and service was quick. They cut and served the birthday cake we brought, and boxed up our leftovers.\n\nBirthday person gets a gift certificate ($15) to spend at the restaurant again, so we'll have to come back.", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "Dim sum this past weekend. had to wait forever for a table. good thing i had a slight snacky before going. \n\nwe ordered way too much food. i really liked their sticky rice since it had weird sausage and egg yolk in it. everything came out steaming hot, and I burnt my tongue quite a lot since i don't have patience (we know that already)", "author": "Yummy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-19", "description": "I haven't been here in a few months but I came here for dinner the other night and had one of the worst dining experiences ever.\n\nWhen I first went in with my family, the hostess led us to a table cramped into a corner. My mom shifted the table slightly in order to make a little more room to get into the seats but the waiter rudely burst out at us that the table was immovable and to not mess with it. First strike.\n\nWhen we finally settled down, I noticed that the worn-out paper wrapped around the chopsticks had sauce stains on it and were taped up. I find this to be very unsanitary to be re-using these wrappings. They might as well not use the wrappings at all for it is a hazard rather than a decor. Second strike.\n\nThe worst of all, however, was the service. The waiter was extremely rude. This was the same waiter who shouted at us for moving the table. He sounded extremely annoyed by our patronage. He repeated all our orders in a loud, abrasive tone of voice like we didn't know what we just ordered. (In Chinese: \"Four ice waters please.\" \"FOUR ICE WATERS.\"; \"I'd like a steamed egg with scallops...\" \"STEAMED EGG WITH SCALLOPS.\")\n\nThe food wasn't very horrible, but not fantastic either. (We ordered the daily soup that day which was papaya with chicken feet soup...it tasted DISGUSTING...it had the aroma of a public toilet and a very strange taste, like that of old milk. Third strike.) Even if the food HAD tasted good, the overwhelmingly impolite waiter would've ruined the whole dining experience anyway. Try not to come here if you can help it.", "author": "Cheri S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-17", "description": "This morning was the second time my husband and I came to this place to have food.  Honestly, the food is about average. The service was horrible the first time and I even wrote a complaint on the receipt.  Since we live in this area and we wanted to give this place a try one more time, however, we are still disappointed.  The worst part is that the waitress even complained in cantonese in front of us and other customers that I only paid them 15% tip. For sure not coming back again.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-13", "description": "Came here last night for dinner. My dad was trying to impress me by saying even Leland Yee has eaten here. I don't care how famous the person is, as long as the food is good. \n\nWe ordered ma po tofu, a pepper onion and red pepper beef dish, plain chicken, yow choy with mushrooms, and the egg white scallop fried rice. \n\nThe chicken I cannot comment on because I didn't have any. I had the rest of the dishes and they were ok. The tofu dish wasn't that spicy because it's suppose to be. The fried rice had chiese broccoli steam cut up. It wasn't fully cooked, but the the rice dish was ok. Everything was good, but when I go home I was thirsty. Someone mention they put MSG in it. \n\nI really had to drink a bottle of water a home to cure my thirst. I don't know if I would come back just to eat the tofu dish, but if someone said go, I'd go. Service was kind of slow. The waiter that took our order went outside for a smoke and then came back in to take our order. Not sure if you're suppose to do that and the fact he didn't wash his hands makes it kind of gross.\n\nService was ok. You have to flag down a waiter to get them to refill your tea pot.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-21", "description": "Ok Dim Sum filled with MSG.  Not such great service.  Do not order the Lobster Lomein, you will get a claw challenged one(YOU WILL GET NO CLAWS!).  They will rip you off.  If you have any allergy to MSG do not eat here since I was extremely sick from MSG from eating here.  I got a headache and very thirsty and drank 3 large glasses of water as soon as I got home.  This place sucks!", "author": "Jim J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-11", "description": "Ordered sweet and sour pork to-go for dinner last night, got home and my family and I each took one bite of it and we all immediately spit it out in disgust...the sweet and sour pork was battered in all pork FAT no meat at all, yuck!!!  What a great way to ruin dinner S&T Hong Kong Seafood Restaurant, I applaud you so that's why you get one star, yay!!!  I agree with some of the reviews that they pick and choose how they treat their customers. If you're a regular, they'll treat you like poo-poo literally because the food they serve you is sh*t!  And if you don't speak Chinese they'll take advantage of it and serve you low quality disgusting Chinese food because they think you won't know the difference between good quality Chinese food (exactly what they did to me last night).  This place is super dirty too, don't let the nice lighting, pictures with the mayor, and decorations fool you. Eat here with caution or at your own risk!!!", "author": "Mary T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-05", "description": "The food here is quite alright, for Chinese food (which I'm not a big fan of). But the service can kiss my ass!! Actually, the service can kiss all of our asses at the table. First off, we had freakin reservations and still had to wait. Good, you're busy. But our waiter was soo effin rude, arrogant and basically TELLING US what to order and not to order. NO, it was NOT a SUGGESTION. He was of course trying to get us to order the most expensive things there were, and saying shit like, \"what?? that's not good.. of course order this\". Blah blah blah. Every word that came out of his mouth was garbage and it took us forever to just flag him down each time we wanted something. Finally, of course the hostess/manager (possibly even owner by the way she addressed us) apologized a million and probably gave us something on the house. \n\nOh yeah, did I mention the food isn't bad?", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-04", "description": "Overall, the food is good.  The service is acceptable but not the best.  Ladies, do NOT wear skirt to this place.  I am the only one in the family who wore a skirt, and I got bitten by bugs in four different places.  I am not sure if they are bed bugs or fleas.  I am not impressed by this place at all.  If you like good food, go to R&G Lounge in San Francisco China town.", "author": "Summer R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-07", "description": "Wow!  I see a lot of reviews saying the service sucks...  I could see how a lot of people would say that.  The waiters are actually kinda rude but I think they are doing it for fun.  Somehow, when I ate here the night before Lunar New Year, seems like my parents knew these rude servers and that they were just \"joking\" around.  At first, I was like, damn, they are freaking messed up but after a while, I just kinda laughed it off cause my mom was messing with them too.  \n\nAnyhow, the service is attentive but they can be rude but to me I took it as dry humor.  But the food is pretty top notch for a Chinese restaurant and the decor is pretty cool too.  Prices are a little higher than your typical neighborhood spot but the decor IS nicer and the food IS better so I guess you have to pay for it.  But don't worry, it doesn't hit Koi prices so we are still ALL GOOD.....", "author": "Mark W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "I am SO surprised that everyone rates this place poorly for service.  We received GREAT service here!  I seriously mean this wholeheartedly.  Granted, it wasn't slamming busy but, at the same time, it wasn't slow either.\n\nThey actually took the time to answer any random questions we had about the differences between certain items (can't remember the specifics) and the lady with the dishes cruising around the room pointed to the items on our list when we asked what they were (she didn't speak much English).  Our waiter asked us if we needed any sauces (we got oyster sauce for the broccoli) and we asked him repeatedly for others (hot oil, sweet/sour, soy).  He brought them promptly without attitude.  It could have been the bright sunny day that made the service \"sunny\" as well!\n\nAll of our dishes were super tasty...especially the duck chin!  It still had the tongue attached!  How cute!\n\nThis (along with Mayflower) are now my two fave dim sum spots.\n\nIn regards to service...maybe you get out of it what you put in (in terms of smiles!)?", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "Since I live in sunset, I used to go to the restaurant in the neighbourhood. Though I have tried many other restaurants, I still find the best food in here.\n\nI love the crab noodles, pork porridge, steamed BBQ pork bun, deep-fried taro, shrimp rice roll, and everytime I would finish my dim-sum lunch with a nice to-fu-fa (dessert).\n\nI am a lucky one who can always get a table within 10 mins, even on weekends.  Why? coz I go there after 1:30pm usually!  It worths to starve until the lunch hour has passed because you could have better service and more attention after peak hours.", "author": "Woodspy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-24", "description": "GET THE ROASTED QUAIL.\n\nEverything else was standard issue.  Slightly above par.  This place has been around for decades - shows for something to weather the Noreiga restaurant row storms.  They remodeled a few years ago, so the place looks clean and somewhat modern.  \n\nService stinks.  They were busy as heck Sunday night, but to shoo us away minutes after paying the bill was pretty rude.  Shes that butch short haired Asian aunt you hated to visit when you were younger.  Yeah, that one.", "author": "Isaac L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "My current favorite take-out dim sum place in SF.", "author": "Jeff X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-27", "description": "Come here for dim sum once in awhile.  Just a typical Sunset Chinese restaurant...nothing special.  The place is a bit old and not all that clean looking.  Their dim sum items is mediocre but prices are not too bad.  However, I do like their shark-fin dumpling soup...they have humongous shark-fin pieces in em!!  All other items...just typical-average...", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "Dayam, this is damn good chinese food!\n\nCame in on a Monday night and we were asked if we had reservations. Since we didn't, it was a 30 minutes wait for a table for 3.  The place was busy for a Monday. Apparently, my boss is a regular there so they went a pulled out a table from the back because the manager felt my boss was waiting too long. Unfortunately, we were given a old rickety table right next to the kitchen exit and the fish tanks of nasty looking fishes.\n\nBut from sitting next to the kitchen exit, I saw that everything that came out of there looked amazing! Not like the usual chinese restaurants where they just drop it from the wok to the plate, but everything was nicely arranged. \n\nI don't like to drink a lot of chinese soup, but this is great! Then my favorite dish of all - salt and pepper spareribs, cooked to perfection! They're known for their soy sauce chicken, delicious as well. The assorted seafood pot was bubblingly delcious.\n\nBeing an ABC, I don't hold myself to being an expert in which restaurants tastes good in terms of chinese food, but S & T is tops in the sunset district! Even with the crappy seating, they still get the full ratings!", "author": "Cavan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-05", "description": "Very decent dim sum. It gets crowded on the weekends. The pork buns are great, as is anything with shrimp.", "author": "Mosey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-26", "description": "I've walked by Hong Kong Seafood Restaurant countless times as I traveled by foot from my home to the grocery store. HK Seafood always appeared as some form of epicurian challenge I had to conquer for some reason. Since being transferred to The City, my goal has always been to try every restaurant in town. HK has been in my sights since my first passing. \n\nHK, when open, always was either filled inside or had a small customer base outside waiting to get in. To me, I always thought to myself this was a good thing! \n\nIn attempt to plan ahead and make my first time at HK something special I planned for Thanksgiving dinner at HK. I didn't tell my wife and she was somewhat reserved in us going out to eat in our neighborhood for Thanksgiving dinner. I would of been as apprehensive as her knowing the shortage of \"western\" style food in our part of town. \n\nSo, after putting on our Sunday best and slowly strolling up Noriega towards HK the anticipation was building inside me. We arrived and immediately noticed the small crowd waiting outside. No problem I thought. I stepped up to the hostess and proudly exclaimed, \"two for dinner\"! She looked at me as if I just spoke in some foreign tongue. I guess I did to her as she continued to just stare at me in total wonder. She scribbled something on the table sheet and gave me a scrap of paper with something else scribbled on it. After roughly 15 minutes of enjoying the warm Thanksgiving sun and the company of the other well-dressed diners we were ushered to our table. \n\nOur next challenge was in attempt to put ourselves at ease. There we were. The only Anglo-Saxon looking folks seated squarley smack dab in the middle of a sea of Asian families. After we slowly realized that not every eye in the room was staring a hole through our heads we relaxed and perused the menu. I knew what I wanted and didn't want the tasty morsels, as described on the menu, to dissuade my decision from my self-determined culinary experience. \n\nEither it was planned or our good fortune was shining upon us as the waiter arrived at our table side speaking perfect English. I told him what I wanted ... Dungeness Crab prepared anyway the chef would care to experiment with. I told the waiter I wanted the crab on a bed of spicy/garlicky noodles as well as a platter of vegetables. The waiter stood there with this look of indecision and question. The waiter spoke, \"so ... you want the crab anyway the chef thinks he should prepare it? Is that what you said?\" I looked directly into his eyes and gave him the affirmative. The waiter's face then lit up as if I just offered him the Mayor of San Francisco job. He stated the chef will be delighted to prepare the crab my way and he suggested the vegetables. Of course I had no idea what the hell he just named but when he offered a pair of frosty Tsing-Tao brewskis to start the evening off I knew we were going to be ok. \n\nOur meal arrived and as it did you would of thought I ordered deep-fried kitten. Again we experienced the un-easy feeling of every eye in the room starring a hole through, what is now the room's visual target ... our food. Which can only stated, was truly excellent. \n\nThe crab, which by this point, morphed into two Dungeness crabs was excellent. We had a Salt and Pepper crab and a deep-fried crab. Both fantastic. I had no idea what the heck the vegetable was but it was excellent. The noodles were great and just what I was hoping for. The combination of the noodles, crab and veggies was way more than my wife and I can eat. The leftovers were truly appreciated later that night.\n\nAt this point my wife was starting to become somewhat at ease. I was as well. We were now receiving thumbs up from our fellow diners on our choice. The little kids were all over but it gave the establishment a nuance that was necessary for the feeling of Thanksgiving. \n\nBottom line: Hong Kong Seafood Restaurant was excellent. The food was tasty, the service was perfectly fine and the decor was simple and clean. We were made to feel at home and thoroughly enjoyed our time and dinner. \n\nWe will be back!!", "author": "Wayne B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-22", "description": "Very decent choice in the Outer Sunset.  Kat was visiting from Boston and put a request in for good chinese (somewhat lacking at back there) Crowds of cantonese families wait patiently in the cramped space by the door, while the fog  roils around one's ankles.  We waited ~15 minutes to seat a party of seven plus baby.  When we tried to order from the chinese menu, the waiter demurred, saying we wouldn't like it.  But when we insisted brought out an appetizer plate of bbq pork, roasted duck, jellyfish and duck's tongue.\nAll of which was delicious altho the squeamish in our party refused to face the gauntlet (to our waiter's satisfaction).\nSizzlin rice soup was clear broth and good chunks of seafood.\nCrispy hong kong style egg noodles came with a tasty sauce\nclaypot eggplant & beef shortribs\ndau miu and garlic (peashoots)\nwhole deep fried fish\nspicy pork chow fun\n\nall very good dishes, used some MSG (as reported by sensitive friends).\nNot sure on prices since our fabulous friend Thanya picked up dinner.\nGood neighborhood option.", "author": "SatisFahYing A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-12", "description": "Went for dim sum on a Saturday. Took a bunch of newbies who have never been -- unfortunately, no carts, but rather ordering food from a tick-off menu. \n\nA number of things aren't translated into English, which always leads me to believe there's something good not being shown to the Westerners. Which includes the best item we ate - squid with spicy salt. Really incredibly light squid that melted in the mouth - and I am a connoisseur of this dish. We arrived at it by marking something random on the sheet next to Chinese, which they were out of, and so we got this dish.\n\nSecond best dish - an amazing plate of \"Tender Chinese Greens\" with garlic, that I simply asked for, since it wasn't on the menu.\n\nAnd the best \"actual\" dim sum was the shrimp har gau - dumplings - really delicious and light with a flavor that didn't require soy sauce to accompany. \n\nMost of the dumplings were excellent. \n\nService was taciturn at best. \n\nBeautiful looking giant clams and crabs in the tanks - might go back for those!", "author": "Seth N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-26", "description": "I used to love this place. We would go there all the time, in fact 2xs a week to be exact. For some reason, it doesn't taste as good as it did before so we stopped going. Maybe it was just an off day. But, if my memory serves me well, their food is decent.", "author": "Jordan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-12", "description": "I love their dim sum! So fresh, tasty and well prepared, unlike some other places that serve frozen microwavable items. They have an extensive dinner menu as well, which comes with colorful and mouth watering pictures, I personally enjoy looking at the pictures more than reading the descriptions. The dishes are very authentic (not crazy), and high quality. The only downer is the long wait.", "author": "Kai Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-10", "description": "I can't say I've had dim sum enough to be an expert but of all the places I've been I'd say this was definitely the best.  And the strange thing is, it's cheaper than other spots that weren't as tasty.  They have all the standards, all done well, and if you can read or speak chinese you have an extra section of menu opened up to you.  My advice is go with someone who can speak chinese, but some of those \"hidden\" items are a little more adventurous if you're just used to basic dim sum or chinese food.  The non dim sum menu is good as well.  It's a little pricier than the average chinese restaurant in the sunset by a few dollars per item, but it is better than some of those cheaper spots.  So it is worth it.\n\nAside from the restaurant they also have a dim sum to go right next door, but it closes at 4, but that's a definite bonus.", "author": "Raffi Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-22", "description": "This restaurant is full of new experiences:\n\nWe came in with a party of 20 and half way through the meal, the staff ask us if we could kindly fit into one table so that they could give one of the tables to other patrons who were waiting.  \n\nIn another visit, the waiter said a few of our chairs were blocking the aisle so he asked if we could move the table for him 4 feet towards the wall...because you know, it's not like this is the restaurant staff's job.\n\nHave you ever ate vegetables that contained steel pot scrubbers?  Me either, until this place gave served up a plate of Chinese broccoli with oyster sauce and strands of steel pot scrubber.  I guess this is their special ingredient.\n\nThis restaurant is on the same block as ABC and I never knew that it was possible to have a health inspection score lower than ABC who at least gets 70s.  Yet somehow this place managed to earn a score of 34 and  42. I think the restaurateur confused the health inspection with golf.  I wonder if the pot scrubber vegetables have anything to do with this.", "author": "James Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "I think this place offers the best dim sum in the sunset. The steamed dumplings are always very fresh with quality ingredients, and piping hot when they reach the table. The dumpling skins are very thin (which always indicates good and fresh dim sum to me!) My favorites include the typical HK favorites- shrimp dumping, siu mai, beef and shrimp noodle rolls, and the black bean spare ribs. \n\nWe also ordered the crispy seafood noodle dish. They were very generous with the seafood. The vegetable was fresh, and the sauce was nice and not overbearing with thickening agents or MSG.\n\nexpect to wait 30 minutes+, and spend $15+ pp for weekend brunch. service isn't too great, but the dim sum makes up for it.", "author": "Kelsie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-27", "description": "This is an \"order off the menu\" dim sum place. Food is good and for six items the price was $25 with tax and tea. The lobster dumplings though tasted more like shrimp than lobster but still good.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "In my opinion, this is one of the best Cantonese hk style restaurant in the area. We are usually very picky regarding food. A good friend of us recommended it, it was late at night and we brought our guest here to taste some real Cantonese foods. Dinner is absolutely fantastic! not sure about their dim sum etc. But the white chicken is definitely A+, near the famous chingyen style. Beef is great! tofu is A+. Service is great. environment is ice and cleaner than 90 percent of the Chinese restaurants we been to. Price is reasonable. overall its a fine restaurant!", "author": "Sunny N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-05", "description": "I came here with a group of friends on Saturday around 11 for dim sum.  This place was busy, but luckily they had a larger table available for us and we didn't have to wait too long.\n\nThe food was oily and I mean everything.  We had the usual dim sum items, har gow, siu mai, chicken feet, rice noodles, turnip cake, egg tart, etc..  All of it had way too much sauce.  We also ordered a dry noodle and it tasted all the same.\n\nThe service was good, prompt, and not too rude for chinese waiters. The price was on the higher side for the mediocre food.\n\nI may come back to try dinner sometime, but most likely not.", "author": "Kirk K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-24", "description": "I have been going here for many years.  IMHO, it is the best dim dum in SF.  It is always fresh, hot and not greasy.  The staff is friendly and helpful.  Today,  I took a friend visiting from Hawaii, very familiar with dim sum.  We ordered a number of dishes, but the waiter suggested we reduce our order!  Can believe that...spend less?  He was right.  Even with this, we left with a doggie bag.  Always happy with the yummy selections.", "author": "Anita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "my top two go to dimsum...crowded lines on weekends crowded during the week..good solid food... if you time your visit you can watch the food shift from one genre of dim sum to another...better than mayflower! better than tong kiang!", "author": "Ricote F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-01", "description": "OH HELLS NO!!  I am never coming back here again! I was treated like a 3rd class citizen begging for food, the servers were ignorant and so rude.  Everyone in the restaurant were screaming and I felt like I was back in China; this visit to this restaurant gave me flashbacks to the culture shock I had had before. Terrible!  After 25 mins of trying to get my to go order, the food was mediocre, but the headache I got was an amazing 10 on the pain scale. goddamn!", "author": "Hana .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-26", "description": "Gotta have dim sum fast and you live south of GGP?  Head to Hong Kong Seafood take out (next door to the restaurant).  It's tiny - 3 people are a crowd, but the women who work behind the counter are efficient.  Steamers are right there, plus there's more in the counter.  Don't see what you want?  No problem, they'll go back to the restaurant kitchen.  This is basic dim sum, tasty, but not high end like Ton Kiang.  Parking is non-existent, so plan ahead.", "author": "Janice P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-24", "description": "My favorite local spot for dim sum on the weekends. The trick is to order from the To-Go counter to the right of restaurant. Parking is a bitch, so make your significant other drive while you jump out.", "author": "Tommy O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-12", "description": "You ever think about a place to say...\n\"Man, if only I owned this place!\"\nGreat name... great locale... Clean decor... Bright... Comfy...\nI'd fire EVERYBODY!\n\nDon't even think of coming in early like 5pm to get a head start on dinner, because everyone is scurrying around like... like... a Chinese fire drill. We were greeted and seated quickly, but one of our party must have accidentally hit the cloaking device, because nobody saw us for about 15 minutes. So after the next 4 parties got seated, dealt their menus, and had their tea served, they sent us the dreaded... NEW GUY. He's the one that whenever you ordered a dish... you had to show him where in the damn menu it was. You can just feel the shroud of apprehension looming over the table. The final nail in the coffin? He brings us an order of clams with black bean sauce, I ordered CRAB with black bean sauce. He even shows me where it's listed on the damn menu! So WHAT... I said CRAB!   Whatever...  \nWe also had to listen to American Idol type show music on their sound system. You know what a stickler I am for ethnic authenticity... oh well.\n\nI must say that the food was pretty decent. The beef in black pepper sauce was tender, and the Honey Walnut Prawns were excellent. Lot's of prawns too. I bet the crab would've been great! Items are a bit pricey. Cheapest dish was $9.50 all veggies, no meat. Figure the average per dish is $11-$12. Portions are just alright. Lots of Asian patrons, but it's an Asian neighborhood in the Sunset. Parking can get rough, but not as bad as like Clement St.\n\nStill, if I come back... it won't be my idea.", "author": "Rick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-30", "description": "I believe ownership has changed, because the food is so much better! I've been here for dim sum twice in the past month because the dim sum was tasty and hot when it came out. Service is decent as well. This is now my go-to option when I don't feel like driving to Koi Palace.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-28", "description": "It's sad to say that there are not enough Chinese dim sum restaurants in the Sunset. Unbelievable that there are so few out here with the Chinese population being so freaking high.\n\nAnd if you don't have enough restaurants to push each other to out do the other, then you will be left with this. A very mediocre place with shitty ass service and some very annoying employees.\n\nLet's start with the food. That's almost their saving grace but not really. The food here lacks consistency. Take, for example, their XO noodles. One day, it would be beautifully cooked. Nice and dry and not too oily with great spicy flavoring deep inside the noodle along with the wonderful flavor of dark soy. The next day, lightly colored noodles with hardly any spice in them and very oily. Stir frying something like this is not that hard. And the noodles are pre-packaged stuff so they take the guess out of that. Unbelievable!\n\nNow, for the employees. We've been coming here when we were looking for a house in the Sunset. Kinda stuck with us and been coming ever since. Dad likes this place more than the other place on Ulloa and 20 something. Not sure why... But the staff here sucks balls then and still sucks balls now. The only difference was the female that was the manager a couple of years ago is now the owner, I think. Explains her picture on the wall. She's a nice lady that is hard working and takes care of a lot of things even when eating with friends or family. Very diligent. Can't say the same for the rest of the crew. Some of the waiters are cool. Some are just fucking stupid and lazy. And the servers. One of them seems to be a fucking race to see who can push out the most food. She's also the same one that wants to see how much sauce she can wear in one shift. Too fast and too sloppy. And there's a couple others that look like they're all hot shit. You work as a dim sum pusher, bitch! This ain't no Miss Hong Kong! And the two bitches that run the front of house and do the cashier work. The one with the glasses needs a mirror to see that she is an ugly ass bitch. And the other one with the sour look on her face needs to stop talking to me in english when I speak perfect Cantonese to her. Acts like she passed her TOEFL exam or some shit.\n\nThat being said, I still come here. But not by myself or with friends. With my family. If I had a choice of this place and Koi Palace, I would go to Koi. Not that that's the lesser of two evils. That depends on who's cooking that day...", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "Just went there earlier today because we were in the city and my mom loves their soy sauce chicken. Unfortunately we went there right at 5pm and they dont have the chicken ready until after 6pm boo. We didn't have a reservation, but it seemed like everyone else there did, so good thing we DID get there before dinner time. The place is pretty clean and the service is good. We ordered broccolli with some kind of mushroom, sweet & sour pork, beef & onions, honey walnuts & prawns, and some sort of dried fish with baby lotus root. It all came out delicious and we were well satisfied. The prices are more than reasonable and the portions are good, especially since we had 6 hungry people, we were able to still bring home left overs. OH! and we got sliced oranges at the end.", "author": "Elisa T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-13", "description": "the food was only mediocre and not enough to justify the terrible service we recieved.  they gave us the wrong food, then charged us for it despite us telling them about the overcharge when we got our bill.  they have an obvious disintrest to a low paying table since it was just my husband and i and we both wanted a simple meal of rice and noodles.  we dont expect stellar service, but at least to be treated justly.  and there must be some incentive to come back right?  but the food just was not special.", "author": "Lynette F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-17", "description": "I've been here plenty of times with my family whenever we have those family gathering dinners. This place is pretty good I must say. It is pretty clean which means you wouldn't need to fear about what goes on in the kitchen with your food. This place is probably one of my favorite Chinese restaurant because it is not too pricey.", "author": "Edgar G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-14", "description": "I've eaten here many times. Its the place we go to if we want good Chinese food and don't want to cheap out. I think its good and the place is usually packed so I don't think I'm alone. They even expanded into another section and still remain packed whenever we show up. Some of the dishes we've ordered are, Mu-shu pork, Salt and Pepper calamari (very good), Shrimp with Caramelized walnuts, Fried Rice, you know, the typical non-Chinese customers. We've always gotten high quality, and whenever we try something new, it's always excellent.", "author": "Rich M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-03", "description": "Good chicken and fish fried rice, bbq pork churng fun, and overall dim sum.  My husband and I enjoy our Chinese lunch.", "author": "Tanessa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-25", "description": "very good place in San Francisco. it is located in sunset district out on noriega (the second or third chinatown located in san francisco). We been here over a dozen times in the past month and i have to say, i did not get sick of it yet. all the food there on the menu have been satisfying. the waiters are all nice and provide very good service. i recommend people to come here and give it a try especially if you guys are traditional cantonese. The food is excellent. The sweet buns that they make for desert is something you can't find unless you go to hong kong. places like koi palace, R & G lounge, Mayflower, and big seafood restaurants can't beat the taste of this place. \n\nit i s located on the corner of 33rd end of the block from ABC restaurant and right across from a supermarket. give it a try, if it's not good, then come back and complain", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-26", "description": "After a late night, came here with a group of friends for dim sum on Sunday. Had a good time, with a ton of food for cheap. Food was good, not great but definitely worth going for. I'll be honest, greasy dim sum was what I needed so everyone wins.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "i can't justify why people receive bad service here... but then again... i never have gotten bad service here so... i guess it was tough luck to those who gotten bad service... but at the same time... you're at a chinese restaurant... it's hussle and bussle... it aint no gary danko... \n\nas for food... i like it.  okay, wait... lemme go back... might i remind you that you are at a seafood restaurant... so my best advise is that it's a good idea to order seafood... and fresh seafood at that... walnut prawns do not count! (i've had their walnut prawns, and it's good, but i mean... i'd much prefer spending my $ on other dishes) ok, back to my review... food is always good here, at least on all the dishes that my family and i order... but we never order the ABC dishes... you know what i'm talking about?  i mean, we have... like we've had their lettuce cups... it's ok... broccoli beef... its ok... nothing compares to the regular dishes that we typically order... haha i know, i'm being cryptic... but ok... for example... we will always order the roasted squab... it's always good... skin is crispy... meat is juicy...yes squab is pigeon... is that freaky? but, it's good here... and you don't have to fly to HK to get good squab\n\nso might i just add... ditch the ABC style... be open minded if you wanna eat good chinese food", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-25", "description": "The atmosphere was nice so we decided to go there for dinner.  The selection of seafood was good.  This is not a restaurant for kids, as it is on the expensive side and many of the food that you order for kids you could get down the street at a lot cheaper price.  The service there is TERRIBLE, unless you are regulars and know them as I notice the waiter talking with others they knew.  One thing I never experience was the waiter was so cheap when he scooped the soup into the bowls he said there was not enough and started to redistribute the rest of the bowls.  I thought that was TACKY and unprofessional.  Also, we had to ask them to get things multiple times.  I think they did not care because the tips were added to bill.  The food was so-so.  The crispy chicken was very dry.\nAs usual some bowls were not clean.  Norm for most of these restaurants, but not what I expected for this higher class more expensive  one (not worth it).\n\nI would not go back to this place for dinner as the service was bad and it's not worth the price.", "author": "Albert W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-27", "description": "We don't eat in San Francisco that often.  Our friend took us there for dinner last week.  The food was very good.  However, the menu is as pricey as the restaurant in the south bay.  I kind of have a wrong impression that Chinese restaurants in the city should be cheaper than the south bay.  Well I don't mind paying more as long as the food is good.  However, I wonder how this restaurant compete with all the bargain restaurants nearby.  Perhaps good quality foods do stand out.  I don't mind eating there again when we are in town.", "author": "Joe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-12", "description": "ok, so the best thing to do here, for dinner- tell the server- your choice, usually it ends up being something not on the menu which is fun and an adventure! we've done that a couple of times and it's been worth it. and sometimes the roommate wants dim sum for breakfast and bike up the road to this place, and always order too much, but it's solid. i have to mention... i haven't been here in..awhile..do to the fact that they were written up in the paper, as the worst (aka most unsanitary) in the CITY, the whole shabang. it creeped me out... but i got over it :)", "author": "Abigail W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-23", "description": "My aunt held her 61st birthday dinner here. 2 members of our 10-top were running late and the manager comes to reprimand us! He kept coming around asking where they were, where they were coming from and asked us why we even bothered to make a reservation if the whole party wasn't here yet. It was a little rude of him, but we figured it might be because it was a busy night and there were other full tables eating, too. Lo and behold, we were the LAST big table they were serving AND we had already planned the menu beforehand so they knew what to make and stuff. Our last two members arrived 15 minutes later, so that was hardly late enough to deserve a tongue lashing, in my opinion. I thought it was kinda rude for the manager to come and scold us. \n\nThe decor was OK, nothing super fancy. Food was above par, their shining moments being the Peking duck and the yellow chicken (not sure what it's called). Shark's fin soup was OK, had better. The abalone and vegetables only had a few pieces of low-quality canned, abalone and the rest were giant slices of mushrooms. We had a ten course meal and they ran out of the sweet soup, so they brought us a tray of assorted gelatin pudding, like coconut, red bean, and this other one I couldn't identify. Total came out to $400, tax and tip included. Rated them 3.5 stars, -1 star for bad service, +0.5 star for trying to make it up to us with dessert. Doesn't absolve the fact, though...\n\nFinal Verdict: Food was fairly good and came out at a decent pace, we had a good time despite the manager's mean face. It was rude of him to complain about our party being late, bad service will surely seal your Yelp review fate...", "author": "Dana F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "We eat here almost every Tuesday afternoon. We use to eat at Golden Mountain in Chinatown but ever since we moved to the sunset, we've been getting dim sum here. The food is ok and the service is good. Nice and close. I think their noodle dishes are better than their dim sum tho.", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-24", "description": "This restaurant sucks!!!  I am never coming back here again!!!  I use to come here with my family (only 4 of us) for dinner  (spending $100-$150) every week.  Not because the food was great but because we were lazy and it was close by.  BUT NO MORE!  I rather drive further out than to put up with their shi**y customer service.   I was treated so badly that I made my family vow to never give them any business again.", "author": "L C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-03", "description": "I don't think they seat you unless you have more than 4 people. I went there with a group of 4 on a Saturday night. It was packed. They would not even let us wait for a table. So we left. (it wasn't a private party)They only had big round tables out. No small square ones.", "author": "Stan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-24", "description": "good authentic dim sum -- better than the stuff in chinatown downtown\nkinda far away and a bit of a wait\nprices $2.30-$3.60 for the usual suspects (total for 2 under $25 including tea)\nsome small dishes to large dishes $1.99-$5.00\nmany dumpling choices\ninteresting specials, i.e. pig blood on the menu", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "*Review is for dinner service*\n\nWe made reservations, and upon arrival had to wait approximately 10 minutes for our table of 7.  Waiting outside in the cold was I found out, was nothing compared to the amount of time it took for the food to come to our table.  \n\nOnce food came, the first two dishes arrived one at a time.  Without the rice too!  We really should have waited, but we were so hungry from waiting so long that we basically scarfed down those two plates.  Eventually, the rest of the dishes came, thankfully all around the same time.  \n\nI enjoyed every dish that I ate.  The prices are higher here, but you can easily tell that the food is of much higher quality.  Look at the crab/lobster tanks and compare it to any other similar restaurant in the Sunset.  They are actually alive (fresh), and you can tell when you eat it.  I must admit I have rather dull taste buds, but everyone else at the table agreed with me that the food was excellent here.\n\nSo in summation, this place makes some delicious Chinese food, but the service was excruciatingly slow.  But the food was so delicious!!", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "i came here with friends for dim sum just cuz we wanted to, it was weird not with family cuz i never ordered for myself...always my parents. but we kinda know what we liked and wanted. the food is pretty satisfying, and close by if you're in the sunset. easy parking, nice waiter ppl and yup, we'd come again.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-28", "description": "It was probably not a good idea to come here on Christmas for Dim Sum. We had to wait half an hour for seats, and the food took forever to come. The food was good though, but compared to other restaurants I've been to, the prices are kind of jacked up.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "We came here for a 40th Anniversary Dinner... it's not really set up for a banquet type dinner but they used a seperate room and it worked out pretty nice.  The food here is actually really good.  We had this crab that uses the salty egg to batter the crab, which I've never had, and that was pretty good and I don't even like the salty egg.  We also had a scallop and beef plate which I've never seen anyone else mix those two in one dish.  Everything was tasty and I was so full by the end of the night.", "author": "Kymberli C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-27", "description": "I just finished my dinner with my friends tonight. The food is o.k. The waitress was very mean and rough. No manner, impolite, the attitude was really bad. I never met a waitress like that. I will not be going to this restaurant again!", "author": "mei l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "Came here with a group of 8 friends for dim-sum on Sunday.  The place was packed.  We had reservations and were promptly seated.  The dim sum was really good! Everything tasted fresh and the ingredients were good.  Our waitress provided great service - she was warm and accomodating - this is not very common at most Chinese restaurants. We thought our beers weren't cold enough and she brought out an ice bucket.  And the prices are very reasonable - a fraction of Yank Sing and Tong Kiang.  And it's more authentic - none of that non-traditional BS stuff that Yank Sing offers in order to drive up the check.  This will be my new go to place for dim-sum.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-08", "description": "Awesome dimsum and pretty cheap too.  The Chinese dinner here is really good as well.", "author": "Lily K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-17", "description": "simply some of the best dim sum ive ever had. shared it with friends and all five agreed! fresh and tasty.", "author": "M S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-10", "description": "Went on a weekday night for dinner with some friends.  I was the only white guy in the entire place, with three asian women and one asian guy at my table.  String bean chicken was mediocre at best.  The soy sauce chicken was excellent.  The girls said they love the place for the dim sum, which we didn't have.  They ordered an egg plate that looked like egg custard, they all seemed to think it wasn't very good (but they had seconds), but I didn't like it.  Their seafood noodle plate and eggplant dishes were excellent.  Seems like if you know what to order this place is a winner. Service was friendly and quick. The food was hot and our tea was strong.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "Unlike many other neighborhood Chinese restaurants, this one has very nice people!", "author": "JC D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-13", "description": "this place can be better.. i always expect better but than i get the same outcome each time i come... i never come in the morning always at night. what i get here i can get 50% less up the block says my mother! but she likes to eat here, its kind of bland here, thats because i like seasoning! they have shark fin soup ..at every place but i like it here more .. maybe because its close to home. but i dont recall much so when i remember i'll continue!", "author": "Carolyn Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-11", "description": "This place was pretty good when I was going here as a kid for family dinners but now the quality has downgraded. I get more grease and salt in my food than anything else. Service is good as is the atmosphere but the food aint so great.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-03", "description": "This place is easily my most favorite Cantonese Chinese restaurant outside of Hong Kong or Vancouver.  Dinner or dim sum, the quality and the inventiveness is impeccable.  And, it's not snooty.  You can totally wear sweat pants.", "author": "K W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-10", "description": "Okay, This place is pretty good.  They just renovated the restaurant so the restaurant is pretty clean.  The only time when Chinese restaurants are clean is 1-2 years after renovation.  After that, ALL Chinese restaurants go down hill.   \n\nFood is decent too probably one of the best in San Francisco.  I would give it 5 stars if they had a little more selection for the more authentic stuff.  The only Dim Sum places that get 5 stars from me are the places in Hong Kong and maybe Koi Palace so consider this an excellent rating for a place in San Francisco.", "author": "Ethan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "Perfect place to stop by for some Yum Cha after sleeping in on a Sunday afternoon.  The little $1.99 section on the menu is great if you don't want to spend too much.. best things there are 1. salt and pepper fried tofu squares 2. pork lungs?  comes with an awesome spicy soy sauce on a bed of brussel sprouts.  The fried calamari may sound tempting for such a low price, but it's not that good.  I could hardly taste the calamari at all and it's always soggy.  Other things to try on the menu if this is your first time: Chiu Jou Fun Go (Chiu Jou dumplings with peanuts, chives, and meat inside.. mmmmmm SO GOOD), fried shrimp dumplings, Porteguese egg tarts, and your traditional Ha Gao (plain shrimp dumpings).  \n\nWeekend afternoons are SUCH  a long wait.  Get here before 11:00am.  BUT if you're only looking to sit 2-3 people, you may be lucky and get to cut everyone in the line!!!", "author": "Connie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-27", "description": "went back last night and had two more chef specials: the silver fish and lotus and the fried sticky rice in bamboo (those are probably not their actual names) and they actually dethroned the good frickin frog for the tastiest dishes. the kids LOVED the rice in the bamboo and ate it like they were just released from prison -- a sight only a chinese mother could love.", "author": "L. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-11", "description": "Now THIS is real dim sum.  The food is AWESOME, the service is fast, the food comes out quick, and it's CHEAP.  I dare you to spend more than $20 for 2.", "author": "Helen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-07", "description": "I come here to eat with my family once every other week and we're rarely disappointed. The waiters are typically attentive enough and if you're having problems just flag one down.  Only problem is if you're seated in the corner by the fish tank and nobody can really see if you want more tea unless they're going to get more chairs from the back. The food is great and the tastes are pretty consistent. I've only ever been disappointed by one dish there which was a bland steamed tofu with pickled vegetables type dish. Their dim sum is great, as most of the dishes on their menu.", "author": "Tiff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Went here only a few times, including last weekend.  We had the traditional banquet-style dishes and the food was absolutely amazing.  The shark fin soup with the bits of crab meat was delicious!  The prawns with the mayonnaise and walnuts were tasty as usual.   The catfish was pretty good too.  The roast pork and jellyfish were better than ones I've tasted in the past.  Basically, everything was exquisite (:", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "Decided to check this place out as an alternative to Ton Kiang.  We were a party of 2, arrived at about noon on Sunday and ended up waiting about 35 minutes for a table.  At about 1:30 or so, they seemed to stop sending stuff out en masse so we had to ask for an order form so we could get the last few dishes we needed to finish off our meal.  It took us a while to figure this out since neither of us is Chinese, but once we did, it was fine.\n\nThe food quality was excellent - even better than Ton Kiang in my opinion.  Every dish was hot, seasoned well, and just plain solid.  In fact, I'm still thinking about how great each dish was.  We had:\n\nbbq pork buns\nsticky rice with chicken wrapped in leaves\nshu mai\npan friend shrimp & chive dumplings\ntaro cake\nbeef rice noodles\nshrimp rice noodles\nshrimp dumplings\nbeef meatballs\n\nOur tab was $30 for all that.   \n\nI'd give it 5 stars for food quality, but gotta take off one on the overall review for service.  I have no problem with gruffness, but at least be efficient at the same time.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "The best dim sum place I've tried in San Francisco.  The selection is really good here and the lobster noodle is a great deal at $18.  Additionally, the thickness and texture of the rice noodle is quite exceptional, and I really don't know any other restaurant that offers chicken and bitter melon rice noodle.  It's really yummy!\n\nIf the restaurant is packed, they have a convenient little door for to go orders.  You can order everything off the normal menu and everything is hot and fresh.", "author": "Sharon W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "best dim sum place in the city. great service, friendly staff, above average food, and very good prices. try the \"salt and pepper tofu\" dish. just awesome.", "author": "Tyler b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-29", "description": "My family enjoy going to S&T for dim sum and also for dinner; not only because the food is good, but service is good too.  Weekend dim sum hours usually full and requires maybe at least 20 minutes of wait time, longer for large parties.  Same for dinner on weekends.  But they do take reservations for dinner.   My favorite dish for dim sum besides the typical siu-mai and har-gow, I like their crab porridge and lobster lo-mein.  For dinner, I love their squabs.  It's better to ask them to hold however many squabs that you want, because they run out pretty quick.  The waiters are friendly, they like to joke and chat with guests whenever they come around to make sure everything is ok, and to pick up our plates.  It's the best place to go for Chinese food in the Sunset district.  Now I'm afraid more ppl are gonna go there to eat which will cause the wait for a table to be even longer  =)  But still, I highly recommend this restaurant.", "author": "Tadaa T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-10", "description": "I've have been here many times for dim sum, but after my last visit, I am for sure not going back. The food is OK here, but their service is awful. During a family lunch with 14 people, I asked for an extra setting for a late guest, and the waiter rudely responded that we should have eaten at home because we were \"so troublesome.\" Then after our mean, the cashier lady simply dumped the bill on your table without looking. After spending a lot of money there for such a large group, I thought they would have wanted our repeat business. I guess not.  Although they have decent food, there are definitely better restaurants in the area that treat you with much much more respect.", "author": "fanny w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-03", "description": "they actually only get 3.5 stars but i'll just round up to 4.  actually no, i'm going to drop them back down to 3 since we had to wait 40 minutes for our freakin lotus leaf wrapped rice because they forgo our order.  we had to remind them 2 times so that's a total of asking for it 3 times before we were able to get it.  Nonetheless, S&T is probably the better din sum restaurants in the sunset district.  if you want better then just go to koi palace in daly city but be prepared to wait to get in.  There is a wait at S&T but not too bad.  The place is quite larde with two seperate rooms.  They do dinner service here also but I have yet to try that...it is quite full though everytime I drive by at night.   Also they've got another door outside if you just want to buy takeout.  I recommend getting takeout here instead of at the dim sum takeout shop up a block if you are looking for better quality.  So a good 3.5 star quality dimsum, but sorry I had to kock them down .5 stars for bad service...If they do better on my next visit, I'll write another review.", "author": "LittleBird 8."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-25", "description": "Like I promised , I'm updating my review because I just tried their dim sum today . The shrimp rice noodle ( ha cherng ) was good . The rice noodle was really smooth ( probably the smoothest I've had so far ) which I really liked . The shrimp dumpling ( ha gow ) and shui mai was alright . The custard bun was pretty good .. the custard was pretty creamy . The soy sauce chow mein was pretty good too . The pan fried radish cake was ok but for some reason , it tasted a little weird too . The salt & pepper squid was ehhh ..  not much flavor . The shanghai dumplings weren't that good either . Had really little soup in them & not much flavor . I liked the fact that they had big clam jook because you don't see that in a lot of places but it wasn't good . The big clam is good but not the jook . Like my dad said , they probably just used a machine to grind up the rice to make the jook . I think so because the jook was very watery and not thick at all . You can't taste any small bits of rice at all . I didn't like the texture of the mango pudding .. it was too mushy . It wasn't firm enough probably because they didn't add the powder you're suppose to add to jellos and puddings to make it firm ( I'm not sure what it's called , sorry ) . Overall , I give them 3 stars for yum cha . If I average it out with my previous dinner experience , I would have to say this restaurant deserves 3.5 stars but since Yelp doesn't allow me to get half stars , I'll cut this place some slack and give this restaurant 4 stars because the food was on the better side =]", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-03", "description": "Food and service is ok.  I frequent this place a lot and their quality is always standard.  Had a bad experience once but their waitstaff took care of it right away, so that made up for the problem.", "author": "Gina R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-21", "description": "Really good food consistently, but poor service! The hostess doesn't speak English (should this be part of their training in Asian restaurants?) and she gives up your table even if you call ahead.", "author": "Crystal V."}
