{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "My friend and I were in the Mission Bay Area and decided to grab dinner. We yelped what was in the area and Saap Ver came up and we decided to give it a try. \n\nAfter sitting down, we took a look at the menu, and we were lightweight overwhelmed. There's so many options and we literally didn't know what to order. After browsing for what felt like forever, we decided on the Thai Sausage with Crispy Rice Salad (mild) and the Pork Spare Rib Soup (mild) and a side of sticky rice - I really enjoy rice and soup together and this was a nice combo! \n\nWe enjoyed both of these dishes! Both of these dishes were extremely flavorful and the presentation for both dishes were nice. I did find both of these dishes pretty spicy for a mild though, but I didn't mind. I definitely enjoyed the salad more between the two of these dishes! There were many textures in the dishes and the flavors of everything went really well together! Highly recommend!\n\nOverall I really enjoyed this place! I would come. I'd definitely come back and try their other dishes!", "author": "Stacey Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-24", "description": "Walking past Saap Ver and you see people happy and chatting away with friends. The ambiance is dark and there is a bar, and it is pretty spacious. Busy on a Wednesday evening. It was even busy on a Monday night. \n\nThe hostess greeted me upon walking in. I requested for a menu for food to-go. The waitress said it would take 30 minutes for them to make the food. \n\nThis authentic Thai restaurant is NOT vegetarian/vegan friendly. I specifically ordered pad see ew, vegetarian with tofu. It arrived with no tofu. When I asked about it she said it costs extra. That makes no sense as beef costs more than tofu. I would have ordered both tofu and veggies.  She gave off a bad energy so I would rather leave with just veggies than wait another entire 30 minutes to fix the order. \n\nAlso they are not friendly towards artists.  Both the hostess and waitress gave me dirty looks because my eye makeup was too out-of-the-ordinary for their liking. \n\nThe portions are small. Last time I was here one year ago, I ordered food for both me and my brother (he was not physically present) and they skimped. It was not enough food for two people. I had even ordered two dishes at the time. It was even smaller portions this time. One dish 15 dollars vegetarian with no tofu. The worst part of the experience at Sap veer was the poor customer service, awful attitude, judgmental stares.\n\nThis place is awful and reeks of bad vibes. Highly not recommended.", "author": "Lydia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "I came here on a Monday night around 8:30pm and it was pretty busy but we got seated right away. The decor is really unique and a fun environment to get a bite to eat. A really nice space for both big and small groups. \n\nMe and my friend ordered the Tom Saap Pork Spare Rib Soup, the Thai Sausage with Crispy Rice Salad, and a side of Sticky Rice. I enjoyed the flavors in all the dishes. The spareribs were tender and the soup was hot and sour. Even though the salad was a little hard to eat, the crispy rice added good texture and was very flavorful. The servers were also friendly and very attentive. \n\nEven though we didn't order any drinks, they do have a full bar and a bunch of cocktails and drinks. I would definitely come back to try other items from their menu.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Food was solid here, and they have a giant projector that my boyfriend loved so we can eat and watch football. \n\nWe got the shrimp Pad Thai, Clay Pot Sea Bass, and Tom Koga soup. Everything was very good. The sea bass looked strange and unappealing, but the flavor was light and great! \n\nWould come back if I was in the area and craved Thai, but wouldn't go out of my way with all the great places in SF.", "author": "Miranda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-26", "description": "A couple good friends of mine brought me here for dinner one night when I was in town for work. This is one of their favorite Thai spots in the city. \n\nThe vibe and decor at this place was pretty fun. They must have been pretty short staffed the night I came because when I walked in, I had to wait several minutes for someone to come greet and seat me. \n\nMy friends recommended this cocktail they'd had there before that had some kind of lemongrass infused liquor and chili vodka or something, but they said they'd be discontinuing that drink so we were pretty bummed. \n\nWe started with the fresh rolls to start which were fresh and tasty. \n\nFor my main I had the pumpkin and tofu curry with garlic ginger rice. The curry was thick and decadent, but could've had a bit more pumpkin in it. \n\nOne friend ordered the sautéed beef with string beans which was super tasty and well seasoned. I would get that again. \n\nMy other friend had the spicy sizzling seafood which was ok but kind of underwhelming. She loved it but I thought the ingredients were not super well incorporated. \n\nTheir dishes also came out about 10 minutes after mine so timing could've been a bit better. Prices were average for what you can normally find in SF. Overall a fine experience.", "author": "Ashtar B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-05", "description": "Ordered pad see ew beef to go for lunch. The flavor is good, medium spice level is actually pretty spicy - go easy if you are not crazy for spicy food. Only complaint really is the portion size - for $14 you would have expected more noodles and beef in it.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "This place was recommended by one of clients and what a great restaurant. We ordered the papaya salad , pork belly and Thai sausage-crispy rice salad . They were prepared in the most delicious way and very close to the authentic food in Bangkok. This is hands down one of the best places to get a good Thai dinner at a very affordable price ! From now on , we will come here every time we are in the city.", "author": "Pedro C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Came by for lunch the last couple of days and it was a decent experience both times! Staff was friendly and water was nice and cold upon arrival.\n\nThai tea is decent, better than most, and not too sweet. Thai tea is also pretty strong.\n\nOrdered the Pad See Ew Beef the other day with spicy and it was delicious and fresh. The beef was rough and overcooked while the noodles were very fresh and the soy sauce was perfect! Portions were so large that I couldn't finish!\n\nOrdered the Pad Thai omelette the following day and it was decent. The omelette, was delicious whereas the noodles were all stuck together...something was wrong. The 4 shrimps were decent sized. Again, the portions were too large...\n\nTheir chicken satay appetizer was smokey, flavorful, and tender. Quite impressive!\n\nThe samosas were decent too. \n\nThe fresh rolls were a miss.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-30", "description": "I have come here a bunch of times and it can be a little hit or miss. Most of the dishes are amazing. Be careful with some like the crispy rice salad--a medium spicy dish was screaming with heat. I tried to eat it (I am fan of spicy--my native cuisine is spicy) but after 3 bites, my eyes were watering, my head was pounding, and I was choking. This is actually the second time this has happened. \nI was also stunned on my last bill to see that they automatically rang up a 20% tip for my meal when there was only 2 of us dining. I didn't make a stink about it but I will next time.", "author": "Monica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-20", "description": "Dine in and takeout equally delicious. I really love the vibe here and all the employees are friendly and attentive. Haven't had a bad experience yet and I've come over 10 times now. Tonight I saw their gin and watermelon fruit bowl and had to order it. So good! See photo. We ate all the watermelon and scrapped the rest out \n\nMy go to dishes are chicken wings, pork shoulder salad, Tom yum noodle soup, pad sew ew and yellow curry chicken. Their menu is quite extensive and we haven't explored yet.\n\nThere usually have their projector on. Watched a few Giants and Warriors games here.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "This is a cute little spot with great food.\n\nI would say the larb here in my opinion isn't the best. Everything bout it was great minus the texture of the meat.\n\nThe duck dishes here are really good.\n\nThere wasn't really anything I didn't like. \n\nWe ordered a curry, soup, chicken, and pork ribs amongst other things.\n\n-\n\nService was great.", "author": "Lilian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Cool casual vibe, great cocktails and an interesting selection of dishes.  So excited when I first saw the menu -- was hoping this could be the Lotus of Siam of SF.  While that wasn't the case, there's still lots to love.\n\n* Pin Up Girl:  Gin, watermelon and lime juice served in a whole mini watermelon.  The watermelon was sweet and this was delicious!  Worth the $18.  5/5\n* Cut Cut Cut :  The other fruit cup cocktail, this one was made with vodka, hibiscus syrup, pineapple and lime juice served in a whole pineapple.  Sadly the pineapple was a bit underripe and the cocktail leaked out onto the plate, but it was still quite good.  4/5\n* Thai sausage with crispy rice salad:  Spicy, salty, sour, tangy:  not quite the LOS version but still very satisfying.  4.5/5\n* Crispy pork green bean:  I can see why this is a polarizing dish -- the pork is somewhat crispy somewhat chewy.  I liked it but wonder if it could be a bit more tender instead of chewy.  Sadly not spicy.  3.5/5\n* Deep fried whole tilapia with chili sauce:  this looked great but the chili sauce made the fish a bit too soggy, plus it wasn't spicy at all!  Tons of fried basil were a nice touch but it could have been better. 3.5/5\n\nOverall we loved the vibe and the drinks.  We're disappointed that only the rice salad was spicy, but there were enough intriguing dishes to make it worth a repeat visit.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "On our way to the San Francisco Ice Cream Festival, a friend and I stopped by Saap Ver for some food to tide us over before stuffing ourselves with dairy treats. I'm very glad we did -- I liked it more than the ice cream!\n\nThe first thing that struck me was the decor. The walls are plastered in retro Thai movie posters, and there's a cute sports bar off to the side. I've never been to Thailand, but I imagine it's something a lot like Saap Ver.\n\nThe second thing was the menu. It's just plain vast. Rice dishes, curries, specials, noodles, meat, and more specials line the pages. It took some real focus and determination, but I eventually settled on the spicy red chili beef, while my less-hungry friend grabbed some of the meatballs.\n\nThe balls came out first. The sauce was sweet, with a hint of spicy of tanginess, but the meat itself was underwhelming. Moist, but otherwise unremarkable.\n\nMy beef, though, was lovely. The sauce was a top-notch combo of umami and spicy, and the peppercorns were like little popping boba of flavor. The meat was a liiiiittle tough, though; it would have benefited from a little tenderizing before cooking.\n\nOverall, Saap Ver's got some good flavors going on, but could do with upping their meat quality game a bit. I'd go back to sample something else from the expansive menu, but it's far :(", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Ate lunch since another nearby restaurant had long wait. Beef noodle soup was good, maybe need better beef broth. Egg crepe was very good. I thoughtthat this entree was tastiest. Pork Rat Nah had too much oyster flavored gravy. Mai Chapt. Very good decor and not too crowded on weekday at 1230pm. Big screen TV for sports viewing. Three unisex toilets very clean.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-20", "description": "Most authentic Thai I've had in the Bay Area. They don't appeal to the typical American tastes with the excess sweetness or tamarind. Perfectly salty with fish sauce and hits hard on the Thai pepper spice! Just the way I love it. Seriously the best Tom yum in town. I normally get it with tofu which they will add extra veggies in and makes it that much more yummy. Medium spicy is pretty spicy here and I am no stranger to spicy food, I love it. \n\nAll the appetizers I've tried are good. We normally opt for fish cakes or spring/fresh rolls. They also have shrimp egg rolls which are always good if you want to indulge in fried food. Papaya salad is the perfect mix of sour, spicy, salty. \n\nFor entree I always get the same thing: pumpkin tofu curry! Ooh so yummy. Hits the spot when you're craving something hearty. I normally order plain white rice but recently discovered they offer sticky rice and ginger garlic rice...say whaaaa!!! I can usually always go for Thai food and I have to say I'm lucky that this one is close to my house and the best in town.", "author": "Stine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "On the hunt for yet another order of steamed chicken, I traipsed along 8th Street from Market all the way down to the Design District to find this rather lively large space on Division Street. The moment I entered at around 7PM on a Thursday evening, the bustling space evoked the spirited atmosphere of a Singaporean hawker center with a touch of San Francisco kitsch in the vintage movie magazine covers being used as wallpaper and Christmas drop lights hanging from the ceiling (photo: http://bit.ly/2pcEn2f). The dining profile was young, mostly Asian, and likely working at start-ups nearby judging from the Ben Sherman vibe of their clothing.\n\nI was seated straight away on a lonely banquette table and perused their rather lengthy menu to see what I could get away with for dinner. I also learned the literal translation of Saap Ver was 'Damn Delicious'. OK, fair enough. I started with the $8 Fresh Rolls, purely vegetarian with an extra thin rice paper wrapper and an extra thick peanut sauce. They were stuffed with lettuce, cabbage, cucumber, carrot, vermicelli noodles, and tofu (photo: http://bit.ly/2FQHoPV). Damn, it was delicious though not entirely unique in execution. My main event was the $12 Chicken Ginger Rice, their take on Hainan chicken which I dared to ask if I could have paleo.\n\nThe server asked the chef who refused as he felt the rice was the point of ordering the dish. It was indeed as the plump chicken thigh was resting on top of a large mound of ginger-infused rice with cucumber slices and soy sauce on the side (photo: http://bit.ly/2pioeZd). The poultry was tender and just what I wanted as it was boneless but not skinless. I added a $5 side of Steamed Broccoli in order to make it more paleo, and it worked for the most part since the veg was fresh (photo: http://bit.ly/2HC86t4). But hell, it didn't stop me from devouring the ginger rice much to my nutritional chagrin. Damn, it was delicious and probably worthy of a return visit with Jamie W.\n\nFOOD - 4 stars...saap ver!\nAMBIANCE - 4 stars...the Southeast Asian party vibe worked for me...surprisingly\nSERVICE - 4 stars...pretty attentive to this solo diner\nTOTAL - 4 stars...nice to find a Hainan chicken worth getting at a real hawker center", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "Tasty Thai food, friendly stuff and great atmosphere. If you're not super familiar with Thai cuisine, choose something from a daily menu board or ask for help. \n\nThe line is not super long most of the time. The place is rather big, it is good for couples and groups. But it's noisy in the evenings. Average waiting time is around 20-30mins, which is lightning fast for SF.  \n\nThere are not that many vegan options, but as a vegan you still have some decent choices of veggies or tofu. Cocktails are amazing! And the bar... with huge TV.", "author": "Liza B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-27", "description": "I really wanted to like this place. The decor is super cute and there were a ton of people eating dinner late on a Thursday.\n\nWe ordered Pad Kee and Spicy Red Chili Beef. Although the beef had \"spicy\" in the title, the pad kee was so spicy that it was pretty unpleasant to eat. I am a fan of spicy food and I still didn't really enjoy it. The beef was just ok. The meat was not great quality and the veggies were under-cooked.\n\nI ended up ordering a Thai iced tea for my dining companion who was pretty traumatized by the pad kee spiciness. The tea was really tasty.\n\nService was inattentive but not the worst. I wish I had loved the food as much as some other reviewers. Maybe they were just having a bad night, but I probably won't be back.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Amazing place for Thai food, and it even has a bar! The pork belly and curries were amazing, and when you request it spicy, it's actually spicy. Be aware that this place does get crowded on the evenings and over the weekend.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-25", "description": "This place has been in business for 2 years now. I love the setting but the food I was not too impressed, just OK for a quick bite at lunch time.", "author": "Mehran A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "\"We just had a bonanza in flavortown.\" The words I spoke moments after finishing our delicious meal. Look I'm no Thai food expert but I know delicious when it touches my mouth and this is it. We ordered the pad see ew with beef, the dinner plate with papaya salad and beef jerky, and the fried tilapia....oh and coconut ice cream. They mean spice if you ask for it and thank goodness I ordered a Thai iced tea to wash it all down because we weren't shy about chili's. Everything was flavorful, smelled like the smells that you expect, real Thai people giving food advice, and the couple next to us ordered the watermelon drink and that looked like fun also haha. We'll definitely be back for more since we live nearby. Bring these people business but don't get overly crowded ok? Lol it's worth a shout", "author": "Guisela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-08", "description": "Very delicious and I like that the name means \"damn good\" in Thai!\n\nSat down here for lunch with the clients yesterday and this was their pick. Ordered quickly and they have a great atmosphere with awesome movie posters from old films all over the wall. The menu is pretty standard as far as Thai dishes go but the delivery and presentation of the food is quite nice.\n\nDishes ordered:\n\nPad see ew: 4/5 - little bit greasier than I usually like but very flavorful and VERY mild. I bet they saw me as a pasty white guy and thought I couldn't take the heat\n\nRed curry with brown rice: 5/5 this dish had great presentation and the curry was rich and flavorful\n\nChicken ginger fried rice: 5/5 once again great presentation, good quality ingredients and a little on the pricier side for a fried rice dish at $16 but still good!\n\nWhat you can expect from lunches in San Francisco.\n\nWould definitely return and try some other dishes another time.", "author": "Gabriel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "We came here for beer (they have a full bar bless their souls) and were impressed with the authenticity of the food selection. They have way  more then pad Thai and pad see ew... There were different larbs, squid salad, crispy salad, papaya salad, tilapia dishes. It all looked sooo good. They even have durian black rice dessert which I thought was tasty (probably not for everyone), and surprisingly did not had a strong scent. We also had a sour soup and fried wings which went well with beer. Wished we had room to order more but would definitely come back.", "author": "Kimmie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Love the atmosphere in the restaurant! The foods taste authentic! You gotta spare your stomach because the foods come in large portion. However it takes quite long for them to serve. If you walk in there with an empty stomach, you should make a quick decision on your food in order to get the food faster.", "author": "Nui W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "Booked a table on Yelp and found no records of reservation there when we arrived. The host was a bit rude to the point that we had to prove our email confirmation in order to get a table even when the house was half empty... not a good start!\nWe did not feel welcomed there, so hard to get our waitress' attention. Food was mediocre for the price they ask for ($28 for a fish clay pot with taste and portion worse than $10 Chinatown one?!?). One star is for their watermelon gin-tonic that served in a whole melon.", "author": "Craig W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "I really wanted to like this place. It is super cute and close by. I got the red beef curry and it was crazy spicy and just didn't taste that good. We also got the the house fried rice and they actually tasted pretty good but they told us it wasn't pricy and it was. I don't think I will go back.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Had a nice dinner with friends here. We got the beef noodle soup, pork rad na moo, red curry beef, yellow curry chicken, and fresh rolls. The food was tasty enough and consistent with American Thai flavors. \n\nTheir spice levels are on the high side, my friends said, but I thought my \"medium\" spicy dish was fairly mild.\n\nService was solid, as was the ambiance. The giant Thai movie posters on the walls were interesting, and it was loud, but not deafening, inside.", "author": "Novelty B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "I've been waiting my entire San Francisco life to say this. I finally found my favorite Thai restaurant in the city! 4.5 stars, so legit!\n\nomg.\n\nSo, we were walking around the Design District and bumped into this place. No wait, Thai food, a welcoming smell of faint fish sauce as you open the door, and recognition on the wall had me interested in less than ten seconds.\n\nHaving been to Thailand (which btw, the food there is absolutely unreeeaaaal!), I often have thai chili and fresh coconut dreams. I can now come to Saap Ver to get my fix. If I had to give the street food in Bangkok a 10, Saap Ver is a very high 7. I love this place!\n\nThe menu is pretty large, I wanted everything. But, between the two of us we started off with jasmine tea, stir fried squid in salty egg yolk, red chili beef, chicken pad thai, and white rice on the side. I also wanted red curry and tom kha soup, but that would a little gluttonous. So, we stuck with three entrees.\n\nThe red chili beef was spicy rich in flavor, so delicious! The squid was super fresh, and you could taste the tamarind in the pad thai (no ketchup used here!).\n\nJust like in Thailand, the food here is really addicting, you really can't stop eating it (nor do you want to). It's so flavorful AND get this: they have \"thai spicy\"! You will never have to ask for hot sauce if you opt for thai spicy. But, be ready for your mouth to burn baby buuurn!\n\nThe service is really attentive, the waiter was super chatty and nice. The ambiance is great too, very much reminded me of the nightlife in Bangkok.\n\n\nI can't wait to come back and try other food. It's \"Damn Good!\" =P", "author": "Shereen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "If you want food that differs 90% of the Thai restaurant.\nThis is the place.\n\nRoasted Pork with Crispy Pork Belly\n   over rice\n   Chinese sausage\n   boiled egg\n\nGrilled Salted Whole Tilapia \n    Lemongrass\n    Grilled Eggplant\n    Thai Spices", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Had a late lunch at Saap Ver Thai restaurant on Sunday with daughter K in S.F. Saap. Ver is actually big for a Thai place. There is a long bar and lots of tables and booths through out. Everything including the menu is decorated in Thai movie decor. There is even a theater movie project as an ornament as you walk in the front door. It was a nice day in S.F. however they left the front door open to save on the air con cost. ***bad***. We were waving flies away from our food during lunch. They were pretty busy for 2:30 pm on a Sunday. The menu is extensive and we ordered the following dishes.\n\nSquid Salad good portions we asked for medium spicy but its really spicy\n\nPad Thai noodles we ordered this after our initial order to combat the spiciness of the squid salad. \n\nGrilled whole Tilapia came with several dipping sauces. The Tilapia was quite large. \n\nDeep fried chicken wings were salty and tasty\n\nPork belly dish was flavored well but the pork belly was cut into tiny pieces and would have been better had the pork been larger. \n\nService was good. S.F. prices $89 before tip. Street parking only and could be a problem with the popular Dumpling Time restaurant right across the street.", "author": "George F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "This is my new favorite Thai restaurant. Previous favorites were Farmhouse Kitchen (which has gotten way too weird, plus their red curry sauce is one-note and used in almost everything) and Kin Khao (which is far away from me, hard to park near, and hard to get a table at), and Lers Ros (I guess I just got bored of it).\n\nMost Thai restaurants in America have just the standard \"American Thai\" menu... you got your 4 different curries with 3 different meat options, your Pad Thai / See Yoo / Kee Mau noodle dishes, and the standard stir fries like beef with green beans... you know.\n\nI'm not Thai, and I'm no expert on Thai cuisine, but while Saap Ver does have the standards, it also has a lot of dishes that I haven't seen before, and when I eat them, they're all very yummy, and a little different -- and more like when I visited Thailand a few years ago. I especially like the street food inspired dishes, which are stylistically different than most of the Thai food you typically see.\n\nMy favorite dish is the Crispy Pork Belly Green Bean, which is heavily seasoned with lots of chili paste, ginger, young peppercorns, thai basil, etc. It's very rich, nicely spicy, and the serving size is generous.\n\nI also really enjoy the look inside this place. It's quite trendy and modern, but in a very Thai way. It reminds me of some of the hip new places we ate at in Koh Samui -- which sure, were touristy, but also really fun.", "author": "Jon E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-24", "description": "Not sure if I just came on a bad day or if it's always like this): I really wanted to love this place, but the experience was a bit subpar. \n\nCame for a late Saturday lunch and it was pretty empty inside the large restaurant. The space has so great decorations! Fun Thai pop culture art and posters up on the walls. They gave a very nice looking bar and a big TV screen playing whatever big game there was on.\n\nMy friend and I ordered the chicken satay appetizer, yellow curry, and pad Thai. \n\nChicken satay was yum!!! Can't really mess this dish up, but it was a great way to start the meal. It came out probably 5 minutes after ordering.\n\n8 minutes after that my curry came out. I thought my friends pad Thai would be out at the same time or soon after, but it didn't come out for soooooo long!!! We had to ask where it was b/c if had literally been another 15 minutes!! I felt bad eating my curry when she didn't have a meal, but it was getting cold and she insisted. Finally here came out and it was missing a lot of things a traditional pad Thai would come with?? No peanuts or green onion?? Interesting...\n\nAnyways, the noodles weren't that amazing. Definitely have had a more satisfying pad Thai. My curry was solid. Both dishes can't with sooooo much chicken which was awesome. \n\nI thought it was a pretty cool spot by looks but I'm pretty whatever about the food. Maybe I'll come by and give this place another try.", "author": "Courtney N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Most people probably come here for food, but my friends and I came for drinks while we were waiting to get seated at Dumpling Time across the street.\n\nFirst thing you notice is the decor. Colorful flags hang across the ceiling and the walls are decked out with movie posters of past Thai movies. You feel like you're walking into a festival! Very possibly the most colorful and unique Thai restaurant I've ever been to in terms of the environment.\n\nI was impressed by their drinks and cocktail menu, which is more extensive than the typical Thai restaurant. They have happy hour Monday to Friday 4:30 to 6 pm and offer a selection of happy hour drinks and small bites. Unfortunately since we just missed their happy hour.\n\nI really wanted to get the Tang Mo Lover which comes served in a small watermelon, but it seemed like a lot of alcohol to drink on an empty stomach, so I opted for something smaller. I forgot exactly what I ordered but it was pretty good. They also have a small wine and beer selection and one friend ended up ordering a sangria.\n\nIt wasn't too crowded when we arrived, even though it was Friday slightly after 6. Maybe half the restaurant was full, and they were able to give us a table for 8 pretty easily.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Rigid Thai and i was so impressed with their interior design! It made me feel like i was sitting in Thai 60s ( i guess)  \n\nAlso i saw they offer catering in the resto, there were a party of ppl had dinner in buffet style. \n\nThe price $$-$$$ but it worth!!", "author": "Tiratiwan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "Food wasnt bad but the service was horrible. Got here during lunch hour and waited for a table. There is a table outside which wasnt occupied but we were not allowed to seated as another party is already waiting. The table wasnt even cleaned for 20 minutes while we were waiting for our table.  Couldn't they speed things up and have whoever is waiting to be seated and order?\n\nGreat!  We got seated. Ordered our food and it should arrive soon as the crowd already died down. Wrong!  First order came out at a responsible amount of time. 2nd and 3rd order took additional 10 mins. 4th and 5th order took another 10 mins. The final order on our table came out after 45 mins of waiting. Other tables that ordered later than us was served before ours. We were constantly asking where is our food. The waitress just said it's coming. They didn't even have to go into the kitchen to verify and can read minds?  They are awesome!", "author": "Henry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "What a great place for lunch and dinner! I'm totally hooked. I came here for lunch in the middle of the week with a friend, and though it was busy, they still had a table ready for us. As we sat and looked at the menus, I marveled at the décor around the room. Neat place.\n\nWe caved into our temptation to order cocktails. Everything just sounded so delicious! I got the \"Damn Good\" cocktail which was just that. Spicy, strong, and damn good. For my entree, I got the roasted duck plate, served over rice with chili vinegar sauce. Would highly recommend. It satisfied a culinary craving I didn't even know I had.\n\nService is fast and efficient here, especially if you're going for a weekday lunch and need to get back to the office. It's not the cheapest place to eat unless you're wanting to treat yourself, but the quality of food and drinks are worth every dollar. One final upside is that they take reservations so you won't have to wait!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Big portions. I'm not the biggest fan of Thai food, but I've gone with friends and they all like it. Reservation not necessary. Service can be a little slow.", "author": "Neil S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Saying this is the best Thai restaurant in the Bay Area is a serious understatement!! Perfectly well lit with modern cultural decor reminiscient of Thailand. The staff here is very kind and efficient and attentive. I ordered the kee mao noodles and the taste was best I've had so far. Also the quantity is more than enough. I will definitely be returning next time I'm in the mission bay SF neighborhood.", "author": "Rocky H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "We were really excited to try Saap Ver today and unfortunately our experience was very disappointing. We waited for 25 minutes for our food and at that point had to ask where our food was. She did say sorry about your food but that was it. We had the pad Thai with prawns ($4 extra for prawns and they literally give you 4 prawns). It was gloppy and didn't have great flavor. We also had the red chili beef which the server highly recommended. It was also mediocre at best. I would not go back.", "author": "Alison M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-29", "description": "I had a great time with my friends eating here last week (because of my friends I was with) but there are definitely much better Thai restaurants in San Francisco than Saap Ver. We ordered almost 10 dishes since we were such a large party (10) but nothing stood out to me, which doesn't say much about their menu. They have a wide selection of food, but all the food is just meh. \n\nI really couldn't stand how nosy the place was. I really dislike eating at places where you have to yell across the table or even to the person next to you. \n\nDishes were expensive and not large portioned.\nThe customer service was bad. The drinks and dishes eventually come to you, but you may have to wait awhile AND ask a few times if they remembered. I guess the only plus is that there is alot of parking in the area since it is a new developed area of SF, but if you want good thai food, go to Farmhouse Thai, Lers Ros, or Marnee Thai. Those places are worth the drive and looking for parking just because of the authentic quality of food you get.", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "This is a long over due review. \nSooooo delicious, great interior and friendly service! \nRandomly stop by this place for a quick dinner\nWe all got surprised with overall quality and experience. \nFirst step in the restaurant was like, wow... Classic vintage cool interior! Is it gonna cost me $$$ to enjoy this dinner?!?\nWe had BBQ pork cheek, papaya salad, grilled salted whole tilapia, and Tom Yum soup. ALL dishes are so good and flavor was spot on. \nPrice tag is fare at the location. \n\nI would come back if I'm in the neighborhood again.", "author": "JustinE Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Saap Ver is my go to restaurant for authentic, inexpensive and delicious Thai cuisine. I've lost count of how many times I've eaten here since it's affordable and in the neighborhood. The place has a lively and festive feel to it, decorated with colorful banners and posters. There's a bar that offers happy hour specials too. Food gets a 4.5 from me, but my experience overall is negatively impacted by the inattentive and sluggish service (or sometimes lack of). \n\nMost entrees on the menu will run you about $12+ depending on what kind of protein you get, such as tofu, vegetables, chicken, pork etc. The larger and more special dishes are around $25. If you're ordering off the chef's special section make sure to ask how long it'll take. I once had to wait over an hour for the Grilled Salted Whole Tilapia Fish (more like family style entree) and really wish the waiter could have given me a heads up. I've noticed recently that the lunch offering is a smaller portion of an entree and side of rice for $12, and $15 if you add an appetizer.\n\nGenerally you can't go wrong with most options on the menu. They have it all, such as soups, rice dishes, meat dishes, noodles, etc. Portions are large. \n\nI remember not liking the blue river prawn chef special, it was unappetizing and pungent. I'm also not a fan of the pad thai, it's definitely not their best dish surprisingly and a bit too sweet in my opinion. I can vouch for some of my favorites though!\n\nService is consistently not great at this restaurant unfortunately. I recall countless times I've had to flag down waiters for pretty much everything, from ordering food to paying the bill and even getting seated. This tends to happen when the restaurant is not even that busy. At least the food comes out quickly to make up for that. It's kind of a shame though, would feel like if the service was more efficient and customer first, the business would operate faster and more effectively.\n\nMixed Vegetables - Delicious black bean sauce and done pretty well.\n\nChicken & Rice - I remember liking this one a lot. Comes with chicken broth!\n\nYellow Curry - Generous amount of protein, and flavorful curry made from scratch. Lately it's more watery and I recall it being thicker which I'm not a fan of. The flavor keeps me ordering it though.\n\nPad Cashew - Can't remember exact details, but liked this one as well.\n\nChicken Noodle Soup - Delicious broth and super filling!\n\nBeef Noodle Soup - Was recommended by a waiter. Broth is very aromatic and yummy.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Great vibe for a Friday night dinner and delicious food! \n\nWhy I was here // I came here with a party of 4. All hungry and ready to start the night off with a good meal, we came around 7pm and it was pretty busy but we got a table.\n\nParking // They had some spots in front of the restaurant, but mainly it's all street parking. Gets pretty busy in the area, but parking is findable \n\nAtmosphere // Flashy and colorful! Rainbow flags line the ceiling and photos of old fashioned Thai movies/media culture line the walls. This place also has a disco ball. \nMy only issue is that while we were there, the same song played on loop for like 30 minutes, it was \"Closer\" by Chainsmokers. Literally all 3 of my roommates were dying from hearing this song on replay...it was kind of funny. You should have seen us when the song changed, boy it was a party. \n\nService // Honestly it's kind of hard to say if it was great service or not. They took a really long time to come and take our order. Our waiter was super nice and he was funny, but he got one of orders wrong and he didn't check up on us too often. Maybe it was because it was peak dinner hour and they were just really busy....\n\nFood // Overall tasty, but just a few irks...\n-I will note that I was really grateful that they came to refill our water/ would at least come when we called them over. \n-thai iced tea // 3.50 // Personally it was a bit too sweet, but made a nice compliment to the meal\n-choo chee goong nang // 18.00 // blue river prawn, creamy coconut curry, kaffir lime leaf // This was absolutely delicious, flavoring was superb, HOWEVER, I think our shrimp was a bit too underdone for our taste....It didn't have that firm cooked shrimp texture, because I think it was still a bit raw in the center, we should have sent it back to be cooked a bit more, but we already started eating, so we continued (bad decision on our part, not the restaurant)..luckily my bf and I didn't get sick.\n-Pad see ew beef // 12.00 // flat noodle, chinese broccoli, egg, soy sauce, and beef // Pretty tasty pad see ew but nothing crazy. Granted the price is decent for this dish and in line with all the other places I've been to. \n-Ginger garlic rice // 3.00 // This was REALLY good! Went well with our curry and had excellent flavoring, definitely worth the extra dollar. \n\nOverall, I think the flavoring is very authentic and maybe if our shrimp was cooked and they were a bit more attentive (faster service/ didn't mess up our order), this place would have been  5 stars for me.", "author": "Emily T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "I've been here several times now and really enjoy the food. Prices are good too as they give pretty large portions. I've tried the pad lee mao, saap ver fried rice (pork belly), pad thai, green curry, and tom yum noodle soup. Everything has been delicious. The saap ver fried rice in mild is very spicy though, so be careful if you can't normally handle spicy. \n\nThey are usually less busy before 7 pm so I haven't needed to wait for seating but it does get pretty full. They also have a promotion going on where if you post on IG/FB with their hashtag, you get a free thai iced tea.\n\nOverall 5 stars as it's definitely my favorite Thai place in Soma and now a go-to spot for dinner.", "author": "Sophia H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-12", "description": "I came here with a group of friends  around 11 today and the food was very good Maybe they change head chef? We ordered pad kee mao, pad Thai and glass noodle. Definitely coming back here again. Thank you for such a delicious meal.", "author": "Aniko N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-23", "description": "When I walked in, I was super impressed. It's really well decorated with old Thai newspaper clippings, ads, etc and gives it a really unique vibe compared to your normal Thai restaurant. The decor is really cute, there's a giant TV, and a large bar. During Warriors season, this is def going to be a little secret spot to watch the game without a lot of crowd. \n\nHowever, I was disappointed with the vegetarian options and the food itself. \n\nThere's plenty of options and not just your usual pad thai and red curry, there's a ton of stuff I haven't heard of before. However, there weren't a TON of vegetarian options, and I'm pretty sure that even those probably had fish sauce in them and stuff :/ \n\nI ordered the cashew tofu and it was really, really bland. I had to douse it with some sauces... quite disappointing since it almost tasted like some random cheap takeout. it also took a while for the food to come out. \n\nThe prices were reasonable..$12 an entree.", "author": "Aria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "This place is my new favorite Thai restaurant. The decor is fun and vibrant, the staff are always nice and welcoming, and they have a full bar. And that's not even the best part. The food is top notch. I have to say, I LOVE Thai food so I eat it a lot, so trust me, you must eat here. \n\nIn addition to the standards (Pad Thai, a selection of curries, etc), they have some interesting and unusual dishes. I'm making it my mission to try everything on their menu because I like it so much. Some standouts are the stir fried cabbage (so simple, yet SO delicious) and the rice salad with sausage. The rice salad is a nice variant on the spicy/limey/sweet/salty salad, but with a nice textural addition of the crispy rice. My mouth is watering just thinking about it. \n\nCome. Eat. Enjoy!", "author": "Phillip H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Thai sausage crispy rice salad. It's my new mantra. Say it with me. Then get it and experience scrumptious tart umami crunchy bliss.\n\nSo frickin' delicious. Love the authentic style - this isn't your average takeout Thai.  The flavors are much more pronounced, and the variety on the menu surpasses the boring satay and curry offerings. That said, the red curry? Pretty damn good. Yay for unique Thai offerings!", "author": "Archana P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-18", "description": "Saap Ver SF just sold their liquor license. No more wonderful exotic cocktails.  They also paired down what used to be a nice, creative wine selection to a few cheap choices that you'd expect at Applebees. \n\nFood is still good, but it's such a sad shadow of what it used to be. Going to be looking for another Thai go-to restaurant. Done with Saap.", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "Good basic Thai. This is our go to spot for Thai food - which is probably because we live across the street but still yummy none the less. Fruity drinks are always great and I tend to go for the pad see ew or crispy chicken fried rice. Beware those who do not like spicy foods - they aren't kidding when they say spicy. And if you're someone who loves the spicy stuff, be careful as well! They'll go all out trying to make it fiery hot if you ask for it.", "author": "Leina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Thai food is hot. I got a fried pork salad and it scorched my mouth. They gave me a complimentary Thai tea because I was crying. Curry was good. \n\nThe fried sardine plate was not good. Unless you like fried sardines. Then maybe. It comes with fried eggplant and steamed broccoli. I was confused.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "Saap is awesome! Be adventurous and try out everything on the menu!\n\nChef Kobe is amazing at what he does and he brings the taste from Thailand to San Francisco.\nSteven really knows how to run a restaurant and makes sure you are taken care of; amazing service. \n\nSaap is great for after-work drinks as well. Sun-dried beef jerky makes for a great snack at the bar while sipping on Singha beer.\n\nWith so many choices - it's hard to pick one, but if I were to give one of their dishes a try, it would be their fried rice with crispy pork belly. Their fried rice is packed with flavor and the pork belly is super crispy. (Pair this with a Thai ice tea and you're GOLDEN!)", "author": "Sam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "I must be honest and say that the lower Yelp reviews for Saap Ver has made me hesitant to try this spot for the past year...until a friends persistent reco a few weeks ago. And boy was I wrong to stay away from Saap Ver til now! \n\nThose same friends and I went to Thailand last year, and we've been craving legit Thai street food ever since. And I'm not talking about the watered down curries and pad thais that every other Thai restaurant serves in this city. I'm talking about the spices, the layers of flavor, the genuine uniqueness of this cuisine. And Saap Ver has that down to a tee. \n\nDecor - reminder of all the fun, street style of Thailand (without the dirty street feels)\n\nWait staff - first visit really disappointed me. My friend had to apologize to me several times saying she'd never seen the restaurant that busy before. Our waitress didn't bring us our menus for a while. Or water. And forgot the main dish we order...the salted fish, which takes a bit longer to make. To be fair, they were catering a 20+ bday party, plus everyone else that night. It did seem busier than usual. \nWhich is why I decided to give them a second chance. The second visit was the best! The waitress was attentive, informative, and extremely friendly. The restaurant was also a lot less busy that night. \n\nFood - the star of the show! Dishes I tried were the whole grilled salted fish (twice), Tom yum seafood fried rice, papaya salad (mild), and the Po tak soup. Get the salted fish!! Don't walk. RUN! It's that good. I'd go there just to eat that if I had $29 to drop on a whole fish every meal. Seriously though, get the fish. No regrets. \n\nSince the reco a few weeks ago, I've been here two times. The first visit was unfortunately an overall 3 star experience, but I was willing to give it another try. The second visit was fortunately an overall 5 star experience! Here's 4 stars to hoping that they can staff up or learn to roll with the punches better!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Came here with a friend and got seated down immediately.\n\nWe ordered three dishes and shared them all. Do this because, honestly, trying more of their food is a good idea. Favorite was definitely the green curry we ordered. They also give rice with it, which is nice, since I have been to Thai places that make you order the rice with it.\n\nAnyway, it is a great place to come for Thai food. There isn't really parking near the area.", "author": "Paulina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-23", "description": "The place is loud, the service was slow, but the food is pretty good and largely portioned. There is plenty of seating, edgy and loud decor, and several large monitors for playing march madness recaps.\n\nMy friend got a medium spicy shrimp dish and ended up feeling dizzy, lightheaded, and allergic from the spiciness. That's when you know it's good stuff. So if you like spicy, this is the place to test your levels.\n\nOur chicken wing appetizer had hella garlic flakes and was pretty good too but I'm not a huge fan of that burnt aftertaste so might not get that again.\n\nThe pad see ew I got was pretty good, not as much chicken or egg as I would have liked, but great flavor that wasn't too salty or sweet I was able to bring a bowl back as leftovers. Wish they had more veggies in it that weren't bitter-tasting from being overcooked. :/", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Awesome place. First of all I'm Thai. I love this place and this is the first time that I visit SF. The food is 100% authentic Thai food. If you expect to try real Thai food! JUST COME. Look at my photo and order from them. Highly recommend !!", "author": "Meenarin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "Nice Pad Kee Mow Chicken. Well spiced, service was good. Ambience is pretty cool too. Decent overall.", "author": "Dhruvil B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "I'm so glad my brother recommended this place!  I have eaten a lot of Thai food in my life and the food here is amazingly delicious.  This place is best enjoyed with a large crowd, so come with a group!", "author": "Marnie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "Placed an order on Uber Eats, they accepted it. After an hour of the ETA getting more and more pushed out, I called them several times. They answered on the third try and told me they just saw the order and it would be another 30 mins before the order arrived. I couldn't wait bc I had to leave for the airport. Extremely disappointing experience and they seemed to be laughing about it on the phone.", "author": "Ted M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "Been back two more times. \nHad the rad na the second time and it was okay, not bad.\n\nToday we went for lunch, and THOUGHT we got lucky by ordering before a larger party but food still took awhile to get. \nI'm always a sucker for noodles, so I ordered the wonton noodle soup, I KNOW I KNOW. wonton noodle soup at a thai place? \nDon't do it, the soup was super bland and peppery.\nHot sauce couldn't fix it, I needed fish sauce or some hoisin sauce. \n\nI shall pass on this place.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Amazing food, kitchen & service run like a well oiled machines. Minus one star because slightly overpriced IMHO.", "author": "Claire R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "Overly sweet and way too spicy.    My friend had the pork with salad, but the salad was just iceberg lettuce.    My Chicken with basil was way too sweet and overly spiced.   Won't be back", "author": "Mark K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "TLDR - Solid Thai restaurant, very reasonable prices, some regional dishes, lively vibe\n\nNot your typical Thai restaurant. Saap Ver has more of a lively bar vibe that was reminiscent of the nightlife in Thailand. Retro decor. Casual, energetic ambiance.\n\nThe menu is very extensive here, like most Thai restaurants, and can be a little overwhelming. Unlike other Thai places I've been to, they have some more regional dishes that I don't normally see on menus like khao kha moo (five spices pork leg). The prices are very reasonable here, especially given it's SF, and they don't skimp on portion sizes to compensate. \n\nWe ordered 4 dishes between the 3 of us and it was more than plenty. I found the more \"American\" dishes like pad thai and curry to be disappointing while the less commonly ordered som tom and BBQ chicken tasted more authentic in flavor. I'd come back to try more of their regional dishes!\n\n* SOM TOM GRILLED PRAWNS ($13) - 4.5/5\n[green papaya salad, chili, cherry tomato, green bean, ground peanut, grilled prawn, fish sauce]\nVery well balanced papaya salad! Spicy, acidic, salty and sweet - just like in Thailand. My only disappointment was that there was literally just one grilled prawn, sliced into two halves.\n\n* BBQ CHICKEN ($12) - 4/5\n[thai style bbq chicken with sweet chili sauce]\nSolid. Came with 4 large pieces of chicken - 2 drumsticks and 1 thigh cut into 2 pieces - served with a sweet chili dipping sauce as well as a salty/fish chili dipping sauce. The meat wasn't the best I've had in texture and was a little dry at spots, but the skin was crispy and it was a generous portion for the price.\n\n* PAD THAI HOR KAI ($16) - 3/5\n[egg wrap pad thai - pan-fried rice noodle, prawn, peanut, bean sprouts]\nDisappointing. I had this in Bangkok and haven't seen it anywhere in SF except Saap Ver, so I was eager to try it. I honestly wasn't expecting it to be anything like the one I had in Bangkok, but their pad thai really fell short. The noodles were too chewy and stuck together in clumps, and the flavor was too sweet.\n\n* YELLOW CURRY WITH BEEF ($12) - 3/5\n[curry powder, turmeric, coconut milk, potato, carrot, yellow onion]\nStandard curry flavor. We got ours medium spicy but it tasted very mild to me. The potato, carrots and onion were tender soft, but the texture of the beef was tough and chewy. Felt like cheap cuts, but at least they were pretty generous with the amount of it. Maybe go with a different protein, but nothing special about the curry itself.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "Oh my gosh! This place is amazing! ....the minute we walk in, the decor, the menu, the foods, the friendly staff, the music, the list goes on!  \n\nI'd have I say....it's very authentic here....some of the dishes taste even better than when I had them in Thailand....namely \"the papaya salad - with blue crabs and pla-rah\" (\"pla-rah\" is a fermented fish that's very prominent in eastern Thai cuisine).  It takes an acquired taste ...super-delicious if you've been to Thailand and have had papaya salad there, you'd know what I'm talking about. and this place has it done just right! The secret is in the sauce, says the owner! We had to come back for dinner again within days, because we were so impressed!\n\nThey have specialty dishes like the whole fish grilled with crusted salt....whaaaat?!?! Delicious and tender and comes with 3 types of sauces for dipping. (Be sure you can handle a whole fish if you order this dish, it's humongous!) \n\nYou should try their grilled bananas for desert...it's almost like salty caramel bananas, sliced thin and grilled....but with coconut flavor in it.  The owner said they used three different types of sugar to sweeten it...don't worry, they're all natural sugars! (No sweeteners)\n\nMake sure to ask for the specials of the day, we had curry crab last time and we had to take even the left over sauce home...haha...\n\nGo have yourself a good authentic Thai foods and brings family or friends!  so you can have more variety and share some of the most delicious Thai foods you'll have in a long time, guaranteed!", "author": "Issy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Yum yum yum. Authentic Thai food. It's a bit more than your regular Thai fare, but worth it. Good service too. A go - to for my BF and me.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-02", "description": "I have a few complaints about Saap Ver. The service is pretty bad overall, if you run out of water don't plan on getting a refill any time soon. 3 of the 4 times I've came for lunch, the waiter/ waitress has gotten the orders wrong which led to long wait times to get the correct meal. The pricing is over the top compared to other Thai restaurants in the area. $14+ for any dish that is not an appetizer. Also the menu doesn't make sense in terms of the pricing for certain items like tofu pad Thai. They only list the pad Thai with prawns which is $16. The portions have also been pretty inconsistent; it's either pretty small or somewhat acceptable. The owners of this place need to reevaluate their business.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "I love love love this place!\n\nthis place is not typical Thai restaurants that you commonly see everywhere.                          \n\nthis is Isaan Thai (Northeastern Region of Thailand) that is similar to Laotian Cuisine.\nbold, spicy, pungent, shrimp paste, grilled meats, raw vegetables, and sticky rice.\nbetter than the southern style Thai food that you're familiar with.\nthis place is definitely one of the best restaurants I've ever been to in San Francisco.\ngreat food, lively place.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "I used to have only 1 favorite thai restaurant in the city and that was Ler Ros. Now I can say I have 2. My benchmark for \"authentic\" Thai is measured by the papaya salad. I never loved Papaya salad until I visited Thailand and now I am obsessed.\n\nA good papaya salad to me has to have the perfect combo of crunchy green papaya, tangy lime, salty fish sauce, spicy thai chilli peppers, and sweetness from the sugar. \n\nI've tried the crab papaya salad at both Ler Ros and Saap Ver...and both were utterly delicious. A must-try.\n\nAnother dish that I really haven't been able to find done well anywhere (except for my home town in Boston) is the Tom Yum noodle soup. This is made with ground pork, ground peanuts, in a spicy/sour broth with rice noodles. I will be coming back for this! \n\nMy friend's go-to dish is the 5-spice pig leg (cut up into pieces not whole) on rice. It comes with this spicy side sauce that you should taste before you drench your plate with it. It's FIRE. This was also a very tasty dish.\n\nThere are so many more dishes I want to try. Took a peek at dishes on other tables and everything looked really good.  The dipping platters especially look interesting.\n\nThe decor is so fun. It's decorated like a Thai movie theater with faces of Thai stars as the wall paper.", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-16", "description": "Cool atmosphere and tasty food. Not enough bar staff though...silly mistake that management can easily fix", "author": "Jess G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-11", "description": "I went here for the first time with a friend today after hearing pretty rave reviews about the food. That said, we received fair warning about the less than stellar service. On a Saturday evening around 6:30, the restaurant was fairly busy. It was definitely a party atmosphere with karaoke and singer songwriter group, not to mention the Hornitas girls walking around offering free shots. We were sat right away, but a server did not come to our table until ten to fifteen minutes after we had already decided on our order.\n\nMy friend and I ordered the som tum with grilled prawns and the steamed chicken with ginger rice. The chicken dish came out first. The chicken was plated messily and there was a piece that was too rare for our comfort. The sauce that this dish comes with is spicy and delicious, however. My previous experience with kao mun gai (sp?) is with a delicously oily and shiny rice. This rice was not like that, but served its purpose. My friend and I were starved, so we polished this off.\n\nThen, we waited. And waited for the som tum. We were reassured it was coming, but we had to ask a couple times for the dish's status update. When it finally came, I was disappointed to see that there were only two prawns on the plate and even more so when I bit into the one I dished up. It was pretty soft and I actually questioned if it was cooked all the way through. Asides from this though, the flavors were good and the medium spiciness we asked for was quite spicy.\n\nAsides from the initial lapse in attention from our server, the service from pretty much everyone else in the restaurant was pretty good. But all in all, Saap Ver is pretty close to greatness, but not quite there with seamless service, entree timing, and cook temps. Solid option for Thai if you are in the area though if you care to take the risk!", "author": "Jung-In S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "A solid option for Thai in the mission bay/Potrero hill area. This place is pretty big inside, wide open space so it can get a little loud at times. As far as the food it's good, I enjoyed it. Got the pad see eww and it was definitely one of the better ones I've had in the city. The appetizers were ok, pretty stand for most Thai joints. While I was here they had durian wth sticky rice on the menu for dessert, I've never tried durian and decided to try it. Well I now understand why people like it or hate it, I'm of the camp that it's not for me. While i didn't like it, I liked that they had it on their menu to try because very few places would serve it. Service here was fast and friendly and I would definitely go back if I'm in the mood for Thai", "author": "Peter P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-24", "description": "Meh. Food wasn't great. Service sucked. My husband and I got the Crab Fried Rice and Green Curry. Crab Fried Rice was not flavorful and oily. Green Curry was unflavorful and was probably one of the worse curries I've had. How is this place a 4 out of 5 stars?", "author": "C O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "This is my favorite Thai spot in sf. The staff is Thai--even the bar instructions are all in Thai. They use quality ingredients in both their food and drinks. Cocktails are bomb. Not too sweet, balanced flavors.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Spicy tom yum soup!! Don't understand how this place only has 3.5 stars. One of their other noodle soups is really good too!\n\nAnd their saap ver drink is delicious, more spicy than the spicy tom yum soup haha.", "author": "Cal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Most of the food was good, except for the pad thai wrapped in an egg omelet, the noodles were bitey, like it wasn't cooked long enough and was hard. Not good since the dish was $18, expensive for pad thai in my opinion. Service was good, I did enjoy the Issan sausage. Probably won't be back.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "I only go to two Thai places in the city recommended from my Thai friends and this is one of them. \n\nWe ordered the Sea Bass Clay Pot Dinner for $25. It was delicious. Fish was cooked perfectly. Also ordered the Cripsy Pork Belly Green Bean Dinner for $16. Pork belly had a nice crisp to the edges but super tender elsewhere. Also had good heat to it so was loving that.\n\nExcited to keep coming back and trying everything on the menu. Haven't gone wrong yet!", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Been here twice for bday parties & really loved the food! You know it's a good sign when you walk in & see a big contingent from the local Thai temple eating here.\n\nShrimp rolls, pork belly, larb ( spicy!!!), som tum, crab fried rice, curries all faves.\nTasty tofu & veg options for our vegetarian friends too.\nCoconut ice cream was rich & decadent. \nFull bar w friendly bartender, the owner came & had shots a us. They get very busy on weekend nights but it's worth any wait ( and parking in this area is actually decent!)", "author": "H H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-17", "description": "I rarely feel compelled to review a place so soon after eating, but this place made me want to for the wrong reasons\n\nMy main complaints, in summary, are poor value/portion size and problems with the food quality.\n\nI usually walk by this place and it tends to be busy and lively every evening, so I thought I'd check it out. I ordered two things here, some grilled pork shoulder and crab fried rice. The crab fried rice had disappointingly little crab and little crab flavor to it (compared to say Farmhouse Thai). The grilled pork shoulder tasted good, but very little was provided. The pork came with a tasty sauce, however, as I poured it out I noticed a strange lump. When prodding this lump, it popped and revealed itself to be a mass of undissolved/unmixed rice powder (see photos). Pretty unappetizing, and suggestive of corner cutting/not much care being put in.", "author": "Neal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "The best and most authentic Thai food you can get in the city. The decor and ambiance is awesome but the food is even better! There are items here that cannot be found at other thai restaurants.  \n\nSome of my favorites were the Raw crab salad- YES it's RAW and it's delicious and sweet. They load it up with garlic and thai chilis.  \n\nWe also had the Larb Fish which was also very delicious. This is a fried whole but what's nice about this dish is that they dice up the fish meat for you!\n\nWe also had the curry crab which was very flavorful. other dishes we had were the bloody clams, papaya salad, tom yum soup, and scallops. I will definitely be back!", "author": "Emi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Great Thai place with just an unique modern fushion atmosphere. Menus selection is quite nice! I often get togo orders here and they're always super fast. Although the quality isn't always consistent. My first time getting their Pad See Ew was amazing but the most recent time tasted like the chef forgot to add salt. So just keep in mind that this place might be a hit or miss.", "author": "Mandy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-20", "description": "The restaurant is very nice but no air-conditioner in day time (I have been there around 2pm).\nThere are some fly around my thai food all the time.\nThat make me annoyed.\nChicken overrice is not recommended because chicken is tasteless and very hard. But I would recommended some spicy thai food such as crab salad, cooked cockle", "author": "Katthy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-29", "description": "Had high expectations because I heard this was authentic. The food was luke warm and tasted a bit off - hey maybe I'm just not used to \"authentic Thai food\". Overpriced and underwhelmed.", "author": "Adriana R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-17", "description": "Most of the food is good, but never get the meatballs, which are like tire rubber.\n\nI'm a frequent customer -- at least 3x per month. They get my order wrong about 50% of the time. Usually it's a recipe change (I'm allergic to mushrooms, STOP adding mushrooms to recipes) or inconsistent spiciness level (\"medium\" varies between 100 and 10,000 Scoville units). Sometimes they forget an item, and frequently they don't notice my Eat24 order until I arrive 15-25 min later to pick up the food. I wouldn't order ahead if I knew I'd still have to sit there in the restaurant. I'll order somewhere else next time.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "I was hoping to like this place a lot. The service has been nice. The has been hit or miss. Had a squid dish with great flavor but was over cooked some. I did generally like it. I ordered the whole fish Larb and got just whole fish. It was good and the sauce were great. Just the wrong item. The Larb wonton didn't have a whole lot of Larb Flavor. The Chili beef was different with a sour heat. I liked that quite a bit", "author": "Dennis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "What a surprise this place was! The menu features more authentic dishes than others with a festive street food and cinema vibe. As my husband said, \"Saap Ver is unapologetically Thai and I love it\" which means their spiciness and flavor intensity does not compromise for the masses but their name lives up to it - damn delicious. Their service can be slow because they lack bussers and runners...but they comped some thai iced teas for us which made up for it.  Everyone smiles and are very friendly. \n\nThis is what we recommend so far: Thai sausage crispy rice salad, Spicy TomYum noodle soup (I can literally get a bowl just for myself - it's that good), whole fish dish (any), Thai style BBQ chicken, durian sticky rice.\n\nDishes you can skip: Crying Tyger (nothing special, really) and the pad thai. \n\nQuick tip: Make a reservation during peak eating times. Otherwise you can easily snag a table later or much earlier. Street parking is somewhat plenty.", "author": "Johanna P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-19", "description": "Really disappointing. I'm no cheapo, but it was really overpriced for the portions we received and the quality of the food. And I guess I'm getting old because the music was stupid loud for my taste, and the tables were too close to each other.", "author": "Angela R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "I like to order my Thai \"Thai hot,\" or Level 5. It almost always disappoints, with a few memorable exceptions: Sabuy Sabuy II on San Pablo in Berkeley and Ruen Thai in Roseville. My idea of hot is nose running, throat closing, night sweats--you get the picture, a general week-long burn. At Sabuy Sabuy II (which used to be called something else, was it Plearn?), I insisted on Thai hot and the server rolled her eyes all the way back to Thailand. I'm all, bring it. The burn was incredibly fierce--like stop on the way home to get milk to drink immediately-fierce, almost inedible. You know how I likes it. Ruen Thai is less inedibly hot, but still well seasoned. \n\nSV is my neighborhood Thai spot, I practically live on top of the place. It's the sort of unsuspecting strip mall restaurant that you relish finding - the proverbial hole in the wall--the third Thai restaurant I've found that knows how to do stupid hot. A diamond in the rough. \n\nI think SV is the best Thai food in San Francisco, bar none. Of course, like everything, that's relative. I hate to complain, but this city's Thai offerings underwhelm. The east bay's Thai selection is sooo much better. And Sacramento kicks the east bay's ass. I've actually been to an incredible place in Modesto? I digress.\n\nOne night I ordered Pad Thai on the Yelp app for pickup, Thai hot, no bean sprouts, add tofu, add beef: a joyful carbo-load. Yes, I know that Pad Thai is the spaghetti of Thai food, but hear me out. This dish is a good barometer for measuring the tastiness of  your Thai. It's like vanilla ice cream, I'm most impressed when that is done well, and it's almost never done well anywhere. The Pad Thai at SV was the best I've had anywhere, ever, period. And it was soooo hot without compromising the other flavors of the dish. \n\nI've had a good portion of the menu by now, naturally. My favorites include the red curry, Pad-khee-mao, Pad-see-ew, Pad-see-you? I've not had anything bad here, everything is delicious and authentic. The one time I've dined in with my sister, no one spoke English. The bar is very interesting. I like to people watch there. The service is great and super fast. \n\nVery special. Happy face.", "author": "Sunny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Such a hipster nice, cozy and comfortable place. The food and its presentation are superb. Authentic local\ndistinctive Thai food, all should try!", "author": "Max B. K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "I probably come here once a week because its that good (I also live very close which helps). Anyways, this place is awesome! The atmosphere is fun but relaxed; great place for a group or to sit at the bar and watch a game. Before coming I was not the biggest on Thai food but this place changed the game for me as you can select the spiciness of your dishes (they always ask mild, medium or hot). I started at mild and am now working my way up to hot! I've tried a lot now and it's  all good but my staples are: 1) Crispy prawn rolls, 2) samosas (very different but bomb), 3) Ka pow chicken (medium), 4) crab fried rice (omg so good)! The Thai milk tea is really good too. Their new cocktail menu is small but good. They have a couple of drinks that are served inside fruit and you can watch the bartender carve out the center of the pineapple when you order. All in all, highly recommend!", "author": "Kendra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "If you are looking for an authentic Thai food, then this is the right place for you. They have a full bar serving you lots of great in-house cocktail. This is a place for everyone. It has a nice decoration. \n\nI came here on Sunday night. There were 15 tables at that time. Tge food came out fast. I went with one of my friends. We decided to eat Northern food and Northeastern food for this meal. We had Salt-crusted Grilled Fish, Somtum Pu Plara (Papaya Salad with Salted Crab), Spicy Blue Crab Salad, and Grilled Pork with Thai Spicy Sauce. For dessert, we had roasted banana. For drinks, we had 3 cocktails and a Thai beer. \n\nSalt-crusted Grilled Fish 4.5/5\n-It serves with 3 small sides; Northern Thai Green Chili Dip, Thai Spicy Sauce, and Thai Sweet Sauce. Northern Thai Green Chilli Dip is probably the best when eating with this meal. \n\nSomtum Pu Plara (Papaya Salad with Salted Crab) 3.5/5\n-The taste is great but the the sauce is too little, so the taste didn't really compliment the raw papaya. Papaya is a bit too hard for my taste. \n\nSpicy Blue Crab Salad 5/5\n-This is my favorite! If you like Thai Salad, then go for it. \n\nGrilled Pork with Thai Spicy Sauce 4.5/5\n-The grilled pork was so juicy. It could have been better with the better sauce. \n\nRoasted Banana 5/5\n-I never have this kind of taste in Thailand before. It was unexpected delicious. It is far better than anywhere. \n\nLeo Beer 5/5\n-Surprisingly, they serve it! It is a to-go beer for any Thai people. \n\nTippsy emcee 5/5\nIt is spicy! and it is damn goood. \n\nSaap ver dam good 5/5\nThe best of the best! One of my favorite cocktails of all time. I had two of them. The smell of them were incredibly good as well as the taste. You have to try them! \n\nService 5/5\nThe service is great. I didn't have to wait for long. Servers are nice and friendly. They took care customers really well. \n\nSpace 5/5\nLove the decor. They have lots of small square tables, long table,  and long bar. It should be a good space to throw a party! \n\nOverall, this is a Thai restaurant that you must pay a visit once you are in San Francisco.", "author": "Paris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-13", "description": "I MUCH prefer Lers and Farmhouse for comparable Thai; food came out slow but maybe because it was the grand opening?\n\n* Pad thai in crepe - decently flavored, saucy pad thai. Have had better.\n* Fried rice with pork belly - Very tasty, very spicy. Loved the super crunchy pork\n* Pork plate - Strips of pork were very dry, veggies were from frozen; but I liked the pasty sauce -- too expensive for what it was.\n* Duck salad - Very small, good but standard\n* Papaya salad with crab - Very fishy... crab shells, but no actual crab. Confused.\n\nRecommend ordering their famous for fried fish which takes 40 min", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "I am a big fan. This place is awesome.  First just the ambiance and the whole place is screams cool stylish Thai people. It has this retro, thai western movie vibe to it. It has the menu on the movie theatre style sign and the wall paper is all thai movie posters. Even the chairs are vibrant and different. The place has a full bar, and one time I went they had live thai music. (Thai musician singing in thai but western style).  Service is also so friendly and excellent. They take really good care of you. There's a ton of wait staff. \n\nThe menu is full of delicious things: chef's picks, apps, curries, salads, noodles, noodle soups, etc etc. There is also more northern style dishes which is different from a lot of places. They also have happy hour 5pm -7pm and some apps are $6, and drink specials. \nEverything we've ordered has been excellent, flavorful, and medium spicy is pretty spicy. I find myself sweating while I\"m eating but loving it because it's so flavorful and delicious. \n\nThe one complaint is that we ordered chicken wings.. and you know how chicken wings usually have those like two bones? Well the chicken wings came and it seemed like they broke the regular chicken wings into two pieces and called each separate bone as a \"wing\".... check out the pics. It was sad... Still delicious but sad. \n\nCool part is that it's in a part of town where there isn't a lot else going on during dinner, so parking is really easy. Win!", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "I've been here three times. The first two times everything was fantastic. The third time it felt like a completely different restaurant. The pad kee mao had almost no noodles and was mostly under-seasoned stir-fried vegetables. The pumpkin curry was similar--mostly soggy vegetables with a small portion of very watery curry sauce. There was also a large chunk of shrimp paste that hadn't been mixed into the sauce. Nothing like our first two visits. Very disappointing. Still giving it three stars because the service was good I'm hopeful that the food was a fluke.\n\nEDIT: just learned that they have a new chef, so I suppose it's not a fluke.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "Sometimes the waits are long, but it's worth it. Some of the best Thai food I've ever had. Lately I've been enjoying the ka-pow chicken with brown rice.", "author": "Ron B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "Pretty good, nice place, good energy. Food came quickly and was what I expected. Got pad Thai, sausage, and Tom yum. All decent", "author": "JJ W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "My friend from Thailand recommended this place, and this place is authentic. \n\nSome people said things about the servers not being attentive, I think they're fine, you just need to be a little more proactive. They are nice though. The place is nice to eat for dinner as well, and good to share.\n\nI would definitely come back because this place has authentic food that sometimes you don't find in other thai restaurants in the city.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Saap ver deserves 5 stars had the food not been so salty. Overall, I enjoyed the feel of the place, amount of food, quality of food, cleanliness, attentive staff (but maybe it was because most of the tables were empty at 8 PM on a Wednesday night). \n\nprice was very reasonable. Three of us spent $17 each on three dishes to share and we finished everything! It was perfect amount of food. \n\n1) papaya salad with crab (way too salty, otherwise tasty!). The spiceyness opened our pallet. I suggest for you to ask the waiters to make the salad less salty. \n2) pumpkin curry with chicken. Wow, delicious! Pumpkin was cooked perfectly as it wasn't too soft (smushy). We also ordered one jasmine and one sticky rice. One came in a traditional bowl and another in bamboo basket. \n3) BBQ pork noodles with wonton. This dish tastes more like a noodle dish from HK. The soup was flavorful without being heavy.", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Good food, good beer. I asked for medium spicy and it put a hurt on me. Got to work my way up for spicy.", "author": "Gordon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "The most authentic Thai restaurant in SF. \n\nIf you're after good quality Thai food that actually tastes the way it should, then look no further. \n\nThe Kana Moo Krob here is one of the best I've had, it's definitely the best I've had in the USA. So far every dish I've had here was spot on in terms of flavor and ingredients. \n\nMost Thai places in the USA have adapted to the local palate and the dishes have been so dumbed down it's basically the same sauce for each dish. Not here. The best way to judge a Thai place is on the Pad Thai and this restaurant nails it along with all other dishes \n\nOne of my favorite restaurants in the area.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Love it. Especially the small bites. Fish cake, or the traditional sausage. And their saap ver cocktail that taste like tom yum in a very good way.", "author": "Dr. Cordula K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Excellent Thai food in the Design District area (across the street from Dumpling Time). It's very underrated because it's never very crowded, but it's one of the best Thai food I've ever had. It's good for me I guess because I never have to wait to be seated.\n\nI might even put their food on par with Kin Khao.\n\nThe staff is also super friendly, and they have good cocktails and drinks. \n\nWhen you go for lunch, also ask for the dinner menu. There's a lot more specialty items on the dinner menu, and they'll serve it during lunch.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "Awesome Thai food!\n\nI always get the spicy noodles. It's full of crazy amounts of ingredients in a bowl of noodles and soup. The soup tastes a little sweet and sour--just thinking about it makes me want to order one now. The spiciness is legit--they usually give the spice sauce to you as a side dish, so you can make it as spicy as you want.\n\nThe wait staff are all very courteous and nice. The ambience inside is great, with giant paintings on the wall of vintage thai movie posters that look like they are from a past generation. Pretty cool spot to hang out for beer, lunch, and dinner.\n\nDefinitely a place I want to go back to again and again.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Very cool informal place to eat Thai food with a relaxed atmosphere. Yummy!", "author": "Maria M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-06", "description": "HORRIBLE SERVICE AND BLAND FOOD\n\nI made an online order this afternnon and it wasn't ready when I arrived 30 min later. Not the end of the world - but then I waited another 30 min while they put my order behind a handful of other orders. They didn't offer any apologies or credits toward future meals. Nothing. I asked to speak to a manager and was told the manager left for the day.\n\nI brought the food to my office and it's very BLAND. I'll never eat here again. With so many options for Thai food, why waste time or money on horrible service and boring food?", "author": "Alex W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "My family and I were in SF for one night, and of course we love Thai/Laos food. We made a reservation for Lao Table the night before, but when we got there, there was NO parking so we didn't get to eat there. The next day we planned going back to Lao Table, but it wasn't open till 5pm. So we decided to try this place, and wow! I'm just in love with their food! Absolutely delicious! Everything was so authentic! If you're looking for real Thai food, this is the place to go! Will definitely be going back while I'm in SF.", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-21", "description": "Impressing the hard to impress is tough.\n\nBirthday boy wanted to go to Saison for his Dirty 30 Birthday. I laughed over text and said, I'll do even better...\n\n*SURPRISE*\n\nSaap Ver, the newest Thai restaurant in SF...with 8 of your closest friends! \n\nShockingly, he was happy I choose Saap Ver as it came recommended by his trainer. \n\nOpening up last month in the old Grand Pu Bah space, Saap Ver serves authentic Thai food in a very dark, kitschy space. Street parking was plentiful. \n\nI appreciate having lots of choices but the 100+ item menu was daunting because most items can't be found in your cookie cutter Thai restaurant like King of Thai or Osha. The menu lacks organization; i.e. soup was listed in 3 different sections. There's also two other boards of \"chef specials\" with another 20+ items which made things even more overwhelming. A lot of ingredients present in the dishes aren't listed on the menu so if you have food allergies, let your server know. There's a full bar.\n\nWe ordered 15 dishes, some with double orders to share in a group. There were more misses than hits.\n\n: : S  O  L  I  D : : \n*Nam Kao Tod: Crispy Rice Salad ($12): http://bit.ly/1pFesz3  \nLots of crispy rice and flavorful sausage; better than Champa Garden and Maneelap.\n\n*Lard Ped Krod: Crispy Duck Salad ($14): http://bit.ly/1Rw6WMz\nIt was 80% duck so can't complain about that but needed more lime.\n\n*Kang Ped: Red Curry w/ duck ($16): http://bit.ly/1UfuFHO \nCurry sauce was robust with a nice sweetness. Duck was fatty and tender. \n\n*Durian w/ black sticky rice ($7): http://bit.ly/1MxiDBt\nDeliciously stinky and the rice was nicely sticky and nutty. \n \n: : D  E  C  E  N  T  ::\n*Pad Thai Kai Hor: Pad Thai Omelet ($15): http://bit.ly/1ZkjnBc\nFluffy eggs but noodles were soggy and needed more tamarind or lime.\n\n*Yum Koh Moo Yang: Grilled Pork Neck ($12): http://bit.ly/1U1pJG9  \nTender but not as deliciously fatty as Lers Ros; some pieces were tough, and dry around the edges. \n\n*Tom Saap Kra Dook Mo Pork: Spicy Rib Soup ($14): http://bit.ly/22s50jy\nTender ribs but broth lacked depth. \n\n*Tom Khaa: Coconut Soup w/ shrimp ($14): bit.ly/1LBa3XA\nCoconutty, good heat but didn't try any of the seafood. \n\n\n: : S  K  I  P : : \n*Crispy Pork Belly w/ sweet basil ($14): http://bit.ly/1Sd1EZz \nMeat was really dry and hard around the edges. \n\n*Tom Yum Seafood Fried Rice ($15):  http://bit.ly/1Mxjn9N \nOverwhelming lemongrass flavor, clumpy, and oily. \n\n*Duck Fried Rice ($16): http://bit.ly/1Sd1P75 \nLacks what Chinese call \"wok hay\". The rice was clumpy, soggy, and lacked a slight smokiness.  \n\n*Pad See Yew: Stir Fried Rice Noodles w beef ($13): http://bit.ly/1Uy2UcZ \nClumpy and mushy. \n\n*Kao Mun Kai ($14): http://bit.ly/1ZkkTmX\nFlavorful chicken rice but the chicken was sloppily sliced and poorly poached. The chicken (dark meat) was dry. Really disappointing.   \n\n*Nam Prik w/ Thai Sausage ($25): http://bit.ly/1Zkl4P3\nSloppily sliced, mealy sausage. Green chili dip was mushy, bland, and one dimensional. Way overpriced for $25. \n\n*Coconut Ice Cream ($7): Cloying sweet; tasted like piña colada (pineapple chucks).\n\nWhile the staff was cordial, they were very green. Our poor server wasn't familiar with the menu (who would be at 100+ items!) and had to confirm our order three separate times. I don't expect stellar service at Asian restaurants but I expected some follow-up since we were paying auto-gratuity for a large group and prices are higher than the standard Thai restaurant. No one checked on us to see how the food was and we had to constantly flag someone down when we needed something. We asked for hot sauce for the table and they gave us a small communal rack of hot sauces. They later asked to take it away when we were STILL using it. That's like having one set of ketchup and mustard bottles at a diner! \n\nAt the end of dinner, the staff brought the birthday boy coconut ice cream with a candle in it and sang happy birthday for him. What a nice gesture I thought until...I saw they charged us $7 for it. The phuck? \n\nI rarely take pics of receipts but I did so in this case so I can refer to it when writing a review. When I was looking back at the receipt last night to remind me of the dishes we ordered, I noticed that they charged us 11.9% for tax: http://bit.ly/1UfxRmS?! If the \"Healthy SF Tax\" is included, that should be listed as a separate line item charge. \n\nSaap Ver doesn't hold a candle to Lers Ros (original TL location) and Kin Khao. I question the authenticity of many of the glowing 5 star reviews especially when they choose Saap Ver to be their first restaurant to review. Ever.\n\nBut who cares about what I think. \n\nWhat did birthday boy who's a professional chef and trained in Thailand for Muay Thai think about the food at Saap Ver? \n\n\"It was authentic but ehh...it was ok\", he said. \n\nBut he thought the bartender was hawt. Now, if she sang Happy Birthday, Marilyn Monroe style to him, the $7 charge would have been worth it!", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Fresh, quick and tasty Thai food. I have tried the pad-kraw-pao and vegetarian mixed vegetable curry both of which are great. Dine in and take out are both great options!", "author": "Ruchi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Wonderful people with very attentive service. The food is excellent, spicy and flavourful and in abundance. We always think we ordered too much, and think we'll have leftovers to take home, but nope. It's too good. We almost always eat everything right there.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-02", "description": "I ordered from here for a few times, but the food is inconsistent and spice/hotness levels are all over the place. Medium spicy is completely bland one day and feels like you have been set on fire another day.", "author": "Daniel Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-17", "description": "The ambiance is a bit overly stimulating. Then again, maybe I can contentedly chalk it up to an authentic experience. When I visit Thailand, I might get back to ya. \n\nOrdered two pad see ew dishes and a beer. Both my brother and I were underwhelmed by the food, which could have used extra sauce, eggs, and more tender beef. My brother said his beer was okay.", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I went for lunch here last week along with my daughter who had tried them before\n\nEverything we got was quite delicious.  \nMy daughter is on crutches and I am Rishi eight that the staff was very courteous to her", "author": "amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Solid Thai food if you are in the area or can't stand the wait at Dumpling Time across the street. Lively atmosphere and lots of seating. Huge menu with a wide variety in prices - entrees ranging from around $14 to $30. I had the seafood curry which was fantastic. Friend had the fried rice with tofu and enjoyed it.", "author": "Robin P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "The food is good here, but...\n\nI placed an online order today and waited 52 minutes to get it. Every staff member kept telling me \"yes, yes, it's coming\" when I asked.  Finally, they figured out that the order was never given to the kitchen.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "Nothing authentic about this food. My lunch came with iceberg lettuce coated in 1000 island dressing. I have been to Thailand and never once was I ever served 1000 island dressing. Overpriced and portions are small", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-16", "description": "I'm done with Saap Ver, the service is bad, takes forever to get your check and now they have raised their prices and charge $3 or more to add chicken to any dish or make request. The food was already expensive. \n\n$50 for lunch for 3 ridiculous. I will spend my money and time somewhere else, I recommend you do the same!\n\nGREED HAS SET IN AT SAAP, a death nail!", "author": "T. O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-20", "description": "I used to come here. The food and service was good. One day I ordered Khao Mun Gai (chicken on rice) and they served chicken that was cooked the day before. This was unacceptable. Imagine your favorite bakery selling you day old pastries as \"freshly baked\".", "author": "Reza H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "Best Thai food in the city hands down. Service is exceptional and beer is always ice cold. If you like chicken noodle soup, order it with egg noodles or vermicelli noodles, its ridiculous.  Especially on cold, rainy days.", "author": "Josh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "Saap Ver is an interesting place. Their menu is extremely extensive, and everything that I've had has been fine - just fine. Service every time I've been here has been really lax, but there's almost always only one server helping the entire restaurant. What makes Saap Ver stand out is how caring that limited service is. We came in during a Warriors game (go Dubs!) and they let us take up a 4 top so we could both watch the game at the same time. It's the little things that count!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-20", "description": "+ Have fresh coconut juice in a coconut\n+ Green curry was good, but a bit overpriced\n\nNot worth going out of your way to go to.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-25", "description": "Im not sure really how to start!  Every Friday we order lunch as an office and try to mix it up to all of the restaurants in the area.  But 3 times out of 3 orders, we have had nothing but issues.\n\nThe first and second experiences were just simple substitutions for items we ordered.  Both times we went to pick up our order, we have had to pick something new off of the menu.  Its a little frustrating when you are looking forward to what you ordered and then to have to pick something else.  I have worked in many restaurants so I do understand things do run out, but it seems weird that it happened twice.\n\nBut this last time was the last.  After avoiding the road construction to get there and having my colleagues all excited, they did not have our order at all.  It just upped and vanished from the person that took the order over the phone", "author": "Zachary A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "It's hard to get more authentic that this spot! When you see other Thai people eating there, you know this place is a gem!\n\nI ordered the duck larb, pad Thai, and green curry. When you ask for medium spicy, they really mean it! The duck larb was my favorite out of all the dishes. Although, if they had any of the crispy pork belly left for me to order, I bet that would take the gold medal!\n\nThe ambiance is also just plain fun! You'll see posters of old Thai movies and it transports you to a touristy spot straight outta Bangkok!\n\nWhat's next? I'm getting that pork belly for takeout!", "author": "Nitar L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "We ordered Som Tom with crabs, fried rice, BBQ chicken, pad Thai wrapped with eggs then coconut ice cream. The food was very delicious and authentic. The service was very good and very professional. I would go back again for another round...", "author": "Max H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Those of you that come to this restaurant thinking pad Thai or green curry is going to be their best dish should stay away from this establishment. It's too bad people unfamiliar with Thai cuisine thinks they can ding the place down because their pan fried noodle dish didn't taste the same as another watered down place. We ordered som tum, Kao moo yang, and laap nan tok, and a giant grilled fish complete with roasted egg plant on the side. We felt like we were back in bangkok and truly enjoyed this place. This place is 5 stars. Let me know if you need help ordering", "author": "Otto T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Probably my favorite Thai restaurant in the city. It's super underrated. Food is very authentic and has lots of flavor. Staff are also very nice and friendly.", "author": "Vinayak P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Literally the best Thai Restaurant in San Francisco! The food is authentic as well as amazingly delicious! A few dishes come to mind are :\n\nPECK GAI Salted Chicken Wings \n\nTHAI HERB SAUSAGE    Northern Style Pork Sausage \n\nLUK CHIN PHING       Grilled Meatballs (Pork or Beef), Sweet Chili Sauce \n\nKOH MOO YANG                Grilled Pork Neck \n\nGAI YANG                         BBQ Chicken with Sweet Chili Sauce  \n\nCRYING ThaIGilR         Grilled Rib Eye Steak, Roasted Rice, Chili-Lime Sauce \n\nGRILLED PORK NECK SALAD       Spicy Roasted Rice Powder \n\nGRILLED PRAWNS SALAD      Lemongrass, Fresh Mint  \n\nLARB         Minced Pork or Chicken, Chili Powder, Roasted Rice, Chili-Lime Dressing \n\nRICE FIELD CRAB SOM TUM      Rice Field Salted Crab, fermented fish\n\nTOM SAAP KRA DOOK MOO Spicy Sour Pork Spare Rib Soup, Roasted Rice Powder \n\nPAD THAI Pan-Fried Rice Noodle, Tofu, Chive, Peanut, Bean Sprout \n\nLARB PLA Whole Fish Salad, Thai Herbs, Spicy-Lime Roasted Rice Dressing \n\nCRISPY PORK BELLY BASIL      Stir-fried pork belly, chili, bell pepper, green bean \n\nCRISPY PORK BELLY KA-NA      Stir-fried pork belly, Chinese broccoli, oyster sauce\n\nThe owner and staff are unbelievable! Very friendly. My complements to the chef! An absolute delight!", "author": "Eddy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "My lunch of  steamed Chicken Ginger rice was accompanied by a  lively chili sauce that gave the dish some punch. Look forward to exploring the menu further.", "author": "Steve T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "The best Thai food in town \nFirst time when I go this place I ordered 5-6 order everything it's delicious and fresh if you find authentic thai food in town I highly recommend this restaurant!!", "author": "Bancha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Second time coming here. This place has never disappointed me. We ordered Chiang Mai style pork dip, fried pork and grilled pork shoulder. Both pork diahes were tendered and juicy. The sauce was great. It was  not sweet at all (thai food shouldn't be sweet). Will definitely coming back again.", "author": "Pim N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "Nope. Not for us. Being honest we received 10% off for complaining.\n\nDuck is ultra fatty, one of the crab dishes smells like sweaty feet.\n\nAl that said, we're not of the age range that frequents this place, if you're under 30, you may well enjoy it a whole lot more than we did.", "author": "John R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "Excellent Thai food that has the feel of sitting outdoors, eating street food -- except inside, with no humidity! The egg pancake is delicious as are the curries. Inventive cocktails, too. And -- plenty of parking on a Saturday night.", "author": "Vanessa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Service amazing. Mgmt staff friendly and engaged with customer service. Ambiance very hipster like yet inviting to family meal time. Lastly the food, well, one of best yet in Thai cuisine. \nHave to admit that I still enjoyed Lotus Siam of Vegas a bit more but outside this place, but it's one of best I've had in continental US, from coast to coast. To make it even better, prices were very reasonable. This is a hidden gem waiting to be discovered. Actually, they're already Michelin recommended only about a year since opening. Strong recommend!", "author": "Mush S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-19", "description": "Convenient parking, scrumptious food, and caring service. \n\nCame as a group of three, and since one of us was vegetarian, we ordered all our dishes with no meat. Surprisingly, I had no craving for meat during the entire meal. We ordered the yellow curry with fried tofu, veggie fried rice, and extra spicy pad kee mao. Each dish took me on a completely different flavorful journey. Yes hunny, yes. \n\nWe also ordered the watermelon drink. I forget what it was called but it was hella good. The only recommendation I have, is that they should give us larger plates. We were eating off of plates that were quite small so I couldn't serve myself as much food as I wanted (no worries, they have large food portions). Also, there could be larger straws. There were really small straws (the size of a coffee stirrer) for our watermelon drink. Basically I wanted to take enormous bites and gulps of everything because it was so darn delicious. :-P \n\nI'll be back!!", "author": "Ani R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-09", "description": "Lived here for 8 years. This place is the old grand Pu bah and since it's the same cuisine it's hard not to compare. \n\nHonestly, I miss grand Pu bah. The decor for in better in this design district. Saap ver is Thailand street food style decor, very eccentric, random and authentic but it doesn't fit in well in this neighborhood. Honestly there's too much going on it made me anxious. \n\nI ordered pad see ewe $13. Service was fast. Food was ok. It had much more sauce than needed; way too much sodium for my liking. Aldo the menu was all over the place and really hard to read. I was looking for the normal rice and egg plant and chicken dish that's typical for Thai restaurants. They had something like that listed but it said fried and I don't like fried food. I defaulted to pad see ewe. \n\nService was nice. There's no host so I had to flag someone down. Overall it's not bad but I liked the classy, modern grand Pu bag where we can take high end clients.\n\nBtw lots of gnats. Is that a health code violation?", "author": "Lucky N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Food is good. Drinks are good. Place is clean. Take out is fast. What's not to like? If you don't like spicy food, don't get any of the spicy items and ask for mild or medium thinking you can handle it because here, spicy means spicy. I find the menu to have good variety and is a good change from the usual Thai place that just has pad Thai and curries. \n\nI've had their drinks and it's definitely got creativity and much more flare than I expected. I also enjoy the decor. I only wish they would stop playing really obscure sports games all the time and show something else besides sports once in a while.", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Excellent Thai with a versatile menu.\n\nWe tried everything family style. From curries to noodles to a whole fish, I think we sampled everything.\n\nAll the dishes were delicious and more authentically made than other places I have frequented. \n\nMy favorite was the chicken curry paired with sticky rice and the pad Thai. The fish was also cooked creatively, covered in an insane amount of salt but when you peel back the skin the flesh is seasoned juuuuusst right.\n\nThe iced tea was awesome. Kept me up for a good 4 hours after dinner but hey, Netflix preparedness right?", "author": "Neesh Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "This is one of my favorite place in city. Everything so good! People is really nice and good was amazing! Love this place forever!!!", "author": "Serah P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "+ Food is delicious. Heads up: 'Medium' spicy at this restaurant means REALLY SPICY. I love Korean food and can eat all of the mega spicy Korean food brings...but this Thai 'medium' spicy nearly god damn killed me.  I didn't even finish my food, I ate about half, before my mouth decided to throw the towel in. Can't complain, eating less just means I won't get fat, right? Fresh ingredients and excellent spices.\n\n- SERVICE IS TERRIBLE which is why I give this place such a low rating. I walked in to order takeout at 1230pm, Friday and it was very busy.  I understand that I may not get the best service when it's busy, however the people today did not acknowledge me once. So after 5 minutes, I ordered lunch from the Eat24 app. Said it would be ready in 10-35 minutes.  40 minutes later, I'm still waiting inside the restaurant btw, sitting, with no one acknowledging why I am sitting there for 45 minutes, I ask a server if he could check on my order and I provide him my name. He walks away and never comes back. When I finally see him again, he's bagging up an order and placing it on the side and continues to serve the eat-in customers.\n\nI naturally assumed it was not my take out as he has my name and he knows I am waiting.  I WAS WRONG.  I waiting another 10 minutes and a different server looks at the order and says, 'Oh this one is yours, right?\"  WTF.  \n\nI waited a total of 55 minutes for my takeout order. During that time I watched multiple customers wait in frustration for their late take away orders and for incorrect take away orders as well. I will never order takeout or even sit-in at this restaurant.  The food is good, but it's not that good where I will put up with the shitty service.", "author": "Tara K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Wow! Our birthday dinner here was a night to remember! I was lucky enough to have made a reservation 2 weeks prior for a party of 15 on a busy Saturday night. Our server was hilarious, and attentive to our needy requests. Even with a large group, we felt very well taken care of. When they found out it was my birthday, I was given a shot of whisky right after placing our orders (and ... many more shots given on the house after). The dishes were yummy and flavorful, my friends got to taste a variety of things on the menu-- it was definitely reasonably priced for what you can find in the city. It was actually very difficult finding a place that fits our budget, and still accommodates for our large group. I was so glad to have found this place. It was such a fun atmosphere, and the employees couldn't have been more friendlier. I think it was also the owner's birthday, and I was lucky enough to take a shot with him, then proceeding to be pulled on stage to dance.", "author": "Qiqi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "We almost always get food as \"take-out\" here... it's a bit noisy inside... and I'm getting old and cranky... \n\nAs to the food: it's great!\n\nLots of variety on the menu. And all the dishes we've tried have been delicious. I recommend!", "author": "Marcus L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "The food and cocktails are super tasty! A fun spot for both lunch and dinner. They even have a full bar, and lots of TVs to watch games! But it doesn't have that sports bar feel, and the TVs are easy to ignore (in the bar area) if you want to. \n\nThe Pad Thai and the Fried Chicken Ginger Rice are my favorites. And try their Happy Hour too!", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-19", "description": "This place is pretty fly. And by that I mean 4 out of 6 of the drinks on the table had little flies in them. Waitress wasn't even surprised, didn't act like she had no idea what it was - we all know at this point.\n\nSugar Ray would love it here. He just wants a fly.", "author": "Shaun P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Very fun place, one of the better Thai restaurants in the city. \n\nSo far I've had the seafood pad see ew - not too oily like others I've had which is good. \n\nYou can see the crab in the crab fried rice. \n\nThe basil duck was super flavorful. Though a tad bit too salty, we still cleaned the plate!", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Great food and great customer service. Everything is good but the whole fried fish larb is to die for!", "author": "Sharon Rika O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "Had been wanting to try this place for sometime. As you walk in the decor is impressive much like Farmhouse which currently holds my heart for favorite thai place in the city. \n\nLunch:\nService here is very friendly , and I got a curry dish. The price was about $13 which seems high but is on par for SF thai establishments.  What comes out is a small dish of curry and a small scoop of rice. If i had to be picky I would say maybe a little more rice would be nice for the dish.  The curry is served in a typical thai fashion which is a pyramid with it's top chopped off. (edit: This shape has a name.. I was curious and referenced Senor Google and it's called a Frustum). Saying the word word Frustum is Frust-rating b/c it doesn't roll off the lips quite right does it?? Moving along...\n\nIt doesn't appear that there is much curry in the Frustum but there is indeed a good amount of meat/heartiness in the oddly named bowl.  They ask you for spiciness level here and the taste/spiciness level was just how I like it . \n\nAs I mentioned the service here was awesome as well. \n\nI now have Saap Ver and Farmhouse Thai as my two favorite SF thai establishments and look forward to returning. \n\n-", "author": "Rod M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "******************** 1542 ******************** \n\n    I came here when it was another Thai Spot, love the bar then, and it stays the same. Although the kitchen and the walls are all redecorated, street food style, nice design, taken you back to the old days.\n\n  My best friend and I ordered a bit of everything. The papaya salad, the soup, the park belly, the fish, the whole fried fish was out on Sunday when we were there. We were disappointed. I guess we need another trip back.\n\n   Love, love, love the fish sauce and Thai chili pot!!!\n\n   The place was 1/3 full when we were there. Service was good and attentive. The drink list was nice. They even have Champagne by the glass. Riesling is the way to go. We shall be back.", "author": "Manda Bear B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "We tried the sea bass and fried wings. Liked their service. We will visit again. The sea bass was cooked in a  clay pot with veggies. Very flavorful.", "author": "Gomz G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "This place is underrated and deserves a bump up. Eating here brings me back to Thailand, particularly Bangkok. The flavors are on point and the atmosphere is very laid back. I've been four times now and each and every time the waiters and waitresses have been great at recommending dishes I haven't tried before.\n\nIt's great for large groups and often times, there's no wait. Great food, great atmosphere, great service. I couldn't ask for more.", "author": "Ansi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Delicious food but I ate 4 or 5 flies with my meal.\n\nGreen Papaya Salad with Sticky Rice: 4.5 stars\nI got this with BBQ chicken and got a huge drumstick and 2 thighs. Super yummy meal but I was distracted by the cloud of flies landing in my salad sauce and on the rice and on my nose, etc.\n\nRe: the ambience, I find it a bit strange that they took down the fancy high-end Grand Pu-Bah decor to replace it with a kitschy faux-street hawker vibe, but hey whatever the food is good. For the price you pay though, I expect better hygiene standards than a street in Bangkok.\n\n\n---- UPDATE Aug 29 2017 ----\n\nI've returned a few times and there have never been as many flies as on my first visit so I'm revising upwards to 4 stars.\n\n---- NOODLES ----\n\nPad See Ew: 3.5 stars\nGot mine with pork. Satisfying enough, but too salty. I'll try asking for reduced salt next time.\n\nRad Na: 4.5 stars\nAsked for reduced salt and it was perfect. Lots of delicious gravy.\n\nChicken Noodle Soup: 3.5 stars\n\nBBQ Pork and Wonton Noodle Soup: 4 stars\n\n\n---- RICE ----\n\nChicken Fried Rice: 4 stars\n\nFive Spice Pork Leg with Rice: 3.5 stars", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Great authentic food and a great casual atmosphere. Ate here while the NBA finals were going on and was a very lively environment, lots of fun. Food was also very delicious and had a very authentic vibe to it. Had the pad Thai which had a great twist of having a layer of egg over it, and the noodles were amazing. If you want to add a little heat, I'd recommend their chili sauce that was really great.", "author": "Roger L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-11", "description": "Really delicious food. Unfortunately, the service is pretty terrible. Servers are nice enough, but very inattentive and people in one party are not served their orders at one time, so people just watch each other eat their meals. \n\nRecommend for takeout. Not for dining in.", "author": "Chip S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "This place is great!! Wonderful atmosphere and the food is even better. Glad a great restaurant finally came into this spot as the one before was horrible. Every time I come it's a great experience.\n\nThanks for making me a happy Jew!", "author": "David F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Been to Thailand many times - The Chiang Mai Sausage is on the sweet side - it was VERY good, but not as spicy as I expected. the serving size was quite ample. Chicken Satay - only two kabobs but, authentic enough. My friend had the duck on a bed of rice, which was excellent(!) -  with not so much fat. I ordered the chicken Thai basil (think larb) which was, if I closed my eyes - VERY authentic/delicious. Service was friendly and non-rushed (we were seated at around 1:00 on a weekday).\nHaving been to \"Lers\" just a few days ago - I found the price of lunch much easier to swallow here at Saap Ver - I can't wait to go back and explore the dinner menu!", "author": "James M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "Tom yum noodle was alright, the flavor is good but was way too oily. Unlike the other traditional Thai noodles I've ordered, they don't have different variety of noodles, it came with pho noodles. Pretty disappointed - Pa-Ord (in Los Angeles) is still the best. \n\nPartner ordered the crispy rice salad and that was not good, it's weird that they added so much ginger to the salad.", "author": "Kym L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "When they say on authentic  food they really mean authentic. Food was great hair food took a while to come but food was really good it was delicious one of my favorite Cuisines no complaints here.", "author": "Meishi M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-20", "description": "Was excited to see a new Thai restaurant open up here. I thought it was new ownership from the last Thai establishment in the same spot because of the different styling of the restaurant, new waiters/waitresses, and a slightly different style of food. But the expensive menu and lingering service issues make me wonder if some of Grand Pu Bah is still here.\n\nHave eaten here twice since they've opened and had poor dining experiences overall both times. The first time, it took a long time for the wait staff to take our order, and then when it came out, they were delivered so far apart that we had to have that awkward conversation of \"no, please go ahead and eat, your food will get cold.\" The first and last dish were delivered at least 15 minutes apart, which is ridiculous when you're trying to share a meal with some one. I also asked for medium spice level and it was scalding my mouth, and usually I order hot at restaurants but just wasn't in the mood this day. The spice inconsistency was an issue at Grand Pu Bah as well.\n\nThe second time was even worse. One of our table members ordered a soup which came in this large circular steel epic presentation, but then she had to stare at it for 15 minutes before even the second of our six dishes came out. When they all finally came out, we were trying to get a bowl and spoon for her to eat the soup out of, and that took multiple requests, when finally I just got up and went and found spoons and bowls, and silverware for the table. I felt bad for the waitstaff because they were running around like crazy, so it's probably a new restaurant/understaffed problem. \n\nReally bad experience here, and will not return. Food is decent, but the service situation was so bad both times that it pretty much negates any potentially redeeming qualities.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-13", "description": "This place is probably my new to go place!\nBring your friends here, soupy an order more food to share. \n\nThey have full bar, there you go! Full Choices of beers/ wines/ cocktails. \n\nI would definitely recommend set nam prik. They are all tasty and healthy.", "author": "Fah Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-27", "description": "I got a combo with sausage, sticky rice, pork rinds, peanuts, chilis, cabbage.\n\nI really liekd the pork rinds, peanuts, cabbage.\n\nSausage was pretty spicy.   The green chilis were insanely hot, i cried.\n\n\nThis resturant is super loud, uncomfortably loud.   I didn't feel like shouting so we just sat quietly ate and left.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Food is always delicious here and consistent. Service is fast and friendly \nWe always get the fried fish larb it's sooo good!", "author": "Marie r."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-11", "description": "Great food! Taste authentic and loved every bite. I would have given 5 stars if just based on that. \nHowever, the service was horrible. Walked in with the place half full and yet it took the servers quite some time before they noticed we were waiting to be seated. \n\nAfter ordering, we tried to flag someone and one of the guy rudely pointed to our faces and told us to wait while he go on with something else\n\nOur original server forgot that we ordered a beer and when asked, she gave us a puzzled look. Halfway through our food, we ran out of water and no one noticed or bothered to check on us. \n\nI would go back for the food but the service really threw us off.", "author": "WQ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "I went their for the first time with my friends and this is a new place we 'd like to hang out.  As i'm Thai, the theme of the restaurant reminds me of the old  days which I love it. It seems to me that the owner put a lot of effort to start this place.\nWe ordered many classic Thai dishes, such as fish cake, Grilled Tilapia, Papaya salad, Tom yum noodle soup. The food was superp. It was Authentic Thai. \nWhen comes to the deserts, we had coconut ice cream which they served in fresh coconut shell. It was beautiful and the taste was so good. We also ordered Durian in coconut milk with sticky rice. This desert is rare, but they have it here.\n\nThe servers and the owner are very sweet. Good service. We 'll come back to try more.", "author": "Saowalak F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Great decoration ,spacious , I'm thinking about bring a group of my friend here , authentic Thai  food ,absolutely taste like what you eat in Thailand\nWe order meat ball(dipping sauce is the killer)\nTom Saap (tasty!!) and grill tilapia (grilled perfectly, the fish is so moist and flavorful , 3 dipping sauce is perfect) \nMust eat here!!", "author": "Wirunna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-20", "description": "This place is a luxury authentic Thai food.\nI recommended this place for friend who need to eat North east Thai food.\nTum Sua and fish grill with sea are the unique Thai food that you will never eat in another place in San Francisco.", "author": "Naomi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "Ordered take out from this place and although I think it was good. There were way better options in the bay area.\n\nThe pad thai was okay nothing too exciting.\n\nThe spicy spareribs were really good. I would come back just for that.\n\nPineapple rice could have been better.", "author": "Brian N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Food: 5 stars. Ordered sour pork soup, pork neck salad, and a noodle dish. All good.\n\nService: 5\n\nEnvironment: 5 \n\nPrice: 4 . It is a little bit pricy than other this level restaurants. This place serve wines. This could be a reason. \n\nWill come back", "author": "Fangfang O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Yum! This Thai food is excellent! The menu is extremely large and packed with delicious items. The interior of the space is unique and there are large screens if you want to watch a football game. They have bar seating, which is nice if you want to grab a drink. They do offer some unique drink options as well that seem to come in fruits. I would suggest getting the pad see ew with chicken. It is a large portion meal that will lease you extremely satisfied!", "author": "Zoe Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "This Thai restaurant is a nice addition to the design district/Potrero hill area. The restaurant shows Thai movies in the evening and has Thai themed movie art work on the wall. The focus of this restaurant is Thai street food so don't expect to see a large menu. I've been to this restaurant twice and would say the my experience was between a 3 and 4. I really liked the Kra Pow Gai as it was very flavorful, maybe could have used a bit more spice, but had the right texture, ingredients, and consistency. As for the Som Tum Set, the chicken BBQ was not my favorite. The texture of the chicken was fine, but in my opinion there wasn't a lot of meat on the chicken wings. I spent the majority of my meal trying to figure out how to get the small pieces of meat off the wing. This dish comes with a papaya salad which was intended to be the appetizer, but was the highlight of the dish for me. It was flavorful, had a nice tangy kick and had little shrimp in the dish. My husband and I were both impressed with this salad and wished it was a stand alone menu item. Another item I've tried at this restaurant is the cabbage the dish. The cabbage had the perfect texture after being cooked in the wok and had a nice garlicky flavor. \n\nThe service at this establishment was decent. The first time I came it was impressive, but the second time I am visited it was slow and they accidentally switched our bill with another patrons. I think this establishment has a lot of potential and hope they continue to refine their menu and work the kinks out in their service.", "author": "Dawn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Food is really good and the decoration is awesome like come for the movie scene .\nI want to recommend the server named \"Joy\". She is very kind and friendly. I will come back again because this is so great!!!", "author": "Piyathida N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "Argh, growing pains and a full house means some of the wonderful details of my first visits are diminishing. The white cabbage on the plate, this detail I so eagerly cherish because of it's authenticity all throughout Thailand, is something that is now missing. Also the chicken is getting tougher. I have faith in the chef and staff, and it is most definitely tough to scale Thai food, but please pull through on this one. So much talent here. Dont' become just another Thai spot.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-13", "description": "Saap Ver is a very vibrant Thai restaurant and bar, full of colorful flags with vintage Thai movie posters plastered across the walls. I went on a Monday evening around 7 PM, and the place was lively (especially because Game 5 of the NBA Finals was happening) but there were plenty of tables open so we were seated immediately.\n\nI got the Pad See Ew with beef. The portions were very large, but the meat was a bit overcooked and tough. In my experience, pad see ew tends to be on the sweet side, but their version had some interesting spiciness going on, with some hints of ginger and pepper. Overall, a decent dish.\n\nThe service was very nice, but the food was slow to come out. At $12 pre-tax for the pad see ew, it's a little on the pricey side for Thai. This is the first Thai place I've in SF, so I don't have much to compare it to, but it doesn't quite match up to my favorite spot in NYC. I probably wouldn't get the pad see ew again, but would be willing to go back to try some of their more specialized dishes.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Big portions. Authentic food and people. Good energy inside and a nice layout. I recommend the coconut soup.", "author": "Cassie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "These guys have nailed it when it comes to creating a great ambiance. Very open airy space with good decoration and multiple TVs for watching games. The menus variety is impressive and I enjoyed many of the dishes. Definitely a staple!", "author": "Anant P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "The food was really good and came out very quickly but like a lot of Thai places, there's not a lot of emphasis on plating apps and soups first. We got our fresh rolls (the rice paper was not soft but the hard rehydrated kind on the outside of Vietnamese goi cuon if they'd been refrigerated), then came the crispy pork belly and Chinese broccoli and pad see ew (I ordered Pad Kee Mao but whatevs). We had to wait a bit to get the fried egg and ginger rice. Then after about 10 minutes we got our soup. Everything was over the top delicious, so it lived up to its name, but then service just kind of disappeared. I watched as two tables in the restaurant get extra attention while everyone else just got ok service. All in all, food was good but service was lack luster.", "author": "Jeff K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Foods was so good!! I had bloody clam salad and kow kruk krapi. Can't find any where like this place. Definitely come back again!!! Never disappointed!!'", "author": "Nam T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Saap Ver is my favorite restaurant in the whole city, and I eat out fairly often.  I have been a loyal patron for years and go there at least once a week.  The food is consistently delicious and I love the crab som tum and naked prawns.  I have tried other Thai restaurants, but none of them measure up to Saap Ver's awesomeness.  The staff is super friendly and accomodating.  Go to Saap Ver if you want great Thai food and a fun atmosphere.", "author": "Tanya B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-04", "description": "Saap Ver is a delicious Thai spot out in SF. It's not my favorite by any means, nor is it the best, however they do have a few treats on their menu that I just can't get enough of. Their Nam Tok (grilled pork salad) might be the best I've had here in the States. It is perfection. The Issan Thai sausage is absolutely incredible as well. Their Som Tum is also quite good but it doesn't quite hit the mark. I also love their coconut ice cream for dessert.\nI love the interior arrangement as well. Bright & colorful with all sorts of old Thai movie posters up on the walls. It's a large establishment and quite comfortable. IT's a fun place to have a meal, that's for sure.\nI will say in all honesty that their are many dishes at Saap Ver that miss the mark by miles. Their crab fried rice \"Kow Pad Boo\" for instance is a shame. That dish is a staple of Thai cuisine and it's really disappointing at Saap. \nAll in all I'm a fan. The goods outweigh the negative.", "author": "Gilbey G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "Violated the federal law Americans With Disabilities Act, refused me service with service dog. They seated me, brought me water, took my order, and then told me I had to leave. Service dog was sitting quietly under table.\n\nThey stated I had to show proof of service dog, in direct violation of the ADA, even after I explained the law and spoke to a manager, who questioned me over and over if I was \"sure\" it's a service dog.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "I wish this was in my neighborhood! Very good with lots of fresh veggies. Tom Kha and Pad Kee Mao we're done very well. We were starving from a long travel day, had just gotten off a plane without too much time until closing, but the server was very friendly and made sure everything came out quickly as we requested.", "author": "Julia P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "My boyfriend and I had heard about this place when it first opened and finally got a chance to try it this past weekend. We were not disappointed. It was probably some of the best thai I've had in the city. The only downside is that the menu is really extensive so it's easy to order too much food :) You'll probably want to try everything.\n\nIt's a casual spot, but fun decor and the staff is super friendly. A good setting for groups and/or happy hour. Maybe a little pricier than your average takeout but so worth it.\n\nWe ordered the pad thai hor kai, tom yum soup, crispy larb wontons and the fresh rolls. We definitely will go back to try more. It's nice to have another thai option in the area.", "author": "Bethany D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-03", "description": "I love Thai food ! \nthis is the place where you're looking for authentic Thai street food  \nthe best Som Tum Poo Plara  but some Americans never had a chance to know what Poo Pla ra is  ,   Poo Pla ra combine with several dimensions of flavor   Salty and sour are the main flavor of Poo Pla ra\nso no doubt why mostly of American people can not understand the palate of Som Tum Poo Pla Ra  \n\nI just give a little bit orientation for papaya salad for yelper out there ;)", "author": "Noah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Delicious Thai food! Great ambiance and service. Would definitely be coming back!\n\nWe got the pork skewers, some ground chicken salad, deep fried pork salad, and pork belly with basil. I don't remember the name, but look at photos uploaded. Very spicy, per our request. Also the lychee martinis are devine!", "author": "Dee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Great Thai food great atmosphere full bar you got to go. When was a group of fans had a great time highly recommended", "author": "Kent W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Food  and service are very very good it's seems like I am in thailand the food is really authentic.\n\n\nShould come to try here.", "author": "Princess M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "This is my go-to Thai place. Everything is so good, the staff are wonderful, and the atmosphere is inviting. The samosas and Thai iced tea are must-tries!", "author": "Kira G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Being from Thailand, I am super picky about my food. My go to spot use to be Sai Jai Thai. I have been holding out on reviewing this place because I really didn't want to share this spot with everyone. However, with that being said. I have brought countless friends here and now they secretly go without me. So damn rude. The menu varies so I always ask what's new. I really enjoy Thai northeastern food such and the papaya combo with Thai BBQ chicken and sticky rice. It's pretty on point. They always change their menu up so there is always something good to try. I just wish they would change up there dessert menu is all. Seriously, why don't you have mango and sticky rice? It's okay I'll just go to Mitchells after.", "author": "Andy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Really good food and very nice staff. Clean restaurant and unique decor. The noodle soups are awesome. Thai Tea.They also have a big projector tv for sports.", "author": "Douglas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Came to set up events over the weekend. Saap Ver (formally Grand Bhu Bar),  revamp the place & menu. The chef/co-owner is well known amongst Thai community for cooking very authentic n flavorful food. \n\nI was in SF for 3 days n went over for dinner 2 nights this trip.  Was also there the beginning of the month. Can't get enough. \n\nMost of want I always get are the north-eastern Thai (Isarn) food which consists of Papaya salad, grilled salted-Talapia (limited per day), Moo nam-tok,  delicious spare ribs,  Tom-sap spare ribs (spicy Thai style soup). Pad-cha Talay (seafood in chili paste & fresh pepper) is authentic. All pairs perfectly with Singha beer from Thailand. \n\nIf u are up for a challenge for authentic Thai food,  with  unique decors, u will love the place. It's my favorite place in SF. If u see a lot of Thais in a place,  u know u are in for a real taste.", "author": "Mary J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Awesome authentic Thai food with the best service!! Would highly recommend this place to anyone that wants a welcoming and delicious experience!! Five stars all the way.", "author": "Perm H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "I've been going to this place for four days in a row now. Since I tried the food here I just keep craving it! The laab isn't like I'm used to, but it's really good! So far the laab and the chicken soup were the best. Maybe I'll post more after I've tried more.\nEDIT: if you order for pickup, they don't start cooking your food until you arrive to pick it up. And the restaurant wasn't packed. Waited 20 minutes longer than my confirmed pickup time!DON'T USE EAT 24 to order! Minus 1 star", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "Saap Ver, Authentic Fly Cuisine\n\nBottom line up front - they have not figured out the lunch rush yet. The service was terribly confused, the appetizer was missed, the main courses had a ~10-15 minute delta between arriving amongst the group, there were flies EVERYWHERE, and the pad thai was cold.\n\nService\n- It took 10 minutes to flag someone down to request a table\n- Another 10 minutes went by, so we got up to flag down a different person who took our order\n- We ordered very basic dishes: Egg rolls for the table, 2 soups, 1 pad thai\n- It took another 20 minutes to get our food (we are roughly 40 minutes invested prior to food)\n- They brought the two soups, 10-15 minutes later they brought the pad thai\n- The egg rolls never came, after we inquired, they brought over a small plate of a cold egg roll that was cut in half (there were three of us, this clearly wasn't the table portion)\n- We requested the spice rack, it never came\n- We shared two napkins amongst the three of us\n\nFood\n- The soups were decent\n- The pad thai was cold, lacked flavor, and had zero spice (and because the spice rack never came, it remained unspicy)\n- The egg roll was terrible, after one bite no one wanted the other half\n\nClosing service\n- We stood up again to go hand someone the credit card to close out the bill\n- They took off the \"egg roll appetizer\"\n- They instantly cleared our plates off the table to ensure space for the next set of unlucky victims\n\nThis was our go-to lunch spot (team of ~60 employees) - will most likely give it another chance, but in the meantime, I'm referring to this place as \"The Flytrap\".", "author": "Jason M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-28", "description": "Ehhhh ... the food itself is pretty decent. Tastiness is in the 3.5 to 4 star range; however, I'm knocking the review down to a 3 because of all the flies. Regardless of time of year there's always a ton of flies that you have to shoo away from your plate. Really kills the enjoyment of eating at a restaurant.", "author": "Neil X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-27", "description": "The food here is ok. The only reason I come here is because it is close to my work. I have never experienced such horrible service in my entire life.  I tried coming here again to see if maybe if was a fluke but they were even ruder the second time.  I highly recommend eating anywhere else unless you are literally dying of hunger.", "author": "Kj M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "Haven't had authentic flavors like this outside of Pok Pok. They have a lot of dishes that most Americanized Thai places don't serve, and they don't skimp on the spice and the flavors. The space is rather large, and was great for a birthday dinner as well.", "author": "Kazu O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "I love the food here. The menu is varied and unique. The dishes are tasty and spicy. And the unique decor and atmosphere makes me forget I'm in San Francisco for a while. Since our first visit I've been recommending them to everyone I know. But tonight's visit may be our last. \n\nThere are gnats. Everywhere. They must find the food as declcious as we do because I have to keep swatting them away. I was able to forgive this to some extent on our first and second visit, until I went into the restroom. It was swarming with them. It was disgusting, and disappointing. We decided to get our dessert somewhere else.\n\nI hope they can solve this problem. The place has some real potential. But until they address the bugs (which might be reflective of a larger issue), I won't be returning, nor recommending them to anyone else.", "author": "Elvis M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-11", "description": "Other than the amazing Thai retro decor, this place left little to be desired.\n\nThis place just does not compare to the wonderfully delicious street food of Thailand as it proclaims.\n\nThe pad thai omelette sounded fun and unique but didn't taste any better than the standard pad thai you can get at any restaurant.\n\nThe only tasty thing about the Chiang Mai style pork with pork dip were the sauce and the chips. The pork was little pieces of overcooked, dry, and tough pieces of meat. Definitely not worth the $25 price tag. They just spread out the food on a large plate so that it seems like a lot of food but it's really just a little bit of pork.\n\nThe crab green papaya salad had zero crab meat along with a few one inch long miniature crab legs that can't be eaten. It was probably 1.5 cups of papaya salad with some dressing on it. Horrible.\n\nThe crispy duck salad was actually tasty but barely had any duck in it.\n\nServer was friendly but pretty clueless. \n\nBye! Won't be back again!", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-28", "description": "Decent food, attentive servers, great hours and super fun decor. I ordered take out, my veggies were literally raw! the curry base was delicious, but my carrots were hard and crunchy, I only got 1 potato in my yellow curry, and the eggplant was not even warm; it was completely RAW and hard! I thought it was a nice gesture to give me some fish cakes on the house (too fishy for me, didn't taste fresh) at least they tried and for that they get additional star. \n\nUnfortunately I was already 3 miles away back at work by the time I realized all these issues, so it was too late to have it corrected. I would give them another chance for dine in only.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "Stunned.\n\nWhen you are in SOMA, and a place is simultaneously trendy, delicious, and affordable, you have to pinch yourself a little bit. Service was also impeccable - sweet, thoughtful, attentive. Plotting already to take all my friends here.", "author": "Janett R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I can walk into this place and they immediately know what type of curry (pumpkin) wine (red, and dry) and spice level (thai hot). The food is always delicious, and staff friendly. I would consider this one of the best thai places I have been top up here, and they don't overload with sugar (more authentic)", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-14", "description": "Food is excellent\n\nAmbiance is very pleasant and tasteful\n\nService is the worst I've ever experienced in my entire life. 4 out of 4 times I've visited they have forgotten at least 1 order and we wait between 20-45 minutes extra.\n\nThis most recent experience was the final straw and I won't be returning.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Stopped by Saap Ver for dinner with friends. The service is good, wait-staff attentive... though it can take a little longer when the place is packed.... which is understandable. The dishes are flavorful and not too salty. We ordered the salted wings which, IMO, is wings & drums chopped in half (so, pieces are smaller), seasoned with salt & pepper, then deep fried. It's served with a sweet chili sauce. Main course were eggplant basil with calamari, a penang curry chicken, pad siu with prawn and pad thai with beef. Thai ice tea is not very sweet. The place can get a little noisy, but a very positive atmosphere overall. Personally, I like the movie poster plastered walls and the art theme used throughout, including menu. Overall, Saap Ver is one of the better Thai restaurants I've been to in the bay area. I'll definitely go back with more friends!", "author": "Cris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-14", "description": "The crowd inside here looked really promising when we showed up.  I was totally expecting some quiet, sterile Asian place with few customers and mostly delivery orders.  Instead, what I found was a  facility where considerable thought went into the whimsical decor and a festive mood.  Unfortunately, the service left much to be desired.  Not only did the food come out incredibly slowly, but our waitress was way too hurried about her job.  Instead f taking time to ask if we needed anything each time she came by, she would come take plates away or set them down and within milliseconds run off again.  The food was decent, but not decent enough to wait so long to get it.", "author": "Ash T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-27", "description": "Fun decor. Good for groups. Attentive staff.\n\nFood: Meh. \nCrispy fried duck in basil was a salt bomb and was 60/70% duck fat and not duck meat. (and it was anything but crispy).\n\nTamarind Veggies. Didn't taste the tamarind at all. \n\nI've had street food in Thailand....doesn't compare.", "author": "Nancy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "Retro Thai movie posters adorn the walls and menus achieve an ambience of not taking themselves too seriously.  While the menu is quite extensive, the result is that the handful of \"good\" dishes are hidden among a selection of mediocre entries.\n* Salt-grilled whole fish - fish was cooked well, and the accompaniment of sauces added a lot of flavor.\n* Salted wings - they split the flats to make them easier to eat.  Decent option if you prefer extra crisp wings.\n* Crying tiger - was cooked really tender and flavorful, but seemed a bit spendy compared to the other dishes\n* Crab fried rice - ok dish, not a ton of crab but enough to impart flavor\n* Basil chicken - meh, not very basilly, so it missed on the premise\n\nWhile they were pretty busy on a Saturday night (there were multiple rowdy birthday groups), there were lengthy gaps where we were left looking for staff to no avail.  To echo many of the other reviewers, we found small flies in some of our drinks as well.", "author": "Lee S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-17", "description": "We've been here to eat three times now and am not sure how this restaurant gets its great reviews quite frankly. While the space has a cool vibe, the thai food is average to good, small portioned (relative to other Thai places). On top of that, the service was awful all three times we've been there -- where we had to stand at the front for a *long* time to get seated, then another 20 minutes for a server to come, then another 20+ minutes for the food to arrive, which arrived lukewarm. And during the meals couldn't get the server's attention during the meal for drinks, etc. *And* then the last time we were there, they were extremely rude to us after we paid the bill -- we're guessing for *only* tipping 24% on the pre-tax amount (the suggested amounts on the check were post-tax, and started at 18%....).  We tried to eat here a 4th time (it's the only Thai in our area so...) and they ignored us completely as we stood at the front -- even went up to a server and they said \"yes\" we'll be right with you, just sit down\" -- and no one came to serve us (20+ minutes) and then it was closing time....they *never* came to even check on us -- just ignored us so we would leave. We'll be taking our business, and our positive recommendations, elsewhere now.", "author": "Kate A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Had a nice time at a private wedding reception here last week. I had never been and don't eat s whole lot of Tai Food, so wasn't sure what to expect. All in all it was great. Staff was friendly, drinks from the bar were good too. As for the food, I thought it was great. Of course I didn't personally like everything that was served, but that's expected with my elementary food palette. Some dark colored noodles were great, seafood fried rice was great. The rib eye dish was my favorite for sure. I would totally go back if I'm ever in the area again. Nice location, the restaurant itself is very clean and well decorated. And just to make note because of all the mentions of flies in other reviews.. I didn't see one fly in the four hours I was there eating and partying.", "author": "Nick P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-30", "description": "The reason for the 1 star is purely for the terrible service. Not once, but twice. I went several months ago and was not acknowledged for 15 minutes while the restaurant was empty and had 3 tables busy only. I let them know that I was displeased with the service and left. The second time I walked in and told the waitress that we were a table for 3. There were at least 10 tables empty and she rudely said \"I need to set up a table first.\" I agreed and stood waiting for her to set up a table, she asked me to stand by the bar in a rude way when I should have been seated by then. To sum it up, decent thai food but terrible service so I wont be going there again.", "author": "Hassan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-13", "description": "The only thing positive about the experience was the food... which took an hour... for two people. We came in, were seated, and ignored. The table next to us was seated after us, but the server went to them first, and never checked in with us after we ordered. After one hour we asked about our food- she did not come back. Someone else dropped the first plate to us without saying anything- second plate came 10 minutes later after first plate was cold. When we asked for the bill we were charged for an item we did not order. No manager came to follow up. Won't eat here again.. all of this could easily have been remedied by a little bit of communication instead of ignoring us.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-02", "description": "Our friend had her birthday dinner here. \nFirst time coming here once you walked in its like vintage, feels like your in Thailand even though I never been to Thailand but the employees are  dressed, and the place , movies in Thai. Easy to find parking. The food was just okie I would really crave the food and come back. We had thai friends so they say this is really authentic thai food like lots of fish sauce and you can really smell it. The.only thing I didn't like was omg the flies was everywhere I think their are little small fruit flies everywhere and in their bathroom had them flying all over the place.\n\nThis place is very authentic thai if you really want to try real thai food come try this place .", "author": "Hoa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "You know how everyone raves about their {insert older family member here}'s cooking and how nothing...just NOTHING tastes the same? Well this place does it for me.\n\nMy dad is actually a Thai chef. I'm Thai. Mom's Thai. Whole family is Thai. I've spent a very very large part of my life in Thailand and basically only ever knew my family's Thai cooking.\nNothing has ever impressed me or been close to this level of Thai cooking until Saap Ver.\nThey do not hold back with the spices or vibrant flavor. Even their Pad Thai dish is as close to my dad's as I have ever had (he owned a Thai restaurant in New Orleans)  ---not that sweet style and mysterious orange color that Thai places like to serve to \"Americanize\" it.\n\nWhat really intrigued me was their Nam Phrik sets. You don't really see this style of Thai cuisine in the states and I was dying to know if it tasted like my grandmother's. Not completely but pretty damn close and that's still saying a lot. \nI'm still working through the menu but I can proudly say I've accomplished a good chunk of it and I'll be gladly going back for more.\n\nThe ambiance is fun, the staff is friendly and if you look around, there are a shit ton of Thai people eating here.\nSaap Ver, I hope you stick around so the next time my mom visits I can show you off to her and she is comforted by the idea that her daughter has not traded in her heritage for organic quinoa salads and $11 green smoothies.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-11", "description": "Sometimes, you just need a solid, non-pretentious place to get good hot spicy food and a strong tropical-tinged cocktail.  Saap Ver delivers.\n\nMore fun atmosphere and slightly better food than it's predecessor Grand Poh Bah.  Service isn't perfect but they just opened.  Show them some patience and they will get you all taken care of.", "author": "Troy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "I had the Tom Yum Goong. The shrimp seemed infected as there were tons of white spots usually meaning it's low quality and could get you sick. Low and behold, I was sick for several days with the chills and flu shortly after. At $18 plus tax for a bowl of soup, you'd think they use fresher ingredients.", "author": "Fan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "OUTRAGEOUSLY GOOD.\n\nI've tried several items on the menu and have been blown away every single time. You know how there are some places that are so memorable because they redefined that type of cuisine for you? Saap Ver is that restaurant for me. I think it ranks within my top 5 favorite restaurants *ever*. \n\nI recommend the larb fish salad, grilled pork neck, spare rib soup, any of the noodles, and any dish that comes with pork belly. All of the dishes are really well-presented and look beautiful. Even the sticky rice came in a - for lack of a better description - cool-looking gold bowl. \n\nAs others have said, this place has great decor and a trendy/casual vibe. Their bar was full the last time I went, so perhaps their drinks are good too. Workers are friendly and give great suggestions. I can't wait to introduce friends to this so I can eat here again and again and again....", "author": "Melody Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-06", "description": "Closest taste to being in Thailand, pretty authentic. Good flavor, nice ambiance, really cool decorations, Old Thai movie posters n stuff. Only complaint is food takes long to arrive, they have alot of take out orders. Also price is kinda high, but somewhat appropriate for the area. Service is js pretty good. Definitely worth a try if u love authentic Thai", "author": "Sammy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "4.5 stars.  Good place for Thai food.  Everything here is full of flavor; but my wife says its full of flavor because it is full of MSG!  Lol.  I don't know - but it is great here either way.\n\nMany of the reviews point out that this place is one for Thai street food, and they are right on.  But what makes them great is that they have a great knack for mixing the salty, sour, smokey, and spicy, while controlling for the temperature and appearance of the food.  If you eat a lot of Thai food, you know that a lot of the best restaurants don't necessarily have the best looking dishes.  This place can do both.\n\nThey also have a swanky looking bar (once they redid the place), and the place is definitely arranged for it to be casual looking and fun.  Good place for large parties\n\nMy wife is probably right though that they use a lot of MSG.  Both of us were pretty sleepy afterwards.  LOL.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-10", "description": "Last time was supposed to be my last time already but a friend dragged me there.. we ordered a rice plate asking if it was spicy; they assure us that it was not spicy at all. Impossible to eat and didn't want to change it. I pass on the fact they haven't check on us once or not even a smile to welcome us. The tips were already included. I won't be back and I recommend you to not lose your time or money there.", "author": "Morgane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "Came here with a group (there were 6 of us) on a Sunday afternoon before their grand opening. The food was great - all of the dishes were flavorful. The curry was so good that we had to order another portion, and we pretty much cleaned off everything on the plate for our papaya salad. But, the service was slow, perhaps because they were new. I'll give it a few more weeks before they get up to speed, but I'll be back again soon.", "author": "Ada C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "A big resounding MEH. Been here twice now, each time the food was underwhelming. The crispy rice salad and the pumpkin curry with pork (which doesn't come with rice) were the best things we had. Pad see yew, papaya salad (served with a large wedge of cabbage to make the plate look fuller), and the drinks (mimosa and sangria) weren't particularly noteworthy.\n\nCute, large space. Service was fine for us.", "author": "Charlene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-08", "description": "One of my friend's Thai coworkers recommended this place and it definitely didn't disappoint. The inside is decorated like a Thai beach hut, but it was quite dark. The food was amazing! We had papaya salad, a stir fry, pad see ew and the sticky rice desserts. Everything was so good. I usually get just below Thai spicy at Thai restaurants, but my friend wanted mild this time and it was still SO spicy. They have a bunch of punch bowls for drinks and they were really yummy (though very strong). \n\nThe prices were also very reasonable so...would definitely come back again!", "author": "Susie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Pok Pok? Why do I have to go all the way to Portland, or LA for this kind of Thai culinary experience?  \n\nFor those who've visited Thailand, this place is as good as it gets when it comes to recreating the street food dining atmosphere. Chef Kobe does a great job changing up the offerings to present these new-to-Americans-but-familiar-to-Thai flavors to San Francisco and I love it. \n\nNOTE: If you think your experience Pad See Ewe, Pad Thai or anything curry makes you an expert in Thai food, then this place is probably too advanced for you.\n\nALL of the sauces are on point! I highly recommend anything that requires dipping, because these sauces are LEGIT. \n\nI wasn't too big of a fan of the Som Tum/Papaya Salad though....Everything else was BOMB.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-24", "description": "I was there with four people in the party with my 4 years old daughter. Our party was charged automatically 18% service charge on our bill. Without any notice or warning we almost paid extra tip on our credit card slip. So be careful on your visit!\nWe were there at 12 o'clock! It was quite busy! We had to wait for a while on the waiters to take order, bring us the water and food. We understand that the restaurant was quite busy though! But all the waiters seem so rush and busy! The food was about average not bad but not good! We loved some of the dishes we ordered. I really liked crispy rice salad(but we found the hair on it) I would like to suggest the owner to tell the chef to wear the hut, so the cab percent the contaminated! \nThe decoration was very unique! I really enjoy the decoration there.\nService 3\nFood 3\nAmbiance 5\nOverall I will rate this place 3.5", "author": "Andy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "Had an Uber Eat coupon so decided to order from Saap Ver Aunthentic. \nThings we ordered:\nDrunken Noodles - Had great flavor and noodles were cooked well but was a tad bit oily. I would order again\nPapaya Shrimp Salad - Because I love spicy food I wrote in the notes Spicy! and they most definitely made it spicy so if you don't like spicy beware but if you do this may be the spot for you!\nTom Yum Noodles Soup - Overall great flavor but once again on the oily side. \n\nI would most definitely come here again! Cant wait to actually come in a sit down to eat!", "author": "Eileen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Been on the hunt for these dishes and flavors since our Thailand trip a year ago. I still love Ler Ros, but it's not the same.\n\nThai Iced Tea -- alls that's missing is drinking it from a plastic bag\nCrab Papaya Salad -- a little bit of crab, but lots of crab flavor. The slow, creeps-up-on-you kind of spice (which is both fun and terrifying)\nCrispy pork belly with sweet basil -- SO GOOD\nChicken Larb -- good but not amazing, don't think I would order this again.\nDuck noodle soup -- good, not outstanding, would order again\n\nOn my list to try next time: whole fried fish, and khao soi (didn't see it on the menu, but the waiter said they had it)\n\nIt's definitely not the cheapest Thai in the city, but would come back for the authentic food. Also, got a warm, fuzzy feeling in our hearts when our waiter commented that we ordered dishes like Thai people. Awwwwww.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "We went the day before the grand opening. There were 5 of us. We ordered a lot of variety of dishes so we could try many different things. 2 types of Somtum, Chiang Mai Style Pork Dip w/ Fried Pork, Thai Sausage Fried Rice, Tod Mun Pla, and several other dishes I can't remember anymore. We had a very good meal and left extremely full and happy.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Great place. Service was a bit slow but food was great. Good quality and quantity dishes. I will definitely go back when in the area.", "author": "Natalia M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-06", "description": "I was so excited to try this place.  There's nothing better in the world than great Lao food.  I walked in to the coolest ambiance ever with vibrant posters and music and was elated to have it all topped off with special Lao dishes.  But alas, it wasn't meant to be.  The food was too sour, the vegetables too scarce, and the food just too overpriced for what it was.  I was also told that I'd be charged $8 for a side of chili dip.  No, thanks. Still hanging on to the hope that more Lao food will make appearances in SF.", "author": "Ene S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-27", "description": "Over priced- I would agree with the pricing of this restaurant if the chef was actually present. \n\nStaff communication - while they are the sweetest as in Thailand, our waitress in particular was still learning on the job and English was a challenge for her. Wait time can lag, be prepared to flag the staff down.\n\nAmbience - cute, retro, Thai Lakorn/movie posters line the walls. Full bar.\n\nBoat Noodle - Came here for the authentic boat noodle image shared on Yelp only to be served pork noodle soup base with beef; not boat noodle.\n\nPapaya Salad - on point.\n\nSeafood stir-fry - a combinatiom of seafood clams and bell peppers were on point but $20 for the dish makes me second guess my decision to dine there.", "author": "Miss E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Kinda a nice lunch spot if you're in the area.  A few specials come with a soup and side.  A bowl of chili chicken actually had some heat to it!  TVs on display oddly playing daytime tele (why not run old thai moves from the 60s? but ok). A little chaotic with the service but ya, tasty, no doubt.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "My favorite Thai food in San Francisco. Zappver means overly delicious in Thai and They are really overly delicious! Authentic Thai dishes are serving make me feel like I'm in Thailand plus cool Thai vintage decoration theme", "author": "Ten S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "I'm updating my review because Saap Vee has improved their previously awful health score such that I am now willing to try it.  I ordered four dishes for take-out, the chicken and rice (I give it a 3.5 to 4- the sauce was spicy, even tho I ordered mild, and very flavorful but the chicken was so-so); squid salad (unusual and very good, the squid was plump and seemed quite fresh); pork salad(very good); Pad Thai with tofu (different, tasty, but just tofu - which was fluffy and flavorful- and noodles).\n\nGood enough to keep exploring the menu!\n\n\nI was looking forward to trying this place because it's on my way home from work - until I saw the HEALTH SCORE: 78. \n\nI'm in public health and will not eat anywhere with a score below 80 because that means there's some serious violation.\n\nCome on people - clean it up!", "author": "R. P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-08", "description": "I visited this restaurant after a friend told me about it. The place is too loud and their menu is not very user friendly. It's a thin booklet without any pictures the food. I asked the waiter for a recommendation and he suggested the chef's special \"salted fish\". It was a terrible choice as the fish was too salted and there was very little to eat out of it. I also ordered a coconut based soup and its presentation was pretty bad, it was hard to scoop the soup out of the bowl. \nNot to mention the place is pretty expensive. Soup and entree for $50? Definitely not returning to this place again.", "author": "Axl r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "They actually have excellent Thai food. Much much much better than other SF options. We mostly order to go, but the vibe of the restaurant is fun and boisterous and the bar makes solid cocktails. Warning: there are some authentic components to a lot of these dishes, so if you don't like spicy or the occasional vegetable you don't normally see in American Thai food, you might be a bit surprised.", "author": "Amjad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "This is a great restaurant.  My first dinner was with a buddy and two Thai women who lived the bulk of their life in Thailand and have been in America for a few years.  While my buddy and I were talking they were eating.  And eating.  They are not big women, both are petite. And they said it was the best Thai food they ever had!  Not just in San Francisco, or California, but anywhere.  \n\nI'm not a spicy palate person so my favorites, grilled pork, pineapple fried rice, and Thai iced tea probably don't catch the foodies reading this.  But, I love durian (the stinky fruit) and Saap Ver is the only Thai restaurant I've been to in the states that has durian on the menu.  It is served in a sauce over black sticky rice and the durian flavors (if you can get past the smell  fresh durian tastes of peach, strawberry, apple, mango and citrus), while not quite as winning as fresh durian, are wonderful.\n\nThe Thai ladies liked the food because it reminded them of the street foods of Bangkok and Isan.  They loved the spicy papaya salad, and everything else.  I've never had a complaint about the service, price, or quality of the meal, I go there often.  It's a wonderful addition to the world of reasonably priced great food in San Francisco.", "author": "Jesse T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "Sign on the door says it opens at 11, however they didn't let us in till 1130. Ordered soup as an appetizer and it didn't come till way after the main dish. The pad see ew was subpar. Wouldn't return again.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Amazing food! My Thai friend took me here and he said it reminded me of Thailand. \n\nWe stuck with basics. Chicken and rice for him, roast duck and rice for me, and Thai sausage to share. The Thai sausage was a little bit salty (get your mind out of the gutter ;) ) but it went well with the palate cleansing vegetables and jalapeños and lime on the side.\nThe roast duck was well cooked and super moist. Good balance of fat as well.\n\nThai tea was off the hook and my friend got a coconut ice cream (served in a coconut) which was a little too sweet but overall good. \n\nWould definitely come back for more!", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "New Thai spot serving dishes true to its roots. The pad thai comes wrapped with an omelette, just like they do in Bangkok Chinatown. Their rice ball salad is even better than my previous favorite at Champa Garden. Can't wait to try more of their dishes. \n\nThey have a full bar, and the spicy cocktail I had was very nice. The decor is pretty awesome, with a movie theatre theme. Happy hour menu is served all day!", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "This place is the best Thai food I've had in the city! Authentic, spicy and full of flavor. To top it all off the ambience is really upbeat and fun! This is perfect Friday or Saturday night spot to go out for drinks and delicious food.", "author": "Jacqueline C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-04", "description": "Pad Thai way too sweet\nRoasted duck over rice ok, very plain\nTom yum noodle soup good\nCool decor\nNice service\nPapaya salad was good\nShrimp rolls pretty good", "author": "Jones T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "Yummy Thai food, good size portions, fair prices.\n\nVery fun atmosphere with old classic Thai movie posters on the walls.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Sitting in Saap Ver really transports you to Thailand--the decor is vibrant and creative, and the food is authentic as promised.\n\nI was really impressed with the attention to detail in general...the menu is deep and well designed, and the dishes are served with fragrant fresh spices. \n\nAdd in the reasonable prices and spacious dining room, and I'll absolutely be returning.", "author": "David Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Wow. The food here is really good. I ordered delivery from here via uber eats. I tried the spicy chang mai sausage, the pad prik king green beans with pork and some steamed rice. The highlight for me was the sausage the flavors accented each other so perfectly I just wish it was larger! The green beans were cooked to my liking I cannot stand when a restaurant over cooks veggies and they become soft. anyways this was my first time eating from here and I will definitely eat here again.", "author": "J B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-28", "description": "Do not sit at the corner table. Took 10 min to receive a menu. Ordered, and 30 min later, waitress came to retake our order. Four tables arrived after us and received their food before we left with empty stomachs. An hour and ten minutes of waiting. The water was good.", "author": "Jocelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "Omg this is so much better than I expected.\n\nI like Thai food. Real Thai food, the spicy sour pungent stuff that sings of lemongrass and galangal, of lime and chili, cascading over the tongue with torrents of flavors. In other words, not pad Thai. That said I don't expect to get really good Thai food most of the time. \n\nI came into this restaurant and saw them advertising northeastern Thai food, otherwise known as isaan or e-San food, which is more like Lao cuisine than traditional Thai. I was stoked, and decided to go out on a limb, asking the waitress to recommend good e-San fare. I got a pork rib soup that was truly superb: spicy, sour, fragrant, with ribs soft and falling off the bone. \n\nI also wanted papaya salad after seeing the yelp pics of mortar and pestle. Sure enough they have three or four kinds of som tum, which is rare at sit down restaurants but common if you're really making it fresh. Without hesitation I ordered the salted crab version, which is super pungent from the fish sauce and the fermented crab legs. Yes, they are black. Yes, they make the dish that much more delicious. It was fantastic as expected. (Pro tip guys in most Asian cuisines anything fermented is what you can call \"authentic\" in your yelp review.)\n\nAnd the wait staff is so so nice in the way that only Thais can be. Yes there were some longer waits at times but when the people are so sweet, and the food is so flipping good, well, you just smile back and feel oh so happy inside.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Really yummy food. Really cold service. Make sure you order that second glass of wine before closing time. We had a big group and a table full of just-delivered food at closing but they did not serve drinks, replenish water, or offer dessert for a 9 person birthday dinner party after the 10pm close time, even though they accepted a 9pm reservation.  Waiter was too busy washing the floor to bring the check.  I'll still go back (seriously the food is good) but it's better if you pretend they close at 9:30. Authentic Thai food but no authentic Thai hospitality.", "author": "Saana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "The food was GREAT! The services was lacking. Two cokes were ordered, one coke and not-so-cold water was delivered. One of two appetizers showed up. Then one of two entrees showed up. Then #2 entree was delivered about 15 minutes later without the appetizer. We were checked on once. The staff seemed to pay us no mind. They were pleasant though.", "author": "Douglas R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "I have never been made angry by a restaurant but this place did the trick. An hour and a half after we had ordered the food it finally gets to us, and it's completely the wrong meals. The receipt on the outside of the bag was correct so this was a mistake made by the restaurant. I called the restaurant and the guy on the line tried to immediately blame it on the Uber driver. Afterwards he said well, there's nothing I can do you have to contact Uber. The food we got was much less, super basic, and contained shrimp which I'm allergic too. So not only did they mess up, they didn't apologize and they didn't find any way to fix their mistake. To top it off, the little food I could eat was horrible. The soup tasted like it was made from dirty dish water.", "author": "Nadja K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Just came from Thailand and the food here tastes just as good as the food I ate there. \n\nI recommend the Kra Pow Gai and Pork belly Pad See Ew.", "author": "Nino P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "Just had the most underwhelming hainanese chicken rice. Absolutely bland chicken, obviously unseasoned, super dry, and with sauce that has too much of a kick that kills the remaining flavor of the chicken. Never order this.", "author": "G C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-20", "description": "I wanted so much to like this place. \n\nAfter Grand Pu Ba (previous Thai restaurant), I hoped this place was gonna be better. Not sure if it's the same owners and they just rebranded, but the service is about the same. Slow. There were maybe 3-4 tables total and our food took more than 40 minutes to come out. \n\nThe food wasn't very good either but maybe we didn't order the right things. We ordered from their \"happy hour\" menu - thought it'd be a good deal for $5/plate: chicken wings and fish cakes. The wings are not your typical wings! Imagine your normal wings cut in half. There were maybe 2 of those (so one wing total?) and then maybe 4 pieces of that sharp part that usually gets chopped off (cartilage? No meat on it). So all-in-all, maybe about 2.5-3 wings worth of meat. No significant flavor. Just fried, salt and pepper. Blah. Fish cake was decent, good flavor mix, but think it was store-bought. Blah. We also went for the Pad Thai, a good dish to test for comparison of other Thai restaurants. The shrimp was way overcooked and the noodles were as chewy as rubber bands. Blah. \n\nEnded up being less than $25 but it was totally unsatisfying. I think I'll give this one more chance since the other reviews made it sound so incredible. If I don't change the rating from 2 stars, I didn't enjoy it the second time.", "author": "Cookie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "We did a takeout. The food is very good, by far very authentic. Super happy with Tom Yum Noodle - the best I ever had in the U.S. I'am also pumped with Salted Egg Som Tum because I never had any where else besides Thailand. If you want authentic Thai food experience, definitely check this place out. They nail it.", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-05", "description": "First of all,  I tried to order online, but their website was down. Therefore, I phone in my order. Anyway, looks like their price went up when I picked up my order. I got a Sea Bass Clay Pot.  online is $20.00, and when I picked up it's $25.00 + fee, ended up $27.00. It's not what I was expecting to have. my order looks like a mess. No more ordering from this Thai restaurant for sure!!!!", "author": "Tiffany J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Really different than most Thai joints. If I were in the northeast of Thailand, a place like Saap Ver would be there. Everything was delicious and authentic. I love the hustle and bustle too. I really cannot find one thing to nit pick about. I was truly in food heaven. This is the kind of place that even if you're full you want more. I recommend the bbq chicken w/stiky rice and a papaya salad. Also the duck plate. And of course mango and sticky rice for dessert. Exceptional. Standing ovation. Blowing kisses.", "author": "S. G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Food was absolutely delicious. Presentation was elegant. Decor very unique Thai movies on the wall.", "author": "Sherwin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "My coworkers and I had pad see ew with pork, eggplant stir fry tofu and shrimp vegetables stir fry lunch set.  Fresh Spring roll, chicken satay and soup.  All was very good.  My only complaint was I only got 3 shrimp for an up charge of $3 in a lunch set.  Even for lunch that seems like a very small portion.", "author": "Leah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "We had the healthy spring roll(no fried) as appetizer. No any flavor but we think it tastes healthy. Yum soup noodles was awesome. I had it extra spicy and loved it very much. Pad Thai is a safe choice here, and as you may not, it won't wrong to get Pad Thai in a Thai food place.", "author": "Donna Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "If you like it hot - order thai spicy!  Thai country style food that leaves a little sweat.  I had the clay pot sea bass and the larb salad.  Larb salad amongst the best I've had.  Sea bass good and would get again after I try a few more things.  Good street side seating as well.", "author": "P K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Been here a few times now, and it's definitely a nice addition to the neighborhood.  The space is really interesting, while the food is hit or miss.  Both the pad cha scallop and the pad thai were kinda disappointing, but the tom yum goong and five spice pig leg were both really flavorful and delicious.  Will definitely keep coming back here to try the other interesting items on the menu.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Yes! So stoked this showed up in the neighborhood. I was walking by and was immediately struck by the sign with Thai characters.  I know they replaced another Thai restaurant in the same spot, but that one looked kinda generic and I actually never tried it. \n\nThe food at Saap Ver was super authentic. Crazy spicy and funky. I tried dishes I never see on most other Thai restaurants. Thai sausage salad with crispy rice and a dry noodle soup with pork and peanut (kuay tiew tom yum moo). Both were excellent. \n\nMy only complaint was that it's in this weird strip mall-ish restaurant near the design center and was completely empty. They did just open recently so I'm hoping that'll change. I'll definitely be back tho.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Ambiance is very cute and food was very tasty and eclectic. The menu was almost too big and it was hard for me to pick something because I was interested in so many items! I ordered for a large office lunch and the food was prepared quickly and still tasted great. \n\nWhile staff was very nice, they clearly are a little understaffed. For example, I had tried to call in my pick-up order but no one picked up the phone. Luckily, my office is close so I just popped by, but I hope they get better accustomed to the busy lunch hour or get more staffing.\n\nI tried the crispy rice salad and loved it. We also ordered a bunch of apps and I thought the Fried Tofu and Spring Rolls were awesome. I would probably skip the Larb Wontons just because I liked the other apps better.\n\nOverall, I'm a fan :)", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Ok , just finished the most amazing dinner at Saap Veer and i am in heaven! A must try people! Delicious, authentic( if you travelled to Thailand) and fresh!\nLoved it!", "author": "Mircea M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Food is great, ambience is great, service needs work. \n\nThe menu selection is more diverse than other thai places I have been to. You have your standard pad see ew's, curries, papaya salad, and tom yum noodle soup, but there were lots of other things I'd never seen, like fermented rice sausage, shrimp past fried rice, mixed fruit salad, etc.\n\nService was slow but it was due to clear understaffing. 2 servers with no bussers cannot handle a full restaurant on a Saturday night. Once they hire more people the bottlenecks should go way. One thing that bothered me was a women in the kitchen had her hair down and no hair net - big no no. It's literally a matter of time before a customer finds a hair in their food. \n\nI ordered the shrimp paste fried rice, as I love shrimp paste anything. It was delicious.\n\nPrices are San Francisco prices. There's no point in fighting them anymore. They are here to stay. \n\nWill definitely be back - the ambience was too cozy and food too good not to, but hopefully the aforemnentioned kinks will be worked out soon or it may be hard to develop regulars.", "author": "Polly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "Okay I think an update is required. I probably might have went there on the wrong day and time. Today they had a manager who kept the food moving from the kitchen to the tables, so the service was much better than last time and also the guy who spilled water on my table wasn't there. \n\nI ordered yellow curry with rice and Thai ice tea. The quantity was good and I was very satisfied with my meal. The curry tasted good, not the best that I have tasted but still was better than most of the Thai places that calls themselves authentic.  The Thai ice tea tasted like thai ice tea. \n\nI was in and out within 30 mins and this time I got my soup of the day. Yay. I am definitely going back because there are so many things on the menu that I would like to try, though I will go there when its not too crowded.", "author": "Ankit A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "I can't wait to go back and try other items. The service really needs work but 2 of our dishes were stand out delicious and 1 was what you would expect.\nThe SPICY CRISPY RICE SALAD - Thai Sausages, Mint, Ginger, Peanuts was spicy, tangy, crunchy and delicious. I would order that again in a heartbeat.  \nThe PAD SEE EW - Flat Rice Noodle, Chinese Broccoli, Egg, Soy Sauce was just what you would expect to get when ordering PAD SEE EW. Nothing special, sort of on the comfort food side. \nThe PAD RED CHILI -House Made Red Chili Paste, Peppercorn, Galangal, Kaffir Lime with Chicken was also a wonderful treat. Spicy tender chicken bites ( a little on the oily side but it tasted so good, who cares ). Bite into the peppercorns for a little flavor explosion. \nThere was no Singha the day we went. Boo! One must have Singha Beer when eating Thai food. \n\nIt's a delightful addition to my neighborhood.", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "SOLID 5 stars. You want a taste of legit Thai food come here. It was like heaven in my mouth. The thai sausage crispy rice was amazeballs.  Larb is always my go to and I was not mad at it! I am telling you, it tastes like the real Thai experience. A little $$$ but well worth it!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Went to the restaurant for the first time and instantly fell in love. The decor, music, service, everything indicates a truly authentic thai food place. Ordered the pad thai with duck, seafood sizzling plate and barbq chicken. The pad thai was delicious and the duck had a lovely crispy skin. I like thai chillies and can stand its heat, but if you are not much of a spicy food person, you might want to ask them to avoid a few chillies in the seafood sizzling.", "author": "Fatema M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Great service! Crispy, delicious spring rolls. Medium spicy was a little too much for me, but still good. Definitely coming back!", "author": "Humaira A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-18", "description": "The food is good, and it's a nice option in an area that still doesn't have a lot of restaurants -- especially ones that are open on weekends.  The 2 stars is more for the service: the servers are always pleasant, but everytime I come here, the wait to get your food from the time you order is always too long (I was here two days ago and waited 25 mins. before my food came, and it was just the lunch special!).  I always, always have to flag someone down to get them to take my order, bring my check, or even refill my water glass.  I've tried coming here on a weekend, weekday, lunchtime, dinnertime, and they always seem understaffed, so I'm not sure why it's an ongoing issue.  Too bad -- with the amount of housing that's being built in the area, they'll just get even more crowded (with any luck), so it'll be interesting to see if they survive or if people get fed up with waiting and just leave (something I've seen happen on more than once occasion here).", "author": "Carlo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "4 stars for the ambiance and the crispy prawn rolls.  Really like the decor here, a lot of effort went into it.  The shrimp here is large and fresh in all the dishes we tried. The Pineapple fried rice was ok. The service could've been a bit better, but for lunch time it was decent, no complaints like others had about dinner. The bathrooms are spacious but could be cleaned better. Will be back to try out the attractive happy hour specials.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Great authentic Thai food, atmosphere is old time movie. Terrific whiskey selections, even have Yamazaki 12 & 18 year. Got to treat myself.", "author": "W K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "So glad Saap Ver took over for Grand PuBah.  Authentic Thai is back in the hood!  Four different ways to prepare papaya salad?  Yes, please.  Liver in my soup?  Yes, please.  Po Tak is back on the menu.  Yes, please!!!\n\nCan get crowded and loud at lunchtime, take out time for me.  I'll return for dinner and cocktails.", "author": "Ania B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "I'm a good friend of SaapVer seeing this from the very beginning of all the process myself..., I love the effort of the small team they are trying to invent, cook, and serve their food & drink at best of everything. Please come try their great food at SaapVer, they're still working on an awesome Bar idea. I can't wait for the grand opening event to come, just take your time and we will support you guys like this forever...., \n\nJust come out Enjoy & Have fun with them at SaapVer...!!!", "author": "Nop P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Hi Yelpers, \n\nI highly recommend this place. Outstanding food, beautiful decorations, friendly staff -- overall great place for a good time! \n\nEnjoy.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-16", "description": "The restaurant and bathroom was full of little flies. We didn't finish our meals. Disgusting !!", "author": "Falk G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "I really wanted to eat AUTHENTIC thai, so I thought I'd give this place a try based on reviews & photos. I thought it was pretty close given the lack of resources, but the effort to create true authenticity was bold! Menu was in English AND Thai (I prefer to order in Thai because I am more familiar with the actual Thai dish rather then the \"American\" translation) and typically anything you could order at a simple restaurant in Thailand, you could find it here. The food, \"Saap\", as I could tell the quality of the ingredients they use. Overall, I would definitely visit again when in town. If you ARE looking for a more modern concept, you probably won't find it here.", "author": "D K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Food is extraordinary! The taste are very similar to homecooking in Thailand. No longer do I need to go to L.A. for an authentic style of Thai food. The ambiance is great. You can bring a date or your family amd you can't go wrong. The restaurant is great proximity to AT&T Park. It is a good place to get a drink at their full bar after the ballgame.", "author": "Eddy M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "Overrated food. Bad service.  Dined in at lunch time. It took a long time for the waiter to come by to take our order then they forgot our order. It took an hour to get our food. I had to get up to ask the waiter several times. They just kept saying in a few minutes. I saw they had many orders on their computer like from ubereats and other sources. Ours was forgotten. It was not even that crowded in the restaurant. They should have comped us for the inconvenience. They only gave us a couple of lousy ice teas and a 10% discount. We had to get our food to go by the time it arrived. The big downer was that my noodle dish was terrible. The noodles were overlooked and gooey. The meat was overlooked and chewy. They had left in the cartilage in the meat instead of taking it out so much of it was inedible. Small portions as well. Never going back again.", "author": "Robbie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-03", "description": "this restaurant hosts illegal after hours parties with hundreds of people, including underage minors and prostitutes,  several nights a week after they close. they keep everyone awake with their fighting, screaming, drunken brawls and crazy loud music. they don't respond to any requests from their neighbors upstairs about the noise. i don't understand why they're still in business.", "author": "Pari A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "The food is good but not as good as other Thai places I have gone to. The only reason I come to this one is out of convenience.  The service here really sucks!!!!! They took forever to come and take our order then forgot something we ordered  then brought it 20 minutes later!! Then tried to charge us for the item!", "author": "Catherine F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-23", "description": "A gem of a place for authentic thai cuisine. I love their tom ka, red curry and fish cakes! Also has a full bar and is a fun spot. Try their homemade coconut icecream for a treat.", "author": "Heini V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-19", "description": "Full of GNATS everywhere!\n\nThis is sooooo against health code! There were flies flying everywhere and landing on your food, there was no way you can eat without them being in or around. Maybe they should close the place and exterminate all them bugs first!\n\nService is very slow, and the wait staff does not seem take note on what you wanted to add or subtract from your meal.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-02", "description": "Flys, gross. They were everywhere, I definitely got an arm workout swatting then all away.\n\nThe food is solid when there aren't flies on it, or dead bugs in it. They can definitely kick the heat up and is a great spot if you love spicy food. Some of the dishes like the fish and rice salad had an overwhelming ginger taste to it.\n\nThe service was spotty, and our food took a long time to come out. We had to wait around 30 minutes for our food when the restaurant was half full and no explanation from the waitstaff.", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "Good food.\nBut horrible service. \n\nWatch out for flies in your food.  Found  flies almost 4 times in food. Got plates changed. Not food changed.  Never coming back", "author": "Bargain D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I ordered take out and was greeted by Steven at the bar who was extremely kind!! He was incredibly knowledgeable about Thai food and the food was remarkable! Luckily I live across the street and will be back for more nom nom nom :)", "author": "Sara P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "This is my go-to Thai place. The food is the most authentic Thai I've tasted since a trip to Thailand years ago. Everything on the menu is tasty but my favorite is the drunken noodles. The place is cute too, and big, so you don't usually need a reservation ahead of time for 2-6 people. The drinks are great here too. Real fruit with liquor inside, etc.", "author": "H L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Tried this new restaurant with my family. Great atmosphere, service, and food. We will definitely come here many times in the future. I highly recommend.", "author": "Mark E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-05", "description": "Super bland & overpriced for Chicken and Veggies.. Not even salt or pepper on the chicken to give it a little flavor. The only item with some flavor was the broth and that was probably not from the chicken they served. I will try again in case it was an off day but waiting 20 minutes for a lunch order is not great either.", "author": "tammy m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Great thai food with a cool retro theme. The crispy chicken fried rice is really delicious.", "author": "Ian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-18", "description": "Such a standout Thai restaurant. Delicious dishes you won't find at most places in SF. I was taken here by a Thai friend who says that the food is really authentic. Try the crab omlet, it has an amazing sauce. Pleasant and cute interior and friendly staff too!", "author": "Brian R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "Painfully slow. It took them 45 minutes to bring our appetizers despite repeated reminders. They are way understaffed.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Our waiter, Ryan was very accommodating to my party. The Hostess, Yok, was very friendly and greeted us right when we walked in.", "author": "Derek C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-13", "description": "I went to this place for lunch with 5 co-workers. The restaurant was not very busy when we arrived as 1/3 of the tables were empty. You might think you will get better service as the restaurant is not busy. Think again! The service was very low. We got there by 1:10PM and the food wasn't ready until 1:50PM. Also, the food was very disappointing. I ordered Roast Duck Over Rice and the dish is barely warm. Also, the roast duck has very strong propane taste. One of my co-worker ordered Garlic Pepper Pork, and she said the food was extremely salty. Other co-workers ordered fried rice and pat see ew, but they said their food were OK. I guess they do have something that is good, but I definitely do not have courage to give this place another chance. If you are going to give it a try, please avoid the yucky \"propane duck over rice\" and \"salty pepper pork\".", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-03", "description": "Ordered through the Yelp app. Came and they hadn't even started making my order. Said five minutes but didn't give me priority. Took 40 minutes to get my food and the food was a small portion for the price and I got Togo and they didn't even give me a bag.", "author": "Solomon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "My Favorite Thai food place in SF. One of my favorite dish is Thai style oyster, they have four kind source that go with the oyster, very interesting tasting. Coconut soup is a bomb! Chicken wings and cocktail shrimp are very nice too! Love here!", "author": "Rain H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Finally, a legit Thai restaurant with some food country-style dishes you can't get from the other places. The fish larb is crispy, flavorful, and the closest thing (in SF) we've found to a dish we had in Phuket. Crying Tiger was delicious and cooked medium rare with a savory dipping sauce. Gonna have to go back for some of my other childhood favorites like Kao Mun Gai and boat noodle soup.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-26", "description": "Lovely food, fun decor. But entirely too loud to talk. Decibel level at 80 even BEFORE the live music started. We had to give up talking and just eat, which is unpleasant.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-26", "description": "If I could rate half stars, I'd give Saap a 3.5. Ambience is cute, vintage, large big screen to watch sports games on, and parking is ample. Only negative on the physical space is that at the end of the night, they dimmed the room and I literally had to turn my iPhone flashlight on to see the food on my plate and finish out the meal.\n\nStaff is really friendly and regardless of who your server is, if you catch anyone's attention, they will stop and assist you. The first time I went, the food service took incredibly long, twenty five minutes for the first app to arrive to table on a fairly slow night was frustrating. However, the food came fairly quickly on our second experience, so I was glad to see them work those service kinks out. \n\nOn each occasion, I have been surprised at the flavors and layers of the delicious food, just a few hiccups on service and on a couple dishes that could make this place truly great. On my first experience, we ordered the pad Thai, crispy pork belly with basil, chicken satay, and tom kha. The pad thai was flavorful with just the right amount of sweet with the flavor of tamarind and savoriness. Ample shrimp and a surprising addition of a soft thin but fluffy omelet that covered the top. Almost like a Japanese omurice, but filled with pad thai instead! The tom kha was hands down the best tom kha I've ever had. Again, all flavors really well balanced with creamy coconut milk, spice, sweet, savory, and sour. I could not get enough. The only misstep with the soup is that they utilized random hacked chunks of chicken, which were hard to eat the meat off of, and left little shards of bone to pick out of every other spoonful. I imagine they have less waste and it may be more authentic to Thailand, as they are butchering the whole chicken versus utilizing the breast or drumsticks alone, however the velvety mouth feel of the soup was tainted by the shards of bone.  It was the equivalent of getting sand in your oyster or egg shell in your omelet. No matter how delicious it tastes, that one mistep can ruin the dish. Pork belly was decent, crispy skin, a few pieces were dry but the spicy soy and basil sauce made up for it. However on my second trip the pork belly was terrible. The skin was not crispy but so hard and chewy I had to spit it out, and the meat itself was terribly dry and fiberous. We asked the server to take this plate away, and she easily obliged. The winners of night were the pork neck salad and green curry filled with chicken and Thai eggplant. The pork neck salad is similar to the dish served at Ler Ros, however the lime and Thai chili sauce coats the luscious fatty pork neck and is covered with mint, Thai basil, and green onions, while the sauce is served on the side at Lers Ros. Both different, but equally delicious. A hands down favorite of mine.", "author": "jessica c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-02", "description": "Looks nice but bad service. Sat for 20 min and was completely ignored. Asked two passing waiters for service, but was still ignored. Wasn't even very busy.  Cant even properly rate it, never even got a drink. Bummer....smelled good.", "author": "Joshua G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-01", "description": "This place has potential. Ambience is nice. \n1st try had Duck and Basil....excellent. Chicken flat noodle....excellent.  Service....HORRIBLE!\n2nd try had pineapple fried rice...excellent.  The pork belly basil....good. The Seabass clay pot....HORRIBLE. \nService......HORRIBLE AGAIN. \nTook forever to get order. Took forever to arrive, about 20 minutes for first dish. When we asked about Seabass ($20),  it arrived about 40 minutes later super bland and over boiled in claypot. The fish was rock hard. Showed our waiter and didn't eat it.\nFinally the bill came and the waiter knew we were frustrated and said the best he could do was to discount 10% off the bill. ... $4.50!?! WOW. Next time take off the awful tasting seabass off the bill.\nThen he finally refilled our water glass after being empty for 30 minutes.\nTHE SERVICE IS TERRIBLE!!!! TAKE THE SEABASS OFF THE MENU!!!!", "author": "Karma Is Coming 4 U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-23", "description": "Our office ordered lunch take-away. Every dish was surprisingly BLAND. We don't want to write off Saap Ver because they just opened and they've done a great job with the interior decor. Please tell the chef and cooking staff to add more flavor, garlic and spice. Thanks!", "author": "Greta K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-16", "description": "Love this place\nThe duck and the eggplant stuff with shrimp is so good\nWe like it with green curry", "author": "R K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Thai rice sausage and laarb fish (??) were really good. Much prefer to Ler Ros as I feel the food here feels more current and reminds me of what you'd find in more up market cafes in BKK. Also think the flavours here are more complex, bold and yet well balanced compared to Farmhouse.", "author": "Joanna Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "We came tonight for the soft opening and were blown away. The ambiance, the food, the bar - all exceeded expectations...and this is just the soft opening! Can't wait to come back often!", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-07", "description": "I went to get a massage at Suchada and thought how convenient this would be to go eat at Saap Ver. I was a big fan of Gran Pu Bah ( previous place) and thought to give it a try. \n\nWell, things did not turned has planned. The food was absolutely infect! \nFirst of all, the menu was small and did not offer much choices. They have a big kitchen so I am not sure why they decided to make such a small menu. So I ordered an appetizer, which was tasteless and horribly fried. Then ordered the tom ka gai soup. It is usually my ultimate favorite and you can tell if the place is authentic. Well what I found inside made me want to vomit... The chicken pieces were chopped with bones and nerves. Obviously impossible to eat. It was looking disgusting and thought to myself what kind of chef would serve a soup like that! I was even afraid to try the soup itself without the chicken thinking that it could get me food poisoning. So I threw it away. Spent $12 for nothing. \nThen got the chicken basil dish with the fried egg. Tasted mediocre, greasy. They grinned the chicken so you are not even sure what you are really eating....\n\nI usually don't leave bad review but the food there is not good. \n\nIn my opinion, this is just a place where you can get a good drink, that's all.", "author": "Laetitia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "This place is the best Thai restaurant that I've ever had in my whole entire life. I've been to many zagat rated Thai restaurants in the OC and LA and nothing beats this place. The service was amazing, we had a huge party and all of our parents are pretty picky but they also loved this place. I'll have to come back here whenever I'm visiting SF.", "author": "Khoi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "My favorite Thai restaurant in San Francisco thus far. Their appetizers are okay but their main entrées are very authentic compared to all the Thai restaurants I've tried in the city. I highly recommend Ground Pork Tom Yum Noodles, Papaya Salad with Grilled Chicken and Sticky Rice Set, Chicken Thai Basil with Fried Egg, and Egg Wrapped Pad Thai.", "author": "Minnie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-30", "description": "Maybe I came by on a bad day, but we came in on a Friday afternoon when it's not so busy, just 2 of us. We came in and no one came to seat us so we asked if we could sit and we're told it was cash only. The waiter had a difficult time understanding us the entire time. Their internet had gone out so it was cash only, we we went across the street to pull cash from an ATM. No one saw us to sit us down so we sat ourselves down. My friend was asking if the curry was part of the combo and the waiter didn't understand. Then she asked what the soup of the day was and it's just a clear broth with carrots about 1/2 cup. We got the entree, soup, and appetizer combo. Our appetizers came out and they are tiny. The fresh spring roll is 1/2 a roll. Tasty but small. Then our entrees came out but they had forgotten our soups so those came out after we asked for them. The soup is an extra $3 and not worth it for the size. Just save your money and order 2 entrees instead of the combo.", "author": "Crys L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "I can't say enough great things about this place. Such an amazing staff, drinks, and food. Came for their grand opening and there was live music (which apparently happens every Saturday) and tons of authentic Thai food... None of that \"Asian/Thai fusion\" ish. Can't wait to come back!", "author": "Nick V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Love this place, if you looking for authentic Thai food, I do recommend this restaurant and please don't forget to ask for their special dish, they keep updating very often. Great food with good services and reasonable price", "author": "Damisa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Just really fresh tasting and excellent and authentic Thai food.  Very nice ambiance with new remodel, Thai movie theme.", "author": "Anibel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Was truly surprised by how good the food was.  Try the basil duck and clay pot SeaBass. Nonmnomnom!", "author": "Uri L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "They are open, for sure. Wanting a simple, healthy soup as i'm recovering from food poisoning, so I ordered Thai seaweed tofu soup. It was fantastic, and I bet it hardly ever gets ordered. The tofu was soft and fresh and the seaweed was delicious. Glass noodles complimented it nicely. Try it.", "author": "Michele H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "We got the larb fish, the spring rolls, the Thai rice sausages, and a giant pineapple cocktail.  All were really good!  The fish was our favorite.  Service was great.  A ton of interesting items on the menu.", "author": "James A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "This place is amazing. The crunchy salad with sausage is my favorite but seriously everything I've had is great. It is a bit spicy but in a perfect way.  So glad this opened so close to the house.  You must go here. I hate boring Thai food and this is definitely far from boring.", "author": "a g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-06", "description": "This was across-the-board mediocre.   The only element they've done successfully is the hip vibe.  We started with Deep-fried salted chicken \"wings\".  I use quotes because the meat had been cut away leaving a single bone deep-fried with minimal meat or taste.  Our other appetizer was fresh spring rolls about which one of my friends said they were they lamest he'd ever had.    The best entree was basic noodles with chicken which was flavorful but no better than a food truck.   The eggplant dish consisted of crunchy carrots and a small round green vegetable which had the taste & appearance of an uncooked green tomatillo, but they claimed was some eggplant.   Drowned in spicy red sauce, there was no flavor but spiciness.    The pork rice dish was a small amount of plain roast pork on white rice -- as boring as it sounds.    That was it.   The food arrival was shockingly slow and the service also sucked but no need to elaborate on that.   But hey - parking is easy.", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "We used to frequent the previous business and were very nicely surprised by the change! It had a friendlier more casual vibe change to the decor and ambiance. The food was much more authentic and was delicious. The staff was nice and attentive. Much more kid friendly than the previous restaurant. We really enjoyed our meal. Will certainly be back.", "author": "Mellissa B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "The best Thai restaurant in San Francisco! The food, the ambience, the service was outstanding. A must-eat-here experience.", "author": "Jimmie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "It's such a cute restaurant. I've never seen anything like it . The way they decided to decorate it is very different but in a good way.  Think it adds a very good touch to the pretty authentic Thai menu. Nice and spacious with a bar as well, wasn't too hard to find parking but I think I got lucky. The food was really good, I felt like I was back at home with my mom or back in Thailand . The menu is pricey but I didn't mind, and the service was great to top it all off. Will definitely be coming back .", "author": "Jasmine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "I was really please by how good the food was here! My friend who originally from Thailand suggested this place and told me that it was the most authentic Thai food restaurant in the city. I came here with no expectations but it was actually really amazing food! I will definitely come back here when I want to get some authentic tasting Thai food :-)", "author": "Jay S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-09", "description": "We really wanted to like this place but it was just not meant to be.  We have been to this location many times before it became Saap Ver and the same issues seem to be recurring regardless of name and ownership, the service is atrocious and the food is not worth the wait.\n\nWe came on a Saturday night when you would think ownership would staff up.  Instead, the front of the house was complete chaos with only about 80% of the tables seated.\n\nWait staff had no clue who had which tables.  We were greeted and greeted again but with no follow up.  I watched another table order and wait about 20 minutes for their food to arrive.  Another gentleman had to go to the waitress and alert her that their table was ready to order.\nThe owner had to run back into the kitchen to help the cook.  The bartender had to come out and clean tables and take orders.  Sad to say this is why we never went back to the previous restaurant at this location.  \n\nThis place is a great space but the front of the house requires a lot of work.\n\nThe back of the house could use some help as well.  We wanted to order items we have not seen on other menus.  Boy, was that a mistake.\n\nWe ordered the fried tofu and meatballs.  Eating the fried tofu was like eating cardboard.  What it should be is crispy on the outside and soft and silky on the inside.  No texture except for the hard fried outer crust.\n\nThe meatballs were packaged meatballs.  I am willing to bet a meal that this is the case.  Ownership, please prove me wrong.  If you do, change the flavor makeup of these meatballs because the sauce you use cannot make up for the blandness of the meatball itself.\n\nWe ordered the steak, a chicken curry and the fried chicken rice plate.  All were basic and completely standard fare.  \n\nMaybe we ordered the wrong items.  But I'm not willing to go back.  Sorry.", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Saap Ver was fantastic!  I really loved the food. I had the Basil Duck entree and it was amazing. The tom kha gai soup was excellent.  I highly recommend this restaurant!", "author": "Mike S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-27", "description": "As tenant who resides in the Metro at Showplace Square complex and a former patron of the restaurant, I've grown increasingly frustrated with how Saap Ver operate as a business. With no regard for the tenants above, they regularly hold after hours karoake parties into the early morning. They seemed to be more concerned with having a good time than serving its customers. Never had any issues with the former restaurant, Grand Pu Bah, who's owners were always respectful of those they were sharing a space with.", "author": "Biscuits G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-17", "description": "Portions were large! Got a vegetarian curry- so delicious! Fast service and fresh, hot, spicy food!", "author": "Payal M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-16", "description": "I was part of 12-person party. The atmosphere was very friendly with Thai movie posters on the wall and flags strung across the ceiling, like being in an outside food park. The staff were very courteous and friendly at all times. We did have to inquire on a few late drinks and food but the servers were always reassuring and polite. The food was excellent. I had spicy red curry with chicken which was great.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-31", "description": "My friends came to Saap Ver and just walked in on May 19. They said we are full inside but there's a table outside.  We agreed because there was a heater but the heater never turned up.  We ordered drinks and food at the same time but they wait staff seemed to have forgotten us.  To illustrate, the appetizers came out. They didn't give us napkins or forks or plates.  The drinks came after we finished the appetizers.  We had to ask for silverware and they brought it up.  Then one of the entree came out but the rest didn't.  One of my friends was late so I asked for the check.  It didn't come.  I asked for it again. It didn't come.  Finally, I said we are leaving unless you bring the check.  I also mentioned that they put us outside and forgot about us.  No one cared.  This restaurant didn't really care about their service.  The food was okay but the service was HORRIBLE!  Worst service ever!", "author": "Manny Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Omg the food brings me back to  my country, my past, my heritage, and now missing  my parents  cooking. Everything  is  amazing and tasty  good. I would  recommend  this  place to  all my friends. I would  definitely  be  back for more.", "author": "bouneson s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-11", "description": "I really wanted to come here but the numerous reports on Yelp about flies made me decide to wait until the Health Department makes them clean up. I hope the owners read this and realize they need to fix the problem if they want to stay in business.", "author": "Ruth E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Just go. Try anything, it's really good and the people working here are beyond sweet.", "author": "Jordan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "I went with a large group of Thai people, including my wife, and the place was resounding success with all of them. To be honest I don't know what specific dishes I ate as all the dishes were ordered by the group. But There was not a single thing I put in my mouth that was not ridiculously delicious! My wife is a huge fan of Northern Thai food and she has not stopped raving about it. Highly recommended. Very cool decor and fantastic service. We may be driving up from San Jose just to dine here again.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "Cool fun interior design with classic Thai movies on a big screen.\n\nFood fresh and yummy.\n\nWill visit again.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "Some dishes were good. Some were just ok. What we frustrated with the most was how long it took them to bring the foods out. It was a quiet Sunday and there were just a few tables in the restaurant. It also took them over 15 mins to come out and tell us that the dishes we ordered were no longer available. We had to order new dishes which took forever before they arrived at our table. It was a really really long lunch. I also found the price to be on the high end side comparing to other Thai restaurants in SF. I personally don't think I got my money worth for the quality of food and definitely not the the length of time I had to wait.", "author": "Berserker T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Had takeout so didn't have the chance to enjoy the ambience. Ordered the vegetarian red curry dish with fried tofu. The dish was fairly good! Great balance between sweetness and spiciness. Only reason I gave it four stars rather than five is because the tofu wasn't fried extremely evenly.", "author": "Ashwin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Yum!  Super authentic with \"spicy\" just as expected.  Tom Yum soup was excellent with good depth in flavor. Opted to have it without the noodles and with a bowl of rice instead.  Can't wait to come back!", "author": "Jessica d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-21", "description": "The food is very average and the prices are very high. I lunch plate is close to $20 with taxes and tip. I was hoping for a better new resto and am disappointed.", "author": "Jane M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-22", "description": "Tried this place since I work close by. The food from the two things I have try the Rice Noodle Soup and the Kao Kha Moo is good. But I've definitely have had better. I can't say if everything will be great or not because I've had a lot of Thai friends come in and said the food is so so and I've had some go in and said they really like the food. What I can say though is service isn't that great. The servers sometimes forget to bring you stuff and the food kind of takes forever. The first dish took 20min which isn't bad but the second dish took 45min. Like that's a huge gap between dishes. They're a new place so maybe will give them another try.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "This place is brand new and are only in their soft-opening phase but everything about this Thai restaurant is great. They have an awesome fully-stocked bar run by Summer, one of the nicest and most talented bartenders. The food on their soft-opening menu is extremely authentic and uses fresh and high quality ingredients. They're much better than some of the other Thai places I've tried in SF and is on par if not better than Lers Ros. The ambiance is great, with a newly renovated location. They have great music and a giant projector so it's a great place to grab a drink and watch any sports games while having some great food. Happy hour is all day every day with $5 small plates and appetizers. The chef and owner is always on premise and from the conversations I've had with him, he's extremely passionate about his business and food. I cannot wait to see what they have to offer after their grand opening!", "author": "Charles W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-30", "description": "This place has a great selection of beer and wine. The food was excellent; the best since Thailand. The larb: it grabs you with every bite. The sausage, northern style, tickles the taste buds. Step back in time--Thaitime and enjoy the most aroy food in SF.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "Super impressed with both menu and service. I grew up with one super legit Thai place and have been consistently disappointed in San Francisco Thai. I have a new favorite for sure.", "author": "Travis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "I ordered the chicken basil and crispy pork belly and it was really delicious. Great food great environment! Would love to come here again.", "author": "Abigail M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Love this place. The owner is incredible, food is authentic, service top notch and decor is new and different. I come here weekly if not a few times a month. Some of the best authentic Thai in SF!!", "author": "Aman V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-14", "description": "I was expecting the food quality to be as good as Grand Pu Bah but it changed the menu completely and was disappointing.", "author": "Hiroshi M."}
