{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Ordered the Plato San Miguel. It was amazing! It's the closest I've found in the Bay Area to home Central American home cooking!\nHighlights:\nThe plantains were the perfect amount of caramelized & crispy on the edges, but soft on the inside. \nThe combo of queso & frijoles was perfect. \nGreat asada too!\n\nI also ordered the tamarind, which was also amazing\n\nThe service was great & really friendly!", "author": "Sam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Such an amazing restaurant! We stumbled in here on a whim and it turned into one of our favorites. The owners are extremely friendly! \nWe ordered the Plato San Miguel very good!", "author": "Brett I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Sabor de San Miguel is truly a gem. My partner and I went there for a much needed dinner without kids and had a wonderful time. The restaurant itself is beautiful and intimate with bright colored walls and great natural light. The food was absolutely incredible. Homemade, unique, and delicious! We got the Guatemalan Salad, the Sabor Sampler and the plantanos and everything was incredible. With 2 glasses of wine, the bill was less than $50, which this working mama greatly appreciates. Lastly, the service was fantastic. Our server, the daughter of the owners was incredibly warm and told us the history of the  restaurant. I recommended it to my dad and he took a friend yesterday and they both loved it.  Go to Sabor de San Miguel! You will not be disappointed!", "author": "Caya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "We stopped in here on a whim and were really pleasantly surprised. We had walked past but I'm really glad we stopped in. The children of the owners have taken over running it recently. \n\nThe food is Guatemalan style. The tostadas we had to start were excellent a mix of shrimp cocktail style and a shredded chilled beef with grapefruit juice. \n\nThe fish and pork we had for the mains were really well done with good sized portions. \n\nI'm glad we finally stopped in and we will definitely be coming back.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Chilitos Rellenos ($4.95) - Three small peppers stuffed with meat and covered with sauce.\n\nTamales de Carne de Pollo ($3.95) - Tamale with chicken, olives, red bell peppers, prunes with special sauce inside all wrapped in banana leaves\n\nCamarones al Mojo De Ajo ($12.95) - Prawns in garlic sauce\n\nPlato de San Miguel ($13.95) - Thin New York steak, sausage, fried plantain and fresh cheese\n\nPollo Frito ($11.95) - Fried Chicken\n\nEntrees are served with rice, black beans, beet salad, and tortillas.\n\nOverall the food was delicious.  As a family we shared everything, and our daughter happily devoured the tamale and fried chicken.  \n\nGreat family run restaurant. Service was fast and very friendly. \n\nThe only thing that didn't go over well was the Horchata.  Our 4 year old loves them (for the usual high sugar content), haha.  This one wasn't very sweet, so depends on your tastebuds.\n\nWe look forward to coming back and trying other Guatemalan dishes.\n\nThey are currently CASH ONLY with plans to accept credit cards in the coming weeks.", "author": "Zoran L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "This restaurant is a serious hidden gem. The food is amazing and the flavors are really unique. Had a great experience with the staff and owners. We will definitely be back. I didn't know I was such a fan of home style Guatemalan cooking until going here! We tried the tamales and Plato San Miguel, both were great.", "author": "Trace B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "I just wanna say I was born in Guatemala and this was one of the best Authentic Guatemalan restaurants I have been to. We were the first to walk in here on sunday morning July, 30 the girl that greeted us/our server was very nice. \n\n      We ordered two Plato De San Miguel they were both so so so so good, could def use a little more rice but other then that absolutely no complaints with this plate. I also ordered a order of Rellenitos good god I haven't had one these since the days I used to ride the buses in guatemala with my grandmother and the ladies would come on the bus and sell these. Absolutely amazing!!\n\n     I also ordered a Guatemalan coffee which wasn't very good and I didnt say anything but she def noticed I didn't like it so she told me she wouldn't charge me for it. \n\n     Over all what a great little place, also after we walked in people started pouring in this place looks very popular!", "author": "Katherine J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "San Miguel restaurante is delicious! Very authentic and amazing flavors... reminds us of home cooked meals in Guatemala.. restaurant is very clean and customer service is amazing! A must try when you are in the area!", "author": "Cassandra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "San Miguel is a family owned Guatemalan restaurant located on Mission St. in the neighborhood bordering the Outer Mission and Bernal Heights.\n\nIt has been awhile, so this review is a bit overdue. Dined on a Sunday evening and ordered the following...\n\n- CHUCHITOS (Small corn tamale with chicken inside)\n\n- CAMARONES ASADOS (Charbroiled Prawns with \"Chimichurri\" sauce)\n\n- MOJARRA FRITA (Fresh fried Tilapia fish)\n\n- CAK-ICK (Authentic special chicken soup)\n\n- PLATO DE SAN MIGUEL (New york steak, pork sausage, Guatemalan style fried plantain and fresh cheese)\n\n- RELLENITOS DE PLATANO (Mashes banana plantain with black beans inside)\n\n- PLATANOS EN MOLE (Banana plantain with special sweet brown (chocolate) sauce)\n\nI very much enjoyed my meal, the ambiance, and homey feeling this restaurant conveys. Would definitely come back and highly recommend for Guatemalan food in the city.", "author": "Mari S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Great meal; warm service! We eat mostly vegetarian and were very happy with the Tostadas and Tamales. Hidden Bernal-Mission gem!", "author": "Noa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "What a feast! Grew up on Guatemalan food and this was very delicious. The chuchitos were excellent, I even liked them more than the tamales that are usually my favorite. \nMy husband said the chile relleno was the best he'd had. Very clean restaurant & bathroom, the service was good, they're doing an excellent job of giving you a taste of Guatemala! \nI'd say it was a 4 because the service could've been a little better because of how slow it was.", "author": "Nancy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "I'm extremely happy to see more Guatemalan restaurants popping up. This is one of the better ones. Friendly and very attentive staff. The food is delicious, if you've had Guatemalan food before then you know that everything here is perfectly seasoned. My only critique here is that the menu is a bit small, wish there were more dishes to enjoy.", "author": "Erikk G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "I have been coming to this place close to 20 years. I probably have tried every single dish in the menu. The flavor in each dish is so unique. My favorite dishes are the tostadas, adobado, seafood soup and the churrasco.", "author": "Claudia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Great restaurant! An SF Native family owned restaurant with authentic Guatemalan food. Great service, great vibe, great food, and great prices!", "author": "L L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Whoo this place is the bomb.com! So good. I'm a huge Latin cuisine fan but have never had Guatemalan food before. I assumed it was similar to Mexican or Salvadorian but man was I in for a surprise. I was able to speak to the Chef Juliano, super nice guy, and he mentioned they used to have a food truck and had been on Food Network. After that, I was like tell me what to eat and I'll eat it, his recommendation was Adobvada, which is made with pork shoulder. I was a little hesitant because I'm not into pork but oh boy am I glad I got that. The exterior of this dish is super crunchy giving it an incredible texture, almost like really good fried chicken. Served with super velvety black beans, deliciously rice, and tortillas. So freaking good!", "author": "Wayne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Very nice for brunch. I had the huevos rancheros, which were good. Especially liked the plantain. My wife had the Adobada, which was very tasty. It came with plenty of tortillas. Our two year old ate 5 tacos, so two thumbs up!", "author": "Lionel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Richard & I stumbled in here this evening on our way elsewhere. He lives in the neighborhood and didn't even realize it was there. The personable proprietor Joanna & her brother have recently taken over from their parents and are putting their own spin on things. I ordered the sampler plate and everything was absolutely delicious, interesting flavors and subtle textures.\nI'm coming back soon.", "author": "Jim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "I've been looking for a good place to get a chuchito and I'm so thrilled I found this place.  The shrimp ceviche was sweeter than I expected but delicious all the same.  We got the sampler and it was gigantic.", "author": "Melanie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "We stopped here thinking it was a Mexican Restaurant because it said mayan kitchen, for some reason we thought it was Mexican, it was a surprise to know it was a Guatemalan Restaurant. My first impression was \"wow, is so clean and well organized for such a small place\" its cleaner that most of the restaurants plus the costumer service is excellent, I don't recall going to another restaurant and being serve like i did there. the owners kids are so well educated and know how to serve. there was a little girl who would come every few minutes to check if we needed anything else and she was so polite and well spoken for her age. due to the fact that i don't know anything about the Guatemala cuisine, It took me a while to choose what to eat. initially, i wanted the enchiladas but one of the waitress told me that the enchiladas were not the typical enchiladas but a tostada. she educate me on every dish, and at the end i decided to get the tamales. There were three tamales with a side of beans and cream. They were delicious, plus el agua de horchata was the best, its on the sweet side but i love sweet so I loved it. When we were almost ready to leave the sweet little girl brought us fruit which where on the house. Overall, i had an amazing experience at this place, it made me feel at home, everyone was super nice and welcoming. The food was delicious and costumer service was excellent!", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Actually this is Authentic Guatemalan food.  My friend and I really enjoyed this place, friendly staff and delicious food.", "author": "CR F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Came to this place at around noon hoping for a great experience and i did! I loved it! The smell of the restaurant was like the smell from home. It didn't smell like grease like other restaurants. \nI was confused when i walked in because i wasn't sure whether to wait to be seated or just pick a spot. \n\nAnyway, the lady who served my table (1 other person with me) was very nice. She did everything, took our order, drinks, and bussed our table. \n\nWe ordered tostadas which were delicious. 6 total, 2 guacamole, 2 beans, 2 salsa topped with onions and spicy salsa on the side. \n\nWe ordered plato san miguel which is number 30. I highly recommend this plate because it wasnt overwhelming and still filled me up. \nOrdered horchata and famosa beer. \n\nEverything was nice and clean. Definitely coming back~", "author": "Annie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "STOP CALLING THIS AUTHENTIC GUATEMALAN FOOD.\nThe service is horrible the food is not good, no Guatemalan restaurant will serve you fake tortillas with your food. I'm from Guatemala this place needs to close down it is making Guatemala look bad vs any other country. Never going again \n\nDEJEN DE LLAMARLE COMIDA AUTÉNTICA DE GUATEMALA, el servicio al cliente es malicimo la comida nada que ver con nuestros platos típicos y para acabarla de chingar pasan tortillas platicas como les llamo yo, de paquete pues de las guerrero para que entiendan, este lugar debería de cerrar esta asiendo que la imagen de comida chapina se valla por un tubo, nunca regresare la experiencia fue malicima.", "author": "Selvin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "When you walk into San Miguel, it feels like you're in a tipico restaurante in Antigua, or the villages nearby. That's a plus. The authentic textiles, the music or TV playing, and the posters on the wall. I wanted to feel like I was back in Guate and I did. \n\nI love Guatemalan food and after many trips there, and most recently 10 weeks there, I was craving some pepian. Was it the best pepian I've had? No. But it was decent. And it's the closest I'll come, I'm sure, to having the pepian of my dreams while in SF. The prices are good and the menu is robust. I have a feeling I'll be trying their hilachas next. \n\nMy only request for more authenticity would be the tortillas. The flat, Mexican-style (American style?) corn tortillas were something I'd completely forgotten about. I'd love to eat my meal with the fat, smaller ones I'm used to (spoiled by) when I'm in Guatemala. These just didn't do the trick for me.\n\nOverall, go there, eat well, and enjoy!", "author": "David B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "CASH ONLY RESTAURANT\n\nGreat experience. I would love to call it straight authentic Guatemalan food however it has a hint of Mexican flavors and cooking style in it, but it's the closest to authentic Guatemalan food you'll find in the area. If you like hot homemade chili, you will like this place. \n\nThe service was great and super friendly but not pushy or up in your face while eating.  We didn't have to wait long for our food, which is a plus. \n\nWe will be back with friends.", "author": "Hope M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "They closed early. Bummed after driving 45 minutes to get here, literally closed as I arrived.", "author": "Mia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "The food is delicious! Both of my parents are from Guatemala and it's hard trying to find restaurants that have good food like the kind my parents make, but this restaurant was the best I have tried so far. I tried the tamales and rellenitos- so yummy! The service could be better, we asked the waiter for our check at least three times and it still took her more than 15 minutes to bring it. Other than that everything was great!", "author": "Jocelyne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I ordered the Churasco Chapin and the meat was good and also the tortillas. In general I liked it for a first timer eating Guatemalean food. The decor is very Guatemalean and very cute. Service was okay too the lady took too long to bring the bill.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "This place was delicious. The food was amazing and the owner was extremely nice. We were a group of 7, the loud table that everyone stares at. We were offered dishes of garlic shrimp and 4 liters of beers that was on the house! The only thing is that the waitress didn't speak English, good thing we had someone at our table who spoke Spanish.", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "This is my first time coming to this restaurant, I ordered #37: longanizas. The pork sausages were tasty and delicious. Inside was very juicy and tender. It reminds me of my home country longaniza taste. Definitely recommended!", "author": "Mila N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "Food was awful, as well as service. Came here last Sunday in hopes of a delicious brunch; left very disappointed and with $50 less in my pocket. I'm half Guatemalan, and I can honestly say this place needs to not exist. I don't understand some of the reviews with 3+ reviews...I question their taste buds and standards. If you can, visit another establishment.", "author": "Stacy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "I love la Carne Asada! The beans and the radish made it even better. The beans and the tortillas were tasty and good. I also love the decorations in the restaurant, it's so adorable and so Guatemalan!", "author": "Marilynnn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I love love love LOVE this place. Plato San Miguel is the one I always get. I have been coming here for at least 15 years. Yes, I drive the 50 minutes it takes to get there as often as I can. If I could eat this food on a daily basis I would.", "author": "Vivian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-22", "description": "Review for Antojtos San Miguel food truck using San Miguel address.\n\nlocale: soma street park (3/21)\n\nmenu: rellenos, tamales (4) , tacos (4), taquitos, fried chicken (8),  (quantamalean eats) plates,  etc.\n\neats: tamale, chicken (4)\n-big tamale with smooth masa (lard), semidry breast meat  within\n-3 kinds of salsas on shelf.\n-deliz (must be the lard)\n\ncrumbs:\n-most food items seem premade, not made on truck\n-fast, friendly service.\n-food not cheap, between reasonable and pricey.\nanother review mentions fried chicken only 1 piece for $8?", "author": "Victor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "Short Review #3\n\nBumming around. And what do I see? Chili mango cart!\n\n$2 for a bag of fresh mangos. A bit of salt, dash of chili powder, squeeze of lime juice. And voila! Goodness in a bag.\n\nOf course, not as good as the ones in Mexico. Mmm.", "author": "Marti L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Fantastic authentic food!!! So fresh and delicious!! Great customer service and really sweet people. I love the ambience, feels so homey~", "author": "Shirley W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Wow. I'm coming back here as soon as possible. I could not stop eating my food and now I'm in a food coma. Forgive my lack of eloquence. \nI really enjoyed the longanizas (spicy sausage) as well as the steak in the Plato San Miguel. The platanos were perfectly cooked and you'd be a fool not to try the habanero salsa. Wash it down with their house-made cinnamonny horchata goodness. Yum.", "author": "vanessa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "Took my mother out to dinner last Saturday and let me tell you we were both in a coma.\n\nWe first order Horchatas for both of us. They were absolutely delicious. We also ordered tostadas and taquitos. I think these are my favorite appetizers. \n\nWe decided to share the Pollo en Crema and it was  a great idea as the portions were huge. I wish they would be a little more attentive but other than that great place for a small pop family restaurant.", "author": "Alex A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "One of the best things I've found in SF! It was a little piece of home.\nDelicious, authentic Guatemalan food.\nOrdered hilachas which was super delicious. The rice is really good and the black beans just hit the spot.\nThen we got some platanos with beans and crema and it was delicious. Also ordered a banana milkshake and it tasted just like home. I was in heaven and would go back once a week if I could.\nCash only!", "author": "Alexis G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Came here with a huge party and they are so accommodating. Great customer service and amazing authentic Guatemalan food. Definitely recommend to anyone who knows the food or is ready to try something new.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Man just finished lunch and the Pepian, which is a Guatemalan dish was BOMB. I lived in Guate for some years and the flavor brought me right back! If u like flavors and feel like some authentic food, give this a go!", "author": "Roberto M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-28", "description": "This place - I wanted to love it - service was great - but it was just weird.\n\nWe ordered a LARGE beer and it came in a bamboo glass - which might have been kinda cool - but the glass smelled funny and I'm not so certain you can clean bamboo like you can glass so it kinda grossed me out.\n\nWe ordered the taquitos - which were the best thing we ordered.  we also got a stuffed pepper appetizer which was fair.  Then we ordered 2 tamales which my bf thought were okay I thought they were gross, kinda slimy masa and flavorless to boot.  \n\nEntree we spilt a plate with beef, a house-made sausage, rice, plantains, a small wedge of cojita, a log of beans that actually looked EXACTLY like a big dog poop (sorry but its true, once i said it, neither if us could look at it, let alone eat it AND some spaghetti thing on top (HUH? spaghetti??).  Served with some small not-homemade corn tortillas.\n\nSorry, this place just missed the mark for me, I guess I can see how people could like it, I just didn't.\n\nOh we had a Scoutmob and paid $40 with tip (which included a $15 discount)", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "Small quaint little restaurant. The food was very good. The service was lacking a little because I don't speak Spanish and I don't think the waitress spoke English. The chef came out to take my order as he spoke English. Overall the food was delicious. Everything that came out of the kitchen looked very appetizing.  I will go again since there were several other things on the menu I want to try.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "It used to be very good when the mom of the family cooked the food. The last three visits there left me wondering what happened to my once favorite place.", "author": "Balu V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "First off, the man who works here (owner?) is just plain awesome.  Welcoming, kind, jolly...  We were seated right away on a Friday night around 8.  I didn't know what to order, as I've not eaten much Guatemalan food; so I asked the waiter/owner/gentleman for his recommendation.  I went with the garlic shrimp, which was served with black bean, rice, tortillas, and a small salad.  Everything was very tasty, and felt very comforting/home-style.  The salsa is pretty spicy, just  warning.  \n\nThis place isn't chi-chi or chic, just a no-frills place for some yummy authentic Guatemalan food.  Cash only.", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "We came we a big group (8 people) and although isn't is kind of smaller the staff made it work and it was a great atmosphere. Loved that the restaurant had some charm and culture l!", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-10", "description": "Authentic Guatemalan food in a warm atmosphere that feels like you've walked into someone's home for a fresh meal. The owners greet at the door or someone from the family welcome the patrons into their little niche restaurant in the Mission, feels like you stepped right into Guatemala. The decor is interesting and plentiful, complemented by the native music in the air. The flavorful delicacies leave nothing to be desired, except for more future visits.", "author": "Lilian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "The beat salad was incredible.  I would go back for more of that.\nI was not a huge fan of the chicken or refried beans.  They were not necessarily poor quality, I just did not like the flavor.", "author": "Owen J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-28", "description": "Those things.\n\nGood things by musical Miguel: http://youtu.be/47bFAmk5-Bo\n\nDisappointing things by culinary Miguel: Traditional Guatemalan pepian.\n\nHomemade seed sauce gave this chicken and vegetable stew a unique flavor. Slightly sweet. Slightly spicy. Lighter than mole. Different.\n\nWhere they lost me (and the third start) was the menu. Inside and online it claims two pieces of chicken. Only got one. Was told that's how it comes now.\n\nAll fine and good but you need to update your menu.\n\nMight be more forgiving had it been the greatest thing ever. But it wasn't. And not very filling unless you want to eat all 10 small tortillas that come on the side.\n\nFortunately had another Guatemalan tradition to start. French roll with black beans was good and kept me full despite the underwhelming main.\n\nService was nice and the space was very Latin America inspired. With an average rating of four stars might have just gone on an off day.\n\nEither way I don't plan on coming back for more things.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-31", "description": "What a gem! I have never tried Guatemalan food before until I ate @ San Miguel...and now I'm addicted. The ceviche (as recommended by my co-worker) was the most refreshing, succulent ceviche I have ever had. I forget what the appetizer was called that was AMAZING, but it was like smaller taquito, with more flavor..and freshness. The steak we had was flavorful without feeling too hearty. I finished off with a cup of Guatemalan coffee--amazing...can San Miguel just be an extension to my house? (A la Richie Rich and McDonalds?\" \n\nThe service was 5-star too. What a great family run business! You could tell they are just so thrilled to bring their love of food to your tummies :) \n\nNow go! Btw, props for being open till 10:30 on a Sunday...but cash only!!", "author": "Adlyn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-28", "description": "Food is very good. I went with my husband and my 3yr old at 3:58 pm, the place was empty. The waitress let us pick a table and gave us the menu. She never came back to our table. The guy in the kitchen came out and took our order. After the waitress brought our food to the table and never came back to ask if were ok. I even had to get up and walk to her to pay my check. They need to serve people better.", "author": "Rosa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-30", "description": "This is a small family run business. You know the food will be good if you are the only non native person there.\n\nBe careful of the fresh habanero sauce they give you on the side.\n\nI usually get the beef churrasco but you can't go wrong with anything on the menu.", "author": "Evan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "This is a great little place if you are looking for some authentic Guatemalan food.  I think you have to know what dishes to pick, though.  I personally love the New York steak (great flavors and served with beans, rice, and pasta), the seafood soup, the taquitos, and the shrimp appetizer (tostaditos de cerviche).  All these dishes are very fresh.  My husband and I end up ordering these pretty much every time.  \n\nBecause of the quality of food and authentic flavors, I will give this place 5 stars.  The downside is that it's cash only, which can be quite a pain for dinner.", "author": "L L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-26", "description": "I love this place ... The best pepian I ever tried the food it's amazing great flavor !!!!", "author": "Yvonne W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "If you are stuck waiting at Ichi Sushi for an hour or more, just walk down the block to San Miguel. You will not regret it!! In fact, you'll love it. A truly hidden gem in the Mission of outstanding Guatemalan cuisine!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "Muy autenico!! It was great to find yummy Guatemalan food so close by.  Attentive and friendly service and good food.... the Pepian wasn't nearly as good as Juanita's, but it was an admirable second.  The \"tortillera\" had left and we really missed having homemade corn tortillas.  We will definitely return!", "author": "Ginger H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Amazing food! Service is great...wish it was bigger because it's some of the best food I've had..ever.", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-12", "description": "My husband  took me to this place yesterday, he insisted me to come and try out Guatemalan food. I'm Mexican but I like some of its traditional food like tamales Pollo en crema. At this place is had Pollo en mole the main thing of the plate was the chicken but was very dry and hard to chew so,I stopped eating it. It gives me stomachache!!!So I would not come to this place again. :(:(", "author": "Iris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-03", "description": "EXCELLENT!  A little piece of Guate!  I feel like I am eating over there in Guatemala.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-20", "description": "The restaurant gives you a very comfortable feeling when you walk in. The walls and ceiling are decorated with little pieces of Guatemalan trinkets and art. I had (and still have) so much fun staring at the unique pieces.\n\nThe food is delicious. I love their black beans, taquitos, and their guacamole is to die for. For entrees, I love the grilled chicken (not sure what it is called) and garlic shrimp with steak. OMG, talking about it makes me wanna go there and eat right now. \n\nThe family that owns this place make you feel like you are part of the family when you're there. Great customer service. \n\nDon't forget to order their fresh made smoothies (almost taste like dessert in a cup!) Their coffee is a good way to wind down their dinner. Every time I go, I leave stuffed. \n\nPrices are very reasonable for what they give you. Tons of authentic Guatemalan food!\n\nAnytime I'm in the area, I head down to San Miguel.", "author": "Milly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-29", "description": "If you're looking for excellent home-made quality Guatemalan food, you've found the right place at San Miguel!\n\nI was truly surprised at how delicious the Tamales were! It's hard to find good quality tamales at restaurants because they're very time consuming to make, and most restaurants just produce very simple tamales without putting a lot of effort into the tamal making process. These ALMOST taste like my aunt's tamales... ALMOST, which is pretty amazing!\n\nThe Pipián is also excellent, also try the rellenitos!\n\nBy the way, Latino food is not limited to Mexican food! Stay away from the very FEW Mexican dishes on the menu here. They only offer those items for the type of gringos who demand Mexican food at every Latino restaurant they go to.", "author": "Bananas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Surprised this place only has 62 reviews. For a hole in the wall, this place has some sophisticated flavors. I don't mean the food is stuffy-it's exactly the opposite. But someone really thought about the flavors and took care to make them interesting and sometimes unusual.\n\nGot the pepian, two pieces of chicken (not one, unlike Jason B's review) with seed sauce, cilantro and veggies. Not sure what the seeds were made of but this was served in a shallow bowl, stew consistency, and sufficiently delicious that I used the tortillas to get as much of the sauce as I could. (The sauce goes well on a tortilla with the salsa, by the way. The salsa is, as warned by the waiter, extremely spicy so a microscopic amount goes a long way.) This is pure comfort food.\n\nThe hot chocolate had an unusual taste, although an agreeable, slightly fruity, one. A sprig of something showed up on the spoon. I asked the waiter, who explained that they make their hot chocolate with cinnamon and (I forget the name of the herb but it begins with a 'c' or 's' and wasn't cilantro).\n\nFor a place with so many items on the menu, they only have three desserts, all based on plantains. Two involve frying, so I decided to try the third, plantains in mole. I got the description from the waiter, who told me the mole was slightly spicy. If I had ordered from the menu, where it says the mole sauce is sweet, I would have been shocked with what I got. As it was, I found the dessert an acquired taste that I was part way to acquiring. The sauce was excellent, chocolaty and assertively spicy with sesame seeds on top, and I could taste the sweetness of the plantains through the spiciness of the mole. I would say that if you are adventurous, like spicy food, and are looking for a barely-sweet dessert, definitely try this. Still, be warned that the spiciness outweighs the sweetness.\n\nService is friendly with no language barrier. The waiter (waiter-chef? he was also doing stuff in the kitchen) is happy to describe the dishes and came by to check my tortilla basket and again to see if I needed anything.\n\nTV was playing Latino music videos (marimba bands and similar) at a reasonable volume.\n\nFascinating wall display of photos and paintings of Guatemala. A couple plants for greenery (although one of the fronds need to be trimmed so it doesn't brush the customers' head).\n\nClean.\n\nOne vegetarian option, the Plato Vegetariano, which doesn't seem to be shown on their website. Haven't tried it yet.\n\nCheck it out.", "author": "Charles B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-25", "description": "Awesome Guatemalan food. At last I found what I was looking for, and they did not disappoint. Service was the best, extremely friendly staff, made us feel like we were at a friend's house eating a homemade meal :)\n\nI had the plato san miguel and taquitos and tostada sides, brought me back to the old days! couldn't be more satisfied.\n\nCan't wait to come back to try their breakfast!", "author": "R. V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "The best and only authentic Guatemalan restaurant in San Francisco! I feel like I am eating at my grandmas kitchen table everything I Mean Everything!!!! Is spectacular", "author": "Glenda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-30", "description": "AN OASIS IN THE MISSION DISTRICT SERVING AUTHENTIC GUATAMALAN FOOD\n\nWe opened the sliding door and entered this cozy and cute restaurant on a cold and rainy evening.  Plants and wooden carvings hanging from the tin-roof ceiling add atmosphere to the dining room.  The friendly server came over to greet us and took our order in Spanish.  She brought us sliced pineapple and watermelon to begin the meal.\n\nChicken Pepian\nBoneless pieces of chicken were immersed in an intoxicating earthy broth made from chilies, tomatillos, and seeds.  Rice and homemade corn tortillas were served on the side.  This dish exceeded my expectations!\n\nChicken Mole\nL ordered the chicken in mole which was served with rice, beans, and beets.  He was very pleased with the dish.  I tasted the mole and it was on the sweet side but tasted very good.\n\nThe salsa served on the side is spicy and flavorful.  We were very pleased with the attentive service; it was like having a homemade meal.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "I found this place by surprised the other day when I was going to eat at El Zocalo. Since it said Guatemalan style I decided to give it a try...This is really a small hole in the wall, family owned place, with good service.\n\nThe place is pretty small, and decorated with all pictures and decorations from Guatemala. So in case you don't know where Guatemala exactly is, don't worry, there is even a map to show you the location.\n\nThe food is pretty good. The tostadas with shrimps are deliciuos! For main course I tried the churrasco guatemalan style, and my gf tried the chicken mole. The churrasco was good, different to the Mexican style. The chicken mole was different alright. It tasted more sweet, like it was made out of chocolate. At one point it was to sweet that my gf couldn't finish all of it. The service is pretty good. Maybe because the place is small, they tend to give more attention to the costumers. \n\nThe bad about this place is that it doesn't accept credit cards. So bring cash or you may have to step outside and cross the street to the BOA and use their ATM. Another thing is finding parking. Since it's right on Mission, it is pretty hard to look for a good parking space.\n\nSo overall...\nThe goods:\n-Good food\n-Prices are not expensive\n-Good costumer service\n-Nice place to see a bit of culture of Guatemala\n\nThe bads:\n-Don't accept credit cards\n-Hard to find parkings\n\nIf you don't mind paying only with cash, and giving time to find parking, then this place is pretty cool!", "author": "AL N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-05", "description": "First time here and loved it.  I didn't realize that there was Guatemalan food in SF.  Plus they have Guatemalan beer!  Double win.  As an honorary Guatemalan, I must say that I feel at home.  The Hilachas were good.  Also, be careful with their salsa.  I think it is made with napalm.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-30", "description": "Great service, delicious food.  What else could you want?\nIf you order certain entrees, they are served with a side of refried black beans, queso, platanos y crema.  Refried black beans...mmmm!\n\nI had the hilachas this time.  Sort of a thick beef stew with shredded meat (instead of cubed,) carrots, potatoes & tomatillo in a hearty tomato-based gravy.\n\nDon't be afraid to try the habanero salsa.  It's got a kick to it, but it shouldn't leave you burning.", "author": "Ken B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "I never had Guatemalan food so this experience is quite new and different for me.. I ordered the chicken enchilada but it wasn't your typical enchilada.. the fried corn tortilla was placed at the bottom then the leafy greens then the meat w/ some type of sauce over it and the sauce was delicious!  I'd order it again.\n\nWhat I love most is their salsa.. it burned and gave me a tummy-ache.  When I asked to have a take-out menu, the guy gave me their actual menu- how nice is that?  The service was friendly and I can't wait to go again.", "author": "Tram N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-21", "description": "I have never had Guatemalan food before and LOVED this place.\n\nFirst off the tortillas are amazing...fluffy thick and tasty..\n\nI cant remember the name of the dish i ordered, it had chicken with mushrooms and peppers all in a tasty sour cream sauce...it was soooooo good!  \n\nThe service was friendly and the prices resonable...if you want to try a new adventure head over to this spot...i doubt you will be disappointed!!!!", "author": "Ripley B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-25", "description": "We're moving to Outer Noe in the next few weeks and had a moment two nights ago when exploring the new 'hood where we realized that the Outer Mission is just a few minutes walk from our place. After years of living in the lower pac heights/J-town area, it's like being a new city! And a new city means a whole new slew of restaurants. Including San Miguel, where I had eaten once prior with friends and now know is only a 5 minute walk from our apartment. \n\nAfter that long (somewhat uninteresting intro), I have to say that I wasn't sure what to expect from Guatemalan cuisine. I have never been to Guatemala, nor do I know anyone Guatemalan. I was very pleasantly surprised. We shared chicken tamales as an app, which came with crema and black beans - delicious. For my entree, I had the tostadas, which had a great crunch and savory quality to them. The boyfriend loves the steak entree (has ordered it the two times we've been there). \n\nThe service was friendly and always persistent in refilling our waters. One of my favorite qualities. \n\nIf I rated restaurants based on the quality of their restrooms, this one would not do so well, with a hole in the floorboard and one of those old cloth towel dispensers on a wheel for drying your hands (needless to say I used my jeans instead). But I don't generally take it into too much consideration because what I care about is food & service, which were both great.", "author": "Carissa R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "When San Miguel first opened I was a happy camper!  I looked forward to eating the food from my homeland and was impressed. Over time, however, I've been disappointed perhaps because I compare what I order with my mom's or Abuelita's dishes, or just because I no longer enjoy what I order because things are always too salty: the beans, the sauces, the mole, longanizas, etc. Today, unfortunately, was not any different although I was hopeful.  I ordered the soap de gallina criolla (hen soup) and barely touched it because it was too salty!  The same thing goes for the soap de pata, which my husband order; and even after adding hot water to our soup bowls to cut the salt we couldn't make any progress on it.  I seriously doubt that we will return based on this experience. Bummer!", "author": "Maria E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-14", "description": "I'm part Guatemalan and had the pleasure to have grown up eating dishes that both my Mom and Grandma cooked.\n\nGuatemalans are not huge in numbers here as Mexicans so it isn't as easy to come across a place that knows how to make tasty good quality food. I was riding shotgun one late night down mission and I caught a glimpse of the little sign (Before they hung up the banner) and said i wanted to come back and try. for weeks later I tried to find this place but for the life of me could not. then as usual as it most of the time is me and the GF stumbled upon it as we were looking for parking to go to some other spot. So we had to try it.\n\nI had some combination plate that came with a steak, sausage, beans, rice, salad and plantains. Man for a moment I flashed back to when i was a lil' kid getting ready for dinner when I used to live with my grandma. The food was so flavorful but no overwhelming. the steak was juicy and tender which made me eat as slowly as possible savoring every bite. the sausage was also great but for the size and price i wish they would have thrown another one in. \n\nI enjoyed the decor as it had all these pictures and curiosities from Guatemala. I'm glad I was able to finally try this place. Here is where I will return when i miss being a kid and getting home cooked meals.", "author": "Alfredo N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-20", "description": "A solid 3 stars for San Miguel (would give 3.5). I live around the corner from San Miguel Restaurant and came here the other night for the first time - I wish I had come here long before now, since I've lived in Bernal Heights for over 15 years. Needless to say, I will be back. \n\nThe waiter was very friendly and the food was great. I have deducted 2 stars because the food is VERY good, but it's not fantastic (I didn't love what my friend had). The prices are very reasonable.\n\nWe had a very tasty appetizer called, Chilitos Rellenos (Small bell peppers, stuffed with choped meat, sauce on top) $4.25. \n\nFor my entree I had, Churrasco Chapin (Charbroiled New Your Steak, with chimichurri sauce, and chirmol) $11.95. It was delicious and would order it again. \n\nMy friend had, Carne Encebollada (Beef steak and mushrooms sautaed, with tomatoes, onions) $9.95. I thought it was just OK and I bet he would order something else next time.\n\nThey had good and fresh spicy salsa too.\n\nI would recommend San Miguel Restaurant if you're in Bernal Heights. This isn't a destination restaurant, but is a great neighborhood find. Yay, Bernal Heights!", "author": "Yvette K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "My boyfriend took me here for my birthday he is Guatemalan and he wanted me to try the food. As soon as you walk into this restaurant you automatically feel the Guatemalan culture photos hung everywhere, many vibrant colors, television for entertainment. I ordered \"Pollo Adobado\" and, let me tell you the next day I was craving it! The service is amazing their so attentive. I was shocked that there wasn't many more people... If you're a person who loves latin food trust me San Miguel Restaurant wont disappoint you!", "author": "Genevieve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-16", "description": "This place sneaks up on you -- I didn't realize I had arrived until I was practically in front of the door. The entrance is tiny, but this family-owned-and-run restaurant definitely makes itself known once you've come inside. The decor makes you wonder why you haven't ever been to Guatemala yet.\n\nI ordered an Enchilada Guatemalteca, which was surprisingly sweet and quite good with the steaming-hot tortillas they provided. A band playing what I assumed was local music bonged away on xylophones and such through the flat-screen TVs hanging above us, and I washed the food down with a fresh-tasting strawberry milkshake. Next time I'll have to try the appetizers, or one of the mole dishes. I'm definitely going to become a repeat customer, if I can ever find my way here again.", "author": "J.T. T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-10", "description": "Wanted to like this cozy little Guatemalan spot more than I actually did. The hulaches (shredded beef in a tomato sauce) tasted a bit watered down and flat. My buddy got the Pepian which had a bit more depth. Nothing spectacular, but homey plates for decent prices.", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-31", "description": "I hadn't had authentic Guatemalan food in 6 years, since I lived there for 2 years.  I seriously craved it and I wasn't able to satisfy that craving until this afternoon.\n\nI was afraid it was going to suck just like most restaurants do in Guat itself, but the food was AMAZING!!!  Just like specialty homecooked meals with an extremely friendly staff and fun atmosphere.\n\nThe Longanizas are extremely tasty, the Chuchitos were perfect, the Pollo Adobado was awesome and the $10 Ceviche was NEVERENDING!  You definitely get your money's worth here, and on top of that, it's just undeniably delicious.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-03", "description": "MUY DELICIOSO! BUENO BUENO BUENO! My friend and I came here for dinner. Very authentic Guatamalan food! Also, the quaint restaurant had a decor that made me feel like I could have been Guatamala. Our waiter was very nice - spoke only Spanish - I got to practice what little Spanish I know.\n\nBernal Heights is one of my favorite foodie places in the city! San Miguel has added to my list of favs! YUMO!!!!", "author": "Jen R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "I'm from Guatemala and grew up with my mom making stuff like Pepian, rabo (oxtail), tamales, sopa de res, hilachas etc. So I really want to like this place. The service is good, very attentive. But the food can be hit or miss. The first time I came here, I came with a friend and we tried the ceviche. It tasted nice and fresh, it was pretty good. Also had the Pepian, the sauce for it was good but I was disappointed that they made it with chicken.\nThe second time I came it was with my parents. They ordered the sopa de res and were pretty happy with it and they have discerning taste for that sort of thing. I decided to try the mole and it wasn't very good I'm sorry to report. I'm not sure if mole is supposed to be so chocolaty...the chicken was sort of bland and chewy. Also the whole plate was sort of a mess I thought because the chicken mole was served with black beans rice and queso. It was just all over the place in terms of flavors.\n\n My dad ordered platanos en mole and there the chocolaty sauce complemented the plantains very well.\n\nI would definitely recommend the Pepian, and will try the sopa de res. Unfortunately they don't make rabo :(\n\nThe place looks clean, but it's kind of small and to add to the ambiance they play marimba music and videos of Guatemalan music. The place is definitely not good for large groups or even medium ones, four people per group tops. Parking is tough in the neighborhood and it's CASH ONLY :(", "author": "Jose U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-13", "description": "First of all, if you're thinking Guatemalan food is indistinguishable from Mexican food, you're wrong.  Guatemala is a jungle, and non-Yucatan Mexico is a desert.  Naturally their cuisines are going to be quite different.  Anyway, the two dishes I tried were the tostaditas de ceviche and the chicken mole, both excellent and a far cry from typical mexican fare.  Service is indeed rather slow, but it's *authentically* slow, which makes it ok:)", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-22", "description": "Being half Guatemalan, this is the next best thing short of flying home! The food is amazing, the staff if very friendly and the prices are reasonable. Even my meat and potatoes father loves it, and believe me...that's saying something ;). \n\nThe restaurant is very small, so sitting can be limited. But its worth the wait.  Its also cash only. \n\nParking can be difficult - but I always have good luck on the side streets.", "author": "julie z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-20", "description": "I've eaten here a few times within the last two months.  I was born and raised in Guatemala, and have had these dishes all my life both at home and outside.\n\nIn my opinion, the 'caldo de res' (a simple but really tasty beef stock with beef chunks and vegetables in it) is 5 stars, and the 'caq-ik'  (Q'eqchi language name for the dish) is worth 3 1/2. I am not used to having the caq-ik broth be this thick.  As far as I am concerned caq-ik is meant to be just like caldo de res in terms of consistency, but perhaps this varies. Either way, I think I remember a more intense flavor. \n\nRellenitos de platano (mashed plantain paste filled with fried beans and then itself fried) were awesome and unhealthy as expected. \n\nTheir menu could be richer. I don't think I saw 'pollo en jocon', 'saq-ik', 'caldo de gallina', 'salpicon de panza', and such things. It would also be great if they had thick, handmade corn tortillas, but these hardly appear anywhere I go so I cannot hold it against them. It would be also nice if besides rellenitos de platano they also offered simply sliced fried plantain with fried beans on the side as well, or fried banana. All of it may seem redundant but they are good in their own special ways.\n\nService is friendly but slow, they will take time to bring the beer (they have some of the Guatemalan beers there, for the curious), the food and the bill.  They do check on you to see if you are missing tortillas for your meal, and they also offer a couple of courtesy melon slices some times.\n\nFinally, the thing that really goes against them is the aspect of the place. Poorly lit, smells like fish (hopefully from the fish dishes they serve), somewhat shabby. They could improve a lot on this and that would get them 4 starts. Don't be misled, the fishy smell at the entrance has very little relation to how good the caldo de res is.  Plus, they have some very folksy Guatemalan music playing complete with videos of the bands, so you get to see that too.", "author": "Osberto M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-11", "description": "Joe S. if you didn't like it the first time I strongly urge you to go again. \n\nThe Black beans are so good and the plantains stuffed with black beans are the perfect way to end the meal.  Great for wanting something deep fried, but not too heavy that you feel bloated.\n\nI love love love the food there!!!!! Everytime I'm in the neighborhood I always make everyone eat there.", "author": "Vicky C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-18", "description": "I don't really have anything different to say than most of the other reviewers - the food it good.  Quality restaurant and totally mom and pop, which i love.  I'm Guatemalan and everything tastes just right (except maybe the hilachas sauce isn't thick enough and a little too sweet, I like my mom's better).  I brought my parents here and they loved it.  My dad like the kakik.  I've taken most of my friends here and they all love it, too.  In case you didn't know, there also a Guatemalan bakery (Universal, I think?), up the street, opposite side.  They have chiles rellenos and tamales and home baked breads and sweets.  My parents always have me bring a bunch home when I go to visit.", "author": "Marnie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "My sister loves this restaurant.  At first I didn't know what to expect, since I am not quite sure what Guatemalan cuisine was.... \n\nBut I loved their appetizers - the tostadas were tasty and delicious.  Their corn tamale is addictive.\n\nWe ordered the pipian and it was good, but I recommend the Pollo con Crema. \n\nService was fantastic.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-04", "description": "I guess I ordered the wrong things here. First, the good: the tortillas were great, the horchata was pretty tasty, I liked the black beans, and the service was excellent. I got the vegetarian plate, which was mainly just bland, from the baked plantain to the rice to the plain, boiled vegetables. I wouldn't get it again. The pepian chicken had a tasty sauce but the chicken seemed to be full of gristle and odds and ends, and had a kinda of odd, chewy texture. I wouldn't be too encouraged to get any of the other chicken dishes from this, especially since I didn't find the menu to be very descriptive. But, I might give the beef dishes a try based on other reviews.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "+ Plato San Miguel\n+ Carne Encebollada\n+ Horchata\n\nOther than what I listed above, you have to try the Camarones al Mojo de Ajo (Shrimp w/ garlic butter sauce). Better yet ... try everything on the menu. \n\nParking can be a bitch around here, but so is anywhere else in SF.", "author": "Vincent B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-14", "description": "Had tamales, pepian, chiles rellenos, carne asada and churrasco chapin on several occasions.  It's good depending on who's in the kitchen - good when parents are cooking and bad when kids are cooking. I won't be going back, the last straw was the soggy cream of wheat like tamales.", "author": "Elsie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "Very authentic Guatemalan food.  Everyone working was from San Marcos and very friendly.  Excellent Horchata and Tamarindo juice and the Plato de San Miguel is a good safe choice.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "This Guatelmalan restaurant is a great, friendly and charming place to come out whether its by yourself or with a group of people.  The salsa is awesome especially if you can tolerate spicey (like me)... I came in a little sick and I swear no lie the hot/spicy salsa helped get me better.  As for the food, the ceviche was quite good and the dishes come out fully loaded.  Its a great place to share your dishes if you like to try a little bit of everything.  The prices are very reasonable and well worth the trip out in the outer Mission.\r\nYou can't get bored sitting in there since they have all types of art and random photos and such hanging everywhere.  What I liked is that it was clean and you didn't see a layer of dust hanging from the pictures etc.  Try it, you won't regret it!", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-27", "description": "My girlfriend and I went to dinner, a disappointment with what we ordered. the food is not the same , what a shame !", "author": "Aroldo r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-19", "description": "All I can say is GREAT FOOD and excellent service.  This family owned and operated restaurant is warm and friendly.  The waitress and waiter were more than happy to tell us about Guatemala.  The service was friendly.  I  love the tostadas appetizer with the Guatemalan beer.  I have ordered the steak dish twice and each time I rate it 5 stars.  My husband and I are now regulars.", "author": "Diana S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-22", "description": "We went to San Miguel's because my in-laws are Guatemalan and had been there years before.  The food was not very good.  The NY steak was thin, overcooked and had quite a bit of gristle.  There was nothing authentic about the flavors.  Upon getting ready to leave, I noted something crawling on the wall which I initially thought a fly ... no such luck.  Yes, it was a cockroach.  Upon further inspection of my surroundings, I also noted one underneath the glass top that they have on each table.  Needless to say, I will not be going back.  I don't know how this place received a 96 score from the Health Board.", "author": "Guato N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "Wow! This place is amazing. The pollo en creme was absolutely delicious. The plate was huge, glad it was shared, we were both stuffed for only $11. My friend ordered the asada and said it was the best she's had.  The service was very friendly. You have to try this place!", "author": "michele f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-11", "description": "First time my wife went, she loved it, so we went back.\n\nEvery restaurant probably has to constantly fight to keep things clean and no one is perfect, but when I went, there was a cockroach on the floor and then I found, not one but two baby cockroaches on my table.\n\nJust can't bring myself to go back here.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "i never though TOSTADITAS are good ! they are amazing, i like this place, i wana go again and try more things, thier menu seems to be great !", "author": "Shadi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-05-29", "description": "This cozy little Guatemalan restaurant is well worth the trek to the outer, outer Mission.  The food is good (I had a delicious chicken dish with a creamy tomato sauce and a side of refried black beans) and the prices are extremely reasonable.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-07", "description": "I walked by this place, scanned the menu and found something that sounded perfect for this hot day in the city... Salpicon Beef.  mmmm.  It's basically a cold beef salad with orange juice, mint, onions, cilantro and onions and  served with soft and crunchy tortillas, rice and beans.  It was perfect with the HOT salsa.  We also tried the chilitos rellenos and plantanos.  everything was great!", "author": "Erick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-17", "description": "If you are not familiar with Guatemalan cuisine this is the place to go! Amazing enchiladas and appetizers!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-24", "description": "six years ago, when it was located in the mission, my friends and i randomly found this place after volunteering at AIDS walk.  i moved back to chicago, but my friends made it an annual post AIDS walk tradition as well as a bi monthly let's-go-get-that-good-pork-dish tradition.  i nearly cried last year when i was visiting SF and san miguel wasn't where i remembered it.  i thought that i would only have the memory of that amazing pork to get me by until i found a comparable guatamalan restaurant. \n\nbut then, i was hanging out in the mission and saw a cart with the san miguel logo on it.  and i nearly cried when i found out that san miguel exists in bernal heights.\n\ni went yesterday.  and the pork was as delicious as i remembered.  the plantains were tasty.  service was quick and friendly.  we also got the steak with the pork sausage.  yum!  well seasoned, juicy meat and the black beans, cheese, grilled onions, grilled green onions and spicy salsa...  damn.  so good.  and very decently priced.  \n\ni only have another week in the city before i move back to chicago.  i'll be eating there at least two more times before i go.", "author": "jenny t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-30", "description": "By far it is a delicious addition to the rainbow of  that part of town  there is also a perubian place down the street, an honduran restaurant infront of that place, an italian and ofcourse Mexican, this little hole in the wall has  its stuff to stand righ among greater competition and stillleave its mark!  A+", "author": "J Angel G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-11", "description": "I love this place but the last time I went, we felt sooo full after 2 apps.  I made a mistake and ordered the fried chicken things instead of just the open taco's and for the main dish I ordered the chicken (and the person I was with wanted it fried) and we got it without.  I think the key is to be able to speak spanish.  My spanish is pretty bad which is why I messed up ordering.  Careful of the hot sauce, it's muy picante!  The decor is pretty cool and they are very friendly.  I'd definitely give it a try if you're in the neighborhood.", "author": "Mitch A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-27", "description": "I went here for the first time a week ago. I was craving Chicken Mole....yummy! I couldn't figure out the door, it took me a minute but once I walked in there I felt like I was in Guatemala. The place is very cute & cozy. I felt like I was away from San Francisco. I didn't stay because I needed to be somewhere but I'm planning to go there with some friends soon. The waitress was great, she brought me fruit & water while I waited for my order. There was so much to look at. I love this place!", "author": "Karen H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-20", "description": "I am from Guatemala and have still not found a decent place since I came here ten years ago. I emigrated when I was 22 so I still have a very good memory of what the Guatemalan seasoning is. \nI unfortunately did not like the place. It reminded more of a \"comedor\" where most people eat daily during their hour lunch break. The food is not entirely bad but is more like bland home meals. Like I said not the kind you get at a very \"comida tipica\" place in Guatemala. I would also like to see more indigenous plates like subanik or authentic Guatemalan tamales or cack ik.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-22", "description": "Note the taxidermied lynx over the front door, always a sign of quality eats.  This was my first venture to a Guatemalan restaurant so I can only judge on the flavors of the dishes, which were ordered semi-randomly.  Tried the shrimp appetizer -- the shrimp came in a overpoweringly sweet tomato-based sauce, which was a bit better with addition of the side dish of volcano hot sauce.  Tried two types of tamales -- the banana leaf variant with chicken and olives was not flavorful, being accompanied by a thick gravy, but the other cornhusk tamale was excellent.  Pork adobado was the star of the night, juicy and flavorful.  Prices were reasonable and the service excellent.  I'm willing to try it again and see what the other dishes are like.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-14", "description": "+\n* really good, totally authentic food - the guatemalan chorizo (forget the name) was very good, and the fried pork was even better.  for starters, get the beans+cheese dish and the \"avocado deep\" guacamole (don't ask, know idea, but i'm sure it will be the deepest avocado you've ever had) \n\n* fun atmosphere - big, crowded tables, lots of plants, playing guatamalan pop music on flat screen tvs (usually tvs a bad sign in a restaurant, but worked here)\n\n* awesome staff - some of the nicest, most enthusiastic i've had in in a long time\n\n-\nhot as hell in there - need more ventilation.", "author": "James R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "What can I say, my father whole-heartedly enjoys coming here for their stews, soups and spicey salsas. The service is a total family-affair with mom cooking, pops cooking and serving, and daughter serving; very intimate, with all their Guatemalan pictures and memorabilias and very inexpensive. It gets pretty busy on the weekends but nonetheless, a good spot to take the family if you're looking for that authentically snug mom and pop feel.", "author": "Dennes H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-07", "description": "I went with a group of about twenty-five people, and we had a great time.  The food is extremely reasonably priced, and the restaurant space itself has so much character.  The staff was super friendly and accomodating.  If you're in the hood I'd stop in and check it out some time...", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-15", "description": "Two words:  Frijoles Volteados!  Order this appetizer, which consists of salty dry refried black beans, queso fresco, super hot salsa and crispy housemade tortilla chips, and prepare to cry with pleasure.  Great tamales and stews, too.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-30", "description": "You need to know what to order here.  The service was friendly but slow.  We ordered the fried plantains, but she mistakenly brought us the plantains stuffed with black beans.  That was no good.  We brought her attention to her error, and she brought us the plantains.  They were decent.  The shrimp appetizer was great.  That was by far the best thing.  Of the entrees, 2 were okay, 1 was inedible.  I think there are probably some great dishes here... I'd like to give them the benefit of the doubt.  But based on what we did order, I wouldn't recommend this place.", "author": "Joe S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-08", "description": "Ok, so I must admit, I have not made it to the resturant yet (and after reading the reviews, I stress the \"yet\" part).  I was, however, fortunate to make a random stop at their roadside truck.  Lucky me. I was buzzed and hungry and expecting the typical so-so Taco truck grub.  Hold on to your zapatos. This is no ordinary roach coach. The food was in an entirely different league! I had a steak sandwich and it was amazing. So much so, i ordered another one as soon as I finished my first.  If my friends hadn't draged me away I would have ordered another just for the shear joy of the flavors. Que sabor. Buen hecho!", "author": "david c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "I am a Guatemalan American and have grown up eating this food. This food is as good as eating it in Guatemala. The tostadas are just like the ones you can get at a mercado. The taquitos are just like the ones the Indigenas make. It is just like being transported back to guatemala. For those who have not had Guatemalan food don't expect it to be like Mexican food. I hope everyone who eats there goes with an open mind. It is a wonderful surprise.", "author": "Elvy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-02", "description": "The best Guatemalan food I have eaten in the bay so far. I love this place, their decoration and customer service is great. For apetizer I like tostaditas ( I think that's the name) san miguel plate is really good, it comes with a tasty steak, beans, rice, and plantains. I pretty much like everything.", "author": "perla P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-29", "description": "I love this place. It's run by the friendliest family ever. Great service, great food and fantastic prices. YUM!", "author": "nic d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "Also recommend the Guatamalan Taco - mmmm beets!!", "author": "Nors P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-22", "description": "Somebody please tell me if I'm wrong, but I think this is the only Guatemalan restaurant in San Francisco, as in serving only (or at least a fair amount of) Guatemalan food.  I recently came back from a month in Guatemala and was seriously missing plaintains, refried black beans, and Guatemalan fresh cheese, and was quite happy to see them at San Miguel Restaurant in their \"Plato de San Miguel.\"  Now, the beans and plaintains were not exactly as good as they were in Xela, Antigua, or even touristy Panajachel, but they were more than good enough.  (The people next to us had a plate of \"tostadas,\" which are actually called \"tacos\" or \"enchiladas\" in Guatemala, I've already forgotten which, which looked pretty good.)  They also have actual Guatemalan beer there -- including the omnipresent \"Gallo\" beer, which is called \"Famosa\" here to avoid confusion with a certain line of cheap wines.  Unlike another Central American restaurant in the Mission, Poc Chuc, San Miguel is very down-home, folks from the community eat there, and the server spoke Spanish to me even though I don't exactly jump out as looking like a Spanish speaker -- which is great, since I need every chance I can to work on my marginal Spanish.", "author": "moosedog i."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-10", "description": "big fan of guatemala and the local flavor.  san miguel has more character than the average mom and pop outer mission establishment and would be a solid 4 if the entrees were as consistently solid as the seviche.  it's nearby, so will give it another go to try more dishes...", "author": "James B."}
