{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "This is a family run kosher restaurant. \n\nAs it's the only kosher restaurant in San Francisco, it can get crowded and noisy at times.  If that happens, ask for a few pitas. They are warm and fresh.\n\nAs to the food, it is good, fresh and cooked to order. All of the traditional Mediterranean types of food are available. Including schnitzel, hummus, shashlik, and more.\n\nIt's a bit on the pricey side, but the food quality and quantity is good. \n\nSabra won't get any Michelin awards. But if you are looking for good, fresh and very appetizing kosher meals in San Francisco, this is the place to eat at.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-04", "description": "Litterly j don't think I have ever rated Israeli kosher food so low I cannot even explain you guys how terrible was this waters we were sitted in a DIRTY table when I was asking if he could clean it for me he seriously started wiping it off with his hand I was never but never seen anything closed to it,\nOnly after I told him to Bring something to clean everything he was uhhh ok, I got all the food before I even got my silverware....... \nthe guy was a hell of a creepy, I swear thank god there was another girl which she was nice, and the food was ok.. not more then that. overall rating is MINUS - 5 stars because of this girl 3 .", "author": "Bar A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "Nice customer service. Food was decent. Did the job. Wasn't expecting a luxury meal. not much to say other than its the only kosher place in San Fran so take it and enjoy it.", "author": "Avi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "I have been hearing a lot of good things from my friends about Sabra and I finally had a chance to try it tonight. Wow this place exceeded my expectations. It is a small family run business. The owner Eitan is hilarious and your typical Israeli. He welcomes you in and tells you to feel like home. His son, Joseph is on the grill and makes delicious food. His daughter Esther runs the front of the house and she is amazing. You must try it!!!!", "author": "Dani N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "The meat and grilled chicken my family and I got was overpriced, tasteless, and rubbery. Took a long time to get our table. And waiting on the steps outside the restaurant wasn't helpful to the already long wait. The service is good but lacks organizational qualities.", "author": "Nessia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "This is the only kosher restaurant in San Francisco so it will always be crowded but the food is very good. The plates come with a lot of side salads and dishes: it's worth the price.", "author": "Shirel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I've been meaning to come here for years but have never had the chance as I'm only ever downtown when I'm working... and the truth is I never leave the office for lunch.  But that may all change now that I've been to Sabra.  Eating here is such a great experience.  Some people may be put off by how basic the interior and atmosphere is but in fact, in addition to the food being fantastic, the added bonus of the atmosphere makes this place a 5-out-of-5.\n\nI believe this place is family run, and if it isn't, you certainly get the feeling that it is.  This looks like the kind of place where family and friends have been gathering for years.  The 2 strapping lads that served us were very friendly & personable and the service was the perfect balance of \"attentive, non-intrusive\" if that is even a thing.  They were very friendly but left us to our own devices, as they should.  I personally don't feel waiters should constantly be coming up and talking to you.\n\nAgain, the decor is very basic... but spot-on.  Stark white walls accented by \"Mediterranean-Blue\" trim and table cloths, the occasional framed photo or painting depicting Jewish themes, holidays, imagery etc...all ill-sized to fit the aforementioned disproportionately large white walls.  Black plastic chairs with vinyl black seats and only about 1 tables, 2-3 of which were set up for large groups.  Again, I can imagine a lot of families gather here in large groups.  Let's put it this way, this place looks like one of those restaurants that Ottolenghi puts a photo of in his cookbooks to show what real \"Mom & Pop\" restaurants look like in Jerusalem.  This place feels authentic and despite how \"under-decorated\" it is, is one of the most enjoyable dining atmospheres I've experienced in SF.\n\nBetween the 2 of us, we ordered the Combo Salad & the Lamb Shishlick platter.  This was more than enough for both of us, so do not let the dollar signs dissuade you (as some people have suggested they are $$$)- they give you a lot of food here! The combo salad consisted of a mound of heavily cucumbered cabbage and carrot salad, huge wells of Hummus & Baba Ghanoush, fried aubergine, 4 dolma and 6 falafel. Many people on YELP credit Sabra with the best falafel in SF and I have to agree. And of course this came with 2 large, fluffy pitas.  My friend I was dining with exclaimed how she had never had pitas so fluffy and pockety (haha)!  The Lamb Shishlick came with 2 skewers of lamb, more hummus, salad and a side of rice and/or fries (we did both).  Unfortunately, we were talking so much that we accidentally let the lamb get cold, but it was still nice, even if on the slightly chewier side...again, that was probably our fault.  We ate almost everything but ended up having to take half the hummus home and half the shishlick home...which was fine by me.  We were stuffed and we can both put down A LOT of food.  Our bill, including 2 turkish coffees and a sparkling water, came to $54 which, I believe, is outstanding considering the amount and tastiness of the food we got.\n\nI can't believe it has taken me this long to try this place.  It certainly surpassed my expectations.  I will DEFINITELY be back!", "author": "Adrian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Amazing! Don't listen to anyone who said the food or service isn't great. It's delicious with generous portions, and healthy options. Best baba ganush, hummus, and tahini with falafel I've had. The food came fast and the server was friendly and accommodating. Definitely stop into sabra and try one of their lunch plates. You won't regret it!", "author": "Julie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-17", "description": "I don't keep Kosher, but the friends I was meeting do.  We didn't have a ton of options in SF so we tried this one.  We started off with the Combo Salad with Falafel.  Not bad.  The Pitas we had were also tasty.  It was a good appetizer to split between the 3 of us.  Then, we ordered variations of the Shislik.  I ordered the Lamb, the others ordered Chicken and Beef.  The meats could have used some more seasoning, in my opinion.  We added a coke and a Pastrami Sandwich to go.  The bill was north of $120.00 for all of that.  Not worth it, in my opinion.  The service was ok. \n I had to get up and get small plates for the table after the appetizer was served because the waiter had forgotten and then disappeared into the kitchen.", "author": "Thomas O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "I tried to order for a client lunch from Sabra Grill on 11/1/17 for someone who keeps Kosher.  I'd submitted the order through Door Dash, and Sabra Grill accepted the order on their end - but when the driver showed up (around an hour after the order had been submitted) to pick up the food, they said it was too big of an order and they were short staffed, so they refused to make it.  I ended up calling them after talking to the driver and Door Dash customer service, to see if they would make an order still as there aren't many options for Kosher meals nearby.  At first, they said yes, but when I read out the order I had wanted they said it was too large of an order and then hung up on me.  \n\nSo, hopefully the food is better than their customer service was the day I tried to speak with them!", "author": "April H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-22", "description": "Good news: service and side dishes better than last time. Bad news: Overall value less than last visit. \n\nFries and side salads fresher and tastier than I remember. Pita seemed stiff and stale but that was partially masked by warming it. \n\nNo paper towels at wash sink for netilat yadayim.\n\n$49 steak - Fancy NYC steakhouse price for tough, improperly cooked steak with little beef flavor served in the ambiance of an Old City Jerusalem leather shop. Ordered medium done steak. It came out gray, well done, except the edges were still bloody rare. Sweetish marinade and/or seasoning seemed to mask any savory beef flavor that I associate with a decent steak. \n\nI was hungry and tired so I didn't ask them to re-fire a properly seasoned steak. Bottom line: the meal was filling but neither satisfying nor a good value. \n\nYet it was Kosher, which is a higher priority for me than quality of food and dining experience.", "author": "H D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "The place is overpriced, dirty, and classless. I simply do not understand how anybody has given this hole a good review.", "author": "Kenneth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "If you're looking for the best hummus in town hands down, go here! The beef kabob is tender with just the right amount of spice. Service is great too. Didn't expect to find a place like this in Chinatown (it's right by the gate), but so glad that I did!!!", "author": "Dave Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "I am a Jew from the East Coast, and I am very particular with my Middle Eastern Food. I grew up on Israeli cuisine, and this place is legit. My falafel sandwich (to go only) was absolute perfection. Support this small business. You won't be disappointed.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "You don't need to keep Kosher or even be a Jew to eat here this food is bomb!!\n\nToday is National Sandwich Day!!!! \n\nI recommend the lunch special come before 3 PM!! I wish there were similar options for dinner I wouldn't mind paying a few more bucks!! $10 Falafel Sandwich in a pita pocket stuffed with salad pickes tahina and hummus!!!! Vegetarian and Kosher! I hear the meat is bomb too!!! Maybe the side portions can be bigger but I am fully happy here! The rest I'm writing to you with a big heart and love for small businesses (:\n\nTruly felt like home to me...\n\nWow... I need to come here more often just to bring someone inside with me too, how did I not come here when I lived in the TL! I'm not Jewish...I'm a Jew!! AUTHENTIC Middle Eastern OG KOSHER food is hard to come by not just in SF but the Bay TOTAL. There was once this one place, but now THIS is that one place. NO QUESTIONS ASKED. I came here cuz my dad & I were hungry and needed Kosher food!\n\nI'll drive from South San Jose where I live, to Chinatown and back again, and probably everytime. I'll catch an uber too, I'll walk if I'm downtown! \n\nYou see my dad is an observant Jew who keeps a Kosher diet! most the time we cook at home, because, well there's nowhere to eat in the South Bay. Now he also works weekdays in The Bay staying with me, and then LA on the weekend! Who needs to go eat out!! Well for those who do, and for those times when you're so fortunate like we were to be in downtown Frisco, you wanna eat something nice, don't you!! \n\nNot to mention we were working that day all day....it was a late lunch if you will, and then I looked down at the menu prices, checked at the time, bingo I had 40 minutes left for the lunch special....fire. $15 AT MOST for a STUFFED pita of whatever you like, shawarma kebob chicken schnitzel. But I wanted to keep it light with no meat, I went for the $10 ( yea $10 in SF KOSHER ) and it was LIT FAM it was STUFFED. We got 2 orders of each, fries, 2 Malt Star Beers (A non alcoholic Israeli Malt Beer) and I was excuse me, FREAKING HAPPY. Was it like my dad's? Nope. But for a moment in my head it felt like it, I really got happy eating here. I would eat dinner here and sit down next time.\n\nI'm gonna go there, you know that Adam Sandler movie, \"Eight Nights of Hanukkah\" ? Well Jews really do link with the Chinese, this shop is a GEM in what some may call an historical part of town in San Francisco. Heard of Chinatown? Idk me either. Just got these cool looking Oriental buildings in the heart of SF, Bush and Grant, says it on your Yelp! I just learned it now too, right by the Dragon Gates. \n\nIt's enough just to be here, in SF, but the aesthetic in & around the restaurant very proper & fitting. PLEASE PLEASE PLEASE give this place a shot despite the walk up the stairs, have you seen the hills in SF!?? Or is Uber taking over your life!!!  Yeah I know SF is all San Tech now but...\n\nThere is an Old World sense & taste in and around Sabra Grill. Consider getting there by foot, going down the Silk Road from East to West.\n\nWalk through Union Square due East, & after you pass under the towering skyscrapers of Downtown down Bush or Grant, go under the Dragon Gates and step no further than 13 steps. There you'll find the Middle Eastern Sabra Grill, right there at the head of Chinatown. You go from West to East in seconds, but Sabra Grill is that blend of both.\n\nMake a (slight) Ascent up the stairs to the Middle East , into a tight space of what looks like MOST Middle Eastern food stops I've seen myself. Nothing cute and that's the style I'm used to in the OG places, it felt like I was tucked in a corner of Jerusalem or my dad's town of Akko. The Walls have pictures of Israel, Scripture on the walls in Hebrew, maps of Israel, & if seeing the guy in a Kippah/Yamukkah wasn't enough to know I was gonna eat Kosher food, I was at peace with the man's clear appreciation for his culture and history. The place had no shame in who it was.\n\nI felt at home inside, I didn't expect anything more or less than what I saw. Do you know how hard it is JUST TO RUN A RESTAURANT!! Kosher Certification is a a big merit and meticulous task of maintaining food standards for the Jewish community! Anybody who takes that task is faced with daily scrutiny of his practices, because for the people who need it, it matters that much. It's just as important as gluten free and Halal and vegetarian! BIG props to the big guy behind the counter who works very hard & looks like my dad!!! I never seen a huger smile on my face when I asked to take a picture of them together. In fact it's the only picture I took and not even the food because we scarfed it down!! \n\nI wish I got his name because I would tell you tell him, Matan sent you, the kid who took his picture with the big Jew bear looking guy! Just show him my picture I post!! SF you gotta go give this guy more reviews and I promise you won't be let down!!!\n\nThank you for letting me feel at home sir! Great spot!", "author": "Matan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "Really good food. I had a bowl of white bean soup and some chicken kabobs. I can't remember what all came with it but it all was good. We'll be back.", "author": "Joseph J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-20", "description": "I only went for a pita (after finding out their shawarma is not the lamb/beef kind, but chicken, Jewish style). I chose beef for the filling. It had a lot of slaw-style lettuce/cabbage and a few chunks of tomato. Pita bread was good. However, the meal was only so-so, certainly NOT worth $14 flippin' dollars. Skip it.", "author": "Eve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "THE BEST KOSHER FOOD! Not just the best in SF... Not just the best in the Bay Area...THE BEST ANYWHERE! The Hilleli family will welcome you with the fluffiest pita bread, the most delicious, freshly ground meats, the yummiest Israeli salad, and the best service EVER! (Thank you Adam!) This treasure of a restaurant is tucked away in Chinatown, but it's DEFINITELY worth the search! We can't wait to come back! Kol hakavod, gentlemen!", "author": "Ms C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "good food good service for israeli mediterenion food", "author": "Richard S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Sabra is a locally owned full kosher restaurant.\nIt's kind of a odd location, just inside Chinatown on the second floor above some chintzy souvenir place. The narrow stairs up are easy to miss.\nI kind of like the decor, blue and white paint with art work on the walls, some more interesting then others. There is exactly one window seat with an indifferent view of the second story across the street.\nThe food here is nothing short of spectacular. If you are a vegetarian the hummus/baba ganoush platters with pita and falafel are superb. comes with pickels, eggplant, and a spicy relish/chutney.\nThe meat dishes are likewise superb, with the kabobs being a standout but be warned that this is a slow food place. Food is cooked to order and if you are planning to hit this place on a an hour lunch there is real risk of you not making it back to work in time.\nAlso know that all menu items may be more expensive then what you may be used to. Part of this is due to pure kosher typically costing more and partly due to the sheer quality of the food....hmm, well both of those reasons are kinda the same thing.\nThey are in the process of revamping the menu a bit-there is a new cook/chef with some desire to spice things up a bit. What this means to you practical terms is that some menu items may not always have exactly what is described, such as the veg combo platter substituting potato salad for a greek style leafy salad, or not depending on who is cooking.\nI recommend verifying what may (or may not be) on the plate upon ordering.\nIf kosher food is important to you this is a must do in SF. \nAlso one of the best Mediterranean food places in the city and is a good example of the eclectic restaurant scene with it's wonky location.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Looking for overpriced stomach pain? You're in luck. Place makes a killing charging $$$ as the only kosher restaurant in town. Poor service - made us switch tables halfway through dinner to seat another party, and didn't move our plates over.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-02", "description": "Ordered the falafel appetizer which was small, the fried eggplant which was tasty with underseasoned hummus and mixed grill with dry meat and also underseasoned. However overpriced for the quality and quantity of food. But we ate most of the food because we were hungry!", "author": "P C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Great freshly cooked Israeli food, natural and healthy. The pitot are served warmed and not mushy, very hard to find good pitot in the area. I picture this pitah very well for a good sabich (Israeli street foot burger from Iraq). The tchinah was tasty. I didn't take that time humus v-kadurei falafel b-tzalachat, I took it a while ago tho and I still have great memories. The atmosphere is modest (aka Israeli typical), restroom were clean. It's a bit expensive, however we cannot find glat kasher food everywhere, and it's also located in a touristic area (Bush street gate of Chinatown). The meltzarim don't speak Hebrew, but that's ok, nobody is perfect. Maybe having in the background Israeli radio could be great, and some inprints of the atikvah would be me'uleh!! Todah rabah.", "author": "Bertrand B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "It's not often that you walk into a restaurant and you're welcomed as though you've come home.\nBut at Sabra Grill that warm and welcoming feeling invites you every time.\nThe service is impeccable and the food is delicious. It's in a prime location with the friendliest smiles from staff. The menu has a  variety of middle eastern dishes. Great lamb shishlik! Enjoy!", "author": "Aliza S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "They are oddly located in China Town. Once you find them tho, you find freshly prepared, authentic food with friendly fast service. Perhaps a bit on the expensive side.", "author": "J. M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "A friend wouldn't let this place go, so we went after dinner, you know for second dinner. As such i only had a small plate of hummus and falafel. Both of which, OMG good.\n\nThe menu looked really good. I'm not a kosher eater, but appreciate good food blessed or not. \n\nThe only downside was the weird vibe my friends and i got from other patrons. Like literally stink eye. One lady turned around in her chair a dozen or so times to just stair at us. We weren't being loud or weird, she was just not down with us enjoying tasty food as far as I could tell. Was tempted to chuck a falafel at her, but that seemed rude.\n\nBeyond that though, this little kosher gem in little tokyo of all places was quite nice. Never hurts to know a good kosher place nearby.", "author": "john W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "I'm not Jewish; but, this place serves some of the best Falafel in San Francisco.  And, after trying several places nearby, without a doubt the best Falafel in a several block radius.\n\nWhat I really like about them, is that the Falafel are always fried fresh, and are nice and hot and crispy when you bite into them.  Another unique thing they have is their pita bread.  It's thicker than any other pita bread I have ever been served (probably at least twice as thick, and it has air bubbles inside like you'd find in an English Muffin, only it's much thinner than that).  As a result, the pita is always very pliable, tasty, and chewy.  Best yet, it's always served warm.  The Falafel Pita is $9.95, and totally worth it; especially when compared to the Falafel served at the other restaurants nearby.\n\nMost places in San Francisco use a much thinner pita, almost all serve it cold, and when it's served dry it just crumbles into a mess, and the ingredients fall out on to your plate.\n\nA real treat here is the Lamb Shishlik.  Again, each skewer is grilled to order.  Without a doubt some of the very best tasting Lamb Shishlik I have ever had.  It's delicious.\n\nThe only major miss so far that I have eaten here is the Chicken & Onion Shawarma.  To me, it just tasted awful.  I think it might have something to do with being cooked on the same grill as the Lamb.\n\nOther than that, everything I have tried has been real good, and worth eating again.  The humus and the rice are also good.\n\nA lot of people complain about the prices here.  Yes, it's more expensive because everything has to be certified as being Kosher.  However, if you stick to the lunch specials that they have posted next to the entrance on the street (which run from 12pm to 4pm), the prices are pretty fair for the flavor of the food they serve (around $10-$16 for lunch without drinks).\n\nSince they are Jewish, it's closed on Saturday; but, open on Sundays. If you weren't specifically looking for it, you would easily miss the entrance on the street level.  If you start at the Chinatown Gate at Grant and Bush, it's about 50 feet up Grant Street on the left hand side (West Side of Grant St).  The restaurant is up on the 2nd floor with a long flight of stairs and no elevator.", "author": "Roy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-08", "description": "I have never been to a Kosher restaurant, but this place was highly recommended by a friend who has been here many times. She is Jewish, and says that many Jewish people in San Francisco come there. \n\nIt is not an esthetically pleasing spot, but I didn't care about that so much. I was getting take-out. It is up a steep staircase right inside Chinatown's gate, and is bare bones in the decor and ambience department. It looks like a food-truck with hand-written menu on a whiteboard and very basic old-school tables/chairs, etc.\n\nA really nice man (the supervisor) took my order. I was expecting AMAZING, but came home to find there was no hummus on my \"plate\" (it stated there would be hummus) and quite bland everything else. I got a chicken skewer that came with white rice, white pita bread, cabbage and green lettuce salad. It was $23 which I assume is because it's expensive to have food qualified as Kosher. \n\nI will try this again for falafal and schwarma and only at lunch where prices are considerably less.", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Amazing, warm and friendly service. The owner/waiter was super inviting, helped with menu choices and really made us feel welcome. \n\nThe food was out of this world! Well seasoned and PERFECTLY cooked, paired well with accompaniments and good to the last bite!  Portions were plentiful and even enough to take home!", "author": "Esti V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "I was excited to stumble upon a real live Kosher restaurant while on vacation in San Francisco. As someone who lives in a city without any Kosher meat restaurants, I was enthusiastic to grab a swharma to go to eat while walking through town.\n\nThe staff was friendly but this was by far the slowest shwarma I have ever had in my life. It was hard to get someone's attention to order, and then I waited. And waited. And the chef stopped cooking. And I didn't have my food. Then the waitress told him that he forgot to make mine. So he started cooking. And it took a while.\n\nI ended up waiting about a half hour for a shwarma to go. It was okay, not as good as the Israeli stuff, but were I to go back to San Francisco I might skip stopping in.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "A french restaurant nearby was recommended to me, but it was closed, so I was on the search for something else, and I stumbled by this place. It doesn't stand out, and seems out of place, it's on the second floor of a building in Chinatown, just behind the Dragon's Gate. It's very small, and I imagine, probably always nearly empty, but I figured why not, I was tired of walking and hungry.\n\nThe prices were fair, most dinners were in The mid-$20's, and the owners were very friendly. I settled on the beef kabob, and they brought me some pickles to start, which I found odd, but they were very tasty. Then out came the pita, I couldn't tell if it was home made, or store bought, but it was warm and soft, and fairly good. \n\nThen came the meal. I asked to hold the cabbage salad, because I don't care for cabbage, so it came with 2 large kabobs, about a third of a dinner plate of white rice, and a salad of mostly cucumbers and tomatoes, with a little bit of iceberg lettuce mixed in. The salad was a bit bland, but after a long warm day, it was refreshing and welcome. The rice was not overdone, and plain, I prefer it that way. The kabobs themselves had a fair amount of spice, and saltier than I prefer, but all in all, it was very good. If you don't care for salty foods, I'd probably stick to the vegetarian selections.\n\nThe meal itself was easily enough to feed two hungry people, and the owner gave me some odd looks as I ate all of it. It seemed as if he's never seen anyone eat so much, but I was very hungry after a very long day of walking all over the city.\n\nI wouldn't go out of my way to eat here, but if ever I'm in the vicinity again, I would probably stop in.", "author": "Colin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Amazing food! The chicken kabob melted in my mouth. The Israeli salad and rice were delicious. Great pita bread!! I think they baked it themselves. We loved every bite! Highly recommend for those looking for a great kosher meal in SF.", "author": "Moriah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-01", "description": "The worst experience ever. It's 2014 sabra grill it's ok if a non Jewish woman walks in to eat. They ignored me for 10 min gave the worst service and the food was something I wouldn't even give to my dog. Very bad. \nWe are all the same Jewish non Jewish.\nSad:(", "author": "Lamis K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "We really enjoyed eating at Sabra Grill twice during our stay in San Francisco! The service is quick and the food is delicious! We especially recommend the mixed grill shish, it comes with a large portion which was tasty and fresh. The warm and freshly baked pitas are an awesome perk to the meal!", "author": "Bracha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "This place is great! We needed a very short notice Kosher catering order and Sabra was a great partner in completing that task. Our guests were so very pleased with the food, serving utensils, and everything.  They were from NJ and already knew and loved the place!! Thanks Sabra for your partnership, the great food, and making us look good to our guests.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Only kosher restaurant around so did not really have any other places to eat or compare. \n\nFood good \nService friendly \nReasonable in price \nMiddle Eastern food\n\nAte here three times. \n\nEnjoy", "author": "Naomi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "I really want to admire and like this place but a lot of reviews discourage me from going here. \nNobody was mean when the time I went, there were happy to see me and even told me where the best seat in the house is. I was brought water and good enough time to make my decision and helped me choose my order. \nI had the large hummus plate with falafel. I was served some pickles prior to the main dish along with pita bread. \nI absolutely enjoyed my time consuming my meal. Yes I do love falafel and hummus and it's a rare gem in the area even in the city. \nI'll definitely come back again but hopefully nothing negative surprises me.\nThe decor of the restaurant is actually nice and fits with the atmosphere, so I don't know what people are talking about.\n\nThe only thing that sort of questioned myself was the coughing and snorting near the entrance oh and the prices are somewhat high, something I would pay in a good restaurant in north beach. \n\nI'll most likely come back.", "author": "Nadav M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Great food and atmosphere for Israeli/middle eastern cuisine. The lamb, the hummus and the falafel were delicious. Would recommend anyone that looking for great authentic food.", "author": "Tamar T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "For all those kosher travelers out there, this is the only kosher restaurant currently in San Francisco. The food overall is okay to average, but expensive. The interior of the restaurant is terrifying even for a kosher restaurant. Please, don't use the bathroom. I gave them a single star for the extremely poor service. On business trip to San Francisco, they delivered the wrong orders to me multiple times. On a one occasion they didn't even deliver the meal, leaving me at a large event without anything to eat. Lastly, they would do things like send a hamburger with only one bun and send you additional items you didn't order.", "author": "Max G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "One word- Delicious! Scrumptious! Yummy! Oh wait- that was three!!! All I can say is that if you are looking for some amazing Kosher food there is no other place to go in San Francisco!!! After eating here for the first time I decided to order lunch of my office and Sabra did not disappoint!! Thanks so much to Joe for putting the order together and thinking of a few things that I hadn't. He's the best. When you are there don't forget to try the beef kabobs- amazing and huge portions.", "author": "Justine T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Food here was delicious!  Are here with a friend, and both of us come from families that make incredible middle eastern food, and this place was among the best middle eastern food I've had in a restaurant,  the babaganoush with hummus was yummy and we loved the fresh pita bread.  The salad had a pleasant light dressing and the beef skewer and falafel was too notch.  We were helped by joe, the owners son, who was really great, and the rest of the staff was really friendly as well!", "author": "Sharon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "The best kosher food in San Francisco , I love this place , the service good the owner and his son make the different , remained me israel", "author": "Siena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Just wonderful authentic Israeli food. Kosher and delicious! Also available for large groups who pre-order and pre-pay for Friday night shabbat gatherings! Very cool.", "author": "SaraChana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "Just had the best falafel!!!! Very friendly great food, great place for lunch or dinner!!!\nWill come here again and again!!! Thx", "author": "Guy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-11", "description": "Staff is incompetent. Delivered one entree 40 minutes before the rest of our meals. Food was cold and tasted bad. They microwave the top pita so the plate appears warm but underneath is a frozen tundra. \n\nI suggest going to Sabra hoping for the worst. You won't be disappointed.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-04", "description": "The only reason to come here is that it is the only place in town. \n\nIt is a hole in the wall, which I guess is ok... But not a place you can bring business colleagues to. The food is average. Steak was overdone even though I asked for medium rare. \n\nAnd the service, while reasonably quick, tales informal and casual to a whole new low. Even in Israel the service is a whole order of magnitude higher. \n\nSomeone, please open a good kosher restaurant in SF!", "author": "Michi K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-31", "description": "Too spendy for what you get. Wish I'd have eaten elsewhere. Service here kind of blows. Soggy, messy food. Meh. Very mediocre.", "author": "Angie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "Classy Middle Eastern service :)\nI read the other reviews and I understand what they mean when they say how bad the service was.\nHaving traveled through the middle east, you get used to this attitude and service.\nIt's that type of service that they are actually doing you a favor for serving you.\n\nThat being said, \nThe food is good. The dinner plates are really good and the appetizers are even better.\n\nPros: \nTasty food\nGood humus \nWonderful chicken \nWonderful salads.\n\nCons:\nPricing....can get quite expensive for a dinner night out.\nService...middle eastern service.", "author": "Marcy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-10", "description": "Ordered a combination salad plate.The Falafel tasted like it had been fried in oil that had cooked lamb. The French fries soggy and cold.   I was Sick the rest of the day,I will Never go back!\n-Judith W", "author": "Judith R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "So came to San Francisco for the first time and wanted to try kosher as well.  Our Hotel was close by so we walked over for lunch.\n\nIt is pricey for what it is and the service was slow.  The same server, owner, etc did everything.\n\nThe portions were small too, it tasted ok.  Not the best Kosher food I have had but for being out of LA it worked.\n\nThe restaurant is super small and upstairs in China Town.  The decor makes no sense but again it is a Kosher place, they just put everything they owned on the wall.", "author": "Naz H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "My wife and I had lunch at Sabra's and it was really great !\nThe service was fast and we had the food in minutes !!!\nThe food was very tasty and exactly as we ordered. We had chicken Shishlik with Humus, Tehina & Israeli salad.\nWe have learned that the restaurant is under NEW management, so they really improved since the last time we have been here. The service was great ( Gorgeous waitress) very kind and very helpful. \nWe have got a complimentary dessert because of the NEW management !!\nWooho !!! a great chocolate cake with layer of parve cream !!", "author": "Kobi A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Delicious Mediterranean food! Also great service and authentic taste. Great if your looking for a change in cuisine to the usual sushi, burgers...,or if you keep kosher. I got the chicken shawarma and my wife got the hummus with ground beef they were both amazing, especially with the warm pita and pickles on the side. \nDefinitely recommend this place, but you should go in knowing the prices are on the higher side which is necessary due to it being San Francisco and the kashrut certification. The restaurant was packed with tons of people, which wasn't surprising because the food was great. You definitely won't leave hungry.", "author": "Jordan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Came in due to a friends recommendation and wow were they right! I enjoyed the food (you have to get the hummus) and the ambiance was quite nice. Would recommend and will be going back next time I am in SF!", "author": "Josh M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-12", "description": "I really don't like this place. Everything about it sucks.\nFirstly, it's really ugly inside. Seriously, with the prices you charge, you couldn't get nicer chairs?Or fix the holes in the wall?Or get nicer table cloth? Looks like they got their decor from a garage sale or dumpster diving. \n\nNext, the service sucks. The waiter was so rude and arrogant and I doubt he even knows the words 'customer service.' (i don't care if he's israeli, this is SF)\n\nThe glasses were dirty...yuck. \n\nThe food was super expensive and tastes like (fill in the blank)\n\nIn summary, this place is ugly, expensive, dirty, and the food tastes terrible. Save your money and go Amba in Oakland (soo much better)", "author": "Wanda M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "This place is expensive, dirty, and the food tastes terrible. This restaurant gives Israeli food a horrible name. Save yourself a stomach ache and don't go.", "author": "April F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "Excellent kababs and falafel. True to Israeli food and atmosphere.\nThey make everything from scratch, and it's kosher.", "author": "Avi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "I was visiting San Francisco from the 5 towns area, where there are many kosher restaurants, and I visited Sabra Grill not expecting much. To my surprise, the food was amazing, the portions were extremely generous, and the service was fast and friendly. More than rivaled anything back home. I'll make sure to go out of my way to visit Sabra Grill the next time I'm in town!", "author": "Jeffrey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-02", "description": "If you like real Israeli food, this is the place to go.  Delicious falafel, humus, tehini, shwarma and other grilled delights are the tastiest features.  And you can get a great hamburger, steak, grilled chicken or salad if you want a leaner fare.  Lastly, it has the kosher seal of approval, so you know the quality is there, too.", "author": "Isaac W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "The owner will bend over backwards to please. Great food. Great service. I felt like I was in his home not a restaurant.", "author": "Harlan K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-02", "description": "This is an authentic bad Israeli restaurant. Reminds me of the restaurants in Israel I would never set foot in. It's what you might find if you try to find a restaurant in the middle of some ultra-orthodox neighborhood in a small town out in the boonies in Israel, except maybe 4 times more expensive, and with a local low-cost take on Israeli cuisine such as iceberg lettuce with GMO carrots instead of cucumbers and tomatoes.\n\nThe flavor of the microwaved rice and unchewable Schnitzel would stay with you for the rest of the day, making a (metaphoric) hole in your stomach to match the hole in the wallet.", "author": "Noam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-11", "description": "Are you a Yelper who loves to take people to really obscure restaurants, one of those hidden gems that normal people would never venture to go?   Do you then sit proudly in front of good food and tell your guests that they too will be worthy of becoming an 'Elite' some day?\n\nIf so, Sabra is the place to go.\n\nWHY GO HERE?  \nThis is the only place in the city (that I know of) that serves Israeli cuisine.  There are other restaurants serving Persian, Lebanese, Turkish, Iraqi, and Egyptian food, but not Israeli.  Note that most Jewish cuisine/deli differs from Israeli food.      \n\nHOW TO FIND:  This is part of the fun.  No hints.\n\nHOURS:  They have unique hours, so check their website (http://www.sabragrill.com/) or call first.  Closed Saturday.  On Friday, they close two hours before Shabbat.\n\nATMOSPHERE:  Pretty much what you would expect from a restaurant on the second floor of a building in Chinatown.  Probably not a good first date place - unless your tactic is to earn point via tasty falafels.\n\nFOOD:  Excellent falafels and all the great size dishes, including hummus, egg plants, and mushrooms.  While the skewered meat items where good, I could get equally good kabobs at other restaurants.  I was not a big fan of their lamb, which had a very distinct flavor that I've never had before.      \n\nDRINKS: Kosher Beer was good.\n\nSERVICE:  On all my visits here, service was casual but good.  I've learned that at a family owned businesses like this, I need be polite and respectful, where as in the bigger restaurants, I could act like a king.  \n\nSEATS:  Further to good service, they were very accommodating when I increased the reservation number.  He quickly added tables and seated 9 of us.  Very flexible when they are not too busy.  12-15 tables total.  \n   \nPRICE:  For dinner, prices were reasonable, but it may seem expensive for lunch since they don't have lunch prices.  For the next visit, my plan is to keep the price down by ordering bunch of their side dishes and staying away from their skewers, which is what brings the price up.   \n\nPlans for the next visit:\n$7.25 - Hummus and falafel\n$6.50 - Spicy mushroom and onion salad\n$7.00 - Fried spicy eggplant\n$5.00 - White cabbage salad\n$3.00 - Maccabee Beer\n$3.00 - Goldstar Beer\n$8.00 - Tip and taxes\n----------------------------\n$40 - Dinner for two\n(Prices as of June 2007; Dine-in prices)", "author": "トモ T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Was there for dinner.  Had very good matzoh ball soup with there signature hamburger. Was pleasantly surprised at how good the food was.  Service was good.  I would recommend.", "author": "Simf W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Best hummus I've ever had! Great service, and a wonderful over all experience. If you like lamb, it's a must have at this place!", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Enjoyed the burger dinner with sides of Israeli salad and the mushroom and onion salad served on hummus. Best Kosher meal we have enjoyed in a while.", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-23", "description": "Had dinner at Sabra last week while I was in San Fran.\n\nI'm not sure what's happened since the last time I was there about a year ago, but there is a new philosophy and approach.  \n\nThere was a young guy working at the restaurant who as attentive and took care of my needs quickly.  While the place was pretty much empty (it was a Thursday night at dinner time), this really doesn't have an impact on my thoughts from this trip.\n\nI had the beef and lamb kabobs with rice.  He kabobs were perfectly seasoned and cooked, the rice was a bit flat and probably had been sitting in the rice cooked a bit too long for my like (to sticky).  Didn't feel like a beer so I skipped the calories.  Total with tip was around $30.\n\nAt the same time I was there, there was at least one other sit down and one take out customer, all of us seem to have been served different items within a reasonable amount of time (around 10 mins each).\n\nWith the new attitude, I'm certain that I'll make my way back to Sabra next time I'm in SFO.", "author": "Blair C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "I just had the best falafel sandwich in I can't remember how long! Friendly service and complimentary pickles enhanced it, and I can't wait to return!", "author": "Ben R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "Sabra Grill is really the only authentic Israeli restaurant in San Francisco. It's good, but not great. It's definitely expensive, even more than the usual Kosher place and it's not the portions I'm used to in Los Angeles with all the endless side dishes. Nevertheless, it's the only place you can really find in the city for home sick Israelis.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "Loves It! I can eat lunch here everyday, except for Shabbat silly! You can stay light with falafel or go deep with many juicy meat choices.", "author": "Joseph H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-18", "description": "This is a hole in the wall amidst the kitsch at the entrance to Chinatown. You don't go for the ambiance which is horrible (unless you're into Jewish paraphernalia overload). You don't go for the service, which can be good to downright rude depending on who waits on you. You don't go for the prices as they're on the high side, especially for dinner. That said, do go for the very solid food. The chef knows his stuff. Babaganoush with pickles,  chicken shwarma and falafel. This is clearly above average for the Bay Area.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "One of the best otentic middle eastern  resturant I been in the states . Very worm place feeling in a different country .\nthe food is tasty,big dish im 100% full!!!i will visit again if i can so as my wife.\nwe really loved it. middle eastern music very nice atmosphere.", "author": "Jermy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "As a local, native San Franciscan living in Nob Hill, I am constantly on the lookout for solid, cheap, vegetarian food that isn't strictly marketing to tourists. I checked it out when I recently heard the restaurant changed owners. The restaurant is kosher, and I ordered the falafel sandwich. Super quick, awesome friendly service, great local vibe, and amazing art!! Authentic grub, and in a super great location.", "author": "allison s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-31", "description": "This place reminds of what kosher restaurants were in the 70s and 80s in Toronto.  Greasy, quirky, overly expensive, and cheesie decor.\n\nThe chicken soup was good.\nThe falafel balls were good.\nThe chicken shiskabob was blah - the meat was fatty and the skin was still on.\n\nThe best part was the crazy jewish atmosphere.", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-27", "description": "You feel like a bland, expensive dinner? Add a rude owner and you are set!\nOutrageous that Jews rip each other off like this.", "author": "Barbra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "My friend and I wandered in here at the foot of China Town and shared the combo salad (think appetizer sampler). It was exactly the right amount of food and it was DELICIOUS. I'd take a photo, but we scarfed it down so fast you'd just get a photo of an empty plate. Oh, and it came really, really quickly!", "author": "J. P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-19", "description": "Okay, so I have eaten at this place before and don't get me wrong, the food is standard for Kosher/Israeli but the SERVICE is horrible! No plates to eat the dishes off of... you must share (mind you it was a table for 6), waiting more than 10 minutes to get something you ask for, and the owner is inconsiderate!\n\nThe customer service at this place is horrendous and I wouldn't recommend it to anyone. There's a better place on Kirkham Street (take 19th Ave to get there) that has better service and just as good food. The owner is horrible to his customers. \n\nI can guarantee that I will be telling everyone I know who has been to this restaurant (And trust me there are plenty), to not go back. CUSTOMER SERVICE IS PART OF THE EXPERIENCE. People need to remember that.", "author": "Leigh W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-23", "description": "I was excited to try this joint because kosher places seem in short supply in San Francisco.  I eat everything without discriminating and have a special place in my heart for bacon, but having lived in NYC for many years I can appreciate good kosher food.  This is definitely not like NYC kosher food!  It was alright.  The lunch was reasonably priced, but the dinner seemed a tad expensive for the hole-in-the-wall setting.\n\nShawarma Wrap: This is a complete lie.  It's not shawarma, but rather raw chunks of chicken pan fried with onions and spices.  Where's the slow roasted meat on a long spit?   The meat ends up being firmer and less crispy than a real shawarma.  That being said, toasting the pita on an open flame was a nice touch and the it had a good spicy kick.  The pickles were a little boring, they can do better than just pickled cucumbers.  The raw carrot slice didn't go well, would have been better if pickled.\n\nFalafel: A bit on the small side, but I liked the extremely crispy and jagged exterior paired against the creamy inside.  Not sure if it's traditional, but a nice alternative to the uniform and grainier falafels around town.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-24", "description": "It's unfortunate that this is my first review on here - I started writing it a while ago....\n\nUpon discovering the canopy of this spot near the Gates of Chinatown during Passover, I had made plans to take my partner before she left for the East Coast - Although Passover ended on Monday night, they were closed until Wednesday, so I ended up checking it out myself.\n\nI came up to not be greeted by the guy running the show, but walked passed a few times before I signaled a table for one. He was only covering 4 very low maintenance tables of the 16 tables in the joint. After he looked me up and down he took me to the only table that wasn't set (with napkins and cutlery like the others).\n\nI had a better look at the menu and thought he'd given me the \"you're not welcome here menu\" -- almost everything was over $20 and most dishes would be $30+ after tax, steak coming in around $40, the images looked like something out of a 1970's dive cafe.\n\nI found pita wraps on the back of the menu that said lunch only or take-away. These were priced $9-$15 - I asked for a glass of water and ordered a wrap and when it arrived, he shoved the dish on the table causing the wrap to unwrap. I assumed the \"to go\" didn't apply here as he was probably expecting a tip. I was still waiting for a glass of water and was halfway through eating the wrap before I was able to get his attention. He finally brought it. I quickly finished and awaited my bill - he seemed punctual in bringing the other tables their bills as they were wrapping up their meals. I waited about 15 minutes with an empty plate, trying to flag him for the bill - which I then decided to take it up to him at the counter and pay for the meal anyway. I was charged a buck for the glass of water, but didn't dispute it as I only wanted to leave.", "author": "Wez I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "Came here tonight for dinner. It was perfectly located! I strictly eat only glatt kosher & it was really nice to have a glatt kosher restaurant in San Francisco. Thank you Sabra for the delicious food!", "author": "Kayla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Superb mixed grill with fries.Attentive and prompt service.Will return and bring guests especially  for excellent kosher food.", "author": "Theodore S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-06", "description": "I was visiting San Francisco recently, and got two of the combo to go meals.  I ordered one with a grilled chicken breast, and one with a salmon steak.  The chicken breast was cooked well, but lacked flavor.  The salmon steak was overcooked and had a lot of bones that made it difficult to eat.  Both came with rice, salad, humus, and pita.  For some reason, there were beans on the rice.  The price for the meals was outrageous.  $25 for a grilled chicken breast or salmon and some rice?  This isn't an upscale restaurant.  It's a run-down hole in the wall in Chinatown.  \nI don't think I'll be back.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "Perfect home-cooking for this Shiksa and her fabulous Jewish boyfriend. SO GOOD! The pita was fluffy and warm, the combo platter was abundant and had excellent roasted eggplant, falafel was crisp and savory. \n\nA secret gem of a place. I'm craving it now. Yum.", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-10", "description": "Only kosher rest. I seemed to find in San Fran so I had to try it. I tried this place out at the beginning of the year with a couple of friends because I wanted to introduce them to Israeli food. Although the food was over priced - they really enjoyed the food and the atmosphere. I would recommend the chicken breats and babaganoush!\n\nGo check it out if you're jewish and in San Fran! If you're not looking to eat good kosher food - I'd try a different mediterranian rest.", "author": "Serena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "The food was great. There was speedy service even though they place was packed and the waiters were kind and helpful. Me and my family ordered lamb shishlik. The meat was juicy, tender and flavorful.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "We are visiting from out of town.  The food was pretty good but the service needs a lot of assistance.  So if you are looking for a place to eat good food and have the time to wait, this is the place", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Was here for Lunch. Food is tasty. Decor and ambience could be improved vastly. Little pricey too.", "author": "Sudeep M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-21", "description": "Horrible place!!! Avoid at all cost! The service was horrible. The waiter is the biggest ass you will ever meet.  The food is disgusting and overpriced. I'd rather starve than set foot in this place ever again. No stars would be better.", "author": "Beets S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-02", "description": "A friend introduced me to Sabra today. I never would have noticed a kosher haven just steps inside the Grant Street Gate, but this place is awesome. Walking in the door the proprietor welcomed me with a smile and a firm handshake. \n\nMy friend ordered a falafel salad and chicken soup. I asked for a falafel sandwich. The proprietor said forget that, it's your first time here, let me bring you the combination plate so you can try everything. It's cheaper than the sandwich and salad anyway. We couldn't argue with that.\n\nMinutes later he brought out a huge plate of fresh falafel, tahini, baba ganoush, hummus, egg salad, grilled eggplant, and diced lettuce, tomatoes, and pickled carrots. On the side was a plate stacked tall with hot fresh pita bread. We must have assembled and consumed at least a dozen little falafel sandwiches between the two of us. Including the soup and a coke the bill was $20 even. I left the restaurant with a very full belly and a big smile on my face. I'll definitely be back again soon.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "I lived in Israel for a year, and ate falafel every day there, and iv finally found the best falafel in the US.\n\nFor years, I searched and searched for incredible falabel, and I finally found it.\n\nIv been to \"incredible\" isreali restaurants that don't even compare to this. I'm shocked people didnt like the food. I only ate falafel, so I never tried any of the meat. Yeah, it may be expensive, welcome to the most expensive city in the US. I was the only one in the restaurant and I got good service. If you love falafel, give this a shot and stop listening to all the ridiculous reviews. Some of the low-star reviews here spend 90% of their time writing about the decorations and service. If that bothers you, get it to go. If you love israeli falafel, theres no other place that even comes close. Don't listen to yelp reviews, go give this place a shot and you will see how good it is.", "author": "Logan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-16", "description": "I hate to hate on my fellow tribe members, but man is this place a big letdown.  In my summer in the Bay Area, I never once visited the \"only kosher restaurant in San Francisco.\"  Nope, it was kosher meat from Trader Joe's for me.  And yes, I passed this many a time, but just never had the urge to step foot in the restaurant.  \n\nHowever, when I had to go up to San Fran for work this week, I was meeting a friend with food allergies who suggested this place (since it would be guaranteed to not have any dairy products).  Okay, Israeli kosher food, I can deal.\n\nSabra is located at the edge of Chinatown and you have to walk up a flight of stairs to get there.  The ambiance is non-existent.  I've been to my fair share of zero-ambiance kosher restaurants, a result of having family in many Orthodox neighborhoods where \"kidproofing\" a restaurant is a much better investment than decor, but this seemed even worse.  It felt like I was in seminary at one of those Beit Midrashes (i.e. study hall at Yeshiva).  The tablecloths seemed jaded, and were covered in outdated Israel postcards with a layer of glass on top.  The artwork on the walls was a mish-mosh of Judaica.  And there were laminated numbers denoting the tables, which had metal-backed chairs that I only regularly see when I go to a shtiebel for High Holidays.  (Finally, a Yelp review where I can put my yiddish lingo to good use.)\n\nOkay, so we go up the stairs and sit down at one of the tables.  We get our menus.  Sandwiches are only for lunch or to-go, which was a bummer since this would have been a great option.  Oh well.  But a kebab?  Over $20!  Are you friggin' kidding me?  I go to my kosher meat market in West LA all the time, and a grilled-to-order kebab is $6 or less.  And even that has more ambiance than this place, so I can't say that I'm paying for atmosphere, as I may at an upscale locale.  \n\nSo we go through the menu.  Our third dining companion has a strong allergy to wheat, and couldn't have anything touching flour.  I know what you're thinking - one kosher gal, another allergic to dairy, and another flour.  It's like a joke waiting to happen, but given the menu, this place should have been quite accommodating - especially since they weren't serving sandwiches.\n\nThe waiter (dressed in a dirty tee and jeans) came to take our order.  I opted for the Shakshukah, which is an Israeli egg dish.  Oh wait, they're out of that.  Darnit.  Okay, I have to look back at the menu, since I refuse to spend $20 on a dish here.  The girl with the flour allergy orders an omelet, but asked not to be served the accompanying fries because she's hella allergic.  And stated and restated this at least five times to the dude.  No pita, no fries - kapiche?  The third one got schnitzel.\n\nSo then it's back on me to order.  I opt for the Shawarma, even though I think it's a ripoff.  But wait - waiter says - they don't actually cook this the way you do shawarma - on a rotating grill like a gyro.  No, this is just sauteed chicken.  WTF?!?!  Then don't call it shawarma.  Heck no, I ain't getting sauteed chicken - what is that even?  So I cave and order Melawach, which is a flaky Yemenite pastry I usually cook at home for under 50 cents a pop.  \n\nAs we order he asks if we'd like to start with an order of hummus and although it's also overpriced ($8) we say okay.  \n\nThe hummus never came.  The omelet came covered in the fries, despite that the diner belabored the point.  When she pointed this out to the waiter (who was the only guy covering the dining area), he just looked at her and was like \"is this really such a big deal?\" and returned with a plate to put the fries on... even though she explained that now she'd have to cut away all of the parts touching the fries.  The melawach was okay - it came with unseasoned minced tomatoes, though it traditionally also includes an egg of sorts which was missing.  So not worth the money.\n\nAnd then we get the check, a good 20 minutes after we asked.  Oh wait, they charged us for our nonexistent hummus.  Of course, we wouldn't known that had I not been able to read Hebrew, since that's what our order was written in with no English line-items.  I pointed this out and the waiter reluctantly removed the item.\n\nSo $45 for an omelet, a pastry topped in tomato, and a chicken cutlet.  In a place less comfortable than eating at a cubicle and with a rude waiter.  I've dealt with expensive restaurants (that are usually worth it), rude waitstaff, and unwelcoming restaurants.  But with that trifecta and mediocre (at best) food, the only reason I can see why this place is in business is because it's the. only. kosher. restaurant. in. San. Francisco.", "author": "Tamar F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-26", "description": "It may be the only kosher reaturant in SF. Very friendly staff and good service. The hummus was demi decent. The shawarma isn't really shawarma but it was tasty. It's a bit on the pricy side but was craving kosher meat.", "author": "Nurit Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-08", "description": "For the first time in a decade, I got a shawrma sandwich in a pita that came with lettuce, but this was dole salad mix with the little shredded cabbage, it wasn't even good lettuce. The shawarma was just chicken with onions, since when is that Shawarma? The pita fell apart on me. \n\nEvery time I have walked into Sabra I felt as if they didn't want me their, the owner is extremely mean looking and the only redeeming quality is the guy working as a waiter is a nice dude, but the place is a shithole. You walk up creaky stairs and enter this restaurant that looks like a crack house and has the nerve to charge $27 for a steak and some rice. \n\nDon't give me that crap about SF not having kosher meat, save your money and go to the Kitchen Table in Mountain View if you want world class kosher food that is inexpensive. \n\nOh and you can only get a sandwich during lunch hours, get there too late and be forced to make all sandwiches into an overpriced platter.", "author": "Heshy F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "I'd grown accustomed to hearing terrible things about Sabra, and I'd poked my head in once to see the lack of ambience, but whatever, I'm an Orthodox Jew and if someone comes to town to visit, we can eat at my house or eat here. We're kinda stuck.\n\nAnyway, an old friend of mine and I went last night. I had braced myself for the \"mean\" owner and \"bad food\", but it wasn't all that bad. First off, the owner is the one seating people, taking their orders and cooking the food. I can imagine there are times he isn't so happy. We weren't looking for any kind of special treatment, though. He didn't smile, didn't have much personality, but he answered questions, took our orders, and brought them out pretty quickly. I had the whole tilapia fish and it was just right. The fries were good, the hummus and tehini was excellent, and I was happy. \n\nI have to remind people that complain about the place: it's a kosher restaurant. The food is always exorbitant, the service is always horrible. I don't know where these folks have had kosher before, but I can't imagine why they all get so bent out of shape after coming here specifically.\n\nI will echo one post I saw here though: Don't come here if you don't keep kosher. You won't like it.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-01", "description": "Very mediocre. Had I read the reviews before coming here, I might not have tried, but my friend from LA eats only kosher, and thus I gave it a shot.\n\nThe place's decor is nothing to write home about. The place was completely empty save for maybe 1 table with people eating. \n\nWe each ordered a chicken schwarma sandwich, with a plate of fries to share. It was very very bland and untasty. The french fries were hot and fresh, but it didn't compensate for the utterly uninspired main course.\n\nFor this experience we were charged $24.00. The same food at a non-kosher restaurant would be about $15.00 and at least be tasty.\n\nFor those who aren't familiar with Kosher restaurants, the prices are ALWAYS above market for ANYTHING, because of the additional expense of keeping a kosher kitchen. If it's a meat product the food will also be more expensive as a result, but it is no excuse for bland, mediocre food.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-26", "description": "Food is authentic Israeli - and fresh! Friendly staff and quick service.", "author": "Georgeeiiee F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-12", "description": "Decent falafel, good hummus, decent pita bread, over priced,  but you can eat Kosher and sit in a place that seems out of this world (at least in Chinatown). It's close by the FiDi, so you pay for that convienance.\n\nDecor: cool old world hebrew pictures hang about.\nCustomer service: gruff and sometimes indifferent (oi vay ! waddahyah expect?)\nWhy do I return: it's very different and I don't mind the crummy customer service.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Food quality is amazing.  We had almost every dish on the menu (we had 12 people in our group.  Every single one was a top notch.  Home made food to order doesn't get any better than that.  They definitely don't take advantage of being the only kosher place around, you would think they are smack in the middle of Pico Robertson.  The owner is super nice and if you are too lazy to go there, call them up they just night deliver or come pick you up!!!", "author": "Yael L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-25", "description": "WhoooooooHoooooo!\n\nNow THIS IS BBQ!!!!\n\nComeGetUSome!!!\n\nPS...\nI LOVE THIS PLACE!!!", "author": "Carey H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-17", "description": "I was visiting the bay area with a Kosher friend (full disclosure: I'm not Kosher) and she wanted to try some grub in the city.\n\nThis place is just inside the gates of Chinatown and is located up one flight of stairs. It's a plain-looking restaurant that could double as someone's one bedroom apartment.\n\nI tried the falafel platter and it was just OK. My friend had the schnitzel and fries and felt the same way. The best part, however, was listening to the restaurant owner and an unhappy patron argue over the cost of the meal. Stereotypes aside, it was a hilarious show to go with dinner.", "author": "Patrick V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-05", "description": "I am surprised by the poor ratings. We came here for lunch on a Sunday afternoon. My friend ordered us salami omelets, potato cigars and pita. The portions are extremely generous, the service was prompt, respectful and accommodating. It was a slow start to our day and he allowed us to eat a leisurely meal that lasted almost two hours. The omelet wasn't like anything i have had before, not a traditional omelet, it was fried with delicious pieces of fresh salami - and it was heaven. It was served with French Fries that were equally as delicious. The tahini sauce that was served with the fried potato cigars was delicious. Like my dining companion said, you really can't go wrong with mashed potatoes wrapped in phyllo dough and deep fried.\nTrue, the ambiance is lacking, but I go for cleanliness, delicious food and good service and this place has all three. I actually give Sabra Grill 3.5 stars and would try it again.", "author": "Meagan O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-14", "description": "They've kinda got a monopoly on kosher food and seems like they exploit it.   Prices are very high.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-13", "description": "Walking around Chinatown I couldn't believe the Hebrew writing that I saw. It brought me back to the days I was living in Tel Aviv on a volunteer program. \nI went in and was so pleased to have found a kosher place, especially in San Francisco! And every time ago that Israeli vibe I get its pretty great!", "author": "danna r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-14", "description": "Look, I always say that Israelis shouldn't be in the service industry outside of Israel. The mentality is different, simply put. Simply put, Yuval, the owner, comes off as a rude egotistical bastard to most Americans - because they are not used to the no-nonsense, straight-forward personality (but he is great - aka flirty - with women).\n\nFood-wise, it is so great to have Kosher food in the area. The Kosher certification (hasgacha kashrut) is provided by the Vaad haKashrut of California, and there is a mashgiach (religious overseer) on site at all times. Hummus, soup, shwarma (Israelis - this is really pargiot, not shawerma), al-ha-esh (grilled meat), Israeli salad ... all is good and decent to eat, especially when you consider what else we have in the area. Even the Arab restaurants don't come close on the food. The cost is a bit higher than I would like to see, but Kosher meat (even wholesale) and the certification is not cheap whatsoever - so the owner is just trying to cover his overhead.\n\nThe location would theoretically be alright, considering it is close to downtown and at the entrance of Chinatown. However, there are quite a few older Jewish patrons that find walking up a steep set of stairs not an easy feat. The interior is a good size, and I suggest sitting near the windows if you want to feel the vibrancy of the City while eating.\n\nOverall: Decent Kosher Israeli food in an area lacking other options. Moderately high prices. Typical Middle Eastern owner.", "author": "Ariela R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-14", "description": "So we were starving and craving falafel.  So this was the only place open on a Sunday that was near us so we go in.  I'm kinda sketched out so I pull my phone out as were seated to see what yelp says.  Then I come across this hilarious review about Sabra that says \n:The owner, who reminds me of a big, mean looking Vince Vaughn.\"  It made me laugh so I read it out loud and instead of my friends laughing they are giving me the shut up look.  Opps he was sitting behind us.  And yeah he really does!  So the food was OK.  The only thing worth coming here for would be the falafel.  That is it.  The other dishes were terrible.", "author": "layne l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-21", "description": "The food here is amazing but the service is so terrible, I will never go again.\n\nFor lunch, one time I waited FORTY minutes for my take-out order, and when I got it, it was wrong, so I waited FIFTEEN more minutes.\n\nOn my next visit, dinner later in the week, the staff was rude to us and was clearly more interested in serving the regulars than any one else.  My Israeli boyfriend tried to speak Hebrew to the staff but they were jerks about it.  Even a customer was inexplicably rude to us!  After we ate, we asked for our bill several times and finally had to resort to leaving cash on the table, estimating the bill amount to the best of our ability.  I didn't leave a tip.  I believe this was the ONLY time I've NOT left a tip in the last ten years.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-19", "description": "Food:  OVERPRICED.  If I could increase the font size to emphasize OVERPRICED, I would.  If you don't care for the kosher aspect, I trust you won't want to pay $17 for a hamburger patty and some fries or $14 for three hot dogs (without buns) and some fries.  \n\nService:  I imagine most gentiles don't get much love.  I certainly didn't.  I don't understand it; if you don't like serving people, take a vacation to Hawaii or something and hire someone who is capable of uttering the word \"hi.\"  Some may say, \"Geez, you're Chinese and Chinese restaurants aren't exactly known for good service.\"  My response: The day you pay $17 (not including tax and tip) for some lousy broccoli beef (without rice) is the day I get down on my knees and beg for your forgiveness.\n\nBest bargain of the place: falafel plate.", "author": "Lily T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-01", "description": "I went here last night for the first time with two of my favorite men: an absolutely beautiful orthodox Danish man, and an impeccable man from Pasadena with a penchant for Boston beauties.  We were here to celebrate the completion of the writing of the Danish man's dissertation (this is the only restaurant in SF where you can get kosher meat for dinner).\n\nSo, we walk in and just seat ourselves.  Danish man speaks to the waiter in Hebrew and I ordered some vegetarian items on the menu.  Pickles came out first, which where sliced up sideways.  Ok, thanks for the nosh.  Then I had the potato salad.  The whole time I was eating it, I was thinking that it seemed more like egg salad?  There was a ton of mayo and I had to hunt to find the potatoes.  Not sure what the rest of it was, but I was definitely sorry that I had eaten so much of it toward the end of the meal. \n\nAfter that, I had the falafel.  There were eight falafel balls on a tray, and I had to ask for pita and hummus separately (for additional price) to complete my meal.  You would think they would have the sandwich on the menu?!   \n\nWe washed it down with two slices of apple strudel shared among the three of us.  Ever since that moment, I have been nursing a stomach ache.\n\nI feel bad giving only two stars to this establishment.  The owner seemed very nice.  But, sorry, the food just isn't good, and it is really expensive.  For the three of us, the bill came to $80.  No good.\n\nEdit - absolutely beautiful Danish man wants me to amend my review to state that his ribeye steak was $28, which is why the bill was so high.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-07", "description": "I came to this restaurant with a party of six. When our orders arrived, I didn't receive mine and had to sit there and watch everyone enjoy their meals while waiting for mine to come (it never did, even though I reminded the waiter a couple of times). The waiter was rude and, instead of apologizing,  acted as though the omission was my fault. I vowed never to return. Oh, and the food was mediocre, at best.", "author": "Judith F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-13", "description": "Mean and stupid people!\n\nThey almost ruined the last night with our Israeli relatives.\nWe just went there, a group of ten, in need of a strictly kosher restaurant.\nWe walk in: the restaurant is half empty. The guy there (owner? waiter?), looked unfriendly and annoyed at the idea of dealing with a group the minute we walked in and he said it would be 25 minutes. We told him that we don't mind if the group is broken down into 3 tables. Apparently that was \"disrespectful\" and we were asked to wait outside, so we just left.\n\nSo,the last night that should have been a nice reprieve for my relatives from juggling with their special small pots in my narrow kitchen, ended up with batches of pastas at home. Thankfully that didn't stop anyone from having a good time and at least there is a bit of a story to tell.\n\nBottom line: next time your religious relatives come to San Francisco, don't bother with Sabra, just buy bigger pots for them or, even better, special order food.", "author": "Elsa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "Nice little place in downtown SF area. You walk up the stairs to a small dining area, full of Jewish artwork and decoration...it was pretty cool. Food was a little pricey, but worth it. i've had the shnitzel (fried chicken), and came back a few days later for the lamb shishlik (lamb skewer), both were hella good. Big plates, which surprised me when i got my food. The waiter was chill too. The only thing that would make the place better if the prices weren't so expensive.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-20", "description": "The only reason to come is if you are kosher and have no other options.  But only if you are visiting and staying in a hotel.  Otherwise buy some kosher chicken at Trader Joes.\n\nIt took over 1/2 an hour for my shawerma to come (after first bringing me a dirty, lipstick stained water glass and then the wrong sandwich) and it was lousy.  Iceberg lettuce and some sauteed chicken and onions in a pita w/ som tahini.  I've had much better at other restaurants in the city.  Luckily I came at lunch when I could get a $9 sandwich rather than the very expensive dinner platter.  If I hadn't gone up to the register to stand and wait for 5 minutes to pay after waiting about 20 at my table for a bill that never came, I'd still be there. And I don't care which grand poobah certified the place kosher, it seemed just plain grimy in there!  Oh, and the women's bathroom was out of order.\n\nSo, the food was mediocre, service extremely slow and not terribly pleasant, the atmosphere is non existant (think back room of a bowling alley)", "author": "Michele M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-16", "description": "This is the best falafel I've ever had outside Israel.  I am a person who has spent some time in Israel.  My mother would be Israeli had it not been technically known as Palestine at the time of her birth (sorry to out you, mom).  Now fair enough, that is worthless information in re: my falafel experience.  But at a casual glance it seems like it ought to accredit me to some extent, right?  So we'll go with that.\n\nThe falafel: excellent.  The sandwich is missing a few things--the hot sauce is not up to snuff, there are no strips of fried pita or french fries in it, the pickles are provided on the side and are not in a pita-stuffing-friendly shape.  But when you get right down to it, all that stuff is meaningless without high quality falafel.  The bottom line: scratch one item off the (distressingly long) list of foods the West Coast doesn't know from.\n\nNow, does anyone know where I can get some pickled tomatoes?", "author": "Joel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-04", "description": "I have major problems with the 'service' at Sabra Grill.  When I went there, a girl at another table ordered from the children's menu, and she expected to pay only the children's price, but the owner confronted her and called the police - who showed up to solve the dispute over $5!  You can imagine the yelling contest that deeply disturbed everyone else's meal there.  That pettiness alone is reason enough for me to never go to this place again (eventhough its the only kosher restaurant in northern CA).  The food is fine, but priced like its the only kosher restaurant in northern CA (i.e. outrageously expensive for the quality of what they serve).", "author": "Ben C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-16", "description": "I was in San Francisco for a few days and only found two kosher restuarants. We were sightseeing in SF and visted China Town so we decided to try this one. \n\nThe service was horrid. There was only one waiter and the food was mediocre. I was so looking forward to some excellent kosher food and I ended up with a stomache. Sabra was a big disappointment. Whenever I return to SF, I will never go there again.", "author": "J W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-03", "description": "Sooooo, just got back from lunch at Sabra with my favorite cowboy of all time.  This place is soooooo goooood!  A little pricey if you ask me, but fuck that baba ganouj is to die for.  It's so creamy and garlicy and perfect.\nWe split a few appetizers - falafel, hummus, baba ganouj and fried eggplant.  I don't think there was anything left over, not even hot sauce.  Not even pickles.  Not even pita bread.  \nWhen I got back to work just now, I told my boss like this: \n\nMe: \"Boss, I just had the most amazing Israeli food.  I'm so freaking full\"\nBoss: \"Wow, you NEVER tell me you're full.  You always tell me you're hungry.  Must have been good\"\nMe: \"OMG YESSSSS.  I think I'm gonna pass out now.\"\n\nSo that's pretty much empirical proof that Sabra is bomby as all hell. Minus one star for being over priced and not having the soup of the day (MATZAH DUH) sign out when we got there.", "author": "Katherine K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-08", "description": "Come to Sabra to eat, not dine. I'm not sure I've ever eaten someplace where food is such an afterthought. Salad seemed straight out of a bag with dressing applied liberally. I was never asked how I wanted my beef kabob so it came out very over cooked. \n\nThe waiter/host/manager cleaned tables around us by spraying oodles of ammonia cleanser on to the table. A cloud of the ammonia surrounded our table as I was about to take a bite of food--I ended up with a mouth (and lungs) full of the spray. \n\nStop by if you need kosher food. But avoid anything beyond simple items including the steaks. If you are entertaining guests or customers (or a date!) do not come here. You will be far better of making the drive south to Mountain View and trying The Kitchen Table.", "author": "josh k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-30", "description": "OK...I don't keep Kosher.  Not that either the food nor service was bad...it just wasn't really good either.  No...won't be returning here.  \n\nThe service was 100% Israeli (nonchalant to the point that it borders on rude...even if rudeness was never the intent).\n\nThe prices were obscene (perhaps people who need to eat out Kosher are used to this).  We shared a plate of Hummus (not bad) and a combo kebab plate ( three moderate sized kabobs of chicken, beef and lamb served with french fries).  add 2 sodas and the tab was over 50 bucks!  YIKES!  \n\nI'll stick with some of the Falafel and Shwerma places in the Mission for better food at a much better value.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-02", "description": "one guy that keeps kosher, one bad jew, two california godless hippies. lunch. low expectations (the key to success in life).\n\nwe were all pleased and pleasantly surprised. i had the eggplant sandwich, my co-hippie had the falafel sandwich. we're foodies like the rest of the SF population and found the food darn tasty and satisfying. The other two got kabobs of some sort and thought they were tasty too. \n\nyes, the service was not top notch US service (we're too spoiled and demanding anyway), and the decor didn't resemble the lobby of the W hotel, but it was a darn tasty lunch.", "author": "who k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "Amazingly good! I can't understand the bad ratings. Loved the Baba ghanoush. The pickles were almost as good as what my grandmother made. Almost. It looks like some are annoyed at the service, but that's part of the charm!", "author": "B R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-20", "description": "I had a real difficult time determining whether the service was worst than the food or the other way around. I think it's a tie. They both pretty much suck... I'm a huge fan of Mediterranean food as i grew up in Israel and this was just unreal. Me and my girlfriend had to wait 30 minutes until the guy took our order (mind you, we were only the 3rd table occupied) then another 30 minutes or so for the food to come out. The Hummus and Ganosh were both very runny and the Falafel wasn't impressive either. Even the Israeli salad lacked the seasoning it needed. \nOverall, a very bad experience - i'm certain we will not come back.", "author": "Jennifer And Uri W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-20", "description": "The place is Israeli-style hummus--you can get it with a boiled egg, tahini, etc. The service is mediocre, though. The guy sent me on my way with burnt pita bread. Two blocks away there's Baladi which has better hummus, is cheaper, and much better service.", "author": "Jarrett S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-02", "description": "Place is not good at all. Management needs training. In a nutshell. The food sucks.", "author": "Robb C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "I can only speak to take-out as I usually get my order and hit the park for lunch. Food is very good and the falafel is the best I've ever had. The guy behind the counter is sorta grumpy but my order is always correct and I get it pretty fast. Good value for the price.", "author": "Maggie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "Sure, it's a little pricier than I wish, and sure, the waiters don't act like you're the second coming when you sit down, but man I love this place. It's such a great hideout from the craziness of the financial district and Chinatown, and the food is always amazing. I used to come here years ago when working nearby and this place would get me through the day. My friend and I would get take out: falafel or eggplant sandwiches or shwarma, maybe some potato salad and soup, and walk to the little park just up the block to eat and forget about our work in the sunshine. Pretty great. I just went again yesterday to see if it was still wonderful, and yep, the matzo ball soup was just as I remember, the falafel was great, and I forgot about the plate of pickles - nice touch. Yum!", "author": "Ali L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-26", "description": "really the worst food.  I had serious doubts as I entered the doors looking at the grimy walls and food spattered carpet....I was wanting some authentic middle Eastern cuisine....I'm certain the grease that my food was fried in could have been saved from the time of Moses it was SO old. The smells inside of this stuffy grungy eatery rival a machine shop think essence of crank case oil.  The pastrami was slimy yet dry...how does that happen? The waitstaff was really unfriendly....I felt like the plates were plunked down in front of us with grunting and grimacing....I miss the joy of having food around my Grandmother's table...the fresh cucumbers,tomatoes,home made yogurt....hospitality felt lost at Sabra Grill.  My husband worried about food poisoning....The food was grey looking...grey.", "author": "Sylvia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "I like the no nonsense attitude. In a city that's getting so far from real, with so many places sporting fake \"ambience,\" I appreciate Sabra's no frills authenticity. I totally love that it's kosher. And I am completely charmed that I have to go to Chinatown to get to an Israeli place.  I'm not a member of the tribe, but I've always been courteously and respectfully treated. The place is clean. I don't get attitude about avoiding meat. The falafel is awesome and so is the hummus. And the pickles. The pickles. The only time I eat all the pickles is when I go to Sabra.", "author": "Bibi R. R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-27", "description": "We were ending a great day of \"food hiking\" in SF and had just left a chinese cafe run by a delightful family that served us egg rolls to go when we saw this place. My wife is Jewish and we are always trying to top the falafel we had at a London flea market. The place looked creepy enough on the outside to be really good so we gamely mounted the stairs dragging my two 22ish sons along. We all piled into the plain little room and were glumly surveyed by the Yarmulke clad customers. The owner gave us dirty looks as the young waiter scurried about. The shy son returned to the stairs to avoid the stares. The three of us held our ground until the owner came over to get rid of us. We ordered a falafel to go to everyone's relief. I guess this is a private club. My wife understood the ranting of the owner to the waiter and felt sorry for the waiter. We made it back out to the street with our falafel and rated it about a 6 out of 10- kinda mushy, not a crispy enough shell on the balls. \nFunny though, this is one of the things we will remember and laugh about the most when we recall this trip to SF.", "author": "Rose C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-22", "description": "I had to physically make this post!! What the hell is wrong with the citizens in this orb of numerous sustenance undertakings? This hidden Jerusalem den of delectable delights sits stoic and outside the usual fare right at the tail end of china town. So, anyone would figure, \" you order hummus when you're at the corner of pine and grant.....sounds like you were harnessing a surly temperament.\" Well, there you are: muerte incorrect. I could have been eating chancre sore laced hunan fried rice, or this lovely, impeccable falafel. It was the best falafel ive eaten in quite sometime. the pita was scorching, a marvelous additive along with dense, luscious, feathery, decadent hummus and, you guessed it, pickles without prompting. BAAAAAMM! that corpulent co-opted ass flounder Emeril would have been tres enthusiastic. A gorgeous, notable experience. Its kosher baby, so watch your trousers.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-04", "description": "I pretty much just need to reiterate what Christopher is saying below. This place is way-overlooked. Probably the most unique dining experience I have had in San Francisco, with all the pious Jewish families with very young children in the small dining room (man, do my people know how to breed). And the pita bread. OMG the pita bread. If only they had pita like this where I grew up.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-11", "description": "5 stars for a fucking excellent falafel plate, delightfully surly staff, and the pure delight of a kosher restaurant in chinatown.", "author": "Olivia G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-30", "description": "Perhaps the worst shawarma, customer service I have ever had. The owner is very unprofessional and very mean.", "author": "Tufan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-06", "description": "The Service here is horrible. The guy that answers the phone is the biggest A hole I've ever talked to. I tried ordering a catering buffet with some allergies specifics and the guy answering the phone was so incompetent he got frustrated and hung up. Too bad my order was already placed or I would have used another restaurant. I wouldn't recommend this place to anyone!!! And being in the industry I am already letting everyone know what a dirty dive this is. WE have a lot of guests that need Kosher meals but will never use this dump again!", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-02", "description": "I love the look on the cashiers face when I came upstairs to this little hole in the wall joint with my goy of a boyfriend.  Like he was watching a gorilla and a kitten prance around as lovers.  5 stars for that.  Two stars off for being a little expensive for falafel.  Those things should cost 3 shekels maximum.", "author": "Tamar N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-26", "description": "Only Glatt Kosher option for dinner in San Francisco...maybe there will be more options one day. Sabras serves basic Israeli food, most of which is fine.  They usually only have one waiter serving, so if you go when there are more than 4 tables seated, you might have to wait for attention,so order everything you need the first time!", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-21", "description": "Definitely a strange setting, and I'm not sure I'd enjoy having a long meal there, but it's amazing for takeout.\n\nEverything they use is very high quality - the beef, the hummus, the falafel.. everything.  The owner is a strange combination of New York Tough Guy and devout Orthodox Jew, but he knows how to stuff a pita.  I typically get the falafel and have also been blown away by the schwarma and the beef kebab..  ditto the baba ganoush (sp?) and hummus.\n\nExtra points for the sleepy rabbi in the corner.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "So my gf and I stopped in for a quick bite as we were shopping in the area. We had a chicken shwarma and okay, yes it's a little pricey but cmon it's downtown. And yes, they have a $10 minimum if you want to use a credit card but most items are around that much anyway. But the shwarma was excellent and let me tell you, I'm a very picky shwarma eater. They used fresh veggies, humus was excellent inside, the hot sauce was good and the chicken was cooked well. I'd def want to go back and try some of their other items.....not sure why everyone on here is hating on them so much. And the service, wasn't the greatest but wasn't bad either. The dude was just a little soft spoken and the service was top notch considering its a small tiny spot upstairs in Chinatown.", "author": "pankaj l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "thats the only kosher restaurant i know in san francisco and its great!! good shishlik and very good falafel and humus!!! i still havnt tried all the dishes but i will surtenly will", "author": "dor w."}
