{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "Just a heads up, waiter service is only during dinner. At lunch, you're supposed to pick up your own utensils and food at the front counter.\n\nWe started with the fries and baba ganoush. The sauce for the fries and the flavor of the baba ganoush was amazing. They kept bringing over more bread for the dips when we would run out which was great.\n\nI ordered the chicken kebab plate for my entree. I was amazed how how large the plate was for $12.00. The chicken was juicy and the flavor/marinade was amazing. My plate came with a side of rice, hummus, salad, and lavash bread. My rice had some marinade/sauce on it which was delicious and tarte. The hummus was also super flavorful and one of my favorites that I've ever had. The plate is actually very versatile. You can make a wrap using the lavash, you can have chicken and rice, chicken and salad, or just chicken on its own. I ended up having leftovers and took the rest home.\n\nOverall, service and food was great! You definitely get a lot of bang for your buck. Parking was also easy to find. We found parking right in the front and since we came for dinner, parking was free! Score! The only thing missing in this with all the decor might be some hookah, haha.", "author": "Love K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "My fiancé and I dined here on Saturday for lunch and absolutely loved it! We randomly stumbled upon this amazing place while kitchen cabinet shopping (what fun that was...)! I highly recommend this place! \n\nWe were greeted by Renee who was also the cook and server. He literally ran the entire place with a smile on his face the entire time. He was super friendly and just an all around nice person. Given that, the service deserves 10 stars!\n\nThe food was excellent! We shared the meze appetizer platter and my fiancé had the lamb shawarma, which he said was amazing. I highly recommend the babaganoush (eggplant appetizer) and the hummus - both high in flavor and absolutely delish. \n\nBesides the food and amazing service, the ambiance was incredible. I can't wait to come back here with a few friends and dine in their beautiful area where you dine on the floor!", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "I went to Saffron 685 shortly after they opened up and got the shwarma wrap. It didn't taste as good and as fresh I would have hoped. \n\nAlso, I didn't appreciate the tone of the gentleman at the cashier. It all made sense after reading the responses from the owner on Yelp.", "author": "Adam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "The best Mediterranean's food I've had in San Francisco. It was delightful and tasty. We ordered the beef kabap plate and Maza app (babaganush, taboleh, and dolmema) - my fav. Desserts are ba must try: Kafona, sesame cookie, and Turkish delight. All were incredible. \n\nPlus great service!", "author": "Sinath N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-30", "description": "Nope.... Never going back again!! Below average food for above average price. \n\nI ordered the chicken wrap in lavash($ 10.95). It looked extra ordinary and huge. But in that footlong wrap there was 3 pieces of chicken and a whole lot of potatoes and other veggies. It felt like a vegetable wrap. There was a mix up with our orders too. But the server kept on insisting he was right, we got confused. Two things were really good here: the red pepper dip and the lavash... but overall a huge let down.", "author": "Tania C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "Excellent Mediterranean food at an unreasonably reasonable price. All the classics done well with a solid selection for a pescatarian. Service was fantastic & very charming. Restaurant has comfy low couch seating for groups which adds a nice touch.", "author": "Colin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Hidden place on Townsend, I came here on Saturday night with a few friends & it was a blast, stellar food & quick service, started with the sampler Mezée trio appetizer, it has fire spicy, Moroccan carrot & red pepper pomegranate walnut dip, all unique, we shared three entrées: bbq prawns, beef steak & the lamb kebab, one of a kind, l was afraid when ordering the lamb but surprisingly was so good and tender, the carry a good wine, ask for the wine list, l had to order a bottle of clos de L'artoir des papes, couldn't resist the temptation, will definitely be back.", "author": "Aida S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-30", "description": "Honestly the best Mediterranean food in the entire city. I think I've tried it all. I used to order very regularly on Uber Eats. But in the past month I've had at least 10 orders cancelled after they are \"preparing\" the food in the app. Maybe they're too busy? If they are they should just turn off the app. This is a terrible experience. I'm grateful for the good experiences of the past. But I'm very disappointed with them at the moment. Sent with love.", "author": "Eoghan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "My husband and I live in the neighborhood and grab dinner here on a regular basis, sometimes eating in the restaurant and sometimes getting take out. It's really quick, convenient, and low key - and there's always a table open in case you want to swing by at the last minute. \n\nThe food has been generally delicious (pretty standard Mediterranean fare) and the prices reasonable for San Francisco (with generous helpings). I usually get the shawerma or falafel plate and have food left over. No complaints about the service.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "This was my first time in!  I work down the street and have been looking for new, Delicious places to eat for lunch.  I wondered into Saffron 685 to have the most FANTASTIC food.  YUMMMMM!! I ordered the Veggie Kabab Plate.  Everything was cooked beautifully!  It's a lot of food and I was hungry!!  HIGHLY SUGGESTED!!", "author": "Jaime C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "I really enjoyed the shwarma plate and the red hummus appetizer spread was delicious. \n\nThis place is great for for a dinner date or some other sort of small intimate get together and the atmosphere is great.\n\nI personally see this becoming a regular place for me to eat at.", "author": "James P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Why is this place never packed?! I am really surprised since the food is absolutely delicious!\nIf you haven't been here you are missing out! :)", "author": "Ariana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "We walked over for lunch one day. It had plenty of seats open for lunch which was a good thing. We both have other homes. His is right next to a busy street that has Sunday farmer's market and often filled ethnic eats and Asian shoppers, the real Chinatown as they would call it, and I'm in a similar situation but a different neighborhood, and on occasion we would meet up in this neighborhood. Saffron is a nice little neighborhood restaurant that served non threatening middle eastern, mediterranean food. \n\nFor lunch we would order a wrap, and a shawarma salad. He had a side yogurt dip which I thought I could have made for him, and perhaps even better but he was happy with the restaurant version. It was a sunny early afternoon. I have known him for longer than most and there was that sense of comfort you get from knowing someone so long and so many secrets that are no longer so, that you can just sit and eat and chat about nothing. I don't have many friends, and more importantly, I don't have a lot of time. It's important to choose who you dine with carefully when you don't have much of those things, and I think where to dine makes a difference. This is a quiet, conversation facilitation friendly place nestled between a Michelin (Omakase) and a Michelin wanna be (Khai). I have been to both, and felt this little diner seems to outperform its fancier neighbors in its solid food offerings and better restaurant ambience. \n\nI recently ordered a take out from here again. I called the restaurant and they had prepared the food and then called the delivery service to make sure that my food got delivered on time. They were very pleasant on the phone and greeted me by my name. It could serve as a good alternative for home cooking. I will be back.", "author": "Victoria E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-23", "description": "Sleepy Saturday in Showplace Square.  At 11 am the place was 100% empty which was up our alley because we didn't savor dealing with the Brunch crowd. The menu is loaded with tons of vegan and vegetarian options that are famously Mediterranean. The stars were the Tabouli,\nGrape leaves and (sorry not sorry) the hand cut French Fries with the balsamic aioli. The warm grapes were complimented by lemon zest. Yum. Highly recommend if you want a quiet lunch with vegan options.", "author": "Marcy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "The food quality is actually a solid 3-4 star, but the service was truly terrible. The guy seemed really nice, but it was pretty atrocious.\n\nI was going to say I'd consider stopping by here if I needed a quick Meditteranean fix in the future, but I read some of the childish retaliation from the owner in response to some of the low reviews, so I will 100% avoid this place on principle alone in the future.\n\nEDIT: owner replied as expected. 10/10.\n\nWhy ask for wine if you don't have wine? Why would you ask for our preferences on drinks or food if you're not going to follow through on any of them? The server constantly forgot to bring us items, miscounted plates / utensils constantly, didn't bother taking or addressing any of our common custom requests. It was truly one of the worst services I've received, but the dude at least seemed nice...", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "I came here for a meal with a group after visiting Room & Board up the street. Our wonderful host and cook for the evening was René, and he treated us excellently as the last walk in of the evening. He was very attentive to our special orders (some of us avoiding gluten and dairy) and served us a trio of tender lamb kebab plates, with a tasty side appetizer of the Moroccan carrot dip and a pomegranate spritzer. The flavours were lovely and the food fresh. Highly recommended!", "author": "Ayden G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "My brother and I ate at Saffron 685 prior to going to a Giants game at the end of September. We shared the Shawerma Plate, a Fattoush salad with feta cheese and a Tabouleh salad with added olive oil and lemon. All the dishes were excellent. This restaurant is better than most I have tried from Santa Cruz to San Francisco. Recommended highly.\nRobert", "author": "Robert O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "Walked in for lunch and the restaurant was empty and no employees in site. When a guy with an apron finally came out and said he was short staffed and could only make the food to go.... didn't even offer to let us sit down. Very rude attitude from what seemed like a manager or owner", "author": "Mark B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "I love the falafel wrap here, and the guy who runs the place is super nice. They also serve beer, which is handy.", "author": "Branson S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "DO NOT ORDER CHICKEN. We went last night to Saffron 685 around 7pm and the place was virtually empty. One of the entrees we ordered was the chicken kebab. When it arrived I stabbed a fork in a piece of chicken and the fork pierced the meat with the same feeling it pierces raw chicken. I then cut it and the knife tore thru the meat. It didn't look raw, tho, so I asked my girlfriend what she thought. She cut another and it was clearly raw, so we brought it up with the staff member (just one person there). He begrudgingly agreed to remake it, hardly caring about us showing him raw chicken. This was honestly the first time I've sent food back (I get way too nervous).\n\n15 min later he brought out another plate and clarified that it is breast meat. It felt like he was saying that's why it has that texture. Once again, my fork went thru it with the same feel. We inspected and couldn't find any evidence of rawness. I ate one piece, but I couldn't eat anymore. The texture was too much for me. The rest of the food was fine, but that hardly makes up for it. He didn't ask how the new plate was or show any care for our experience (no other comments, no comping of anything, etc).", "author": "Nathan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "The best Mediterranean food in town for sure. Always high standards in quality of food as well as service, ingredients always fresh and prices are reasonable, will be a regular.", "author": "Elmir A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "I have been going to this place for the last 8 years. It has been a consistent lunch spot for me. Although I don't love every item on the menu, their lamb shawarma and lamb kebab wraps are very delicious and reasonably priced. Definitely check out if you are in the neighborhood!", "author": "Sedat A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-01", "description": "This place will give you food poisoning. My husband and I visited it yesterday and we both got sick because of the food. I suspect unhygenic food preparations because we both have no allergies. On top of it the service was so bad and the owner has no regard for serving crappy food. I regret eating here and will ensure that none of my friends and family ever enter this place again.\n\nEdit: This atrocious owner has the audacity to talk crap after putting my family through such difficulties. I've seen her replies on other posts and now I get how she is trying to blame the victim by talking irrelevant nonsense. I didnt visit her restaurant on 1st Aug. Please read her replies before deciding to visit this godforsaken place.", "author": "Rana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "As delicious as ever. I hadn't been in years & it was fantastic. I had the falafel and shawarma salad. The falafel was so tasty I had to get a second order. The man had the chicken wrap in some yummy lavash bread. The babe shared the falafel and had latkes, her favorite.\nThe service was friendly. Even gave the babe a Turkish delight!  Desserts are made in house so we had to go home with some baklava. Mmmmmm.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Fabulous! Home made from scratch yogurt, baklava, dips like babaganoush and my favorite, his red pepper dip. Hard to make fresh - Saffron has a fantastic kitchen. Approachable, spotless. Cool Moroccan floor cushions plus sofas and regular seating - great options for socializing. Menu on their website. Wine and beer. Take out too. Owner obviously proud, committed to his craft, culture, and customers.", "author": "monica p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Just stopped by here for a quick meal with my boyfriend. He had Shawarma (lamb) wrap and I had chicken Kebob plate, plus pomegranate spritzer and Turkish coffee. Everything was delicious, we also ordered tzatziki with pita, which is a favorite of mine and it hit the spot. My chicken kebab was perfect and juicy and not overcooked, which was nice because most of the time I find kebobs to be more dry and tough, but this was perfect. Place was clean and had nice comfy, hidden-gem type decor. But truly it was our awesome waiter who made the visit so special! Such a cool guy, funny, charming, and helped my boyfriend pick his meal in terms of recommending which meat would be better as a wrap. Will definitely be back!", "author": "Savannah L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "We ate here and ordered the shawarma, the dolmas, baba ganoush and hummus, then we finished with wonderful desserts and splending coffee.\nAll the food we ordered was absolutely delicious and served at a timely fashion. The service was excellent, professional yet friendly.", "author": "Oscar O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "The place is super clean and food taste really good. We ordered the Falafel plate and Shawarma Lamb Wrap. The person who helped us was very helpful and personable. I will come back for sure. Also, entered parking is very easy to find here. Two thumbs up here!", "author": "Jake M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "Renee made me up something super tasty when I showed up after the kitchen was closed. Great service, kind guy, great falafel wrap.", "author": "Torben U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Lamb Shawarma is AMAZING. HUGE PORTION.\nRenee is a great host. \nWill definitely go again.", "author": "Ronil A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "One of my favorite Mediterranean food places in SoMa. I come here often for lunch and their falalel wraps are pretty awesome. Would for sure recommend this place.", "author": "Vikhyat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "My wife and I are traveling from North Carolina. We stopped in for a quick lunch. We were very pleasantly surprised!!! The food was absolutely delicious. Service was outstanding. By far the best tasting Mediterranean cuisine I have experienced.", "author": "Benjamin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-18", "description": "0 stars if I could. I just got a takeout order and it was TERRIBLE. I ordered the lamb kebab wrap which was huge and with literally only 3 pieces of actual meat and a bunch of just veggies and other stuff. Not good. Ordered a soup that was cold along with everything else, and didn't even get any silverware to eat it with. The French fries on the side were about the only thing I ate. Would not recommend.", "author": "C M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "This place is truly awesome. Very authentic and the vibe inside is very satisfying. \nThe lamb shawarma here is the best I've had and they have a ton of other options too. The portion size is huge enough to feed the Hulk. \n\nTip: Take a pilsner with your meal and I bet you'll come back for more", "author": "Sahil A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Went to San Francisco for a conference and got some amazing Mediterranean food! The decorations and seating were lovely and the food was even better. Had a lot of vegan and gluten free options, would highly recommend.", "author": "Jordanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Superb Mediterranean and Turkish cuisine. Great red pepper dip and dolmas. The kabobs and the falafel were outstanding. Very flavorful. Great service. Would come here again. Great food.", "author": "Deborah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Loved the food and different varietes of appetizers and desserts here. The owner is very friendly. Nice hospitality and ambience. As a vegetarian, I rarely get to see many options in menu. But this place had close to 20-25 vegetarian options. Everything was so tasty. Highly recommend this place.", "author": "Aditi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "If you love taste of good Mediterranean food and service this is the place to come very clean", "author": "Mahgoub E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "This is an amazing place. Nice owner! Fresh food. The rose candy he made is really testy. Five stars experience.", "author": "Gabbie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-05", "description": "Pretty no-frills place for Mediterranean. The carrot dip was really good and our veggie kebabs were fine. Nothing spectacular, but would come back to try the lamb. The waiter was a little sassy and funny, so it made our experience unique.", "author": "Geri W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "I am so happy to have found this place! There are a lot of options in the area, but many of the restaurants along this strip either have super long waits or don't have good service. It was refreshing to walk in and be pleasantly greeted, then well taken care of throughout my entire meal. The good was also great - I had the Lamb Kebab plate, but there are a variety of options ranging from health to comfort food. The décor was very nice, and overall it had an enjoyable ambiance. I am looking forward to going back soon!", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Friendliest owner, great dessert, relaxed vibe,  and perfectly spiced Mediterranean food. Will definitely come back.", "author": "Jonathan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Great Mediterranean find!! Got the lamb combo plate and it was delicious. Lots of food and amazing flavors. Glad I came by! Will come back.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "We've lived just feet away from this place for two years and only just managed to try it out. Shameful that we haven't stayed more local and regretful that we've been missing out for so long! \n\nOrdering is easy, the service is friendly and quick, and the food is delicious, made with very fresh tasting ingredients (we had lamb and chicken kebab plates). This place makes a great alternative to staying home and cooking, without breaking the bank.", "author": "John R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-01", "description": "DON'T eat at this unhygenic and dirty restaurant. My whole body swelled up and I got fever. I was starving today and made the terrible mistake of ordering at this place. I ordered the falafel platter and as soon as I ate it I started to swell on my face. The swelling proceeded to my face and body and then I also started feeling feverish. The doc said it was a case of rotten food that was served to me. \nCompletely AVOID this shitty place IF YOU DON'T WANT TO GET SICK.\n\nI just went through the reviews and I saw a couple others that have faced similar situations and got sick just like me. This restaurant must be CLOSED DOWN immediately.", "author": "Ilyas M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Looking for a place to have a relaxing 5 star meal? This is definitely my go-to for Mediterranean, the salmon fillet plate is always cooked to perfection and the quality of everything is what you should expect at every restaurant. The hummus is creamy and smooth, salad is always fresh and all of the portions are adequately balanced.", "author": "Victor H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Saffron 685 is such a find! Amazing Turkish food, in a casual neighborhood setting, without the insane crowds! We could actually have a conversation without screaming... SCORE! We've been there a few times and the chicken kebab is our favorite, with the falafel coming in as a close second. You will not go away hungry -- the portions are quite generous. Eating here reminds me of traveling in Turkey, not only because of the food but because Saffron 685 is REAL, with great food made to order. Renee is the host, who seems quiet at first, but once you talk to him, you see immediately he's a great guy and eager to please. If you want terrific food in a casual neighborhood setting, this is the place!", "author": "Sue H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "I was looking for a lunch place at 3PM (i know!) and luckily they were open. I had their amazing salmon filet plate which was freshly cooked and came with hummus, salad and beans - so healthy and nutritious!!\nThe place has a nice cozy (\"family\"?) vibe to it, the food feels very \"authentic\" and delicious, the staff very accommodating and friendly. \nI will definitely be back!", "author": "Irena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I love Saffron 685! Their falafel is exceptionally good, and the staff is all very friendly. Most importantly, they have the best baklava in the Bay Area. \n\nTheir tea, Turkish Delight, and mint lemonade is all top notch as well. Highly recommended!", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Very nice place and delicious food also a very good service , try the homemade juice ( lemonade )", "author": "Abdoul W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Great food and friendly service. We especially liked the hummus, falafels and fries. Great combo! Also, treat yourself to the mint lemonade, it's delicious and a great treat on a hot day.", "author": "Kalie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-22", "description": "The worst place ever!!!!! I usually don't like to post bad reviews but this restaurant pushed me beyond my limit !!!!  Just want to tell you what happened with me before I tell you what happened with other people there !!!!!!! First the food was horrible and taste old and nasty !!!! Second they robbed me by charging the credit card 4 times and I had to call my credit card to get my money back after I gave up talking to the people in this restaurant since they are the rudest people on earth including the manager and the tall guy there that looks Persian and never wants to say his name or wear his name badge !!!!! And to know about what happened there I was seating there with my family and my family's friends and two old black ladies in mid 90 came to the restaurant with a small cute service dog and they approached them and lied and said oh we closed then he pushed them out of the door however it was 2 pm and they close at 9 pm and it is illegal to refuse serving people because of their color or disability !! I hope they sue them !! \n\nThis restaurant in one sentence\n Most aggressive people most rude people worst food and they will rob you all for 19.99 !!", "author": "Arnold Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Good portion sizes and excellent food. I'll be coming back! I would recommend the shawarma wrap or kebabs.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Wonderful Mediterranean restaurant. Got the lamb plate and found the meat cooked perfectly, makes me salivate now just thinking about it...okay, going to order takeout.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "I had the green pepper dip with pita bread and the falafel wrap. The wrap was SO GOOD. The bread part was crisp on one side, which I'd never had before. Usually falafel wraps are just soft and sometimes soggy, but this one wasn't! And the filling was great too, with hot falafels! The portions are pretty big, so I was definitely stuffed by the end and had leftovers for later.\n\nThe restaurant was mostly empty since I went on a weekday for dinner, but the guy who worked there was super friendly and provided great service. I wish I found this place sooner!", "author": "Maya R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "I've come here off and on for nearly a decade. They have always been kind and maintained the quality of food at a reasonable price. Im a big fan of the wraps and the sweets.", "author": "Bashir Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-23", "description": "A Mediterranean restaurant far beyond the ordinary.  After shopping at REI we had a hankering for Mediterranean food and we were delighted to find this place right around the corner.  I imagine this place is very busy with workers from Zynga and Adobe during the day, but in the evening it was a very quiet and pleasant spot.  The food was consistently far superior to comparable Mediterranean/Middle Eastern places around town, from the pita and lavash to the tabbouleh to the shawarma.  We particularly loved the pomegranate/walnut/red pepper dip, but it seems you can't go wrong with the menu.  The service was extremely friendly.  Highly recommended.", "author": "Victor O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "We happened into Saffron 685 when looking at a nearby college. The ambience is very welcoming and warm. We got the chicken kebab, lamb kebab, and meza appetizer plate. All three were amazing. The hummus alone was the best I have ever tasted. The pomegranate spritzers went perfectly with the meal. This was topped by the waiter who was so kind and made our experience that much more enjoyable. I look forward to coming back whenever I make it up here!", "author": "Heather K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-01", "description": "Quick lunchtime falafel that had just the right amount of sauce, hummus and the wrap was nicely toasted to give it a great texture. I will go back.", "author": "Todd S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Love this!! Came here after work and was pleasantly surprised! We got the prawns kebab plate and chicken kebab plate to go. Portions were big, and the flavors of everything were delicious! Loved the salad and baba ganoush especially! We also got the mint lemonade, so refreshing. The baklava were also delicious. I was sad we didn't stay to eat either; the couches and tables were roomy and comfy. Zero complaints about this meal, will be back!", "author": "Melissa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "This restaurant is calm, serene and with zero pressure. The food is freshly made by the owner on the spot. The dishes are flavorful and authentic. It is a place that one can enjoy a lovely meal and leisurely conversation. It is a rare place to enjoy delicious food with a glass of good wine.", "author": "Qi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "This is the best lunch spot in the area. While it's quick service, there is no quality compromise. Fresh and high quality everytime (I've been coming here for years). Renee is concious of every detail down to the finishing spices. Very fairly priced, too!", "author": "Joshua G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "It was a lovely dinner, the spot is a hidden gem, freshly prepared food & budget friendly!  Not many good Mediterranean Turkish restaurant in San Francisco, so many dips to choose from, spicy green pepper dip and the lamb kebabs melt in your mouth. Amazing! My new destination for Turkish food, We will be coming back.", "author": "Erkin A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "What a gem! I was looking for a cozy spot with fresh, healthy comfort food and this was perfect. Their lamb was so well spiced and the veggies perfectly cooked. Loved their dips!  I am so excited to know this place is here! Will be back often.", "author": "Willow R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "This is an amazing place to have a drink. The back room is so private and relaxing. They have the best fries in town!", "author": "Maria W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "This restaurant is very understated and always seemed a bit empty when I walked by.  So, I didn't try it for awhile.  Once I decided to, I was not disappointed.  The food tasted fresh, authentic, and well seasoned.  I've tried the chicken kabob plate and the lamb shawarma plate.  Both were really good portions and super delicious!", "author": "Corey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Amazing food. Everything we ordered was very fresh and I love the service. I look forward to coming back to try other dishes.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Great tabouleh and fresh salad dressings. Great lamb and shawarma! We will come back next time we are in the area. Friendly service and handmade", "author": "Nappy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "LOVE THIS PLACE!! incredible food and the guy was great! he cooked, served and altered some of the menu options and it was amazing.", "author": "Jacquelyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Love the shawarma salad with feta cheese here, owner is friendly, my wife and I both like the food. One of the few places in the city where like the meat quality is nice if u r getting gyro meat.", "author": "Amendra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-19", "description": "Really, super delicious food!! My friend and I split the latkes, which were gorgeously crispy and golden. We got the appetizer plate and enjoyed everything with the yummy, warm pita. The lamb schwarma plate was probably my favorite thing we ordered. The salad and rice and lavash that came with it were all delicious as well. The man in charge was very friendly and spent some time talking with my friend and I since it was a quieter moment at the restaurant. We really enjoyed and will be back!!", "author": "Kristin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "Wow this place is very tasty food. I.will be back again I really enjoyed the lamb kabob plate. Tasted very healthy and with fresh ingredients. Baklava was perfect. Give it a try)", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I ordered the chicken kabob plate and it was delicious much better than other Mediterranean food i have tried in SF. I also had the baba ganoush and latkes which were tasty as well. Great service from the girl behind the counter. Recommended.", "author": "Eugene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "This place is a hidden gem as far as Mediterranean cuisine goes. Very fresh and high quality ingredients plus great customer service. I do plan to come back here especially for the wild caught salmon plate.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "I can not judge the food in this place but, obviously, the people who run it are not all there. We walked into an empty, totally empty restaurant. All tables were empty. The person at the counter asked us to sit down at the table across from the main counter, but we asked him if we could sit at another table 7 feet from it. The guy told us we could not sit there. I asked him if it was reserved, and he a said that section was closed. A section? First of all, it was NOT even a section, it was a table literally seven feet away from the one he had offered to us.  I guess it is more important to him that an income. May be they run a charity, can not tell and will not come back.", "author": "Sophie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "We went to Saffron 685 for a late lunch / early dinner on our last night in San Francisco before returning to Atlanta. \n\nThe meal did not disappoint! Rene was attentive and whipped up everything we ordered fresh - the roasted red pepper dip is to die for. (He gave us an extra helping of grilled pita too!)\n\nWe got the lamb kabobs, grilled salmon, and the Shawerma wrap. It was SO much food and for such a good price.\n\nEverything was cooked to perfection and we even got to drink a bottle of wine we picked up in Napa. \n\nDefinitely worth the visit, for in town peeps or out of towners!", "author": "Courtney L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Amazing authentic Mediterranean fusion food!! And awesome cozy atmosphere at great prices! This is a hidden gem in Soma", "author": "Aylee N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "I work across the street and decided to try this place out. Ordered their chicken kabob and it's amazing. Really tasty and juicy. Since I'm carb dieting, I like to order the kabobs on the side. Service is great, and they make their food fresh. I highly recommend!", "author": "Ron K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "This place is awesome! I had the Shawarma wrap. The lamb was perfectly tender, overloaded with fresh hummus and a crisp wrap. It was pretty filling and great value for money. Plus some great conversation with the owner. Worth trying out!", "author": "Nitin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "Very fun find. Great food and very friendly staff. A cute place to relax and enjoy who your with.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-01", "description": "This place was decent. It was pretty late not much else was open. Don't waste your money on the extra $2 for feta to add to a sale it was literally a sprinkle.", "author": "Jillian G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Delicious lamb plate and presentation and corgi friendly!!! Great treats for the dog!", "author": "Yosun C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Great menu, pretty decent prices, excellent service, lots of different types of Turkish flare with a twist. \nBest way to sample the food here is order them like tapas and then try them all, It is a great way to try new foods in this way if you haven't had it before!\nThe mint lemonade freshly made in the house with no sugar add it and it is so refreshing. \nyou could bring your own bottle of wine for a small uncorking fee, totally worth it. \nFood comes out pretty fast. \nDifferent soups, l like the roasted tomato eggplant red pepper soup, comes in a big ball. Nice flavor & totally vegetarian. All in all great experience.", "author": "Jorge B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "I will be sad to not be able to come here every noon for lunch because our office is moving. If you work/live around I would definitely recommend them.", "author": "Cagdas T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "A friendly small business! We live in the neighborhood so we often get take-out for dinner. Husband always gets the shawerma wrap and I love the latkes. We recommend this place highly!", "author": "Alyssa D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "The latkes are unreal!  Crunchy exterior and soft insides. The dolmas are out of this world!  The marinade that Rene uses on the Beef Kabobs is Fantastic. Friendly service. Great music too!", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "I've been here 3 times now and it never ceases to disappoint! Great quality food, very reasonable prices, and the owner Renee is very friendly and welcoming as well! Can't say enough good things about this place, new-ish to the Bay and I'll definitely become a regular here!", "author": "Rich K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I've been coming to Saffron for years. Since before all the OTHER tech companies moved in, Saffron has been my secret lunch place, the place to go for real conversations, to sit on a pillow on the floor, with a tiny super-strong coffee and my shawarma salad, picking away at the problems of the universe. I adore it here, the staff are kind and remember me, and the service is swift. Get the delicious fresh lemonade, but please don't take my seat in the back corner. :)", "author": "Marisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Absolutely incredible service. We came late in the evening and Renee helped us by making a delicious meal. The service was great, he joked around with us, and we had a real genuine conversation. Morrigan and Cian say hello, and thanks again.\n\nSeriously, go here.", "author": "Morrigan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "What a wonderful place for food and service.  My fiancee and I wandered into here, both hungry and tired as we just returned from a long weekend of camping.   We wanted some comfort food - we received that, and some wonderfully personal service as well.  The server, who's also the cook, was delightfully friendly and funny.  The food he prepared - we had the lamb kebab and the falafel plate - was fantastic.   The lamb was succulent.   The tabouleh was particularly flavorful.  We wound up talking with him about how he prepares things and how he gets fresh ingredients from local farmers markets.  We will definitely go again some time soon.", "author": "Sid S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Clean food with perfect balance of protein, greens, cheese. One of those random visit which makes you plan for the next visit to stop here.", "author": "Hari T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "A nice spot for tasty dinner. Loved the lamb kabob and the potato latka. The chef, Renee', is very personable and took good care of us.\n\nAmbience is nice, with couches and pillows and low lighting. Good wine for a good price, too.  Try the Turkish coffee as well.", "author": "Irina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "I used to eat here quite often when I worked at Adobe. My go tos were the falafel wrap and chicken shawarma wrap. Always cooked fresh, easily customizable to get extra sauces as desired. Can take a bit longer than some of the other lunch places in the area because they do cook to order vs some other Mediterranean places that prepare shawarma ingredients in bulk much in advance but I always found it worth it. The owner", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This place is a hidden gem! The food is so good, best tender beef kabob and well marinated chicken kabob. The desserts are so good, the baklava with pistachios and the one with walnuts are always fresh. The people working here are so friendly, we had a great time.", "author": "H M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "The BEST. Absolute best Mediterranean/Middle Eastern food in SF, period end of story. My partner and I drive all the way from Ocean Beach (30 min drive) to devour all the delicious, fresh, organic eats. You really can't go wrong with anything on the menu, but my favorites include the Salmon (wild caught) fillet plate, the Shawerma plate/wrap, the Manaesh Za'atar plate, the and ALL the salads especially. So so fresh and delicious. The deserts, Turkish coffee, mint lemonade & Moroccan tea are also a MUST have. I could go on and on about this place, so do yourself a favor and check it out! Cheers!", "author": "Ahna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "The chicken wrap was real good and real big. Baklava was very fresh and delicious. Owner was very friendly and very helpful. Definitely coming back.", "author": "Peter G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "This is the freshest food! I am Romanian so our cuisine is very similar, it feels like I am at home. Honestly even the vegetables I crave. Amazing food, wine selection and even a soup and some desserts. What more could you ask for?", "author": "Christina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Awesome place for Mediterranean food. The food is excellent, both in terms of quality and the portions they give you. The place has a modern, yet authentic feeling that is laid back and comfortable. The staff are very friendly and helpful. Overall, my go-to place for Mediterranean food.", "author": "Jack D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "My family stops by whenever we're in the area! \n\nTheir pomegranate bell pepper dip is delicious, and an excellent start to the Mediterranean feast we indulge in when we come. Their kebabs are perfectly spiced, their coffee is strong, and their house-made desserts (Turkish delights, nougat, baklava) are rich and satisfying. \n\nI highly recommend!", "author": "Shaun S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "Awesome food with super friendly and quick service.  My new favorite lunch spot!\n\nI have had the shawarma and my friend has had the falafel wrap and both were really good.", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "This is a great spot for a quick meal.  Very reasonably priced and the food is solid.", "author": "beach m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "My favorite thing about this place is the ambiance. It blends the line perfectly between cozy and professional. Great for dinner with a couple friends or a causal business lunch. Everything is spiced to perfection and I always leave feeling full yet light - my favorite part of mediterranean eats! Super friendly staff that takes pride in getting to know their customers!", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "It was a great find, we had the Wild Salmon with exotic blend of beans, 2 types of barbecued lamb and chicken on a sticks with saffron rice, for dessert the Konafa which was amazing and Torino type nougat but on the soft side, we were told it was made out of egg white, rosewater, almond and pistachio it was good too.  Worth coming back.", "author": "Lena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "Amazing food! Healthy but flavorful. Had the chicken which was so good I ended up ordering beef and lamb to take out for the family. Place is casual and homey. Will definitely be back. Highly recommend this place!", "author": "TC D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "One of my favorite cafes around. Prompt, friendly service, and there are plenty of vegetarian and vegan options. Every dish I've had is excellent - especially the falafel and dolmas. I definitely recommend this spot!", "author": "Chip S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "The place is a hidden gem, l had today the kebab mixed plate with the freshly mint lemonade, both were fantastic, l finished the lunch with konafa.", "author": "Yahia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Really really good! Highly recommended! Try the chicken skewers or the lamb both are really tasty! Great service as well :)", "author": "Marianna D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-26", "description": "I've enjoyed Saffron 685 for the past five years and the food is always consistently fresh and tasty.  A nice selection of drinks, appetizers, sandwiches, entrees and desserts.  They have the best chicken kebobs that are cooked to perfection every time.  Renee is pleasant and the service is wonderful.  Love the decor too.   Fantastic for lunch or when I don't feel like cooking dinner.  All around great place to have in the neighborhood !", "author": "Charmane C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "We came here on Saturday night right before closing the server we spoke to was gracious, we sat on the low Moroccan table with large cushion pillows, love the ambiance, cozy and casual, food was superb, quality and quantity, prices fairly reasonable for San Francisco, only thing they were out of Konafa dessert.", "author": "Bilel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "This place is a little known gem, in my opinion, especially for dinner.  I often stop by here around 6:00 PM to get carry out, although their dining room is also more than comfortable.  The food is very consistent and very tasty.   My personal favorites include the falafel plate and the lamb kebab plate.  But, honestly, I have brought many friends here that ranged from vegetarians to carnivores, and everyone was very happy with whatever they ordered.\n\nEven though during rush hour there is lots of traffic streaming by on Townsend Street, I am always pleasantly surprised that I can usually find parking at one of the meters.  And you don't have to feed the meter after 6:00 PM!\n\nThe owner is really dedicated and seems to work endless hours as far as I can tell.  He has lived in the neighborhood for many years, so it is a bonus to feel like I am supporting a local business.\n\nPlease give this place a try if you are in the mood for Mediterranean food.  So many of these places are being driven out of business by huge rent increases.  I would really like to see this place get the opportunity to remain a fixture of our neighborhood.  In other words, try it -- you will like it!", "author": "Conrad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "The chicken kebab plate is great! Also the portions are a good size so it's good value for the money.", "author": "Loretta J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "I came here on a recommendation from a friend and it was lit! It's a beautiful Mediterranean restaurant! They have very delicious and healthy foods. Their portions are very generous and people work there are very friendly.  I highly recommend it!", "author": "Bendi Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This review is long overdue, I've been coming to this place for about 10 years and it never disappoints! The food is delicious, nice easy going atmosphere, the owner is very friendly and is always nice to chat with as is the staff. Whenever I'm in the area I make it a point to stop by for a meal, everything on the menu is delicious!", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Saffron 685 is fantastic! Always surprised that no seems to know about it! Cannot go wrong with the Falafel plate or wrap!", "author": "William G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-11", "description": "Went there for lunch today with my coworkers and we all ordered wraps.  All of our wraps had 2 pieces of meat each, a ton of hummus and nothing much else.  My friend asked for hot sauce and they charged him .50 cents for a tablespoon of hotsauce.\n\nWe were sitting at our table and we asked for water.  They placed the glasses of water by the cash register and waved at us to tell us to pick up our water from the cash register.", "author": "Francis B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Good food and inviting ambience. The salmon was delicious as well as the hummus. Definitely will be coming back.", "author": "Kiki H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "A family member got very sick on the food here. Pity, because it tasted ok. We ordered the mezza platter and some other items.\n\nThe comments from the manager below show how little the restaurant cares about their customers. They sent me a private comment asking for more details and expressing concern, but for some reason wants to pass this off as an allergy! Amazing! Dealing with food safety professionally is part of running a restaurant business!", "author": "Lavy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Saffron 685 gets 5 stars from me for two reasons: delicious food and the lack of excellent Mediterranean (Middle Eastern) restaurants in the area. The Shawerma plate is especially good, and generous. There's a wine and beer selection, although I go for the Moroccan mint tea, and great desserts.", "author": "Greg T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "Nice Turkish place, I came here on an advice of a friend who said that  is one of her favorite restaurant in San Francisco. We were still pleasantly surprised by the relaxed, informal tone of the decor and the staff. \nThere is nothing fussy or stiff here. The meal was worth every penny. Food was original full of favor, there is a Moroccan accent to many of the dishes, in the spicing if not in the ingredients. \nThe service was perfect for my taste, attentive, friendly, comfortable, and exquisite lay timed, many dips and spreads, beets crunchy walnut & pomegranate walnut red pepper dips are both top notch. \nServer was patient with us she explained a lot about the food and made recommendations, but would leave us alone to enjoy the whole experience. Perfect.", "author": "Marina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Renee is a master and this place is his temple of Zen. He works like a machine yet manages to humanize himself casting doubt on the denied claims of sentient AI by tech giants. The food looks and tastes like something out of a Star Trek replicator. Rather unreal.", "author": "Sneha N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "I ordered the lamb kebab plate and the Moroccan spiced hot chocolate. The lamb kebab plate was excellent. \n\nI can't say much about the Moroccan spiced hot chocolate, because I didn't feel comfortable drinking it. I used UberEats, and when it arrived there was a good 2 inches between the drink and the lid. Did it spill in the car on the way over? Was the driver drinking it? Was it a medium drink in a large cup? Given that there was no saran wrap between the drink and the lid, and no tape over the lid spout, I decided to just not drink it. \n\nWhen I called the restaurant the nice person who answered (a few minutes after closing time actually) explained that the hot cocoa has a foamy top, and they fill it all the way, and that it is expected to go down by the time the delivery happens. Also, there's normally a piece of tape on the lid, but they were particularly busy and it's possible that it didn't get on there. \n\nThis did ease my mind a bit, but still 2+ inches seems like a lot. So, I hope to enjoy this drink sitting in the restaurant someday, and I will definitely not order hot drinks if I end up using UberEats again.", "author": "LD M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Solid healthy food, they have low carb options as well. Great setup to bring friends for dinner as well!", "author": "Anand R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-04", "description": "This is my everyday lunch spot . Everything is fresh,tasty, and the portions are big .Also the service is very good and quick . Oh and they have the best fries", "author": "Greg D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "It was good food. I especially loved the maza platter. As a Turkish I grew eating lentil/bulgur dish and it reminded me my childhood. I want to mention Renee by name as he was very friendly.", "author": "Bahadir A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-05", "description": "This place was horrible. One piece of chicken in the salad. They didn't have plastic knifes or apparently knives of any kind to cut/split our wrap because \"We don't do that here\".\n\nThey packaged the food terribly and it leaked all over the place.\n\nDo yourself a favor. Skip a meal rather than eat here.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-26", "description": "This is one of the more authentic Turkish restaurants in SOMA.  It features a wide assortment of Turkish Mediterranean dips and mazes including not limited red pepper pome dip with walnuts, spicy green pepper dip and organic beet walnut dip, the latter is my favorite. The soup is the perfect dish for a chill night in San Francisco. My first choice will be the roasted red bell w/ grilled eggplant because it is like two meals to me.  When it arrives to the table to slowly enjoy. The grilled wild Salmon and Manaesh Zaater plates are one of the best I've ever had, order the Moroccan mint tea! Hot yet refreshing. Service was very friendly, and they were more than happy to make a substitution for my friend (extra veggies instead of rice with her entree\n\nparking is bad due to all tech companies in the area, however I noticed most restaurants near by don't get busy for dinner! I don't mind as long as the food that good.", "author": "Mayak A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "I ate here all the time when I worked in the neighborhood. Fast forward to two years later, they're food is exactly how I remembered it. Mediterranean plate was my go to. Their lentils are amazing, as well as their fries. Dolmas, hummus, tabouleh were on point as well. The block is constantly changing restaurants, please never leave Saffron 685!!", "author": "Spamricebacon V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "We came in while it was empty at night. I imagine the bulk of its business is done during the lunch rush. The latkes, lamb kebab, mint lemonade, and konafa were all amazing, and service was very prompt, friendly, and attentive.", "author": "Charles W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "I love this place! I've been meaning to write a review for quite some time as I come here almost 1x a week.\n\nThe food is fantastic - fresh and healthy. As a Turkish cuisine the place has many dips - my favorite is the flavorful but not too heavy carrot dip. My go-to order is the fattoush salad topped with feta with falafel on the side. My boyfriend's favorite is the chicken kabab plate.\n\nCall ahead for easy take out or grab a glass of wine and eat with a friend.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "This is one of my favorite places for lunch. My go-to meal is the falafel wrap and black mint tea. The falafel is always moist and the wrap has veggies and excellent sauce.", "author": "Martin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "The chicken kebab is delicious. I love the food over there, it's truly authentic Mediterranean food.", "author": "Manar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "Superb food and service at a perfect price point. Our takeaway order was prepared on time and was delicious. Every item was an invitation to try other new tastes. I highly recommend you explore Saffron 685 and enjoy it  too.", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "My favorite shawarma in the city!  Super fresh and well balanced in flavors.  I work in the area and I've eaten just about everything.  I love Saffron because it's healthy, super tasty, and hearty servings.   \nMatching the great food is the great service.  Being greeted with such warmth and kindness always makes me feel good no matter what kind of day I am having.  The love and kindness that I am met with I know is the same that goes into my food.  An easy five stars for me.  Thank you Saffron 685!", "author": "Larry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Been coming here for many years. Great place for some falafel and wraps! Excellent lunch option.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Stumbled upon this Turkish place in a hungry stupor, and decided to give it a try (after all, Mediterranean places are a dime a dozen on this city). The location is okay, albeit a difficult to find and kind of off the beaten track. The interior is nice and spacious. There was no one in when I came. \n\nI wanted to get the salmon kebab, but at $17, I didn't think I wanted to spend that amount and get annoyed if it wasn't good. I chose to go with the meza sampler instead, opting for falafel, hummus, and dolma. The hummus is probably some of the best I've had in the city (for some\nreason, this city can't get hummus right!!). The falafel was cooked to perfection and the tahini sauce really hit the spot. The dolmas were also delicious.\n\nOf course, I couldn't resist the homemade baklava. SO.DELISH. Nice, flaky, and soft in all the right places.\n\nSome reviews indicated that customer service was lacking, however I feel that a part of this is cultural. With that said, I didn't find the lone employee to be rude in the least bit, but that could be left up to interpretation.\n\nPros:\n-good hummus\n-nice selection of options\n-homemade baklava (enough said)\n\nCons:\n-a bit inconvenient to find (there's street parking and a closed garage, but otherwise it's a bit hard to find this place).\n-some items are a bit overpriced in my opinion", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "Great place to come and eat, been coming here for many years now and food always taste the same. (Delicious.)\nI will highly recommend if you're craving Mediterranean food.", "author": "Raffi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "We had a very nice lunch here! \nthe restaurant is in the design district, as we went there for lunch, it was full with business people, but it was still a very nice and quiet atmosphere. \n\nWe had grilled Salmon, organic beef steak and BBQ chicken on skewers, for dessert the Konafa with ricotta mozzarella pistachio with a lovely cardamom black tea. \n\nthe staff was nice to explain the menu, and service was fast and courteous would definitely come back here for some good Turkish food.", "author": "Christina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Best service and food! Staff was great and food came promptly. The falafels were amazing. Prices were very reasonable as well!", "author": "Krista K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "I had not come to this side of town in more than 8 years but made sure to drop into Saffron since I was there. It was my favorite lunch spot 10 years ago when I used to go to the Design Center.\n\nI was happy to see that nothing had changed. The food (specifically the shawarma) was as delicious as I'd remembered it. The service was great as always and the ambiance was soothing and welcoming.\n\nIt's rare to see a restaurant last this long, especially given the rising rents in this city and the gentrification in that part of town. Kudos to the owner for making it work. The food speaks for itself. If you're near the Design Center, make sure to drop into Saffron and judge for yourself.", "author": "parissa s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "One of my favorite lunch spots.  Falafel is great, staff is friendly and attentive.  Highly recommend!", "author": "Saran C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "I've been coming here for four years since I've worked down the street. Always get the falafel wrap or plate, and they do a great job with friendly service. Very tasty lunch spot!", "author": "Ariadne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "I always got food delivered through ubereats from this restaurant. Food has always been on point, good and not too long of a wait.", "author": "Fabio C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Large portions! This place gives you enough food to feed a family. The chicken shwarma is extremely tender and great. It comes with rice and some vegetables as well. I'll be sure to come here next time I'm starving, because it fits the bill for that. Saffron has a quaint interior and offers some nice desserts as well.", "author": "Zoe Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "I used Saffron 685 twice for two Happy Hour's I put on for my company. I ordered 2 Mediterranean trays and 1 order of chicken kebabs the morning of the event. It was important that we have healthy, vegetarian options.\n\nBoth times, the food was delivered early and the owner made sure to be in touch via text message which, as a busy coordinator, I greatly appreciated. Additionally, the food was exactly the portion-size he had described on the phone (30 ppl) and delicious to boot! I was impressed that the driver managed to keep all of the dips in place, during transit. Nice work!\n\nI will definitely be using them again.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "This place is amazing value. Seriously. The owner is the nicest guy and I always have great chats and service whenever I visit. The food is delicious and very healthy. And the cost is incredibly reasonable. I would regularly drop by on my way home from work and pick up dinner for my wife and I. Made to order. The salads and falafel are a must along with the carrot dip. Enjoy!", "author": "Tom H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "This place is one of Soma's hidden gems. I usually come in for their shawarma wraps and they are consistently delicious. The meat is really tender and flavorful and is extremely filling too. The ambiance is really cozy and feels completely disconnected and from the bustling streets outside. Solid lunch or dinner spot.", "author": "Eshan I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "This is the best middle eastern food in the city. Best kept secret even though it's really easy to get to and park. The Shwarma is delicious. Hummus is amazing. And whatever you order - get a side of mujadara - it's something I've never had anywhere else and can't get enough.", "author": "Candy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Great food, relaxed ambiance. Go-to place for lunch in the area, but also works for dinner. Usually quick service. Alternative seating options at the back (floor cushions!) are fun.", "author": "Maulik S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "The best thing about this place was that we walked in around 2:45pm, well after lunch hours, and the owner welcomed us in with open hours. We were practically the only ones in there. \nThe shawarma platter was phenomenal, and so were the dolmas.\nHummus was decent - I've had better, but the combo with everything else made the whole meal absolutely delicious", "author": "Nabeel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "I work across the street but I'd drive across town for their shawarma wrap. The service is always super friendly and the wrap never, ever disappoints.", "author": "Claire H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "I don't usually write reviews but I really think this place deserves one. I've been here twice and both times the food was delicious! I live nearby and have only discovered the place last week. The place is a hidden gem and the price is very good too. I got the lamb shawarma the first time and also had the beef kebab (both are amazing). The hummus had really good texture too... \n\nAnother thing I feel deserves mentioning is the design of the interior. It gives a really warm and welcoming feeling, the owner really did a good job with it.\n\nI really recommend it, especially if you love Mediterranean food like I do. I'll definitely be coming back!", "author": "Parmis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I love this Mediterranean place near my office. I always get the lamb kebab plate and the mint lemonade. The lamb is amazing, as are the humus, bread, and other sides. Some of the sides change from time to time and it's always great to get to try something I've never had before.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Great go-to in the neighborhood for gyros, falafels, and apps. It's not for everyone, but if you like beets, do try the walnut beetroot dip. I was turned on to this place by my parents, as they've been going at least once a week for 5+ years.", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "I've been coming to Saffron 685 for many years. My favorites are usually the Falafel sandwich or lamb shawarma. I enjoy coming back here because of the great food and the welcoming owner and staff. One of the best Mediterranean restaurants in SOMA!!", "author": "Roger M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-23", "description": "3.5 would be better for the value\n\na decent Mediterranean place in that weird SoMa neighborhood around 8th and Townsend. There's really nothing much in that area, probably because Zynga and Adobe are right there and they have free food for everyone :)\n\nbut I think this is a great value. the food is probably prepared in advance because it comes out immediately when you order. you order at the counter and they bring it to you. but wraps and hummus taste fresh and for around $10 you get plenty of food. we had some baba ganoush which was very good\n\nso if you're in this neighborhood, hungry and without access to the Zynga cafeteria, this is a good choice", "author": "Bob U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-03", "description": "The food was quite tasty but the portion size for the lamb was kind of sparse. Excellent falafel balls. Fast delivery time.\n\nWould consider ordering again.", "author": "Jordan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Wonderful food with warm ambiance! I always stop by here when i come by the area to eat and craving for something unique and different. I 100% recommend this place", "author": "Kevin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "This Mediterranean restaurant is one I visit at least once a week for lunch. A few of my favorites here are the falafel (appetizer or sandwich), fatoush salad, and the shawerma wrap. The best way I can describe the flavor of the food is that it is fresh, well seasoned, and you feel energized after your meal. This review is long overdue as I've been eating here for 3-4 years now! If you are craving a fresh healthy meal, or a restaurant to sit down and enjoy a laid back experience, give Saffron a visit!", "author": "Johnny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Come here for the delicious baba ghanoush and the pomegranate spritzer. Have eaten in and got take out. Nice staff, casual place. Love the food!", "author": "Alex B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Food was great l highly recommend the place, the have many vegetarian and vegan options, the dips and appetizers excel in this place and the love the fresh Juices. Highly on my list.", "author": "Prathueang S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Simple, clean, and comfortable. The food was good and without a long wait. The employee was very curteous and welcoming, answered our questions, and made the time spent there all the better.", "author": "Sobhana F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-08", "description": "I have been coming to this restaurant for almost a year; since my office moved across the street. I have had many of the items on the menu and I am never disappointed. I love the chicken Kebab plate, my ultimate favorite. The chicken is perfectly seasoned and the rice is grainy and fluffy. I usually get the bean salad with it. I find the combination of flavors light very pleasing. \n\n\nI come to Saffron twice a week, some times more. I can simply sit down in the cozy area near the back with all the couches and have a beer. In this place I  am known and the service I receive is like I was walking into my family member's own house. \n\nWhen I want to get away from my office for an hour I go to Saffron and enjoy the awesome tunes always playing. \n\nI highly recommend it for a group of people or by yourself.  This is truly Mediterranean cuisine at its best. \n\nLove it! See you there - K", "author": "Dila J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Excellent food and uncrowded. Every guest I've brought here has raved about it and wants to come back.  The dips are unique and fabulous, not found at other middle eastern places, and the Turkish, Syrian, and Lebanese deserts have many fans among my family members.  The homemade lemonade also got rave reviews among my husband and nieces.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Food was wonderful so was the service, with a smile, priced reasonable, highly on my list for Turkish food.", "author": "Jose D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Food always great the shawarma was divine, they make juice in the house, lemonade was my favorite, goes pretty well with most dishes, service was nice and with smile, l will be back when l'm in town. That's for sure.", "author": "Ahmed A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "The food was great, the lamb kebab plate was well tender and nicely maintained, have it with the fresh squeezed mint lemonade, a win win & prices pretty reasonable for San Francisco Bay Area", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "My goto place for office lunch. Love their shawarma plates - the gyro meat is just perfect. I've tried a lot of places here in San Francisco but this place always stands above the rest. The owner is also really nice and pleasant and always knows my order beforehand. Must try!!!", "author": "Mansi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "I don't usually write reviews but this time l will make an exception since the food at this place was wonderful, it is quality healthy food, we sat on the low table, Moroccan type low table in the back, delicious options and service was friendly. I will back.", "author": "Albina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Love their food. Great chicken kebab plate also amazing lentil plate. The portions are very good. Friendly staff and most importantly very clean. Great place would definitely recommend it !!!", "author": "Meray D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "This place has yummy Mediterranean food. A must try!!! The lamb kebab plate is to die for.", "author": "deepti g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Love this place.  Very authentic and delicious.  Get the shawarma, you won't regret it.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "My favorite casual go to dinner spot when I'm looking for something delicious and quick. I usually come after my evening workout and there's no wait and the food is served promptly. They've got fantastic Carrot Dip, Lamb Shawarma and handmade Turkish Delights to top the experience off! Love the local small business feel and seeing the owner who recognizes me each time too.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "By far my favorite Mediterranean in the city. You can taste the quality and can tell the difference since the owner/chef definitely has a lot of love and passion for making great food for customers. He's very gracious, and friendly too. It's worth the wait here, always.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "I love this place , My favorite food. Good price. Have delicious dessert. Very suitable for lunch here.", "author": "Rich H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "This place is a bit of a hidden gem. I went here to grab a quick bite to eat and it was delicious, well priced, and the owner has wonderful taste in music. I'll definitely be back!", "author": "Emm H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Wonderful food shawarma is high on my list tender and lean, prices pretty reasonable for San Francisco, they have fresh squeezed lemonade, very refreshing and they make pomegranate spritzer but my favorite the lemonade juice, if l could have a gallon l would not hesitate.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "I got the Mediterranean plate to go and it was incredibly tasty -- fresh and flavorful. I will definitely be back, as there were lots of things on the menu that were tempting.", "author": "Joelle J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Food always great with reasonable prices for San Francisco, we've been coming to this place for more than 12 years, it has been always consistent solid food, the kebabs plated and the apps are top on my list.", "author": "Victor V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "Stopped in for an impromptu lunch. Ordered the meze plate and lamb sandwich. the pomegranate roasted pepper Walnut dip was really yummy and interesting the baba ganoush and Falafel were good. The lamb sandwich really exceeded our expectations, better than Oren's! Oren's still has the best pita though. Recommend!", "author": "Peter B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Excellent falafel, baba ganoush and delicious fries with aioli. I came back a week later for more and I live in the East Bay! So happy to have a great falafel place in the area. The falafel balls were very fresh and tasty -as too few places have (I spent many years in NYC and love falafel). I'll be back again soon.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-19", "description": "I love the mix of \"salads\" they make. For $11 I eat a tasty good quality salad. My brother tried the shawarma -he didn't like it too much-, but seriously my plate was awesome! I came for 2nd time and still awesome. I dont know if they have it on the menu -they guy offered me this one-, but ask for it!\nIt basically has tabbouleh, fattoush, kind of mujadara (but good), and hummus.\nThe service was good, the place is ok.", "author": "Nermal B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Amazing!! I love coming here. As a vegetarian there are so many options - the benefit of a Mediterranean place. I love the ambiance and decor which make it feel cozy and beautiful. It's great for a quick bite however, as the food is always ready very quickly! The people who work there have always been pleasant and talked to me about the food and answered any questions I had about it!! If you are craving Mediterranean come here!! Very authentic and delicious.", "author": "August R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "I'm getting hungry just thinking about writing this. Why...? 1) Med is one of my favorite cuisines (if not the favorite). 2) Saffron is legit. 3) It's also super clean which I love and finding clean med food can be hard to find. Like everything in life, you get what you pay for. Higher quality naturally means higher price. The food is great and paying $20 for a solid meal is well worth it to me. Sure you can get greasy med for less other places... if that's what your looking for. I prefer amazing food I feel good eating. Speaking of, the roasted red pepper dip is fantastic. And that hot sauce... so good. I swing by here every chance I get and can't wait for the next time! Oh... don't forget about the dessert!!", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "I love this place. I live locally to this place, and it is a great stop for a casual meal, but with a very appealing ambience and decor. The cuisine is delicious- always fresh and consistent. The mediterranean diet is probably the healthiest cuisine you can eat, and while this is possibly underpriced for the quality...I'm not complaining!", "author": "Jackie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "The food & service at Saffron 685 is great. Both my husband & I have been coming here for years and love the food. We live in the neighborhood and come here for the tabouleh and kebabs. The food is always served hot and fresh- also very quick!", "author": "Marzi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "This my favorite place to go for a lunch! The food is  sooooo delicious, my absolutely favorite one is plate with beef or chicken. They marinated it and than grill it. I know the owner for a while, so I know where the food is coming from. The service is fast which is great for a short lunch time. Oh... and absolutely delicious desert i ever had - Konafa!!! the desert die for!", "author": "Dana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "I taste quality in the food. Wraps are a favorite. And konafa is an absolute favorite. Recommend dine in for the music and ambience that complement your taste buds. Personalized treatment from the hospitable staff.", "author": "Dhanush M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "Best chicken shawarma ever !! \nTasty food , prompt service and very nice people :)\nMust try the baklava for dessert !!", "author": "Rayen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Really amazing food and great service, highly reccommend the balsamic aioli and the lamb kebab plate, amazing platters!!", "author": "Liz A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-29", "description": "What a treat! I took a group for lunch here after a volunteer event and we had a blast. The food was very fresh, delicately spiced with generous servings, you could tell they use good ingredients, the menu suited a broad range of taste preferences, dietary styles. The service was quite quick. The wait staff were friendly and helpful - one of our group had a disability that needed special accommodation that was graciously taken care of without asking. There were cushy pillows on the end lining the wall, , music add to the ambience. We had such a good time that we sat and chatted after the meal without feeling hustled to leave. Definitely worthy of many repeat visits. My only regret was not sampling the desserts.", "author": "Roza S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "I've been eating lunch here for years and the food is consistently great. The lamb shwerma is amazing and the home-made sweets are dangerously good.", "author": "Danny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "Great for a quick grab on the go. Services fast and the wraps are good. Don't skip out on the baklava!", "author": "Trevor H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "I decided to write another review on Saffron 685. I've been eating here for 7+ years and I love it. They have an extensive menu, most of which I have tried. The food is always fresh and tasty! And it is inexpensive. A win, win, win!\n\nI've been for casual sit-down dinners in their cozy dining area or take-away falafel wraps...I recommend either :)", "author": "Rob F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-22", "description": "Complete miss. Chicken wrap was a poor imitation of a chicken shawarma. Drowning in hummus and some kind of bland sauce, the wrap disintegrated within moments. Full of grilled vegetables haphazardly stuffed into a thin piece of flatbread. \n\nOverpriced at $9.50 for all of six pieces of chicken in the wrap. Avoid.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "My first review, came here for a dinner last night with a couple of friends, server was nice and patient enough answering all question, food wise, a quality fresh ingredient food stands out when comparing to other Turkish Mediterranean eateries in San Francisco. The pomegranate spritzer made in the house and was wonderful.", "author": "Karyna D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Super rude guy behind the counter (the cook i believe), dumps our order at a distant table expecting us to go pick our food (WEIRD!). Pretty looking lady at the counter cannot understand what we want to order, everything had to be repeated like 5 times, and the rude cook guy is belching out some wise cracks from behind her.\n\nSuper expensive average food with limited portions and drab looking interiors, not worth the three and half stars. Will never make the mistake of going here again. (Is there an option for less than a single star?)", "author": "V M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "I've been to Saffron at least 4-5 times. The shawarma wrap is highly recommended: the tenderness of the meat is outstanding. Overall excellent place for casual dining.", "author": "Rob W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "We love this restaurant! The food is delicious and prepared quickly. The cook is wonderful and very accommodating. My daughter has several food allergies, so restaurants can be difficult, but at Saffron 685, we never have to worry. We eat in or get take-out regularly. You won't be disappointed.", "author": "Yuki I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "This review is long overdue -- just over 7 years late. Whoops! This is my go to spot for Mediterranean food, and boy, come to think of it, Saffron was the place where I started my addiction to the cuisine. I've had their falafel and chicken wraps, and falafel plate, and it is delicious and amazing. The falafel isn't too dry and salty in my mouth. The restaurant itself is very clean, and has a nice ambience. The owner/chef is very passionate with the food he makes and always make sure the plate he serves have a clean presentation, like going to a high end restaurant. Overall, I'd highly recommend Saffron with the high quality of their food and the clean spacious restaurant. Can't wait to go back and grab another wrap when I'm around the area!", "author": "Anna Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Wonderful dinner, service likewise, the server answered all our questions and recommended some of the dips which were great, the meat selections dishes were tender & nicely falaverod, highly on my list.", "author": "Hamidou D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "I had the beef wrap. It was very delicious. My friend had the chicken kabob which she said was tasty.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "I go to Saffron 685 just about every Friday Night or Saturday Evening, for dinner, after I go Grocery Shopping in the area.\n\nThe food is great, great prices, and Ziad always waits on me.\n\nThe man is amazing, he cooks, serves, and cleans, and still has time to be cordial.\n\nBecause it is late in the afternoon, he is always working alone, and keeps up with\nthe In-House Clientele, as well as the Phone Orders.. I don't know how he does it.\n\nI love Greek-Middle Eastern Food, and Saffron 685 is the best!\n\nJerry W.", "author": "Jerry W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-20", "description": "I was meaning to try this place as I live one block away. I tried it today. I bought a Shawerma Wrap to go for $10.85. The attendant took 1 or 2 minutes to have it ready. I thought \"that was quick\". Well it was quick because he did not even bother to heat it. As it was handed to me, it did not feel warm. When I got it home, I bit into it, the meat was cold and the bread was not even toasted. It was like biting into soggy bread. Gross. If this was the level of attention to detail at this restaurant, I will not be dining there. First time and last time.", "author": "Carlos E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-01", "description": "(Upped to 2 stars since he took the time and care to respond to my original review)\nThe food was good, but the 1 star rating is not a mistake. Having good food is not enough. You need customer service, and I mean average people skills here. I've seen better customer service at McDonald's at 3am than during prime lunch hours here.\n\nWe walked in, nobody welcomed us. We were sitting at the table for 5 minutes before we decided that we may have to order at the counter. The man (owner/manager) was rude anytime on multiple occasions, and there was simply no reason for it.\n\nA coworker of mine echoed the same sentiment about this place. He experienced rude service for no reason. \n\nVery off-putting. Maybe worth it for take-out only, but I even still I won't be back because I'm too proud/stubborn. There are enough of other places in this city, just go somewhere else.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-07", "description": "Worst customer service ever. Guy with the red hat is so rude! I will never eat here again. We ordered our food to dine in, they gave us a number for our table, but we still had to get up and pick up our plates from the counter. Why give us a number of the server doesn't bring us our food!?! Total assholes. Never again", "author": "Karen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Been going there for 6 years very regularly for lunch. Their falafel is nice and juicy, hummus is yummy and their kanafa is heavenly. Chicken kebabs are very good as well. All in all, a good, fast Mediterranean joint", "author": "Kelash K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "The food is fresh and delicious! We often order take out during the week and pick up - easy parking - on the way home up the (Potrero) Hill. The salmon is always delicious and cooked just right. All of the veg and grain sides and dips we've had have been super - tabouleh, hummus, carrot dip and spicy green pepper dip (our favorite!!). Healthy, fresh and made quickly to order. And the manager/chef is a delightful, welcoming guy. Happy to have this tasty and dependable \"go-to\" in our neighborhood.", "author": "Sydney P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Great spot for delicious, fresh, flavorful Mediterranean food. I've been coming here for years now and have found the food quality to be consistent and service friendly.\nI love the lamb and chicken kabob plates, and my husband likes the veggie mezze plate. And the baklava is so yummy!", "author": "Tracy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Excellent spot to come by for lunch, a favorite among my colleagues and myself. From people to food - this place is great; I've tried the shawarma wrap, beef kebab plate, humus - all are delicious and authentic, wish I had time to stop by more often. The chefs are expedient, the food is fresh, and the venue is not large - but super comfortable; can easily accommodate a group of 5 or 6, and has a generally pleasant, relaxing vibe. Great place to bring guests - it leaves a very nice impression. Looking forward to the next time I visit!", "author": "Tim U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "I've been coming to this establishment since moving to this neighborhood a few years ago.\n\nThe kebabs are tender and juicy and the different vegetarian dishes are excellent. The shawarma is my favorite.\n\nService is generally attentive and the atmosphere pleasant, prices are affordable and very reasonable for SOMA. Definitely one of my favorite  restaurants in the city.", "author": "Siddhaarth V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "I work in the area and as a vegan, my restaurant options are limited.  I love middle eastern food and I'm happy to have this option just 2 blocks away. They have a lot of options and have always been very accommodating.  It is also well priced.", "author": "Cordelia s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-27", "description": "UPDATE:  The crazy owner/manager offers me a free meal via nessage and when I ignore his offer, he accuses me of being a delivery person who is not allowed to use his restrooms!  LOL \n\nordered for pick up the other night and found the food to be decent, however the manager/owner working was just plain rude and cold blooded!  I came in to pick up my order and I politely asked if I could use the restroom (and this is after I had paid for my food)  I am told that the plumbing in the bathroom(s) is not working and he walks away.......I notice a man coming out from the back area OBVIOUSLY from the working bathroom.  SERIOUSLY?", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "My husband and I come here every couple of weeks. The lamb shawarma is amazing as is the salmon plate. The owner is super nice and attentive. A really nice place for a delicious meal!", "author": "Achal D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "I work around the corner.  Saffron is my go to lunch joint - a diamond in the rough in this part of town.  I recommend the Meza plate with baba ganoush, dolma, and bean salad.", "author": "Brice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-26", "description": "Solid food. The chicken kebabs were tender and there were 6 pieces of chicken. The tzatziki was fresh but the lavash was a bit dry every time I got it. Lamb was cooked well. The sides varied- the lamb came with the carrot dip and hummus and the chicken came with the bean salad and hummus.\nThe fries were my favorite part of the meal- they are freshly made like mom used to make- hand cut (all irregularly shaped), fried and have that greasy not so crispy texture you get when you make fries at home... And the aiolis are nice.", "author": "Piper W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Lovely delightful place, as l've been coming for years to this establishment, got to say it is quality quality quality food, always fresh and prices soooo reasonable for soma area in San Francisco, try the meza entree pretty delicious and you get to choose if any 3 appetizers.", "author": "Asso E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-14", "description": "Food is absolutely delicious! I had the chicken kebab plate which came with hummus pita and salad. Food is definitely 4 stars however price is pretty expensive I spent a little over $18 on lunch pretty pricey if you ask me and especially when there really wasn't a lot of chicken on the kebabs but taste was on point! \n\nThe reason I am only giving 3 stars is because the place was pretty dead and it was awkward to order no one really greeted me I kinda shuffled around the counter finally asking to order something then I sat down at a table and waited for my food. The guy wasn't rude or anything but not very friendly either I honestly felt so awkward sitting there eating by myself and was wishing I took the food to go.", "author": "Sabrina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "We had the chicken plate and the beef steak, the baklavas are made in the house Both were good, all in all food was fantastic so was the service. Highly recommended", "author": "Mohammed A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-23", "description": "Food is delicious, but bring your own hot sauce! They don't keep any on hand and look at you like you're crazy when you ask for some.", "author": "Scot H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Been meaning to write a review for a while, but kept forgetting to do so.\n\nClose to work, great place to go to for lunch or dinner for Mediterranean;  I especially like the Fire Spicy Green Pepper Dip / Pita, and the Lamb Kebab Plate.  I also like the Moroccan Hot Mint Tea.\n\nIt's nice to be able to make a meal out of just appetizers or go whole sheep when you're hungry  (^_^).\n\nStaff and owner are always friendly, so it's always a nice stop!", "author": "ninpou k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "I have been to Saffron Restaurant many times. Every time I go, I try a different dish and they all are delicious and authentic. Prawn kebab my favorite, it is unique and spectacular.\nThe staff are very welcoming and warm. Great atmosphere. Quaint and cozy. Great food, great place, :)", "author": "Jayr R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "This is my favorite place in the city for Mediterranean food. My wife and I have been coming here for the last five years and we love it the food is excellent it's fresh and innovative. We just had saffron 685 cater a party for us and all of my guests were wowed by the food. \n\nMy personal favorites are the lamb kebab plate and french fries with a lemon Saffron Aoli!! The hummus is excellent and all of the dips are also very very tasty. I love bringing my veggie/vegan friends because the falafel is always a big hit. This place is a gem!! Thank you saffron 685!!!!!", "author": "Sampeter O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "I always get the mediterranean plate and it's very tasty. It's very close to my work so I usually order pick up. The employees are always nice and they prepare the food quickly.", "author": "Natalie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-26", "description": "Pros:  family owned\nCons: tiny portions, slow\n\nWith just a bit of focus on speeding things up at the register and adding value, would have been great.", "author": "Henry B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-19", "description": "Meh. Some friends and I ended up here on a Saturday night to celebrate a birthday .. not clear why we chose the place but whatever we were there and we were literally the only people there that night. Which is not surprising given that it's a Saturday and no one is working in SOMA that day--funny story when we left, we learned from our Uber driver that this was the only area without any surge pricing. anyways.. I digress\n\nThe service here was pretty subpar. We were a party of 10+ so perhaps we were too hectic or something to deal with? It took forever for someone to take our order and then only mid meal did they decide to offer us any water... and that entire process was such a fiasco. I guess to be fair there were only 2-3 employees there that night ... and 2-3 tables filled ... but okay whatever. Like I said it was a very mediocre experience.  \n\nFood itself was decent but nothing amazing. We got the hummus plates, lamb skewers, chicken skewers... jesus we ordered a million things but the fact that I can barely remember what I was eating is a testament to how mediocre I found the experience to be. I could see how this place might be better for a quick grab and go lunch kind of affair but if you try to sit down and have a relatively nicer dinner, it definitely backfires very quickly\n\ntldr; the food is a solid 3, the service is pretty bad though if you try to dine-in....price though is the bomb dot com lol literally spent $11/person even though we ordered 10 or so plates which was ridiculous", "author": "Jasmine X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "I used to live above this place 8 years ago. And ever since I left I've craved its delicious food.\nThankfully, I was able to visit a few weeks ago and I can happily report that it remains of the same excellent quality as always.\n\nBack then, as a newcomer to San Francisco, it was an amazing introduction to Mediterranean food and through the months I eagerly unraveled the flavors of all the delicious dishes that Ziad's cooking presented: hummus, tabbouleh, soft yet crunchy falafels all in perfect harmony contrasting and complimenting what became my favorite dish at this place: the shawarma plate.\n\nTime went by and I moved away to the other side of the world to another foodie city (Sydney) and since then I've had the chance to try lots and lots of different foods, from the fancy to the street, and many mediterranean places which abound over here, but that perfect balance of flavors I've only been able to find at this little establishment on Townsend St.\n\nWhen you visit don't forget to round up the meal with a Baklava.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "The food was excellent, fresh, and the customer service was amazing. I highly recommend this authentic Turkish restaurant that is in the SOMA district of San Francisco. Their prices are also reasonable. I am definitely going back", "author": "Alice D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Saffron 685 is not only great for every day eats, it's a fantastic source for catering for clients. Their Mediterranean platter is the biggest hit at everyone of my events. The staff is helpful and always makes sure everything is fresh, delicious and perfectly presented. They definitely have a loyal customer!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-15", "description": "This restaurant is near my work, so it's a convenient place to go to for lunch. It's a small-ish place with a cozy Mediterranean environment. I've been here a few times already, and the food is good, albeit perhaps a bit pricey for what you get. I'm a fan of the shawarma plate since you basically get a taste of everything. On a cold day, the spicy hot chocolate is a nice way to finish off :) The service is friendly sometimes, but inconsistent. Also, it's probably not a place to go for a quick lunch - but definitely a nice environment if you have the time to stay and chill for a while.", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "Best Lamb Shwarma in San Francisco!  I've been getting takeout from here twice a month for the past 4 years.  It's my favorite Lamb Shwarma in the city, and my wife swears by their Lamba Kebabs.  It puzzles me as to why the restaurant isn't packed with a line out the door every evening.", "author": "Vijay P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-04", "description": "If you enjoy eating human excrement, by all means order from this fine, clean and gracious establishment.", "author": "Andrew J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "I love their Shawerma Wrap and Moroccan Carrot Dip.  I've been coming here almost weekly for a few years and have never been disappointed.", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "Excellent food and even better service!  Would highly recommend to anyone that wants fresh authentic Mediterranean cuisine.", "author": "Jennel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Best Mediterranean food in San Francisco. Dishes are fresh and the hummus is incredible!  This is your place for your favorite Shawerma plate or wrap.  Baklava is quite a tasty way to finish.  If you are at airbnb or zynga you have got to check this place out for lunch or dinner...right around the corner! Great music and perfect lighting.", "author": "Ann F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "food was good l recommend you order difffernt appetizers, tapas type so you get the chance to try differnt dips, don't miss on the organic carrot dip & the organic beets, both are good, prices are resonable for san francisco, highly recomended.", "author": "Jonnathan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-22", "description": "I ordered a chicken shawarma wrap here and it was mostly potato :/ not sure I've even ever heard of potato in a shawarma anyway but it certainly should be less than the amount of chicken.  They also charge extra for hot sauce....feels like they are just nickel and dimming. Sub par :/", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "One of the worst dishes I ever had. I ordered a Hummus plate and even if I would've tried, it wouldn't have come out as bad as I got it. The texture was horrible, no tahini was added and if I was blind folded I would never know it was Hummus.\nTL;DR - Disappointment.", "author": "Roi A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-27", "description": "The customer service is really bad!!! The guy who took my order at the counter here doesn't know how to talk to the customer! Also the food wasn't good. I ordered shawarma salad and the lamb was super salty. Will never be coming back here.", "author": "Supriya G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "I love coming here on my lunch. This is the best restaurant in the area. You can tell that the chef put a lot of effort in the quality of his work. Not only that the food is delicious, this restaurant has great ambience and is very well maintained. I can easily rate this restaurant as the best Mediterranean restaurant in town. If you want to try Mediterranean food for the first time, you won't be disappointed at saffron 685.", "author": "Issam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "I have been coming to Saffron 685 for many years, since i've worked in the area, on and off.  I enjoy Mediterranean food and this place hits a sweet spot for me with their wraps, kebobs, hummus and the delicious pita bread. \n\nI also enjoy the Mint Lemonade very much. \n\nThe staff is casual, friendly and always helpful.   \n\nI highly recommend Saffron 685 as a fun lunch spot or a relaxing dinner spot.", "author": "Quynh N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "Worst experience ever. The food quality and guys attitude was so bad that it ruined my whole weekend. The owner/server first wanted us to sit on the corner table right next to the door coz we had a kid with us. Then, we felt like he wanted us to leave asap so he served us partially cooked gyro and kababs. Even the fries were not fully cooked. They tasted really bad. He didn't even bother to serve us water.\n\nAnother family with two kids showed up when we were there and the server asked them to sit again on a corner table near the door. The politely asked the owner if they could sit on some other table but his reply was that you can only sit on this table as you have kids and rest of restaurant isn't kids friendly. There were around 15 open tables at that time and we were the only one eating there.\n\nI'm extremely surprised with the other reviewers giving it 5 stars as that encourage us to go there in the first place. I wonder if these are his friends. Extremely rude guy and pathetic food. I'd never go there again.", "author": "Arif I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-17", "description": "Just came in already dissatisfied with the customer service.  Hope, lamb kebab going to be good, if not I will be very mad too since I been fasting all day. I am not looking for the best service but at least be kind to who ever walks in to your restaurant's doors. Definetaly not going to come back regardless of how good the food will be.", "author": "Fin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "the pomgranete peper dip really good my favorite, also tge green fire spicy dip is nice, lomonade fresh sqeezed juice refreshing, all in all l love this placd . konafa dessert with honey and orange blossom riccotta mozarella. was great too.", "author": "Jabrane B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "GREAT FLAVORFUL AFFORDABLE FOOD. Quick service, great vibe, uniquely delicious food. Come here!", "author": "Cassie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Great place for casual Mediterranean food. Do not miss out on the delicious mint lemonade. A truly unique flavor.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "It's one of my favorites spots in the city for Turkish cuisine. I've been going here for many years and the food and service is consistently great. They have a great menu and some of my favorite dishes includes the shawarma wrap, the kebab plate and the falafel plate.  I would recommend this place to anyone.", "author": "Conetha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-17", "description": "I've been coming to this Turkish establishment for almost 10 years, I will rate it 5 starts mostly for the food. The Wild caught grilled Salmon done to perfection and was oh so fresh! I would recommend it to any seafood fan out there! My husband had the rotisserie lamb steak and  admitted it to be the best he has ever had. We ended up dinner with hot Turkish tea with Cardamom, service was friendly & fast.", "author": "Lana A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Definitely one of the better Mediterranean food places in SoMa/FiDi. Their shawerma wrap is absolutely delicious!", "author": "Anu R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "I work near by and love to grab a healthy, delicious lunch here! My go-to's are the fattoush salad, lentil soup and/or the falafel plate. Kind service, good atmosphere. They have happy hour too, which is a plus for us that work in the area!", "author": "Madeleine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-24", "description": "Was excited for a lamb shawarma to go. Just after paying, I saw the female cashier touch some other customer's food (pita bread) without washing her hands. Being in the restaurant business, I am concerned when I see this, and it calls into question what other responsible food practices aren't being followed. When I received the shawarma I was not that happy with its consistency. More importantly, after a few bites, I realized the meat was not hot, with some of it only at room temperature. Having had food poisoning from a shawarma before (actually I hadn't had one since that episode many years ago), I couldn't ignore what I consider a huge red flag. I decided it wasn't worth the risk & threw it out. Needless to say I won't be going back.", "author": "Paul R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-02", "description": "Was looking for alternatives to the company cafeteria and tried Saffron 685 down the street. Cool decor with some low tables & pillows along with more standard seating. Mediterranean menu with prices from $7 (falafel wrap) to $16.50 (salmon plate) for the main dishes. I went with my typical Lamb shawerma ($8.25) and side of falafel ($2.75)\n\nFalafel was greasy. Sprinkle of sumac onions & parsley and container of tahini + chopped tomato & cucumber (http://www.yelp.com/biz_photos/TcUhtqRLL-lwSGJmpz415Q?select=FyKTQ3l1at4mzyJjRPaQxw#FyKTQ3l1at4mzyJjRPaQxw). Lots of sesame seeds dominated the flavor. Would have preferred straight tahini to dip into; the mix with chopped veggies made it awkward to eat.\n\nOn to the lamb shawerma wrap. I saw the vertical rotisserie had ground meat in a pre-formed cone vs. fresh layers of thin strips of meat. Fries, tomato, cucumber, tahini, and nice housemade hot sauce (http://www.yelp.com/biz_photos/TcUhtqRLL-lwSGJmpz415Q?select=0ZGio01O5PVE8uwocuz4QQ#0ZGio01O5PVE8uwocuz4QQ). Decent flavors, but poorly constructed and was falling apart almost immediately so I needed to proceed with a plate, knife & fork.\n\nFalafel: 2.5 stars\nLamb Shawerma wrap: 3.5 stars", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "This new review is not for the food but for the people at Saffron. The manager Ziad contacted me after my review to apologize and offer another meal or a reimbursement. I will not take it but appreciate the gesture and I believe that good service matters.", "author": "Coralie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "Just Love this Place .. Amazing \nBeing working in the neighborhood for years this will be my place when it comes to vegetarian foods, the lentil cracked wheat & tabouleh will be my first choices, tabouleh as some reviews said here is one of the best you could get. Dips(carrot dip, beetroot) are also awesome\nWaitstaff always friendly and welcoming.", "author": "Sonam J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Probably one of the best Mediterranean Turkish food you can get in San Francisco, simple food with unique spin.\n\nBeing regular I have tried each item on their menu and literally there isn't a single one to avoid! Strongly recommended!", "author": "sean h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "I order from Saffron 685 at least once a week!  Love the salmon filet plate and chicken kebab plate.  Bean salad and hummus = delicious!! \n\nGreat \"to-go\" presentation.\n\nThe staff is the best, always helpful, energetic and kind!!", "author": "Amanda G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "I ordered a salad for lunch. It came out in a small bowl with no dressing on it. I asked for some sauce and they guy asked me for $1. He then lifts up the bowl and says dressing is in the bottom (there is none). Very rude and bad customer service. I do not recommend.", "author": "MisterSF N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "I love Saffron 685! They are literally my \"go-to\" lunch spot for my Execs. I feel like I use them so much that I play it out but low and behold my guys never get tired of it - it's always a treat for the team when I order from them! \n\nI usually order the Salmon plate or the chicken plate. Both are awesome, salmon is more healthy since it's over salad vs. rice. \n\nThey're also really nice and super accommodating and fast. We sometime order 15 lunches (day-of) and they are on it! Clearly... you know I'm going back! :)", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "Food was OK. But Im going back and buying a ton of their sesame cookies for home. Just delicious!", "author": "Ashutosh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Quality and Qty are great. Spices and seasonings are in point. Service was at first shaky but overall good. Lamb plate was awesome and shawarma wrap was very tasty; nice bite of potato. Overall, we really did like this place and will come back again.", "author": "megan a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-13", "description": "I cannot believe this person is the owner this is what he comments \n\nThis lady came asking for a change on a Saturday afternoon the server said sorry we don't have change, the next day or two we got this review. \n\nthis is the most disgusting comment I have ever read. I came in after my mani/pedi almost dark outside... hungry...and no I never needed change...your food was disgusting...sorry you can't handle a real review", "author": "Dee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "The place looks empty with uncomfortable seats as you walk past, although it opens up inside, with leather sofas and a much nicer decor inside.  The food was excellent, I had the falafel appetizer and beef kebab plate. The falafel was both crispy and flavorsome.  The beef was excellent with a nice charred finish and lovely taste. My friend had the lamb kebab plate, which he was extremely pleased with, except for one piece of lamb that was mostly gristle - hence 4 stars instead of 5.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-18", "description": "I tried to give this place a second chance because it's so close to my work and other yelp reviews seem to only rave, but it is beyond mediocre and ridiculously overpriced for the quality.\n\nIn full honesty, I've only ordered pick up for lunch, so it might be better dining in or at dinner, but the two times I've done it, food was cold and not that appetizing, service was lackluster, and the price was astronomical. You do get a lot of food, but $16 for a schawerma plate that tastes worse than what I get from a street cart is just ridiculous. The most recent time, they forgot part of my order and they weren't apologetic when I called and accused me of never ordering the missing items. Since I was ordering for a staff lunch, it was very embarrassing that they couldn't get my order right and that the restaurant tried to blame me for the snafu. Would not suggest for work events as their food apparently cools instantly and they are not willing to assist you when they get your order wrong. EDIT! Management was very upset that I said the food was cold. So let me rephrase, I guess it is served piping hot and then cools within the 10 minutes it takes me to get back to the office. Food cools very quickly :)\n\nIn terms of food, the only thing I liked here were the fries and baklava and everything else was below average. (They change up the sides a lot which means it's a crap-shoot if you'll get something you like or not). EDIT!: While they do switch up the sides, apparently you can request different salad sides to your plate. \n\nEDIT! Due to the cattiness of the management, I will not be back, especially because I am apparently banned from them now for being unhappy LOL. But I'm sure if you don't cross them or if you don't care about service, you'll have an ok time here. God forbid if they forget something in your order and you complain about that though, because that apparently was all my fault and I am not welcome there anymore. Good thing I didn't want to come back :)", "author": "Christina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Great place and excellent food. Eat here all the time. The steak kabab with hummus and fattoush is the move. A hidden gem IMO.", "author": "Mickey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Went in for lunch with a friend and ordered the Falafel Wrap and the Lamb Kakob Plate.We shared and both were Delicious. The gentleman who took our order was the owner and steered us in the right direction. He was very informative, very nice and made us feel welcome. Highly recommend!!", "author": "Winona M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "I LOVE this place. The lamb shawarma salad is my favorite thing on the menu, but all the meat is really exceptional. They also have some amazing dips - spicy green pepper is my favorite, but you really can't go wrong with the appetizer option that includes 3 different dips/apps. Really adorable environment as well - cute and quiet enough to hear each other talk.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "great and easy for work lunch, staff has always been cool with me and accommodating. Showed up with a large group and they took it like champs. Plus the menu is reasonably priced. Get the swarma wrap .", "author": "Samir A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-19", "description": "Food was OK but pricy.  Falafel was bit dry.  Ambiance was nice. The owner was quite brusk, bordering on rude.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "Great food, really friendly management, and a cozy atmosphere to kick back on a couch and enjoy your lunch break / any meal. I work across the street and come here every week - the falafel and other wraps are delicious, and the portions are generous. I highly recommend ordering a side of the Tahina paste with literally any meal, it's a top notch dipping sauce for all you sauce-aholics!", "author": "James P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Always fresh l love the mint lemonade, it compliments many of the entrées, the beef steak is lovely, l mean you could get beef steak anywhere but the spices & the marinade they use gives it special taste, they have many dips & side dishes to choose from, the organic walnut beets tops them.", "author": "Kino A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "I love this place. The staff are always very nice and pleasant. Once you come here couple times the owner will actually remember what you usually like which makes it a very personable experience. \nSome of the dishes I love and why:\n\n1.Chicken kebabs plate: They always cooked just right \n2. Their home cut fries are extremely yummy and always served fresh. Also comes with their tomato creamy house sauce.\n3. Lentil soup: very light and perfectly spiced\n4. Mediterranean plate: If you like dips, falafel and grape leaves this is the perfect combo (great to share an app between 2 people)\n5. And last but not least is their housemade dessert \"Kenafa\" ask the owner when they will have fresh in the week because it's not always available but so worht going there for.\n\nAnd finally what I also love about Saffron it's quiet atmosphere in the afternoon. Very peaceful and you can get wifi from starbucks next door and do some work and browse the net for whatever you need while enjoying comfy seats and Zen atmosphere. It helps as well that they always play great chill music :)\nI highly recommend going here.", "author": "Wydad M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-16", "description": "I wish this place was good, I really do! I live in the apts above this spot and pass by all the time, so I finally decided to stop in last week to have lunch here with my half asleep toddler. After about 3 min of standing at the counter awkwardly and being the only soul in the place, I see the owner guy look at me but kept doing whatever he was doing in the back. I finally just left. Funny enough I always see him walking on the sidewalk to get his mail that's why I wanted to give him some business... \n\nThe 2 stars come from the shawarma plate I shared with a friend 2 years ago while pregnant, but the service was horrible then... I didn't care I just wanted to eat whatever was in front of me and take a nap.", "author": "Alisha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "Two of us had dinner there and found it extremely worth while. All of the dishes were well prepared. We would particularly recommend the antipasti platter which had a huge variety of excellent flavors and tid bits that all seemed to mesh very well. The waitstaff service was good and prices for what we got were good value. All in all highly recommended.", "author": "Elena K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "This is my new favorite lunch spot. It's really close to my office and the food is amazing. As an added bonus they have 100 on their health report!\n\nMy favorite menu item is their fries served with saffron meyer lemon aioli. The fried are cut huge, fried fresh, and sprinkled with paprika. The aioli is out of this world delicious.\n \nI have also had the vegetable lavash sandwich, the roasted veggie salad, and the meza plate with falafel, tabbouleh, and babganoush. \n\nEverything that I have tried has been great!", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "Love the Kebab plates and the wraps. The best tabbouleh salad and hummus I've ever had.", "author": "Deborah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "Always great! Always a must for us when on this side of town. Everything tastes amazing, always fresh and the owner knows what he is dong and does it well!!!", "author": "Carlo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "We're regulars here at Saffron 685 and come for lunch or dinner. It's also safe to say we've had everything on the menu. Nothing disappoints. It's all super fresh.\nThe lentil soup is excellent, beef steak is favorable & succulent, konafa dessert from heaven, honestly, it's all really good.", "author": "Ana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-28", "description": "We were looking for a place on Townsend and Saffron was open on a Saturday so it fit our needs. Most places are not open in the area for lunch on A Saturday.  There are more people there at night and during the week.\n\nThe people were very nice and the service was excellent.  The place is painted with bright colored to denote the saffron color.\n\nIt's a casual looking place with cozier seating in the back.  It's clan and the food is very good.   I ordered my favorite dishes, the baba ganoush and the lamb over salad.  Everything is fresh and crisp.  I will go there again. \n\nI actually didn't look at all of the pictures in advance.", "author": "Christine U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "I always get a shawarma wrap and it's my favorite in SF. Been going here for over 2 years and they make it just right and the wrap is pretty big too.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-16", "description": "The food was so so.\nThere was something that happened with the bill that was kind of questionable. \nBut it was after I received my credit card statement that I saw it.\nAnd reading other reviews for this restaurant, it seems that it is normal for them to add charges or raise the bill a bit. \n\nI would just be careful when going here and check the bill and make sure that they are charging the correct amount.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "The wraps are huge here!! I had a falafel wrap and my bf had the shawarma wrap, and I thought both were pretty good. I really liked how the falafel wrap had fresh veggies and fried eggplant, as well as how the shawarma wrap was super flavorful. Truly Mediterranean is better, but I would definitely come back whenever I'm in Soma.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-01", "description": "This place is awful. First of all, their food is overpriced and mediocre. A lamb wrap better have more than three pieces of lamb in it. \n\nSecond of all, service is awful and ridiculously slow. It took a good 20 minutes of awkwardly waiting in silence to receive my to go order in an empty restaurant. No reassurance that my food would be right out or anything like that. \n\nLastly, I got my food to go and did not tip on a $10 order including tax. So what the hell is extra dollar doing on my posted credit card charges, Saffron? I monitor my expenses like a hawk. Why the hell do you think you can add an extra dollar for a tip when you didn't deserve it? Disputing that crap right now, and I am not returning to your god awful restaurant.", "author": "Paulina D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "We arrived at 7 PM. Man at the counter just stared at his phone, did not acknowledge us until we said hello. We asked if they were open and he hesitated like we were a bother and said just for a half hour more. Yelp says they're open until 9 PM. Then he asked are you eating in or out, and we said in, and he reluctantly nodded his head. Finally we decided to leave saying to him \"well, we won't bother you.\"  Let's all choose \"not to bother him\" as that's a strange way to run a customer service business.", "author": "Q E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "It was nice in the inside, but my chicken kebab plate to go ended up being a veggie/prawn plate for some reason and I don't like veggies :/. So I didn't enjoy, and I paid a lot of money for something I really, really don't like. I didn't notice until I was back at my hotel.", "author": "Zahara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-11", "description": "I remember this place back when it was called some other name, but that was well before Yelp even existed. \n\nAnyway, this is a fantastic place to come to for dinner with a large group. Since this place is located in a business district that means it is practically deserted at night. I've run into many problems with groups of 6+ in the city many times and it's nice to find little gems like this one.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-05", "description": "Never going back.  We ordered food to go for our little afternoon lunch expecting a good meal but what we ended up with was a cold and tasteless  meal!  The pita was rubbery and stale.  I called the restaurant to complain and was told that I did not know good food when I got it!  Really?   Then hung up on!  Never again.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-17", "description": "I've been coming here for about 4 yrs. Definitely the best food in the area and a nice quiet relaxing place for lunch or dinner.", "author": "Jonathan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "Good food and good service. I highly recommend when you are in the area to drop. I highly recommend the seafood and can't beat their hummus.", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "I come here for lunch a lot. I like the platter that allows you to mix and match 3 dishes.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-09", "description": "reading some of these review, I must have been there on a bad day.\n\nThe food (shawarma plate) was terrible.  Other than the fact they were using the WRONG meat, the over all quality of the seasoning and presentation were totally off.\n\nIt was priced reasonability and the place itself is big and nicely setup, but that doesn't make for the bad food experience.\n\nThere are many different food options near the Design District.  I will try my luck at a mediterranean food elsewhere", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Second time we've come here (we'd be frequent visitors if we lived closer, because we love the food).  They actually had closed, but stayed open to prepare our meals!  What great service!", "author": "Kunal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "This place has legit mom and pop style Turkish food. Having lived in NY and Michigan, I have gotten accustomed to always having accessible authentic middle eastern food. This place is my fav middle eastern place in SF so far. \nThe fattush is light but well seasoned. Their falafel was flavorful but not over-fried. Tabbouleh was very fresh and just divine. My bf loves their lamb shawarma, which is crispy but tender and juicy at the same time. \nIf you want good Turkish food, this is it!", "author": "Nancy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-05", "description": "I discover this place when i moved in the apartments above it, and since then I've been here quite often. Every time I've been here the food has been great and fresh, it does take a bit of time to get it as this place has a small crew. But the food is worth the wait, their tabbouleh is really good and chunky, you can taste the ingredients. Their wraps do taste different from others out there and I think it's because they have potatoes in them, which adds a nice texture to the whole thing. They're still great and big enough to fill you up. Ask for their mint lemonade to wash it down. Their party plates are great for parties, I've used them in my last three and my guests are always asking where I got the awesome food. \nI give them four stars because, though they're pretty good, to me the best falafel and shawarma place still is Mammouns in the West Village in NYC.", "author": "Willy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "I crave their tabbouleh!!!!\n\nInitially I started coming here because they were convenient to my office, however after moving down to Los Angeles and only coming back up every couple weeks I find myself seriously missing this place.  While there are a lot of good places in LA, nothing compares to the fresh, bright and well balanced fattoush of this place.\n\nThey also have things that you don't see at the big chain places such as za'atar (an awesome spice which is delicious and should be adopted by more Americans immediately).\n\nI typically take my food to go, settle in at my desk and allow the creaminess of the hummus to take away some of the stress caused by piling up emails.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Very good food!!! I had the veggie wrap and my husband had the lamb kebab plate. We shared the french fries. I agree with the other reviews regarding service. The employees are not rude but not friendly. The man at the counter was wearing a hat and looked down most of the time. Not much eye contact and no smiles. Restaurant is a little pricey for lunch but the food was worth it. We would eat there again.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "UPDATE:  Its still my go to for great Mediterranean food.  The service is excellent, and the food is consistently great.  Try the wraps for lunch and the kebab plates are damn good for lunch.", "author": "Bobby James G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "I work by the area and there are many places to go for lunch but Saffron is my favorite place because the food is fresh, healthy, and quick. Also the people are friendly and accommodating to my food requests. My favorite is their Meza plate because you can get 3 different appetizers of your choice and their shawarma low carb plate. Hummus tastes fresh and their falafels are crispy on the outside and moist in the inside. 5 stars are well deserved!", "author": "Chevonne R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I've been a client of this restaurant for over three year now. Every meal is just delicious, with great mediterranean flavors and combinations. The customer service is outstanding and they always do their best to accommodate client's requests. I strongly recommend Saffron. You will be delighterd.", "author": "Maria A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-25", "description": "Extremely terrible attitude, waiting for seating for like ten minute, and the owner or waiter is just chatting and refuse to answer us. After we seated, wait for another ten minutes to order drinks.", "author": "Kangyi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "I've been going to Saffron 685 for several years now, and it's my favorite Med food restaurant in San Francisco. The food is fresh, and well prepared, and the staff is friendly as well. \n\nThe falafel is particularly flavorful and is my favorite, and the chicken kebabs are always cooked the right amount. We often have Saffron cater for parties, and my guests generally want to know who they are so they can start going. Only downside: I can't wean my kids from the Turkish delight, which is great.\n\nI highly recommend giving Saffron a try. You won't regret it.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "I eat here often and the wraps are great. The wraps come out hot, the meat is perfectly cooked and the hummus is delicious. The owner is very friendly and makes my orders just how I like them. Try it out.", "author": "Sherry J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "The veggie kabob plate keeps me coming back. Something about the way the vegetables are marinated before they're grilled- just delicious. The hummus is always fluffy and fresh and I enjoy my meal surrounded by a clean, modern, internationally inspired decor.  The owner keeps attention to detail and it shows.  Love this place and even though I live across town in the Inner Sunset, it's always on the list as one of my tasty standbys.", "author": "Allison G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-29", "description": "Living in San Francisco, I hardly ever feel compelled to write a bad review.  This review is for the service...wow does it suck. \n\nI ordered the chicken kebob salad.  When I ordered I asked the woman at the register if I could have extra dressing, she said no problem.  I paid and left a tip....20ish mins later my salad was ready.  There was no extra dressing so I asked the man who made the salad if I could have extra...he looked very confused and somewhat angry.  He enlisted the help of the other guy behind the counter who also looked confused.  Finally one of them started to fill the container with dressing.  The guy was struggling and the dressing was coming out super slow so I told him that would be okay.  He hands the quarter filled dressing to the other man who proceeds to tell me that would be 55 cents.  55 cents for a tablespoon of dressing?!? At this point I should have told him to take it from the tip that I had already given them but I was so shocked I paid for the dressing. \n\nI don't think I'll be going back.  The food is not worth the rude service.", "author": "Jenna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "I've lived upstairs for 4 months and did not try this spot because of the low yelp rating.  But the cold weather, rain combined with a long day and craving for Mediterranean food made me cave and order take out.  I had the lamb shawarma wrap. It was delicious.  So delicious that I had to write this review immediately. The ingredients were fresh and the flavors were perfect.  And the prices are relatively cheap. (Relative because it's soma) I am a little peeved that it took me so long to give this place a chance.  Please don't make my mistake.", "author": "Ellie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-30", "description": "Tasty, but overpriced, Mediterranean food. \n\nDespite its limited menu, Saffron 685 is OK for a quick lunch, if you are in the neighborhood and not averse to paying higher than usual prices, but it is definitely not worth a special trip.  There is no imagination here.  Selections include the standard Mediterranean fare: schwarma, falafel, and lamb, beef, chicken wraps or plates. \n\nWhile wraps are not egregiously priced ($9), the $3.50 tariff to upgrade to a plate, which entails the addition of a modicum of salad, some rice, and a dollop of humus, is outrageous. A quick lunch of a chicken kebab plate and a Diet Coke should not cost $15.35.\n\nIf you're in the neighborhood and need a falafel fix, Saffron 685 will do, but may damage your lunch budget in the process.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-10", "description": "Fresh and delicious! I mostly go there for lunch breaks and the menu has never disappointed me! I love the falafel plate and all the appetizers. The prices are very reasonable as well. The owner is very friendly which makes your stop even nicer. I highly recommend this place.", "author": "Hany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "I have to update this review as l tried this place again, l have friends dinner on s Saturday night,  love the ambiance, the food prepared & presented nicely. Try the grilled wild salmon & beet wslnut dip.", "author": "Jorge B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "The food here is great. My favorite is the lamb plate with the tender meat. Their mint lemonade is very refreshing and complements all the dishes. The falafel and tabula salad are some of the best I have had anywhere. The service  is always  friendly and knowledgeable.", "author": "Miguel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-25", "description": "This place is my favorite spot in the city! My husband and I love Saffron, there are so many exquisite flavors and everying on the menu is delicious.  it's apparent that the restaurant is passionate about real mederterranian flavor.  \n\nI have to say  I was actually quite taken aback when I read some of the other reviews of this place, saying the service staff was rude. I have never had that experience.  \n\nFrom the taste of the food to the presentation, we really could not ask for more.  And the best thing is it's all understated....casual elegance. We've gotten to know the owner, he is wonderful and  passionate about his trait. We dine and or take out and I have to say it's the most reasonably priced place i've found. The lamb kebab plate and french fries with the balsamic aoli are simply heaven.  They also have amazing tabouleh, hummus, mint teas, baklava, and latkes. I could go on and on..check it out you won't be dissappointed.", "author": "Gulnar O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-28", "description": "Very rude owner/manager, who has been disrespectful to me personally on several occasions. Despite living less than a block away for six years, I will pay extra fees to order delivery from other Mediterranean restaurants because I choose to support businesses that have good customer service. I really wanted to give the proprietor the benefit of the doubt, and not write a review, however after reading his caustic remarks to other Yelp reviews, I felt the need to chime in. Yelp exists so that we can share this message with the owner: adjust your attitude dude, and you'll see a significant increase in clientele.", "author": "Drew V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-11", "description": "I only get the falafel plate and it's pretty damn good. \n\nFor some reason, this place reminds me of the @RealSoupNazi", "author": "Bee D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-12", "description": "The service at Saffron 685 is extremely poor.\n\nI came in at around 7:30pm and placed my order.  No sooner than I'd made myself comfortable at a table, I was told that they were closing and my order had to be to-go.\n\nI said no thanks and began to gather my belongings.  At which point the cashier gave an exasperated sigh and informed me that he already made my food.  He placed my plate on the table without a word.\n\nI was treated like an inconvenience, so I won't trouble them by coming back.", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "I've been going to Saffron for years now. I work down the block and it's become my go to place for a quick, take out meal I can bring back to my desk that tastes great and won't hurt my arteries or wallet.\n\nI'm a huge fan of Mediterranean food and have become quite picky about it, but Saffron's food has exactly the flavor I've come to love about it. Garlicly, lemony, fresh and creamy at the right moments. Don't bother worrying about the service - you order your food and sit down, just trust that its going to be fresh, made by someone who knows what they are doing and will be delicious.\n\nI almost always get a mesa plate so I can sample a lot, but I haven't had a bad dish yet. Big fan of the Baba Ganoush, Dolma and Mojjadara.", "author": "Josh U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "Awesome gluten-free falafel and a very accommodating staff. We also love the lamb, hummus and dolmas.", "author": "Stacy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Friendly staff, fast service, and great food. Try their kebab plates: good size and reasonable price. Come earlier, it can get very busy during rush hours.", "author": "Yulia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-13", "description": "Still love this place five years later. The food is still fresh, the restaurant is still clean. The staff is the same. Standards have stayed high. :)", "author": "Michele C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-14", "description": "Being nice and a having a simple smile when working with customers would go a long way as far as customer service goes. Now I don't expect this every time and/or everywhere i go, but the guy who worked here (not sure if he was the owner/manager or an employee, but it looked like he was the only one working at the time) had an attitude and was just rude. I would give the food 4 stars and the customer  service 0 stars.", "author": "D M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-10", "description": "Food was average and overpriced even by SF standards.  One star less for the very rude (or possibly slightly racist) manager/owner. Too many other good places in SF to bother with this place.", "author": "Xiaoli J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Great place! I work across the street and have been coming here for a few years. Food is always great! One of my faves in the area.", "author": "James G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "We moved from the east coast four years ago and have been going to Saffron 685 for several years now.  The middle eastern food is excellent.  The owner is a little gruff, but he seems to be making much more of an effort to be customer-friendly in response to reviews.  We typically get the chicken kebab plate with some hummus and baba ghanoush.  Pretty straight forward, but very nicely done and always a welcome change for us.  I like the feel of the place and enjoying a tasty, no-nonsense meal.  Give this place a chance because we need more like it in SF......", "author": "Al G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "The first time I ate here I was underwhelmed.  I gave it a few months and have returned a couple of times and have enjoyed the Veggie Kebab plate.  The veggies were grilled well and the hummus was quite good.  Glad I came back.", "author": "Flip F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-11", "description": "RUDE is about all I got from this place.\n\nI have NEVER been treated so poorly as a customer in my life! It looks like I'm not alone when I say the service is absolutely awful.  In fact that does not even begin to cover the issue here.  I have never written a completely negative review or even walked out of a restaurant in my life, but there was just no way I was going to eat that food after my experience. I feel that everyone should be spared spending their money at a business that is so clearly ignorant of providing common decency to its patrons.  \n\nI came in for \"happy hour\" and had the nerve to ask about what was included and was basically mocked for my simple question.  I ordered two dishes for myself and a beer.  (my order was taken after the man who came in 2 minutes behind me)  I was asked if I wanted to eat in or take out (odd because I had ordered a beer)  and I said I would stay and eat in.  I asked to pay with a card, but apparently I did not spend enough money so this was rejected.  Only having $6 cash I said I would have to forget the beer then and I would prefer to take out.  I was then informed I could not take out for happy hour.  So I left because every bit of this was conveyed with hostility.  \n\nIt's really a shame, I would have liked to have found a good Mediterranean place to frequent.  But I don't care how good your food is, I will not spend money where my business is so clearly not appreciated.  Too bad because I do not need you food, but judging by how empty the place was you need my business.", "author": "Christina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "I have been meaning to check out Saffron 685 for a few months as I recently moved to the neighborhood.  After drooling all over the furniture at Room & Board I decide to grab some lunch.\n\nMany reviewers rate the service and the attitude of the guy pretty low. In my experience the guy barely made eye contact or acknowledged my existence but I wasn't looking for a connection or a date.  As for the service it's not the fastest but its not like the two people that work there are sitting around either.  They are busy cooking, cutting, and serving people.  If you are in a hurry don't go and especially don't order chicken as it takes longer to cook.\n\nRegardless, today I had one of the most fantastic tasting falafel sandwiches in my life. \n\nI've eaten at many Mediterranean places in my travels throughout the country.  Midwestern friends listen up as you will eat something so tasty and different than you ever experienced. The falafel is perfectly crispy on the outside and soft on the inside which in my opinion enhances the flavor of the chick pea. Plus the sandwich is wrapped with lavish bread and spread with very fresh tahini and hummus. You will notice random pieces of eggplant, fried potatoes, onions and a little hot spice scattered throughout the huge wrap that make for great surprises in every bite.\n\nAlso the decor is modern and had a Room & Board feel. They even have floor sitting tables with cushions in the back which would make for a fun experience on a date.\n\nYes, I'd eat here again!  The guy can be as socialy awkward as he wants as long as he gives me my falafel sandwich as perfectly as the first one I ate there!", "author": "Kathy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "I love dropping by this place at lunch time and grabbing a wrap to go.  The food is delicious and quick.  The quality is top notch.  The service is friendly.  Why wouldn't you go?  Be like me.  Grab a chicken wrap and take a nice stroll.  You get nourishment and exercise.  Make your body happy already.", "author": "Terd F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "If you want Mediterranean food, this is the place to go. If you haven't tried Mediterranean,  you should. The food is delicious.  It's well -prepared from excellent ingredients.  Give it a try before you go to a Giants game. It's not far from AT&T.", "author": "Trudy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "It's ok given the limited options in the area. Would like to see more meat on the plates.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-03", "description": "Good Mediterranean food, though the price can be a little on the high side. The place is rarely very crowded, except around lunch time.\n\nI've had the kabob plates a few times and they were always quite good, especially the beef kebab. You get two skewers plus rice and a couple of other sides, which seem to change every time, but usually include some kind of humus, salad, etc.", "author": "Ian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "I dont usually like Mediterranean food but the Lamb Kebab Wrap was pretty good. VERY FILLING. A bit too much for me but still a good lunch. Slightly expensive though. Friend got a veggie plate and a drink and it was $20!", "author": "Jaimie P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-23", "description": "As I continue my quest to find the best shawarma in the city, I decided to try this spot since it's close to my office. I walked in, placed an order for a shawarma wrap without looking at the menu and waited for less than 3 minutes. This is what I received:\n\n- a very symmetrical shawarma that was cold, barely had meat in it, and had french fries in it (since I didn't see the menu, i was not expecting this at all). The taste was bland, but I was really bummed about the lack of meat and the temperature of the food. Needless to say, this place does not offer a good shawarma IMO.", "author": "Alfonzo J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "I had lunch here for the first time today. I really like that there are several vegetarian options. I had the vegetable kebab plate with a pomegranate spritzer. Both delicious. My husband got a falafel wrap and it was excellent also. We plan to go back for sure. Yum!", "author": "Roca M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "I came here with a few friends on a Saturday night, a whole in the wall, once you walk in it opens up, we had 3 plates, the grilled Salmon, lamb & chicken, which all were good but they were out of konafa the dessert l like, bummer.", "author": "Moez E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "With not a ton of great options in the area, it's nice to have this place here.\n\nWhile I didn't find the food to be spectacular, it was good overall with a great setting.  I had their lamb shawerma plate, which included rice, hummus and a small salad - everything was good.  I also tried a couple of appetizers (dolmas and falafels) and those were good too. \n\nThe food is cheap and well-priced and the setting is great - very lounge-like.  If you can go during their happy hour special (5pm-7pm everyday), it's well worth it since the sides/appetizers are at a discount.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Saffron 685 has been a regular staple of our dinner plans (almost always to-go) as long as my wife and i have lived on Potrero Hill.  We typically don't explore too far into the menu because the Shawerma sandwich is as good as it gets in the city - lamb is deliciously seasoned, just enough hot sauce and always french fries.  While they are generally crowded for the lunch hour, its an easy dinner to-go or dine in spot on a weeknight.  Why they are not busier i will never know but it's great to have an option you know won't require a long wait.", "author": "Justin R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-17", "description": "Gave a second chance to this place and couldn't believe how unwelconing this place was. Food,,, I can't even call it good, my Lamb wrap was cold and the bred was at least a day old. And than was this guy; that was pretty rude to a client that didn't say a single complaint, just wanted he's food. I guess that place will be out of business soon because every time I pass by it, it's empty.", "author": "Mr. Andro P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "Came here for dinner tonight and it's a cute place with nice decor. you can sit on the pillows cross legged and eat your food on a low table. pretty cute. We had a bunch of kabobs (lamb, chicken and shrimp) and some baklava. The baklava had two flavors: walnut and pistachio. both were very good. french fries were like steak fries. the cook looked at me like i was crazy when i asked for ketchup and said they don't carry ketchup at this type of restaurant. sorry my bad. :P\n\nnever thought i'd like it but it was pretty good! cute date place.", "author": "Cynthia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "Very good Lamb Shawarma, love the potatoes in it! Great flavor! Service was good, they accommodated our friend with gluten allergies no problem. Was a quiet night and we had plenty of time to enjoy ourselves without ever feeling rushed. Good food, nice quiet relaxed atmosphere...Great!", "author": "Lynn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "We live in Potrero Hill and this has become one of our favorite food spots. It's reasonably priced, and the food is excellent and an authentic mix of the best of Mediterranean cuisine. We eat in the restaurant from time to time, but more frequently we order ahead and get food to go. If the owner were to link up with a delivery service, we'd probably order dinner here 5 nights a week, but given the relative ease of parking in this area at night it's not too bad to pick up orders. Personal favorites include the pomegranate roasted pepper walnut dip, the chicken kebab plate, and the heavenly Manaesh bread (combination of olive oil and a mix of spices baked into pita bread -- exquisite!) Great owner, great food and for us at least, great location.", "author": "Ruth m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "I want this place to be good so badly.  Every time I walk by it smells kinda good and I'm like \"oooh Mediterranean food that sounds awesome\" but no! no no no! it's a lie! \n\ndry chicken/meat in their wraps. had their dolma today and it tasted kind of old. or just something was kinda icky about it.", "author": "Sasha J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-23", "description": "You know what's nice?  That you can get a super crazy delicious falaffel or lamb shawarma and sit anywhere you want because this place is always empty at dinnertime.  I suppose they are more of a lunch place, but hey more space for me and my dinner, so keep on keepin on.\n\nThe owner, name I still don't know (sorry dude, next time), has never been anything but 100% genuine and kind and accommodating.  He likes to talk me out of what I ordered and into something he thinks I'll like more, and he's always correct. \n\nIt's fun to sit on the pillows on the floor.\n\nI hate the location.   It's weird.  That doesn't, and won't, keep me from eating the occasional dinner here, but just throwing it out there.", "author": "Boots B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "Dark and depressing venue;  inhospitable waiter who happens to be the only other human being in the place; food was truly awful. The baba ganoush was watery and gross; red beet concoction disgusting; prawn kebab too salty. Just a horrible experience.", "author": "Roy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Yummy, consistent, and healthy food. Always a pleasure to order from Ziad, he is so nice and very accommodating.", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-22", "description": "I have given this place more than a few chances now, and while the food is pretty decent, the one cook there is just down right rude. A lot of the people who reviewed this place to know exactly who I am talking about. He is the taller gentleman with the roman nose and 5 o clock shadow that is always wearing a beanie. The guy doesn't even own the place but still gives attitude as if he does. \nToday the guy screwed up my order and he gets upset at me for doing so? The food is pretty good, but not good enough for where I have to put up with this guys attitude to get it. Most all other people there are pretty nice, particularly the latina cashier,but seriously this guy kinda ruins the whole experience.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-05", "description": "I love Mediterranean food and was in the mood for some great humus, maybe a kebab or some salads so we headed on over for lunch.  The space is quite nice, loungy and probably great for happy hour, but the food was just OK.\n\nThe humus tasted like the American version, not authentic, the kebab was nice and the chicken was juicy, but I just didn't get the feeling this place was authentic or anything special.  The wrap was nice too, but again had the feel of the Americanized wrap.\n\nThe service was OK, quite slow and since there was only one other table there a bit concerning at the thought of this place being packed.  \n\nThis is probably a good place for a weekday lunch but not worth a special trip and I'm guessing that's where most of the business comes from.", "author": "Inga W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-19", "description": "I'm a big fan of Mediterranean cuisine, I ordered Shawerma plate which was awful and coated $18 which is over priced for a poor quality. Why poor quality? Extremely dry meat and rice which makes it hard to eat. In addition the meat was too salty. I do not recommend this place and I won't come back again.", "author": "Siavash F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-02", "description": "So I don't write reviews very often... only when something is just so good I have to tell everyone about it, or if it's so God-awful that I hope to save just one person from this horrible experience. I wasn't even finished with my food when I was already thinking I have to WARN PEOPLE ABOUT THIS PLACE. Sorry I had to yell that.\n\nFor the love of God don't go to this place. First of all the food was horrible. I ordered a Chicken kabob plate. It came with two tiny skewers where 2/3 was vegetables and even skewered lemons! Really? Talk about filler. There were exactly 6 pieces of sugar-cube size chicken over-cooked of course. The rice was undercooked and crunchy. How do you mess up rice??\n\nBut I saved the best for last. So I decided to ask for some balsamic vinegar to put on my dry salad and I go up to the lady that was behind the counter. I ask her for the vinegar and she's about to get it for me when the manager or owner (some middle-eastern looking guy with a beanie) looks at her and gives her a little nod or something. She stops immediately and looks at me with this futile look. I had a hard time processing what just happened but after a few moments it just dawned on me that he just told her not to get it for me. The only reason I could think of was because a short line had just formed. Really??? I just paid $12 for this garbage kabob and she can't take 30 seconds to get me some balsamic vinegar?!\n\nAnyways, places like this will continue to get customers because of the great location, but if I can discourage just one person from experiencing the same bad experience that I did and keep them from getting the customer then I'll be happy.", "author": "Andreas K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "Really delicious, super fresh, well made food. Yum!", "author": "Kelly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-04", "description": "This is my go to place for decent kebabs and complete isolation.\n\nThank God he gets a ton of business during the lunch rush because every time I go there for dinner, it's so empty that I swear I can hear the muffled screams of developers coming from the Adobe sex dungeon.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "I work near this spot and I love their food. The place is clean, always has great beats playing in the background, the staff is kind and quick service. The chef is really serious, but you can tell he takes great pride in the food he makes. The ingredients are fresh and of excellent quality. I recommend it if you're ever in the SF Design district.", "author": "Herlinda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "Just celebrated my 44th Birthday and wanted to go back into my old neighborhood and visit Saffron for lunch as I used to go there all the time when I lived just above it at the Metro at Showplace Square. I am always greeted by the owner with kindness and the food is always amazing!", "author": "Shelley R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-08", "description": "Went to lunch with my friend over the weekend.  I got the chicken shish kabob wrap and my friend got the lamb shwerma.  We shared an order of french fries.\n\nThe wrap was more than adequate for a lunch entree.  In fact, by the time I got to the end, I was just eating the chicken and vegetables.  The sauce it came with was a great mixture of citrus and spicy with just enough garlic to make my taste buds jump for joy.\n\nThe were fresh cut fries done just perfectly and the garlic dip it came with was heavenly.  We had to ask for more because we kept fighting over it. I also ordered a pomegranate spritzer that was tart and refreshing at the same time.  \n\nThe decor is cool and inviting.  There were spacious booths and lounge couches.  Definitely a great place to chill with friends.\n\nI will most likely stop by again if I'm in the neighborhood.", "author": "Judi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-09", "description": "I would LOVE to make this place my local take-out. but I would rather go hungry than suffer the off-hand, sneering service. \n\nIf you are a masochist, I would recommend this place to you.  You will come out HALF the person you were when you went in.", "author": "ann c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-24", "description": "Bad customer service. Just rude, no smile on face while dealing with customers. Serving size is small for their prices. I would try it again though just to give it another chance.", "author": "Prateek G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-15", "description": "Ok, so the dolmas are pretty good - but how hard are they to screw up? And the falafel, as others have mentioned, was sorta dry in parts - not the worst I've ever had, but by far not the best. \n\nMy real reason for the crappy review, is that I walked in, with a mere 2 people ahead of me, and wound up waiting for 30 minutes for PRE-PREPARED FOODS. Meanwhile, I watched (literally) 15 other orders, that took cooking, go out before mine. \n\nI watched the guy make my meal, and it took him all of a minute in total to prepare. \n\nNot to mention how RUDE the guy prepping the food was...several people walked up to the counter to order, and he sneered at all of us (one by one) and just pointed to the register....there's no signs to say \"order here\" anywhere, and the logical place to order would have been where he was prepping the orders...not walk INTO the restaurant to the register to place an order. Common sense people, use it. \n\nAt any rate...while the next closest Greek/Mediterranean style spot is over on 2nd or 3rd @ Bryant, which is several blocks further for me to travel from my office for lunch, I'll still make the extra long trip after this experience. \n\nSorry kids, but in the world of lunch spots in business heavy areas, you really have to be on point - clearly the folks running the show at Saffron 685 don't have a clue.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "Had their lamb shawarma.  It was good enough.  Good option if you're here and want that sort of thing.", "author": "Russel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-19", "description": "We snuck over here for a quick/light lunch between a wedding ceremony and the reception. The space is surprisingly large given the small store front. Jessica C. ordered the latkes (mmm. Mediterranean hash browns) and we picked the lam shawerma plate. I don't know what Jessica C. is referring to, but I love lamb. Never has lamb tasted like barn before. Both of our dishes were faboo. It totally hit the spot since we were starving. The wedding ceremony started at 12:30 and none of us ate yet.\n\nTo cap off our late lunch, the man behind the counter brought us some baklava to try. It was sooo good. If we weren't already going to be attending a wedding reception where there's cake I'd probably ordered some more to go.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-16", "description": "A Greek Islands cruise would be nice about now. Santorini. Some ouzo. Some feta cheese. A little Zorba dance. That would be the life. Not gonna happen soon, so where do I go to replicate that experience?\n\nNew eateries are popping up amid the design and jewelry centers between SOMA and Portrero Hill. For lunch today, I met a good friend who works at Advent, which is across the street from this cleanly decorated Mediterranean place. It definitely looks fairly spanking new with freshly painted walls and accessories in orange and red. It doesn't really evoke the blazing sun that would hit you on the deck of Onassis' yacht in the Aegean Sea. No, it definitely feels more like you're in a place frequented by pale-faced worker bees stuck behind network terminals in cubicles.\n\nAnd it sure felt new. The first thing I noticed was the lack of eye contact among the staff busily preparing the orders. They looked determined to follow whatever instructions they were told to make the falafel and shawerma dishes. Their intense level of concentration meant nary a smile while I was in the queue wondering when they were going to ask for my order. Alas, a voice from the register beckoned, and the smiling hostess took it.\n\nI ordered the $11.50 Lamb Shawerma Plate, which was a pretty hefty portion of grilled lamb shards served up with a fresh thick pool of tahini sauce and fresh vegetables. It came with a tasty hummus and a bowl of marinated bean salad. The crispy lavash came in a large folded sheet that you tear up with some dexterity in order to scoop up the ingredients. My friend ordered the same thing but intriguingly, instead of the bean salad, she got a bowl of yogurt sauce. Neither of us knew why, but I chalk it up to rookie employees.\n\nTruth be told, I think their prices are a bit on the high side for what they serve, even though they are marginally more plush than say, Gyro King in Civic Center or Oasis Grill in FiDi. But the food is good, and I'm sure I'll come back after they get more comfortable with their routines.\n\nFOOD - 4 stars...good due to fresh ingredients, a bit pricey though\nAMBIANCE - 3.5 stars...they have cushions for floor seating, but I feel naked without my hookah pipe, so I passed on that\nSERVICE - 3.5 stars...they're trying, they're trying\nTOTAL - 4 stars...new Mediterranean eateries are always welcome in my extended 'hood...but I want to break some plates and dance the Sirtaki shoulder-to-shoulder with the staff....ooom-pah!", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "It's a shame a place like this exits in a city like San Francisco . The worst service I have ever revived in my life . The food is also so bad not sure if people who thought that this place had good food actually have working taste buds . Avoid at all costs", "author": "Feras I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-22", "description": "UPDATE:\nThe guy emailed me an in an awkward way kind of apologized to me? I'n not sure, but he definitely put a lot of the blame on me. After reading through the other reviews on here and noticing this is a recurring theme with him, I just told him he comes of as an a-hole and any problems I encountered were his, not mine.\n\nOh, and he doesn't hate bikes. He just hates when people bring them into his restaurant. Still don't know why. Don't care. F this guy and his over-priced (although admittedly tasty) food.\n\n--------------------------\n\nThis guy HATES bicycles.\n\nI've walked to this place twice before. Both really good experiences. Today I decided to ride my bike there. When I got there, I noticed there is no place within sight to lock up a bicycle. Since I was ordering to go, I thought I could just stand in line with my bike, get my food and go.\n\nAs I try to walk in, the skinny Croatian (I assumed he was middle eastern because of the food, but happy to find out he's not) guy yells, \"No bikes!\" and points to the door. I was a little shocked at how he decided to let me know about this rule, but I backed out and looked for a place to lock it up. I found an illegal place to lock it, but it was out of sight. No worries. I wasn't going to be long.\n\nI come back in without my bike and stand in line behind 3 girls. He takes their orders then sends them to the cashier while he puts some earlier orders together. He finishes putting those orders together after about 6 or 7 minutes. Then he puts the 3 girls orders together. After I've been standing there for 10-15 minutes, he continues to ignore me standing right in front of him.\n\nSome other guy behind the counter tells me to go to the cashier to pay. I guess because I broke one of his rules to which I immediately complied, I don't get to eat at his place any more.\n\nI guess I won't be going back there. Too bad. The lamb shawerma was good, but I can get just as good meals from nearby places who don't mind that I bring my bike in when I'm taking out.", "author": "Brad D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "We've eaten here several times--on a holiday and weekends when it is less busy--and the quality of the food to be excellent. The falafels are gluten-free which means they are not made with flour or filler so there is more garbanzo, parsley, and cilantro. High quality ingredients make for an excellent falafel plate, tabouli made with italian parsley, soups, and delicious beet dip (you must try this!), and spritzers. We eat falafels all over town and find the quality of the food at Saffron 685 to be a cut above most others. So if you are paying a little more, it's for a good reason. I can see why others commented on the lack of warm service but found that it improved when I made the effort to engage and express interest in the food.", "author": "M.D. L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-07", "description": "kind of a strange location and a dark restaurant but decent food that hit the spot.  I guess they get a lot of lunch customers from the surrounding design district.  A little expensive for what you get but good solid food.  I had the lamp kebob plate, meat pieces were small but tasty, the hummus and baba ganoush were delicious.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "Really great interior - there was a cool seating area where you could sit on pillows instead of chairs. Fun vibe! The food was also delicious.", "author": "Richard F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-08", "description": "I'm writing this review sitting in the restaurant...I work nearby and have been coming here for 2.5 years. I don't know why at this point. Every time the service is slow and spotty. Someone in my small group always has their food served after the rest of us have finished. The food is not that great either, especially considering it 's on the pricier side. Save your time and money. There are much better Mediterranean restaurants in the city....", "author": "Mindy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-11", "description": "Stopped by here on a whim to grab a bite to eat, and I wish I didn't.  I ordered the lamb sandwich, which was just okay.  there was nothing particularly special about it, and what made it a bit worse was the server/manager.  this guy was miserable.  there was no other staff in the place besides him.  Had to get up a few times to ask for water, and he wouldn't even fill my glass to the top.  Also, had some of my partners falafel sandwich, which was depressing.  the falafel was dry, and in two huge pieces, which threw off the proportion of the wrap.  we also ordered the mint lemonade, which was bitter, and had a bad aftertaste.  overall, just not very good food, or service.  \n\nAnyways, considering there are not much choices in the area, I imagine this place fills up for lunch during the week, but not because it has good food, probably because most of us only have a short lunch break.  If you want good falafel, check out sunrise deli.", "author": "David M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-02", "description": "The guy working behind the counter (might be the owner?) sure was a character-and not the good kind.  I don't know if it's b/c it was dead and the guy had nothing better to do, but it seemed his agenda to pick on us.  First off, I went to grab a beer from the fridge and he tries to sell me hard on the housemade tea.  Uhm. No. I want my beer thanks. Random.\n\nThen, when my friend went up to ask for a side of tzakiki sauce for his lamb wrap, the guy goes off  on him.  Lecturing him for a good 5 minutes on how the two don't go together.   Finally, when my friend went to ask for a to go box, the guy gave attitude and asked why we need one. It seemed he was offended there were leftovers.\n\nAs for my food it was alright.  The lamb schwarma I ordered and rice it came with was dry.  And the guy didn't even warn me about scorching the plate when he brought it out!\n\nYou might wonder why I haven't given this place one star.  Well, the second star is for the cool, lounge like setting. I would've come back to enjoy it more and check out happy hour, if it wasn't for scary guy.  I did not appreciate how pressured and stressed he made me feel the whole time.", "author": "Shree R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-23", "description": "I'd give it 2 and a half stars.  It is a bit hit or miss and a curious little joint.  I'd have to say the lamb schwarma salad was very nice and plentiful.  The falafel wrap was a mixed bag, the wrap was dry and too crumbly, the falafel though was not which often happens when people over cook them.  \nThe owner/server was accommodating enough as I like my dolma heated not cold.  Makes a world of difference and with some heat the grape leaves were quite good.\nThe lemonade was the best I've ever had without doubt.  Subtle, not too sweet but enough lemon to make you want two.\nI think the search will continue and I didn't try the humus which to me is the litmus test for Mideastern restaurants, like salsa is for Mexican eateries.\nIf you're in the area it will fill your urges but I wouldn't go out of my way.", "author": "john b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "I was pretty happy with my Falafel Wrap ($6.50) that i had for lunch here. It was a little heavy on the onions and there were french fries in it, which was a bit weird, but all in all, i liked it. The food is good and it comes out quick. \n\nOne thing that happened was very odd. My friend and I were having lunch and she was just about finishing up. She literally placed her last bite into her mouth when someone came by to grab her plate from her. She hadn't even finished chewing. It was a bit awkward. I understand that they are trying to be efficient but I think there is a fine line between that and rushing people through. Otherwise the service was good and provided with a smile. \n\nThe restaurant is a cute little place with comfortable cushions and sofas everywhere. I actually kind of wish they had more normal tables. \n\nThere is a theory here that if a guy and a girl come to eat her, the girl will get her food first. So far the theory has proven to be true.", "author": "Mariko F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-23", "description": "Saffron 685 is within walking distance of our place - like 45 seconds walking distance so it gets some extra points for convenience, and it's also super tasty. \n\nOn one hand, I'm amazed that this one dude apparently runs the entire show solo, cranking out some damn fine vittles. On the other hand, talking to the dude, ordering, paying... all are uneasy at best. Sometimes he comes off as a total jerk, other times it's just uncomfortable. I don't mind too much - it's good stuff! But my fiance hates going in there. So we don't go so much any more. \n\nI wish he was friendlier. Maybe he should go hang out with Emily at Clothespin Cleaners for some tips on being more personable. \n\nIn closing: amazing food in a cool room, but an uncomfortable environment.", "author": "Surj G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-30", "description": "I understand that there are some people who hate kids. I used to be one of those people. I get that kids and restaurants have a sordid history, and believe you me this review would be more forgiving had I thought that our behavior had warranted it, but I have to pull a mama-bear with this one.\n\nWe met some friends and family from out of town for a quick, weekday evening meal.  The restaurant was empty aside from our party of 6 (5 adults and 1 toddler). The server's sheer, undisguised disgust at our presence was alarming. \n\nWe were there for less than thirty minutes. The toddler, who did not eat or make a mess, apparently rendered us third-class customers. Steerage diners who don't deserve eye contact or communication beyond grunts.  When the vermin, erm I mean child, sat on one of the unused sofas (with supervision, and NO food, no sticky fingers, no dirty diapers, no graffiti markers) for less than one minute, and the owner ran over to fluff the cushions almost immediately after we got up. Um. \n\nPrior to this, we have been regular, near weekly takeout customers, but we will not return. It's a shame considering that the nearby Mission Bay neighborhood is exploding with young families wanting to patronize local businesses.", "author": "Who Knows N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-06", "description": "I kinda want this to be 1.5 stars since my boyfriend thought his falafel wrap wasn't too bad, but I tasted it, and it was just mediocre.\n\nI ordered the lamb kabob plate.  for $12, it should have been at least edible.  It wasn't.  The rice was either extremely stale, over very undercooked.  We're talking CRUNCHY, and so lemony, it was hard to swallow, and I loooooove lemon.  The food aside from that was just \"meh\".  Not very flavorful, stale, watery hummus, etc.\n\nThe guy behind the counter was surly.  I asked if there was such a thing as ordering one latke (so my boyfriend and I could share), and he said no (which is fair), but gave me a look like I had asked him to serve up slices of his first-born son.  When I told him I couldn't have the olive he had used as a garnish for allergy reasons, he was visibly annoyed.  You could see on my plate where he had scooped it out, but didn't replenish the hummus it was sitting in.  He sternly told my boyfriend we couldn't sit in the lounge area even though we were, aside from another couple, the only people in the entire place.  Oh, and if that guy is reading this?  If you hand someone a plate and you know there's something extremely hot on it?  TELL THEM.  I picked up my kabob and I now have a blister on my index finger, so thanks for that.", "author": "Samantha W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-01", "description": "This place is great if you need a quick cheap bite (order at the counter) and have your choice of chilling in a lounge-y environment with little tables and square cushy ottomans or tables with a low-key environment. \n\nMint lemonade was really yummy, friend had falafel plate which she said she's had better. I ordered the lamb shawerma sandwich which is not the best I've had. The wrap is huge so I felt like I was eating layers and layers of it and some of the lamb tasted like it was ... re-microwaved? Kind of crunchy and old-ish. \n\nNot a re-do.", "author": "Christine Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-14", "description": "I usually frequent as many diverse Mediterranean places as I can, The food here was of good quality, I ordered the Chicken Kabob plate. The kabobs were a little on the skimpy side considering the 12$ price for the plate. The one thing that earned this place 1 star in my humble opinion was the service.\n\nWhen my order came up, I heard the number the waitress did not bother to look at my table and gave my food to the people sitting directly behind me, the guy preparing the food noticed this and went to that table to take the food back and directly handed it to me, during this time the patron had touched the food - i was appalled for one, that this guy had the nerve to just grab the food and offer it to me, secondly when I told him that I did not want something that had been handled by another patron, he indicated she only touched the bread - I asked him are you sure - he then was like ask her... No I don't think so bring me out another plate please.\n\nI do not believe I shall be visiting this establishment again", "author": "Jorge J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-21", "description": "kebabs, falafels, and latkes mmmm this place is great if you are looking for healthier lunch options.\n\nThe chicken kebab salad is delicious and I'd also recommend the falafel wrap or plate as both ares really tasty!\n\nIt is a bit on the pricey side but if you have a craving for falafel, this will do it!", "author": "Christine W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-07", "description": "would say 3.5 stars. owner is rather evasive but a good cook. french fries and tahini were solid...overall I thought the quality of the food was great. the ambiance and service needs an upgrade.", "author": "James B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "Ok. I admit, the guy behind the counter isn't the friendliest. I won't even try to defend him. He's takin' our monehhh & should do so with at least a reluctant smile instead of grunting like he's Kyros, the friendly giant. Except, you know, he's not friendly at all. What happened to friendly ones like Hagrid? \n\nAnyways, this place is usually a one man operation with a counter immediately to the right where aforementioned Kyros (not his name, I'm sure, but I'll call him that for convenience sake) may or may not acknowledge your existence and not ask what you'd like to have; just tell him and if you're lucky, you'll get a grunt to know that he heard you. \n\nWhile the service is lacking, damnit if those magical giant hands don't serve the best falafel wrap I've ever had. That's what my rating is for, and that's what keeps me coming back to the giant's nicely decorated falafel cave.\n\nOn the plus side, parking hasn't been a problem for me when I've come , and he does seem to be warming up to me since the last time he managed to at least tell me the soup special, though he could have been talking to the kebab sandwich that he was gazing at and focusing so intently on preparing.", "author": "Veronica G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-20", "description": "The staff was very kind and the restaurant had a lovely, clean interior.\n\nHowever, the food was just so-so.  I was expecting more authentic Mediterranean food and this was not that.  The bean salad appeared to be out of a can and very plain.  \n\nI had the bean salad, fattoush, tzazekee and dolmas.  Honestly, the nothing really stood out to me as \"man, that sure was good.\"\n\nIt's as if the flavors and ingredients had a lot of potential to be nice and fresh but just fell short of actual follow through.\n\nThough I want to stress again that unlike the other reviews I read, the staff was very helpful and inviting... It's just that the food isn't what I was expecting.  \n\nGiven all the opportunities in this city to have authentic Mediterranean food, it doesn't make much sense to opt for only so-so.", "author": "LauraKatherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-21", "description": "For the love of god, eat here!\n\nThere's a wait, of course, at lunch time. \n\nI had the veggie wrap w/ eggplant and the garlic action. No falafel, which has been vouched for as the best in the city. \n\nWhat I did have was a Mission sized burrito wrap, filled with deeelicious light and flavorful food. \n\nGarlic, eggplant, zukes, tomatoes. It's pricey at $8.95, but good!", "author": "Em L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-03", "description": "My boyfriend and I have been going here for a late night weekend dinner for a few months now and have always had a top-notch experience. I was surprised to see how many folks comment on the owner's lack of good customer service - we've always found him to the friendliest and most accommodating guy who always makes sure we're happy and satisfied.  When it's quiet in the evenings, he even stops by and chats with us and once even gave us a free dessert.  \n\nThe food is sooo good here, and to quote an earlier review, an *amazing value* for what you pay.  We always get the fatoush salad, which comes with the most incredible tomatoes, and the succulent lamb kabob -- both are top-notch delicious.  My boyfriend has been going here for years, and also loves the soup, and the fact that its one of the only places to serve Chimay beer.  The beer is always served in beautiful glasses, perfectly polished and spotless, there is always good music playing,  and the ambiance of the place is a creative mix of urban panache with a cool middle-eastern vibe.  \n\nIn short, this is a great restaurant -- a solid selection of dishes at good value prices,  with nice ambiance, and good service.", "author": "Maria R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-24", "description": "This place is horrible - save yourself the trouble and dont go here. I went with my 18 month old and I was told the only place I could sit was by the door. The restaurant was empty, there was no one in there. When I asked why, the guy replied very rudely b/c I have fancy cushions on my chairs.\n\nwell guess what I walked right out as my baby is not a monster who will destroy their chairs or cushions or watever. I told all my friends and I guess he wont be getting any business from our circle of friends", "author": "Moona Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-17", "description": "Lunchtime lamb shawarma sandwich. Skimpy toppings rolled up with average lamb. I expected something more, considering the trumped up reviews. It's like going on a bad first date. No surprises, no complexity, no hot factor.\n\n**Plus one Faye star for the polite and courteous manager", "author": "Faye P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "My fiance and I went here and the food was delicious, they have great desserts too. We were very impressed with the quality, prices and portions......I give it 5 stars!", "author": "Jeanne B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-22", "description": "Not a good place to go. Service was bad and one of the server, who's a guy, kicked my friends and I out. We ordered food for there and he forced us to have it to go to \"make room\" for customers. No one was in line and there was no line forming.... Never coming here again and the guy server just rubs me the wrong way", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "Woohoo is right!\n\nI absolutely love this place in every way: the food, the ambience and the service most of all. Ziad is the man!\n\nThe babganoush is to die fo and the chicken kabobs are heavenly!\n\nI love love love this place!!!\n\n\"I'm just made about Saffron...Saffron's mad about me.\" :)", "author": "Johnny R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-17", "description": "Today, I happened to be in the neighborhood for a gallery opening.  My friend and I decided to not eat the food at the opening. I noticed Saffron 685 from across the street.  We walked in and were immediately at ease with the light wood furniture and curry/caramel colored walls and furniture coverings.  \n    We both chose the Falafel Wrap.  As we each munched on the most delicious falafel sandwich I have ever had (I've traveled most of the US and have had many flafel sandwiches), I ordered two Turkish coffees.  They were delicious, and blended well with the Falafel wraps.  After eating, and going to the counter to pay.  I had to have a sesame cookie for desert.\n     A seductive, more than delicious place to eat.  I look forward to having a kabob for dinner!", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-02", "description": "I worked across the street from here for 3 months and I never tried it, but last weekend we were looking for a place to eat a snack in between a wedding and the reception and this was the place for it.\n\nTrying to aim for something light, I wanted to have the shawerma naturally because I never eat light, but settled on the latkes which are traditional potato pancakes. Let me tell you, they were sooooooo good. Henry L. and Cindy C. did end up ordering the shawerma plate, so I was lucky enough to sample from it. The lamb was so very tasty. It didn't taste like barn, which is why I normally avoid eating lamb in the first place. \n\nEverything I tried was pretty good here, and the man who took our order was super friendly. He suggested things for us to have and was very paternal about it. It was cute. Then as we were leaving he gave us some baklava to sample. That also was so crisp with this filo dough. Very good experience all around.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-03", "description": "THE OCCASION: Girl-bonding lunch with Jax, July 24, 2009 @ Noon\n\nTHE VENUE: Feast for the eyes as well as for the palate. Very hip. Walls painted in Saffron and brick.  Bright colorful pillows placed all over.  You can either sit at the table or on the OVERSIZED PILLOWS ON THE FLOOR.\n\nTHE MOOD:  SOMA employees energetic and lively  during a  Friday lunch. Probably looking forward to the weekend. Plenty of tables and not crowded at all. Warm and cozy for dining with friends or eating solo.\n\nTHE FOOD:\nCommon Mediterranean dishes but the FRESHNESS of the ingredients is WHAT SETS  this Mediterranean place APART from the rest.   The dishes are flavorful and light unlike some of the heavily oiled dished I've had at other Mediterranean places in the past. Generous portions on big white plate.\n\nTHE SERVICE\nYou order cafeteria style and they will bring your food to your table. The servers were friendly and efficient.\n\nTHE FOOD:\nEverything looked so good that my GF and I had a hard time deciding what to get but we ordered:\n-2 Orders of MEDITERREAN PLATE: \nHot and fresh Pita Bread\nHummus\nTabouleh\nMojjadara (lentil and bulgur topped with caramelized onion)  \nFattoush (salad of tomato, mint, cucumber with toasted pita and lemon)\n\n-A side of Tzazekee (cucumber dip)\n\nTHE TOPIC: \nA. How  good we are  keeping our promise to have regular girl-bonding lunches.  Will have many more to come.  \nB. How we got it so good when we were still single but currentl life is good as well.\n\nTHE TAB: $23.00 for 2 happy and well-fed girls (Tax included)", "author": "Leah E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-25", "description": "This place is extremely quaint and under the radar.  I RARELY see anybody in here when I walk by. (I work down the street).\n\nAfter forgetting my lunch and reading Yelp, I decided to try my luck here.  I ordered the lamb shawerma and loved every bite!  The lamb was delicious and tender and the shawerma itself was perfectly juicy.  I've had bad experiences with extremely dry shawermas, so this is very important to me. It is a pretty hefty size.\n\nThe service was very fast.  This was all I ordered and I was in and out within 10 minutes.  As I sat there I noticed, that the actual restaurant felt new and fresh and extremely clean.  I really respect and like that.", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "*  The best Lamb Shwermas in town!  \n*  Pillow seating on the floor, are you kidding?  It's like I was back in my favorite restaurant in the middle east!\n*  Ziad is super friendly.  His conversations definitely round out the total dining experience.  \n*  Super busy during lunch, so be patient.  It is worth the wait!", "author": "R C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-27", "description": "Maybe weekday friendlier?\n\nYikes...very cold atmosphere just got my nails done next door...don't understand this place...I support my neighborhood - but this guy does not even acknowledged me coming in...i was the only one in the place! \n\nnasty attitude....", "author": "Liz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "You people are crazy if you think you can find better Mediterranean food at this price and quality anywhere in SF!  I've been a customer of Saffron 685 for over 8 years and it is still just as good as ever.  Try it again and I guarantee you will love your dining experience!", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-20", "description": "My friends and I came here on a Saturday night. This place was deserted and I was a little worried. This is definitely one of those places for lunch at work as this place seems to be in the midst of a business park. The food was good. pretty much your typical Mediterranean fare. On Saturday nights it is a one man show.  We walked there from market street. not so much a good idea. \n\nI had the lamb shawarma which was good. and a side of falafel which was okay. just a little on the crispy side.  i dont live in the area and I dont think it is a must go, but if you are in the area go for it!", "author": "Grace L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-04", "description": "I was very excited to try this place since I LOVE me some good falafal. The ambiance is great, but the food was only OK and the service was abysmal. \n\nThe back has great couches and the low circle tables with pillows as seats while the front has regular tables. I got the falafal wrap, which surprisingly came with homemade tahini, hummus, eggplant, and lettuce. It was good, but nothing extraordinary. In fact, I think there were only 2 or 3 falafals in the entire thing because of all the other fillings and the lavash was completely dried out. I also had to try the baklava since, well, who can resist baklava? It was also dried out and barely had any honey on it. Not good. \n\nIt was then that I saw the latkes, or potato pancakes for you gentiles. They were huge and chunky and looked amazing. So I bought 2 for lunch the next day. I could hardly wait for lunch the next day and anxiously heated them up in the toaster oven. I wanted to try them naked, without the apple sauce and sour cream that latkes go so well with. Wow. What a disappointment. All I could taste was a mouthful of salt. Then a mouthful of pepper. Lots of seasoning, but no potato. They were barely edible. \n\nTo top it off, the gals behind the counter were pretty miserable. No smile. No nothing. Almost as if we were bothering them just by simply being there. Sorry, Safrron. I'll get my falafal fix somewhere else.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-13", "description": "This place has nice food, but the one guy who works there is so rude.  He's the tall man other people have referred to in their reviews.  He is so arrogant and condescending, just dripping with attitude.  This is the second time I've left the place thinking \"what a jerk.\"  This time it seems he was annoyed because I interrupted his phone call.  I walked in at 3:30 in the afternoon and there were no customers there.  I had to wait to place my order until he was finished with his call.  Then when I finally placed my order he acted like it was a big pain.  This guy needs a new profession -- NOT in a customer-facing role.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "Strolled upon this place after massages at Suchada (just around the corner).  It was the only place open so my husband and I decided to check it out.  YUMMY!\n\nWe had the Lamb Shawerma and the Meza plate with hummus, falafel and bean salad.  I haven't had Mediterranean food this good since I was in NYC.  There was plenty of tables.  I'd love to come back again.  \n\nI had to take away a star because they do not accept AMEX (my personal card of choice), but other than that -- great service and excellent food!", "author": "Aura J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "After receiving a very kind message from our server at this place, I am deeply touched and therefore, I must bump this place back up to its well-deserved 4 stars. \n\nThank you for the apology and the clarification of how your restaurant works. It truly is a delicious place and because of your hospitality, I hope to come by again sometime soon.", "author": "Steph W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-23", "description": "The food here is decent.  Not the best, but it's decent.\n\nHere's the rub.  The service is AWFUL.  The worst.  The tall guy with the hat is always rude to me & I've been there a good 20 times. (yes, I'm a glutton for punishment!)  The final straw, though, was when I was told that my group of 4, including my four year old daughter, could not sit on the benches in the back.  When I asked why, I was told that kids are messy.  Please; this is one step up from fast food!  And my kid isn't perfect, but she's pretty clean!\n\nNext time I have a craving for falafel, I will head to Ali Babas in the Mission.", "author": "Jen K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "I was really impressed by the Falafel Plate. The falafels were very hot/warm at the table too. Browned to perfection - not too crunchy on the outside and the right amount of moist and soft on the inside (typically the falafels I have eaten are overcooked and often hurt the mouth to eat because they've got such a hard shell). The presentation was very nice and clean. My boyfriend and I really enjoyed how fresh the food was and we loved the salad additions, they were delicious. \n\nThe atmosphere was nice; Tastefully decorated and comfortable. \n\nThe staff seemed pretty hard-nosed...by that I mean, I gave the server a brief glance and he was staring me down for a good 5 minutes. Kind of intimidating guy, but he was...moderately polite I suppose.\n\nI am giving it a 4 star rating due to the fact I felt like I was walking egg shells around the server.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-23", "description": "I signed up for Yelp just now so I could rate this guy.  I've been in this place several times because I like the food and try to ignore the rudeness of the guy.  He will only prepare the plate and the food the way he wants to so don't even bother trying to change anything.  Don't ask for a small side of anything because he will charge you for it.  Don't ask him to do anything he doesn't want to do because he'll tell you that you don't have to eat there.  He really is like the Soup Nazi from Seinfeld.\n\nI hope he comes to his senses soon or some else takes over the customer service part of the business.  The food is decent if you have no place else to go, just know that this guy thinks he's better than you.", "author": "Monica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-06", "description": "Really great location and the best chicken shwarma have had the good fortune to eat.  Ziad took a chicken kebob and grilled it over a hot grill and placed the wonderful yummy goodness in my wrap with lots of veggies.\n\nThe prices are reasonable and the tsaziki sauce was a cool and refreshing addition to my shwarma.  Staff was super nice.  I hope I have another excuse to come by SOMA sometime soon!", "author": "Connie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-07", "description": "The place was unfortunately a huge disappointment and I would highly recommend not to order from Saffron for catering food. I asked for enough food to feed 45 people and what was provided only fed 25 -30. They offer a kebab tray with 12 skewers at $85 and you would think that they would be pretty decent size skewers, but they were puny. It took 2 or 3  to actually fill you up. And when asking how many trays they recommended they said 4 (only to end up bringing us 3) which was insufficient and so expensive. When I called back to let them know there wasn't nearly enough food they wanted to charge me even more to bring another tray. This place is insanely over priced and really not that great. If you want a good restaurant for catering I highly recommend T-Dubbs. You'll definitely get enough bank for you buck and it SO delicious.\n\nWe will not be ordering from Saffron ever again.", "author": "Alli M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-02", "description": "I'm not sure what these guys are saying, but Ziad (a.k.a. The man behind the counter) is very friendly and helpful.  Not only do you get a mouthful of yummies and a delicious drink to wash it all down with, but you get cute tidbits about the history of the food and how they are made.\n\n;-)  Great food for good price.  Always satisfied at this place.\n\nP.S. I know Mediterranean is served, but If you ever try the french fries with Aioli (Balsamic/Lemon), you'll probably not want to have french fries anywhere else.", "author": "K S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "One of the best falafel and hummus wraps I've ever had.  The bread was warm, toasty and delicious.  The hummus was creamy.  The falafel was perfectly seasoned and not over fried.\n\nFriendly and quick service and reasonably priced.\n\nThe atmosphere is also pretty awesome.", "author": "Mack D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-01", "description": "Do you want that mediocre shawarma sandwich to be spicier? Well then you have to get up and pay 50 cents! It's not that I can't afford it, but after the service is so bad, getting nickel and dimed for something that EVERY other restaurant in SF gives you for free is what will prevent you from ever coming back.", "author": "Guillermo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-29", "description": "Really 3.5. \n\nPretty dead on a weekday night. Saffron looked like it could be hopping with SOMA folk during lunchtime, but it was deserted for dinner. We did notice a few to go order being assembled so we weren't scared to try it. Plus yelpers had rated it high enough to worth a visit after our REI run. \n\nThe SO (significant other) ordered a shrimp kebab platter, I ate a chicken kebab sandwich, and an order of tzatziki between us. It's really hard to resist the yogurt sauces when eating Mediterranean food.  His was pretty tasty, mine was mediocre but had a nice spicy sauce, and the yogurt sauce was fabulous. The sauce did seem to be a bit overpriced but the quantity was much larger then we possibly could eat in one meal. \n\nThe interior is nice and clean with a variety of tables to sit at. High low, cushy, sturdy etc. \n\nI recommend  the mint lemonade!  Not sure how often this place will be frequented, but it's worth a shot if you're in the area.", "author": "Tina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-07", "description": "EDIT:\nToday I went to Saffron 365 for the first time since writing my original review.  I guess these guys are reading yelp, because the owner spoke to me about my review.  In length and detail.  While I was with a external consultant on a business lunch.\n\nObviously I had a bad day, and was pretty upset when I wrote my review.  And obviously I upset the ownership here.  And I guess they were successful.  I am changing my review.  They have owned a business before.  And they are improving their service.  And they are reading Yelp, so I guess we have some power.\n\nBut you know what, I don't think I am ever going back there again.  The person I was there at lunch with couldn't believe I was spoken to like that.  I apologized several times.  And you know what, I am actually sorry.  But it still felt unprofessional to me.  And I am frankly afraid to return.\n\nORIGINAL REVIEW:\n\nI don't believe the people who own this place have ever owned a restaurant before.  \n\nHow can I tell?\n\nWell, I was sitting here with some coworkers for quite awhile a few weeks ago, and we had a lot of time to analyze the place.  The service is slow, bordering on god-awful slow.  The food comes out in an obscure order that seems to favor eating in over taking out, which makes sense if you want a large group of take out people sitting around in your restaurant.  There seems to be too little space on the grill, and too much space between stations to be efficient.  Watch the guys at Truly Med on 16th & Valencia and then watch these guys and you'll see exactly what I mean.  The difference is, the people who own this place designed these stations themselves.\n\nThen there is the woman who works the counter, who I suspect may be the owner.  She has, dare I say, the oddest customer service of any owner operator I have dealt with.  She will tell every person who orders take out that the kebab's take 12 minutes and the falafel takes 6, pushing people to get the falafel.  The last time I made this choice, and got the falafel, it took at least 15 minutes, and someone who ordered after me got their kebab in 10.  Which pissed off everyone in our group, cause we had all come for kebab and left with falafel.\n\nThe only redeeming quality of the place is that the food is actually decent.  The veggie kebab is really tasty, and the falafel is, in fact, decent as well.  \n\nBut seriously, I would order ahead and avoid the anguish.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "Superb food!!! Never dreamed a chicken kebab could have so much flavor. The only reason I don't give this 5 stars is that the atmosphere was lacking. Seems that this is best a lunch or weekend dining option.", "author": "Karen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "Loved my first experience. My boyfriend and I called our order in without ever actually stepping foot in the restaurant. The guy working was really nice and helpful. Not only that, but once we got home, tasted the food and loved every bit of it. We ordered the lamb shwaerma with the hummus, baba ganoush and tzatziki. You could tell it was all made fresh and it made our first time eating their food that much better", "author": "Mogi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Food is excellent and affordable.  I discovered this during the day and then had a small party here at night -- everyone loved it.  I pre-ordered the food -- lots of appetizers, grilled meats, vegetables, and pita.  Everybody raved about the food and service, so it was a great success.  The baba ganoush is not to be missed, the meat eaters loved the grilled meats and the vegetarians loved the grilled vegetables and all the dips.  The saffron rice pudding is unbelievably delicious, as is the Turkish coffee. Parking at night and on Saturday is a breeze.", "author": "Kate C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-06", "description": "Excellent wraps and attentive service!\nWe came here for lunch on Saturday and had the lamb shawerma and chicken kebab wrap, both were tasty and flavorful.  We saw him prepare the meal and he used fresh ingredients-always a plus!\nThe decor is nice and we liked that they had beer & wine too.  We enjoyed a Stella and Pilsner Urquell ( one of my hubby's favorites ) and it was a good accompaniment to the meal.  Looking forward to returning. ;-)", "author": "Lizete S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "My favorite after work stop for tasty middle eastern food. I call Ziad and he has my order ready in a few minutes. It's always delicious.  I particularly love the Shawarma plate, chicken kebab over salad, fresh soup and DELICIOUS turkish delight!!!  I could eat there every night.", "author": "Susan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-09", "description": "This place is really interesting. From the front it looks like a deli type of Mediterranean eatery but when you walk in, it has a huge space in the back with couches for seating. I don't know what to make of the interior. It's like it can't make up it's mind between a cafeteria'ish lunch spot to a nicer evening dinner spot. \n\nAnyways it's all about the food. The Lamb Shwarma was good. The place on 16th in the Mission was still better and close to half the price. The pluses of this place are that there aren't too many nearby Mediterranean places in the area and it's convenient to go or eat there. It's a little over priced but with the exception of Starbucks, all the restaurants are on that little section of businesses. \n\nWe'll probably go back when we're craving a Shwarma but too lazy to drive to the Mission.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "Had a great meal here tonight.  Food was WONDERFUL, and the server could not have been more helpful despite the fact that we ordered in 37 stages (Now could we have tea?  Now could this other person in our party have a lemonade?  Now could we have a beef wrap we didn't order before? Now can we have a to go order?)  Food was terrific.  *Loved* the lamb Shawarma.  We parked right in front.   Had a large party so we sampled many dishes - all received great reviews from our group.  Have the mint lemonade - it was great!", "author": "Carrie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-11", "description": "yummy potato pancakes!!\nhad those with rice and hummus.. all pretty good\nwas in the area for the techcrunch hackathon, so this place was convenient. \nnot a place i would go out of my way to return to, but not a bad option if i ever happen to be nearby. place seemed to be getting a steady stream of orders, so seems popular with locals!\n3 stars .. A-OK seems to be a pretty good descriptor for my experience at this place!", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-05", "description": "I went to Saffron with my friends last night for dinner and found it...enjoyable.\n\nPlace is very large and completely empty on a Monday night, so the 6 of us had the whole place to ourselves :).  I'm pretty sure the joint wasnt built to be a restaurant, kind of resembles a furniture store?...but that means it feels clean and comfortable!\n\nIt's a one man show -- the owner is pretty nice but was not too amused as the 6 of us bombarded him with question after question about the ingredients, fat content, substitution options, etc...lol.  It's hard to please 5 health conscious girls (+ me...who'll eat anything).\n\nOptions were limited, but ingredients were fresh and decently tasty.  The meat in my swerma sandwich was tender...but again, nothing exciting.  FYI -- hot sauce cost 75 cents extra!\n\nThey do have a good expresso machine there, so after ordering a Turkish Coffee and hating it (it resembles a shot of expresso, full of grind *patoo*)... I was abe to get my latte fix. \n\nI think I'd like it way more as a lunch spot.", "author": "Kendra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-06", "description": "Loved this unassuming spot in the heart of Showplace Square. The food was great - my friend totally enjoyed her falafel platter, and I thought my chicken kebab wrap was superb. I especially liked how they barbecued the kebab (no excess oil here) and filled the wrap with hummus. All this was dished up with friendliest of service, and we ate our meal at one of the low tables that featured pillows to sit on instead of chairs. A nice twist on the overall modern environment.\n\nPrices were a bit above your average takeout Mediterranean ($9 - $14), but considering the quality of the food, service and environment, I felt it was well worth the expense.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "Went on a lunch date here recently.\n\nI went for the lamb shwerma sandwich which comes with the traditional lamb carved off the giant skewer, their hot sauce and some bits of potato and dressing rolled up in lavash bread.  I had them hold the onion on mine.  The sandwich was pretty good -- the hot sauce not as hot as I like so I would ask for double hot sauce next time.\n\nI also ordered the side of baba ganoush ($5) and a side of fries ($4).\n\nThe baba ganoush was ok -- a little more gelatinous than I like but nice flavor and went well with the hot pita it arrived with.\n\nThe hand cut fries were out of this world.  I would say they rival the fries sold by that Frjtz place.  Delicious, hot, large cut chunks of perfectly fried potatoes that came with a delicious (mustard?) aioli.  This was my favorite part of the lunch.\n\nThe food that I tried here at lunch hour was top notch but somewhat pricey for lunch.  It came out to over $30 for two people after food, tax and tip.  But I'd like to come back.  It would have been a reasonably priced dinner.", "author": "Spicy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-28", "description": "Not enough meat in the shawerma, charged $3 (!) for extra tzatziki sauce, and orders take days.", "author": "Rich L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "Just had the mannaesh plate.  So delicious and light; perfect for after a 2-hour Thai massage!", "author": "Kameron H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-18", "description": "Bought the ~$6 falafel...was told there was a MINIMUM CHARGE of $8. Reluctantly I accepted because I didn't know my rights. Now, from my research, apparently I should be reporting them to my card company and getting them in trouble, because they are violating their agreement with the card company. Before I do that, however, I want to go talk to their manager. \n\nThis is just not ok to do as this type of business. Now I don't want to eat there (despite the fact that the food is good), and I'm posting here to complain about it. Unfortunately the one time ~$1.50 they made off that minimum is going to cost them probably at least 2 $6.50 meals repeat business a week from me, and the business of everyone that listens to me when I warn them about my experience.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-09", "description": "This is a good place to pick up a fast, inexpensive, relatively healthy dinner/lunch, when you don't feel like cooking. The food is good, the portions are large and the menu is pretty extensive. \n\nWe like the schawerma sandwich and dolmas. The only thing I have been truly unhappy with from S685 is the \"rice pudding.\" It's a kind of bland, firm, gelatinous substance that isn't particularly sweet or creamy or resemble rice and/or pudding in any way. \n\nOverall, I'm just glad to have an inexpensive Mediterranean place in my neighborhood.", "author": "rachel m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-25", "description": "3.4 stars. We were starving. Originally, we aimed to go to Holy Grill because I've been wanting to try that place and we were in a burger mood, they are closed on weekends! Boo.\n\nSaffron was really good, fast, fresh, sour lemony flavor, hot food, busy, but not too crowded to enjoy ourselves.\n\nI think the only downside for this place is the price. The chicken kebab plate cost a whopping $17 (I'm pretty sure this was the price, I know it wasn't cheap). This is a serve your own utensils and tables type of place. Tis good, yet saffron doesn't come cheap.\n\nThe amount of food per plate was fantastic, I guess you pay for the amount, right? Right. Service was pretty good. I want to go back and will keep it in my phone, yet the price will make me think a few times before choosing it.", "author": "Lorrie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Very, very delicious Mediterranean food.  Expensive, but delicious.\n\nOh, I love this place.  If it was reasonably priced, I would come here all the time when I decide to go out for lunch.  It's healthy, it's delicious, it's never crowded, it's great.\n\nThe lamb shawerma is GREAT, and the combo plate is awesome.  I LOVE the moujadarra (bulgar wheat and sauteed onions), the falafel, and the tzadziki.  The pita and hummas are also good.  When I come here, I usually come with a friend and we share the lamb shawerma plate and the 3-appetizer plate.  Eat with your hands.\n\nDELICIOUS!\n\nOMG the baklavah....VERY good.\n\nThe guy who is here for lunch is not very friendly, and doesn't really excel in the customer service department, but just don't expect anything more than someone taking your money and giving you food and you won't be disappointed.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-20", "description": "It's always nice to see an office-worker lunch spot that offers lots of couch and floor-cushion seating, as if daring people to kick back for a bit and enjoy their lunch.  Nobody was taking them up on it, but next time, I'm totally doing it.\n\nJury's still out on the food.  I had a falafel wrap which was ok but in retrospect the veggie kebab wraps looked much more enticing...perhaps I was scared off by the 10-12 minute cook time.\n\nService is attentive and they have a lot of interesting though pricey mint drinks.  (In fact, priciness in general is the one flaw here).\n\nSo, all in all, I'm intrigued but not yet sold on Saffron.  I'm sure to be here again though, so I expect my next visit will make or break things.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "Okay, I respect this place even more.\n\nThey sent my friend an apology and an explanation so I will give them their deserve star-age.\n\nLike I said, their shawarma (haha! yes I know how to spell it now!) was still out of this world (I actually recently tasted one from a 5 star hotel... I missed Saffron's shawarma plate oh so dearly). So yess. Hopefully, They won't run into the same snags again because I can see Saffron becoming a huge hit to everyone!", "author": "Gabe R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "This place is clean, quiet, lots of places to sit, really great staff, and delicious food!!!\n\nWhat else is there to say?!\n\nI've eaten here twice now, once I ate in, and once to go.\n\nThis place is great if you want to catch up with a friend you haven't seen in awhile!!!  There isn't loud music or really loud kitchen noises to compete with...  Awesome....\n\nAgain, the staff is great.  The gentleman working there isn't over-the-top, which I actually prefer.  He's kind and patient, and as I watched him prepare our falafel sandwiches, I realized he is fantastic at making falafel sandwiches!!!\n\nThe falafel are really good, and my half-Lebonese boyfriend is very critical of falafel....  and HE liked them!!!\n\nI also recommend the mint lemonade...  i want a gallon of it.\n\nPrices aren't too bad either.\n\nGo there now!", "author": "Jess R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "Excellent food, very tasty Middle Eastern dishes that included a few vegetarian choices. The hummus was not the usual oil and garlic stuff served at many other places but had a good amount of sesame tahini. Roasted vegetables have a delicious dry rub. \nThe cafe is set up as more of a \"lunch-type\" place wherein one orders from a counter and then chooses a table. However on Saturday night the waiter came to our table. My party of 3 and were the only active clients, though one woman sat at a table reading a book--sort of what you'd see at a cafe.", "author": "Francois T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-23", "description": "My coworker said it was not so great but I tried it anyway. There's not much around 8th & Townsend so my choices are limited as far lunch.\nShe was right. My lentils were way too salty, even for me.\nMy chicken kebob was not cooked all the way. Besides that, it wasn't terrible but not worth the $13 and the ridiculously long wait. This place has a lot of potential but the slow service not yet refined menu need some work.", "author": "Rebecca R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "Ambiance - quite cute. Low tables on one side, with large, warm- colored pillows on the floor.  \n\nFood - I had the Meze platter.  I chose the Falafel, Hummus and a side of Chicken Kabobs with Flat Bread.  All very good.  My hubby and our friend both has the Lamb Shewarma and they both liked it.  \n\nPrices - Affordable. Good bang for your buck. \n\nService - The manager's tone was a bit brash and condescending (minus one star), but I guess that's fine when the restaurant set-up is more cafeteria style.", "author": "Clarice V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "I stumbled upon this yummy establishment a few months back, while waiting for tha 10 bus.\nI had a Falafel Wrap and Baklava. I could live on Baklava, and it did not disappoint.\n\nThere is not a ton of options of places to eat near this part of town, so I was glad to remember they were here while seeking a place for a quick meeting.\n\nMy friend Diana and I got a combo of sorts where you could pick 3 sides. We chose Baba Ganoush, Hummus, and their Homemade Fries... MMM!  \n\nI washed it down with a Mint Lemonade (tre Unique!) and she a turkish coffee.\n\nI will surely return. Next time I am trying their Gaz (Nougat w/pistachios & rose water).", "author": "Kellie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "Love this place!  My wife and I come here pretty regularly - everything is delicious but our favorites are the schwarma and dolma. From two people who love Mediterranean, we think this place is delicious!", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-25", "description": "I live and work in a loft around the corner from 685. There's not been a problem with finding local lunch fare when I'm so inclined, but the number of  dinner spots in a two block radius has been zero. Until now.\n\nAs others have observed, the lunch lines are often out the door (ah, the first week before 685 became known) and for good reason. The menu is not duplicated anywhere in the immediate area and the food is well prepared. So far, at dinnertime, there's no wait at all. Not surprising, considering the techies flooding the place at lunch seem to be home for dinner.  \n\nSome of the food is displayed cafeteria style, so if you're not sure of what to order, pointing is a popular option. This presentation may not help the first impression of ambiance, but many of the tables are around the corner and out of sight.\n\nService is friendly--the lunchtime order taker knew my name on the second visit--, the ambiance warmish--love the low rise tables--and the food quite good. My personal favorite is the mojjadara, lentils topped with caramelized onions; this is comfort food to me and 685 does it well. Make it a third of your meza plate and lunch is $7 plus beverage. \n\nThe lamb shawerma is excellent; I just finished the $11.50 Shawerema Plate and found it warm and filling. More than I would eat for lunch and certainly more than I'd pay for lunch, but just fine for dinner.  Dessert-wise, the konafa is excellent and the sesame cookies tasty. Try the pomogranite spritzer when the weather gets warmer; right now, you can't go wrong with the mint tea or spiced cocoa. \n\nWelcome to the 'hood, Saffron 685!", "author": "Lance H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-19", "description": "Mediocre food.  Incredibly rude person behind the counter who refused to add a little more sauce to my falafel.  $8 minimum credit card order, when a falafel is $7.12.\n\nThe guy in front of me said he wouldn't be back.  I think I'll be doing the same.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-31", "description": "The wraps are great.   The food is good and fresh overall.  The guy who works at the counter, the owner I presume, is rather unfriendly though and really needs to work on his customer service skills.  That being said, it's a good place to get quick good food.", "author": "Paul A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-07", "description": "Update for 2008: I've gotten lunch here 30+ times over the past year, typically one of their delicious wraps. They are a finely tuned machine at this point. The owner / head cook is a nice guy, appreciates his customers and is super committed. Still not a fan of the inoffensively blah atmosphere, but this place works without it. A great option for fresh and reliably good Mediterranean food.\n\nOriginal review:\n\nThis place seems to have a bit of a bad (w)rap so to speak. But I think it's a perfectly fine lunch option for the neighborhood. I'm no falafel/shawarma/kebab connoisseur but they seem pretty solid. Tasty and healthy and pretty reliable. I regularly stop in when I'm in the mood for not-burgers/Pazzo.\n\nWhen they first opened I remember my coworkers complaining about the wait. But if you think about it the same is true for every other place. Pazzo and Holy Grill sometimes make you wait 20+ minutes and crank out orders non-sequentially*. You just notice it more here because the open kitchen is right in front of you so you can scrutinize the two guys behind the counter and play armchair manager. Anyway, I go slightly after the main rush so I haven't experienced much of a wait at all lately.\n\nAnd the people are really nice. They even brought my order over to me while I was browsing next door the other day.\n\nDon't know if I'd go for dinner though... the atmosphere in the back seems a little strip mallish. Well, I guess it is in a strip mall.\n\n*Obviously I'm in geeky work mode right now.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "Went with a friend who's married to a Turkish woman and he knows his Mediterranean food.  We both ordered  the pleasantly surprising Lamb Shawerma.   Nice service.  Somewhat pricey.  \n\nDefinitely nice decor with pillows on the floor at some tables.  \n\nA great option for this area.  Will definitely make this a regular lunch spot.", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-19", "description": "Ok, so I'm really not a big fan of giving not so great reviews.  But Im Im less of a fan of over priced food.  \n\nAre you serious? 9 bucks for that little \"sandwich wrap\"?? I thought they would be a good size..but no...they are small for what you pay for. I really have NO problem paying 9 bucks for a good wrap, if its big!! \n\nMy friend also ordered the chicken wrap, but she cannot eat hummus, so she had to order hers without, leaving it very dry.  She wanted just a very small side of the yogurt sauce to dip it in, so it would not be so dry.  FOUR bucks for a little side of the yogurt sauce.  She didn't want a whole DISH - just a side. Dude...seriously?? (and it takes them like 5-8 minutes to wrap one little thing- quite the technique - let me tell ya. Get a clue from the local burrito wrappers. They'll get that thing to ya in 30 seconds flat!) \n\nFood had good flavor and their couches are sweet - just a bit too pricey for what you get and a little slow.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "One of my favorite go-to places to get a lamb shawarma, tabbouleh, and a Turkish coffee. You can tell the owner is meticulous by the way he lines up his soda cans, so speaks volumes to the quality of the food he serves.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-21", "description": "their desserts are good.  especially the konafa - it's shredded filo like pastry with cheese & orange blossom water and pistachio's on top. YUM!\n\nthe hot cocoa is good too, it's spiced with cardamom.\n\nI have to try their french fries with saffron or balsamic aioli.  update soon.", "author": "kulas a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-10", "description": "My partner and I came in at happy hour to grab a quick bite. After ordering some dolmas and tabouleh the guy at the counter assumed we would be taking it to go. When we said no he awkwardly / rudely stated that he couldn't seat us due to a reservation. Fast-forward an hour later... still empty. Although the food may have been palatable the service was not.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "Great food. Really liked the falafel. Reasonable prices. Very clean and fun atmosphere. Good place for lunch.", "author": "DeeJay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-08", "description": "This is one of the better Mid-Eastern restaurants in the city.\n\n- Moroccan spiced hot cocoa\nDon't miss this. Deliciously flavored with cardamom\n\n- Turkish Delight\nThese delicately flavored, gelatin type of candy that reminded me of a pate de fruit that are rolled in powder. Several flavors come with an order: green cardamom, pink rose water, orange water. lemon and a brown sqare that tasted like molasses.  \n\n- Konafa\n\nThis pretty, tasty, buttery dessert of orange shredded pastry sprinkled with chopped green pistachios on a cheese base and flavored with orange blossom water is made in-house. \n\n- Manaesh\nThe manaesh is house-made bread that looks like a pizza and is  topped with olive oil & za'atar. I liked it.\n\nI'll be back to try this more at this great new restaurant.", "author": "Rworange X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "No Mellow Yellow! This place had the rudest worker EVER! Like the soup nazi, we were astounded how overly nasty this guy treated us. He basically tried to talk us out of ordering food there, wouldn't let us sit down to eat in an almost empty restaurant, wouldn't give us a cup of water,  wouldn't give us chili sauce for our falafel...and even asked us if we were \"from the East Bay?\". Who does this? What crap!!! Boycott this place if at all possible! Underwarmed food, crappy attitude. Too horrible for words. Never again.", "author": "anne s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "Great place for lunch!  They are quick, convenient, friendly and fresh.  I love the lamb shawerma and falafel wrap as well as the mediterrarean combo plate & kebab salads.  The latkes are good too.  I try to venture out on the menu more but can't seem to shake my favorites so far.  Another plus...I usually find metered parking avaliable on the street!", "author": "Martin I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-08", "description": "This new Mediterranean place has fantastic food.  I got the Meza plate, which is a sampling of any three sides or salads.  Everything was really tasty and it was great value as well.  \nI loved the decor in the place.  It is very airy and the tables are spread out.  There are a few low tables with cushions at the back.  \n\nThere were a few downsides to the place:  firstly, while the service was fast, they forgot several things we ordered.  We had to go up to the counter to remind them we had ordered drinks and a couple of side dishes.  Also, the desserts were not that great.  If it weren't for these two things, I would have given it 4 stars.\n\nI would definitely go back for the main dishes-yum!", "author": "Emma M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-22", "description": "I actually like this place because the food and the menu as a whole is interesting.  I'm hesitant to give it more than three stars though because this place still has a few kinks to work out.\n\nFirst, what's good:  the food is very flavorful and it's great to have mediterranean cuisine in the neighborhood.  The falafel has a decent crunch.   The fried potato cakes are very tasty.  The falafel wrap is filled with a nice variety of ingredients and then it's briefly toasted on the outside, which I like a lot.  Customer service at the cash register has improved in tone since they first opened.\n\nNot so good:  as others have mentioned, prices are on the high side.  I understand they are in a brand new building and probably have high rent, but it does preclude me from eating here more often.  While, on the whole, I enjoy the falafel wrap, for some reason the little strips of eggplant they put in there had tough skins one time, which I had to pick out.  Finally, every time I go, there's something about the atmosphere that's not warm and welcoming.  Perhaps its the lack of natural light in the back.  Perhaps its the doors being always wide open.  Maybe if one or two of the staff was more conversant with the customers, that would do the trick.\n\nThis place has potential to be a really great lunch spot.  I'll be back, but maybe not for a few weeks.", "author": "Mason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "I love it here.  It's the perfect pre and post workout meal.  My favorite time to come is around 5:00 when I'm getting off work and about to go to the gym on 9th and Brannan.  I'm suprised their dinners are not busier since this is such good, light, flavorful food.  Lunches are crazy with lines out the door, so beware.\nLots of vegetarian options for all you veggie's out there.  Try their veggie kabob plate.  It rocks.  Fresh eggplant, squash, onion, tomatos, and mushrooms grilled to perfection.  There are many places that serve Greek and Mediterranean food, but Saffron 685 blows them away.  Nowhere else in SF can you get this quality of food for their low price point and beautiful enviroment.", "author": "Vang L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-09", "description": "I came here with my coworker for a Monday afternoon lunch.  The place was pretty empty with only two other tables having customers.  This was pleasing to see because I was pretty hungry and hoping to get my food quickly.  I had the Lamb Shawerma and my coworker had a Falafal Plate.  I would rate both dishes at good, but nothing spectacular.  My lamb was cooked perfectly and my wrap had the right amount of moistness.  I really dislike dry Mediterranean sandwiches.  I thought that the tabouleh and tahini salad on the Falafal plate were very flavorful.  Overall, I think this place is good, there is nothing extraordinary about the food but it's good nonetheless, which in my book deserves a 3 star rating.  I would recommend this place for weekday lunches.", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-21", "description": "The food is average....very average.\n\nAlso, the review below is correct, the guy behind the bar has the personality of a dolma.  I have been here twice and experienced the same level of service both times.\n\nBoth times I have been there the place has been totally dead, which is strange because the surrounding restaurants were busy.  Anyway, if you're starving and only interested in Mediterranean food, then take a try.  But don't expect to be blown away.", "author": "Vanessa Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-03", "description": "If I could sit all day and stuff my face with their red pepper dip and beet root salad (with a swig of water every 15 minutes to clear my palate), I would.", "author": "Carina M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-09", "description": "As we know, the new code work for Middle Eastern Food is now \"Mediterranean\" so as not to scare mainstream patrons off. The codeword sometimes can confuse people as one may expect Greek food, Italian food, etc. This place is MIddle Eastern. That means falafel, chicken and beef kebabs, hummus, etc is offered. Now, the fact that a rude Ukranian server with no customer service skills is your point person can be a problem. However, ultimately, when your chicken kebab sandwich wrap has one small piece of chicken with potato and tahini sauce as filler, you should be concerned. Especially at a ridiculous price of $9. The sandwich wrap was cold, the service was rude, and when I complained that I only received a small chunk of chicken kebab, the Ukrainian cashier/service just shrugged. Now that's more Soviet than Middle Easter/Mediterranean. What a bust this place is.", "author": "Raffi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-30", "description": "Finally!! I have finally found a place in SF that serve decent Tzatziki (or as this restaurant spells it: Tzazekee). Well it only took about 2 years to find it.\n\nI had a quick late lunch with Tzatziki, Pita bread and Pomegranate spritzer and a few nibbles of the Chicken Kebab Plate - it was all good. I'll be back that is for sure.", "author": "Sofia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-18", "description": "After a bit of furniture shopping, I was famished. I needed to eat STAT. Saffron 685 was just around the corner and I am glad to say it saved my life. There wasn't very much around for us to choose from in terms of places to eat. So going in to Saffron 685 seemed like a no brainer. \n\nTHEY TAKE VISA CARD.  Though this may not be apparent when you first walk through the store. It is indeed an establishment that caters to those who never carry cash.\n\nI ordered the Chicken Kebab dish. It was grilled and came out wrapped in a breaded / pita shell. I thought it was absolutely delicious.  It could have been that the taste was a direct reflection of how hungry I was. Though this could be a possibility, I will have to say that my meal was yummy and I won't doubt my hungry stomach.\n\n.", "author": "Jane D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-09", "description": "I have only had the falafel wrap here so I probably need to try more items to get a full picture of this spot. The first time my falafel was pretty good. A little bland but okay. The second time I ordered from this place my falafel was really bland. The hummus and falafel were really underseasoned. I was disappointed. \n\nI love Mediterranean food so I have to give this place another chance. There are limited ethnic food lunch options in this neighborhood so I hold out hope that it was just an off day. Seems like Yelpers like the meat offerings for the most part so I'll try something different next time.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-10", "description": "Ate here once, don't really feel like going back.\n\nLamb kebab was dry and the menu selection, paltry.\n\nFeel bad because they are one of the only restaurants around this neighborhood that is not owned by the Mission Bay Foods Empire.\n\nIf you like it, keep going. If you haven't been, try it once, but you won't be missing anything if you don't go.\n\n(And I can't believe about what happened to Steve S.!)", "author": "Rey T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-20", "description": "Finally a decent place to eat around this area!  The prices are fairly reasonable, the service is not bad either.  It's not one of those sit down and order places.  Rather, you order at the counter, give your name and wait at the table.  Then one of their employees will call your name and bring your food to the table.  \n\nWe ordered the falafel sandwich and the lamb kebab sandwich along with a pistachio baklava.  The lamb kebab sandwich was quite tasty, although it could have been better with a bit more seasoning.  But overall, it was very refreshing.", "author": "Selene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-04", "description": "Saffron 685 is one of my favorite restaurants in San Francisco.  The atmosphere is comfortable and the staff friendly.  The food is clean and tasty and the flavors keep me coming back for more.  The salmon plate is one the best I have had anywhere in town.  Plenty of choices for vegetarians and meat lovers alike.  You wont regret trying this place for your mediterranean cravings.", "author": "Nikki P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-22", "description": "There is a reason why this place is empty after lunch.  If you order dinner it is likely that you are having the lunch they made earlier reheated in a microwave.  But the food is still not that bad.. the main reason why people should avoid this place is the horrible service.  I seemed to blow the mind of the guy working there when I asked for a plastic bag and a napkin for my to go order.  I doubt this place is going to survive another year in its current state.", "author": "Amit P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-08", "description": "I've been coming to Saffron for years, since the company I work for moved across the street.  What keeps me coming back in particular is the shawarma, whichever dish you order it in.  I also order from them whenever I need catering for the office, and in either context, the food is always exceptional and the service is personal.  It is definitely the best restaurant in the area, so when I don't get my lunch there it means I've brought my lunch from home.", "author": "Marie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-10", "description": "I finally got away from my boss for an hour a day for the past two weeks, and chose to retreat to Saffron.  I loved the decor, the people are super friendly, and because they are one of our customer's too there was extra special attention paid to me.  Everyone who works there is observant to customer needs and seems to read your mind when you need anything at all during the meal.\n\nTurkish Delight is delicious, as is the cucumber salad, the pom spritzer...aw, heck, EVERYTHING there is good.  Allow more time for kebabs and prawns.", "author": "Jo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-28", "description": "Falafel wrap was super dry and tasteless.  Service was extremely slow.  Charged me almost $5 for yogurt that I asked for since the wrap was so dry. Will never go back.", "author": "Cheeks C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "I've been dinning at Saffron 685 for years, as an admirer of middle-eastern cuisine and also a 1/4 Syrian descendant I find this place quite honest to its heritage. Coming from a country of immigrants with the largest Syrian-Lebanese community outside those two countries, more than 6 million and their direct descendants, I believe I have the knowledge to elaborate over the subject.\n \nI've tried their falafel sandwiches, shish kabob plates, humus, baba ghanoush, they are all delicious and above all the ingredients are always fresh. The shish kebob is served the way I like it - grilled with lemon in it, where I came from the Lebanese grill with lime - even better. But I've noticed lately the shish kebob plate is being served in smaller portions. I love the humus prepared there, they don't add garlic and you can actually taste it the way it's supposed to be not like other middle-eastern restaurants in the city where they add tons of it - a trick done to disguise the stale taste of days seating in the fridge. Usually I eat my hummus traditionally, soaked in olive oil, I always have to ask for it, they avoid serving that way because like salt you add at your own discretion. The baba ghanoush, my favorite, it's smoked to perfection with the right amount of tahini, I can eat a whole side order (fairly sized) with pita bread in one seat. The tabbouleh salad is really well balanced, I always judge on that, if they cannot get it right, mind as well shut down the business.  \n \nThe owner has been venturing lately into soups, I find them unnaptizing, they are too thick (puree style) to my taste. I think he is trying to cater to the American palate - they love porridge soups. Once I tried the red bell peper lentil soup, but the owner had stepped out for couple of hours and his staff served the soup luke warm - I was already skeptical, you can imagine my reaction.\n \nI noticed last time I was there (a week ago) they have torne down the menu from the wall, I asked why, and found out they are reformulating the entire menu. Let's wait and see what kind of delicacies will be coming out of their kitchen - I bet they will be tasty, the chef/owner is well versed in the kitchen.\n \nRegarding the individual menu, the lay-out needs improvement. All the dishes are crammed on one side of the menu with plenty of room on the other side just for beverage and dessert. Honestly, not even with reading glasses I could discerned the lines, and the poor choice of red ink made it worse to read.\n \nAs for the ambience, the place offer all sorts of seating and tables, my favorite are the lower tables and cushions in the back. It's probably the most clean restaurant in the city, you can eat off the floor, the owner always display with pride its 100 points SF Health Department gave to the establisment - it's been that way for years. They also have a good selection of ambient music playing at all times, jazz, blues, bossa-nova, never heard though classic and/or contemporary middle-eastern music - I wonder why ? \n\nI might be reviewing this venue again later to five star - it will depend what surprises in the future they will have fresh out of the oven.", "author": "Marcello C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-28", "description": "Many of the reviews here are accurate.\n\nIn short: relatively short wait time, good food.  Cost too much.\n\nSaffron 685 employees:  We can't afford to eat there regularly!\n\nI've ordered lunch here, on average once every two weeks, since they opened.  I enjoy their food.  I can't compare it with other mediterranean food.  Here's something I've noticed over time:\n\nI walk by Holy Grill to get here.  Holy Grill's packed, and this place is practically empty.  The ONLY reason I can think of is the price.  The woman at the counter (haven't seen her the past couple times) is overly / oddly friendly, and I know some customers might be turned off by that - but not enough to just not go / return after all this time.\n\nI always order either the Lamb Schwerma or the Falafel wrap, because they seem to be the most cost effective.  I order them to go.\n\nMy coworkers never go to Saffron 685 because of the cost.  After reading the reviews here, I know it's not just us who feel that way.\n\nI noticed that the quality has improved over time.  At one point, the falafel wrap was dry, and you could feel, carrying it out, that it was light.  A few weeks later, it was much heavier, and that's because they added more ingredients.\n\nAlthough I enjoy the lack of crowd, I don't understand why they haven't lowered their prices or at least considered introducing one of those cards where you buy 10, get 1 at a reduced price, or even free of charge - it seems like they have potential to attract a lot more customers.  They don't have much competition - and I'd really like to be able to choose from more items on their menu, without spending half of my week's lunch budget in one day.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Sweet and simple. The food was good, service was fast, it's close by.", "author": "Teresa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-20", "description": "Great little Mediterranean I actually found through Yelp! while I was in town.  We were the only patrons (late lunch) and the guy working was really friendly and helpful. We had a good spread of different things and, though a tad pricey feeling given then aura of the place, they were all very good.  If I were a local, I would definitely frequent (as much as I could afford).", "author": "Justin F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-08", "description": "What's their problem?  I had a short lunch window and dashed down here for food but left after 20 minutes of waiting - for a takeout chicken kebab wrap!  The sooner they go out of business and vacate, the better.  No wonder this place is virtually empty while every other place nearby has a line out the door.", "author": "Jan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "Saffron is a find! Ziad makes beautiful soups and healthy Mediterranean delicacies. It's one of our favorite dinner spots. The kabobs are perfect, the seasoning on the salmon is fabulous, and the salads and sides are excellent. Wine by the glass available now, too. Super clean place, nice desserts. We've always found Ziad to be friendly and engaging, a really nice guy running a really good place.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "I work on the other side of the freeway from the Division traffic circle into which Townsend flows. One day, I decided to stop treating the freeway like an international border, and wandered over to check out the lunch options on the other side.\n\nSaffron 685 was the first place I tried, and I've become a regular since. The owner is friendly and cares about the food (he makes his own shawarma, rather than buying shawarma-in-a-drum from a distro). It's not cheap, but this is San Francisco and in a new development; I'm sure the rent is eye-watering. The interior is warm and charming, and a very good use of a very industrial space. It can get a bit zoo-y at lunch (the only time I've had imperfect service there was during the lunch rush).\n\nThe mint lemonade is wonderful, too.", "author": "Christophe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-25", "description": "The food here is exceptional for the price you pay. I especially recommend the lamb kebab and prawn kebab plates. All the food is prepared well, tastes fresh, and is very tasty. Unlike some of the reviews here, I find the owner of this one man operation to be very friendly and I find the service to be outstanding.", "author": "Zachary K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-31", "description": "This is a nice little lunch spot in my neighborhood.  I always order a chicken kebab wrap and some dolmas and I am set for the day.  They make everything fresh - which is a huge plus in my book.  Everything is great quality and the prices aren't too bad.", "author": "Cherlyn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-29", "description": "Maybe this guy was having a bad day, but that's no excuse for treating customers like crap.  Actually being treated like crap would have at least acknowledged that I was a customer instead of completely ignoring me.  On top of that the food was bland and unsatisfying.  I ordered the chicken kabob salad, which had about as much flavor as a rice cake.  Based on similar reviews I am not alone in my opinion on the quality of food and service.", "author": "Roberto L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-03", "description": "Since I work in an isolated area of Mission Bay, there aren't too many options for restaurants to choose from.  You would think that all the restaurants would be great, but this one is only so-so for me.  I typically get the Lamb Kabab plate.  It's pretty good considering what it is, but over time, I've noticed the size of the kababs slowly shrinking in size.  I'm sure they are cutting their portions smaller, but come on!  The lemon wedges on the skewers are larger than the lamb at times!  The dolmas and the hummus have great flavor as well.  I just feel that for the price, you would expect something more filling.  You could easily spend $15-$20 and walk away thinking \"eh, I've had better.\"", "author": "Mark P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-14", "description": "Wayne and I were here about a month ago and we were the only ones in the restaurant on a Saturday night. The food was very San Francisco priced but the quality was just too bland for my taste. All the flavor was served in side \"salad\" dishes that you could blend into your meal to your palate's liking, but to me that defeats the whole point of dining out. Only real perk: probably the best baklava in the Bay Area I've had the pleasure of eating.", "author": "Selina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "I had ordered to-go a few times and dined in once at this restaurant because it's pretty close to where I live. Their service here is very good since they don't have many customers during weeknights. Their food are all freshly made, and my favorite is the Latkes. I agree that the interior needs more attention, but it is the perfect place to order to-go for dinner when you're feeling lazy!", "author": "Bee T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "This is a nice casual place with really fresh and tasty food.  I just got back from here having had their prawn kabab plate with a side of tzatziki, and it was very good.  The only strange thing is how deserted this place is in the evening.  I suppose that's just because of the area.", "author": "Robert P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "This seems like a very different lunch spot, with nice decor, spread out tables, and even some low tables and cushions to sit on at the back of the restaurant. Anyway, as some previous reviewers have noted this place is a little pricey especially the sides. Personally I wonder if they halved the size (and price) of the sides they might do a little better. Anyway, I just got a lamb shawerma sandwich which was excellent but I decided to drink water and forgo any sides. The sandwich was huge and full of lovely lamb, tomatoes, yogurt, I might have even got a little tzatziki. Anyway, it makes a change from the holy grill.", "author": "Karl L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-04", "description": "Love their shawerma wrap, worth 3+ stars, actually. Have had it both for lunch and dinner.", "author": "Kaj HeGe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-03", "description": "This place is probably a 3.5 star join. I will round up since they are in my neighborhood! I've had the Falafel wrap and also the lamb shawerma wrap. Both were very good, better than other Greek style places I have tried in this area. My only knock is the pricing because this place is expensive. Other than that you will be pleasantly full after leaving!", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-14", "description": "I don't always order a falafel when I enter a Mediterranean place as I am a lamb lover. However, I just had their falafel sandwich today and it was the best I have had in recent memory. In addition, to the quality the service was delightful. I am going back soon.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "Great fresh homemade & authentic mediterranean cuisine. Try the grilled chicken and the lemon aioli (homemade) - it's the best. Super friendly service too. Yummy.", "author": "Raoul R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "The falafel plate was okay, but I found the falafel to be very hard and crunchy. I don't like it quite as browned/hard fried as they served it. I also thought the hummus was bland. My friends got the lamb schwarma and enjoyed it, so I will probably try that next time. The french fries were good and the balsamic dipping sauce that came with them was very good. As for the drinks, I had lemonade (decent) because they had diet pepsi but no regular pepsi. Um, what? Bizarre.", "author": "Kellie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-28", "description": "It's nice to have a Mediterranean place so close to Potrero Hill. The food is made with fresh ingredients and not too heavy or greasy. The lamb plate is great and so are the shwarmas.", "author": "Oliver O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-17", "description": "Not the best Chicken Kebab sandwhich I've ever had, but not terrible. The inside of the place was nice and the people were friendly. Not the fastest service I've gotten.", "author": "Lacey R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-20", "description": "the salads are really great and fresh with nice citrus and spice notes but most of the meat I've tried isn't the best. The lamb, while flavorful is tough and the chicken tastes like it was loaded down with solution at the factory. oh and the falaffel is re- fried and rubbery with an acrid flavor. Truly Mediterranean on 16th smokes this place.. it's the small things like putting onions and tomatoes near the base of the meat spit soaking up the warm juices.. or how they grill the bread nice and crusty each time for the flat bread sandwich's..but the thing is that it's the only game in this part of town and by default it's a good choice. the price is right, the guy behind the counter is friendly and it's comfortable. ehh", "author": "Stephen G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-19", "description": "i went for lunch the other day and it pretty good.  the falaffel was very tasty and cooked perfectly.  The cucumber salad was delish and fantastic w/ the shawerma.  That shawerma sandwich itself was only okay.  the lamb was good, the skill w/ which the sandwich was made was great as well.  what i didn't enjoy was the hummus in the sandwich.  i thought it was a bit dry, like it needed a little more tahini and maybe some olive oil.  i'm willing to give it another go, since i live around the block, but i will ask for baba ganoush instead of hummus and see how it is.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-05", "description": "The guy behind the counter has the worst attitude, which makes it a chore to go back there (and it would be so convenient since I live in the same building as this restaurant). Their falafel is dry anyway. I cannot recommend this place.", "author": "Corina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "When you walk in, you'll notice right away that there is a lot of space.  The decor is pleasant and almost zen-like.  I ordered their Falafel and Hummus plate which was really good.  The salad and vegetable sides were refreshing with just the right amount of spices.  You get a good amount of food for the price you pay and the service is very friendly.", "author": "R B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-10", "description": "Love this restaurant and what a great space!  It's packed at lunch but it would be a perfect place to hold a birthday party for dinner.  A friend and I just went there for dinner and it was fantastic!  Fresh, high quality ingredients and reasonably priced.", "author": "Juliana X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-11", "description": "There are many great places in Europe that offer Shawerma and kebab, London, Paris, Vienna and most cities in Germany are full of such great places. We were missing one here in San Francisco. Finally we have one. \nI live close by and have been to Saffron many time. The food is Delicious and staff are very friendly. If you go around lunch time you see how popular the place is. Dinner is great too, great place to have long conversation with friends and enjoy wonderful food.", "author": "Amir B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-18", "description": "Saffron is unquestionably overpriced, but the food is really quite good.  I typically get the falafel plate, and I'm quite satisfied with it.  From general observation it seems that the plates tend to be a far better value than the wraps or any of the appetizers.\n\nUltimately, the most frustrating aspect is probably latke pricing: they are so ridiculously overpriced that I only get them about one in every ten visits.  Which, to be honest, is probably better in the long run!\n\nA good spot for lunch, or really any time.", "author": "Patrick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "I went to this place lots of times and every single time I enjoy it! I am a vegetarian and even though I found lots of great food to eat at Saffron like veggie wrap or meza plate! It is nice atmoshere, helpful staff and delicious food! Oh, and which is really, REALLY important for me- this place is VERY clean! So, I will definetely go back over and over again!", "author": "Yulia E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-11", "description": "I found in love with this place!\n\nFood: Flavorful, made with high quality ingredients and because everything is fresh and cooked to perfection, the menu advises that kebabs may take 10-12 min...Everything looks and smells delicious, the diner plates are generous and I would personally recommend the prawn kebab plate but don't hesitate to ask for recommendations. The sweets and fresh drinks are also a nice treat.\nI ordered some items for a party and everybody loved the food!\n\nAmbiance: Decorated with taste and feels warm and cozy. Good sound system without having the music killing you. Works well if you're alone, on a date, with friends or co-workers. You just have to choose what works best for you: the chairs/tables, sofas/tables or the floor pillows/low tables. The place is big and has large tables for groups.\n\nAnd finally, everything is super clean!", "author": "Caroline B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-14", "description": "I went here after checking in for bay to breakers because it looked decent. The chicken in the kebab we bright red and raw. Pretty dam gross.", "author": "Jacob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "not bad...came here the other night for dinner and there was no one in there, except the guy behind the counter.  the wait was a little long seeing as how there was no one else in there, but it was worth the wait.  the food was fresh and delicious and the service was with a smile.\n\ni'm glad i live close to here so i can grab some takeout!  try the mint lemonade...mmmm!", "author": "cindy c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-06", "description": "Had the lamb shawerma plate, and it was quite good!  The meat was delectable, I got the perfect amount of everything: hummus, rice, tabouli.  Love the decor, cushions in shades of red and orange, and low tables as seating.  Do wear the stretchy jeans, though.", "author": "M. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-19", "description": "Good atmosphere, friendly staff, and a large portion size.  You'll pay more for the bigger portions, but it's proportional (150% the price for 150% the meal).  They have a good selection of food, more than your typical Mediterranean place.  Not an amazing amount that is vegan, but enough for me.", "author": "Nessie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "nummers!\n\nthe first time I tried Saffron I ordered the shawerma plate.  having been back a half-dozen times since, I still haven't ordered anything *but* the shawerma plate.  it's really that good.\n\nI live nearby, so I have the luxury of eating at saffron during non-peak hours.  I've been in one time during the lunch crush -- and it can be pretty freakin' busy (for good reason).  best to side-step the crowd and go in a little later if you want to avoid the friction.\n\nnice folks working here too.  it's a welcome addition to an area that needs more restaurants.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "Always reliable, the main guy that works there is quite nice and so are the people that work for him. \n\nI usually go for the Metza plate, 3 choices plus bread for 7 bucks. \nCan't go wrong. :)", "author": "Brendan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-08", "description": "Ordered the lamb schwerma sandwich and dolmas. They were outstanding! Lunch was $38 + tip for three people, so not cheap but not bad. But well worth it!", "author": "Jared G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-26", "description": "Eh. It's ok. Totally hit or miss. The wait is LONG, the pricing structure makes no sense whatsoever ($6.50 for a falafel wrap but $4 for a side of fatoush salad?), but it's near work and the food is usually pretty good.", "author": "Emily E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "We live near by and love this place. WE find \"the guy behind the counter\" to be nice but most importantly interested in the quality of his food!  We recently held a large dinner here for about 20 people and MR. Z was so helpful in planning the menu, making sure we had the right amount of food and adding some nice extra touches. It is also great for kids (we had 6) as it is fun for them to sit on the cushions and eat at the low tables.  Favorites include the falafel (always fresh), lamb kebabs, shwarma and of course the always fresh baklava.", "author": "Tia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-13", "description": "The wraps are a good deal! I especially liked the shawerma. The falafal wrap is delicious and vegetarian! You can't tell how big it is inside from outside. Nice atmosphere in the back.", "author": "Edward J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-30", "description": "I've eaten here a few times and it's solid Mediterranean fare. The lamb shwarma sandwich is my favorite (extra hot sauce, of course!). I also like the grilled chicken skewers and all the side salads, like hummus etc. and the konafa (sp?) dessert. Actually, I haven't had anything bad here. I hear it's quite busy at lunch time due to the office buildings surrounding it. I eat here in the evenings or on the weekends, and it's pretty quiet and mellow. Another good spot on a good block (see also Holy Grill).", "author": "Boss H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-14", "description": "I just got back from Saffron 685 and after finishing my chicken kabab wrap thought I would post my thoughts. This place is GREAT! The food is amazing and the restaurant itself has a great vibe with nice decor, high and low tables and pillows throughout. I've taken a group of coworkers and clients there in the past who all thought the food was delicious as well. (and the Hummus is to die for!) Always fresh, well-prepared, fabulous atmosphere - Saffron 685 gets my 5 stars!", "author": "Greg Ciro T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-04", "description": "They have some of my favorite options for drink, like Reeds Ginger Ale and Pomegranate Spritzer made with Pomegranate Juice and club soda... The spritzer is $3.50 though.  The service was good but not the friendliest... are we in New York or something ? I will go here again though..Food was overall, tasty and healthy. \nSee a video of the place @ http://sf-lunch.com/2008/02/12/saffron-685/", "author": "SF Luncher z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-20", "description": "I eat here on average 1-2 times a week since the place opened, as I work nearby.\n\nThe food is always fresh and consistently tasty. The Hummus in particular is to die for - the owner has told me it is made fresh in-house every morning, and you can taste it.\n\nThe wraps and falafel are excellent, but if you are in the mood for a salad-style meal, you can't go wrong with the Mediterranean plate or the Manaesh plate - they are both to die for.\n\nFor desert the Baklava is also amazing - I think it is made there too.\n\nThe place gets a little busy during lunch, but there are extra staff then to help things move as quickly as possible. At other times, expect more personal attention from the friendly staff.", "author": "David K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-23", "description": "The food is decent for lunch, but the workers are extremely rude.  The food service is also poor - one orders and pays at the cafeteria-style counter and then sits at a table, awaiting food delivery.  A woman who doesn't speak English walks out of the kitchen carrying food and calling out a person's name, while wandering through the spacious seating area, until someone flags her to take their food.  Why not just use a number system like most counter/delivery restaurants (Firewood, et al)? But if the staff wasn't so rude, I probably would give this place 2 stars.  I'll never eat here again.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-09", "description": "We stopped over this past Saturday for lunch after the family resource fair. I wanted to give more stars for the food (it was pretty good)--but the incredibly rude man behind the counter ruined the meal. \n\nWhen we walked in the place was pretty empty, which should have been a sign for us to head out the door. But I was in the mood for falafel and baba ganoush. Our food was ordered and we sat down with our 9 month old baby girl. \n\nShe promptly grabbed the nearby spoon and started banging on the table (a common behavior for babies this age). Before we could stop her, like good parents, the rude man  behind the counter came over, gave her a plastic fork (yes, a fork) and insisted she stop because she was going to wreck the table. Seriously?! \n\nAfter food came, we were eating and my boyfriend's water glass was empty. We very politely asked for more, and instead of pulling out the cold pitcher in the refrigerator where he got our first glasses, he took the glass and walked all the way over to the kitchen sink and filled it up with sink water. Now, it's not that I'm snobby about water, but the entire action of walking farther than the nearby pitcher to give him water from the sink seemed quite insulting. \n\nHe did not talk or acknowledge us--and spent pretty much the entire time trying to look busy. Absolutely ZERO (or if it's possible, negative one) for service. We felt like we were bothering him. \n\nI will not ever come back to Saffron 685 because of the poor customer service. There are many other places with Mediterranean/Middle Eastern food. If I'm going to go out and spend my money, I expect some general pleasantry and to feel like my business matters. \n\nPS: The falafel looked wonderful on the outside, but incredibly dry on the inside. The tziki had excellent flavor but the yogurt was thin and runny. Boyfriend said lamb shawarma was good sized and generally flavorful. Overall, typical dishes--neither really good or really bad. \n***********************************************************\nHi Nicole,\n \nziad t. has sent you a message on Yelp:\n \nSaffron 685\n \n\"Hi there, thanks for your honest opinion in writing about Saffron.\nI'd like to clear up a few things if I may.\nThe place was empty because we have an engagement party @ 5.00 PM, the place was booked for that, I got you in because I saw you coming back and forth and checking the menu outside.\nThe place is not designed for kids, the interior is more for parties and people coming on a dates.\nThe reason I did not give the gentleman water from the pitcher because I was just cleaned and refilled the pitcher beside when you were asked for a drink you said yourself that you wanted a tap water right?\nSorry you found the service bad and the food no good not really bad, however people say we have the best shawerma, the best kebab, the best fries, the best soups, top it up being great place for parties and very efficient service, check the web please, I'm neither lying nor bragging, people out the door here @ lunch time.\nSorry again for the hall trouble, bless your heart & prosper to you, the baby & gentleman\nYour server\"", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-22", "description": "The food is good, but as a lunch destination, it is just too expensive. \n\nI agree completely with some of the other posters, they have a very interesting menu, and some very tasty looking things behind the glass, but the price to make a \"complete\" meal is nuts.\n\nThe food preparation is too slow and the counter is positioned poorly for a line, with the cooks at the restaurant's entrance, making it appear like a normal cafeteria where you order at the glass as you enter and pay at the end, while it is in fact the other way around here. They seem to run a skeleton staff.\n\nI happily will and do put up with all of the above in the numerous other small restaurants in the area, because the rest offer good food AND good prices.\n\nIf I pay $25 for a complete meal, the situation above is unacceptable.\n\nI have gone from time to time, but I won't be back.", "author": "Z B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-03", "description": "Terrific place!!!  Fast service, warm family like and just attentive enough to make you feel special.  Great for accomadating customers for special occasions!!! Great place to treat someone to.", "author": "Nannah G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-19", "description": "Came here with three other guys. Two of the guys had been before multiple times and ordered the lamb shawerma. Being a lamb-lover as well as someone who listens to recommendations, I got the lamb shawerma as well. And loved it! I'd never had Mediterranean food before, but I would very willingly eat tons of it if everything were as tasty as this was.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-16", "description": "I'll update my review because I've been assured that the rude counter woman has been let go. I work near this place and occasionally treat myself to their delicious food. They have some unique offerings here and I think their food always tastes really fresh and is very expertly prepared. Their seating area is very warm and welcoming and a true oasis. I believe they are striving for good customer service but may have been burned by some bad employees. Still, if you are looking for good food in the lower Potrero Hill area, Saffron should be at the top of your list.", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-02", "description": "Came here for happy hour on a Tuesday - not by choice, we were just starving and passed by this place as we were driving - so we found it by accident. We were the only ones at the restaurant and it was dead. We order the lamb sherwma, appz and soup, which was all reasonably priced. We've had better mediterranean food, but we thought the food was good and if iwe find our hungry-selves in the area...we might come back.", "author": "JG W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-23", "description": "Very tasty, fresh food, very nice room. We had several vegetarian things and all were excellent.", "author": "vadim g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "I went here on a wednesday night and it was deserted.  This place is kinda odd--it's cheap \"order at the counter\" style mediterranean food, with a lot of the dishes already prepared and sitting ready to be scooped out, except it has really cute decor like a nice sit-down restaurant.  I liked sitting on pillows on the floor.  They had one guy being cashier/server/busboy/chef and he was only serving us and one other table, although somehow service was still slow.  Food-wise it's pretty good for the price.  Their fattoush salad didn't look that great although I didn't try any.  The bean salad tasted a little too canned.  The mojidara was awesome, the tabouleh was yummy, and the pita was fresh and toasty.  Their desert was pretty awesome though - some mesh of crunchy threads dripping in honey -- tasted like baklava.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-29", "description": "This is a great little spot on Townsend in SOMA.  Really friendly staff who make you feel right at home.  Nice and fresh.  Although I was not a real fan of the hummus.  Too \"light\" for me.  This place would be great for a small party or baby shower.  With the couches and table set up, it is MADE for entertaining a group.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-19", "description": "The food is decent to average. I've been there three separate times and each time I am confronted with the same rude guy. He is a tall dark haired man wearing a beanie with pointy sideburns. The last time I kindly asked him if pita came with the Meza salad and he whispered, \"Hold Your Horses\" under his breath.  He really appears to not like his job and I think he works there out of obligation. Whoever owns this place should speak with him about a career change. The place has potential while they try to appear  high- end.  I just wish the service was better. I will never go their agaion after giving the place three separate  chances.  For the price and taste I would rather eat at \"Truly Mediterranean\" in the Mission.", "author": "Erik G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-10", "description": "I used to eat here all the time.  I used to order the lamb shawerma, faafel wrap and other wraps.  I eventually realized why I wasn't enjoying them the way I should.  It was because", "author": "Edward F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-27", "description": "Great food (have tried several of their items and you can't go wrong with any of them), love the Pomegranate Spritzer, nice atmosphere.  And I don't mind spending extra $ as long as the food is delicious and the service is good.", "author": "Isabella S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-18", "description": "i live upstairs from this place so i go here quite often.  by far the best lamb shawarma and chicken kaboob dishes i've ever had.  i always order extra hummus too as its homemade and delicious!  \n\nhighly recommended!", "author": "Anson T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-27", "description": "Found this on Yelp and the reviews looked good.  We were not disappointed.  We had the schwerma plate and the lamb kebab plate, as well as a latke plate.  I wanted to try the mujadrah, the server suggested replacing the rice on the lamb kebab plate with mujadrah, which was an excellent suggestion.  The food was all very good, good portion size and fair pricing.  I had a piece of walnut baklava for dessert and it was perfect -- not overly sweet, good balance of texture.  I love the seating choices here, too.  There are a few regular tables, plus a couple couches with coffee tables, and some low tables with floor cushions.  Very comfy.  We will come back here.", "author": "Pat H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-04", "description": "i used to work in the area. whenever my office craves Mediterranean, this is always the place we order from. the phone-in orders are nice and simple and in 30mins or so, the order's ready for pickup. their kebab wraps are so good. i usually get the chicken one. i must say it's a bit pricey at around close to $10, but it's so worth it. the portion is huge, i usually just end up eating half of it and the other for dinner or as a late afternoon snack. also we would typically order sides, and i must say, you can't go wrong w/ their hummus or dolmas. it's absolutely delicious! definitely hits the spot when you're craving Mediterranean.", "author": "mai c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-04", "description": "I was really excited to have this place in my work neighborhood, esp since I love this cuisine and have found no restaurants in SF that compare to the ones back east.  We've given this place a few chances and although the food is pretty good, the staff there loses focus on customer service when they are in a rush, which is normally lunch time.  I think that's the lamest excuse for any restaurant.  You know you are gonna get busy, so just get it together!  Don't be rude to your customers, or deny them choices that your menu clearly states they are entitled to.  Take a deep breath and remember that customers appreciate good food, and GREAT service more than quick food, crappy service.  Plus, its very pricey for what you get. Its no secret how much that food actually costs.  Its not like its exotic ingredients.  All around disappointment when you weigh all that's important to me in the experience.", "author": "Shanni L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-15", "description": "I went to this restaurant at first for a meeting with coworkers and I fell in love!  I have been back a minimum of once a week now.  First of all, the space, decor and ambiance is excellent.  Great modern and clean feel with awesome music always playing!  Most importantly it is very clean and tidy. The service is excellent.  The owner really takes the time to connect with customers to his restaurant.  He is usually the guy taking your order and preparing your meal.  He is extremely outgoing and personable.  And last but not least THE FOOD!\nWow the food is so delicious!  At first I only knew of and ordered the lamb shawarma.  But after going to Saffron several times I tried other items like kabobs and sides like Baba Ganoush, falafels, etc. ! Everything is so fresh and tasty.  I just want to order a little bit of everything every time I go now.  Last but not least, if I just want a quick sweet treat- Saffron has amazing baklava!\n\nGo there asap and enjoy!", "author": "christina d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-18", "description": "Baba ganoosh.. Hummus.. Lentils... Oh my! Everything here looks so good, it's tempting to take a big gaggle of friends along so I can try everything on the menu. It's important for the owner to have the freshest ingredients - just ask him. I just hope he brings back his soups. Try to ask him when you place your order! Revolution! But in the meantime, my boyfriend swears by (and salivates from)  the mint lemonade, and I've never had a bad shwarma experience.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-12", "description": "Fabulous food that is very fresh and yummy.  Very clean restaurant with efficient and personable staff.  My favorite lunch spot!", "author": "Samantha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-11", "description": "Food is decent but WAY overpriced and portions are small.  Like $12 for a chicken kebob plate with about 5 pieces of chicken?  Come on!", "author": "Sunil M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-07", "description": "they have a really good lamb shawerma  and the saffron rice pudding is very interesting. the falafel i had was a bit on the dry side. it is a little pricey, but it really is quite tasty. the other thing i noticed when i ate in was that the space was huge, but they haven't used it very wisely. some interior design help would be nice. i would definitely give it a try.", "author": "Kerri B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-06", "description": "Saffron 685 is an excellent place for Mediterranean food.  My office is across the street from the restaurant, so... I frequent it whenever I can.  Their food is always extremely fresh and flavorful.  The owner is also very nice and outgoing, working hard, but making sure that everyone is happy with his food and service.  I usually get the Chicken Kebab plate with dolmas (stuffed grapeleaves) or tabbouleh as the salad.  Their lamb shawarma/falafel are also yummy.  It's a bit pricey at $12 for a lunch plate, however, the quality of the food that's made to order (right off of the grill) makes up for the price tag.  It's a great place for a sit down or take out lunch and has a special ambience in its dining area with a warm design palette.  I highly recommend it.", "author": "Anne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-24", "description": "Our new hangout is this restaurant.  The food is fresh and delicious.  It has been very lovingly decorated.  We're delighted to have a quiet place to meet our friends too.  Grab a beautiful silk pillow and enjoy yourself.", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "I am new to posting on Yelp, even though I use it all the time for reference.  (Thank you, everybody.)  We just grabbed dinner tonight in one of our favorite nabe spots, and I wanted to share our yummy dinner experience.  We live in Potrero and love Saffron for take out or eat in.  We take out about once a week and always enjoy the shawarma, lentil/bulgar salad, falafel, and other goodies that the owner recommends.  This is good mediterranean food served with care and a smile in a cute space.  Plus, we get a kick out of the owner and his charm.", "author": "Meredith M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-16", "description": "The food is good.  I especially like the hummus, mojjadra (which I like to mix with my hummus), bean salad, tzazekee, the chicken kabob sandwich and the lamb shawerma plate.  I like when I go there and the lamb is sizzling on the grill...the smell makes me even hungrier than when I first walk in.  The ambience (the wall colors, plants, music, the lighting) complements the type of cuisine being served.  In addition to this, if you ever get the opportunity to get dessert, I highly recommend the konafa and the saffron rice pudding.  The outer layer of the konafa is crunchy and sweet with creamy cheese inside.  The saffron rice pudding is light, not heavy and not overly sweet.  It's not your typical rice pudding, but it's good nontheless.  It's worth a try.  The staff are friendly, and the restaurant itself is clean.", "author": "erica d."}
