{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "I don't know what everybody is talking about but from my experience I used to work for the owner of this location and his other locations in San Francisco. \nNot only was the owner super nice the stars are super cool but the food was super great if you really actually look into it it takes a lot of work for them to prep and prepared and that's a lot of dedication knowing that he does it mostly on his own super early and if he needs extra help he would ask his staff to help finish up the rest so I've seen how hard it is to actually prepare everything all the fresh ingredients especially the meats and preparing all of the veggies and healthy and drop off the bread super early in the morning even before we would even open the store and as far as food wise I think the sandwiches or one of the bass in San Francisco it's nothing like The basic Lee's sandwiches are all the other Vietnamese sandwiches or Asian markets or anything like that that sells any sandwiches.\n\nI don't know if the stops are all still there I'm sure not just because you know we all move on with their lives and we all want to accomplish a new and bigger better things but as a for me what I work there it was more of a side job because I actually was working two jobs and going to school and every time I would go to work, my co workers would  always ask, where to get those bomb ass sandwiches.\n\nAre used to buy so many sandwiches so I could make sure that I hand them out to everyone and they all shared and I really really enjoy the authentic and delicious ingredients and freshness of the sandwiches.", "author": "Bee T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-01", "description": "Pretty mediocre Vietnamese sandwiches.  If they were dirt cheap then I'd overlook the quality, but some are upwards of $8 after tax.  They could probably make these better with a little more attention to spices and condiments.\n\nMeatball Sandwich: First thing I noticed was that there was no daikon, despite being prominently advertised on the menu.  Hence the sandwich lacked a very important pickled/bitter contrast that carrots alone could not salvage.  Also, I didn't noticed any mayo (which usually seems to be common on Vietnamese sandwiches), so it was a tad dry.  The meatballs were pretty mushy and lacked texture.\n\nSuper Combination Sandwich: No daikon or mayo here either.  I liked the \"fancy pork\" but wasn't feeling the chicken or regular pork.  They seemed kinda bland.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "Would give no stars if I could. While I thought my sandwich was ok, I ended up with the worst food poisoning I've ever had in my life. DO NOT EAT HERE", "author": "Angela B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-13", "description": "I was a little surprised to find that this to be an offshoot of Saigon Sandwich on Larkin, in my mind, the preeminent banh mi purveyors in the city. That place is operated by two ladies, black belt masters of the baguette and the pâté. This one doesn't have their expertise on the prep board, and you can tell because the sandwich is just not as good. Among their nearly dozen selections (photo: http://bit.ly/10TJD9s), I decided to try the $5.75 Super Combination Banh Mi, which had all the requisite ingredients - chicken, pork two ways, pickled carrots and daikon, cilantro, cucumber, and jalapeno (photo: http://bit.ly/10TJx1J) - but it was hamstrung by the paucity of meat and the hardness of the roll which became a jaw-unhinging exercise in futility.\n\nThe $5 pair of Spring Rolls are adequate, no more, considering they're prepackaged. I noticed they use iceberg lettuce and an excessive amount of vermicelli under the rice paper (photo: http://bit.ly/11MzVIA). What saved my experience from being a complete miss was the $2.50 Green Vietnamese Coconut Waffle, which takes a Belgian waffle concept but puts the freshness inside the batter (photo: http://bit.ly/13HSVJF). Although the color is greenish, the flavor and texture are enticing with a coconut tinge that allows for a lunchtime sweet treat without a lot of sweetness. Since the nearby Les Croissants makes a more satisfying banh mi, the waffle would be the only valid reason for me to return.\n\nFOOD - 3 stars...marginal banh mi, satisfying waffle\nAMBIANCE - 2.5 stars...not much to it and then you sit amid the confused tourists in Embarcadero Center\nSERVICE - 3 stars...fast...that's about it\nTOTAL - 3 stars...saved by a green waffle", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-09", "description": "Looking at some of the beautiful pictures of others' banh mi sandwiches, I feel completely ripped off. My tofu sandwich should have been called a carrot sandwich, as carrots made up roughly 80% of my sandwich's contents. \n\nAs others have also stated, the bread is hard and definitely not fresh. Overall, this place is a huge let down considering it is affiliated with Saigon Sandwiches, the place in Civic Center that has become a legend, a place where $3 gets you one of the most delicious sandwiches in town. At this place, $6 gets you carrots and old bread, apparently.", "author": "Amity B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-04", "description": "I specifically asked for no jalapeños and to add pate and instead, they put jalapeños and NO pate. They must have switched my order with someone else's before me because I know they ordered the Super Combination as well. They need to figure out a better way to take down their orders and label each sandwich properly because they were just writing down orders on a notepad.. And since it's not a place where people sit down and eat, you won't find out until you already went back to work or home and it wouldn't be worth it to go back and ask them to fix it. Sigh.. make sure to check your orders if you can!", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-06", "description": "The location was a little dirty looking inside. Most of the meat was not edible. Now I know.....", "author": "Ken N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-07", "description": "Hmmm, hhhhmmmhhhh......................\n\nLook, it's tiny. It's quick. It's ok. I didn't fall in love with my sandwich. It was just ok. It filled me up, was pretty decently priced for the area, and it was fast. I'm not sure if I have much else to say about this deli. It's way better than other banh mi places in the area, FOR SURE! But there are totally better places somewhere out there...", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-10", "description": "Not surprised by the overall rating of this place.\n\nI ordered a chicken bahn mi and thought the meat was surprisingly flavorful but the flavor of the sandwich did not taste right overall.  The pickled carrots tasted a bit odd and overall did not taste fresh.  Later in the day I was incredibly parched.. I suspect they may use MSG to cook their meat?\n\nNot sure, but what I am certain of is that I will not be returning.", "author": "Melody T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-28", "description": "The best thing here is the coconut waffle. - 2 stars\nI ordered the combo ban mi.\nOMG...the combo ban mi\n\nBread was not fresh\ncarrots and daikon were plain and not pickled\nMeat tasted old and stale\n WTF. Why would anyone want to produce this kind of garbage and sell it. \n\nDisgusting.", "author": "Charlene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "I finally found the place to meet my craving Vietnamese Banh Mi/Sandwiches. You'd better not miss it!\nRecommended!", "author": "Yui D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "I found this little Mom & Pop type of place when I started working in the financial district at the beginning of the year. Even though this restaurant is small with no indoor seating, there is plenty of seating outside. It's very popular during the lunch rush. I suggest to go either around 11a or 1p to avoid the crowd.\n\nYou definitely need to try the waffle. It's the best!!! The last time I was there, there was a guy who was waiting for his order that said that this was the closest he has tasted to a Belgium waffle (not the US ones, the real Belgium ones). The waffles are made to order and they are worth the wait. You may want to toast them when you bring them back to the office because they are warm when put into the paper bag. \n\nIf you every been to Northstar ski/snowboard resort and had their waffles, this is MUCH better.\n\nThey also don't skimp on the veggies in the sandwiches. The bread tastes fresh and not stale which is a plus.\n\nA+ for cleanliness compared to other small Asian businesses I've been to.\n\nI like to support restaurant like this because San Francisco is losing it's small businesses slowly in the financial district. I hope they stick around for a long time.", "author": "Shelley L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-05", "description": "OMG! I just had a \"HOW DARE YOU\" moment with the food from this place!\n\nHOW DARE YOU call this a Vietnamese sandwich!!!  I ordered the combo sandwich ($5) and spring rolls ($4.50).  The sandwich was a little better than the spring rolls but not by much. The little bit of meat they gave was fatty & the sandwich was tasteless & dry.  It could've definitely used some mayo & maggi sauce to spice it up.  \n\nI ate half of the sandwich & was going to throw away the other half so that I can just indulge in the spring rolls.  I mean.. it's spring rolls...how do you mess up on that?? The spring rolls had 1.5 pieces of shrimp (Six half pieces that you can see through the roll).  The remainder of the roll was filled with some rice noodles, lots of lettuce & 5 sprigs of bean sprouts...that's it.  OH.. but it gets worse (yes, really).  The dipping sauce was literally made out of hoisin sauce & water...LOTS of water so it did not adhere to the roll at all while dipping...not to mention, it was completely tasteless. \n\nSHAME ON ME for wanting to save feel bucks & supporting a small biz.  I should've stuck with the winner and gone to the over priced, at least satisfying Out The Door across the street!!!  I'm sooo sorry, tummy!!", "author": "Wina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-12", "description": "I come here often when I'm on lunch break from work. A little surprised to see the overall rating of this place as low as it is? Very tasty and flavorful in my opinion. I usually get the Tofu sandwich and a green coconut waffle, I have never been disappointed in either of them. The waffle especially is fantastic! I must say that I think this is the best banh mi place downtown in financial district. \n\nI will chalk the low rating up to all the \"so called foodies\" expecting a life changing banh mi experience. If you want a good, no-nonsense sandwich, friendly/fast service, and amazingly unique coconut waffles, forget the yelp snobs and try the place for yourself!!! :)", "author": "Brett L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-02", "description": "Love, love Vietnamese food!!! This morning came back after more than a year and ordered Super Combination,   first bite felt like , Oh Gosh this isn't even tasty!!!\n\n\nMeat is just a B L A H!!!!\n\nBread taste a lot BETTER! !!", "author": "Emir L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "My coworkers recommended this place and it didn't disappoint.\n\nI have a favorite: Classic Combo. I love the pork, pickled vegetables, and the bread!\n\nBut my addiction is the coconut waffle. That green goodness, crispy in the outside, soft, chewy and steaming in the inside.\n\nDefinitely worth the walk!", "author": "Aaron P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-13", "description": "Went to Saigon Deli Express for the first time today.  Didn't know they were there and happened to be walking past and stopped dead in my tracks.  I love Vietnamese sandwiches.\n\nI ordered the classic combo sandwich and was not impressed.  The bread was really dry and fell apart because it was over toasted, it crumbled with each bite.  The cut of pork was pretty bad.  I couldn't bite through it because of the hard fat running through it.  I ended up pulling the pork out and eating the sandwich vegetarian style.  The flavor and crunch of the veggies was good, but there wasn't enough of them to moisten the bread or provide much flavor.  The price is great, but sadly I will not be going back.\n\nToo bad.  The idea of getting a bomb Vietnamese sandwich so close to work makes me so happy.", "author": "Bobbie T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "The quantity of food for 8 dollars is absolutely ridiculous, let alone the taste of the food being borderline inedible. I saw as the lady was making my sandwich that she was being very stringent, even taking meat that was already in the sandwich and removing it. Would definitely NOT RECOMMEND.", "author": "Calbear A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "As many have mentioned in the reviews, I am surprised by the low rating... Maybe they have some inconsistencies when making the sandwiches? \n\nI like the place. They have nice sandwiches, pretty cheap and quick, and the green waffle is really tasty and is great treat when I crave something sweet...", "author": "Jean-Max V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-28", "description": "I passed by this place with my girlfriend, and she exclaimed \"oh!! this place has green coconut waffles! I've had them before, and they're good!\"\n\nWell, despite her previous experiences with these waffles, the one we ordered here was horrendous! It tasted alright, which is a plus, but it was the limpest, mushiest waffle I have seen. Forget cripsy, it didn't really keep it shape when help, but limped over like wet bread.\n\nWaffles are definitely not their strong point...", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "In an attempt to show me how real Vietnamese sandwiches are done without being super insanely expensive (I seem to only have the fancy gourmet bahn mi places near my office), we came over here for lunch on Friday. For a little over $5 each, we got tasty awesome sandwiches in the pork and fried tofu variety.\n\nA lot simpler, yet just as tasty, as the gourmet places, I loved the fried tofu on my sandwich. I'd been told the pickled veggies weren't too sour, but they actually were perfect (and I'm the person that believes dill pickles need to be worshiped as food of the gods). If you're looking for super soft bread, this isn't the place (as another reviewer commented) but I know I like my rolls to be chewy and crunchy like this (if I want soft bread, I'll go to Subway). \n\nThere's other options on the menu (green coconut waffles, spring rolls) but just the sandwich was good to keep through the rest of my work day. \n\nIt's a bit of a trek for me to make it to, but it was worth it! Definitely some good sandwiches here!", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-15", "description": "This place was average before (and I regularly went because it was fast and easy) but now has really gone down hill.  The sandwich was completely cold, even though he appeared to have toasted the bread in the oven, and had nothing inside it except the cold meat and carrots (what happened to the cilantro?).  The only reason this place stays in business is because of location.  Will never visit again.  Les Croissants (just down the street) is much better and even slightly cheaper.", "author": "Maria R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-04", "description": "Green coconut waffle - is nice ! They just throw it in a paper bag and off you go, munchkin on a green, funky looking, waffle :)\n\nRecommend !", "author": "Alex S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-05", "description": "I ordered the fancy pork.  It was nasty.  Where the he'll was the meat.  They over loaded my sandwich with way too much of carrots.  Wth!  Never again. .  Yuck....", "author": "MaryJane D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "Normally I go to Les Croissants for my banh mi, but today I was trying to get Onigilly so I went to the Embarcadero. The line was long so I was settled for this place. The sandwich took too long, the girl making the sandwiches was rude, and my coconut waffle took forever then was thrown in the bag half cooked. if the waffle took long, they could have warned me and they should bag waffles separately from sandwiches. My coworkers thought it was disgusting and I agree. Only one star for the sandwich being so-so. Les Croissants is so much better in terms of the service and foods. Never coming back here.", "author": "Yuri K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-06", "description": "I appear to be in the minority here, but I am a fan. First, a $5 sandwich in the Embarcaderos is virtually unheard of. Second, the people behind the counter couldn't be nicer. Hats off to the woman taking orders for remembering what I like and getting my order in the queue the moment I walk in the door. \n\nAs for the food, it is simple but quite good. The banh mi is made with a crispy baguette overstuffed with steamed and fancy pork. And where else downtown are you going to find freshly made green coconut waffles? \n\nCome on people, this is a great spot for lunch!", "author": "F.G. C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-31", "description": "I love Vietnamese pork sandwiches....LOVE!  Was told that it cost $4.50 and was freakin' delicious by a coworker of mine so I had to check this out myself.\n\nEhh, it was aright.  The size portion was ok.  The bread wasn't what I expected it to be.  And the pork meat wasn't very impressive - didn't have much flavor?  But for $4.50, I don't think I have much to complain about.  \n\nI also tried their coconut waffle which was delightfully tasty.  It's not too sweet; it's soft - not crispy. But I thought it would come with some sort of coconut jelly or something. Not just a waffle. For $2.00 - not bad.\n\nTheir spring rolls - FAIL.  Not impressed.  I don't like their peanut sauce - super dark!    \n\nI still prefer the pork sandwich at OUT THE DOOR  (the one located in the food court at the mall near Bloomingdales).  YES, I know it's not a REAL Vietnamese sandwich when it costs more than $3.00 but  it's bigger, with more tender and tastier meat, and with lots of jalapeno!  I'll gladly fork over $9.50 for it. And the spring rolls are BOMB - it's SHRIMP AND PORK and their sauce is way better!", "author": "Diana M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-15", "description": "Frankly, this is by far the worst of two Vietnamese sandwich shops within one block; why the heck would you ever go here?  It's not made with care; the ingredients aren't chopped up enough, the meat is lacking all flavor, and there's just no reason to ever go back here.  Try Les Croissants instead.\n\nThis review is part of a series on lunch places near my office.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-10", "description": "First off, just like some of the reviewers rant, this is one of the worst banh mi i ever had.\n\nThe bread was warm to a soft roll - not crispy or crunchy at all\n\nI had the combination - american ham wtf and pate you have to ask which i didn't because i thought they would add it automatically wtf??\n\nyes they pack it with lots carrots\n\n$4.75 for this crap, should of  shells out an extra .50 to $1 for something better than this place.", "author": "DVS A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-16", "description": "gums all cut up from the stiff hard bread.\n\nmeat was dry and tasteless.\n\ncucumbers were flaccid.\n\nall i tasted was the sauce.\n\nI might even say this is the worst banh mi place EVAR!!!\n\nill update this review if i get the runs!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-27", "description": "Should have known better to check Yelp before I grab lunch at a place. The 2.5 star rating this place gets does not surprise me at all.\n\nFirst, the bread was so hard it had my jaw sore for a day. There was literally one layer of cold cuts in my \"combination\"  sandwich and the only taste I got was from the Maggi seasoning that they soak the bread with. \n\nWith a price tag of five dollars and up, my advice to you, run, run I tell you!", "author": "Eric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-29", "description": "Quick snack in Financial district. This is a  little sandwich stand. Hope they wash hands after receiving money and before making sandwich. Sandwich $6-7 and drink $2.25.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-28", "description": "\"Express\" is right! I had a chicken banh mi in hand within 60 seconds flat. If I hadn't watched the cook make it himself right in front of me, I would have been suspicious.\n\nThe price ($4.75) is typical for banh mi in the SOMA/FiDi area. I liked that the bread was a bit softer than it was at the Les Croissants vietnamese shop across the street. They also carry an assortment of drinks and prepackaged Vietnamese spring rolls with peanut sauce. Minimum for credit cards: $5.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-08", "description": "I just ordered the coconut waffle.  It was soggy and hardly edible.  I've had it here before and it was fine and I've had it many times at other places.  \n\nWhen I told the girl that it was raw in the middle and soggy, she told me it was because I had it in the bag.  Umm, of course it's in the bag, that's what you put it in when you handed it to me lady!  2nd of all, it wouldn't get that soggy after a minute.  Then she goes on and says its supposed to be that way.  I told her that if it tasted like that the first time I got it\nhere, I definitely would not be standing here ordering one today.  C'mon, it's not like I don't know what it's supposed to taste or look like.\n\nAnyway, she made me another one and it turned out much better, star for that.  As I waited for the 2nd one, I Yelped Saigon Deli Express and saw that they were rated 2.5 stars.  Deservedly so! \n\nShame on me for not yelping first.", "author": "Delilah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "Finally stopped by.  Awesome food.  Awesome service.  \n\nThere really is no better place to get a Vietnamese sandwich in SF...unless you go to Chinatown...but then you'll have to deal with potentially getting diarrhea.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "$6.00 for a Pork Bahn Mi that is loaded with the ingredients and tastes great and is fresh, you cant go wrong! Especially for the price in the Financial District.", "author": "Carlos S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-07", "description": "A little hole-in-the-wall that makes pretty good banh mi.  I usually get the combination sandwich.  It's cheap, fast, and good.  One of the best places to grab a quick, an inexpensive quick bite in the financial district.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "Not too sure why the rating for this place is so low. My husband and I love coming here evertime we shop in the area or before we go to a Giants game. It's a tiny place with lots of outdoor seating. Right across from Coffee Bean and near the Giants Dugout, why wouldn't you stop by? The sandwiches are good, the bread is amazing. They are priced accordingly and get your food to you ASAP.\n\nStill need to try the waffles!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-22", "description": "My co-workers are raving about this place! They go for breakfast waffles there all the time.  I just tried it, it's o.k., nothing super spectacular.  I have had better!", "author": "Julie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-21", "description": "I've been wanting to get a banh mi from SDE ever since it opened, so stopped in here today for a five spice chicken sandwich and also grabbed a package of shrimp rolls. The chicken sandwich was just ok - definitely lacking some sort of zesty flavor other banh mi's usually have. The sandwich had all the usual ingredients, so I'm not sure what the issue is here. \n\nThe shrimp rolls were pretty bad. The iceberg lettuce was kind of flabby, as were the shrimp. And the dipping sauce tasted of some indeterminate spice that I really didn't like. \n\nSee ya around, SDE.", "author": ".Hon H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-08", "description": "The great thing about Vietnamese sandwiches are that they are tasty and cheap. Obviously Saigon Deli has to pay it's rent so $4 is not too bad. \n\nI'm used to eating authentic bahn mi though from the hole in the walls or Lee's Sandwiches or Mr. Baguette down in LA so this place really doesn't compare. \n\nThe bread is more like a roll rather than a thin baguette and they don't really put enough meat in there. Also pate available upon request, isn't that what holds the sandwich together? \n\nIf you want something other than quiznos or subway, I could see why you would come here but it didn't satisfy my craving.", "author": "Betty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "This review is for the coconut waffles only - simply delicious! It is chewy in the center (unlike any other waffles you have ever tried) and crunchy on the outside; just $2 and you get a full, fresh and hot waffle in a paper bag. Perfect snack for yourself or to share! Try it even if you don't like banh mi sandwiches. You'll fall in love with the green waffle too!", "author": "Jocelin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-02", "description": "BLECH!\n\nSaigon is located in the Alley walkway towards Osha Thai at the Embarcadero center. And it is a small lil shop that advertises Vietnameses sandwiches and Green Coconut Waffles.  I miss the Vietnamese sandwich job by my old office location. \n\nWhen I peeked in and saw that the menu had not ONE but THREE Veggie options (Tofu, Veggie and Egg), I was like SCORE. It was raining today and I thought the lines would be less but nope! There was a huge line. \n\nThere is only one guy working there and he takes and makes the orders ONE at a time which is wonderful that he is giving me more attention than needed but I really don't like to wait 15 minutes for a quick joint. They have lots of options to choose from. The Green Coconut Waffle is made fresh and boy was it tempting. \n\nI got the Tofu sandwich which at first look like a giant fish fry.  He  was a particular fellow. He wrote a latex glove on ONE hand... but handled all the food with both hands. And it was his left hand that he covered. Maybe if I was in India, I would get that since we don't touch our food with our left hand cuz well... you wash you ass with it.... I digress.. Okay so ya, he put on that one glove to make the dudes sandwich ahead of me. After that, he took it off, and rang the guy up. When it was FINALLY my turn, he put the SAME glove on. I am not a complete picky veggie cuz I didnt want to start thinking about it. He made it pretty quick. The bread sits in this glass case and he warms a couple each time. I got a sandwich and a coconut water... all for about $6. NOT BAD AT ALL for a FIDI lunch spot. \n\nUm, so I walk back in the rain, my pregnant belly grumbling for the sandwich with pickled carrots and JALAPENOS... and when I got back to my desk to take the first bite... OH SNAP! FAIL! The bread was hard and too crunchy. The tofu lacked any flavor and tasted like rubber. THe carrots and daikons too pickled. The only thing that was right about it... the jalapenos. And also they add this sauce to it... the one you get with hot tempura.. blah! Sadly, you know I am pregnant cuz I ate this \nsandwich anyways.\n\nAll in all, I will be getting it from a traditional shop, which is usually cheaper and must higher in quality. But, hmm, I might have to give that coconut green waffle a try.", "author": "Jayashree S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Perfect sunny day in the city--and I what made it perfect? A \"fancy pork\" sandwich, coconut waffle and sparkling water from SDE.\n\nThis place is super small, but efficient! My order was ready in a flash and I was noshing on lunch much faster then my companion who was in line for pizza down the ways.\n\nThe sandwich was pretty good (tasty soft bread and not too spicy peppers). The waffle was subtle in coconut flavor but perfect as my dessert, not too sweet.", "author": "Hilda Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-22", "description": "I totally agree with Kim L. on the below comment..... Quote\" HOW DARE YOU CALL THIS A VIETNAMESE SANDWICH\"\n\nSeriously.. How THE FUCK do you use American Ham in a \"VIETNAMESE SANDWICH\".... and thats not all, it was Ice Cold American Ham... What in the fuck world was she thinking??? This place is absolutely worst than generic, seriously what the fuck was she thinking??? American Ham.. R u fucking serious?? \n\nShe needs to get her ass to Manilla or one of those viet markets in the tenderloin and buy herself some of those Vietnamese meat, the ones that come wrapped up like a tube... This place is just fucking retarted, it is honestly way way worst than generic.. come  on now.. u ruin my morning... \n\nAlso the pepper she puts in there, is not even spicy at all... and the carrots, she overloads it... WHY? because carrots are cheap? I'm starting to figure this place out... $5 for a vietsandwich, which she overloads on the carrots because they are cheap, then she buys american ham which is also cheap, and puts a few slices, then she also use a few strands of cilantro, and the soy sauce/butter mix tastes like its been watered down.. and what pissed me off too was the sandwich was actually warmed up so it was warm, but the got dam fucking american ham was ice cold... what the fuck dude, do you have some common sense? Hot and Cold sandwich?\n\nthis should be a negative 1 star..... To summarize my comment in 1 sentence for this place~~The sandwiches here are worst than generic. I would rather starve for a bit than order another sandwich from here.", "author": "Mr. AzzHole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-03", "description": "I love their green waffles....\n\nThere is plenty of outdoor seating to enjoy my bahn mi and almond jello dessert.  They also offer chicken/pork/beef rice plates and fresh springrolls.  Yum!", "author": "Sheenie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-02", "description": "Where cheap people go to eat substandard financial district food!!\n\nDowntown folks dig this place because you can get a sandwich for $5 or less. In reality, it's no luxury. The sandwiches are dinky and uninspiring.\n\nThe pricing is frustrating too. Why are the port, meatball, chicken, and triple meat (gross) sandwiches the same exact price as the tofu sandwich? Pound for pound, we can all agree that pork, fancy pork, and Vietnamese ham SHOULD cost more than a block of tofu, no?\n\nAnd for just a quarter less, you get the veggie sandwich that has nothing but carrots, cucumers, and radishes. Injustice! In a perfect world, sandwich shops would cop to the fact that vegetarian sandwiches should be a dollar less. In this flawed world, I'll get my sandwiches where the food is actually decent and I'll proudly pay for quality. See you at the Slanted Door!", "author": "Stumbalina b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-11", "description": "The Bahn Mi is a fairly standard sandwich so normally this wouldn't be worth a review. However this place seems to be getting unfairly criticized and if a Bahn Mi is what is on your mind, then why not eat here. Not sure what the expectations are but for a quick and cheap stop, it's perfectly fine.", "author": "Dave P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "Where else can you get fresh, hot green coconut waffles? And who knew what a fantastic idea this would be?!?!? What a fabulous way to polish off a spicy, crunchy, satisfying tofu sandwich with daikon, carrots, and jalapenos. \n\nAlllll this for about $6.", "author": "Angela N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-13", "description": "This place can no way, no how be associated with the Saigon Sandwich in the TL!  \n\nMy favorite sandwich over there is the Meatball, so I ordered it here.  It had an odd color and texture... I seriously could not identify what kind of meat it was.  Chicken?  Pork?  Beef?  It had no distinct taste either. And the texture revolted me.  It was like smooshy cat food.  I nearly ate half before I felt a bit queasy and had to toss the sandwich away.  The color had bits of pink in it... was this undercooked? \n\nAnd the size is a jip from what you get at the TL location.  Smaller and more expensive.  $4.50!\n\nYou call this pickled carrots?  I call it limp pieces found from leftover coleslaw from another deli shop.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-03", "description": "It's an attempt to bring Vietnamese sandwiches to the financial district and to the masses, but unfortunately the sandwiches taste quite plain.  \n\nSince it's in the Embarcadero / Financial district, the sandwiches also cost around $4.50 which doesn't seem like a lot, but compared to Little Saigon in TL, it's about 1.50 to 2.00 more....  \n\nPaying a premium for convenience and for a much cleaner & professional environment is a great concept, if the food quality and flavors justified the cost.  \n\nUnfortunately, this is nothing like a \"real\" Vietnamese sandwich.  It's toned down, bland and boring.  I guess I have to continue to make my trip to the TL for a real Viet Sand.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-12", "description": "it's hard to find banh mi in the financial district, and saigon deli express is no saigon sandwiches, but it's pretty good if you're looking for convenience!\n\ni would recommend the pork banh mi and the pandan waffle!", "author": "Carli F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-13", "description": "The combo sanny I got sucked.  Stale bread minimal flavors in the meats and veggies.  The young woman who made it was nice enough and prepared it more or less properly, though it was pretty short on cilantro.  It just had sucky ingredients.  Fresh bread probably would have made it considerably more palatable.  I just finished eating it and need something else to erase the blandness.", "author": "Ho H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-06", "description": "Fellow Yelper Jeremy S. said that Saigon Deli Express has two things going for it: location and price. In the end, I couldn't agree more. In that area of the financial district, finding a lunch option for under $10 felt like a mini-miracle in itself (which is ultimately why I went here for lunch one day). It was also so conveniently located to our Hotel -- convenient due to a time-crunch at our conference.\n\nI ordered the 'Super' banh mi, which comes with two types of pork (BBQ and 'special', whatever that means) and chicken. Overall, the flavor wasn't particularly great. It wasn't bad necessarily, just bland. I don't know how two kinds of pork and chicken could have as little flavor as this did, but it managed to. The same is true of the toppings -- the daikon carrots weren't all that sour and I only had one jalepeno, so it lacked any amount of spiciness. \n\nIn all honesty, though I wasn't expecting much -- coming here was born out of proximity and price as noted above. So in the end, aside from those two things, I can't see any reason to venture here for lunch.", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-04", "description": "this place is HORRIBLE.  I just finished my combination sandwich with a spring roll side...\n\nCombination Sanwich\n1.  The meat was so dry, i had to be reaching for a glass of water just to keep from choking.\n2.  The vegetable don't even taste pickled!\n3.  Can't even taste the PATE.\n\nSpring Rolls\n1.  Their peanut sauce tastes watered down with soy sauce... it was so disgusting I did without.\n2.  vermicelli noodles were HARD.\n\ndon't bother.", "author": "Clarissa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-06", "description": "Tasty little Vietnamese sandwich place that I can walk to for lunch.\nThe $4.25 price doesn't seem too bad.  The pork combination sandwich for me was much tastier than most of the sandwich places in the area there.   I was happy with the meat, the jalapeno and the pickled cucumber/carrot mix.\nI hope they do well.\nThe bad reviews are really overly picky, poorly written and shouldn't scare you away.\nIt ain't gourmet.  It's a cheap tasty hot pork sandwich place.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-28", "description": "Slightly torn on this place because it is the cheapest lunch i got in FiDi but the food was just blah. \n\nI got the chicken sandwich and it came with jalapenos carrots dai kon. The sandwich itself was tiny, i was definitely still hungry after i ate the whole sandwich and i don't have a huge appetite. Another thing was that it was pretty tasteless, the chicken had no flavor, the carrots and pickles were not sour enough and the jalapenos wasn't spicy at all. i had to go back and ask for siracha sauce and drown my sandwich with it. \n\nFor $4.50,it is a fast and cheap way for lunch but i will definitely not go out of my way to come back to eat. Subway would probably be more fulfilling and tasty................", "author": "Tenny W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-02", "description": "5 stars? Um, no.\n\nThe contents of my #1 combo sandwich resembled scraps on a plate from a Vietnamese restaurant.\n\nHead to Les Croissants instead for bahn mi in the area.", "author": "Faffy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-09", "description": "-1 for being rude/short \n-1 for the price (5 bucks for banh mi)\n-1 for the TINY portions of meat/general size of sandwich (even though I got the super combination)\n-1 for yucky meat/bread being too hard \n\ni was desperate for banh mi and this place was close. god. what a bad decision. there is band mi about twice this size in oakland for half the price. that's about 4x times more value. do your math fidi.", "author": "Joyce D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-18", "description": "Pork with pate banh-mi is fine for the Fidi. The veggies are pretty mild and the sandwich would be better if the veggies were more acidic. For $5, it's fine. The service was fast and friendly. Give it a try if you don't want to spend $18 on lunch at Osha. Not missing much though...", "author": "Kiristen R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-21", "description": "this place was bad. I couldn't find the sandwich stand guy and ended up here, should have checked yelp first because the food in this place is overpriced and disgusting!! my waffle was soggy and my classic combo tasted like nothing. what a waste!", "author": "June W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-10", "description": "Les Croissants is way better, cheaper and just across the street. The pickled veggies here consist 90% of carrots and don't taste very pickled. These are usually my favorite part of the sandwich. I asked for hot sauce and didn't get any. Bread was fine. Overall, not what I was craving.", "author": "S O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-15", "description": "I was excited to see a banh mi place opening up in the Embarcadero, but I'm afraid their sandwiches are strictly inferior to the ones at Les Croissants a block away.\n\nFirst of all, when I took my sandwich out of the wrapper, one end of the bread was soggy from some unidentifiable liquid.  Ew.  \n\nI don't care for the thinly sliced veggies (I prefer the thicker spears), and the taste of the pickled veggies was off (too watery - perhaps that was the source of the excess liquid).  The taste of the meats and the sandwich as a whole was also off.  Not enough flavor and they don't give you pate unless you ask for it!!  What??  I think this is just a ploy to save money, 'cause most people don't read the fine print on the menu.\n\nThey do have spring rolls and Vietnamese desserts, which I have yet to try.  But honestly, the sandwich was so bad that I am not sure I want to go back.\n\nThis place has given me a newfound appreciation for Les Croissants.  It may be a hole in the wall, but at least they know how to make a good Vietnamese sandwich.", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-25", "description": "The bread here is what breaks this place.  I've tried this place 3 times and everytime the bread tastes stale.  \n\nThat's all I remember about this place which means that the inner ingredients don't stand out either.\n\nI think you're better off going to Les Croissants down the street.", "author": "C A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-05", "description": "Saigon Deli Express has 2 things going for it:\nLocation and price. This food is among the lowest priced food in the area and it isnt terrible, but it is certainly lacking something. Several things.\n\nI had the \"super\" pork and chicken sandwich with jalapenos, but I detected no jalapeno or perhaps it was simply so mild that it got lost amongst the daikon carrots and cilantro. The chicken was quite bland and its texture resembled spam, as I believe it was preserved/reconstituted. The pork was a bit tastier, fresher, and juicier.\nOverall the flavors found in this sandwich were agreeable, the veggies all very fresh and snappy, and the bread was more or less fresh, albeit a little on the tough side. \n\nThis sandwich desperately needs something else. In my opinion, some hoisin and sriracha would be perfect, or perhaps a dash of fish sauce. The contents of the sandwich tasted slightly similar to the contents of a spring roll, so I think any flavors that would compliment this would also compliment this sandwich. \n\nGood price, very little wait, fresh food, but very, very mundane and lacking in flavor. No spark at all in this small meal. If you have a large appetite, order 2.", "author": "jeremy s."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-07", "description": "I had a chicken and pork sandwich here not long ago, which really let me down. The bread is one of the highlights of a Vietnamese sandwich, but this roll was bland.  The meat was also just not flavorful--overall the sandwich was such a miss that not even my good friend sriracha could not come to its rescue, or help out my taste buds.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-08", "description": "UGH. This was the worst idea ever. I had a crazy hankering for some banh mi and decided to give this place a shot despite the bad reviews. I knew no matter where I went it wasn't going to be a great experience (hey, I'm comparing everything to Saigon Sandwich), but I had no idea it would be horrible. I got the Classic Combination (roast pork, fancy pork and pate), took a bite and nothing. No flavor. Even my jalapenos were bland.", "author": "Karena Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-07", "description": "This is the 3rd Vietnamese sandwich place that I have visited in the Embarcadero area. I usually don't eat in this food court area where Osha Thai is, but I decided to give this shop a try to see if it is better than my usual, Les Croissants.\n\nI ordered my usual roast pork. First thing I noticed right away is the sandwich is about 25% smaller than Les Croissants, costs a quarter more, and you get tax charged as well. Price is still fine, whatever.\n\nAs I taste the sandwich, I notice the pork is a little bland. I ordered it with everything except cilantro. But I could not taste the mayo or any sauce/seasoning on the pork with the exception of some pepper.\n\nSmall portions, bland meat, definitely not worth re-visiting for me.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "After spending $10+ on each lunch for the past month, i'm on a mission to find cheap under-$5 lunchs in the financial district.  And no, subway every day will not cut it.!  \n\n#1 stop: Saigon Deli Express \n\nI've never had a vietnamese sandwich before so I wasn't sure what to expect, but for $4.50 I was willing to give it a try!  I'm not a meat eater so had the egg sandwich.  I was a little skeptical at adding pickled daikon and other spicy items to an egg sandwich, but turns out it's delicious!  \n\nI can't vouch for the creepy meat that some people mention (and seriously, meat eaters,  what is the difference between pork and fancy pork?), but if you're looking for a good veggie sandwich, you've come to the right place!\n\nOther pros: it's fast and close to my office\n\nCons: as others mentioned, the bread was not as fresh as I would have liked.  I'm also sure bringing back uh...fragrant-smelling vietnamese sandwiches every day will start to piss off my office mate.", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-20", "description": "$4.25 may be expensive for banh mi, but for lunch in the Financial District?  Sign me up!  \n\nI came here on Thursday and was pleasantly surprised.  I had tried a sandwich from Saigon Deli Express in the fall, and was disappointed with the small portion of meat, cold bread, and flavorless pickles.  (The daikon and carrot pickles just might be my favorite part of banh mi!!)  This time, I was pleasantly surprised.  I got the pork sandwich with pate and was happy with the warm juiciness of the pork meat, the splash of fish sauce, and the amount of pickles, cilantro, and jalepeno.  The bread was just crusty, but not so much that it hurt the top of my mouth while eating it.\n\nThe only element that could be improved upon are the pickles.  They still weren't quite pickle-y enough for my taste, and I was disappointed again that there were only carrots and not daikon pickles as well.  \n\nIf I'm working in the city again and looking for cheap eats, I will definitely consider getting a sandwich from here again.  From the looks of other reviewers and my previous experience, it looks like this place might be hit or miss.  I wonder why?  I'll give it four stars for this latest sandwich.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-12", "description": "Came here today after a few people recommend it to me and I decided to ignore all the negative reviews. Yeah, my bad. The bread was hard in places, and soggy where there was sauce. There was very little meat. Oh and when I asked for extra cucumber, I got one extra slice. Yep, ONE. No way will I be back when Les Croissants is just around the corner.", "author": "Maria G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-04", "description": "I have a really hard time finding Vietnamese sandwiches in the FiDi. I've had many days where I would crave one but didn't want to travel very far for lunch. This is one of the few places that satisfies that need.\n\nThe sandwiches here are alright. The $4.50 price tag may be much compared to other, and farther, Vietnamese sandwich places, but that price is hella cheap for a FiDi lunch.", "author": "LM M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-11", "description": "I bought a Vietnamese Chicken Sandwich and a Green Coconut Vietnamese Waffle.  \n\nI definitely had better sandwiches.  The size seemed smaller than average. The bread didn't seem to be typical Vietnamese sandwich bread but more like sourdough (without the sour).  The bread was not very toasty; it became soft and mushy.  Maybe it was their sauce that leaked into the bread???  There wasn't a lot of chicken meat. The taste was mediocre at best.  \n\nThe waffle was quite tasty but it was a little soft when I got to eating it.", "author": "Frederic C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-27", "description": "I went here today to try a vietnamese sandwich.  I love vietnamese sandwiches!!  \n\nThis place was okay.  And it's crazy because I used to be addicted to these sandwiches, but this did not leave me wanting more.  It was in line with sandwich prices in the financial district, but definitely too expensive for a vietnamese sandwich.  \n\nUnfortuantely, I probably won't go back here again.  I'm sorry.  Wasn't really digging it.", "author": "Brenda H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-17", "description": "Not too bad. I love vietnamese sandwiches. I could eat them everyday. \n\nI do feel a little ripped off at $4.25 a sandwich, but it's FiDi. The sandwiches are a little smaller than normal, but still contains all the yummy goodness. Their green waffles are pretty delicious too, especially when they are fresh. \n\nOwners are nice--one time we came and they were sold out of sandwiches, he referred us to their other store. We were kind of dismayed about the walk, but he gave us a free waffle for the walk!", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-13", "description": "Cheap eats for the Financial District.\n\n$4.25 will get you the pork combo sandwich.  The meat is nicely seasoned, but they could be a little more generous. Condiments are fresh and  nicely marinated, however the bread is a too hard. Finding the right bread for Bahn Mi, IMHO is critical.\n\nI had a bite of my friend's Coconut waffle. It was on the soggy side, and just thrown into a bag. Not worth the $2.00.\n\nI would return again - only if I'm cash poor.", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-13", "description": "I came back to try the Pork sandwich and it was definitely a step up from the veggie sandwich (of course, the reason being the pork).  I will say that I've had better pork but I still enjoy the tangy flavors of the pickled carrots and jalapenos.  I still appreciate the fact that they make the orders fast. I will try again and see if there is a winner in there?!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-07", "description": "For what it is, it's not bad. I had a meatball sandwich, wanted extra pate but they were out. Bread's decent enough.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "Great banh mi place in FiDi.... not sure why it's rated so low. It's one of the cheaper lunch options in the area, and it's not bad at all! I would definitely go back here. The sandwiches are a great size (not too big, not too small) -- perfect for lunch.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-17", "description": "My team at work was going to Chili Up, so I went with with them and thought I'd try this nearby place to compare to Les Croissants Vietnamese pork sandwich. \n\nIt was okay, but the bread was not as nearly as good and the vegetables were not crunchy.  There were no carrots in my sandwich, either.\n\nIt also cost more and the sandwich was definitely smaller.  I was disappointed.\n\nI have not tried anything else there, so if I do check out the green coconut waffles or the egg rolls, I'll report.\n\nLes Croissants Vietnamese grilled pork is still the best, by far!!!", "author": "Dale K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-11", "description": "In regards to the person who gave Saigon Deli a 1-Star, I just came back to this page (to give my co-workers this link) to share this great lunch spot and noticed the 1-Star review. I never had the #1 but my co-worker had it yesterday and he loved it. I always get the fancy pork and waffle and they are both really good. I've been to Les Croissants before and it wasn't that good and it was over priced. I also tried that coffee shop that sells Vietnamese sandwiches on Sansome & Clay(?). That place was even worst. It was like 7 bucks as I recall and it was gross.\n\nJust go to Saigon Deli if you want a yummy sandwich and you'll have no regrets. \n\nWho the heck wants to pay 6-8 bucks for a Vietnamese sandwich that is mediocre? Paying that much for a Vietnamese sandwich should be against the law!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "Saigon probably gets a third star only because it is so cheap in the FIDI.  I ordered the pork sando and waffle because I had to spend at least 5 dollars to use visa and I had no cash.\n\nBread was too hard.  Pickled carrots and cucumber were pretty good.  I could have used more jalapeno.  Pork was fine but sparse.  I would love to know what it costs them to make the sando.  Maybe 1.50 at most.\n\nI was a little turned off by the presentation of the waffle.  I know I'm not at Quince but they pulled the waffle off a little early and it was really soft.  He folded it in the to go bag and it formed a ball that did not resemble a waffle.  Tasted fine but did not look like the photo on the wall.  I'd go back but if I really craved a pork sando I'm headed to the Loin for the real deal.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "$4 for a sandwich in the FIDI...this made me instantly skeptical, but my coworker swore they were good. He wasn't lying! I tried the 5 spice chicken and it was delicious. It was my first Vietnamese sandwich and I am now a huge fan. I understand from other reviews that these sandwiches aren't 100% authentic, but regardless, I still really enjoyed my sandwich. \nIt consisted of a soft french baguette, flavorful spiced chicken, cilantro, fresh jalapenos (mmm), carrots, cucumber, daikon and a sauce that I think had fish sauce in it, but not sure what else. Overall, it was fast, cheap and tasted really fresh.", "author": "Rose K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "Lunch at the financial district does not come cheap.  Even the most mediocre places will charge you about 8 bucks for a sandwich.  I first tried this place when I was interning a few blocks up from Montgomery BART, and I trekked all the way to Embarcadero (in heels!) to try this little Vietnamese sandwich shop that everyone raved about.  Well...it wasn't bad, but I've had much better and more authentic tasting bahn mi's for about half the price.  Of course, at much sketchier parts of town too.\n\nOne day I went and they were out of pate.  WHAT?!  A bahn mi is really not a bahn mi unless you have pate in my opinion.  I foolishly went ahead and ordered it and it made my sandwich so sad and bland that I vowed to never eat a bahn mi without pate ever again.  The meat tastes pretty good, but the bread is really dense and chewy and not at all how an authentic sandwich should  be with light and crispy french bread.  \n\nAlso, the customer service really sucks.  I get it, it's a little takeout place and I'm not expecting anything beyond getting my order correctly.  But that doesn't even happen consistently.  Sometimes when I ask for no jalapeno the girl just stares are me and asks me to pay without writing anything down.  I get my sandwich and it is full of jalapenos.  If you are too lazy to even get a sandwich order right you probably shouldn't be working there.  Or anywhere for that matter.\n\nOH and I tried the green coconut waffle, and um...what is the big deal??  It tastes just like a regular waffle,  but green.", "author": "Nancy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "I really like this place and their bahn mi. They are very tasty and of good quality. I like mine with pate which is optional. The vegetables in my sanwitches are always crunchy and I love thier green waffles. \n\nThey also have fast and friendly service.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-09", "description": "I've probably been coming here way too much since they opened in June, but how can my Asian taste buds resist the banh mi?  Everyday I walk outside to consider what to have for lunch.  I look at Foccacia (had rotten chicken there once and WAY too pricey for salad), Subway (eh), Orale Orale (not bad actually, but I can only eat so many burritos before becoming one), but then I remember banh mi at Saigon Deli AND they sell Pocky sticks AND coconut waffles AND my favorite soy milk.  YES!  The sandwiches are pretty damn tasty, but you do have to ask for the pate.  Which isn't a big deal.   Right now I split time between Les Croissant and Saigon Deli.  It just depends on if I want bubble tea vs coconut waffles for the day.\n\nI was going to give a 4 star rating, but Eddy and Jack are the best.  They're always friendly and might hook you up with a free coconut waffle, if you behave ;)  YEAH!!!", "author": "Ehb T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-16", "description": "Ugh, I went yesterday and ordered special pork.  The pork was not special, just  tasted of mystery meat, just unseasoned, unappealing mystery meat.  The pickled veg was only carrot and tasted of nothing, the bread was soggy, it was just disgusting.  I did not get sick, it was so unlike a vietnamese sandwich and unmemorable, flavorless.  Ick.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "For a small spot in the Embarcadero, Saigon Deli does it's job... Good Vietnamese sandwiches (try their super combo!) and fast service. Only thing I can recommend is for them to add pork slice on their spring roll, otherwise everything is great!", "author": "Oliver C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "If you've never had a Vietnamese sandwich then this is an OK place to start. It's not the best, but it's a nice addition to the area and the price is nice. I had the chicken sandwich and it's pretty good, but the bread always cuts the roof of my mouth.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-09", "description": "I'm giving this place a 3star rating for the mere fact that the sandwiches are way too small and overpriced but the Green Coconut Waffle is off the chain!!!", "author": "Cat L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-23", "description": "Purportedly an offshoot of Saigon Sandwiches (http://embarcaderocenter.com/directory/dining/quick-service/saigon-deli-express/), which needless to say I was pretty excited about.  Unfortunately, the sandwich I got is NOT EVEN REMOTELY CLOSE TO AS GOOD AS SAIGON SANDWICH.   Saigon Sandwich, oh delicious Saigon Sandwich how in the world could you open a spot like this... a spot that makes truly terrible and lamentably close to inedible bahn mi... and then has the unspeakable nerve to charge more than the original for them?!?!?!?", "author": "Alicia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-07", "description": "The roast pork sandwich was pretty good.  It was freakin small for $4.50 though.  I ate it in two bites.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-06", "description": "Popped in to grab a quick bite to being back to the office...\n\nNever noticed this place so decided to try it, I grabbed their to-go bbq pork platters over vermacelli that they have brought over form someplace else. The meat, really good, great flavor, teh vermacelli on the other hand is dry, like day old noodles, that I don't like. This would be amazing if it was acutally warm. I will come back though an try their waffels, they smelt SOOO GOOD, I should of went with my gut and had a waffel, boo to me for trying to be concious of what I have for lunch. for now, I'll leave it at 3 stars, I'll bump it up after I try it.\n\nThe service was pleasant, a huge plus! especially in the Fidi!", "author": "S A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-09", "description": "I love the vegetarian sandwich (no tofu, just veggies) for under $4. It's tough to find something tasty, filling and moderately healthy for that kind of price. Indulge in the green coconut waffle (coconut flakes, pandan and coconut milk added to the mix) when you feel like a treat. YUM.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-24", "description": "Among the other food joints in the financial district, Saigon Deli Express is one of the few places I can go on any given day. 99% of the time I'll get the Super Combo sandwich and I'm never disappointed (though the coconut waffle is also delicious for those who aren't too timid to try a green waffle). The service is fast and friendly, I've arrived where the line was well out the door and still was able to order within a minute or two. You know the mark of a good restaurant when they runs out of food at the end of the late lunch hour because they get so many customers, so don't try to sneak in there at 2p. Also, the sandwiches are smaller than the average breed, but they're cheaper too, so if you're not someone that needs to gorge themselves with a burger, this is definitely up your alley.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-28", "description": "The classic combination was acceptable, but not great. \n\nIt's a bit on the expensive side (for banh mi) at $4.50, but considering it's in embarcadero 4, and there are not many alternatives, it will do. The sandwich was a bit small and I was definitely hungry after. I should have probably grabbed a bag of shrimp chips along with my meal. \n\nI also ordered the Thai iced coffee. It had more cream than I usually like, but was still strong enough to do the job. \n\nIf I happen to be in the area and craving a banh mi, I'll stop by. Otherwise, I won't be going out of my way to go here.", "author": "Michael J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-01", "description": "Good bahn mi, but not amazing.  I tried the chicken, so I will go back to try the pork.  I have to say, I think Les Croissants makes a better viet sammy.", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-18", "description": "I go to this place all the time.  I love their grilled pork sandwich, not to mention the meatball and the chicken sandwiches.  The green coconut waffles, made fresh while you wait, are to die for.  I really don't understand how people say that the Les Croissants place across the way is better.  This place has fresher ingredients, more flavorful, and their sandwiches are actually cheaper.\n\nBottom line, this place is great.  The service is top notch, the sandwiches generous in the amount of meat you get,  they taste really really good, and the prices are the best you can get around here.  My only problem with the place, is that I'm afraid I'll burn out on it by frequenting it too, well, too freqently.", "author": "FSK F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-08", "description": "Good spot to get a quick, cheap sandwich in the FiDi. I also like that they sell the tall cans of coconut juice. What I get consistently annoyed at though is that they always seem to sneak in huge slabs of straight-up rubbery fat in the pork sandwiches. It's a small sandwich, so it's not like there are huge mounds of meat in there. So you can understand why I get peeved with the inedible fillers. Or am I just wrong and I'm supposed to eat that part? Not trying to clog up my arteries here.", "author": "Flora C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-02", "description": "This is the second time I've visited Saigon Deli Express. I was lured by my curiosity of green coconut waffles and my love of Vietnamese sandwiches. \n\nFirst time I tried my luck at the coconut waffle. As I step up the counter, I see that they're making a fresh batch so I ask for two. The cook stuffs a couple of the ones that have been sitting around instead of giving me the fresh ones. He says that these are ready to eat.  I figure I should trust the cook's recommendation and walk off with my waffles. I find that they're both room temp and one is crispy while the other is flaccid. To top it all off, the they were  bland. \n\nToday I get a hankering for a Vietnamese chicken sandwich and decide to give these guys a second chance. As I get back to my desk, I uncover my sandwich to find that it's just chicken with pickled carrots. Where's the cilantro? What about the cucumber you advertised? It may have been better had you remembered to put that on. \n\nIf it wasn't for their sloppiness I may have gone back for another.", "author": "Erick V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-12", "description": "I am a big fan of bahn mi - unfortunately I don't think that Saigon Deli Express matches up.  \n\nThe meat in my sandwiches was tasty and not too greasy and while the rolls are okay they could be a little crunchier. Where they really fall down in my opinion is the pickled vegetables. To me pickles are the essence of a good bahn mi,  my sandwiches contained almost no daikon and the carrots were 'gasp' grated!  You simply don't get the same crisp satisfying crunch you get from julienned carrots.\n\nFor the time being I think the sandwiches at Les Croissants are tastier.", "author": "Ian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-11", "description": "I went during the lunch rush and purchased 2 pork sandwiches - one with no veggies, one with no mayo - for $4 each. Even though there were about 5 customers behind me in line, I was the last person to receive my order.  They had to keep remaking the sandwiches because they couldn't get the order right. When my lunch buddy and I finally received the order, we both found 2 sandwiches we didn't order.  My lunch buddy ended up taking hers back, while I decided to skip the hassle and start eating. Then to my surprise, there was one entire slice of fat in my sandwich. Gross! Never coming back.", "author": "Sam L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-23", "description": "Young Green Coconut Waffles- perfect snack on a workday downtown. And only $2. Theres one on stuert street as well.", "author": "Sasha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "i usually grab a sandwich from here once a week.  Favorite is the Classic with roast and fancy (steamed) pork, which is flavored with garlic.  They stuff it with finely-julienned carrots and a few jalapenos and then splash it with Maggi sauce. It's not an over-sized sandwich but it is filling.  The french roll is perfect, crunchy and airy (touch of rice flour?).  Cool sandwich dude don't say much, but you can always watch the movie they have playing.", "author": "H Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-30", "description": "This place is one of my go-to lunch spots.  Why?  Because the prices can't be beat, excellent quality, and fast service.  The banh mi sandwiches are very good, loaded with fresh carrots, cucumbers, cilantro and juicy, well-seasoned meat.  I really like their fresh spring rolls and vermicelli plates.  Got $5 to spend on lunch?  Saigon Deli Express to the rescue!", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-05", "description": "Very good shrimp sandwich and a very good coconut waffle. The guy running the place is friendly and engaging, and clearly passionate about bringing good Vietnamese eats to the the fine people of San Francisco. If only his sandwich prices were a buck or two lower.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-15", "description": "Ick.  To be fair, I got the pre-made beef noodles with spring roll, and not a sandwich or the waffle.  The \"spring roll\" was a greasy mess with a revolting taste.  The beef was tough and over seasoned.  The noodles were noodles.  All of this was $5.00.  I wasn't impressed and could not recommend this place to anyone at this point in time.", "author": "She-Ra .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-27", "description": "Holly Molly! Having a bad day full of bad news my husband took me to lunch. On our way back from Osha we stumbled upon this spot. The first thing to entice me was the coconut jello screaming my name from the refrigerator. But then I see them pouring something into  what looks like a waffle maker, I'm like what the heck is that. Sure enough after close inspection of the menu I see something fascinating called a Coconut Waffle!!! Oh heavens, I just had to try it. Delicious, yep its got a blueish green color to it but delish, the husband and I shared it on the way back to the office. I will be back cause I love me some Vietnamese sandwiches and I must try the coconut jello too!\nP.S. I made a return trip and went with the vermicelli/waffle deal all for the small price of $6.50!  The portion of vermicelli is small but with the waffle it was plenty, as for some jalapenos to give it a kick.  This is my new hotspot!", "author": "La C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-05", "description": "I am a frequent visitor to vietnamese restaurents/cafe's.  When my friend mentioned this new place I got to try it as my office is nearby.  \nBoy was I disappointed.  I ordered the combination (#1 on the menu).  First of all, the taste is way off compare to a regular vietnamese shop.  From what I can tell, instead of thinly sliced pickled carrots, it has shredded carrots which lost its crunch.  Not sure if it even comes with daikon or just cucumbers.  it is totally dry without any of mayonniase like spread that you normally expected in this sandwich. \n\nWould not go back again.", "author": "wyman y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-10", "description": "Felt like a waffle dessert today and was totally disappointed.  I asked for crispy and got a really undercooked, soggy waffle.  The dough was still dripping with no taste.  Had to throw the whole thing away.  Won't be going back anymore.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-10", "description": "their meatball sandwich and green coconut waffle are not bad.\ni liked the bread which was not too hard.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-19", "description": "I am so sick of this place's service.  I come here a lot looking for the shrimp sandwich.  They have enough shrimp to make me one about 20-25% of the time.  People, don't put something on your menu if you consistently cannot serve it.  I put up with that because it's not far from my office and the sandwich is good, but today was the final straw for me.  For once they had enough shrimp, so I bought a shrimp sandwich (which, by the way, is over $7, and is not very large), then while I was waiting decided I wanted a coconut waffle too.  The cashier refused to sell me one because I didn't have any cash and they have a \"$5 minimum\" for credit card purchases.  Never mind that I JUST SPENT $7.50 ON A DAMNED SANDWICH.  Um, and that minimum purchases violate your credit card company agreement.  I'm giving this place two stars because the sandwich and waffle are genuinely quite good by FiDi lunch standards, but I'm not coming back here anymore.", "author": "Sarah B."}
