{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-16", "description": "I've been coming to Sammy's for about 3 months now and I must say they are great! I have almost tried every sandwich on the menu. \n\nI always get Dutch crunch bread for sure. But as for my go-to sandwich, I like the 5th Ave. one with roast beef. It has cream cheese in it and I like to add the pickled jalapenos and banana peppers. \n\nSince I come here for my lunch break I look for quick, reasonably priced good food and this is the place! The days I don't get a sandwhich are the days I wish I for one. \n\nThanks again and don't forget your stamp card!", "author": "Brian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-15", "description": "Regular office lunch haunt. Decently priced, made to order deli sandos. Can often be inconsistent with the amount of protein you get (not all sandwich makers are equal) but it's fast even when the line is long and the ingredients are fresh. Get the chicken salad or a club and be sure to add the chipotle mayo.\n\nDon't forget your sandwich loyalty card!", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "So simple. So fresh. So delicious. I got the roast beef on a dutch crunch with pepper jack cheese, peppers, lettuce, tomatoes and mayo (~$9). They are 100% doing it right. You have got to try it. Perfect for lunch in the financial district. The people that work there are the kindest most helpful humans. Go!", "author": "Jamie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Only ever been to Sammy's for sammies. Go figure right? \n\nAnyways this is a go to for when I want a fancier sandwich than I can make at work. Often fairly quick if you can get there before or after the lunch rush. Never tried to create my own sandwich, instead I always go for one of menu options. Personal favourite is The Godfather. Might explain why I often only come here for a treat. \n\nThe line goes towards the back of the store and proceeds to the cash. Make sure to have your order ready by the time you reach the front so you don't slow everyone else down. The sandwiches are always packed to go, wrapped in plastic wrap.", "author": "Rajeev S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-28", "description": "His sandwiches are the bomb and well priced. Nice friendly service and great food. What else would you want?!", "author": "Moy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "This review is for the deli (yes it's inside the liquor store).  There's nothing hugely special about their sandwiches, but you get a good portion for a reasonable price.  I consider it a win if I pay around $10 for lunch in the financial district.  \n\nThere was a pretty long line when I got there, but it went by fast.  People were friendly and I was happy with the House Special.  Got hooked up with all that meat!  (see pic).  \n\nWould come back again if I'm in the mood for a simple sandwich.", "author": "Shannon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Whoaaa. They are always so busy & looks so clean but I ordered a sandwich today, guy came from the back with gloves already on. Ok fine, maybe they were new. He gets my bread to toast it & then he goes & touches the garbage bin to lock it, WITH THE SAME GLOVES! I pay cash, he helps me with the same gloves.  What I couldn't take was WITH THOSE SAME GLOVES HE HAD TOUCHED THE GARBAGE & MONEY HE USES TO MAKE THE SANDWICH!!!!! Soooo unsanitary. I'm not coming back. Disgusting", "author": "Diane Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "This is a typical customize-your-own-sandwich place, and they make a solid one.\n\nThe bread tends to be on rolls and not flat pieces, even the white bread. The bread is very slightly hard and chewy which I'm not a fan of. The rest of it is generally pretty good though.\n\nService is fast, although there can sometimes be a medium sized line.", "author": "Posu Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "Sammy's on 2nd is a sandwich shop inside a liquor store. Yes, you read it right .. It's inside a liquor store! \n\nThey have standard pre-customized sandwiches (for the lazy!!) along with the option of customizing the whole thing depending on your taste. I got the cold chicken salad sandwich on white bread with all the toppings and found it to be just average. \n\nMaybe it was the fact that I got the chicken sandwich but I'm not sure I'll come here again with Working Girls Cafe serving much better sandwiches just around the corner.", "author": "Gaurav K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "I ordered a regular roast beef and cheddar cheese sandwich on Dutch crunch. \n\nWhile I could get a roast beef sandwich anywhere, Sammy's stands out because the roast beef is high quality and the condiment ratios are excellent. There's something reminiscent here about my experiences on the East coast; corner store with a delicious deli, and the owner ringing up your order (except here, they do it with a smile). \n\nSince this place is close to my office, I'll be here again.", "author": "Sheewon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "This place has pretty good sandwiches. They're pretty big, and heavily loaded. Though the line can get long, it goes pretty fast.", "author": "Wyatt S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "My go-to sandwich spot for lunch. Very close to my office and the sandwiches are delicious. Basic convenience store with a bunch of different wines, snacks, cold beverages and a deli. I'm pretty basic so I always stick with turkey sandwiches and every once in a while tuna. The meats, cheeses and veggies are all fresh and delicious. Sometime a line during lunch rush but they move so quick. Everyone there is very friendly.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "I had a really great turkey sandwich, it satisfied my craving for sure. I really loved the place, seems very convenient for people who work and live around the area. The people were also very friendly and welcoming, great experience! I will definitely go back when I visit San Francisco again!", "author": "Maddie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "There isn't anything fancy about Sammy's, but it's a solid, deli sandwich. The price of lunch in SF has gone up a ton over the years, but Sammy's is one of the few places you can get lunch well under $10. The sandwiches are made quickly and are super tasty, and the service is always friendly. I almost always get salami + pepper jack cheese on a sweet roll - why mess with a classic?", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "New to the neighborhood and some of my co-workers turned me onto this place. Nothing fancy about Sammy's but if you're looking for a line that moves fast, below market prices and a tasty sandwich --- this is the spot! \n\nService with a smile too :)\n\nAnd, they have the old-school \"loyalty\" punch card; buy 10 and you get 1 free. Love it. \n\nI've been in SF for about a month and have probably hit this place up for lunch 4-5 times. You can get a fresh sub on almost any type of bread with all the fixin's for about $8 bucks... Not bad at all in this day-and-age and especially for the area. \n\nThey have hot and cold sandwiches --- I'm a creature of habit so I usually go with the ham and turkey on wheat with swiss cheese, tomatoes, lettuce, jalapenos and little mustard/mayo. \n\nSammy's also has a wide variety of drinks, chips, potato/mac salad and I believe you can get wraps as well. A favorite seems to be the hot pastrami sandwich but I have yet to try it. \n\nAnyway, not much more to add that hasn't already been said by my fellow Yelper's. \n\nIf you're in the hood and in the mood for a tasty, homemade sandwich --- this is the place!", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "This review is for the deli only...\n\nGreat bread, great meat, great toppings, great staff, all for $10.  What more can you want?\n\nI had the Italian with banana peppers and can't find one thing to improve about it. In and out in less than 10 minutes too at around 11:45 on a weekday.\n\nNicely done Sammy's.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "Lunchtime favorite. The cashier has replaced my stamp card twice when my purse/wallet were stolen (1 year apart) and been so kind about it. I didn't expect it either time, but it was such a sweet gesture when she recognized me and asked where my card was.\n\nI'm stuck on the same type of sandwich (turkey/cheese/avocado on dutch crunch), but sometimes I switch out for a different kind of bread or cheese. I'm always tempted by the hummus/tabouli/dolma in the deli case, but I never seem to get to it. \n\nSandwich-makers are quite efficient, even when the line curls back on itself. \n\nOtherwise there's a decent-but-space-limited wine selection, and a small section of snacks and other drinks. It's really more deli first, liquor store second. I can find some convenience items here, but I'm not usually here looking for them.\n\nJust a simple, efficient, tasty place! Doesn't get much better than that.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "Solid sandwich place for quick takeout lunch in SOMA. You can choose from around 6-7 different combos and the portions are big. They also have a big selection of alcoholic drinks, but it's not a sketchy place! Service is fast and efficient.", "author": "Ioannis K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "I really think there are three types of sandwich shops.  1 Gourmet sandwiches like Ike's 2 Good, but not cheap sandwiches 3 down and dirty, cheap options like Lee's or Subway.\n\nThis spot is more of a #2.\n\nNear work.\n\n$9.50 including tax.\n\nMeatball sandwich on a sourdough roll with everything except mustard - lettuce, tomato, onion, pickles, peppers, and mayo.  Overall the bread was excellent and the ingredients all tasted fresh.  The sandwich was big and filling.\n\nService was very friendly and the sandwich was exactly as ordered.\n\nThey did offer a lunch special with a basic sandwich, chips and a drink for under $10.\n\nA very good sandwich and my go to spot for a higher end sandwich.", "author": "Curtis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Sammy's is one of my favorite delis in San Francisco. I think very highly of the restaurant because of the food selection, staff, and convenience. Most times, I get a sandwich; the sandwich variety is adequate and the ingredients appear to be fresh. I especially like their Dutch crunch bread. When I crave something lighter, I will have some tabouleh or domas. The staff are always very pleasant to interact with and are very quick about getting people through the line. 10/10 would recommend to a friend.", "author": "CJ B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "This is a small store and they have really good sandwiches! Everything is fresh right from the bread ( multiple kinds) to their cheese and veggies. This is actually what subway should have been. The promise of fresh, healthy sandwiches and salad will be fulfilled here. \nThey have quite a bit of variety on their menu, egg, chicken, tuna salads. \nNot being a chain, it also doesn't get too much of a crowd even on busy weekdays during lunch. It's also much faster to gate a sandwich made here compared to subway. The sandwich is also very very filling. Not as long as a foot long but quite fat with ingredients.  \nIt's also easier to eat than a subway footlong, they cut it in half and pack the two parts on top of each. \n\nThe staff is also nice and friendly. And the best of all- they take Apple Pay! I've been paying via my watch ever since.", "author": "Arjan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Had the pastrami sandwich on Dutch Crunch with havarti cheese and it was absolutely delicious.  To top it off, service is always so friendly and they offer a stamp card for every 9 sandwiches you get a 10th free.  Great value, delicious sandwiches, friendly service.", "author": "Yrene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Started coming back to this place after a hiatus, don't know why I stopped really.  But I love coming here for the Pastrami Sandwich on a Sourdough Roll, not sure what it is, but it's my go to when I can't decide where to eat.  You can get a sandwich w/o cheese, soda and chips for about $10.30. lol.  I think I just enjoy that sourdough roll too much.  I usually go here at 1 when then line dies down and I can get in and out of there real quick.  This is basically your typical deli, but it's inside of the shop where there you can get liquor and other items.  Very convenient, as it's down the way from work.", "author": "Jeremaine R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "I love this place for what it is, a simple sandwich / lunch spot to pick up an go.  Their ingredients are really quality, and a large variety of meats / cheeses.  It kicks the crud out of anything nearby!  I love coming here, oh and side note, it was the store in \"Fruitvale Station\" and the owner was in the movie.", "author": "Sunshine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "A nice deli and liquor store. A family owned place, and they have some good affordable wines.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Sammy's is a liquor store and deli. The have a decent, beer, wine and liquor selection. Definitely fine if you are grabbing a six pack or a bottle of red.\n\nWhat Sammy's is really about though is lunchtime deli service. It's fast, reasonably cheap (for the financial district), and delivers a good old fashioned deli sandwich.\n\nThere's nothing fancy here as far as sandwiches go... if you want an Sandwich adventure try sentinel around the corner. But if you like cold cuts, fresh bread, mustard, mayo and the fixings Sammy's is the place to go. The Italian Hoagie on Dutch crunch is my favorite, make sure to get the olive oil and oregano.", "author": "Daniel O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "This place was recommended to me by a random girl in the elevator at work. We asked her where a good place to get a sandwich was and Sammy's on 2nd was her immediate response. Today was my second time going here and had another great experience. You are able to choose your bread, protein, veggies, etc. (subway-esque) but better.\n\nThe first time I went around 1pm and the line was almost out the door (it is a very small hole-in-the-wall convenient store type place). I got pastrami and everything on it (lettuce-tomatoes-onions-mayo-mustard-peppers) and added cheese and avocado (extra $1 or so for each). This sandwich was MASSIVE!! somehow managed to eat the whole thing though...\n\nToday I went and ordered a turkey wrap with everything on it, which they warm up for you--almost like a panini. We went around noon and there was no line so definitely going to be coming here on the early side from now on...\n\nDefinitely a great grab-n-go lunch spot, but no places to sit.", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "I like coming here because they're close to work, really efficient and quick and they make a pretty darn good Sammie.  I suggest not going too late, since they might be out of the meat, cheese or bread you want.  All the Sammies I've tried (the Italian, BFS, Turkey & Salami and Pastrami) have been really good.    The staff are really friendly and helpful.  They put a good portion of meats and cheeses on each Sammie and I like the French Roll or Dutch Crunch the best.  \n\nNot a \"sexy\" place, but very efficient and priced right.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-15", "description": "I (and my wallet) have never been so sad after getting a sandwich :(\n\nI went in to Sammy's mostly because it was the last of my work's neighboring restaurants that I had yet to try. \n\nMenu seemed superb and I ordered a BLT with Avocado on Dutch Crunch. On the menu, it said sando comes with mayo,mustard, onions etc etc and pickles upon request. I was so excited to see all there sandwich goods and even let the lady behind the counter know i did want pickles and extra peppers...\n\n\nI was handed a sando with literally just a few slices of bacon, a leaf of iceberg lettuce and a few tomato slices! All for $8 and some change!!!! No pickles, no peppers, not even enough tomato to justify the T in BLT. I was so so disappointed, Never coming back here again. Lee's up the street hooks it up with a Sandwich double the size for $6", "author": "Ami D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-13", "description": "Sammy's makes some delicious sandwiches and the line is much shorter than Algiers. The sandwich was made of chewy Dutch crunch pastrami and avocado. I like that they offer soup, tiramisu, and a variety of convenience store goods.\n\nIt was really good but tough to compete with miss tomato and Algiers which are about $3 cheaper and bigger!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-01", "description": "A very decent sandwich place with friendly staff. I ordered the daily special and received a sandwich and soup for just about $9. It was an extremely filling meal - the sandwich was very meat heavy and the soup very rich. Although the store doesn't have any special decor or features (its basically a take-out only joint), and is pretty much disguised as a liquor shop, the great food makes up for it!", "author": "Sameer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-15", "description": "Attention all sandwich lovers! Check this place out :) Sammy's on 2nd makes fresh and tasty sandwiches. I was introduced to this place by a co-worker one day for lunch and have been coming back ever since.\n\nStaff is very friendly. Menu is easy to follow - they have a few sandwiches you can choose from OR make your own!\n\nToday I tried the Dutch Crunch Roll + Roast Beef + Pepper Jack Cheese + all toppings (tomato, lettuce, jalapenos) + spreads (mayo, mustard). It was super tasty and very satisfying.\n\nPROS\n-HUGE sandwiches! I usually eat half for lunch (and keep the second half for dinner or lunch the next day). \n-FAST to order! I've never had to wait more than 5 minutes to get my sandwich. They do a good job of keeping the line moving.\n-Can mix and match meats - get half portions of 2 different meats. They're really flexible.\n-Variety of chips and drinks to choose from to add to your meal", "author": "Grace J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "LOVE these sandwiches :)\n\nGreat lunch for under $10 in the FiDi.", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Idk what it is about this convenience store/deli but it is LIT. I never knew a sandwich could be this good. Owner is super nice and patient cause Im a pretty indecisive person when it comes to food cause I always want the best and this place has it!", "author": "Navdeep D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Sometimes I just want a really good deli sandwich. Nothing fancy, you'd think, but still surprisingly hard to find in these parts.\n\nI came in at 12:45 on a week day and had just one person in front of me. My ham and cheddar sandwich was assembled lickety split and I was tucking in in record time (had I gone to Mixt Greens, I'd still be queuing)! \n\nIf you want a solid sandwich, that's totally customizable, Sammy's on 2nd has you covered!", "author": "Miriam W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Love Sammy's!! I always come here and get a BLT sandwich and the girls are so nice and friendly. The sandwiches are also awesome so I'm here a few times a week. Highly recommended.", "author": "Mira B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-10", "description": "I sometimes go to Wise Sons for their delicious but pricey pastrami sandwich,  so when I heard Sammy's has decent pastrami sandwich, I was very excited! I went there for a Thursday lunch and skipped my usual Thursday routine - japacurry. After finish eating the sandwich, I am half happy that I tried something new and half sorrow that I missed japacurry.\n\nSammy's is very close to where I work - only 1 block away, and the pastrami sandwich is ok, not bad, but I guess I like it toasted rather than served cold, so I guess I will ask them to heat it up next time. Looking forward to my next visit.", "author": "Cheng C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "This is a great little whole-in-the-wall lunch spot. I love that you can get any sandwich on a lettuce wrap rather than bread. My favorites are the turkey club and Italian hoagie on lettuce wrap. The price is a little steep for a sandwich, but they do have a frequent buyer card that gives you every tenth sandwich free. \n\nService is always enthusiastic and friendly. Ingredients taste fresh and of good quality. Nice variety of chips and desserts.", "author": "Elizabeth C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Surprisingly good deli in what looks like a liquor store.\n\nHave been here numerous times and the ingredients are alway fresh.  My fav is a tuna salad sandwich with gouda on rye with jalapeños.  The tuna salad has been fresh every time I have been here--and it is hard to hide skanky tuna salad.", "author": "Bob F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-25", "description": "Sammy's is a bit farther away from my work that what I'm used to.  Since the Sentinel is so close by here, it almost feels like blasphemy to go to a \"regular\" sandwich shop when I can have the sweet taste of corned beef or rare roast beef from the Sentinel less than two blocks away.\n\nBUT, I never can say no to a good sandwich and when my coworker told me about Sammy's existence, I initially was hesitant.  I already at least six sandwich places in my rotation so seven is a bit much because it faces some pretty stiff competition.  I went there on a Thursday with an open mind.\n\nIn certain respects, Sammy's is not so well known...there isn't a huge long line out the door like Algiers or the Sentinel.  They also don't do salads like Cafe Venue so I don't need to be delayed by all of the leaf eaters.  They have about ten specialty sandwiches as well as make your own option as well.  Cheese and double meat are extra.  I saw bologna as one of the meats on their Italian sandwich and since I haven't bologna since I was nine years old in third grade, I thought why not?\n\nThe line didn't take too long as the somewhat small lunch counter that they use pumped out sandwiches quickly.  I wanted dutch crunch but they had already run out and it was only 12:30!  Even on sourdough, the sandwich was pretty good and the bologna...well I didn't really taste since I had salami in my sandwich which just overwhelms everything else.  I also really liked how they cut and wrapped the sandwich.  They did it in plastic wrap and they did a clean cut through the middle so that you don't have to cut it yourself.  \n\nGood bread, good sandwich, relatively fast wait time.  Probably the only drawback is that it's a bit more expensive than what I prefer.  Cafe Algiers is still the cheapest sandwich around by a dollar to two dollars and this place has most of their sandwiches priced at around $9.  As to whether Sammy's becomes a part of my rotation, it shall be answered soon enough.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "This is like subways, you make your own sandwich. I got pastrami and havarti cheese on dutch crunch. Although the name of the bread suggests that it is crunchy, it is in fact very chewy. The pastrami has a smoky flavour. The sandwich was of medium size with a good quantity of both meat and vegetables.", "author": "James S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "Great little hole in the wall sandwich shop in the financial district in SF. They make really decent subs really fast. Don't be too discouraged by the line because it goes really quick. Decent size sandwich and nothing super fancy like some of the bistros in the area with little skinny sandwiches. Good size roll for not a bad price anywhere from $7-$12.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Great sandwiches. I've been here twice so far and I know I'll be back again before the end of the month. The workers are friendly and the store has snacks and alcohol as well. Super customizable menu but I like the Chicken breast sandwich.", "author": "Sean P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Located around the corner from our offices Sammy's is a great place to go to get a bite to eat in warp speed. If you catch the line at the right time you can be in and out within a few minutes with a great sammie made by Sammy's Angels. There is a nice selection of drinks, chips & snacks available to help complete your lunchtime cravings. \n\nOnly the freshest ingredients, incredible dutch crunch and top notch customer service! Don't hesitate to ask about catering if you want to feed the crew at work or have a meeting you need to bring lunch in for. Trust me on this... Your tummy will thank you.\n\nP.S. - This is a liquor store as well just in case you need to grab a bottle of vino to take home or want to grab a cold one to go. \n\nKeep up the great work! See you next week.", "author": "Josh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "A sandwich place in a liquor store? Or a liquor store in a sandwich place? Either way, Sammy's quickly has become a go-to lunch place for me. The sandwiches are large, filling, and reasonably priced, and you can also opt for their lunch special and get a soup or salad for a little bit more. There are lots of veggies and a good selection of meats - I opt for a pastrami with all the vegetables, on dutch crunch if I can get it. The dutch crunch tends to run out during the lunch rush, so the best bet to get it would be to come before noon. With three different kinds of mayo and two kinds of mustards, the possibilities here are almost endless. Definitely worth checking out!", "author": "Wayne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "The fact that I have never written a review for this place is a travesty.  \n\nNot only is the food consistently amazing - the bread and meats incredibly fresh - but the service is absolutely top notch; hearty smiles, friendly voices, and delicious food.  \n\nPro-tip - get the Italian Hoagie.  You'll regret eating the whole thing, but you'll enjoy every minute of it.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "The boyfriend and I were looking for wine to bring over to his sister's place only to find that most shops that sell liquor around SoMa close at 7PM...  WHAT?!?!  So after using my handy Yelp app, I found Sammy's on 2nd, which opened until 11!\n\nThere is a portion of the wall with stacks of wine bottles and their descriptions.  The price ranges from low to high (we ended up walking out with a $50 bottle of wine).  In addition to wine, they also sell beer, sandwiches, snacks, cigarettes, and other typical items you would find at a convenience store.  The owner was very friendly as well.\n\nSoooo... if you're in SoMa and you're looking for beer or wine (or apparently great sandwiches from the other Yelp reviews) at a late hour, stop by here!", "author": "Annie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "I had one of the oddest sandwiches at Sammy's. It's their $7.99 House Special, a pita stuffed with hot pastrami, Swiss cheese and avocado wedges along with lettuce, tomatoes and red onions (see photo). It was a head-scratcher when I ordered it out of curiosity, but then I devoured it at work and thought it was unusually good. Maybe because the combination tasted decadently fattening for a lunchtime bite. I could barely manage to keep the ingredients from making a mess on the melamine surface of my desk.\n\nThe entire deli selection in the display case looked good, mostly Mediterranean fare from what I saw and very nicely presented. On the other side is quite a selection of wine, beer, spirits, and other beverages. In other words, if Armageddon happens while you're strolling on Second, I'd duck in here since you'd be set. Yes, this one is definitely a cut above most delis in the city, so I'll be back. Now I'm assuming Sammy refers to the owner, though I keep thinking the logo is a tribute to Sammy Sosa. Am I wrong? Somebody tell me.\n\nFOOD - 4 stars...really creative, decadent sandwich...give me more\nAMBIANCE - 3.5 stars...clean, well-organized...sadly no seating\nSERVICE - 4 stars...friendly and fast\nTOTAL - 4 stars...could become my go-to deli stop", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "What I ordered: \n+ Turkey on Dutch Crunch (A-)\n\nFrom ordering to paying and out the door was a 5 minute operation. Even during lunch hour with several other people in the tiny space I can expect to wait no more than 10. Shira W. and I didn't even get to finish the story of my parents buying VIP Taylor Swift tickets for their anniversary!\n\nThe speed of service does not reflect the quality of sub, I was having a Love Story with my sammy as my stomach was growling to the beat of You Belong With Me. Very filling but won't send you into a food coma like that Quesarito I got last week from Chipotle...I Knew You Were Trouble.\n\nThe only good thing about lines is the chance to gossip with your co-workers outside the office. With little to no wait and a sandwich so good it was devoured before I made it back to my desk, know that Sammy's on 2nd is not a good place to go if you have Taylor Swift stories to share.", "author": "Jason O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "Can't deny, that was a pretty solid sandwich.  I came in to grab a quick bite and went for the itilian.  It's a pretty simple place and the sand itch bar doesn't look like much but it turns out to be pretty darn good.  They put a ton of meat on there and topped it off with pickles banana peppers, tomato and lettuce.  Seasoning the bread with  vinegar, oil and Old Bay were just right and made it a great quick dinner for only $10.  Efficient, easy and good; Sammy's will be on my list going forward.", "author": "Cameo W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-16", "description": "Solid place for a quick sandwich, and the staff is really friendly. I was drawn in by the high reviews, and the place is nicer than your average bodega, but for whatever reason I don't understand the excitement.\n\nFor such a small store, it looks like they stock every imaginable type of liquor, snack food, and candy, which is impressive. If I need a tic tac, I will definitely stop by.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "i love this place .why because :\n\n- the people who work here are great ,everyone is friendly and welcoming.,,", "author": "Aghlab Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "Good quick lunch option.  I usually go with the Italian which is the best I've had in SF.  Friendly service and overall good sandwich stop.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Sammy's on 2nd is a great spot for a deli style sandwich, . . . individually prepared to your own \"customized specifications\".  Ask for their punchcard so that after you buy 9 sandwiches, the 10th one is free. (See photo.)\n\nIn addition to it's deli counter, Sammy's is basically a Liquor Store.  I get the sense that the deli counter may have been added later, to what may have originally just been a small Liquor Store, as a way of bringing in some bucks during the lunch hour from the SOMA lunch crowd.  However, Sammy's makes some of the best deli sandwiches to be found in this area.  It can be surprisingly difficult to find good deli-style sandwiches, and I find myself coming back here regularly when I've got a hankering for a well-made deli sandwich.  Of course, the \"buy 9 get the 10th free\" promo provides an inducement to frequent this place as well.\n\nSammy's is a carryout only spot.  There are no tables or chairs, so plan on either returning to your office to munch down . . . or, if the weather is nice and you're looking for a nice spot to enjoy your 'wich away from the office, consider heading up to the Crocker Galleria Rooftop Garden Terrace, which is just 1/2 block away atop the Wells Fargo Bank at the 3-way intersection of 2nd & Market & Montgomery. \nSee:  \nhttp://www.yelp.com/biz/crocker-galleria-roof-terrace-san-francisco#query:Crocker%20galleria%20rooftop%20garden", "author": "Joel E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "this is like a mom n pop Subway (plus corner store)\n\nlike subway, they have an efficient sandwich assembly line that lets you customize as your roll comes thru. from zero to wrapped sandwich in about 60-90 seconds.\n\nbut unlike subway, they have premium ingredients. their cheeses taste like they are from whole foods, not the seven eleven.  it's not fancy schmancy either, just quality. my favorites are chicken salad or egg salad with smoked Gouda on a sweet roll plus all toppings.\n\nalso unlike subway, you get real service with a smile from people who take pride in their store instead of teenage cashiers just going thru the motions so they can save up to buy a pink iPhone. not that I am offended by aloof teenagers or anything, but a glad-to-see-you smile goes a long way during a lunch break.\n\nspeaking of iPhone, if you're an apple nerd like me, they take Apple Pay here!", "author": "Jimming C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "One star for the vegetarian sandwich option. There isn't much on it and for $7.49 you are basically paying for bread with Mayo and Mustard on it. To top it off, the soft roll was actually hard.\n\nThey could benefit from having sprouts and olives as well.", "author": "Nikhil V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-31", "description": "i get random cravings. Sometimes to the point where I think I'm pregnant. (I'm not) Tonight was one of those nights. I wanted pastrami. Working in the Financial District at night leaves little options for someone hungry after 6pm. I used my nifty Yelp app and found this place just a few blocks away. I'm already looking forward to coming back here.\n\nI got pastrami on dutch crunch with pepper cheddar, lettuce, pepperocinis, and tomatoes. I originally wanted sourdough but they were out. The Yelp reviews said the dutch crunch was the way to go. I usually don't like it because it's too hard on my teeth, but theirs was soft and delicious. The cheese was something I dream about: a good kick to level out the pastrami flavor. \n\nNot only do they have delicious sandwiches, YOU CAN BUY BEER AND LIQUOR HERE. Where has this place been all my life? Actually, where was this place when I was in college?\n\nif you can't already tell, I'm a big fan. The employees were super friendly and were just a bonus to the good food. My only quip with this place is I wish the sandwiches were bigger. They are too yummy and I want more!", "author": "Alie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Sammy's is the FiDi/Mission corridor's version of a neighborhood bodega, only brighter and cleaner than average, with a fairly comprehensive deli counter and a surprising array of liquors. The sandwiches themselves are perfectly decent, with many options for bread, fillings, and toppings. \n\nWhat for me would normally warrant a 3-star review is upgraded to 4 by the fact that, if you live in the neighborhood or are working late there, it's open late and is a dependable choice for quick, casual takeout. Moreover, the owner and staff there are super warm and friendly. A nice, random find that I'm pleased to see is loved by Yelpers too.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Walked past the Senor Sisig truck on my way to this place today. I estimated that it would have taken half my lunch break to get something from the truck, even though it was only 11:40. Line was already super long. At Sammy's, I walked right up to the counter and was out about sixty seconds later. The place was clean, the workers were polite, and the sandwich was tasty. Pastrami with provolone on dutch crunch. Just the right amount of mayo. Ingredients all tasted fresh. Sandwich was a good size. Filling without inducing a coma. I was finished with my meal by the time I probably would have gotten my Sisig order. The truck is good, but not *that* good.\n\nSammy's is just a regular hole-in-the-wall convenience store with a deli, the kind you might walk past a hundred times without giving a second glance. But when you work in an area where any remotely talked-about lunch place has a line out the door from 11:30 to 1:30, low-key places like these that serve good food quickly are very welcome.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "This review is for the deli, though Sammy's also has a selection of convenience store items and a substantial beer/wine/liquor selection.\n\nSammy's On Second is the closest thing to a true NY style deli I've seen in San Francisco. Their sandwiches are inexpensive and delicious (the egg and chicken salads are amazing). Even better, the deli is open late. If only I lived closer!", "author": "Johnathon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "Quick deli sandwiches that do the trick!\n\nNot much else to say.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-11", "description": "I've been giving these people business and the sandwich maker overcharged me.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-08", "description": "Food: 3\nDecor: 2\nService: 4\n\n1. Italian Hoagie (ham, Italian salami, mortadella, Provolone cheese, oil vinegar & oregano and vegetables)\n~Okay. Decent, although I would have liked it more if the bread were toasted.\n\nService was fast.", "author": "David L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "One of the best sandwich spots I have been too by far with great service plus if you enjoy a good salad try them all but the pasta is the best.", "author": "Dino S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "I love this sandwich place. You might think, Ok, woah, they're just sandwiches. And while they are, they're just so damn good.\n\nChoose your everything: meat, cheese, condiments, vegetables, the whole shebang. They have also composed their sandwich masterpieces for your perusal, as well.\n\nPerhaps my favorite part, though, is how quickly they wrap the sandwiches in saran wrap. It's mesmerizing. \n\nThey're also super nice, which is great.\n\nThe good: zomg, sandwiches.\nThe bad: sometimes they run out of gouda. Also, get there at 11:50 before the lunch rush, and you will thank yourself for being so smart. High five.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-23", "description": "I'm (almost) always wiling to admit I was wrong.\n\nAfter over a year, I finally went back to Sammy's and had a very different experience from last year.\n\nThe counter guy actually SMILED and greeted me when I walked in, and whipped up a pretty good mortadella and swiss sandwich for me:\n\nhttp://www.yelp.com/biz_photos/eZ2_6Wx-Lqp_mLtG6-zzTg?select=0LbwjubU3oOxyYTHdzTnhg\n\nSandwich, chips and a peach came out to $9.17. Sammy himself was manning the register and joked \"Bah...I don't like small numbers!\" and rounded the price down to $9.00. Yeah, it was only 17 cents, but it was one of those nice little moments that makes me feel appreciated as a customer.\n\nSammy's has officially been added to my lunchtime rotation.", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-23", "description": "Sammy's has become my go-to sandwich place for lunch in downtown. The cashiers are always nice, and the food is just so damn good. It's shocking, you'd think a sandwich place wouldn't stand out among all the other lunch options around here, but Sammy's is legit. I stick with the turkey and swiss on dutch crunch with the usual sandwich veggies (except tomatoes, but people just tell me I'm weird when I say that) and avocado! Great addition to the sandwich. The sandwiches are nice and big, and they have a good drink (both alcoholic and non-alcoholic) and chips/side selection too. The line gets a bit long during lunchtime but they're good at moving it along; I've never had to wait more than ten minutes before. Definitely recommend.", "author": "Nikhil S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-23", "description": "Meh. Ingredients are fine but overall the sandwich is pretty bland. It's like a fatter version of subway. I got the Italian Hoagie - the dutch crunch bread was not crunchy at all, besides the meat there was just a thin leaf of lettuce, a slice of tomato, some peppers, and vinaigrette. No yummy sauce. Perfectly acceptable meal but I could've made it at home for significantly less than $9, or got a smaller version at Subway for $3.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-16", "description": "Sammy's is tried and true and a regular in my lunch rotation. They have a top notch, uber efficient, made-to-order sandwich bar, which stocks an Army-level supply of Dutch crunch (or tiger bread or giraffe bread, depending on where you hail from). Oh, and their meat portions are quite generous. My go-to is the Italian hoagie. \n\nGetting picky, the East coast boy in me is quite sad that they don't have sweet peppers. But other than that, Sammy's all-the-way for delicious (and fast) lunchtime eats in SoMa!", "author": "Matt T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-04", "description": "Delicious sandwiches and super fast service, even during the lunch rush. Would definitely recommend.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "Move over BFF there is a new BFS in town! No seriously dude move, I'm trying to eat my Big Fat Sandwich.\n\n\nGot introduced to Sammy's on 2nd last night and Sammy's I have to say it was very nice to meet you. \n\nStarving like Marvin and just wanted something simple like a sandwich. Ordered takeout @Sammy's. The lady was very nice & let me know that they only had sourdough. Not a sourdough fan but I was hungry so I just went with it. \n\nLittle spot that I assumed was greenbacks only but to my surprise accepts plastic. Also this was close to 9pm, so they're open late too (I mean 9pm is pass most sandwich places bed times, so it's late for a sandwich spot). \n\nGot home and the sandwich was good but there was so much meat & cheese that it kept sliding out every time I took a bite. That's actually a problem that you'd like to have so I'm not complaining. \n\nThis is a solid place for a quick sandwich. They have salads and mediterranean food too. \n\nAs I said before it was nice to be introduced to Sammy's and I'm sure I'll be seeing them again.", "author": "Troy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "Pretty good convenience store. Sandwiches are just average. Definitely overpriced at $10 a sandwich. I'd much rather opt for the Sentinel which is only a block away.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-10", "description": "Very good deli sandwiches, but I feel like its missing a little kick to push the sandwich up to 4 star status. I dunno if I went on an off day, but my sandwich was definitely not as big as some of the ones posted on yelp. \n\nThat being said, I ordered the roast beef sandwich and the roast beef was very good. They sliced it right in front of me and I thought it was on par with a lot of other roast beef I've had before. I wish they had some horseradish though because I thought it could have used a little extra spiciness. The vegetables were fresh, and they keep it simple which is nice. Nothing worse than having to go through an entire list of vegetables telling them what I want and don't want.\n\nI was left feeling a bit dissatisfied though. It's a cold sandwich, and it honestly didn't fill me up as much as I had hoped. Overall the place is very efficient and line moves rather quickly. I'd recommend it over Subway if that's where you were planning on going anyway.", "author": "Cody M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "This place is SO GOOD and they close later than the usual lunch spots in SoMa. I usually get their Italian sub (creature of habit) on a soft roll which is simply delicious. They also double as a liquor store/corner store but don't get me wrong this place is incredibly clean. \n\nThey've an amazing selection of wines, soft drinks, and yes, candy. The service is fast, friendly, and even though there's a lunch crowd they can whip up my sandwich...sorry..sammy in no time. \n\nLunch under $10? Yes, please.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "Ever hear of the broken window theory?\n\nWell this is one place that isn't going to suffer from slippery crimes any time soon. It's one of the most immaculate liquor stores I've ever been to.\n\nThe man behind the counter, who I presume is Sammy, is extremely personable. It was 8 o'clock so I can only assume the dinner rush was over, and everything moved pretty quickly.\n\nI got a chicken sandwich with everything on it -- they ran out of dutch crunch, so I had the roll. And it was phenomenal. The best grilled chicken sandwich I've had. Of course, I just came back from burning like 500+ calories, so that probably gave it a boost :D\n\nIn conclusion: This place is awesome. About 9 bucks all in for the chips, soda, and delicious sandwich.\n\nTip: They have an appreciable wine selection, being an immaculate liquor store. Next time I get a sandwich I may indulge in a bordeaux.", "author": "Christophe C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "Been coming to Sammy's for 2 years now and they are the best. \n\nVery consistent and awesome sandwiches.", "author": "Taylor T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-18", "description": "I've been wanting to try this place for a few weeks now and decided to take the plunge today.  I walked over at about 1:40 p.m. so I missed the lunch rush (yayy!).  The women who work there were very friendly.  I ordered the Italian Hoagie which consists of an Italian Triple Threat, salami, mortadella and ham on sourdough.  The woman making my sandwich was careful to ask me if I wanted all condiments to which I replied Yes!  While she was making it,, the anticipation of biting into it grew so much that I almost twisted my ankle trying to run back to my office so I could hurry up and eat it (Note: I do have on 4 inch heels).\n\nIn office - unwrapped my lovely cellophaned companion and took a big huge bite.  I did have a hard time wrapping my mouth around the width of the sandwich but I managed.  I really like that they have both peperoncinis and jalapenos, it adds a little kick to the sandwich.  I also liked the oil and vinegar.  \n\nWhat I didn't like - if anyone has had the opportunity of traveling to Italy, one knows that the key to a good Italian styled sandwich is the thin slices of meat.  The mortadella and ham were both sliced entirely too thick for my taste.  I also ordered extra mayo because I don't like a dry sandwich and while I am not sure she if she fulfilled my request, the sandwich was a little dry and did not appear to have the \"extra\" mayo that I requested.\n\nBottom Line - Once you get down to the overall taste of the sandwich, it is just a basic sandwich, not at all worth the nearly $10.00 I spent.", "author": "Aisha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "Why didn't I know this place existed? I've been getting off the same bus stop which literally stops 2 feet away from this place and I never even glanced to see what's inside.\n\nIts underwhelming exterior aside, this deli has a great selection of sandwiches that are fresh, sizable, and customizable. I mean, what else can you expect from a deli?\n\nWhat pushed this place to a 4-stars is its convenient location and the lack of a humongous line at lunch. It's basically the same sandwich they offer at Cafe Algiers without the line of people who go ape-shit for a basic deli sandwich.\n\nI'll come here again. Especially when I'm hungry and I don't want lunch to be a big deal. Sometimes you just want some meat between two pieces of bread, you know?\n\n-----\n\nDistinguishing factor: A sandwich that will not disappoint, made perfectly the way you want by smiling owners.", "author": "Nick A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "What a find! Never knew this place: 1.) Existed; 2.) Served sandwiches inside (I guess if I didn't know it existed than 2 wouldn't matter...)\n\nWalking inside, I was a little hesitant since it is a convenience store as well, but then after that first bite into my chicken salad sandwich, I was def. glad we ventured into this new place.\n\nThere was actually a lot of sandwiches to choose from off their menu. It was between the chicken salad and roast beef for me, and I ended up going with the chicken salad. There was pretty good depth of flavor to the chicken salad, and it wasn't overwhelmingly mayo-e if that makes sense. The size of the sandwich I would say is about 1.5 servings. More than enough for one person with a healthy appetite.\n\nOnly gripe if I had to pick one would be the small chips selection, but that's about it. Probably going to go back to try out their other specialty sandwiches.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "This establishment has superb sandwiches. Today I went during the 12:15 lunch rush and I found that the line moved extremely fast. I was in and out in under 10 minutes! I ended up getting pastrami with pepper jack cheese on Dutch crunch bread and it tasted great. The only reason I give this great sandwich shop 4/5 is because it is overpriced. Like seriously, who charges 0.80 cents extra for cheese on a sandwich?!?", "author": "Rob G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "We always get our sandwiches from here, and it's exactly what you'd expect!  BLT's are great, roast beef is pretty good.  They have a nice selection, nothing too fancy, and decent drink options too.  \n\nI think it's a little pricey, but what do you expect for the area?", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-01", "description": "Just finished eating and had to review!\n\nI got here late at night and granted there were not as many options as there would be in the day time, however I tried the Fifth Avenue (not a big fan of pastrami) and I have to say it was amazing!!!!\n\nEverything tastes amazing and fresh and the owner(?) was very nice!\n\nI recommend going here and don't forget to pick up their stamp card! 10th sandwich is free!", "author": "Nina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "I've been a few times, and these guys are fast, affordable and friendly, and they have good selection on sandwich fillings. I like their potato salad a lot too. The line moves fast even when there's a crowd. They also keep making sandwiches into the afternoon, which is nice when I have to work through lunch.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "I just ate my first turkey sandwich from Sammy's On 2nd and I am sure it will not be my last. Where to start? The dutch crunch that is the perfect spongy vehicle to get meat, cheese, and veggies in my belly? The quality of their deli meats? The awesome fresh veggies they put on their sandwiches? All of those are true but what I think is the best part is that everyone who works here is insanely friendly and attentive. \n\nI recommend you go get yourself a Sammy's sammy.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-01", "description": "Same good Sammys I remember when I used to work at CompUSA and they used to be on Sutter St or somewhere there. Excellent sandwich. I'm eating a chicken breast sandwich on dutch crunch with pickles, lettuce, tomatoes, and a little mustard. I may have to spend a little more, but it's worth it over the same chicken breast sandwich I could buy at a chain sandwich shop which tastes a bit more bland. The store is well lighted inside and the employees here are warm and friendly.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Solid, no-frills sandwich shop that moves quickly even if the line is long. It's probably pretty easy to forget given how many great lunch options there are in this area of the city, but if you need to grab something quick and are looking for a sandwich with a legit amount of meat, look no further. It's also a good one to keep in mind now that the Toaster Oven (a previous favorite for me) has closed.", "author": "James H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "Solid little deli spot with friendly service. I had a plain ol' pastrami on rye ($5.99 paid cash, but cards are accepted) and it really hit the spot. In a case like this, I don't need anything fancy, but I would like it done right, and these guys can do such a thing. \n\nLunch Companion got the House Special and wasn't exceptionally stoked on the pita. I tried it and it was fine - not my first choice, though. The rye did me plenty right. The fillings were fine, though, there's not a ton of meat on the sandwich. That's fine with me. I'm kind of over being demolished by a sandwich like when I go to Deli Board (still good, but screw my afternoon, brotha). \n\nThere are a bunch of items in the deli case, a lot of Mediterranean bits like lentils, falafel, dolmas, hummus and tahini. Otherwise, there are convenience items, a nice wall of wine and some cigars -basically, partytime.", "author": "Roy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "Sammy's on 2nd is a small deli inside a convenience store.\n\n== Food ==\n\nYour basic type of sandwiches can be found here. I had a good BFS. That's what they called it. A Big Fat Sandwich, which is three types of meat and two types of cheese for ~9. Great portions for that amount of money.\n\nTheir dutch crunch bread is pretty good. Definitely recommend getting that.\n\n== Service ==\n\nThey're quick and fast! The orders I made are done correctly.\n\n== Overall ==\n\nOverall, it's a good sandwich place. I like their sandwiches. There's nothing special, but it's a great standard issue sandwich. The customer loyalty card sweetens the deal here!", "author": "Steven B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-21", "description": "This isn't just a liquor store/deli, this is a friendly neighborhood shop that you look forward to going back too.\n\nWe ended up here the first time one evening at about 1AM after a movie and had the sudden urge for a deli sandwich. Sammy was happy to make us two great tasting sandwiches and explain his great tasting cheeses to us. Maybe because this is still a new location but he let us sample a few different flavors of cheese before deciding on our cheese of choice. Do yourself a favor and just take his recommendation, this man loves food.\n\nThere is also a wide verity of sides. Salads to amazing Greek treats. The verity of bread was also a pleasant surprise and made for a large tasty sandwich.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-23", "description": "I got the pastrami and it was honestly nothing amazing to me. For $7, and for all the rave this place gets, I had high expectations and Sammy's just didn't cut it. The sandwich wasn't flavorful and tasty like a great sandwich should be. I don't think it's worth it. I've had better sandwiches, way better sandwiches. It was a good sandwich, but forgettable.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-20", "description": "Sammy's feels less like a fidi work option and more like a neighborhood deli. The people who work there are really friendly, the prices are affordable, and the service is quick. Unfortunately, not too much on the vegan front other than falafel (which is better at Sunrise, but cheaper at Sammy's.) I'm more inclined to come here to get chips and a coke (and avoid the always packed Walgreens on New Montgomery.)", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "I don't typically eat sandwiches for lunch (Paleo Diet), but on the odd occasion where I find myself in a bind, Sammy's Italian Hoagie sandwich is to DIE for.  They stack this sandwich with a ton of AMAZING meats.  Even though Subway is just another half a block up, the quality of their meats makes it worth the small price increase and a cheat day!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "Quite possibly the best cold sandwich in San Francisco may be Sammy's American Hoagie! If not in all of SF, then certainly in the Financial/SOMA area. \n\nThey consistently make it exactly the same way, all the way down to the pickle and pepper placement, which shows they care and know how to make a killer hoagie. I'm note certain all the stuff it has on it (it says on the menu), but sandwiches are all about ratios, and it's got all the ratios perfect, from the amount of mustard and mayo to the care with which it's all spread about on the roll. They obviously know that a good sandwich is all in the details! I do the Dutch Crunch, but they've got a selection of rolls.\n\nWhen I need a no nonsense sandwich - no frilly foo-foo croisssant exotic BS, this is it! It's actually big enough for two lunches, but I've never been able to stop eating it at the half way point. \n\nA tiny place with no seating but you can walk kitty-corner across to 101 2nd to an inside public seating area.", "author": "Ken M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "Four stars for opening late.  \n\nIt's hard to find a deli with decent sandwich after 6pm.  They were opened when we walked in around 10:30pm.  Actually, they just cleaned up the deli section but both the owner and the person behind the deli said they are happy to make us a sandwich.  Thank you for accommodating to hungry souls!\n\nWe got the Italian hoagie for $7.95 on dutch crunch with everything on it.  Enjoyed music and browsed around while waiting.  They have quite a selection of piroshki - quite tempting, maybe next time.\n\nThe sandwich itself was ok - the bread was a bit soft for dutch crunch but I'm not complaining at 10:30pm!", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Each falafel is 75¢. Walk out with four falafel for $3, along with some hummus and you have a value lunch. However, when it's a lunch rush you may not get the hummus. When it's the down time it's more likely. Their sandwiches are enormous, and sure there isn't sriacha-roasted truffle drips on them, but they're enormous, likely near your office, and serviceable. That's really all I've got here. Also, the service will get you in and out in under five minutes.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "I go to school nearby and this is my favorite quick affordable sandwich spot. Every 10th sandwich is free. I've already had about 4 free sandwiches. Sammy and the other employees are amazing. \n\nI only order 2 things because once I find a favorite food of each category, I stick to it:\n\nChicken breast sandwich on sourdough (spice it up): Very simple but very fresh and tasty. I love tangy sandwiches so this really hits the spot. They put vinegar and seasoning on the chicken, and include onions, pickles, jalapenos, lettuce and tomatoes. Like I said simple but still so tasty.\n\nFalafel sandwich: they mash up the falafel and wrap it up with some tomatoes and some sauce. Very yummy!\n\nFalafel sandwich: VERY YUMMY!", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-11", "description": "Get your sandwich on the Dutch Crunch roll. I either get the turkey or roast beef, its pretty good!!! I wish they had some sauce to put on it besides mayo an mustard, like garlic oil!\n\n\nHey Sammy's I bet if u make a garlic oil to put on your sammy's people would LOVE IT", "author": "Jess O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "Ah Sammy's...my go-to deli when I'm looking for a quick and affordable meal in a convenient location. I always gravitate to the roast beef sandwich on a toasted sweet roll with pesto sauce. You can't go wrong with that item, I'm telling you!!!\n\nYou can get a combo meal with a drink and chips for about $9-10. Keep in mind that you can get a stamp card and you get a free sandwich after your 10th purchase!", "author": "Jeannie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "Sammy's on 2nd. Okay here is my breakdown. The sandwiches are great, the people are great. From the outside it looks like another corner store but inside there are great women, making great sandwiches. Why the three stars then? The reason is because I don't think I should be paying nine dollars for a sandwich off the menu. It is delicious, and well made, and the service is amazing, but I would much happier paying 7 dollars versus 9.", "author": "Matthias K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "This is the best sandwich in the 2nd and Market area.\n\nI get the turkey on a roll.", "author": "Brooks D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Great food, broad selection, low prices, fast service, friendly staff, open late... What else do you need?\n\nYou can get a vegan Mediterranean plate for $6.95 for lunch and then come back that night for a bottle of whiskey and European chocolate bar.", "author": "Dylan .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Why is a deli getting a 5 star rating? Because they carry Kinder, and if you've ever been to Europe, you know this is the most bomb.com chocolate there is!!\n\nThe owners are super super nice, and everything is really fresh.  I got a turkey avocado on dutch crunch and my coworker got the hot pastrami (which they definitely didn't skimp on).  The owner also gave us 2 stars each on our frequent sandwich card for being new customers, woohoo!  I will definitely be back.  (Plus, their walls are lined with wine...hello!!!)", "author": "ashley B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-16", "description": "It's just after 11pm. You are close by. Yelp said you were open. The big posted board outside your establishment stated you were open. But your door is locked and even though you are vaguely smiling you are waving me away. I don't think I'll be coming back here anytime soon..", "author": "Char B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-12", "description": "Scored a surprisingly good pastrami sandwich from Sammy's.  Loads of meat, served in... pita!  Very cool.  High quality meat, good avocado.  I believe the price was $8, which was fair given the quality of the sandwich -- but not so much the plain-looking deli with no seating.", "author": "Bill H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "Great staple in SF for a good sandwhich everytime. \n\nThe deli meats are all good, and my personal favorites are the dutch crunch and the house mayo.\n\nCan also pick up some friday office beers for good weeks.\n\nSammy is the man.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "All the positive reviews about Sammy's are spot on. At first when my friend said we should try it, I was a bit skeptical. I knew what it was at first, walk by it dozens of times on my way to the bus. Didn't realize what a good sandwich place this was.\n\nThe owners/staff are extremely nice and very patient with what you want on your sandwich. The sandwiches are well-made and delicious. I recommend the 5th Ave.... cream cheese with pastrami. Sammy, the owner, also recommended the Meatloaf with some hummus, I will have to try that soon (maybe today).", "author": "Michael C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "What? What is it? There's something on my face? And my shirt? On the ceiling too? \nOkay, that last one was a slight exaggeration but the house special from Sammy's was the messiest sandwich my hands have attempted to hold in years. At one point I remember even trying to cup the sandwich as if I was its human finger diaper, to catch the constantly escaping accompaniments. \n\nThe reason though Sammy's gets a 4 was because the sandwich was damn tasty and I did alter....  Yes (with eyes looking to the floor) I did alter the house special to be on a sourdough roll instead of pita. So maybe it was my blunder. If you happen to stumble upon Sammy's I would recommend getting the sandwich as they're listed.\n\n The sandwiches are modestly priced and the staff is genuinely nice even during the lunch rush as they yell at each other in Spanish. \n\nGo and check em out but bring a bib just in case.", "author": "Spencer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "Something changed in the matrix.\n\nSo there is this new place that just opened up 6 months ago around the corner from my work.  After reading the reviews I decided to check it out as I do most of the places within a short walk from my work.\n\nThe 1st thing that happened was a strong sense of déjà vu.  Did I see a store, and another that looked just like it or the same store twice?  I was so taken aback that I almost collided with the lady restocking the perrier.  Haven't I seen her before?\n\nI ordered the italian on baguette.  He squirt a vinegar oil mixture on the bread.  I knew he was going to do that.  I knew what it was going to taste like in the sandwich.  He piled on the cold cuts, lettuce, tomato, peppers...  my mouth watered in familiar anticipation.  He cut the sandwhich in half and wrapped the two halves together so you could see the filling in the middle.\n\nSuddenly I found myself a few years in the past when I worked near the corner of Sutter and Kearny.  There was this cute little sandwich shop that was really clean, made great sandwiches and had a decent selection of liquor.  What was the name of that place?  I thought.  Sammy's!\n\nI found myself talking to the owner behind the register.  They had just moved location RIGHT AROUND THE CORNER OF MY WORK!!!\n\nNow I knew what had changed in the matrix.  Someone up there must love me.\n\nScore!", "author": "Theron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "Perfect place to grab a quick sandwich for lunch. In case it wasn't obvious, there's NO SEATING INSIDE, just grab and go.\n\nThe Italian sandwich on dutch crunch bread is excellent, but I treat myself to a BLT every so often. Notably, they are quite generous with their use of bacon in their BLTs (big plus). I find myself coming here twice a week or so.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-04", "description": "NICEST FOLKS EVER. \n\nThey have some kind of homemade mayo concoction... orgeno, pepper, something or other? RECOMMEND\n\nsort of disappointed that the sprouts aren't organic, SO SHOOT ME\n\nOOH! They have a frequent sandwich buyer card. VALUABLE", "author": "Ellen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-12", "description": "Even if their prices might have gone up recently,this is still the first place you would want to grab a sandwich from. This is because they are still offering very affordable and tasty products. The vegetables are quite fresh. I love the chicken and egg salad mix. also, I appreciate the fact that I don't have to wait long for my order.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-15", "description": "I went here based on all of the Yelp reviews. \nIt was lunch time, just after 12 noon. While other places had lines out the door, Sammy's seemed like a safe bet. \nI waited in line, but only for a few minutes. They get you in and out pretty fast. \nInstead of a sandwich I got two pre-made calazones. One was a spinach/greek blend. One was with mushrooms. I think I ate the spinach one. I had them warm it up before I left. They do that in a microwave. \nThe result was a soggy, unappetizing pocket of mush. \n\nI think I will go back and try their sandwiches. They look proper.", "author": "joanna r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-22", "description": "Solid sandwiches and friendly service for a reasonable price. Pastrami is on point. Keep doin' whacha doin', Sammy!", "author": "Meesh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "The house special with pastrami and Swiss on pita was great for a quick bite on the run.  They have a decent beer and wine selection and the sandwiches are tasty. I'll definitely try it again.", "author": "Clint N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-05", "description": "I work right upstairs from Sammys and I gotta say... nothing but love for this place.  I mean, who doesn't love Sammy and his crew?  They are always so sweet and kind, and their sammies are bomb to boot\n\nthere is never a long wait, and the sandwiches are always perfect.  I can't complain!", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-11", "description": "Quality food and friendly staff are usually what makes a deli stand out to me, and Sammy's certainly has those. However, their selection and policies are what stood out the most -\n* Over 120 different wines available in addition to the soda case and moderate selection of liquor\n* Hours extend to 10pm nightly, and according to Sammy himself, \"If the lights are on, we're making sandwiches!\" It's nice to find a FiDi option at night that isn't McD's or high-end restaurant\n* Free sandwich on your birthday with an Academy of Art University ID card\n* Mediterranean food (dolmas, falafel, etc.) in addition to deli sandwiches\n* A commitment to high-quality meats; I can actually taste the difference!\n\nThey also do catering, and with this quality level, you'll be sure to impress everyone eating!", "author": "Bill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "Saw this place come in across the street from the office and finally decided to give it a shot. They advertise a lunch meal deal for $6.99 with sandwich, chips, and soda.\n\nThe inside is very clean and the sandwich preparation area is visually appealing with tons of fresh veggies, cheeses, and meat. Move over Subway, you got some competition on 2nd and Market! I was pleased to find dutch crunch as a bread option on the menu. Sammy's certainly doesn't skimp on the meat -- my turkey sandwich was a hefty and delicious looking thing once completed, and it was equally yummy while eating. There are a variety of other meats, salads, and sides available. \n\nThe only downside I noticed was that they charge for cheese on your sandwich and I'm slightly annoyed that the guy didn't mention it to me at all until I asked why my total was so high when paying (almost $9 with tax for what I thought was a $6.99 +tax meal). It would be nice for them to mention it while you're making your sandwich so you can avoid the charge if you don't really care for cheese.\n\nI'm definitely a fan and will likely be back. This is way better than any of the other places on the block. It's no $5 footlong but you'll be just as full from all that delicious meat in your mouth (yeah, I had to go there) as you would have been 2 doors down at Subway. And as a bonus you can even pick up some booze to get your drink on back at the office if the workday has been kicking your ass! ;-)", "author": "Farhad M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-04", "description": "Usually a little skeptical of deli's in liquor stores, but this place is pretty great. Nice fresh ingredients and a good choice of meats and options. Pretty simple and straight forward moderatley priced sandwhiches. They also have a mediterranian section with dolmas, calzones and paroski's that look delicious and make me want to come back to try. \n\nGreat place if you want a decent simple deli sandwhich at a resonable price.", "author": "Uriah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Just like the sandwiches I remember growing up with ... love, love, love Sammy's.", "author": "Tania S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "Sammy's you are too good to me! I love your sands, they are amazing. Such good quality of meat and bread (which they get delivered every morning, so its FRESH). Special shout out to the roast beef - YUM! \n\nGood lunch spot for a quick, inexpensive sandwich to go.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "Love Sammy's! The sandwiches are delish, everything is so fresh and and the bread (esp the Dutch Crunch) is yummy. Also everyone that works there is super nice and the service if quick. Great place to go for lunch!", "author": "Katelyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Excellent sandwich and perfect service.  I ordered a turkey, avo and bacon and when the gal opened the avocado she deemed it not adequate.  I love that attention to detail.  This is really my bosses place but I have to have a Sammy's at least once a week.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-15", "description": "Fast and friendly service en when they are busy, Sammy's has fresh deli ingredients and a nice selection of fresh breads for sandwiches. My personal fave is their chicken salad on Dutch Crunch. So good.  Even if I end up eating at my desk while working, that Sammie alone makes the day better.", "author": "MJ M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-03", "description": "Sammy recently moved from NoMa to SoMa and fortunately he brought along his excellent sandwiches. Wheat rolls, fabulous chicken, tons of veggies, the magical price of $6, and everything with a smile.\n\nQuite a few options if you are digging other kinds of meat and fillings. And trust me, dig you will.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "Sammy's makes a solid sando. They pack plenty of meat and it's a fair price.  Also, really nice staff. 4 stars might be a stretch for a simple sandwich shop, but when all your craving is a simple homemade style sandwich, Sammy's delivers every time.\n\nFYI. If you're looking for a fancy gourmet giant sandwich, this is not your spot. This is the kind of deli you go to 1 or 2 times a week for reliable solid lunches that don't put you in a food coma.\n\nLastly, make sure you put the spicy mayo on whatever you get. Big Fan!", "author": "Paul F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "I've had several good experiences here. They have a nice Italian hoagie on dutch crunch. I happened to wander in here after seeing a nonsensical line next door at Caramba Mexican Restaurant. \n\nThe people are friendly, and they had a frequent buyer card for a free sandwich. I will be back many times, you maker of fine sandwiches!", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-15", "description": "I used to frequent Sammy's when it was located over on Sutter.  Luis and Sammy are two of the nicest guys you could have make your sandwich for you.  Sandwiches are delicious and always made perfectly to order.  I haven't been to the new location yet, but can't wait.\n\nOh yes, and the chicken meal is one of the best deals in town.", "author": "Bonnie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "The deli ingredients are good, the place is clean, and the prices for the location are reasonable. Add friendly staff, and you've got a solid place.", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-18", "description": "Am I lucky or what?! Sammy's used to be close to my work and now that they've relocated, it's on my way! Sammy and his team are super sweet and I love passing by to say hello and grabbing my snacks for the day.\n\nThey couldn't be more kind and they have everything you'd need to put a smile on your face.\n\nI also found out that they deliver and cater 7 days a week! I don't know about you but, I'm excited about the possibility of having a late night craving of a nice bottle of wine and a Sammy's sandwich and being able to get it delivered!", "author": "Shelley C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "Nice big portions of meat! Lines aren't too long. Good sandwich choices and a great price.", "author": "Isaak H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Fresh made sandwiches that are sadly becoming increasingly popular at lunch time. \n\nThey don't skimp on the meat and they offer a frequent buyer card that I've completed twice already (10th sandwich free).\n\nWould also recommend the homemade cookies next to the register. 50 cents each.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-21", "description": "I've got to deviate from the general consensus here and say that my experience with Sammy's was somewhere between lackluster and mediocre.\n\nI ordered a BLT with avocado on dutch crunch. It was all bread, and chewy, almost stale-tasting bread to boot. This came to a whopping $7.35; no chips, no drink, just bread with some microwaved bacon and about three puny slices of tomato, a layer of lettuce, and a microscopically thin shmearing of avocado. What a rip-off. \n\nI feel bad giving them 2 stars, because I feel like this place has potential beyond this mediocre sandwich experience. They've got all kinds of goodies, from Mediterranean food, to your typical newsstand snacks and sundries. It might have been an off day, maybe a new employee, but it was bad. I don't have much desire to go back, but the occasional lack of complacency with my usual haunts might pull me into Sammy's tractor beam once again.", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Dude.  5 stars.\n\nBeen in San Fran 2 days and already been here twice.\nGood wine and good hummus (and other fresh mediterranean food), to go.\n\nPlus--they are really, really, really nice.", "author": "Cynara L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "Not only do these hot mamas use the freshest ingredients (or ingredientses, if you're Teresa Guidice) but they're all so friendly, it's like I went to my aunt's house down the street and had her make me a sandwich. My coworker commented on how well-stocked the deli case is, too. From calzones to dolmas, and an assortment of candy, chocolate, and mini bottles of wine you could probably sneak into AT&T park -- they got you covered. Anything your little heart desires is hidden away here inside this liquor store. Especially the fancy shmancy diamond ring one of the ladies that works here wears -- I almost went blind staring at that bling!", "author": "Anita A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-11", "description": "Oh how I LOVE sandwiches from Sammy's on 2nd! You have to get their Dutch Crunch bread - I am telling you it's the best in the entire city because it's not terribly hard where it makes the roof of your mouth hurt. And the flavor, ahh SO good. I'm getting hungry just thinking about my turkey on dutch crunch with all the fixin's. Seriously, go try it!", "author": "Michelle J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-29", "description": "I met Sammy, he's the cat's pajamas. I got a roast beef on dutch crunch with everything on it and highly recommend it. I also asked if they would put hot sauce on it, and it was a great executive decision on my part. It's a very hearty sandwich, cut in half and ready to munch. I will be going back again!", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "Sammy's is my favorite place to get an Italian style sandwich. They get their sandwich meats from Giovani's in North Beach, The oldest it alien deli in SF and another of my favorites, and the Sourdough bread is absolutely the best I can remember having on a sandwich. If you appreciate quality meats and real bread on your sandwich, then this is the place to go. For a sloppy, saucy, cheese covered experience, go to Ike's in the Castro (if their still there...) \nAn added bonus is the great selection of Mediterranean fare, and wines. \n\nEnjoy!", "author": "Hayley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-28", "description": "Got a roast beef on dutch crunch with everything and horseradish cheddar. It was ok. Needed more meat. I've been craving roast beef but I didn't get much. I'll try that place in Chinatown next time.", "author": "Devynne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-04", "description": "Well, I'm impressed and will surely be back for another Turkey Hoagie... The sandwiches are big and the meal deal is a good price. \nI go agree with the past yelpers that the service is no BS- just get your order in and get that sandwich made, perfect!", "author": "Janell D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-21", "description": "Sammy's is the best deli in the area - I go here at least 1x per week\n\nGood service, great quality breads, meats and cheeses and there is even a frequent eater card where you get your 10th sandwich free! In addition, the sandwiches are good size - I can usually only eat half for lunch and can save the other half for dinner or the next day", "author": "Molly P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-17", "description": "In a wine/beer store this deli is pretty decent but the line can be pretty daunting. A decent sandwich place overall.", "author": "Brooke G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "I'm have a pretty harsh sandwich rubric, but this place does a nice job.  Sammy's is super clean and fresh looking inside.  They sell wine on the back shelf and the rest of the small store is a deli.  The service was very good and the preparation of the sandwich was great.  Very high tech in the place too.  I had a basic roast beef sandwich with cheese and the whole thing came to ~$7.  Not bad for the area.  The sandwich was very good too.  There was nothing totally different about it, but all the ingredients were fresh and I'd gladly go again given the service and the cleanliness of the place.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "Had a pastrami here on a wheat roll. It wasn't bad, but for $7 I think should've received two of these. Yeah, pricey for what you get.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "This is the only place where I've actually gotten all the stamps on the \"sandwich card\" and gotten the free sandwich. The sandwiches are all good, and the prices are great by Financial District standards. I once got a platter of dolma from here for an office party - very good stuff. The coffee is good too. Super-clean, very well-kept place. They also have an excellent selection of wines, very convenient when you need to bring something with you to a party right after work.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-08", "description": "Nondescript storefront but, man, The House Special! A hefty sandwich made to perfection. Make sure to get it with everything!", "author": "Brian R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-16", "description": "There was a music festival nearby and they didn't serve any hard liquor. Boo! So we spotted this shop before heading into the event. The owners were so nice and told us what we should and shouldn't do. So awesome of them. Cool people. I will frequent this place again!", "author": "Anne T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "Solid sandwich! Decent deli meats and decently prices. Very friendly staff.", "author": "Elle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "It was solid. Roast beef with everything on a roll. Simple, quick and cheap, I'd eat there again", "author": "Cody H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "Its really tough to make an above average sandwich.  Sandwich competition in the city is fierce. Somehow these guys manage to.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "Sammy's just reopened a few weeks ago, and I'm happy to have found it. My coworker and I have been looking for a good deli in the neighborhood because we were tired of Specialty's. \n\nSammy's is perfect! Great sandwiches, fresh produce, good meats! And everyone there is really friendly and helpful. Plus, a sandwich and a side of fruit was only $8 -- so it's also a pretty good deal for lunch!", "author": "kittCAT L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "Not a bad little deli. I had the Mediterranean plate, and it was whipped up pretty fast. The food was good, and I can't complain about the price, either.", "author": "Wes T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-16", "description": "Despite the tables they have outside, I always thought this was just a liquor store, but apparently they have an amazing spread of lunch options in their deli.  Try the roast beef, salami or any one of their hoagies and discover how grubbin' they are.\n\nServed on excellent soft french roll, sourdough slice or roll or dutch crunch, their sandwiches are a great deal and just flat our rock.  Take a look at their sides, salads and Greek food options, they're sure to have something that fits your appetite.\n\nAlso, remember to get a \"Buy 9 Sandwiches and the 10th is FREE\" card if you're a returning customer.", "author": "Jonathan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-14", "description": "Sammy's Smoke & Snacks made a great lunch sandwich for me today.  I had roast beef w/ everything on dutch roll.  There was the right amount of meat, lettuce and tomato were crisp, and the roll was very tasty.\n\nI was in downtown with appointments and stopped by Sammy's.  This will be my place for my downtown deli sandwich!", "author": "Janet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "I was missing my neighborhood sandwich shop today, so I went on Yelp to find a Sandwich place, Sammy's on 2nd is right across the street.  I bought the Turkey with Pepper Jack Cheese on Sourdough roll.  Yummy!  Service was fast and friendly.  I will be back!\n\nIt's a sandwich store tucked inside a liquor store.  That is where some of the best places are.  I'm going back to try the peroski's.", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "Good sandwich, hole in the wall. reasonable price", "author": "Carl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "Friendly service. Extremely clean store and sandwich prep area. The sandwich was freshly made and delicious", "author": "valentin p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-25", "description": "The house special was great. I loved the avocado added to the warmed meat and melted cheese. The only bummer was the mustard wasn't great. I feel like if they're going to specialize in sandwiches they could have some better mustards. A bit pricey for a student at about $10 for my sandwich and drink but it didn't leave me hungry or wanting more.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "Gagg (GRAB AND GO GRUB) lunch in the downtown part 2\n\nAnother one of my lunch time go to spots in the downtown area.\n\n Price - Awesome prices, they have a sandwich deal which I believe is $7.00 for a sandwich + chips + soda.\n\nFood - The sandwiches are pretty good and big.\nI always get the turkey on Dutch crunch roll - and it totally satisfies my cravings.\n\nCustomer Service - No b.s. service - to the point and concise.\nNever really talked to the owner, but seems like a good guy.\n\nA good place to stop by when you're in a hurry and need things fast and done right.", "author": "Edwin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Sammy's may be a liquor store but this place has awesome deli style sandwiches.  I go here pretty often, just got a free sandwich for my 10th purchase.  The guy behind the counter making the sandwiches is all business but he makes a mean one.  If you like your sandwiches with a little kick ask him to spicen it up for you.  I have no idea what he puts in them but it definitely adds to the flavor.", "author": "Ayaz M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-19", "description": "A very affordable sandwich shop with a nice and friendly staff.  Their frequent buyer program is easy, and I love their soups.", "author": "Kris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "this afternoon, being a friday, my co-worker and i decided we needed a little happy hour in the office.  we admired the beer selection and settled on hoegaarden.  however, hoegaarden requires a lemon.  which they had.  and sliced it up for us!  then we realize, hoegaarden requires a bottle opener.  which they had.  right next to the condoms.  is there anything this place doesn't have?\n\nnext time i will have to go for a sandwich...", "author": "Erin G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-09", "description": "Some colleagues and I ventured a bit further from our usual 3-block radius to go to Sammy's for lunch. I got the veggie sandwich on Dutch crunch, along with the soup of the day. With better bread, it would easily be 4 stars, but none of us actually liked the bread that much - maybe it was just today's batch, but it was extremely chewy, unlike any Dutch crunch I've had before. The rest of the sandwich (construction + choice of cheeses/veggies) and the soup was quite good for the price. We'll probably try it again at some point, but this first visit didn't get us hooked.", "author": "Vinay B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-04", "description": "Sort of expensive for what you get and really slow. I ordered the house special and it sounded good but then made no sense. The pita bread it was in was dry and way over stuffed so it fell apart in my hand. And to add to that the mustard was just drippy. Overall I was not pleased", "author": "Greg G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-03", "description": "Maybe my expectations were set too high by the other reviews here but I didn't see anything special about this place. I ordered (I think it was called) the middle eastern plate and it was pretty alright but forgettable.\n\nThey definitely have price going for them though. In an area of town where it's hard to get lunch for less than $12 you can get by on $5.", "author": "kavin s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "Totally agree with everything that's been said thus far.  Surprisingly good sandwiches.  Very clean.  Staff is very nice.  I eat here a few times a week.\n\nIf you're looking for an excellent, fresh sandwich, I can't recommend Sammy's highly enough.", "author": "K F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "I love coming here!  Everyone who works here is so nice and friendly.  They are truly a hole in the wall/mom and pop sandwich and convenience store.  They have all kinds of snacks including chips, candy, ICE CREAM and a wide variety of ALCOHOL and nonalcoholic beverages.  But the main reason I come here is for their sandwiches.  I can't really stomach Subway anymore because their ingredients don't taste as fresh.  Sammy's has all fresh veggies and they get their bread delivered every day.  They also offer awesome combo meals for less than $10.  They have a deli type area where they sell empanadas, Pierogis, tuna salad or chicken salad, and different pasta salads.  If you loooove sandwiches, I would definitely recommend coming here.", "author": "Leah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-17", "description": "Today was the second time in one week that I found myself at Sammy's buying copius amounts of alcohol before 9:30 in the morning.  The guys working behind the counter just give me the once over, shake their heads a little and charge me for the bottles.  \n\nSammys is a small place, but they always have what I need.", "author": "Tamar N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-30", "description": "The sandwich was okay I guess, but the guy was talking on a bluetooth or something the whole time which was kind of rude.", "author": "Grant M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-21", "description": "I am lazy and often short on time, and this is across the street from my work, and serves their purpose well and efficiently.  They have a great deli which makes wonderful sandwiches made to order, plus your typical mini-mart convenience for beverages and chips/snacks.  Friendly staff, clean atmosphere, frequent buyer card....all around awesome new spot!", "author": "Christina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-01", "description": "Love Sammy's! \n\nThey are always so friendly and take the time to recognize regular customers and their usual orders! They do a great job making a quick real deli sandwich that tastes delicious. \n\nAlso they have a frequent buyer card so every 10th sandwich is free!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-07", "description": "Not very tasty. Poor quality products. Stale and chewy bread.", "author": "C L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-10", "description": "Wonderful little sandwich shop.  Lots of meat options, including some great mortadella.  Won't break the bank, everything is fresh, and service is fast.  Will definitely be coming here again.  There's no seating, and the parking meters on 2nd(or Jessie) are super-thirsty, but it'd be a great place to prepare for a picnic... just pick up a couple of sandwiches, a bottle of wine, and head to dolores park/stern grove!", "author": "Mike R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-01", "description": "The store is very clean & tidy. But the Falafel sandwich was very unpleasant to eat because the way it was constructed the pita was split in half. The ingredients spread so when you bite into it stuff went all over the place not fun!  They  specialize in mediterranean food and can not get a Falafel right.", "author": "BE L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "The sandwiches were great and the Middle Eastern fare above average. I was disappointed there was only one soup selection (Vegetarian Vegetable).", "author": "Karen R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "This place has some good vegetarian options and bagels for the morning. They also have a card that will get you a free 10th sandwich. Its not too expensive and i recommend trying it.", "author": "Tim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-22", "description": "Not sure why a small hole in the wall store has the BEST sandwich's ever! But the food is great and workers are very nice!", "author": "Cathy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "I've been to Sammy's twice so far. The first time I went to Sammy's, I got to talk to Sammy for about 15 minutes, we had a great conversation about Palestinian/Israel relations, as he is Palestinian and I'm Israeli, so we are making peace over food, awesome! I asked him for a recommendation for a something to eat and he said that I should order the sandwich that he makes for himself, which is a chicken breast sandwich with onions and other good stuff. I've gotten his sandwich twice so far and it is really tasty. Looking forward to going back!", "author": "Shai G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-02", "description": "Sandwiches here are solid. Just the usual, bread, meat, cheese, lettuce (romaine!) tomato, pickle, pepper, mayo and mustard, but it's really good.  All for $5-$6.  And for a small dirty looking place, its very clean inside.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "I'm psyched that Sammy's has moved even CLOSER to my office so I can get my Dietz & Watson Roast Beef fix.  Everyone's friendly in here.  I think the secret's out!!", "author": "Tony T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-08", "description": "Excellent lunch deal in Union Square.  The turkey sandwich that I ordered was piled high with turkey...and they have 2 varieties of mustard....and red onions...and a nice variety of cheese for such a small place.  Quite true that you aren't getting ambiance, but for $5 a more than enough sandwich who cares?  Sammy's father-in-law rang me up, and seeing his mid-day smile had a positive effect on my boring afternoon!", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "Tasty, fast and cheap, the egg salad was really good, but the whole wheat bread a little bit dry, perhaps because it was late in the day. Good drink selection. The service was fast and straightforward. Definitely worth the $5!", "author": "Alison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "Reasonably priced sandos found here. Staff is very friendly. Buy 9 sandos, get the 10th gratis!", "author": "Maureen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-08", "description": "I love Sammy's, it is my favorite place to get a sandwich.   Everyone is extremely friendly and you can't beat the price.  They also have an excellent beverage selection.", "author": "Jenny R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-03", "description": "Love Sammys - I can get a great lunch for around $5.  Sammy always has great music playing and he and everyone is always friendly.  Great sandwiches, and wonderful soup.", "author": "Dorian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "Best salami sandwich in SF (aside from Molinari's).  Great rolls, German potato salad used to be the best but they discontinued it..  Sammy won't let you down.", "author": "andy r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-11", "description": "what a find! and thanks Dor for taking me here.  From the financial district, only a couple blocks, and a great sandwich for about $5.  Everyone really great.   Never a crowd, quick in and out. Better than all the local alternatives...", "author": "Steve G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-26", "description": "Great place to get that lunch time sandwich and not break your pocketbook. Sammy, the owner is always warm and welcoming! Forget 7/11 and go for the quality!", "author": "Maggie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-20", "description": "I had the Roast beef: Decent sandwich- not bad, but didn't blow me away either.  It's good to find little sandwich places near Union Square for a quick meal, but  I would not go out of my way for this...", "author": "Will B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-10", "description": "Great sandwiches, and one of the few sandwich places open (relatively) late near the Financial District.", "author": "Gregory K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "Great New York style deli.  Sandwiches are always fresh and made to order at a reasonable price.  I had been eyeing the ravioli and decided to get it...BAD choice.  If I wasn't mistaken, it tastes just like Chef Boyardee...really guys?", "author": "Bryan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "kinda on the pricey side, but it is really convenient and open late.", "author": "Shawn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "I probably go here 3 times a week.  I get the hummus sandwich on sourdough and it's just delicious!  It comes with hummus, lettuce tomatoes onions pickles and... jalapenos!!!  The old man (i'm guessing sammy himself) is really nice but I took one star off because the younger guy who works there doesn't always listen and i end up not having hummus..", "author": "Caleb D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-28", "description": "Agreed!  The meal deal is a huge sandwich, chips and a drink for $7.55 including tax.  You can't get that anywhere around here...  And it's DELICIOUS!", "author": "Leslie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-11", "description": "this is a great place to grab a sandwich during your lunch break.  the old man might look like he could beat you up with his eyebrows, but he's really the nicest sandwich maker i've met and he seems very delighted that you're eating his sandwiches.  i've tried the roast beef and the chicken salad, and both were very good.  make sure to pick up the sandwich card (buy 9 get 1 free)!", "author": "Jon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "I'm a huge sandwich fan and this is definitely one of the better sandwich spots I've been to here in the financial district. There was a ton of meat and fresh bread. Only downside was that they didn't have any soups today but its probably b/c its 12/31 and nobody is working today. Otherwise I will definitely be back again!", "author": "Deepak G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-31", "description": "Most average sandwich I've ever had in the city. Would not recommend. On top of having a pretty lousy sandwich, there was no soup for the lunch sandwich special. If you're in the area, I'd recommend Cafe Verde over this place any day", "author": "Jeremia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "this used to be the lunch spot everyday a  few years ago when i worked around there. the sandwiches are huge! get to know them and show them love(tipping, bullshitting with them) they might even give you a frequent buyer discount. don't be afraid to hit up the stuff in the cooler.", "author": "Ausewaldoe J."}
