{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "The reviews here aren't fair. Ambience and service isn't what you expect from a standard restaurant, and if you expect your food heavily flavored.... It's legit Chinese and Vietnamese food. We had veggie , I got bitter melon and fish, and my friend got mixed meat chow mein. It was memorable and I'd go right back.\n\nGreat mixed drinks, too.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "Reviewing for the pork and rice dish only. This place was pretty decent of a choice during my walk around Chinatown. Featuring a $9.50 com suon nuong, I'd have to say that it was rather tasty and affordable. I'm not sure if it's ran by Chinese or Vietnamaese staff, but they have the menu in English and Vietnamese which I thought was great! \n\nMy com suon nuong came out pretty quickly, along with free hot tea. The staff was attentive even though it was pretty crowded. The dish came with 2 large pieces of pork, a good portion of rice, and cucumbers and lettuce. The fish sauce was also pretty delicious and I have no complaints about the meal! $10.02 total after tax is cheap to me who is a San Francisco local :)", "author": "My N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "Food was great but gosh the rudest waitress ever. Try not to roll your eyes when we ask for water.", "author": "Sovannara V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-02", "description": "Decided to try this place out. This place used to be dim sum. Enjoyed the food and nice interior. Would come back again", "author": "Lulu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "I came doing the happy hour (I think it's from 3-6pm) and ordered D9 - Tender Beef & Beef-Tripe Rice noodle. Overall, I thought the beef & noodles tasted pretty good and the broth was flavorful. The food also came out pretty quick, but I came at a down time when there were only 2 other tables filled.\n\nThe prices were cheap during happy hour -- I ordered the large for $6.50. I think their large is actually equivalent to a typical medium size in other restaurants, so it's probably best to get a large if you're hungry. In addition to the reduce prices during happy hour, Yelp has a 10% cash back for this particular restaurant. So I'd recommend giving this place a try during happy hour!", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "I've loved this place since they were on Stockton Street!\n\nTheir menu is big and they give you the choice of what kind of noodles you want.\n\nMy favorite thing is the chicken saday chow fun. I've never been anywhere that has this dish and it's my absolute favorite. Sometimes I'll order two. One to eat there and a second to take home!", "author": "Kristina Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-06", "description": "I don't feel like this place is what it used to be. The food is still pretty tasty and it comes out pretty quickly. However, service is horrendous, the wait staff blatantly ignore you even though they're all just standing around. The portions also feel smaller despite the prices going up. It's still a fine place to eat but that's exactly it, it's just fine, nothing to be excited about. Meeh!", "author": "Connie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-17", "description": "San Sun is a huge restaurant right in the center of China Town.  We ventured in for lunch before we left to start driving back to San Diego.  When we arrived we were immediately seated.  The waitress then brought us some complimentary tea while we decided what to order.\n\nWe ordered a couple noodle dishes, some wontons and some rice for my nephew. We were brought the wontons within a few moments. They were good.  She then brought our noodle dishes.  She didn't bring my nephew's rice and she tended to stay in the back of the restaurant so I went to the back to ask if she could bring his rice.  A few minutes later she brought the bowl of rice.\n\nMy nephew liked his rice.  The tea was fine and so were the wontons.  The noodle dishes were okay.  There wasn't a lot of flavor, everything needed a lot more garlic, ginger or some spice.  \n\nThey have an extensive menu with many different items, lots of different kinds of noodles, to choose from for each dish as well as soups and entrees.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-25", "description": "Food was ok.\n Quality was horrible. I ordered chicken saday. Fairly bland in taste and the chicken looked to be the misc. pieces of a whole chicken. The service is fast, but rude. And non existent after bringing food.", "author": "Jake C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Love the authentic Chinese food. The service is friendly and the food arrives so fast. Very tasty food.", "author": "Mehran A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-14", "description": "I came in here with a friend at around 5:30 pm on a weekday, after hearing about the happy hour pho prices that run from 3 pm to 6 pm. When we walked in, there weren't that many people there, less than ten people I'd say, which looks really empty in such a large restaurant. Then again, it is the afternoon still on a weekday, which is still understandable. I ordered the large chicken rice noodle, priced at $6.50. \n\nA couple minutes later, the pho came out in a silver bowl, as seen in the picture below. In my opinion, the silver bowl is a strange choice for pho, and this is the first time I've had pho out of a silver bowl. Nevertheless, I partook in the broth. The broth didn't have a deep flavor to speak of, and it felt ordinary. Not bad, just simple. I then poured the accompanying vegetables into the pho and mixed them together. The noodles were good, I was satisfied with them. I moved on to the chicken next, and the chicken was okay. Eventually, I got a little bored of the flavor and doused the soup with sriracha and hoisin sauce. I then proceeded to devour the rest of the soup and noodles and all in all, it was a little better toward the end because there was a bit more flavor now, a bit more kick to it due to the sriracha. \n\nWe paid for our respective bowls of pho and left. In reflection, I don't think I would come back here for the pho since there are better places in Chinatown to get pho. I said it before, but I think the pho here is ordinary and nothing really stood out. Another observation I want to bring up is that the large pho here translates more to a medium elsewhere in Chinatown, so quantity-wise, you're really paying $6.50 for a medium instead of a large. Even though I was lured in by the discounted pho price, I feel that one might be better off by paying the additional dollar or two for higher quality pho. If you do come here for the pho, try to come during the happy hour times since I do not recommend paying full price judging by the size of the bowl.", "author": "Nelson X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "Okay San Sun, This is literally the most best pho I've ever had since last month out of all the other places in Chinatown I've been too. The noodles were a decent amount, the soup was hot and flavorful on a cold chilly day, the tender beef was juicy soft and hard, the beef ball was just right and the beef brisket oh my god it was just so good. There was a huge amount of meat and noodles given at this place than all the other places in Chinatown. This place is definitely a keeper! I will be back soon! \n\nPros: \n-Fast \n-Kind customer service \n-Amount of meat and noodles were really huge \n-I am in love with the soup! \n\nOverall, this place is the place for pho!! You will see me back!", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "tl;dr come here only for the pho. the Chinese dishes were lacking in flavor, and I don't recommend them. \n\nMy family came in on New Years Eve since we decided to take a trip to San Fran, and this place is in the heart of Chinatown. The waitress sat us down and provided us menus, along with 4 cups of hot tea in steel mugs. Although the tea was nice, it had a slight metal taste to it. The place overall is no frills, and that's not a problem--but even though the food was cheap, the dishes we ordered weren't terribly great. the sweet and sour pork, although red in color, tasted neither sweet nor sour. The cashew chicken was decent, and the egg rolls we ordered had a strange savory taste to it. \n\nHowever, my sister and I ordered the beef pho, and it was delicious. The broth was full-bodied and fragrant, and came with all the side toppings that pho should have. My dad, who ordered the chicken rice plate combo, said the chicken was bland overall. \n\nBottom line, come in if you want to have pho, not Chinese food.", "author": "Zhou W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "Food just not flavorful, there are lots of chiu chow style restaurant in East Bay that would put this place to shame . And expensive for what you get . I ok with expensive if the food taste good", "author": "Warren Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "I love this place-I've been going there for years. I always order chicken saday-nice chicken soup with fresh veggies-and spicy! Very yummy! If you want a nice romantic dinner with ambiance this isn't the place. But the food is consistently solid. I will be back!", "author": "Barbara C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "Inexpensive and super clean for Chinatown. I ordered a bitter melon pork (mediocre) and salt and pepper chicken wings (delish).", "author": "Michael H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "Pork Lo Mein was really disgusting\n\nShrimp Fried Rice was horrible- about 6 pieces of shrimp in a huge vat of rice...\n\nPeople there started closing at 630 even though it's open until 8 and were rude about that", "author": "Grant R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-28", "description": "Love the foods here! We stopped by and had lunch. It was busy when we arrived. We were seated right away. If you visit San Francisco and need something to to warm, this is the right place. The foods are good and reasonable prices. For sure perfect broth and noodles, very delicious and foods come really soon. If you like Fried rice, you need to try it. The Ho fun noodles soup also very flavorful. You won't be disappointed. The service is ok. My go to place when craving soup.", "author": "Lan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "I've been here for about ten times.  All the items I had were delicious.  The saday soup noodles are not the same type as I have in Hong Kong.  The saday noodles here are too spicy for me.  The men's room is clean and has a Dyson hand dryer.  Outside the bathroom, it has an automatic hand cleaner.  It shows that the owner puts in the effort to run this restaurant.  The service is typical in a Chinese restaurant.  I also like Yelp's offer of 7% cash back to the restaurant.", "author": "Raymond C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "Rude unfriendly service. Food is bland and not very authentic. Clearly specified for my dish to be made with no shrimp due to allergies, but this was completely disregarded. Seriously can't believe these people work in the service industry.", "author": "Debbie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "I was a fan of this lovely restaurant when it was at its Stockton Street location and still a great fan now that it's replaced the dim sum place on Washington!\n\nI come here quite a bit with my family after attending church service on Sundays since it's such a convenient place to sit down and enjoy a good meal. Their menu is huge! There's a mix of Chinese and Vietnamese dishes here. \n\nThe only things I ever order here are the soup noodles and they've always been a solid choice. What makes me really like this place is their expanse selection of noodles: egg noodles, wide egg noodles, vermicelli, rice noodles, etc. I always end up getting the beef stew noodle soup with the wide egg noodles and would recommend it. There's also an interesting seafood noodle soup which comes with what I can only describe as a fossilized shrimp which is quite interesting. You might want to check that out. \n\nThe downsides to this location are that it's not necessarily the cleanest or have the best of service. Also, a lot of their menu items are a hit or a miss. Some of them can be really good while others are just bland or too salty.\n\nP.S. The monitors on the wall displaying the date and time on them are very very interesting. You'll know what I mean if you saw them. :P", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Beef Stew Noodle Soup, the only place I know in Chinatown and it serves its purpose. The beef is tender, noodles are cooked well, and the broth is vacuumed into my tummy. I leave satisfied so I'm good.", "author": "Minh H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "Ugh the congee is literally day old rice with soup poured over it. Do yourself a favor and spend your money elsewhere.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-19", "description": "This place has horrible service and mediocre food. The waitress took her time taking our order and when we requested for sweet and sour shrimp (plate add on), we received chicken (language barrier). After we paid the waitress had the nerve to demand a tip. Won't ever be back to this place again.", "author": "Sebastian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-10", "description": "Great restaurant with wide ranges of food.  Appetizers include potsticker, spring roll, fried tofu, fried fish ball.  Noodles soup has choice of egg noodles, flat rice noodles, vermicelli...  Of course, my favorite is fried rice.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "Worst service ever. We sat ourselves, used their bathroom. Grab our own menus and still no one came to help us. Set for 15 mins. Over 10 workers walking around picking their asses and not a single one came over lol. No lies. Never again", "author": "James V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "I usually order their \n\nMapo Tofu over rice (ask for spice)\nBroccoli & Beef over rice\n\nSuper delicious. You definitely have to try it!", "author": "Francis C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-15", "description": "Has no AC. Horrible..over load on pho noddles..very hot noddle..never get an chance to be cold. Everything. Is in an Aluminum bowl serve and stay hot forever!!! \n\nOrder hot and sour soup, broth was clear..picture was supposed to be describe as red not clear.  Not sour soup...they reheated my soup. Toke 10 minutes,  ate 3 spoons...and just set it aside and put my drink on top of the nasty soup I had.\n\nWorst food experience. .I taste better Vietnamese food then this.\n\nSpent $51.00 worth of food on my vacation with 5 people. No tip. Walk out pissed\n\n\nWould not recommanded", "author": "Davith S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "At first, my family and I were intimidated to dine in here because of its 8+ page menu, but San Sun's concept of mixing/adding items along with a variety of ethnic dishes ranging from Cambodian, Singapore, Vietnamese, Chinese, and etc truly intrigued our interest.\n\nMy family and I arrived around 3:30pm (happy hour), were immediately seated, and served with black tea in silver mugs (you can also ask for water).\n\n- My dad ordered the #519 Bitter melon in black bean sauce ($12.95) along with rice ($2)\n- My mother ordered the #803 Hainam chicken over rice ($9.25) \n- My brother ordered the #301 Combination fried noodles ($9) with chow mein and no rice (rice is an additional $2)\n- and I ordered the #218 Special pho combination [one size only] ($9.75) along with 4 meat toppings (any more than 4 will cost $1 each) and large rice noodle\n\nBesides the Hainam chicken, most of our dishes were served on silverware, and although they do provided red vinegar on the table, they don't have fish sauce available.\n\nOverall, the dishes were incredibly delicious, not too bland, oily, or salty, and had just about the right amount of spice, flavor, and proportion size. \n\nIf I'm ever visiting China town again, I will definitely dine in at San Sun to try more of their dishes, like their Saday sauce noodles and Chinese broccoli, as well as their mix-and-matching options and increasing the spice levels on their dishes.", "author": "Nathalie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "Man, the best Chinese food in San Francisco Area.\nVisiting FCO and found this place via Yelp, my family and I liked it tho the many options around the area, this is the best.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Walking around China Town gave me an appetite. \n\nWe tried the WonTon soup and Chow Mien. WOW!!!!! Fantastic taste. The best I had in CA so far. Totally surprised my Vietnamese GF and I.  Go there!!! And well priced and huge servings.", "author": "Nelson O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Cheap! For tourist filled china town.  Chicken Pho was delicious and basil prawn was authentic.   We will be back!", "author": "James W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "Waiting time was ok to get seated. It took 20-30 mins to have someone to get our order. After that the order was wrong and a whole dish was left out. We had to ask two different waitresses about the misses dish only to never receive it. Throughout the meal nobody stopped by to see how we were doing. Lastly on top to of that it took a while to make payment and leave.", "author": "Mai Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "THIS IS NOT VIETNAMESE FOOD. READ THIS BEFORE YOU COME HERE. Terrible experience and I hope you all read this before you give them a try.  This is a Korean version of Asian food? Not even a close resemblance of Vietnamese food. Worst of all I left to use the restroom and they cleaned my table. I had asked them not to clean my table because I needed to use the restroom, so there goes that. Anyways if you're a Korean food fan, come here for fake Vietnamese food.", "author": "Dang D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "This is the most affordable place to go if you want to try authentic Southern Chinese food. The variety of selections in the menu is just mind-blowing. I stop by whenever I happen to pass by Chinatown. They also have a happy hour with special discounts after 3.", "author": "Kalin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "If you are looking for authentic, this is the place.  Lots of locals.  Reasonable prices.  Family friendly.  Staff is helpful and friendly", "author": "Gilbert C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-07", "description": "Waitress tossed menus down on table and walked away. Wouldn't ask or engage in any conversation. Looked at us like why you here you are not Asian. Treated other Asian customers more respectful. Food was good but with such a rude young female waitress it ruined everything. Came here four years ago and it was not like this. Won't be back.", "author": "Christopher D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-04", "description": "This place is OK. Not amazing and I wouldn't crave it but it's pretty decent and their portions are really big. I ordered the fish ball and fish cake noodle soup with pho noodles (you can choose the type of noodles you want) which is a plus. There are soo many items on their menu! It's pretty overwhelming to choose lol. The noodle soup that I got was a bit bland. I prefer not to add hoisin sauce or siracha to my soup, but this time I kinda had to. The soup seemed like it was just missing something, I can't put my finger on it tho.. I would like to come back to try the other items on their menu and give this place another try.", "author": "Bailey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "My go to restaurant in China town. Prices are unbeatable (like most places in china town) but what sells this place for me is the friendliness, cleanliness and their fast services.", "author": "Monica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-23", "description": "Chinatown has some terrifying options (one and two star traps lurking at every corner) so I was very pleasantly surprised to find this place on my lunch break today. \n\nThey have a huge variety of food, and many types of pho - everything from beef to chicken to seafood to veggie. And I really liked that they offer options like \"add veggies,\" or \"add seafood,\" along with a huge list of different noodles, so you can choose whatever suits your mood. \n\nI opted for the seafood (vermicelli) noodle soup, with added veggies. \n\nWhat came out was a steaming, beautiful bowl of flavorful broth, chock full of noodles (they do NOT skimp), bok choi, scallions, prawns, lobster balls, and chunks of white fish. It was delicious, filling, and fresh!\n\nAll of that was $11. I can't wait to go back!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-17", "description": "The food was horrible,I ordered sweet and sour chicken and not only was it hard but it was mostly vegetables,the fried rice was like something out off a frozen box,and on top off it the waitress hardly spoke English", "author": "Carlos J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "Clean pho place in Chinatown\n\nDid not expect a pho place in Chinatown that was this clean! The inside was huge, with lots of seats and TVs close to the ceiling. I ordered the Pho that was part of the \"afternoon tea\" discount items, fully expecting the reduced price to lead to a small bowl of pho, but boy, was I wrong! The pho came in a huge metal salad bowl, with lots and lots of ingredients and many kinds of beef. The lemon iced tea was also very, very well made, with just the right amount of syrup and actual lemon flavor.\n\nThe menu also has non-vietnamese items as well (e.g. chinese rice dishes), probably because the place is in chinatown.\n\nAll in all, an ok place to visit if you're craving for some pho in a clean place in ctown.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "Everything was excellent... we had shrimp fried rice, shrimp lo mein, sweet & sour shrimp and hot & sour chicken", "author": "Les C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "I ordered pho with baked chicken. The chicken was seasoned very well, sweet yet savory. The broth on the other hand, was very plain. I had to put a lot of chili oil and Siracha just to give it taste. I feel as if I should have definitely ordered something else. They do have happy hour from 2-6 I believe? So the beer bottles were only 2.50. (-1 star due to the chicken broth being unflavorful).", "author": "Victoria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Great place to stop for a no fuss bite to eat. We were craving noodle soup and this was the perfect place with their many many selections of soups! You get to select what type of noodle you like in your soup, which was a nice option.", "author": "Sophie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Excellent food tucked away in China Town. Much better than most of the overpriced touristy restaurants in the area. I had the chicken pho which was really flavorful and the cuts of chicken in it were good. My boyfriend had basil shrimp and was very happy with it. Service was friendly and prompt. I would definitely comeback next I'm in the area", "author": "Tori R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Wonton noodle soup was good, but wonton didn't have that \"fresh\" taste. Also got the combo rice place and it has great flavors. Good portion sizes and attentive staff", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "ONE WORD  - \"BOMB\" - We were there on 05/05/2016 \n\nIf you want some great Chinese food - come here . We yelp it and saw the great reviews so we decide to go eat there, fast service and very clean", "author": "Don J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "So many different noodle options! This place reminds me of Vien Huong in Oakland Chinatown, but with more variety. The soup was very flavorful without being overpowering, and they gave me so much noodles, I could barely finish it. Fish cakes were decent, but not better than the OG Vien Huong one. They also have a happy hour type of deal during mid-afternoon which discounts a lot of their menu items, so I'd definitely want to try that if I were in the area around that time.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "I always come by for happy hour as I always get off work around 4 o clock. The happy hour menu is just a little cheaper than regular menu price but food is worth every single penny. Great selection on happy hour menu and delicious combinations of ingredients each dish offers. Their Pho is authentic and so are their Chinese dishes. You won't be disappointed..", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "Ordered chicken pho to go came home and noticed the noddles were different than usual... they were mushy/ overlooked...brown green*onions and cilantro hidden inside the noodles!GROSS! Looked like it was leftover from a previous customer! Worst experience EVER! Never coming back!!!!", "author": "Kandi F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-18", "description": "There is an after 3 pm special, look for the table menu that has lemon tea for 1.50, ovatine drink, ice cream 1.50, etc.  The food for the special was about 1.00 less or so.  I tried the \"pure noodle\" which turned out to be little rod noodles with fish cakes and a few shrimps.  The broth was light.  Strangely, the food comes in tin serving bowls.  Its a nice place to catch a meal around 7 pm when they close at 8 pm.  They were nice to accommodate a tourist family of four close to 7:45 pm.  Service was fast. Menu is extensive, noodles, rice plates, ala carte,  you name it, they have a variety of Vietnamese.  Restroom were clean.  Place was big. Good portions.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Amazing best Chinese food.  We are from Virginia on business trip and decided to get local good.  Best decision.  Spoils it for Chinese restaurant back home. Golden standard.", "author": "Eduard R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-03", "description": "I order orange chicken, which was very hard to eat. The waitress was very nice and replace it for another dish. But still did not taste good. They have no ac so it's very hot in here. Food was not good, me and my friend did not like our plates. Service was excellent", "author": "Oxcar A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-18", "description": "Fair prices, friendly staff and decent pho.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "San Sung is amazing. Everything in this place's wonderful: taste good, cheap & good portion. On top of all these, there're like 300 food items to choose from the menu.\n\nI'd recommend trying their noodle. They're delicious, & has good consistency. They go about $5 - $7 for noodle soup. Their beef & fish balls're pretty good too; very rich in flavor. You can get them for about 5 bucks.\n\nCombination Fried Noodle ($6.75) - Love this dish!  I highly suggest make it a Crispy Fried Noodle for only 50 cents. The crispy noodle, sauce & meat all blend very well together.\n\nOverall: You can't go wrong with this place. I went to this place 3 times within a week and ordered different food everytime; They all turned out good! Their noodle's the highlight of my experience here. Good authentic Chinese food, cheap price & good portions - What's not to love?!?! However, the service can be pretty bad at times.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "Short Story:\nMeh...an okay place that serves Chinese and Vietnamese food in Chinatown.\n\nLong Story:\nI came here on a Saturday afternoon with friends and I got the house special fried rice.  The meat tasted a bit funny and the shrimp was not completely de-veined.  Although this is pretty common of most Asian restaurants.  The service was lacking as was the ambiance and decor.  But then again, you can't expect a whole lot coming from Chinatown.\n\nVerdict:\nI will not be back.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-11", "description": "Its been awhile since I'he been here. I swear food was better at the Stockton St. Location. Huge menu, a bit overwhelmed by all the choices. Stuck with fried tofu, it was piping hot and the dipping sauce was super vinegary but it balance out the friedness ( not a real word I suppose). Hubby got the beef stew ho fun and found hair in it. Of course, he does not inform me of this while we were eating. Needless to say, he didn't finish it. I had the pho, didn't like it much. Nothing stood out with this noodle dish. The soup base was different and had a semi sour taste to it.  Overall, I preferred the restaurant before it moved to this location, like eons ago. Probably hit something else up when in Chinatown.", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "Just get the combination crispy noodles and thank me later! It's a very popular item on Yelp!", "author": "Alice X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "We ate Christmas Eve lunch here and it was outstanding.  We had kung pao shrimp, orange chicken, potstickers, hot and sour soup, and more.  The service was excellent!  Thanks for the great meal!\n\nThe menu was very broad and the prices were very affordable.  We were happy with the portion sizes and noted the best portion sizes were on the soup options.  The food came out hot and delicious!", "author": "Anita A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Excellent variety of Chinese-Vietnamese food for the price! Highly recommended for tourists visiting San Fran!", "author": "Ynohtna A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "Decided to stop by San Sun because our regular go-to Vietnamese restaurant was closed on Sundays. I remember coming here often after school when this place was still on Stockton St. I was hoping that the quality has gone up much like the space in the restaurant.\n\nThe menu is absolutely enormous. Everything you can expect from both a Vietnamese and Chinese restaurant is on this menu along with multiple variations. The waitress was very accommodating although she and get coworker can lay off the cell phones before they take out order.\n\nMy SO and I order a bowl of pho with all kinds of meat, but opted out of getting tendon and replacing it with brisket, fried chicken noodle with bok choy instead of cabbage and a grilled chicken noodle bowl.\n\nThis was a lot more food than both of us could handle, but all the dishes were good for the most part. Some pieces of beef on the pho was slightly discolored, but like a smart yelper, I knew that it was normal and not a sign of rotting. The grilled chicken on both the noodle bowl and fried noodle was so mushy. It had barely any chew to it and fell apart with ease. I don't know about you, but I like to have a meaty texture when eating chicken.\n\nHas this place lived up to my experience from my high school days? I'd say it has and I'll be coming here again. I just hope that next visit will warrant a four star or more rating.", "author": "George Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-24", "description": "I was so bummed that I haven't been to old Stockton Street location. But I'm glad that old location has CLOSED!\n\nThe new location took over the historic Sun Wah Kue location, which been there since the Pacific Railroad Act of 1862. \"You knew that, right?\"\n\nOn my debut of the new relocated restaurant, I was browsing through the glossy, colorful and extensive menu. The new joint serves Chinese (Mandarin & Cantonese) and Vietnamese Cuisines. \"Did somebody say, Vietnamese?\"\n\nAnd that is what I ordered for lunch-#86: Bun Ghau Yau Bo Nhuong.  For $7.25, the bowl had grilled chicken, cold vermicelli noodles, a cut up egg roll and fresh vegetables all in one bowl with a dipping sauce. You have noticed the egg roll without the \"s\", is because I only received one in my dish. Other than that, the bowl was fine. \n\nI also had a Vietnamese Iced coffee with my meal. I needed because I was sleepy. \n\nAs I was enjoying my meal, I was also watching NBA Basketball. \"A couple of old men, dining there and sitting next to me, cheered for...Jeremy Lin? I'm shocked!\"\n\nAnd here is another shocking part. The Health Department gave the new restaurant a score of: 98, which were graded in the beginning of February of 2012. That is pretty clean for a Chinatown business. A new and clean restaurant, but I do feel optimistic about the score of 98.  \n\nUnlike the historic Sun Wah Kue restaurant, no free slice of pie. \n\nDecent food and I hope the new San Sun will start a new chapter where the old business left off.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-25", "description": "400 items on the menu. That's right. FOUR. HUNDRED. That means if you went there every day for a YEAR, you wouldn't get through everything. \n\nGot take-out with some colleagues one day. Since I spoke the most fluent Cantonese, I was delegated to put in the order. After repeating my order 3x, the woman takes it, then says \"ok!\" and hangs up. *sigh. Typical Chinatown. Just assume it'll be done in 10 minutes if they hang up without giving you a time.\n\nWhat we had:\nSeafood on Crispy Noodle - Was pretty solid, but the seafood was the super cheap kind. Like, squid, fish balls, and fish cake. A couple of shrimp thrown in (tiny shrimp). I guess for $8, I'm not expecting THAT much. But still. Some fish would have been nice. I mean...most of the seafood in the dish was processed. o.O\n\nBitter Melon with Chicken - Solid dish. Pretty sauced up, but the bitter melon was done right, and there was good flavor all around. Chicken was good, and NOT DRY.\n\nGinger and Onion Beef - I was told this is one of their signatures. LOTS of ginger and onion. Though...the ginger wasn't all cut the same way. It should come out in slivers, so you can consume it all. I found whole slices of ginger...which make it tough eating.\n\nService was pretty good, and they were quite prompt with our food. It was a bit confusing walking in to get our take out (wasn't sure if we were to walk to the counter in the back, or wait in the front, or what...). Space looks clean, and I'd say if you want a variety of Chinese food, solid price, this would be a good place to try it.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "Great restaurant! Pho is not the best thing on menu. They have a great happy hour menu from 3-6pm, several items $5 or $6.\nOrder the noodle soups, saday, or rice/noodle dishes. Great variety! Always able to find something on menu. Family owned restaurant. Chinese family from Vietnam. \nRoss alley right next door, great to get some fortune cookies from the factory or pop in to the pop up gallery to see what's going on.", "author": "Kiki J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "I have eaten here a few times, I do not live is SF so the drive is far. It is worth it! The staff is super friendly as well. Sign on the door says since 1990 so they must be doing something right", "author": "Paul A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "Very good service. When I walked in we were greeted and got to choose our own seats. The waitress brought us out warm green tea as soon as I walked in. I ordered the chicken noodle soup and it was so delicious. It had a nice favor. I got the small and was able to share. Everything else was also good! Definitely recommend this place", "author": "Marcela S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Authentic Pho, cheap and in portions way more than a normal human can eat! Buy one and split it...", "author": "David M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-25", "description": "First Time Experience:\n\nWalked in around 1pm on a Saturday afternoon for lunch after exploring chinatown. We randomly decided on this restaurant b/c we didn't do our research, it was nearby and there was a good crowd of Asians in there. We assumed that it had to be good if Asians eat there too! Wrong...\n\nPlace is a no frills kinda place...lots of seating, no real decor, the orange seats match the orange polos of the waiters. Everyone just seemed to be focused on eating their food. Our waiter gave us water and complimentary hot tea. The menu was huge! It had tons of pictures, which was helpful. We ended up getting some beef stir-fry, orange chicken and chicken fried rice.\n\n1. Beef stir fry looked gross...like a congealed mass of beef, onions, and lots of corn starch gravy. Didn't look appetizing and tasted ok. Mall Chinese food tastes better than this crap. \n\n2. Chicken fried rice was good, but nothing original or special.\n\n3. Orange chicken was absolutely disgusting. The serving portion was quite sorry. We were both shocked how little there was especially given then fact that 60% was fried dough surrounding a morsel of chicken. The orange glaze was overwhelmingly citrusy. Just not good\n\nService: Waiters here are all Asian women that speak broken English. They were polite, but not very helpful. We received a lot of glaring looks, since we were the only Americans in there at the time. It definitely made us feel uncomfortable. \n\nCON: Unlike other asian restaurants, you have to order white rice in addition to your meat entree. I didn't know that so I had to eat the beef stir fry by itself...thankfully, my friend ordered chicken fried rice so I took some from him. I'm just always used to asian restaurants always giving you a bowl of white rice with any entree order.\n\nDefinitely will do my research on where the better places to eat are in chinatown. I do not recommend this place, especially to Americans that are unaware of authentic asian cuisine.", "author": "Ro P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-08", "description": "It looks like a Vietnamese restaurant from the outside, and even their first few pages of the menu are dedicated to Vietnamese dishes, but this is quite clearly a Chinese style restaurant.  Don't be deceived by the menu because their pho is far from good.  What kind of place actually asks you what kind of noodles you want in your pho?  Our hero wanted to try what it would be like with egg noodles (oh the folly of such a decision), and was sorely disappointed.\n\nThe service is kind of clueless and was unable to provide any decent recommendations of menu items and had minimal English speaking abilities.  The waitress didn't even understand that our hero wanted to order wings as an appetizer, and he was left waiting until after he finished his main course for a dish that never came.\n\nPROS:\n- It's hella cheap.\n\nCONS:\n- The Vietnamese side of their menu is definitely not authentic and poorly thrown together.\n- The kitchen looks kind of dirty and sketchy.\n- Servers have communication issues.", "author": "Albert W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "You're traveling across San Francisco with four Brazilians one day across the Golden Gate, Fisherman's Wharf, Lombard Street, and Chinatown. All of a sudden, you hunger for some food. Being their American guardian, I have decided that Asian food is best food. Because it is.\n\nIn the chilly winds of that day, we walked into San Sun. Greeted by a lady who doesn't seem very enthusiastic, but that is completely understandable. It's about 5pm and she may have worked all day. Ordering Vietnamese and Chinese food, our phones have died. No matter, I have just enough battery to check in before it finally does die. Thumbs up, good fella.\n\nThe food was good, but nothing out of the ordinary. We all drank water using the logic that the drought will evaporate all anyway, enjoy it while it lasts (ooh, dark humor!). It took a while for our food to arrive, which is for the better as we're beat walking and bus hopping all day. The price was decent for a restaurant in San Francisco. What a good way to finish a day in the city and blowing your money away.", "author": "Vincent V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "Been coming here since their old location and it's still really good. Never lets me down. \n\nI ordered the Beef Satay Noodles and it was good as usual, but I asked for not so spicy. When I got my order, it was REALLY spicy. That was the only thing that disappointed me, but every other time I go, the food is always delicious. \n\nThe service is always great.", "author": "Vernice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "I remember eating here whenever I went to SF Chinatown with my mom when I was young. \n\nIt was always the combination hofun noodle soup for me with a ton of hot sauce and chili peppers. My soup has to be red. \n\nI don't remember the menu being that crazy...so many options!  \nDifferent kinds of noodles, meat, etc. \n\nThe combination noodle soup was delicious. The kidney stir fry was just ok. The sauce was way too thick and the kidneys were overcooked. Too dry. I still prefer VH noodle house's kidney with ginger and onions. \n\nI need to come back to try their noodle stir fry and the other millions of options!", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "Okay after multiple visits to this place I have to bump up the stars. Food is always decently priced with generous portions. They will always give you extra soup for your noodles on the house.", "author": "W A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "Having just arrived to San Francisco we were looking for a quick meal in Chinatown. This place met our needs, as it had good food and decent prices. We got the orange chicken and beef with broccoli which were good but nothing noteworthy. The place fit the bill at the time but not a place I feel the need to revisit soon.", "author": "Allie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "The vegetable pho was excellent & the restaurant/bathrooms were clean. Service was fast & friendly!", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-05", "description": "this place is one of my favorite chinese restaurants and i'm not a fan of chinese food in general. i grew up eating here pretty often when they were on the stockton location. i still come to their new location once in a while. i love how they have so much variety on their menu. one of my favorite dishes to order is the fried pure rice noodle with seafood and egg over it. i don't know of many restaurants that sell pure rice noodles, so i usually order it here. i absolutely love eating pure rice noodles. it comes with egg on top of the noodles, celery, shrimp, green onions, cabbage and i think calamari? sometimes i like to order the pure rice noodle soup too. the food here is affordable and it tastes good!", "author": "Sylvia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-09", "description": "Well the food looked fabulous but sadly I ordered the wrong dish! At home I eat  fresh sweet and sour fish and love it . The dish in the San Sun was dreadful, the fish was tasteless and the batter tough. It was more sweet than sour. My partner had a sensational dish of prawns and was delighted. The noodle soups looked fabulous as did most of the dishes exiting the kitchen and all diners looked very happy. The restaurant  was clean, professional and comfortable to dine in. My advice is talk to the wait staff about the house  specialities before ordering.", "author": "Margaret K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-06", "description": "If this place wasn't in Chinatown which is pretty far out of the way for me, my boyfriend and I would definitely be a regular of this place. \n\nCame here after 3:00pm and noticed they had a happy hour and some of their drinks were only $1! You really can't get any cheaper from anywhere at all. We got 2 of the lemon iced tea and an iced soy milk for $3 (excessive, but it was soooo cheap you just can help it).\n\nIt was a really hot day for SF (80+ degrees) so I didn't want any noodle soup (or I'd get a heat stroke) so I opted for a beef chow fun. It was pretty good here.\n\nBabe got the Beef stew with the wide egg noodle and it was ONLY $5 since it was on the happy hour menu. It was so cheap and so delicious. The flavor was on point, and I think I like this more than my beef chow fun. I just personally don't like the egg noodle because it's hard but thats what babe likes. \n\nIt really is such a shame that it isn't at a more convenient location.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "While walking through Chinatown my boyfriend and I were craving noodles for lunch. We saw San Sun next to several other restaurants and this had the highest reviews so we checked it out. When we sat down they gave us complementary hot tea which was a nice touch. I was also impressed with the cleanliness of the establishment. I ordered the Saday chicken with vermicelli noodles. My dish was decent but could have used more flavor. I was expecting a richer thicker peanut sauce but instead had a bland broth with a slight peanut aftertaste. The dish also had fresh vegetables which offered a nice contrast to the chicken and noodles. The portions were huge. My boyfriend ordered beef with Chinese broccoli. His dish was the saving grace. It was the best beef with broccoli I've ever had. It wasn't typical cheap Chinese but instead had depth of flavor, the broccoli had a perfect crunch and the beef was perfectly cooked. If you go here I would recommend that dish!", "author": "Alexa P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-25", "description": "I ordered a special combo pho and they gave me too much noodles and not enough broth. I try to tell them to give me more broth but they don't understand English and gave me a bunch of bowls.", "author": "Kim V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-19", "description": "Huge disappointment, family of three, we ordered three different dishes, all were bad. Orange chicken tasted like orange soda couldn't eat it. They charge extra for rice or noodles with each dish. Had dim sum in Russian hill later in the week, much better.", "author": "Scott J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-10", "description": "Best Chinese restaurant in Chinatown SF! The main reason we drive from LA to SF, very authentic food. Highly recommend it!", "author": "Natalie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "This is one of my favorite restaurant I eat out and I always get number 55 all the time. Eating me some Chinese food for lunch I haven't been here in a while.", "author": "Mychael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-03", "description": "I came here for the first time with a few coworkers during lunch. After sauntering through Chinatown, we entered this restaurant. I just couldn't begin where to look in the menu, because there were just so many different styles of noodle preparation!\n\nEventually, I was recommended to try the satay sauce egg noodle. It came out literally a few minutes after ordering, and I was excited to dig in. The seasoning was good, but I wish it wasn't so watery. I was hoping it would have more of a thicker gravy texture so that it wouldn't drown out my noodles. On the flip side, it could have just as well been a noodle soup dish where the noodles completely soaked up the broth. It was edible, but not fantastic.\n\nThis review should really be 3.5-stars. Fortunately, this rating is only on this one dish and I hope to try the other dishes in the future. Other than that, service is decent for a Chinese restaurant, and price is reasonable, but it's cash only.", "author": "Christopher N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "Probably the best Pho Ga I had outside of Vietnam. We went there for the afternoon Happy Hour. Between 3pm and 6pm beers and wine are 50% off. There is also a selection of dishes for 5$ including Pho Ga. The quality of the food was high and portions were huge.", "author": "Martin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-03", "description": "Excellent place to go in Chinatown.  It's very large, clean, well priced and has a huge variety of foods, plus wifi which is both excellent and quite unique to the area.  You could tell it was good because it was off the main road and full of Asians.  \n\nI went with a friend, he had the pho and I had a rice dish.  Both were delicious and well made, very fresh (though a bit salty, but I'm quite sensitive to that; others would love it).  It was cheap enough that we got that plus a special drink and a scoop of ice cream and it was all less than $20, quite the steal. \n\nI have had some absolutely horrible experiences with the SF Chinatown and the food there, so this place was a very welcome treat.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-29", "description": "Had the curry beef rice for 6 bucks or so. \nPretty tasty!\n\nSCARY and HUGE menu!!!\n\nThey accept credit card too! Win!!!", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Used to be my favorite restaurant in Chinatown at its old location, and while the quality has dropped a bit, still a great place to stop by.  \n\nHaving come here a few dozen times, I'd say to avoid the fried noodle stuff and stick with the chow fun and rice noodle dishes.  Their fish balls/slices are decent, and while their broth isn't that flavorful, their noodles are good enough that it all comes together right.  Their grilled chicken with pho is also great, but they don't' give you  nearly enough of that terrific tasting chicken.\n\nOne thing to keep in mind here is that you can pretty much order whatever you want in terms of noodles or meats.  They have a bit more than half a dozen types of soup noodles, and around the same number of choices for stir fried noodles.  My personal favorite combination is the Satay Beef Stew Chow Fun.  It's usually a a bit more wet than I like it rather than crisply stir-fried like in the past, but the taste is usually still there.  But in case you  need more taste, they have their house-brand satay sauce in a little silver tin.  Usually has really fast service, but you have to be a bit more assertive than at some other restaurants in the area as it gets a bit chaotic sometimes.", "author": "Lincoln L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "First off please note that this is a chiu chow style cuisine,known for its seafood and vegetarian dishes and is commonly regarded as being healthy. Its use of flavouring is much less heavy-handed than most other Chinese cuisines and depends much on the freshness and quality of the ingredients for taste and flavour. As a delicate cuisine, oil is not often used in large quantities and there is a relatively heavy emphasis on poaching, steaming and braising, as well as the common Chinese method of stir-fry.\n\nLove their chicken and leek dumplings, I always have it with half egg and half rice noodles. \n\nThey also do a great job with pork kidneys with green onions and ginger, the Chinese version of liver and onions.  \n\nPick and choose correctly and you will be rewarded.  Quality of food was slightly better in their original location on Stockton, however growth and increasing staff can dilute what they've done well in the past, but I will still visit and get my dumplings!!!\n\n4 starts for the chicken and leek dumplings in noodle soup.\n3 stars for the pork kidneys, they don't give as much as they used to.\n5 stars for affordability.\n3 stars for service and cleaniness.", "author": "Tony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Great food. Many selection. They downsize their menu.. was here last year, they had over 1500 items..", "author": "Hung D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-14", "description": "First time coming the new location San Sun where it is much more cleaner with more space with more TV's. Came with a group and got bowls of beef noodle soup. The noodles tasted very good and we were able to mix with other types of noodles, topped off with some hot sauce, and hoisin sauce. BEWARE: The hot sauce is super hot don't over use it. Free wifi that is very fast where else can you get wifi in Chinatown.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-20", "description": "Plethora of Chinese and Vietnamese dishes. Service is fast and soups are good. Not the best but if you're in Chinatown and hungry, this is a good place to chow down. Prices are very cheap.", "author": "John T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-29", "description": "Your average HK Chinese joint... but they are cheap and they have a huge variety of dishes.  I will admit, being Chinese and being born and raised in San Francisco, I usually NEVER go to Chinatown for Chinese food... strange huh.. it's usually Americanized Chinese food (not quite Panda Express.. but pretty comparable) with jacked up prices to lure tourists... yeah no thanks homey\n\nBut this place surprised me.  It's a pretty sizable location with plenty of tables.  We went right at the peak of lunch time and still got a table immediately.  \n\nService is fast (not the best since it is an Asian joint), portions are decent... so it's not too bad at all.", "author": "Cecilia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Cheap, fast, quality = 4 yelps\nWon ton noodle soup 3.5 yelp they use chow mein noodles vs. Canadian style won ton noodles.\nBeef chow fun 5 yelps solid choice.\nRaw beef and beef ball pho 4 yelp\nBeef and vegetable rice 3.5 yelp smaller quantity\nMassive menu and they have deals after 3 pm.", "author": "Ed D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-08", "description": "Happy hour =$2.00 Sapporo?! Sounds amazing to me.  The food seemed to be extremely oily but still yummy.  We got the chow mein, vegetable pot sticks, and hot&sour soup.  By far the BEST hot &sour soup!!!  It was only $5.00 &they gave you sooo much.  I shared with my boyfriend &we both got 2 servings each.  The service was alright, didn't get my water glass refilled but I think the waitress was training which is understandable.  The waitresses were still very sweet.", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Some characteristic of a truly CCG restaurant include grimy tabletops, stained carpets (or cracked and broken floor tiles), and terrible service.  But it's okay, because I can live with that as long as the food is delicious and the prices are even more tasty.\n\nEnter the new and improved San Sun - the same restaurant with the really huge menu - just in a new location (where Great Oriental used to be).  It's bright, clean, airy, and the food is still as good.\n\nMike C. and I met up so I could show him a CCG-style lunch (actually because he wrote a review for the new location and it reminded me how much I love this place), and we had a beef chow fun (spicy!), fish cakes served over pickled vegetables, and fried tofu with a garlic-chive dipping sauce.  The fried tofu is seriously one of my favorite things ever (if you've ever had stinky tofu, this is it.. minus the stank).\n\nThen, Sara P. and I came here for dinner one night, and I had the combination fried noodles.  I haven't had the crispy fried noodles ($0.50 extra) in forever, and I remember liking it a lot as a kid.  This one did not disappoint - there was plenty of bok choy, shrimp, and crunchy noodles in a savory sauce.  My only complaint is that there was a bit too much sauce, so it made the middle portion really soggy.\n\nSo glad this place relocated!  Now I can come here on a regular basis (I don't even have to walk up the hill to Stockton St. anymore!) and live my CCG life the way I want to - with plenty of delicious food.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "If it lives up to the hype...  This is the NEW location for this restaurant that resided at 941 Stockton Street for several decades.  Due to the new Muni Metro stop being built in that building, the tenants on that corner building are either moving or closing shop, including the residential dwellers upstairs.  The owners bought this building and spent a pretty penny in upgrading this storefront into a clean and bright dining spot.  The grand opening last Friday included lion dances and there were lines for tables during the entire weekend.  I will try it next week, giving some time for them to work out any kinks.  Their hours are unlike most Chinatown restaurants (7 am to 7 pm).  Will update soon.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Large, clean, well-lit, good prices, and decent food. \n\nLoved that they have $6 for an entree after 3pm everyday! It's quite a steal. Additional items on fridays too! \n\nAlso, I appreciated that the kitchen was willing to alter their menu items if you can't eat spicy. :)", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "The newly renovated San Sun restaurant is finally open for business!\n\nI've been an original San Sun fan for years now and can't think of many other restaurants deserving for an upgrade like this. The restaurant still has that good ol' San Sun vibe to it: large mirrors all over the walls, flat screen TVs that display a random dish from the menu, the same sweet lady that actually knows English, and their reputable metal chopsticks! \n\nA few new additions to the restaurant is: it's brighter -- ALOT brighter, twice as much more space and tables (no more bumping into people anymore), a huge new [CLEAN] kitchen in the back, separate restrooms for men and women, and even a hand sanitizer station too! Now can you think of any restaurant or place in Chinatown that even has hand sanitizer? Possibly the CLEANEST restaurant in all of Chinatown. Very impressive!\n\nSo on to the food -- Came here today with 3 others and was edger to try the new place out. We were warmly greeted by the lady (I should really ask for her name..) and sat ourselves at the family style table. After some small talk [she remembers her regulars], we received the menus; which still had the same old favorites but also a new selection of dishes in the back few pages. \n\nWe all decided to go with our favorites --  pho, spicy beef tripe, tomato beef crispy noodles, beef with the homemade satay sauce over rice, and the scrambled egg and beef over rice (one of my favorites) [see picture]. The food came one by one within minutes and looked very appetizing; not runny nor oily, but fresh. As expected, the food was wonderful and very satisfying. San Sun lives up to their long reputation and I wish them many more decades of success!", "author": "Albert L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-17", "description": "pretty modern for a Chinatown cheap eat joint. They have plasma's everywhere and use a touch system for a huge menu of Chinese ad Vietnamese dishes that can frankly be confusing with the sheer scope of the options available. Ordered the Vietnamese beef rice plate with an order of imperial egg rolls and a Viet iced coffee. All were pretty mediocre from the stale rice to the tiny imperial rolls. The prices are rock bottom and the place is clean with good service hence the extra star. I see much better options nearby worth a second look.", "author": "Norris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "This place is awesome! \nYou get SO much for less than $10. \nTheir noodle soups have ginormous portions and the sides are delicious. \nBeef Chow Fun is amazing. You can taste that old, aged wok.", "author": "Dee N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-23", "description": "While the food was acceptable, I would look elsewhere. We had been trekking through Chinatown and were growing hungry. Not wanting to indulge on Dim Sum we stumbled upon San Sun. Probably an OK place if I had never had real Vietnamese food, but given that I have certain expectations it was a real let down. I've dined at Chinese run Vietnamese places before that have really good food but unfortunately this wasn't one of them.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-11", "description": "This restaurant has a very extensive menu..And I mean extensive!!! A minimum of a double sided 5 page menu with at least 10 different dishes on each page making it incredibly hard to decide! Everything from Vietnamese, Cambodian and Chinese!  \n\nFood comes in stainless steel dishes/bowls, even the cups! (kinda reminds me too much of what I see being used in mainland china)\n\nI ordered the beef ball/shank/beef tripes ho fun noodle soup. It was good except I think it was missing a little kick to it. The soup had scallions, parsley and a side dish of the regular bean sprouts , mint leaves and lemon. \n\nI would come again to try something else. \n\nGlad that they accept credit cards!", "author": "Sen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "San Sun is a pretty cool place. The restaurant is clean and inviting. Service was great. The menu is huge, reading like a novel. If you don't like reading, you can always gaze at the menu items on the big HD tv's. Free Wi-Fi to boot. Food is very good and comes out very fast. If you speak to the staff in Cantonese, they might place your food on a regular plate and not the aluminum plate everyone else seems to get (just an observation, I'm sure there's no bias   =)   ) An overall enjoyable experience, having lunch while catching bits of the NFL playoff game.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-12", "description": "July 4th was great fun this year, making the pilgrimage to San Francisco, except the highlight of eating out in Chinatown with family didn't come close to meeting expectation. \n\nWe relied on Yelp for a leg up and have a hard time acknowledging anyone rating San Sun above 2 stars. There were few patrons in the restaurant which should have raised a flag. The decorum had little appeal. The eating utensil were no better than that used to camp out. The menu was many pages long and everyone was hungry so we went against our better judgement and ordered.\n\nThe greens eaten were fresh and hot but nothing else ordered was palatable. The barbecued meat was extremely dried and over salted. In fact two of us eating that dish had upset stomachs for a couple of days.\n\nI've traveled Asia for 9 weeks once, living out of Beijing and have never had a regretful meal there. This experience was so bad it will be quite some time before our family will try this kind of experience again unless we have a personal review we can trust.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-06", "description": "I love this place! It is bright and clean and it opens late! \n\nWe each got a bowl of noodle soup and it is so big that none of us finished it! To be honest, I think they gave us way too many noodles. \n\nI really love my sacha seafood noodle soup because it is spicy, and full of flavors. We also got a plate of sauteed vegetables. \n\nWould love to come back one day!", "author": "Athena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-23", "description": "Great soup! My girl and I got the Cambodian combination rice noodle soup. Delicious. They give you big portions so we shared.  We also got egg rolls, can't complain.\n\nOne star less for IDing and questioning me AFTER I received my beer. And for the weird fact everything was in metal bowls, cups, plates. It felt like prison. With delicious food.", "author": "Ashley F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-03", "description": "It is pretty simple really. Their menu is too big. There is no way, NO WAY that a restaurant can make that many things well. Focus on making several things great instead of a thousand things mediocre. And think about it... With a menu that large, how can they stock everything so it is fresh? They can't.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Excellent quality food and very reasonably priced.  Try both the iced lychee and fresh lemonade drinks, they will make your tastebuds dance and sing! \nThey have an enormous selection of over 200 dishes!  The portions are very generous also.  Staff was friendly and speaks English.  I highly recommend it for visitors looking for authentic Chinese food at very good prices.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "I ordered the dumplings with veggies. The soup is huge and really lovely in a savory broth. Fast service. The atmosphere is kind of boring, but clean and bright.", "author": "Kat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-14", "description": "i almost freaked out when i went to their old location on stockton st and realized they weren't there anymore. thank goodness, i actually read the little sign and realized they had moved to washington st. \n\nthe new location is HUGE!! we didn't even have to wait for a table! i think it's cash only... but don't quote me on that. everything on the menu is super cheap and fulfilling. and did their menu expand? \n\nbf ordered the bbq chicken over rice and the plate was stacked with so much rice and big pieces of chicken. he loved it! i ordered my usual... the combo yellow/rice noodles with the fried scrimp thing. mMm... and of course i doused my bowl with the garlic vinegar. soooo delicious!! \n\nof course, service is still lacking... but i don't care. they still get 5 stars from me!", "author": "Ann T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "Food was good. Needs more flavor on most of the dishes we had. We had a noodle soup that was bland. Chicken fried tic was bland. Beef and broccoli was good. Chicken with 3 mushrooms was bland. Sweet and sour pork was good.", "author": "Otilia O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-02", "description": "Suggested by a local. The old store was located near the intersection of Stockton and Washington. The new location has pretty nice decor for a Chinese restaurant that isn't a wedding venue. There are lots of tv screens displaying the menu and of course TVB. The food options and the way the food is served reminds me of Hong Kong. It can also be that it's in Chinatown..\n\nCombination Noodle soup with thick white and yellow noodles: Extra 0.50 for 2 types of noodles and extra $1 for dry noodles (without the soup). Even though the soup base was pretty bland, it was still oily possibly due to the noodles. The white noodles were silky smooth and the yellow noodles weren't too rough. More suitable for a hangover cure as opposed to a lunch dish.\n\nFish Filet with bell peppers and onions: more flavorful commpared to the noodle soup. Not too salty and would pair well with rice.\n\nSingapore vermicelli: also bland. The noodles were also were too hard. overall the dish wasn't very appetizing.\n\nService: most of the workers are nice except one. The younger waitress is more blunt and speaks to you like she is having a bad day. Even if she did, should still be courteous to your customers. Also I should have gotten commission for getting tourists to try the restaurant. My party was sitting near the window and we saw tourists peering into the window to determine if the restaurant was worth trying. We caught them staring and started waving and smiling at them. After a quick deliberation, the party of 4 entered the restaurant. \nOur meal should have been discounted!\n\nWide menu selection. The prices are reasonable, if not cheap for SF. The portions are decent as well. Too bad the noodles were too bland otherwise I would definitely recommend this place. The environment totally remind me of a Chinese go-to place for late night food.", "author": "Kathy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "I loved them at their old location, but they had to move because of the new Chinatown station to be build there.  Now I have to deal with walking up the hill to this newer, larger, quieter location.  \n\nIf I have time for a meal in Chinatown - this is where I go.  The only two things I have tried and will get would be 1. Satay Noodle Soup (in various meats, depending on my mood)  2. Satay Beef Crispy Noodles\nThat should say a lot about the satay.\nI thought this place went downhill after the move until I came back recently.  I have discovered why.  When ordering noodle soups, please DO NOT order any type of rice noodle.  Go with egg noodle.  Not sure what it is but trust me you will enjoy your meal, a lot.  \n\nWe did order a stir-fry kidney dish, which was good but was filled with onions.  The whole plate had maybe 5 pieces of pork kidney and was the most expensive thing we ordered compared to the noodles. \n\nIf they were consistent in their food, they would receive 5 stars in my book. Since one good dish can't outweigh all the downfalls of this place, here are 4 stars to my love for their satay noodles!", "author": "Leslie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-19", "description": "This place reminds me of China. The decor, set-up, and even the flashing bathroom signs.The restaurant is clean but that's because it's still new. Let's see how it holds up a year from now. There are numerous TVs all along the wall. Kind of pointless though because they don't air anything interesting. There were two TVs that were used as clocks, one that was rotating menu items, and another one airing a Jerry Springer like show. \n\nWhen you get to ordering, the menu is overwhelming because it's pages and pages of food but at least they have pictures. When we got our food, they came in metal bowls with metal chopsticks. There was even a page in the menu that emphasized that the chopsticks were not to be taken home. I must admit that they were pretty niffy.  I ordered the Taiwanese noodle soup. The flavors were good but I did not care for the meat. My beef was so rubbery that I could not eat it. They also have a good selection of noodles. Overall, good place for a quick lunch. I would come back!", "author": "Donna W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-20", "description": "A friend and I ate here; she got stir fried noodles with vegetables and tofu, and I got vegetable noodle soup.  Both dishes were pretty unpalatable.  My soup was bland as can be, a very simple clear broth with stuff thrown in.  Her dish was covered in a slimy, clear gravy with little flavor and bad texture.\n\nGiven how simple my dish was, it's remarkable that I got quite sick after eating here.  My stomach wrestled with itself for a good 6-8 hours after finishing half a bowl of soup (needless to say, I left the rest behind).\n\nSo why two stars, not one?  Well, I imagine some people like bland food.  It wasn't awful in that regard.  As for getting sick, it's a dice throw.  And as someone who has traveled to less-hygienic lands, I'm pretty forgiving of stomach distress.  One just always hope the meal was worth it.  Not this time.", "author": "Nick Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-03", "description": "Service was great! Our waitress was helpful and fast. The food was just OK.\n\nBeef noodle soup was so-so and feel really thirsty afterward. \nMilk tea was not strong enough and it was a bit tasteless.\n\nI would say if you are visitor don't mind to come here. If you are in SF all the time come try it and see if you like it or not.", "author": "Vivi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "i'm a regular at this cafe. very good service for a chinatown joint. their happy hour prices are outrageously cheap. their pho is bomb and big portion. their dirnks are cheap, around 1$. \n\ncon: parking.", "author": "Jared Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "My girlfriend and I had our very first meal in San Francisco here while on vacation. I'm used to the Vietnamese restaurants in New York where they all pretty much have the same exact menu and everything is laid out in the same place on the menu. I was a little dumbfounded with the menu here at San Sun. There were just so many things to choose from. Pages and pages of different foods; some not even of Vietnamese or Chinese origin.\n\nI ordered the closest thing I could find to a classic NYC styled #1 pho noodle; the pho with everything. I can't remember the name of it now but it was the last item on the pho page of the menu. It was a pretty big bowl of noodles and beef parts. The broth wasn't bad either. It wasn't all too amazing but it definitely hit the spot. My girlfriend ordered the better dish of the meal. She had the Beef with Egg Sauce over Haw Fun. This thing was so amazingly delicious. We have beef and egg sauce all the time back home but we've never had it over haw fun. It took a lot of willpower from her to share some with me and even more willpower from me to not eat it all when she did share.\n\nThe place is pretty clean and very well lit. There's even hand sanitizer outside of the bathrooms to use. Our waitress was a very nice lady. She informed us that you can park outside of the restaurant for free if you eat there. Definitely one of the best meals I had while in SF!", "author": "P C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-08", "description": "The two stars are for neutral/indifferent service, and for pretty okay but not outstanding food. My tofu was chewy and just... There in my chow mein and vegetables. That being said, there's an ENTIRE page for vegetarian food, pictures for every dish and noodle option. Portions DO tend to go large, so come hungry!\n\nTotal for my family of four was $41, and we even threw in an appetizer. Very affordable.", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-16", "description": "Service was quick. Food was good. \n\nI was a bit iffy about coming here... as we were in Chinatown.. and my first thought from the name was Vietnamese food in CHINAtown? But I gave in and decided to give it a try.. \n\nThey have a HUGE menu.. and it was kinda hard to decide what I wanted... and I settled for what I typically get at a Pho restaurant.. since my niece was getting a Chinese noodle dish, my husband was getting a, what I call, unique dish... so we were set.. we'd get to try everything... then my hubby suggested we order wonton too.. which we did.. :)\n\nWe all ended getting the yellow noodle... which I kind of regret.. not because it wasn't good.. but I wish I got to try a different noodle! The wontons were YUM. My  tripe was as expected.. and my niece LOVED her yellow noodles... she's super picky so I'm super happy she liked the food and ate lots of it. She also really like the wontons as well! \n\nThis would definitely be a place I would consider eating at again the next time I head to Chinatown!", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-18", "description": "4 Star average on Yelp? You've gotta be kidding me!\n\nWe saw all the delicious pictures from the outside and it looked clean and modern inside. So we gave it a shot.\n\nDissapointed!\n\nI ordered the Satay Beef tendon with noodle soup. What I got was Dinty Moore Beef Stew Soup with Tendons + Tobasco sauce with Noodles. Then again, there was no soup! The \"soup\"  was so thick it was more of a sauce. And it tasted dead on like Dinty Moore canned stew. \n\nMy spouse ordered a basic chicken noodle soup. She said it tasted like instant noodle soup base with cheap quality noodles. Also very few chicken bits. But at least hers came out as SOUP and not SAUCE.\n\nAlso I'm not a fan of the steel dinnerware. Bowls, cups, and chopsticks are stainless steel.  It feels and looks tacky. Are we in prison? Plus steel chopsticks and steel bowls dont make very nice noises when rubbed against each other\n\nI would give this place 1 star but I usually reserve those for places that are offensive or insulting in some way.. This is more of a 1.5 star place. Half a star for the place being clean and modern looking.\n\nService was average for this type.", "author": "Johnny D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-12", "description": "The meal was yummy and tasteful. Just what I was looking for.   I did feel a bit ignored, like I was ready to order, but it seemed to take a while for them to notice. Also, when I was ready to go I finally had to ask for my check - seemed odd.  It was super clean!", "author": "Kathryn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "A clean, well lit place with great pho and fast service. Highly recommend the fried banana ice cream dessert.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-09", "description": "Huge restaurant. \n\nHuge menu. Simple and easy menu to navigate. It's all written out for you and you can personalize pretty much everything. It's like.. how do you say, the self-serve of restaurants, minus the part where you don't cook the food..? lol\n\nI think someone counted like 6 flat screen tv/monitors playing the news/advertising food they serve. \n\nFREE WIFI~~~\n\nThey serve foods that you would find in a Chinese and Vietnamese restaurant. I've come here twice and I've made the following conclusions:\n\n1) Chicken pho with ho fun (rice noodles) - Yummy. The portion size is just enough and they don't skimp too much on the chicken. Soup is yummy.\n \n2) Hainan chicken with rice - not something you should order 'cause they don't make it like other places.. a lot of bones and not too tasty\n\n3) Lemon grass chicken with rice noodles - smelled delicious and tasty according to the other members of my party\n\nThe prices here are good, since it's Chinatown so it's cheaper than most restaurants outside of Chinatown.", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Since discovering this place a few months ago, I've been coming here for lunch at least half a dozen times now.  I always order something new since there are over 400 items on their menu.  What stood out for me so far are their fried rice (I've had 2 of their options under that category so far), each time perfectly cooked with a hint of smokiness that I look for.  They also prepare their shrimps, which are thoroughly de-veined, and cook them well, with just the right amount of crunch and firmness upon biting into one.  And for those who are bitter melon aficionados like me, they also serve them just right, al-dente and thin enough so you are not overwhelmed by the bittrerness but not so thin that the flavor is lost.  \n\nWhat I also like about this restaurant is its cleanliness, including the bathrooms.  In Chinatown, that counts for a lot!!", "author": "Yvette F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "Awesome place with great food, service and price.  I ordered a wonton soup which is my favorite , but what  made it even better was the option to choose my own type of noodles.  I had the pure rice noodle which I never had before abd it was thr perfect compliment to wontons. Also you must try the 3 color bean drink.  The menu has pictures with each item that helped since I am visual person.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-08", "description": "Yummy fried rice in a variety of flavors and meat choices. So very good after a long hard bike ride over the Golden Gate Bridge. The place was super-clean, service was good, the menu was easily discernable, and the food was terrific. I wasn't completely sold on the shrimp egg-foo-young because it had too many onions, but everything else was divine. Great little place to eat local in Chinatown, San Francisco. Don't miss it.", "author": "Deb S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-03", "description": "A very quick place to stop in for an inexpensive bowl of Vietnamese, or Cambodian soup. This place is really lunch only. I've had better Pho, and don't expect to get the best bowl of Pho you've ever had. Yet, it's decent. Stay away from the seafood soups. Fishy smell. The ingredients are a bit sketchy by American standards.\n\nYet, service is fast, and they serve complimentary tea.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-07", "description": "We ordered five things and they were all pretty bland.\n\nSalt and Pepper Chicken Wings - worst I've had yet.  It was more like they battered it with flour and then sprinkled the chinese pepper salt on it(the one you eat with congee)\n\nCurried Fish Balls - these were alright but still pretty bland for a 'curry' dish\n\nHu Tieu Combo w/ Egg Noodle - this smelled good but tasted pretty bland\n\nShrimp Foo Young - not terrible\n\nWon Ton - my bf complained it was bland", "author": "Lily T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "I first ate here in high school when they were first located on Stockton in a much smaller place next to Little Paris. What people aren't understanding that this place is a chaozhou or teochew cuisine WHICH is Chinese and not Vietnamese so please don't just assume its a Vietnamese restaurant because they serve Pho - i could go on about this but i'll just continue by reviewing the food. They have a large menu with pictures to display what dishes they serve. The new location is a lot bigger and cleaner. I always get the Chicken Pho on cold days and scrambled eggs over beef chow fun on the warmer days. My mom loved the seafood fried crispy noodles. They most definitely raised the prices but can't blame them for needing to keep up with surviving in this country. They have great customer service and free wifi :)", "author": "Kristina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "It's been a year since I've come to this place... I was so looking forward to come back. Unfortunately, it did not meet my expectations. Food was not comparable to a year ago. Portions have changed and their milk tea is half the size it was before AND it's not as good anymore! Still love the Mapo Tofu, but I don't think that will be enough to make me come back... Sorry San Sun! ):", "author": "Debbie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "Overall 3.5 stars\n\nBeen here many times over the last year.\n\nFood doesn't disappoint. Menu is HUGE and has tons of pictures to help the diner chose. TOO many options if you ask me!\n\nImperial Roll are good, but dinky in size.\nScramble egg (runny type) plates are excellent.\n\nThink it's odd that everything is served on/in/with metal - ie chopsticks, side dishes, bowl, plates, cups. Feels a bit like prison.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-18", "description": "Not as great as what I expected. I believe this is their new location besides the one on stockton.\n\nOrdered the chicken noodle soup, broth is clear yet it taste like its full of MSG and salt. Had the satay fish ball, it tasted like rubber balls. Im not trying to be mean but Im just trying to be honest on what I experienced. \n\nLots of selections, from what type of noodles to what do you want in your plate. I think theres just too much going on that they are not focusing on preparing or mastering one type of food, whether its chinese, vietnamese or something different. Therefore it doesnt seem authentic, majority of the customers were tourists and non asians....\n\nBesides that, the restaurant looked cleaned and there are tons of LCD screen all over the restaurant showing you the pictures of the meal on them.", "author": "Linh D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "I stumbled upon this restaurant while walking through Chinatown.  A clean, modern, and cheerful place with friendly service and reasonable prices.  The Pho Tai was impeccable.", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "really good spot!\n\nthey have all kinds of noodles soups, menu is extensive, and they serve the noodle soups in metal bowls so your noodles remaind hot. Love it!\n\nkind service and clean restaurant, a rariety for chinatown.\n\nI got the chiu chow noodles and it was a generous portion and cheap!\n\nThey have HH specials...great spot for lunch!", "author": "Petri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "A decent hokkien/teochiu (southern Fujian, northern Canton) noodle and rice joint.  They also offer Vietnamese food (a lot of Chinese from Vietnam are Teochiu).  I order the combo soup noodles  with thin rice noodles.  It was pretty light with fish balls, pork, shrimp, kidney, fried onion, g onions and bean sprouts.  The soup noodles remind me of the ones in Taiwan (most Taiwanese have ancestors from southern Fujian).  You can choose a variety of Teochiu/Fujian/Cantonese noodles : wide rice noodles (Cantonese fun), thin rice noodles (Fujian rice vermicelli or mi fen), thin Cantonese egg noodles, yellow noodles (round spaghetti like Fujian egg noodles), a couple of varieties of kway teow (round rice noodles from Fujian).", "author": "Paul K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-01", "description": "The place is really big, always enough space for everyone.\n\nI ordered a wonton noodle soup. The tea they gave us had some chrysanthamum in it, which was a nice touch. The noodles were pretty dry and hard, probably not cooked all the way through. The wontons were whatever, not bad but not especially tasty either.\n\nOverall, just fine, nothing to brag about. Big props for it being clean, because that seems like a luxury in Chinatown.", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-02", "description": "The Pho and rice dish was 5-stars.  Really great if you can put up with the 1-Star service, and the ridiculously large menu.\n\nI had to ask at least three times during the meal for a refill on my water (I tend to go overboard with the Sriracha  sometimes), the soup took 20+ minutes to arrive in a partially full room at 4pm.  And a neighboring family was making a huge racket banging silverware on the table throwing chopsticks around, etc... and the staff made no effort to correct it.", "author": "Nate W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-03", "description": "This restaurant recently moved from Stockton St. This is a huge space, so you can usually always get a seat. I don't like how they installed TV's. I don't remember the soup base being sour in the old location, but it was sour the last time I went. I like ordering the fried fish ball soup.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "I'll always give this place 5 stars, I've been a regular here for over three years. I'll admit though if you're a tourist or don't speak Chinese it might be a little tough ordering. Once they recognize you're a regular the atmosphere totally changes. The food is always on point and service is fast. They have over 300 things to choose from, I lean more towards the Vietnamese pages with Pho.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "Solid diner-style chinese.  There was a good split of Chinese and non-chinese customers.\n\nTables have the Sriacha, fish sauce and other necessary condiments.  Menu is huge.  We had the sweet and sour fish and grilled pork over rice - both great. \n\nI'll be back - lots more I want to try.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-27", "description": "San Sun is my #1 go-to place whenever I'm in Chinatown!! \n\nI have already written a 5-star review before about their food and details but under their old business address (http://www.yelp.com/biz/san-sun-restaurant-san-francisco#hrid:jx2aq2Cp-dIBUaFkBDmJGQ), so I just gonna make this review brief by saying what's from my heart. \n\nI grew up eating their food ever since I was a little kid and I can honestly say that they have never failed to satisfy me. I have total confidence in them regardless of whatever I order on their menu (I will never say these words to ANYwhere else). All these years, they stayed the same when it comes to the quality of their food to the taste and as well as their customer service. I've watched them thrive and grow into a better and better business. I'm very happy and excited for them in regards to their new location. It's wonderful how it all started when my mom had brought me here and now even my son comes here, it's been three generations of loyalty with them and I don't doubt more generations to come...my family and I are their loyal fans for life! :)", "author": "Winnie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-12", "description": "I have been to their old location on Stockton. Came here for some rainy day takeout -- sweet & sour fish, XO sauce chicken, Chinese broccoli and beef chow fun. Well, the food wasn't all that great. I understand that they specialize in noodles and other, well, less Anglo-friendly items. I think I would have been a lot happier with their noodle soups, etc, but it was harder to do carry out. Will remember that next time I need some comfort food.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "i was a regular back at their stockton location.   i remember liking their pho, even though they always had dead baby flies swimming around in their soup, which adds to the chinatown authenticity.  \n\nwhen i walked in for a quick lunch i was immediatly seated and had 2 on 1 service!  i felt kind of pressured but thats good service i guess?\n\ni had an old favorite combination: the soup/noodles + bbq chicken (huge portions for $6.50!).    the chicken was just as juicy as i remembered it however it did not have that same sweet chinese bbq taste that i remembered.  it was also swimming in a pool of grease and came with plenty of green onions, which some people may like or dislike.   the soup was fresh and clean tasting and to my surprise, it did not have flies!  my noodles were a little clumped together and slightly over done however...\n\ndon't get the iced condensed milk tea because it is watered down and a rip off\n\naverage 3 star food, +1 star for above average service, +1 star for no more baby flies, -1 star for the less tasty chicken", "author": "Tina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-26", "description": "As someone else said, the menu is crazy big, they basically have all types of meat with various types of noodles/rice etc.\nI had the hor fun with beef and egg which I thought was pretty good - portion size is ok, in fact good for the price.\nThe hainanese chicken was very tasty albeit also on the smaller side.\n\nIt was nice inside, probably due to it being the new location. My biggest frustration was the metal dishware that it was served on kept spinning around as I attacked my food.\n\nProbably come back to try something else on the extensive menu. Looks like they went to all the other restaurants in Chinatown and then merged it into a super menu!", "author": "Nick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "I ducked into this restaurant as I was running away from some bad men in Chinatown; that's the last time I'll parkour in the area. The adrenaline subsided and hunger began to set in so I sat down.\n\nTheir menu landed on the table with a thud and it is huge! I flipped through the all of its pages, changed my mind five times before finally deciding on the scrambled egg chicken ho-fun; funny to say and delicious to eat! It arrived hot with the scrambled eggs on top covering the chicken and ho-fun on an aluminum plate.\n\nThe ho-fun was well-cooked with a soft texture and adding some Sriracha sauce really makes everything come to life! I swear I heard the chicken bawking, \"why me?\" as I chew away at the meat. The price is very reasonable at about $8 per plate and this place's endless menu choices menu are ideal for those who want to try four different cuisines in just one place. In addition, it is a great hideout for any foot chase involving bad men or lustful ladies.", "author": "Roy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-16", "description": "I like this place! The chicken pho with ho fun is awesome. It always hits the spot for me especially if it's cold out. I was battling a cold for a week and came here to load up on tea and chicken pho. They are pretty consistent with their food and the menu is enormous. In fact, it could probably be skimmed down a bit because it started to feel like an encyclopedia when I first came here. Good prices and good eats. There aren't too many restaurants like this in Chinatown, so it's a gem to me.\n\nThe biggest plus for me was that I rode my bike here and the employee let me leave it inside while I ate. That always gains huge points in my book!", "author": "Wil M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-28", "description": "Their menu is HUGE. If you're hung over and want cheap, soupy Asian food, this is a one stop location. They have tons of chinese, taiwanese, and even vietnamese cuisine. \n\nI got their chicken pho and thought it was very bland and mediocre. But my friend got the spicy beef noodle soup which was good. Perhaps I am a bit spoiled with chinese food in LA, but we ordered egg rolls and they gave us 3 wimpy looking pieces.", "author": "Amy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "Free wifi. The service is always friendly . If you go there around 5 to closed Don't order any noodle soup.", "author": "JP C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "This place use to be on Stockton and they had to relocate because of the city working on the underground lightrail muni/bart system\n\nWith the new spot, the lighting is better, and the decor is better, but their food is still the same. Their menu is huge, and its so hard to decide what to get cuz there are so many options\n\nI ordered a bowl a pho this one day and it was horrendous. There was literally three pieces of meat and that was it. The soup was not tasty at all and I barely ate it. \n\nTheir service is also lacking. No refill on tea. No greeting when walking in.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Not my kind of food but if you want to try things or you like more traditional Chinese food they have a very large menu from more expected to have no idea what that is. Great prices. Very clean which is a plus in this neighborhood. Sapporo was great! I had the shrimp with 3 types of mushrooms and found out there are mushrooms I don't like!  But the shrimp was good. My son had spicy beef pho. The broth had a really good flavor! Not to spicy either. Crunchy bean sprouts were a nice addition. Because I like to try things I had the salty lemon with soda. Don't order this unless you like salt!", "author": "Yael O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "Pretty good, but nothing special. We got the chow mein with beef curry, a won ton soup, and half of a Hainan chicken. The chow mein had great flavor. The soup broth was forgettable, but the dumplings were amazing. The chicken was a rather sorry excuse for Hainan chicken, but it was accompanied by an amazing dipping sauce that rescued it. I have better memories of the old location. It was ok for (downtown) Chinatown, but it's not near as good as most of the places in the Sunset or the Richmond.", "author": "Da Wei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-28", "description": "This is my go-to soup place in Chinatown.  Always good, always cheap, always clean and there are plenty of televisions to watch a game on.  Plus the best bars are right around the corner.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Delicious!  Great service.\n40. Combination pure rice noodle $6.50\n65. Chicken & Leek dumpling soup with vegetables $6.50\n94. Combination fried pure rice noodle $7.75\n115. Fish & Bitter Melon fried noodle $7.75\n163. Pork Kidney with ginger and onion $8.50\n228. Salted Fish & Chicken fried rice $8.50", "author": "Geri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "The og location was on stockton st. they moved to this location which has more space, the seating was good enough pretty roomy...Alot of people were complaining about the services,for me it's a basic chinatown restaurant service..Sorry guys but alot of restaurants in chinatown have bad service, i only order the scramble egg dishes #110 and on that's what this place is known for people..oh and fyi if your coming in on lunch rush hour 12-1pm good luck, For the best services and food show up after 1pm", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "Wow the first week was rough for these guys. Pretty rare for a place like this to have a line out the door, but San Sun really couldn't manage. They were extremely slow to turn tables around and took even longer to order and get food on the tables. \n\nBUT - THERE IS GOOD NEWS. \n\nIf you are looking for a good lunch at a really good price, then San Sun is the place. Their menu has over 100 items (probably more like 200) and they all look and sound good, so far everything tastes good too. They have all different types of noodles - fun, mein, vermicelli, pure rice noodles, egg noodles, pho...the list goes on. They pretty much make every kind of  \"Over Rice\" dish and have every combination you can imagine. \n\nI think part of the reason why the wait is longer than most other places in Chinatown is because this menu is huge. However, if you have the time/are prepared to wait a little bit longer than other places (like Golden Flower), I suggest trying San Sun. \n\nAnyway, week two was a lot better. It looks like they increased their staff, so there is better turn around. They still need to make improvements on organization and efficiency - especially with the lunch rush - but hopefully as they get more comfortable in this new location, all those things will fall in place.", "author": "NickJess S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "One of the best places to go to in SF Chinatown. This is their new location and it is very very nice: Lots of tables, new chairs, a bunch of new LCD TV's, nice bathrooms and a hand sanitizer outside the bathroom.\n\nAs far as the food goes, the menu is HUGE! There is so much to choose from in this menu its crazy. It would take me a lifetime to eat every single dish they offer. They have lots of variety that includes pho, meat, rice, noodles, and lots of other dishes.\n\nI recently have been only ordering pho from here. It's pretty delicious, the noodles have great texture to it and the soup is great.\n\nI also want to mention their interesting bowls, plates, chopsticks. They are all made out of metal, which seems to last a long time for the restaurant.\n\nWill be coming again whenever i'm in the area!", "author": "Chris Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-15", "description": "Since the old place moved here and yelp hasnt combined the two, decided to edit what i had from the previous location.\n\nI love this place. They have a massive menu which is even larger because there are so many options for the noodles. They are really friendly and nice when ordering and probably the only resturant that i know of in chinatown that went 'high-tech' with ordering. The new place is bigger, but there is noticeably less foot traffic here. You may have issues ordering in english, but they are patient with you and the menus have a lot of photos so you know what your getting yourself into. Their portion sizes have decreased a lot and i would rather they just increase the price instead of giving less. The food quality has also dropped a bit, but there is something there that should appeal to you.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "I love the food here. We always order the spicy beef tripe and the salty chicken fried rice. The only thing I HATE about this place are those damn metal coated plates, bowls, and utensils. They never stay in place and one of the ladies here spilled that greesy shit all over my shoes b/c again, those plates never stay in place.", "author": "Lily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "A very traditional Chinese canteen.  A lot of good eats from noodles to rice plates.  What really made me write this review was their fried fish balls.  I had to order a second plate.  It was extremely yummy!", "author": "Timmy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-15", "description": "Very delighted to still see this restaurant around.  This restaurant has been with me growing up. I don't live in SF anymore but whenever i go back to visit, the food is always good.  My favorite dish is the beef and egg over chow fun.  It is the bomb.  I also really like the satay beef noodle, and their pho is good too.  Their food is always hot and made to order.  This is the to go place in whenever I go to SF!  This place is awesome, they have free wifi toO!  This place surely reminds me of my childhood!", "author": "pooky b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "We ate the combination crispy noodles and the seafood tofu soup. They were both very good!", "author": "T B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "Love this place for it's combination \"ho fun\" noodles (the flat wide rice noodles). The combination comes with shrimp, pork and chicken meat. The broth is very flavorful, very similar to Oakland Chinatown's Vien Hoang. This place serves tons of other stuff too! Great lunch spot and super reasonable too.", "author": "Anne T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "I love this Vietnamese restraunt.  The pork dry bun is the best in the neighborhood.  This is also one of the cleanest restraunts of this type.  Prices are fantastic and If atmosphere matters to you, this is an oasis.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Looked for clean local lunch in Chinatown, wanted to avoid touristy fare. We were the only tourists in the place. Excellent noodle bowl and grilled chicken we shared it, it's alot of food. \nOnly possible problem is locals will push past you in line and hostess isn't clued in to the queue order for seating. Be assertive, it's worth it.", "author": "Foodie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-18", "description": "We stumbled on this place out of the 1000's of Chinese food restaurants after walking through the ally's in China Town.\nThe first thing we noticed was the menu was huge! Can't remember how many thick plastic covered pages there were but if you are the kind of person who can't decide from hundreds of choices, don't go there!\nI have not seen choices like this except at a Vietnamese restaurant, so there must be a mix here which I like as I get lots of choices.\nWe got 3 dishes. My wife got sweet and sour chicken. We got chow mein and I got fish with bitter melon. \nIt was really good. Its always a treat when I find bitter melon.\nThe prices were some of the lowest since we arrived in SF. So we will diffidently find this place again when in SF. \nOne thing worth mentioning is that my wife is allergic to carrots, peanuts, lettuce etc.\nWe talked to the waitress and she checked several times for us to make sure there was no peanuts or peanut oil used in here dish. Of course if a restaurant fails to find out or go out of their way to find out, we would not even give them 1 star! no matter how great they are...", "author": "Brad H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Good pho.  Good vermicelli.  Huge menu with good prices.  Nascar was on the tv, which is weird, but interesting.  Service could've been faster, but it wasn't bad.", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-25", "description": "Found this place wandering around Chinatown on a rainy day . The service was amazing, the food was brought directly to us. I most definitely recommend this restaurant. I love their crispy noodles!", "author": "Suzanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "Was walking around China Town latter in the evening. Found this place open later then most others,, Yea!!   Used the restroom,, Very clean,, Yea!! \n   A great place.. I hope they keep it clean as it is now,, as it is hard to find nice clean economical places to eat in China Town!! Well hard to find even clean places...\n   Huge menu, cool flat screen t.v.s, free WiFi!!! Great place to sit and relax when visiting China town..\n   And the price is right,,, Huge bowl of fish ball soup for $8 with complimentary hot tea.. I look forward to going back and trying more items in the near future.\n   The minus one star almost minus two is for the poor service.. Do not get me wrong the people are very nice, I met the owner he is very friendly and we had a nice short conversation... \n   But the staff needs to be trained to better describe/suggest items to those of us \"visiting China Town\". I actually would have ordered more food but did not feel I was welcome to as I was told when I first came in the kitchen closed in 20 min and needed to order everything now. I was not offered to order more even when 7 yes SEVEN other tables came in well after me including 3 arriving 10 min before closing. I was not checked on or offered a beverage other then tea as I would have liked a diet coke. The servers do not smile and are not inviting... Now this may be a cultural thing but they are in business in a high tourist area...\n   I WILL be going back as I really liked the food and the price!!!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-24", "description": "I love san sun! Whenever i'm at chinatown, this is where you'll find me. I usually order the hainam chicken. They taste pretty good compare to other restaurants! And the fried wonton are delicious snacks! This place has gotten much bigger at the new location. Cheap price and workers aren't rude!", "author": "Verdina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Solid food in a nice location!  Huge menu with 400 or so items.  Many of the soups are meals in themselves!  Entree portions are generous to say the least.  Every thing we had was very well prepared.  Following the custom in China, dishes tend to come out as they are ready resulting in everything being hot when served which I like.  Two soups, 2 apps, 2 entree and 4 beers came to about $50 with T&T.  Great deal, will be back next time in SF.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-20", "description": "This place is too good not to be yelped!  I ordered their chicken and egg over crispy fried noodle.  It is heaven!  I'm normally feeling ok after eating something like that, but this time on this hot and uncomfortable San Francisco day, I'm feeling like a winner after eating this.  This is making Tuesday.", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-09", "description": "lets go as simple as possible: large variaties of food here, cheap with very plain taste.", "author": "Xiaoyu D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-04", "description": "This place has decent Chinese food.  It's clean inside and the servers are nice.  I had the Hainan Chicken and it was ok.  Their chicken pieces are mostly bones and skin but the rice is awesome.  It comes with a soup on the side and a tasty sauce to pour over the rice.  Husband had the pan-fried noodles with seafood and it was HUGE!  It was also pretty tasty.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-16", "description": "Mediocre chinese food. Shrimp shaday is taste really blend. Same with yang chao fried rice. The only good one is their chow fun. I won't recommend this to anyone.", "author": "Indra Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "used to always order take out at the old location. i went to the new location recently. ordered the hainan chicken w/ rice. the soup that it comes with tastes super bland to me this time. i love the ginger sauce that it comes with, but did the portions shrink? nonetheless, it was able to fill me up. the service is quick, but pretty good. the new location looks nicer. i love how there's so many things on the menu to choose from, but it also makes it tough for me to choose what i want!!!", "author": "Tina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-13", "description": "One of my favorite restaurants in Chinatown. The menu is huge, the portions are big and the food is excellent. The prices are reasonable and the place is very clean.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "Can't go wrong here. Don't underestimate a Pho restaurant in China Town. It's way good. Nice restaurant to sit and eat. Not like those small, crowded, or no seat restaurants in other parts of Chinatown.", "author": "Manny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "Had the best combination platter ever. Service was great and the food was  reasonably priced (less than $15 for 2 meals and drinks) at lunch. I have a friend whose husband owned a Chinese restaurant in Indianapolis and so I can tell authentic Chinese and this was the real deal!", "author": "M K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-26", "description": "Food is good and cheap.  The menu is quite extensive...so it can make a person indecisive :)  The metal serving dishes and flatware is a little weird, but not enough to stop me from coming back for good food.", "author": "Tracy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-26", "description": "Tried the pho, and it was pretty good. Not the greatest but not the worst. You get a ton of noodles from there wide selection and meat proportion is fairly decent. Prices are decent, location is fairly convenient if your in china town. I would drop by here if I needed some fairly cheap eats that is decent.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-24", "description": "My favorite noodle place ever. Whenever I go out for lunch in Chinatown 99% of the time I would go here even though its a far walk from the office. I usually get the combination noodle soup with clear noodles. Not many places have clear noodles.  =[  I love their satay sauce, its the best satay sauce ever! I'm glad they moved to a bigger location so the wait time isn't as long.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "This place has always been a \"must-go\" every time I come to Chinatown. I love their varieties of noodle soup where you can choose the types of noodle you want. Their price is very reasonable for a portion size that big. They moved to this new location from their old site on Stockton St. Now I don't have to worry about getting a seat any more! :D", "author": "Travis C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-23", "description": "i only get #31, a noodle soup which comes with both vermicelli and egg noodles, shrimp, pork, and a bunch of chives. they also give you a vinegar and garlic mix that you can add into the soup (i usually add about one spoonful).", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "I visited recently with my family of eight. We each ordered a noodle dish. Portions were generous and the food was tasty . Best dish of the day was the grilled chicken with noodle soup. Prices were inexpensive. Will be back.", "author": "Janice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "I was a fan of the original location on Stockton, so I was concerned that the new location might lack some of the charm and quality now that it's so close to Grant. But it was fabulous as always. We got there a little late on a Sunday. It wasn't crowded and we ended up closing down the place. I had a spicy prawn dish that was excellent. My son opted for pork kidney and was also pleased. I enjoyed talking with the staff. They were great.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "quick and fresh chinese food. \n\nthe menu is a bit overwhelming, and if you order the wrong thing you will hate this place. \ni recommend anything with those fat chow mein noodles and vegetables that don't look cheap. the sauce they use on their dishes is light and not too salty. it doesn't taste like MSG is added, although i've never asked\n\ndefinitely better for your digestive system than z&y", "author": "Lizzie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-02", "description": "Good Place & Food to Eat. This place is very clean unlike other Chinatown Restaurant ! The noodle is different than any other Noodle restaurant. You can custom you noodle too haha such as: Mix 2 or 3 different kind of noodle and custom add on for about $6-8 !! Wo hoo", "author": "Steven L."}
