{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "I'm used to super cheap Mexican food, so paying $8 for a burrito was a little steep for me. Then again, it's a food truck with no other Mexican food competition in the same price range nearby. Food wasn't bad, and definitely did the job of filling me up. Not sure I'd go out of my way to get this again, but if I'm in the area and craving Mexican, I wouldn't mind eating it again.", "author": "Daisy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Was around the area for work and always saw this food truck here but never had time to try it until today, they are pretty good. The fact that the there is a coffee truck right next to this makes it a even better reason to come by. \n\nI ordered the fish taco and burrito and it was nice pretty good! I recommend trying their fish taco, it is worth it and make you want to keep ordering more. Pricing wise isn't that bad either it's the same price almost that you can get from other Mexican restaurant, super burrito for $8.50 and fish taco for $2. What a awesome deal!  \n \nOverall a great food truck if your around the financial district area, and craving some Mexican food. Definitely going to come back to try the rest of their menu!", "author": "Christopher G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "Not usually a fan of Mexican food but today I decided to get a burrito for lunch. My coworkers always come here and recommended that I should try it one of these days. Well, today i did! \n\nOrdered a regular beef burrito which comes with beans, rice, onion, cilantro, and your choice of meet. Beef was cooked perfectly and it was the perfect combo of rice with the rest of the toppings. The burrito itself was HUGE for being a regular size. Pretty sure I don't have to eat for the rest of the day lol. will definitely be back!", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-09", "description": "Awesome quesadillas! I recommend it for sure. \nThe taste was incredible and not spicy as the way I've asked.", "author": "Marina A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-24", "description": "I went to buy a tacos with my friend. All the staff was nice and friendly. But with the manager   Nick Toribio jump to help. He was very Ruth with my friend.  And mean guy. We was very sad the way how he treat  us. I was very disappoint  about that place. \nI'm sure will never back to eat there. Chipotle. They should  higer very manager and not cheap labor.  Employees who they not know how to treat very the community.", "author": "Enrique V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-25", "description": "Yes, this truck is far better than Chipotle, but that's a low bar.  Yes, it's better than those multi-ethnic delis in the FiDi that happen to offer burritos as one of many food options, but also another low bar.  No, it doesn't even compare to a solid burrito at any reputable joint in the Mission.  It's just \"OK\", hence the 3-star rating.  Also, it's annoying that they charge a credit card fee; it's in fine print at the bottom of the menu so you may not even see it as you order your burrito from the top of the menu.\n\nAl Pastor Super Burrito: Filling for sure.  I ordered it spicy, but it still felt kinda mild.  Nothing like \"Desi Hot\" at Curry Up Now.  The al pastor was decently spiced, but it didn't have the crispy cooked a lot texture (to mimic the more authentic spit cooking) you get at some places.  The \"super\" upgrade felt a little skimpy as it still seemed like mostly rice, beans and meat.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-09", "description": "This place is a few blocks away from my work and my coworker swears it's the best Mexican food truck she's had. Pretty hard to judge that it's the best noting I'm from Los Angeles and we have some amazing Mexican food in general there. \n\nAnyways after a short walk it seems like everyone was ordering a burrito. They have a regular vs super. The difference is that the super one (for 50 cents more) gets guacamole and sour cream. Everyone was ordering al pastor so I went along and get a super al pastor burrito. \n\nNow my standard for good Mexican food truck style food is high and I can say this is on par with LA trucks. For $8.50 you get a huge burrito! Def recommend getting the al pastor. Super flavorful and they ask if you want it spicy or mild. \n\nI also got the horchata for $2.50 but you should skip it. It was such a tiny cup and wasn't worth it. \n\nCome for the burrito and head over to the rooftop garden to have an amazing lunch! Lines may be long but they are really fast!", "author": "Sarah I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "Came here during lunch and got a super burrito with lengua. Quick service and fair price,  I'd come back again.", "author": "Irvin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-20", "description": "Terrible burrito. The flower the tortilla is made from is so stale and tasteless. The chicken, rice and beans were also awful.", "author": "Adolfo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "OH MY GOODNESS. Can I just say that their tortas are SUPER BOMB. YUM!\n\nOkay, so I always thought that I've never really liked Mexican food after having tried tacos and enchiladas multiple times, but I guess I just wasn't eating the right things because I AM IN LOVE WITH THEIR TORTA. Given that I've never had a torta before, I can't say that theirs are the best, but I will say they are DELICIOUS!\n\nI can't wait until I come back for another!  YAY!", "author": "Evie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "This is definitely the best burrito I've had in the financial district. I have not had the tacos, but friends have and they are reportedly good as well. They have a slightly wider selection of meats than many places, including lengua. Fast and efficient. Even when the line is long it doesn't take more than ten minutes to get through it.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "Best authentic tacos in Bay Area! Past few years, we've had the pleasure to enjoy their delicious tacos at a friend's annual summer party in the heart of La Mission District in SF. When the taco truck drove up to the house, we all formed in line to carefully select our 1st plate, only to return for a 2d and yes sometimes 3ds! My favorites are the pastor and carnitas perfectly seasoned meats spread in homemade corn tortilla and salsa, w/ slices of lime and cilantro. Can't wait til the next party coming soon!", "author": "Liz G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "The food is tasty, but my belly feels bad next two days after consuming the burrito :D", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "I usually get the super carne asada burrito with mild salsa. The chips for an additional $1 is a must! Very good especially for the price compared to other places in the area. Get there early to avoid long lines and before their chips sell out (total bummer when it does).", "author": "Holly P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-06", "description": "Blah... torta was a BAD choice. The bread was soggy within a 2 minute walk back to the office and the chicken was fatty and weird, SO BUMMED OUT!!!!!", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "Not bad for quick on the go lunch the guy taking the order was a little rude, but the burrito was not bad this guy takes Crdit cards so that was a plus... However kinda pricey for a burrito and Coke which ran me 10 bucks.... I ate at the little table provided and it was funny to over hear the white guys doing their best to speak Spanglish", "author": "Dominic A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-15", "description": "Ok i've eaten here twice. First time, chicken burrito. After about a half hour I felt a slow onset cramping in my stomach and was nauseated. I remember mentioning it to my friend; he didnt appear to have an issue and i believe he had pork.\nAnyway, for whatever reason  I was brave enough to try again today. 2 chicken tacos. Friendly service, tasted ok - but hold crap! Within 25 minutes I was in the batherroom and it was coming out of both ends. Im still at work as im too sick to get myself home on MUNI. I can at least sit up enough to write this.\nI would seriously suggest a 2nd thought on this truck.", "author": "Sparkle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "$8-8.50 for a big delicious burrito in SF? Yeahhhhh I'm never going to chipotle again", "author": "Zack H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-12", "description": "Born in LA, raised in SF. This tastes not authentic at all. If you know burritos, this sucks. If you don't, it's ok.", "author": "Jigga A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "A typical taco truck - affordable, tasty and fast. There's nothing extraordinary about the food, but I'll be back due to the convenience.\n\nCash only!", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "I don't know why this taco truck only has 3 stars I been eating at this taco truck for over 5 years and the food is Top Notch and everything is on point this taco truck deserve 5 stars, everyone else that left bad reviews are haters", "author": "Tycoon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-21", "description": "Got a super veggie burrito here today for lunch....will not bother going back.\n\nThere were probably less than 10 pinto beans total in my entire burrito. There was so little cheese I could barely taste it. Very plain with no flavor. And it was cold.", "author": "Gina G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-06", "description": "As reliable as the sun rising from the east and setting in the west, the San Buena taco truck is always in the Pacific & Jackson parking lot during lunch when I'm at work. \n\nIt's this reliability that makes it a good go-to lunch especially if you don't even have time to eat behind your desk. For some reason, a burrito wrapped in aluminum foil is a very acceptable thing to eat in a meeting. It's compact and unobtrusive to others in the room. \n\nI normally get the carne asada or the chicken and I get them basic without the guac and all the extras so it's not to messy when I'm eating and working. I do love that it's just perfectly grilled. Efficient, tasty, and reliable is lunch at the San Buena Taco Truck.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-26", "description": "They double park all the time, making bicyclist swerve into oncoming traffic . When people try to explain the NO DOUBLE PARKING LAW they workers are rude and disrespectful. Please think about others and what could happen if a bicyclist was hit because they had to go around your food truck.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "I can't believe how short of a line this truck always has downtown.  Anything with their Al pastor is absolutely delicious.  Pricing is normal and it's by far the quickest burrito you can get around lunch time in the financial district.\n\nWhy wait 20 minutes in line for curry up or chipotle when you can have delicious al pastor in less than 5?", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-15", "description": "Street tacos are pretty good - meat, cilantro, onions, and lime on two corn tortillas. Size is typical. You can ask for spicy, and it comes pretty damn hot. \n\nBurritos are also good - rice, beans, meat, and the usual fixins'. They run out of things sometimes, so be ready to have a riceless burrito once in a while. \n\nNot the best, but definitely a good choice for lunch if you are craving Mexican and want a quick bite.", "author": "Andrea B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-09", "description": "The only reason I give it two stars because how fast the food came out. I WOULDN'T come back to this truck. Food wasn't good at. I guess you get what you pay for.", "author": "Matthew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "The San Buena Truck is, LITERALLY, the closest source of food for me. They are a 'stone's throw away'; if you throw like a girl. Needing a quick bite before meetings, I ordered the Carnitas Super Burrito with no beans (no need for 'interruptions' during the meetings). I came at a good time because the line grew to 10 people within a minute. My order took a little longer than I expected and I went towards the window out of curiosity. The guy behind me in line ordered three burritos and his order was sitting ready to go out. Then I hear the cashier asking the cook about my carnitas super burrito, the cook said (in Spanish) that he messed up and added the 'pinchy frijoles'. The cashier told the cook to hurry up cuz the orders were backing up. When my burrito was complete, the cashier yelled out 'carnitas super burrito', to which I replied 'no pinchy frijoles?' He chuckled and handed me my burrito.\n\nThe burrito was very good, nice portions for a super burrito (only $.50 for the upgrade). The carnitas was very tender and the burrito was smothered with guacamole =D. The amount of cheese and sour cream was pretty scarce, maybe a bite or two and one SINGLE bean in my burrito. I think the cook was trying to make a point.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-22", "description": "The meat is tasty, but the tacos are wayyyyy to greasy thought!! \n\nThe salsas are bomb.com !", "author": "Angela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "We passed this taco truck on our way to the Thirsty Bear the other night.  I figured a taco off a truck would beat the food at TB any day.  San Buena did not disappoint!\n\nI ordered a taco al pastor for two bucks.  It was spicy and muy delicioso.  I could have eaten four more, easily.  My husband had a carnitas taco, which he inhaled before I could try a bite.  I notice they have cabeza here.  I'm a little afraid to try that, since Andrew Zimmern once said you have to watch out for bits of skull.    Now, that was at a Baja taco stand, but the idea of it has scarred me for life.", "author": "Raina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Perfect place to stop by for lunch. They're pretty quick.\n\nYou know it's legit when they have cabeza and lengua as an option of meat. I usually get the carnitas and asada and the flavors are definitely there for their tacos.  Tacos come with cilantro and onion mix and a type of salsa ranging from mild to spicy. If you want guac or cheese or what not, it's extra. So yummy! Whenever I have no clue what to eat, I come by here (which is right across the street from my office so why not?).  Their burritos are huge and full of ingredients. Not skimpy at all. They have Mexican Coke and horchata. Yum! Although, the coke is pretty pricey but I got one anyways once because I felt like I deserved it due to the day I had at work! Hah. But it is a big bottle for 3 dollars.\n\n**TIP** I love their fish tacos and if you want to try it, the owner told me they usually have em on Fridays. I always forget about it on Fridays and bring lunch. Maybe I should take my own advice! hah.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "Sshhhh! \ni just discovered that they serve fish tacos on Fridays! (not as good as a fish burrito from Tlaloc), but pretty tasty and cheap ($2.50) nonetheless!", "author": "Kaylan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-19", "description": "Pastor burrito FTMFW.\nBest one I've had.  Get the Super size, and make it spicy.  You'll thank me later.\n\nAnd hey, the other stuff looks good too.", "author": "Charles R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-22", "description": "Good not great, I have been there a few times. their version of spicy is geared to the white bread San Franciscans as it is pretty mild. They will give you extra sauce though.\n\nfor the price it is worth stopping by every now and again.", "author": "Mikey P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "I probably wouldn't have tried this place if I couldn't see it from my desk at work. I had a carne asada taco, an al pastor taco and a pollo asado taco. All were decent - the al pastor was my favorite. All in all it was just OK; I've had better and I've certainly had worse. I would go back if I was strapped for time but I'll keep looking for my \"spot\" in the Financial District.", "author": "Monika H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-07", "description": "First time here. It's about a block away from the office. It was a whim. I ordered the pork torta, SPICY, and I got a very bland disappointment. I ate it because hey, $7. I will give their fish tacos a try; they ran out while I was in line at 12:30. I may update this review if they impress me, but right now there are literally hundreds of places in SF that are better.", "author": "Jenifer S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-11", "description": "Review based only on the super burrito:\n\nThe greasiest burrito I've ever had in my life (and that's coming from someone who is not a health nut). The oil was dripping out as I ate it and flooded the inside of the burrito - that alone turned me off and I couldn't get myself to finish it. Looked like everything was fried in oil before they wrapped it into the tortilla.", "author": "Melissa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-28", "description": "Street tacos for $2!! Came here around 11:30 and only had 1 other person in line in front of me. I ordered a chicken and carne asada taco and was pretty satisfied, although I must say they were a bit on the greasy side. Good place to grab a quick lunch if you're in the mood for Mexican food.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-04", "description": "I've been to this truck many times but no more. I found pieces of meat in the vegetarian burrito I ordered today. Something I was chewing on had a strange texture and taste to it which turned out to be beef. It was just one or two pieces but is off putting to me as a vegetarian and also leads me question how they prepare and store all their food.", "author": "Markandeya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-24", "description": "Not the fanciest cuisine, but what can you expect ? \n\nThere was some not soo chewable meat, and yes it could be a little cheaper for \"food that comes off a truck\" (credit: coworker).\n\nI give them three stars for being fast, friendly, having horchata, and providing an affordable alternative to pancho villa for us embarcadero-bound workers. Will add a star when they add mexican coke.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-30", "description": "This place is a total no-go.  While it used to be a regular lunchtime spot for me, it's now unfortunately first on my restaurant no-fly list.  \n\nOver the past two months, on three separate occasions, they've not given me what I ordered.  Each time I've made the lunchtime trek to this taco truck, I've ordered a \"super\" burrito.  $7 for cheese, guacamole, and all the good stuff.  All three times I've discovered just beans and rice, wrapped in a flour tortilla. No cheese... no guac... no salsa... no flavor... and definitely not super. \n\nThe third time I actually decided it was worth trekking all the way back here to return my burrito.  When I explained to them that none of the \"super\" burrito ingredients that I paid extra for were there, I expected they'd simply make me the right burrito or refund my money.  \n\n*jaw drop*  The taco truck guy totally argues with me as he pokes and prods and dissects my 1/4-eaten burrito with his fingers.  He doesn't deny the missing ingredients, but he wanted to just give me 50 cents (maybe the price difference for making it \"super\"?) instead of making me a new burrito or giving me a refund.  \n\nTaco dude, if you can't give me what I paid for, then refund my money or make me a new one.  Finally, he caves in after putting me through total lunchtime trauma.  Super annoying.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "I love the tacos.  They are cheap ($2), fast, and taste great day after day.  The onions & green sauce go well with the meat.  The taco skin is a good texture.\n\nPeople keep telling me how unhealthy this is, but I don't see what's unhealthy about onions, meat, and tortilla.\n\nI've eaten these tacos dozens of times without getting tired of them.  They are a staple of my diet!", "author": "Niniane W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "I met up with my friends from college here since its central to our offices.  They said it was really good.\n\nGot the Carnitas super burrito which was really good!  Highly recommend.  Really cheap price.  I can't say its AS good as papalote burritos since it was smaller, but it still was really tastey.  Only problem is there is no place nearby to sit so we had to bum it in front of someones office to sit and enjoy the sun.\n\nThere's also a coffee truck next to San Buena so you can get some four barrels coffee while you wait.\n\nSuggest beating the lunchtime rush before 12PM or after 1:30PM.  We saw people waiting in line forever", "author": "Kameron K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-19", "description": "Pretty tasty, fresh burrito.  My friend who happens to be an expert on tacos says they were pretty tasty as well.   \n\nMy order: Super veggie burrito, black beans, guacamole, spicy, extra salsa.\n \nCons: Occasionally gets my order wrong, beans are too wet and sog up the toritilla.\n\nPros: Friendly and fast service, fresh ingredients, budget-friendly, good portions.\n\nMy suggestion:  Tap into their Groupon deal and enjoy a budget-friendly burrito in FiDi.", "author": "Johanna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "Decent price, decent food and the closest tacos/burritos to my office.\n\nI would steer clear of the Asada however - unless you like big chunks of cartilage and gristle.  I typically get the Carnitas.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-23", "description": "Having a craving for good, cheap Mexican food today, I treked over to the San Buena Taco Truck. There is another anonymous taco truck closer to my office, but since they jacked up their prices I haven't been back.  Paying Bentley prices for a roach coach goes against my cheap-o-nomics degree. \n\nAt $2 a taco, this place isn't dirt cheap, but it's as good as it gets in this part of town. I ordered 3 tacos, pollo asado, al pastor, and the fish (only avail Fridays). All of them were freshly made and very tasty. Out of the 3, I think the pollo asado was my favorite, but they were all pretty satisfying. For a normal appetite, I would say 3 tacos hits the spot. Any less and you'd still be hungry, and 1 more would probably equate to another 10 minutes on the treadmill. \n\nOverall a solid 3 star rating. I plan on coming back to try their tortas soon.", "author": "Neil W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-09", "description": "I would probably have rated it higher, except that I ordered an Al Pastor Super TORTA and received an Al Pastor Super Burrito.  Like Charlie Babbitt spreading the gospel about K-Mart with Ray, I'm gonna let you in on a little secret.  Burritos suck.  And they aren't Mexican.  I tolerate them on menus and when friends order them, but I (not any more) secretly despise them.\n\nSo, kind gentlemen at San Buena...next time (if there is a next time), please give me a torta and I'll update the review to reflect what you're really capable off.\n\nAs for that burrito?  I'm not gonna lie: I ate it.  And it was alright.  The pastor showed real promise.  But I'm going to need to taste it in it's intended form before I pass final judgment.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-14", "description": "Ordered a super torta - it was just crap...'Carne Asada' was some crappy, salty thin strips of steak that tasted like they belonged on an arby's sandwich. \nAll the ingredients just tasted like fast food  - just a super dissapointing taqueria meal.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "3.5. \n\nNot a bad taco truck. I had the el pastor burrito. Pretty good. A tad expensive for what you get, $7 for a super burrito that isn't big big. \n\nOne downer was the chunks of el pastor were uneven some were basically mush others were big hunks which made the burrito someone hard to eat and didn't spread the flavor evenly. The quantity of meat was pretty solid just the random size of the chunks was weird.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-18", "description": "San Buena= no Bueno\n\n7 dollars for a greasy not so fresh tasting small Burrito? no thanks.\n\nGo anywhere else but here for good food. \n\nThe guys were nice, but they need to work on the food.", "author": "Devan R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-14", "description": "I put this truck at the lower end of my taco truck scale.  Although I generally LOVE taco trucks and this truck is within 100 yards of my office, I just can't get behind their food.\n\nI think I've tried them three times in three years (or something like that) and gotten indigestion every time.  I never get indigestion but there is something about the comida they're slinging that doesn't sit well with me.  The meats they use are really low end and it shows.  \n\nToo bad.", "author": "Jay A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-15", "description": "Feels strange here in San Francisco. With all the food choices, and undercurrent of epicurean snobbery, what's a girl raised on rather plebeian diet supposed to do? Hit a taco truck. \n\nCertainly it'll have enough sketch and danger to satisfy me? Nope, proudly displayed in the front window, health inspector's report card score: 100. \n\nThe crack team of two gents in the truck served up my carnitas tacos lickity-spit. Made right there, they were piping hot, the meat tender, left me feeling totally satisfied. Only misgivings: The spicy sauce wasn't hot enough to make my nose run and there was no beer. Ces't la vie!", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "I definitely agree with my buddy Blake B. about the quality of lunchtime scrumptiousness coming from the San Buena Taco Truck in the FiDi. Though the consistency can occasionally be hit-or-miss (I've noticed if you come earlier in the day, you get a much better and tastier product), it's still the best damn Mexican truck for blocks in every direction. My particular cholesterol bomb is the al Pastor Super Burrito with extra sour cream -- I can get a coronary happy! And this is coming from the city where Super Burritos were born... don't believe me? Wikipedia it!", "author": "Adam E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-07", "description": "As mentioned by many, there is a serious lack of taqueria options in downtown, but this truck doesn't help. My two main issues are the meat, which is either way overcooked, 50% fat, or both. And the guacamole is really thin - tastes like green salt sauce. I thought that maybe this was hot sauce instead, but if so, it was the mildest hot sauce ever.\n\nI understand that in SF, it's very easy to roll up to a corner and make tons of money off of food served from a truck, but that doesn't necessarily make the offerings any good. One other problem with the burritos is that the ingredients don't blend together well, as they're too cold, resulting in non-melted sredded cheese competing with the aforementioned salt suace for your taste buds.", "author": "Owen R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-22", "description": "I hate to give one star, so I'm adding one ... due to friendly staff. \n\nWe found our way here through a Groupon Now deal. $5 for 4 tacos ... normally a $8 deal, supposedly. So, you think these are $2.00 tacos. The day we went, the sign said $1.75. So the Groupon deal should read save $2 (only) ... $7 value ... Oh, well. Whatever. But, did the tacos shrink or what? We did not discover until we uncovered our plate in the car that ... we got the dinkiest darn tacos I've ever seen. Do they have Groupon-small taco tortillas? Who knows. I won't be back to find out. Carnitas was tasty, but pretty darn greasy. I had a nice little puddle of greasy from my four carnitas tacos. The only consolation was that $5 for what we got was ok ... but don't go there expecting a 'deal'. That just gets it to what it should cost, $1.25 ea. ... especially at a street-side food truck (low overhead costs) in this type of (light industrial) neighborhood. But, I guess if you've hungry, you're in the area (don't go out of your way to drive here), and you're used to dinky $1.75 tacos ....", "author": "Gamma nu E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-07", "description": "Wow! This is, by far, the CLEANEST, NEWEST, and NICEST taco truck (roach coach) in the whole world! No kidding. I was stunned by how clean and new it is. It couldn't be more than a month or so old. The inside of which I could see was literally gleaming, polished stainless steel everywhere, even the floor. Really, the metal was to a mirror finish. When is the last time you saw that on a truck?\n\nThat being said...  the tacos were amazing. I got the pollo and asada tacos. And this is the first place I have come across in a long time that actually had the real pickled (and hot!) jalepenos and carrots.\n\nThis is real Mexico-style tacos, not that crap you get at Taco Bell or even on those roach coaches that go to the industrial centers and serve quick-slop.\n\n$2 for tacos and $1.50 for the tamarino (which was fresca, not bottled). Nice.  OH, and good salsa too.", "author": "Tristan D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-24", "description": "I ordered the veggie burrito and it was not tastey at all. The rice was hard, spicy sauce not spicy, and it was bland. Good thing I got it for free on Groupon.", "author": "Aiza B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-28", "description": "If stars were awarded based on generosity, San Buena would receive five for adding black beans at no charge to my torta.\n\nIf stars were awarded based on bread, San Buena would receive three for a just OK, not very memorable selection. And kind of soaked. Likely due to: \n\nIf stars were awarded based on oil quantity, San Buena would receive two for tossing just a bit too much on the grilled chicken.\n\nAverages to an A-OK/three star torta.\n\nTwo San Buenas down, one to go.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-06", "description": "I just had the blandest burrito from this truck. It was 2 PM, so I understood when they said they were out of both rice and chicken.  I got a super burrito anyways (carne asada), thinking it would be okay without the rice.  I asked for spicy, it was super bland.  I paid for a super burrito, it had no guacamole, and there was very little sour cream (I spied a dab the size of a pea).\n\nMy friend also got a burrito and she shares my opinion that these burritos are actually worse than the cheap frozen burritos you can pick up at Food Max.  At least those have flavor. \n\nWe will not be returning.", "author": "Emily A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-18", "description": "First off, the woman in front of me line requested no onions. Come on now - if you're going to eat tacos AND you're getting them from a taco truck parked in the middle of some seriously fine dining, \"Hold the onions\" should not be coming out of anyone's mouth.\n\nNow onto the food - GREAT!!! I like my food with flavor and spicy and these tacos are flavorful and spicy! Also the bonus for San Buena is they do Fish Tacos on Fridays! Oh yeah. \n\nIf you are one of those people that 'thinks they like spicy food' and order it spicy but then complain because it's too spicy...yeah, don't request it to be spicy here. Also, if you are going to so 'no onions' come on now, it's a taco!\n\nIt helps that I work 1 block away but I'd be willing to walk quite a few blocks for San Buena tacos.", "author": "Teresa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-01", "description": "The San Buena taco truck has been a part of my weekly lunch routine for a few years now and it is great, inexpensive and relatively quick depending on how many people are ordering.  I love getting four carne asada tacos here with spicy sauce and all the fixings.  It comes out to $8 and definitely curbs my taco craving until next lunch time comes around.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "This taco truck saved me from shooting myself when I worked right across the street at Woodberry Events, a hellhole on earth. It should of been voted one of the worst places on earth to work for, as they underpay employees, expect them to work 16-18 hours a day while on site and treat them like CRAP.  I digress...this is about the taco truck...\n\n While I was hating every minute of my job and the asscracks that I worked for, the only thing I had to look forward to was lunchtime so I can get the hell out of there to save my sanity!!! \n\nThe torta with Al Pastor is a bit of heaven. It is Navidad in my mouth.\n\nYes it is expensive, but worth every bite. \n\nI have since left the hellhole otherwise known as Woodberry. I do not miss it one bit. But I do miss the taco truck across the street immensely.", "author": "Stacy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "I've tried the Cabeza and Carne Asada burritos so far.  \n\nI'd say it's good, not great but it's the best you'll get in that are of the Financial District.  I usually like more seasoning.\n\nThat being said, I'd take this over Chipole any day.\n\nOK price and quick.  A once a week or every other week place for me.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-20", "description": "Not the best Taco Truck I've ever been to, but pretty solid for the FiDi. It's conveinant, fresh and cheap. Be sure to stop by on Friday's -  they have Fish Tacos:)", "author": "Krystal C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-26", "description": "All I ever get here now is the Carnitas torta for $5.50.\n\nVery filling without all the beans, rice, and other filler you get in a buritto.   It comes dressed with cilantro, pico de gallo, and shredded iceberg.  You can pay another $1 or so to make it \"super\" which throws cheese, guac, and sour cream on it.  It's already messy enough, I can't see adding all that to it.\n\nIf you only have one item here, I'd suggest this one.", "author": "Dave H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "Cheap $2 tacos...full of flavor. Def what I was looking for. Service was fast and hands down the best Mexican food I have had in Nor Cal. This was my first taco truck experience and it was amazingly good", "author": "Krista R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-20", "description": "The price for a simple burrito from a truck is a bit high and the potions are a bit small.  I thought the carne asada was pretty damn tasty if unusual.  It's seasoned more like ground beef typically is, which doesn't sound good but is actually pretty rad.  \n\nI'll probably go back in a few weeks to see if \"super\" adds any girth or length (maybe extra stamina too if I was a spammer) or just sour cream and guac.  I'm not too fond of sour cream on the burritos these days so it irks me to pay extra for a little spoonful of avocado.", "author": "Jared L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "I was craving mexican food and was just walking around the FiDi and saw this truck. I ended up ordering the Carne Asada Super Burrito and 2 Carne Asada tacos. The burrito was huge and it tasted pretty good. The tacos were okay.   Overall, I give it a 4 star rating. It's a good place to get food on the go.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "I love this place, its close to my work and ingredients they have is pretty fresh. I always complain about the line, I always have to wait stand around for at least 10min before I get my food, yes, 10 min to me is really long when you stand next to a parking lot wondering around. If there's one more staff in that truck, it'd be perfect.\n\nCarne asada and chicken tacos are the best, I know I know, but you gotta give chicken tacos a try when you're at this truck, they're extra tender and juicy.", "author": "Bo D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-08", "description": "I haven't been to this place since I discovered Taco Tuesdays at El Zorro. But the tacos are pretty decent. Burritos are small here and the wait can sometimes be long. I think it's about 3  blocks from my work. \n\nThis place is ok, but just doesn't have what I'm looking for me to go there at least 1x per week.", "author": "Leena C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "Obviously with no other burrito place near by they fill that void, when you would want a burrito for lunch. They are a solid 3 star nothing special. Nothing outstandingly bad either and their price is with no tax change etc. I hate coins so this is nice touch. Other than that for anybody eating mission burritos in the past this place would get 3 *", "author": "Try E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-13", "description": "For $7, I guess it's A-OK.\n\nThe guys are really nice but my super steak burrito was severely lacking today. At first I thought it was mixed with garlic or something, but hen I realized that they had over-seasoned it with salt. \n\nThe portion is massive, like any other burrito, but it's probably the first time I've felt slightly queasy after a burrito.", "author": "nina B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-22", "description": "Their service is quick but I still love my favorite taco truck in Oakland. The flavors are not as spicy as I would like it to be. When they have fish tacos available, it is delicious though!", "author": "Linda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-22", "description": "$6.50 for a burrito? Give me a break. They don't even have a vegetarian option & they charge you the same amount even if you aren't getting meat or cheese. Since the guacamole contains sour cream, if you're vegan, that leaves you with an overpriced, not very tasty burrito. I get that  San Franciscans want to feel like they're \"foodies\" by eating over-priced food out of a truck, but I'll pass. #Lame", "author": "Yiming R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "This taco truck is always packed, every time I go there are at least 5 people waiting but they are always quick to serve. I always get the tacos, I suggest \"spicy\". Fish Taco Friday is my favorite, at only $2 each, who can resist! It's cash only and don't forget to ask for chips and salsa, every time I've gone I have had to ask.", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-18", "description": "I think they are only out during lunch, but they make a darn good Super Burrito or Tacos.  El Pastor or Pollo Asado are my favorites.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-09", "description": "Faster and cheaper than most of FiDi, this taco truck storms up a crowd at lunch time. The offer tacos, burritos and tortas with a selection of meat. I got the carnitas torta which had some nice chunky, fatty pork with fresh veggies and a couple pieces of warm torta buns. It was delicious and quite overfilling. Lines can be a little long especially at lunch time.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "Good burrito! I really like the rice they use... it kept the burrito juicy but not a drippy mess! Cheap, fast and pretty damn good; I'll hit'em up again for sure.", "author": "Lee S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "This taco truck is amazingly delicious! There is usually a line but it goes pretty fast. Gotta love yummy CHEAP tacos. I haven't had their burritos yet since every time I go, I order 4 - 5 tacos. You can't go wrong here.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-01", "description": "I thought the al pastor was pretty good.  But for the size they are over-priced (I mean regular size).  In comparison,  La Corneta's al pastor has a better flavor--less salt and is almost the same price for a bigger burrito.  I also am getting tired of people using salt  to cover their inadequate spicing skills...it is so sad.  I gave them  stars because  it is  not bad--not great.  Right in the middle.  Especially for a quick cheapish lunch.\n\nI went back and tried their tacos.  I had the carnitas and I think it was really pretty good and a good deal for the price.  Nice flavor and NOT too much salt :) I recommend these over the al pastor burrito and also over Kung Fu tacos down the street. Oh, and by the way, I suppose that it isn't fair to compare them to La Cornetta because LC has a full big kitchen and everything--these guys are working out of a truck!  Pretty good for a truck.", "author": "Jorah N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-18", "description": "So, I went to the truck today in search of a new burrito experience. I've had the yummy Pasilla time and time again so I thought I would go back to basics and just look for a standard burrito.  \n\nWell, good news is the truck had it. The bad news is, it was about $3 more than I could get it in the East Bay...where I live. So, although it tasted great (chicken regular burrito), I just have a hard time paying $6.50 for a regular burrito. Esp. when the burrito is only regular sized. \n\nNice employees though, and the truck is immaculate inside.", "author": "Jenna K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-09", "description": "This taco truck ain't bad, and it does its job when you're craving tacos or burritos at work. Rule #1: Don't expect Mission-quality burritos downtown.\n\nThe line can get long during peak hours, but the prices are okay. $2 per small taco (with a variety of meats to choose from), or $7 for a super burrito (only $.50 more than a regular burrito and includes guac/cheese/sour cream). \n\nThe guys who run the truck are really nice. Keep giving them business!", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-04", "description": "My co-worker and I had a fantastical experience the first time we came here a few months ago. Ok, technically it wasn't my first since I'd been about two years ago but I honestly don't remember much about that time since I was with my cool new boss and was more focused on conversing with her than my tacos. ANYWAY, my coworker and I thoroughly enjoyed a burrito and tacos (respectively) and decided we were very lucky to have a new conveniently-located lunch option. \nCut to today - I had the same thing (carne asada tacos no cilantro - hot) and it was disappointing. Now, I know not all pieces of beef can be inspected with a microscope before being added to the taco, but the crunchy/rubbery piece of straight-up fat in my taco today really sucked. I couldn't get it out of my mouth fast enough and unfortunately, I had absolutely no desire to push forward and finish the rest of the taco (because I am a food wimp). \nI'm not going to give up hope though, because I know food trucks are the cool thing (and if they're in the Mission, they're the COOLEST thing, obvs), so hopefully this was just one bad taco day.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "Best food I've had from a truck this side of a Pink Panther sherbet pop  (I'm a sucker for gumball eyes).\n\nMy usual is the Al Pastor burrito, spicy, with a side of chips and hot salsa (only a buck more).  Fresh chips and a really yummy salsa that really isn't too hot to enjoy.  Just like yours truly.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Solid. The tacos are a good value, even at $2. Great flavor and a welcome establishment in the Financial District, where there is a dearth of Mexican joints for some reason.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "Very exciting to find a good lunch option in an area bereft of them. Very quick (at least when I was there at 12:15ish today), cheap, and the Carnitas was very good. I tried a couple other meats and they weren't as good, but the Carnitas is a good pick. I'll stick to that in the future, and I'll probably end up eating here 1-2/week!", "author": "Jake M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "I LOVE this place.  They are fast and delicious.  I eat here all the time and I am also fat.  Not sure if it is a causal relationship - I will let you do the math.\n\nGo here!", "author": "Tory P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-04", "description": "The tacos rock. burritos are just so-so (but i have high standards for burritos). there really aren't many mexican alternatives in this neighborhood, so....", "author": "Paul B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-27", "description": "Bought the Super torta and was very messy and just seemed very poorly made.  The one on Sansome street is better.  Enough said.", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-20", "description": "I've been going here a few days a week for the last few years and am still not tired of it. Someone cited having no quesadilla's as their reason for giving it low stars. Well they have quesadillas plus a lot of other stuff that isn't on their menu. But honestly their quesadillas are not that good. They also have mexican coke and other mexican soda's now which the lack of was another reviewer's reason for not giving it 5 stars.\n\nTheir tacos are great. I always get al pastor, spicy. For tortas I always get their carnitas, spicy as well. The burritos are ok but with the tacos and tortas being amazing I never get them.\n\nEvery now and again the the meat seems dry and underflavored but 90% of the time it is awesome. So if you go once and it seems terrible to you you probably went on a bad day (with the B or C squad working. A squad always brings their A game)", "author": "Asher D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "Since moving offices to within 2 blocks of the San Buena Taco Truck I must say I am having lunch 4 of 5 days here as I struggle to identify something else as affordable, filling, and tasty. I have had the menu and like it all, but the Carne Asada supremo spicey is my favorite with grilled chicken tacos a close second. Great food, nice workers, its just an enjoyable meal from the truck, hopefully something else will pop up in the neighborhood because this part of town is weak at the lunch hour, hence a mobile taco truck creates one solution.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "Damn.  I can't believe I seriously forgot to yelp the Taco Truck in the parking lot where I park everyday until now.  Seriously, there's nothing like some carnitas cooked in lard mid day while you're trying to finish up some crazy, difficult brief.  I love this place.  I always order two tacos--one chicken, one carnitas (sometimes al pastor (pork)).  I ask for some salsa and some pickled stuff.  Their pickled stuff is divine and I love how everything goes together so well.  Sometimes I get to work at 10 am, when they're already cooking the meat in there.  That whiff of cooked meat in lard can just make your mouth water! There tends to be a long line sometimes if you get there exactly at noon, so check it out closer to 11:30 and you'll be fine.  I know these tacos aren't exactly ideal for my waistline, but damn, a girl's gotta get her grub on once in a while!", "author": "Quyen T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "Awesome! In a rush back to the office I stopped on a friends recommendation. Only $4 later I was in taco heaven. So Good. Only issue was there were a couple pieces of fat I could have lived without for lunch. But I will be back", "author": "Annie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-10", "description": "Ordered the super burrito with al pastor.  Good, but not fantastic.  Seemed a little small, not exactly filling out the tortilla.  Horchata was pretty good.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-28", "description": "i went wandering around the corner looking for yoyo's when i spotted a heavenly sight sitting in a parking lot on the corner of Pacific and Sansome.  what was this?  a TACO TRUCK a mere 3 blocks from my office in the financial district.  \n\nnow this may seem slightly unfair, but as a graduate of the uc san diego electrical engineering program i know late nights and, therefore, i know burritos.  san buena burrito.  not bad, which would imply... good... but really: good bordering mediocre... especially when compared to el cotixan's or any variety of [insertprefixhere]berto's taco shops in sd.  it's really alright, everyone knows the best roach coaches are in the east bay anyway.\n\n2.5 stars... but i guess that rounds up for actually having a taco truck in fidi when i have that craving.  eater beware... at $7, it's a pricy burrito.  i think i'll go for the tacos next go 'round.  i mean, i've never heard one called the burrito truck.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "Using stars consistent with everyone else - NOTE this IS NOT in Laurel Heights as the Yelp map shows - THIS IS DOWNTOWN!", "author": "Monika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "Super cheap, great burritos, chips and guac for $1.25.  Fast and convenient.", "author": "Eric W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "This suspiciously clean taco truck serves up a solid lunch from a menu of the basics.  Choose taco, burrito or torta; choose pig, cow, or chicken; pay and go.  \n\nToday I chose three tacos:  pollo, carne asada, carnitas.  The chicken was stewed, shredded and tasty.  I've read references to grilled chicken in other reviews and was curious what I would get by simply saying \"pollo\".  Now I know, and so do you - ask for grilled if you prefer it.  The asada was my least favorite of the three.  Meat pieces were under-seasoned, slightly small and contained one piece that went (delicately, of course!) into my napkin.  Carnitas were the best, but unless it's really screwed up, I always favor this choice.\n\nMy Columbian lunch companion had a super burrito (half carne asada, half carnitas, no sour cream) and remarked on the quality of the tortilla.  I noticed that my corn tortillas were also particularly good - not merely a platform for the meat, but nicely textured, slightly corny, and additive to the overall work.  \n\nSpicy pickled veggies added welcome flavor and crunch to the tacos and were a nice differentiator.   I'll certainly add San Buena to the mix, particularly on days when nearby Maritime Plaza provides a sunny, open dining room.", "author": "KJ B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-03", "description": "This taco truck is seriously RIGHT ACROSS the street from my office.  There may be a line if you go at noon, but the wait is worth it and not that long, anyways.  I always order the Veggie Burrito with Chips and Salsa.  The guys who work here are super nice and always give me extra salsa if I ask.  The only reason I wouldn't give this place 5 stars is because they don't offer tofu (okay, it's not as bad as it sounds) or fish as a topping.  Give this place a visit for quick, yummy lunch. =)", "author": "Marilou A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-01", "description": "This truck is a few blocks away from my office. I eat here at least once a week and have never been disappointed. It's not the best burrito in town, but it's certainly not bad and you can't beat the convenience. Compared to the rest of the area, it's certainly the best. Noon-12:30 has a decent line, but any other time, you are in and out within 5 minutes.", "author": "Mark G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "This truck was at Crissy Field for a special event and I tried them out.  Ordered a chicken burrito - but there weren't any options.  Left me a bit worried.  What I got was a chicken burrito with pinto beans and tasty salsa.  I was pleasantly surprised (I really get nervous if I can't choose beans, etc).  Tasty burrito that I would order again.", "author": "Sean E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-07", "description": "terrible taco truck.\n\nprices are above average.\nno quesadillas.\nrunny beans.\n\njust to give you an example. today, i paid $9 for a coke, chips and super buritto. The super burrito was super runny, and there was half a tomato in my second bite (no, not too much salsa, literally half a tomato uncut!). I'm not even sure what was in the rest of the buritto because it was so runny. Come on, where's the beans and rice? it's not that hard. \n\nThis place pales in comparison to so many taco trucks in town, don't bother.", "author": "Zoe F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "What a good sandwich/taco week  I've had.  First, the delightful fried chicken sando at Naked Lunch, followed by the best Vietnamize sando and Vietnam.  Then I was in the neighborhood to stop the San Buena Taco truck parked in an epic sunny spot in the heart of the Ad Ghetto. Sooo I did what is apparently their specialty, the al pastor.  I got a super torta, hold the sour cream, which comes out to an reasonable five something.  I used to have a (tortilla) chip on my shoulder about al pastor, I guess some not so great experiences, but this torta totally changed my mind.  Totally blew my mind!  The meat was super tender and full of chili flavor goodness.  The bread was soft, and everything melded together to make an awesome torta.  It wasn't a giant torta, I could have used some chips on the side, but was filling enough, especially for a fivesky.    I'd visit this truck, of maybe even the taqueria, again anytime, I'd take my parents, there, I'd take my grandparents there, I'd take take my rabbi (if i had one) there, well maybe not. There ya go..get yer bueana on at San Buena", "author": "Lindonesia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "i just started working in the neighborhood and this truck was a very welcome find. the burritos are great, the location is very convenient, the prices are reasonable and the service is quick. a nice alternative to the expensive wine bars and business-people-filled pubs.", "author": "Greg A."}
