{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-19", "description": "The xianjiang noodles (E1) are legit. Has that sesame, peanut taste, mmm. We also got the beancurd noodles and dumplings (egg and chive). Both were good, but the noodles were the standout. \n\nMany people order the xianjiang chicken that comes in a larger wok-esque dish. Looks like it has some heat. Also, the pork and chives dumplings are popular. A staff lady was making a lot of those in back. \n\nShandong Deluxe is a neighborhood spot that attracts many Chinese customers. Legit. My friend who grew up in the area told me about this place.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "Really enjoyed the food. The steamed dumplings were tasty, and the wrappers were this and sturdy without being tough it rubbery.\nThe dry fried chicken wings were kinda wet, but very good. We asked for them not to be spicy, and a little sweet, and bang, very delicious.\nWe walked in and received our big take out order promptly.\nI think you'll like it here.", "author": "Hal S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "Despite the similar name to the other Shandong in Oakland I don't think their affiliated both in name and supposed quality. \n\nI'm not one to place emphasis on service before food quality but there is some truth to the bad service I read in other reviews. The staff is mostly non -english speaking. Mandarin is the main language spoken here and unless they you speak their tongue it's really hard to communicate with them. When I came here there was no line and we should of been the first on the list. Due to their disorganisation they didn't cross the names before us and so they kept looking for them. When people started coming they seated parties who came after us cause they were Mandarin speaking. \n\n\nAnyway we finally got seated and we ordered mapo tofu, Xianjian noodle, and beef pancake. Out of all 3 the pancake came out decent. The chicken and veggies in the Xian noodles came out tasting slightly raw and tasted like they could of Cooked it more. The mapo tofo had a strong herb taste to it. I've had mapo tofu at other restaurants and it tasted light, buttery smooth, and pleasant to eat not tangy like this one. \n\n\nAll in all don't see myself coming back here since the food is rather mediocre and house of pancakes is across the street and has much better service and food by far than Shandong Deluxe.", "author": "Jude N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Delicious and not for the faint of heart. There's a language barrier with most of the workers so menu is helpful. and the menu doesn't include the name of the establishment so I was confused when I got in.\n\nOrdered the xianjiang chicken. And handmade noodles. Beware of oil splattering to get to the noodle goodness. My shirt is ruined. I had to awkwardly ask for a fork. Basically it was he expensive thing on the menu and it comes out in this big wok of a thing.\n\nBeef wrap: I pointed to the chive pancake but the server said no and to order this and said delicious delicious (yes twice) complete with thumbs up. And she wasn't lying. Crispy, savory, and yummy crepe with onions chives and beef. Add some of the spicy orange sauce and you're set. I could have just eaten an order of this and be set. Seriously. Omg delicious.\n\nWatermelon juice. It was okay. Basically just juice a watermelon and voila. Definitely had mouth weird feels from the numbing peppers. Would have like there to be ice cubes in it.\n\nPlace is rather tiny. Restroom is at the very back of the restaurant....you have to bypass workers eating on top of refrigerators. Came on Sunday at 12....so yes...long line outside. Be prepared.", "author": "John Michael R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-27", "description": "I have found memories of coming here during my high school years half a decade ago as I used to consider this the best chinese noodle place in the area. Having been to a lot more places since then, i hate to say it, but this had a few too many issues compared to other chinese noodles places in the area. Some of the dishes are reasonable, but there are a lot of misses as well. The noodles and dumplings are probably worth checking out if you're in the area, so this could be worth it if you dont get the other stuff and are willing to put up with poor service. \n\nPork and mustard green noodle soup - 4/5. After all these years, at least the noodles are still good quality. A little too soft for my liking, but still pretty chewy and springy like I remember it back in the day. The pork was nice and soft, but any other flavoring the soup had was masked by how much salt they put into the soup. This made the soup and flavors feel very one note, which was disappointing. I do think the noodles are solid though, so this gets a reasonable rating regardless since I love noodles.\n\nPork and cabbage dumplings - 4/5. Juicy and on point despite being a bit salty. Similar to how my mom makes them, which makes this pretty authentic.\n\nLamb skewers - 2.5/5. Texture was okay, but it came to the table lukewarm... the spices were also didnt have much flavor to it, which is very different from the skewers youd get in china.\n\nCabbage/shrimp thing - 2/5. Parents insisted we get this, but wasnt a huge fan. All I could really taste here was cabbage and salt, but I suppose I don't really like shrimp to begin with.\n\nFried green onion pancake- 2.5/5. Flavor was okay, but this literally fell apart as we were eating it, which I didnt think could happen with green onion pancake... (in not a good way) this was also on the softer side rather than the crispy side, which is more of a preference.\n\nTea - 2/5. I dont normally bring up the tea since it's fairly standard, but it was lukewarm when it arrived to our table.", "author": "Nevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-11", "description": "If you're Asian and don't speak Mandarin well, don't come here, and don't even try calling in for takeout orders. Just because I chose not to speak Mandarin to order my food, that doesn't mean I don't understand the trashtalk the male server will laugh about right in front of you with other workers. Oh, and don't assume I didn't understand you when you called me Vietnamese trash. 我不想跟你用中文來溝通，是錯事嗎？(Translation: I didn't want to speak Chinese to communicate with you, is that so wrong?) \n\nOh but if you're Caucasian White or any other color-skinned person, you're fine. They're too intimidated by their own broken English ability to say much to your face anyway. \n\nThis visit was nothing but pure discriminatory actions. They overcooked our food, forgot about it even. We came in before the dinner rush, and they waited until more people started coming in, took THEIR orders first even though WE waved them over, and didn't even bother to apologize. The dumplings were soggy and broke apart easily. Too gelatinous in texture too. It felt like I was eating jello with a salty filling.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-20", "description": "This is the place where all the Chinese come for some authentic Chinese dumplings and hand made noodles. Great selections and service is pretty good. The two ladies who work the front are very nice, one is especially good with kids. Owner must be getting some good deals on salt, most of their cold appetizers are on the salty side but very tasty. Highly recommend the pork dumplings with napa cabbage, fish dumplings and beef dumplings. On the noodle side, we like the beef noodle soup and spicy pork noodles.", "author": "William C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Their noodle soup is da bomb!  Tried their beef tendon and lamb noodle soups, xiaolungbao (steam dumplings), and egg pancake wraps.. all are very tasty!  Better yet, I don't think they put msgs (at least not much) in the food, cuz, I don't feel thirsty after the meal...", "author": "Howie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "Happened upon here by accident. The wait at House of Pancakes was 5 parties deep and 30 - 45 minutes, saw that this place was known for their hand-pulled noodles and decided to try it out.\n\nThe restaurant is pretty old school Chinese, so don't expect super attentive and warm service. I ordered the spicy beef noodle stew and garlic green beans. The noodles themselves were very good--you could tell by the texture and consistency that they were hand pulled and fresh. The beef was okay, tender but without a ton of flavor. The broth and soup were a letdown. You could tell the spicy flavor came from a sauce that was just dumped in to spice up the soup. This flavor completely overpowered the rest of the broth and even made it taste slightly sour, which is not how a Chinese beef noodle stew is supposed to taste.\n\nThe garlic green beans were very good. Overall, this place is cheap and the noodles are good. Maybe another noodle dish would've been better. I also saw a lot of people ordering dumplings and buns, which might be better options as well.", "author": "Tim X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Was walking by and noticed they specialize in hand pulled noodles. Ducked in for takeout mid afternoon. The hand pulled noodles were awesome. Decent dumplings and pork buns. While we waited for our order were served complimentary tea. Nice touch.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-01", "description": "Very authentic little Chinese restaurant (read: bring cash, only venture to order if you speak Mandarin, and don't expect ice water the first time you ask for it) that the fiance and I happened upon because I was craving hand pulled noodles. \n\nWe got the xinjiang noodle with chicken (we were actually trying to order the xinjiang chicken since other people raved about it, but apparently my Mandarin was not up to par) and pork and napa dumplings. I wasn't a fan of the noodle dish--the noodles themselves were handmade and chewy just the way I like them, but the dish was very oily and relatively flavorless, except a tingly/numbing aftertaste that worsened with each bite. The dumplings, though, were plump and juicy with a nice chewy wrapping, and apparently you can buy them premade and frozen to go! I think that is the only thing I would ever go back for.", "author": "Yang Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "Came back to this restaurant a few more times after my first review. I have to lower the rating to 3 stars because it's too inconsistent here.\n\nTwo times, the XLB's were delicious and soupy. Another two times, the XLB's were soggy no soup in them at all.\n\nOne time I was able to pay with credit card. Another time, I was asked to pay with cash instead.\n\nThe pork dumplings with napa had been good every time, but the XLB's are a hit or miss.", "author": "Wesley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "1. Xinjiang noodle with lamb was delicious. I enjoyed the texture. It is very elastic and has a nice relatively chewy texture, but still soft enough for you to slurp on without choking yourself. The vegetables also tasted fresh and added nice colors to the dish. The lamb was tender and tasty.\n\n2. The chicken and corn dumplings are comforting! I could pop those into my mouth all day. The dumplings were freshly made and cooked.\n\n3. The pan fried dumpling was delicious too. It came out very hot. It was my first time having pan fried dumpling in SF so I have nothing to compare to, but it did not disappoint. \n\n4. The chicken wings were sweet, juicy, and fun to eat. Definitely great for snack or appetizer.\n\n5. The food took a while to come out and the wait can be long. We were lucky to get a table right away Friday night around 8pm. A huge group came about 10 minutes after we arrived.", "author": "Eileen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "First meal of 2018! My parents are a regular here and say the food is well-priced and consistent in quality. The restaurant is small but the wait is usually not more than 15 minutes when we come at our usual Sunday lunchtime. \n\nShanghai steam pao (D1, $4.95) - this is their XLB, comes with six. Taste is good but they over-steamed them today, which made it difficult to lift out of the steamer without breaking them (btw - self-proclaimed chopstick pro over here). The metal steamer's bottom has a sparse lattice structure and because the XLB was cooked too long, the dumpling skin sunk into them and started sticking to them despite the paper layer underneath designed to keep this from happening. If this is how they usually cook their soup dumplings, then I wouldn't order it again...seeing all that good XLB soup escape to anywhere other than my mouth is a small tragedy.\n\nBeef wrap (D8, $6.95) - such a great deal for a large portion of the beef wrap. My dad always orders this. Comes with a lot of onions and cilantro in it though, so just a heads up if you're not a fan. I pick all of my cilantro out lol.\n\nXian cold noodle (E1, $6.00) - this is awesome. Apparently the wait staff puts this dish together (not the kitchen) with a variety of sauces, so the taste each time depends on the ratio of sauces the waiter or waitress mixes for your dish. Today it was really good. It was the perfect amount of spicy to make it more flavorful without making your mouth feel like it's on fire, and there's some vinegar for a sour kick that's not overpowering. The dish comes with cold noodles, cucumber, cilantro, bean sprouts, and chopped peanuts. We mix it all together before eating. \n\nComb spicy seafood, chicken, pork noodle (E7, $7.95) - this is also great, and comes in a big bowl without skimping on the meats. The seafood in here includes shrimp, octopus, and fish fillets. There are also mushrooms and red and green bell peppers. The kitchen does a great job of blending the spicy and sour flavors into the soup, and the noodles are a great bouncy texture. Def a fan of this.\n\nOwner and wait staff are friendly, food is good, space is clean enough for this type of Chinese restaurant. This spot would have four stars from me if not for the XLB breaking all over the place. Will order it again next time and update my review accordingly.", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "This is my favorite noodle place is SF. All their noodles are hand pulled and their dumplings are homemade. Their noodles are super smooth and chewy. IT'S AMAZING. I love their Dan Dan noodles because their spicy soup base is so addicting!!\n\nI didn't really like their stir fright green beans very much. It seems like they overlooked it. It didn't have the crunch that I was expecting. \n\nMy mom loves their handmade dumplings. If you can't get enough during your visit, you can buy frozen ones to go! \n\nThey also have great chicken wings and green onion pancakes!", "author": "Melody L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-08", "description": "I mainly come to this restaurant for their Xiao Long Bao. However, after exploring other dumpling restaurants, Shandong's is only average. I recommend ordering the Pork Dumpling with Chives. Its extremely delicious, and one dish gives you 12 pieces. The reason I gave a 3 star is because of the waitress' attitude. When she took my order, she did not happy and sort of rolled her eyes when I asked for a togo box. Also, it is really hard to get a hold of the waitress. She is always in the back doing something.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "I always enjoy coming here to eat not just because it's in my neighborhood :) My favorite dish is probably the combo seafood noodle soup because it has the right amount of spiciness and a variety of veggies and meat. I also buy their frozen dumplings because it's so convenient to just boil them at home when I'm feeling lazy. A plus is that they accept credit card because there are a few places on Taraval that are cash only. I will definitely come back again soon!", "author": "Kristine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Been here over 2 dozen times; the waitress still doesn't acknowledge me, but who cares, the food is good. For some context, I've dined at nearly a dozen places that serve these same dishes (Millbrae, San Bruno, SF places). This place rates the highest for the following:\n\nShredded potatoes w/o peppers- tangy and vinegary, with some crisp to the potatoes, like Asian fries.\nBeef wrap- crispy, large, and fresh.\nChicken/corn dumpling (though it is on par with all other places)\nPan fried pork buns- my favorite here. They are huge with tasty fillings; crispy and flavorful bun.\nCold noodle dish- peanutty with perfectly textured handmade noodles.\n\nMost of their dishes are fantastic, but because I can't do spicy, their waitress' lack of memory results in a painful experience at times.\n\n4.5/5", "author": "Ben P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-24", "description": "Fam Bam Thur Lunch! First time here. Heard their XLB and noodles are good. Now what we think. Their XLB is definitely a no! The rest is not all that but we did enjoy the pig ear. Our favorite was just the noodles. The ja jang mian noodle was pretty good. They are known for fresh made noodles which it is pretty good. Nice and chewy. Service is ok. Slow and Short staff but they are nice. 3 Star which is for the noodles , nice staff and the rest is ok.", "author": "Christy V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-06", "description": "The food is pretty good at this little hole in the wall place, and excellent hand pulled noodles.\nI'm giving them 2 stars for their janky service.  One of the dishes we had ordered was fried rice.  Something got lost in translation and we got some fried noodles.  Western restaurants would take the dish back and bring the right one, but the dude was urging us to keep the one they brought by mistake... after a bit of eye rolling and cursing under our breath, we told the dude we'd take the mistaken order to go and have them make the fried rice dish too.\nAgain had this been a western restaurant, they likely would have given us a discount.  But nope, we sucked up their mistake.\nSo make sure they get your order right to begin with.", "author": "Roni L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "The food is excellent and authentic.  This is what you will eat in China.  It's not a Chinese-American chop suey place.", "author": "Will L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "My sister and I went to Shandong Deluxe for dinner on September 15, 2018. I always passed by the restaurant and was curious to try the food. We got a small table in front of the cashier. It wasn't very comfortable, but the restaurant was small. The first red flag was that the waitress used a dirty towel, which was dropped to the ground, to wipe our table. She did not even apologize and think about getting a new towel. (Other waitresses used the same dirty towel to clean other tables. This is very not hygienic!) My sister and I tried flagging down the waitress, but she refused to make eye contacts with us. Finally, she came to our table and take our orders (Shanghai Dumplings, Spicy Mopo Tofu, and Vegetable Soup Noodle). While we waited for our food, I noticed two families came inside: one family of six and one family of three. These two families got their food first before we got our first dish, which was the noodle soup. I was already irritated at this point, but I didn't want to make a big scene. My sister and I kept eating our food. Fifty minutes into eating, I was shocked we still hadn't gotten our Shanghai Dumplings! Fifty minutes. I flagged down the waitress and asked where the dumplings were. I actually asked her to cancel the order, which I rarely do when I am dining out. She came back to our table and said that the dumplings were being steamed. At this moment, I knew the waitress had forgotten our order. How long does it take to steam dumplings??? I asked her when the dumplings would be ready. She pretended she didn't understand me. She didn't even apologize for her mistake! My sister was honest and rejected the dumplings. At this moment, I noticed the two families already finished eating and left the restaurant! Unbelievable. Terrible service. Rude. Unprofessional. My sister and I did not have a good experience here. We will not come back. The food was just mediocre.  \n\nNote for improvement: treat your customers equally even those who speak Mandarin in a different accent. We understand you when you speak in Mandarin. We notice when we are being treated differently!", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "Our pan fried pork dumplings were completely RAW. I felt sick after taking a bite. It wasn't even close to being cooked. It was disgusting. I don't know how it got such a good health score bc the place felt so dirty and the plates/bowls/utensils were definitely not clean.\n\nAVOID this place! Typically I give places second chances but I don't want to risk my health.", "author": "J A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-15", "description": "If i could give this place 0 or negative stars i would. Came in with 3 other people and ordered 4 dishes and waitress kept insisting that its not enough. We told her some of us ate already and she smirked at us and started talking crap about us in chinese thinking we don't understand her. \n\nFood here is okay (3/5). Service (-10/5). If we say we want 4 dishes, don't keep insisting we need more than what we ordered.", "author": "Valerie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "Ok I don't think this place is a 3-star, but maybe not a 5 star either, definitely at least 3.5-4 stars. \nquick good service of food. I asked for raw garlic (love garlic and vinegar with the dumplings) and got it for free on the side. \nthe mackerel dumplings are a must-try, very authentic. hand made noodles and dumplings for sure. they did boil them to a semi-soft way instead of chewy so some people may or may not like that.\nwe got E7 Comb Spicy Seafood Chicken Pork noodles, B3 Fish Dumplings (spanish mackerel), fresh jelly fish salad (so good), A11 marinater pig ear, all very good and hit the spot. \nwould say it is very authentic!", "author": "S W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-24", "description": "Came here Saturday noon, there was a short wait in the crowded restaurant.\n\nAs soon as we sat down we were brought dirty, plates and teacups. I'm talking about a huge piece of food still stuck to the inside of the teacup. All the plates were a different design as well.\n\nMy family ordered the cold noodle thing with the sliced cucumbers on top, lamb soup, a beef onion roll and the da pan ji. The cold noodle plate was tasty but nothing fancy. The lamb soup was literally old, tough pieces of lamb in a broth of oil. The beef onion roll was more green onions than beef and the da pan ji took about 40 minutes.\n\nNot impressed with this restaurant at all, if they're willing to crank out dirty plates and cups, I can only imagine what their kitchen looks like. The food was mediocre at best. Only thing worth trying is the hot sauce condiment.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-09", "description": "My family and I came here with my grandpa on a Sunday at around 11am. The restaurant was small and a little crowded, and we were seated right away. The servers spoke Mandarin, and we spoke Cantonese so communication was a little spotty, but nothing too major. The first thing I noticed when we were seated and given the plates and utensils was that the plates were not the same size. My plate size was bigger than my brother's and the inconsistency of the plate size kind of bothered me. The seating was also tight, since the tables were all close together. We ordered 6 dishes for the 6 of us.\n\nFood:\n\n- Xiao long bao: The xiao long bao was kind of small. It was also overcooked, since the soupy goodness came out and wasn't in the dumplings when we ate it.\n\n- Potstickers: The potstickers were big and delicious, though it didn't have that nice crispy bottom from when you panfry them, and the skin was a little soggy.\n\n- Green onion pancakes: There was not a lot of green onions. This pancake was thin and crispy, which I liked, but I wish there was a bit more dough in the pancakes.\n\n- Beef tendon noodle soup: The noodle soup broth was light and not too heavy, though there wasn't much flavoring. However, the beef tendon was nice and soft and tender. The noodles were super long, and we had to ask one of the servers to come and cut it for us, since it was hard to dish the long noodles in the bowls.\n\n- Beef chow fun: The noodles were oily and not crispy enough. There was a lot of bean sprouts (I love bean sprouts), but the ratio of beef and noodles to bean sprouts was way off, with too many bean sprouts and not enough beef and noodles.\n\n- Garlic green beans: The green beans had enough garlic, though the green beans themselves were kind of soggy and not crispy.\n\nAnother major thing that I noticed was that when we were served the food, no serving utensils were given to us. Maybe it was kind of like \"every man for themselves\" and everyone was supposed to get the food with their own chopsticks, but I just wished they gave us serving utensils so it was easier to dish out the food. Overall, I'm kind of disappointed since when we walk by, we usually see a line of people out the door so I assumed the food would be good. The food was decent, but I don't think my family and I would come back here to eat.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "Beef noodle soup \nShrimp dumplings\nChow fun with shrimp\n\nOrdered what we liked; didn't really use the menu. \n\nBill came to $34 including tip. \n\nIt felt homey and homemade and it was cute to see the rather conservative, traditional servers going gaga over my little cutie. They happily brought him his requested extra shrimp.", "author": "Camille L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "This a small hole in the wall place, it was pretty much empty when my friend and I came in at around 6. But shortly after being seated, the place quickly filled up. I got the black bean with pork noodle, it was alright, but a bit too salty for my liking. The noodles had a good semi-chewy texture and were very elastic. The flavor was strong, but as I said before was too salty. Service was okay, you might need to flag down a waiter if you really want something.", "author": "Donald C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Hole in the wall type of place.  Not the cleanest but as with most hole in the wall places thats what you can pretty much expect coming here. XLB's are a hit or miss, they are either really soupy or soupless.. but I'm usually ok with this since I love any kind of dumpling! They could try cleaning the bottle to the vinegar sauce they provide on the table.. It feels like people touched their food with their hands and then proceeded to pick up the bottle... or it feels like food splattered on the bottle with no one wiping it down and then the whole cycle repeats itself with each new customer sitting at the table. LOL ok, my imagination is getting out of hand. Overall, I like this place because it's walking distance and very convenient.", "author": "Mauricia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Let's be real for a second...legit Chinese food in the city does not equal legit service in the city. The service is spotty as hell, and the seating is awkward, but if you can get past all of that, the shanghainese food here is super legit. \n\nDecor - strange. Some tables seem higher than they should be for the seats. Place is super tiny, so the set-up of some of the tables are awkward as hell. \n\nService - it's majorly hit or miss. There's always this one waitress there that's super jollier compared to the rest. When they're busy (bc they do a ton of take-out orders), the dine-in service decreases significantly. \n\nFood - . Authentic, homemade shanghainese food. Get the hand pulled noodles, homemade fish dumplings, pan fried potstickers, tofu skin side dishes, and their peanut sauce noodle (they'll def recommend this, even if you don't ask for a reco). There's also a spicy chicken dish situation that everyone always gets - I don't eat chicken, but my friends and family tell me it's legit. All in all, you really can't go wrong with any of their dishes here. \n\nDecor/ambiance - 3\nService - 3\nFood - 6! haha\n\nRounds up to 4 stars, right?", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Affordable, great service and yummy food. What more can a girl ask for? This restaurant has the best orange hot sauce too. It's super spicy...but it's literally so so good with everything here!\n\nFrom the menu, the highlights are their Shanghai dumplings which are perfect, with soup oozing out right after you bite the tip of the dumpling off. Add a little vinegar, their orange sauce and you're good to go. The pan fried dumplings are good as well. The spicy beef noodle soup is one of their most popular dishes, order this! My bf loves their cold noodles, which sells out pretty quick. Also their apps like bean curd salad, cucumber salad, and beef tripe are pretty addicting.\n\nTips:\n+Noodles are house made, who doesn't love homemade noodles?!\n+Super cheap! \n+Cash only, there is a BofA across the street!", "author": "Elisa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-31", "description": "Shandong Deluxe is okay, not great, but I think it's more Northern Chinese cuisine where I'm biased towards Southern Cantonese delights.\n\nThe service is friendly 'tho more ESL where it helps if you speak Mandarin Chinese, but they can and do communicate in English.\n\nThe seating is a bit cramped and the dining area space is small.\n\nWe tried their signature dish, Xinjlang Style Chicken * with noodle which was a generous portion for the price, but the spices used, and it wasn't a matter of it being hot spices, but the blend oddly had everyone at the table feel a hazy numbness in their tastebuds that was alarming and discomforting to a degree, so we ended up boxing it up to evaluate and try later.\n\nThe cut noodle used for the Xinjang dish was a broad thick chow fun styled rice noodle I think, which was very good in taste (sans the Xinjang spice sauce) and texture, which was a bit chewy.  \n\nI'd love to know what dishes they serve using this noodle and would try it again.\n\nParking in the area of Taravel near 19th avenue can be easy and can be tough, it's random parking karma and timing whether you go for a meter or venture into the residential neighborhood.\n\nWith so many options to eat in San Francisco, I doubt if I'd come back here on my own accord, but if I was with a group who insisted on going here, I'd give it another try and order other menu items to try it again.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-21", "description": "Along Taraval, there's a gluttony of spots offering up noodles and dumplings. I'm pretty sure I've been to at least a third of them now and to me, none of them have stood out from the rest. I was pretty excited to try Shandong Deluxe as I had already missed an opportunity to do so many moons ago. Let me tell you this; go earlier than traditional lunch time noon hours as you'll be waiting if your party is greater than 2. It got packed quick but luckily I was smugly sitting my table already.  \n\nThey have a semi open kitchen and you can see them cooking up food and putting it on the counter for the wait staff to bring it out. We started with the fish filets in spicy chili oil and it was presented in Paul Bunyan's soup cup. Tons of Sichuan peppers and fresh peppercorns provided a kick but it wasn't overwhelming. I wish their had been more fish than vegetables though. We also got their seafood and meat combo noodles that I thought would be stir-fried but instead came with some odd looking tomato like broth. Not bad but not great either.  The dumplings, which were pan fried but can be steamed, were humongous. It reminded me of the Vietnamese banh bao in terms of girth and dough to filling ratio. I had one and it was delicious with their home made hot sauce. I would recommend skipping the beef roll pancake though. Too much hoisin and not enough flavors of beef.\n\nI'm big on having competition for most things in life, with food being my most passionate to date. It gives me an excuse to continue looking for the best since this was only 3 stars for me.", "author": "Quoc N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-20", "description": "Service was horrible, I asked for ice water three times it took 10 minute for it to get here when the water came there are weird particles floating all over there was also a tiny chunk of something inside. I asked the waitress to please replace it for me , she took the water and I never got it back not even after paying the bill.........food was not good don't think I will be returning...", "author": "Kimco L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "Horrific AND slow service. Food is extremely basic, you could get it anywhere. Definitely go somewhere else unless you want a shitty waitress that's rude and forgets your order.", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "Such a hit or miss. Got the spicy beef noodle soup last night, expecting that robust smoky flavor from chili oil and what not. To my disappointment, it was just regular beef noodle soup with a dallop of their orange hot sauce mixed into it... Meh. I just asked for a plate of chili oil on the side and mixed it into the soup myself. Beef roll was pretty good last night as always. As well as the chive pork dumplings. Both are staple orders. Will be an average 3 stars.", "author": "Susanna C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-05", "description": "Ordered 3 plates Togo, 2 of the 3 were wrong! The waiteress completely ignored me, I stood there waiting for her to serve me, but she kept looking at the bills for other customers dining in the restaurant. Finally I had to flag down another waitress who helped me. I would rate it 0 stats if it was an option.", "author": "Silver Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-03", "description": "Came here on a Sunday at 7. Surprisingly it was not busy. I pass by a lot and see a wait. \n\nI got the xian cold noodles, spicy tendon, beef rolls, xlb and cold bean noodle. The Xian cold noodles were not good. They tasted a bit like watered down peanut sauce plus a little vinegar. Beef rolls had a little too much vegetables and too little meat. XLB was good. Spicy tendon was good, not too spicy though. Cold bean noodle was probably my favorite.\n\nPictures on yelp are pretty consistent. I would come back if I wanted some XLB.", "author": "Darlene T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Chicken and noodles (大盘鸡) was excellent, not too spicy, but just the enough amount of spices. Great price for the portion too, $20 feed 2 -3 people.\nRecommend this dish!", "author": "X G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-12", "description": "Went on a busy Saturday during lunch hours. The Big Plate Chicken was spicy and delicious. The lamb soup with bread pieces didn't have a single piece of lamb.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "Shandong's hand-cranked noodles and dumplings seem quite authentic. The restaurant is very simple in appearance and casual thus, they produce reasonable foods at a low cost.\n\nAt $7.95 their Lamb Dumpling w/Squash (11) come somewhat like a soup dumpling, filled with juice/broth, meat and vegetable. \n\nAt $7.95 their (4) Lamb Skewers appetizer looks spicy but it is not. It is very well seasoned yet its lamb-ness remains intact.\n\nAt $5.95 the Marinated Pork Elbow Salad (cold) was just too plain for me yet may speak volumes to you.\n\nIn the specialty dim sums section of the menu they offer a $6.95 Beef Wrap. Although there may be more veggie than meat this was quite heavy/filling.\n\nNot for everyone but I do enjoy the $6.95 Napa (cabbage) w/dry shrimp.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "I saw a lot of bad reviews for this place but I guess it really depends on what you order. This place is known for their noodles as they are handmade and pretty authentic. \n\nRecommended dish: 新疆丁丁炒面. Delicious chopped up noodles with various vegetables and beef.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "i love this place.\ni don't think there's ever been a dish ordered that i've hated. \nthe vibe is casual, as in you can come here wearing sweats and sandals, no big deal.\ni think their specialty is the dapanji aka big chicken dish. its the priciest thing under \"noodles.\" NOTE if you get this, expect to wait a while maybe like 20-30 minutes? the wait will be worth it.\nmy all time favorite though is the cold noodles and spicy boiled fish fillet. i dont know what they put in the spicy soup but it's amazing. i never finish the broth but i always take it home so that i can add in my own fish for leftovers.\nas for the cold noodles, if you don't come early they will probably sell out. \n\nthings here are very spicy and a lot of their dishes have those numbing peppercorns, so be careful! but i love it, and maybe you will too.", "author": "Rily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "The Xi'an Cold noodle is the best for sure. Dumplings are highly recommended also. Actually the food there are awesome.", "author": "Ming S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "I can't put into words how good the food here is.  I came here with a friend on a rainy day and we split a few noodle & dumpling soups.  It was sublimely good.  I've honestly never had better noodles.  Maybe not the best place to go if you're in a hurry but it's worth making time for.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-26", "description": "I am pleasantly surprised to be a fan of this neighborhood Sunset spot. First off, the XLB had a good skin but most importantly had a very flavorful soup inside. They all remained intact as we picked them out of the steamer...another plus. We tried the Xinjian noodles and I couldn't stop eating it. Loved the  texture of theses wide, cold, flat noodles and the sauce was addictive. They have an assortment of other dumplings with various insides. I'd definitely come back to try more things on their menu, especially the Xinjiang chicken noodle dish that I saw several tables order.", "author": "Rick T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "I can only comment on the frozen vegetarian dumplings which are great to keep at home for a lazy meal.  Make sure to get the \"chive and egg\" dumpling instead of the \"vegetarian\" dumplings, which has a cabbage mixture which has been chopped a bit too finely with not much texture.  The chive filling is more flavorful and also vegetarian.  The texture of the dumpling skin is nice and chewy, not too thick or thin.  I believe it is around $8 for a bag of 20. Credit card is for minimum of $20.  The noodle dishes also look good, hopefully I can try them in the future.", "author": "Susan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Came here for a late lunch. The place is pretty small so it might be hard getting a table during the lunch rush.\n\nWe ordered a large variety if dishes: vegetable dumpling, chive pancake, spicy noodles, bean curd, spicy potatoes,  fungus with cucumber salad. The chives pancake and vegetable dumpling were delicious.\n\nThe tea here was light on flavor. And similar with other Asian restaurants, you need to constantly flag the server to get anything. But it's definitely worth it for the food.", "author": "Goku U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Every good restaurant will do something a little bit different or better than their competition. For Shandong Deluxe, their forte is the handmade noodles and it's something I keep coming back for.\n\nI first tried this place on a whim about two years ago and was instantly hooked on their spicy beef noodle soup, more specifically their delicious noodles found in said soup. When picking up the noodles, I always notice how each strand is strikingly different. The imperfections from hand pulling creates a variety of thin and thick noodles that provide a nice contrast in textures and gives each bite a unique mouthfeel. I've had this dish elsewhere and their noodles are always identical, and uniformity is boring. The broth is also very flavorful, with a good balance between spicy and savory.\n\nI always order a few items when I come here and that's so I can see what goes well with the spicy beef noodle soup. While the dumplings aren't the best I've had, they are a great side to compliment the main course. For pairing, I recommend the pork with napa cabbage or chicken with corn as the subtle sweetness from the cabbage and corn goes well with the spicy broth. Their beef pancake and pan fried buns are okay, but the former is a bit too greasy and the latter is too doughy for my liking. Maybe I'll try dipping them in the soup next time, I'll have to report back. For about $9, it's hard to beat a bowl of soup with delicious handmade noodles. Give it a try!", "author": "Philip W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "Came here for an early quick bite.  Inexpensive fare and the noodle soup was just light enough to be refreshing (some may call it bland).\nI'd give it a 3.5-4.\n\nHand pulled noodles were good.\nYellow stained old plastic bowls were bad.   Time to switch to glass bowls or replace them pronto.\n\nRestroom was clean on this visit, and you get a chance to walk by the open kitchen and see them pulling noodles and making dim sum near the fridge at the back.", "author": "Drew B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-04", "description": "I ordered the spicy beef noodle and vegetable shrimp dumplings. The noodles were chewy. However, both noodles and dumplings were SUPER SALTY. I can't finish either of these, I ended up bring home and used hot water to wash out the salty taste. I will not go here anymore.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-14", "description": "Come here for the noodles not the service. The service definitely leaves little to be desired but the hand-pulled noodles are simply delicious. I got the spicy beef noodle soup. It was spicy but I couldn't stop eating because it was so good! I would come back to try all the other noodle dishes.", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-08", "description": "Very DISAPPOINT !! Has been to this place since it open, and usually order frozen dumpling to go. But the quality is getting worse now, I find the broken bones in the lamp dumpling, ALL of it! Every single bite! The hardness could cause tooth wear, so you can image how hard that is, that will cause serious problem if old people eat it!!!! If they continue the irresponsibility attitude when they making food for people then i don't think we will go back again! \n\n非常失望！從開業就常光顧，每次都會點冷凍水餃帶走，可是現在的質量變的非常不好，每一次都會點的羊肉水餃，現在在裡面竟然吃到了碎掉的骨頭，每一塊裡面都有，而且非常硬，不知道的人很容易咬下去很容易傷到牙齒，特別是老人家吃的話會很危險！我認為這種對食物這麼不負責任不細心的態度讓人很生氣！如果再持續這樣，我不認為我們還會去消費！", "author": "Ni K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-16", "description": "Fake commercial, cold food, junky service. We came because of their ads said 80 percents off now, but they admit that and charge me full price. I heard the owner talk to her staff \"ads is just the ads, I would not giving up even 1 cent\"", "author": "Wen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "Very disappointed!! The quality is getting worse and worse. Dumping not as fresh as usual. The beef rolls taste like....you know the rest~ I won't come any mores\n\n真的不好吃, 水餃不新鮮, 牛肉捲餅太難吃了~", "author": "Jerry Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-13", "description": "2/2.5 stars; food was alright. It was a decent experience to try Northern Chinese cuisine, but the wait was ridiculous. Not only is this place quite busy at night, the seating is very limited and cramped. After waiting for a long while, they told us (3 adults) to sit on a tiny two-seater (small table) that was awkwardly placed in between tables and the turning corner. Since there wasnt enough table space, we decided to wait a bit longer for a bigger table to clear. When our dumplings came, I squeezed the soy sauce bottle to find a small dead bug on my plate. Overall, it was nice to try, but will probably not return.", "author": "Joanne H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "This is a fairly busy small restaurant. Warning, don't expect to be waited on, you need to figure out what you want and wave down the wait staff. The house chicken dish is a must try, but order additional homemade hand pulled noodles.  Bring lots of friends, this will easily feed six people.  Their dumplings are all good, so definitely try anyone of them.  If you expect the wait staff to fawn over you, this is not the place for you, this is a busy hole in the wall fantastic place to eat and you don't need to come here wasting the  wait staffs time or mine i'm waiting behind you when you are clueless.\nGreat restaurant but just order anything, I have not ordered anything that i have not liked here.", "author": "Raymond L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "My friend's mom took me here on my last day in SF. It's one of her favorites for authentic Chinese food, which SF does wonderfully.\n\nApparently later on in the day it gets really crowded, but thankfully we got there early on a rainy day, which meant no lines for us! We were seated an took a while to decide what we wanted to eat. Another bonus about eating here, besides the fact that the food is delicious is the price! In comparison to the $22 brunch I had the day before, it was refreshing to see generous portions in the $5-10 range. The food comes out relatively quickly too!\n\nCOLD NOODLES: These cold noodles were different than ones I've had before. The noodles are flat and larger, and the sauce is less thick. Nonetheless, this was one of my favorite things we ordered! I love the sauce and the cucumbers that top it all off. \nPORK AND CHIVE DUMPLINGS: Towards the back of the restaurant sits a lovely woman who hand makes all of the dumplings. I love that! The meat was really well seasoned and the dumplings were nice and soupy! For around $6 (or more for other meats, less for veggies) you get 20 dumplings, which is a steal!\nLAMB SKEWERS: This dish came with 4 skewers that each had about 4-5 pieces of lamb on them. They were sprinkled with cumin and some spicy red pepper seasoning. I'm not the biggest fan of lamb, but I thought this one offered a different flavor from the rest of the things we ordered. \n\nI can only imagine how good everything else on the menu is! Come around 11 to avoid the line and taste great Chinese food!", "author": "Jayleen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "My mom and I love coming here for authentic Chinese food. Common with most Asian restaurants, though the service may not be the fastest, the food is delicious. And it is super cheap. You get huge portions at low prices. Here are some of the more notable dishes they serve here. They are known for the noodles (you can see the chefs make it fresh in the back from your seat).\n\nCOLD NOODLES - This was a very interesting dish. It is flat rice noodles topped with peanut sauce and cucumbers. I recommend this as an appetizer. I can't quite pinpoint what the flavor is but it is unique and a must-try. \n\nDUMPLINGS - Dumplings here tend to have a thick skin. My favorite is the chicken and corn. They also have unique flavors like lamb or sea cucumber. \n\nZHA JIANG MEIN - This is the absolute best. It is noodles topped with a black bean paste. It isn't too salty. It may look ugly but this is hands down the most popular dish here.\n\nLAMB SKEWERS - This is also seasoned with a unique flavor that compliments the lamb well. However, this has more of a Western flavor to it and is not traditional Chinese food (if that is what you are looking for).", "author": "Melinda L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-09", "description": "3rd time here with friends.\n\nI ordered Spicy Beef Noodle Soup.\nHand made Noodle is great and chewy \nBeef is very soft \nSoup is not that good. Too spicy!\n\nSo here is the problem, they have a open kitchen \nI happen to see their chef took his big spoon and drink out of that spoon and put it right back in the pot. \nI am sure many chef does that but problem is they shouldn't have their customer see it! \"Open kit", "author": "Mack A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-31", "description": "We ordered two beef tendon noodle soups, beef stew noodle soup, dumplings, beef wrap, lamb skewer, beef pan cake, and red bean paste cake. \n\nWe were seated soon after we arrived and the food came out quickly. Service was good as we got what we needed quickly. \n\nLet's review the food items we ordered. The red bean paste cake was baked instead of fried. That made me think they bought it from a supermarket. The beef pan cake was not crispy and the inside was not juicy.  The dumplings I couldn't taste the meat but I can taste the salt. The beef wrap didn't have much beef in it and over sauced and had too much cilantro. It's call a beef wrap and not cilantro wrap. The noodle soups only had five to six small pieces of stew and tendons in each bowl. My son loves beef tendons and he didn't touch any of his in his bowl. The noodles were good and were plentiful.  The lamb skewer was very good.  Should have ordered nine lamb skewers instead. \n\nWe won't be back again.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-04", "description": "Went there around 5pm on Sunday.  Ordered the Shandong chicken Noodle.   Had to wait 45 minutes to get it.  Food taste = 7/10.   That dish is for 3-4 people because it is HUGE.   Will come back again to try others", "author": "Stanley L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-28", "description": "Didn't have a great experience at Shandong Deluxe. Came here for lunch with my family on a Saturday afternoon. We ordered a few items to share:\n\n- Pork Dumpling with Chives: great portion, okay texture, but the pork tasted bland.\n- Xiao Long Bao: six dumplings, but the skin tore apart very easily, causing the soup to leak out. Not particularly memorable.\n- Chicken chow mein: they used their own hand pulled noodles, which was very interesting. But the dish was incredibly greasy, and the chicken was very rough and had a strange taste.\n- Pork & Fungus Noodle: not that great -- noodle and soup were extremely bland, some ingredients used were very salty, egg had a strange taste.\n\nOverall, I was quite disappointed by the quality of the food.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-27", "description": "They changed their chef and the food is not as good as it used to be. I used to get takeout from this place all the time, but the last time I called, they told me they didn't speak English and hung up on me. Pretty bummed to see the food quality and service go down the past few months.", "author": "Jules C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "I have to agree with the review of \"S W.\" from Orange, CA...  Shandong Deluxe is NOT a 3-star establishment.  I would give this establishment \"4-4.5 stars\" based on the fact that it's menu is filled with dishes I'd never even heard of, the pricing is reasonable, and I've loved everything I've eaten.  I stumbled into this place accidentally and have now become a full blown regular.  If you want reasonably priced authentic Asian cuisine that feels like a home-cooked meal, do yourself a favor and stop by Shandong Deluxe.", "author": "Marlon O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "The food was not bad at all for such cheap price and huge portion, but note that the shrimp and chive dumplings were mostly chives - there's about 1/5 of a small shrimp in each dumpling. Talk about cutting cost.\n\nService was pretty much everybody said how it was. As my companion and I settled down at our table, neither tea or water was served to us, and the two waitress ladies were discussing in Mandarin on whether they should've got us tea. Unfortunately, we picked up a little Mandarin. Fortunately, my companion was not as petty as I am.", "author": "Chii L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-28", "description": "231. Stopped here for a late lunch after a visit to the zoo.  They have very limited seating, but we got here after 2pm, so it was pretty empty.  We ordered the veggie dumplings, veggie noodle soup, onion pancakes, and xiao long bao.  They ran out of veggie potstickers ):\n\nEverything was more or less alright.  The hand pulled noodles were very chewy, and the soup was light.  The pancakes were a bit oily.\n\nService was like your average Chinese restaurant, almost nonexistent.  We had a slight mishap with the bill at the end.  Street parking shouldn't be too hard to find.  Look along 21st.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "The hand pulled noodles were really long and tasted slightly chewy, so it was perfect for my taste. Seems the noodles were all hand made in the kitchen, according to the photos in the windows.  Mayor Lee also came here, as shown in the photo on the wall.  Dumplings were good.  Use the vinegar they provide on the table as dipping sauce for the the dumplings to bring out the taste.  String beans came piping hot and were delicious.  Would go back to try the big signature dish, literally translated from Chinese is 'big bowl chicken' that I noticed everyone was eating when we left. Staff were super friendly.  A nice little place for comfort food.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-01", "description": "Worst place ever. They change another chief who cooked like shit, and also rude service. One of my favorite places in SF before, but not gonna come next time.", "author": "Chao D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Delicious and authentic Chinese food. For noodles so far we have tried Xinjiang Noodle and Special Hot Oil Noodle. They are both delicious!! If you like Chinese pancake, order the Beef Pancake. it is one the best beef pancake I have had. We also tried the Chives Pancake. Crispy on the outside with delicious chives and egg filling. You won't be disappointed with the food here.", "author": "Shinta L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "This worst review is about their customer service.\nThe 1 star (negative if possible) review is not for their food. I even couldn't get there.\n\nOn Sunday, about lunch time, we put our name on the waiting list (marker and white board. Typical method at popular Chinese restaurant around the area) . \nWe waited good 40 min. I knew finally it's our turn for the next call.\n\nA lady from the restaurant came outside, she showed 2 fingers which I guessed \"2 people\".\nI approached her, told her that it would be us.  She just ignored me and talked another couple whom came after us in Chinese, then let them bring inside for seating.  I guess she doesn't speak any English, which is still OK, but she even didn't bothered to bring the white board to see or just simply try to communicate to us.\n\nI was very upset especially after long waiting in hot sunny sidewalk. \nThey have English menu, but WTF, don't show the menu in English if you don't care other than Chinese.", "author": "Manatee T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "Great place for hand pulled noodles! It really hits the spot when cravings for home-cooking creeps up. I can't say that this place is mind blowing but it meets all my criteria for \"mom's comfort food.\" \n\nI had the fennel dumplings, pan-fried bread (生煎包), and beef noodle soup (牛腩麵). \n\nFennel dumplings: it was a great take for a toned down version of the traditional chive dumpling (韭菜水餃). The fennel flavor was subtle enough where I didn't feel like I was eating a savory licorice dumpling but strong enough to complement the chives. The dumplings however were a little overcooked. \n\nPan-fried bread: not the best take on this dish but it wasn't bad. I would say it's just about average. Contrary to the dumplings, this dish could have been pan fried a bit longer to achieve that delicious crispy bottom. The filling was pretty good and didn't give me an oily mouth-feel. \n\nBeef noodle soup: the specialty of this place are their hand-pulled noodles (手拉麵) as to which I must agree. Their noodles were perfectly cooked and still tasted great when I ate my leftovers the next day. This was the definition of homey comfort food. The flavors weren't mind-blowing and 5-star status but eating it reminded me of the flavors I grew up with. I would totally order this dish again when I'm missing home.", "author": "Victoria C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "The place to go for dumplings if you're around the Taraval area.  And for during cold weather, a good place for their spicy dishes.  The spicy beef noodle soup definitely warmed me up.  Prices are cheap, very affordable.\n\nThe food is good, and the people working here knows it.  Which is why they don't bother on service.  They don't try to welcome you here, unless you're a regular and can go on a full length conversation with them in Mandarin.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Quaint. Authentic. Delicious. \n\nTiny, packed little restaurant seats 20 people max. The atmosphere is homey and feels like the hustle and bustle of grandma's at Christmas. \n\nDumplings are superb. Flavor is perfect and sauce is delectable - only drawback is the slightly thick dough. \n\nThey're known for their hand drawn noodles - you must order one of them. The noodles are firm and not soggy, they are cooked perfectly and the sauce with almost any dish is rich and delicious. \n\nThe price is reasonable for fresh made pasta, albeit a little high.", "author": "Kyle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "This was my second visit to this restaurant, (once again due to Smile House Cafe having a long wait) and I don't think I will ever be returning. \n\nFood: 2/5\n-Dumplings: Lukewarm, thick skin, and salty. I'm normally a person who enjoys my food more flavorful and salty compared to it being bland. However, the meat was overwhelmingly salty and felt as if it was indulged in soy sauce. \n-Dry Cooked Chicken Wings: Disappointing. I guess it was my fault to blame that I imagined this dish to be similar to San Tung chicken wings. Well, at least having somewhat of a familiar taste. However, the chicken wings were just fried with little pieces of bell peppers and onions - basically just tasted like it was cooked with salt and pepper. \n\nI have tried their noodles before and I must say, those are the better dishes offered from this restaurant. \n\nService:  \nTwo chefs, two waiters, ten tables of customers, what do you expect? Upon my visit, three tables complained of the long wait for their dishes and the chaos of the order in which food was served. Two tables down, I hear a table of four complaining that they had been waiting for more than 30 minutes, yet no food had been served. Meanwhile, a table that had arrived later than them had their dishes delivered already. No apologies mentioned, nothing but shy aways. To my right, a table canceled their order for dumplings due to the long wait while the table to my left complained about a missing plate of dumplings. And here I was, finding myself wanting to find the whereabouts of my food as I watched a table that arrived later than mine have their food delivered.", "author": "Eva C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-15", "description": "As I was driving around looking for some authentic Chinese food in Taraval I saw this restaurant, I stand and check out the menu by the door and the only thing convince me is the pictures outside, it looks so good. I ask the waitress what is the best handmade noodle is here and she replied try E1 XianJong noodle and I saw someone order the pork dumplings too and the beef pancake. I said to the waitress I want to order those 3 dishes, she smile at me and said sure . I finish the XianJong lamb noodle and try to finish the dumplings and the pancake. I will come again and tell my friends about this place.", "author": "Hendrik N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "The best Da Pan Ji I have ever had in this area! Basically Da Pan Ji is stewed chicken with thick chewy noodles on the bottom. The chicken should be very flavorful and the noodles should absorb all the good flavors from the meat and the Chinese spices including Chinese peppercorns and star anise.\n\nAlso, get the dumplings too, the skins of the dumplings are thin, and the stuffing is fulfilling.\n\nService is not the most friendly service, but they do get the job done.\n\nTip: order Da Pan Ji ahead, it usually takes more than 20 minutes to come out.", "author": "Emma Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-11", "description": "Food was okay. I would only come here if I had a craving to come here.\n\nWe ordered the egg wrapped onion pancake, fish dumplings, shrimp/chive dumplings and the 3 seafood noodle soup.\n\nThe Egg Wrapped Onion Pancake was okay. For something so seemingly hefty, and yummy looking, it didn't pack as much of a flavor as I was hoping.\n\nThe dumplings were okay. They came in a heaping amount of a dozen per plate. I advise not to order the fish dumplings, but the shrimp and chive dumplings were okay. \n\nThe 3 Seafood Noodle Soup had tasty hand pulled noodles in my opinion, but everything else in the soup was mediocre. I would say there were 5-6 servings in the bowl.\n\nI came here one time before and if my memory recalls, the vegetable pot stickers were pretty good, so i'll have to come back to refresh my memory. But again, this place is okay; i'm not in love with any of the food, but it's not bad enough to scare me away. (Service is mediocre so don't expect princess service)", "author": "Jonathan C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-20", "description": "I can see why this place has only 3 stars..\n\nLocated right on Taraval, this place has some good competition and honestly, I don't think it's gonna win. \n\nParking is all on the streets and metered till 6pm unless you want to try parking in the residential area.\n\nThe inside of this place is tiny. Like, wow. One step inside and you can see majority of the place. The tables are close together and makes it a bit hard to maneuver out of if it's crowded. I will say this- their seats are comfortable. \n\nService is bad. I don't know if all the workers speak mandarin, but the one we got did and while my mom's good at speaking it, the girl was still a bit slow to understand. Which isn't a problem, but she just stood there looking at us at first and it was awkward. And through the rest of dinner, I noticed that not one single server actually attempted to smile or be nice. They were like robots writing down orders, cleaning tables, and bring food out. That's it. Think of those workers at Quickly's, but in a restaurant setting instead. \n\nFood is eh. Their pig ears are good in my opinion and so are their dumplings, but that beef wrap and green onion pancake were bad. The pancakes were too oily and the beef wrap lack sauce to improve the taste. All I could really remember from either dishes was the oil that was leftover on my fingers and mouth. \n\nOverall, probably not gonna come back. There are better dumpling places on Taraval, guys!", "author": "Venus L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "I've been to this restaurant once previously and the service was not terrible. When I went again on 8/20/17, my mom and I had a really bad experience. We (along with one other family) got seated around 11:12 a.m. (before they were officially open) and we placed our order relatively quickly. The other family proceeds to get their food before us. Another couple walks in about 10 min after us and orders. They also get their food before us. We asked the waiter why that was the case. He told us he didn't know because we should have gotten our food first. We continued to wait a few more minutes before we were told that the cook would start on our food next (this at 11:40 a.m.). We ended up walking out without our food. Would NOT recommend coming here--we definitely won't!", "author": "Victoria W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Got the beef pancake and also the \"Comb soup\" at the suggestion of our waitress. I'm pretty sure it was supposed to say combo, but I don't want to mislead anyone if its not.\n\nthe soup did not disappoint. It was slightly spicy and filled with all sorts of meats I don't care to identify. The spice was the perfect touch and made this soup especially good. I think I'd come back here just for some more of the soup.\n\nThe pancake was alright. Typical chinese pancake though slightly greasy because of the beef. The beef was also proportioned funny as 2 pieces were like all meat. One piece had 0 meat and the 4th piece was like 25% meat. It made for some awkward pancake bites.", "author": "Courtney Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-31", "description": "Had my favorite mutton with bread crumb noodle soup. I liked it, plenty of meat and hearty soup. Sat in the back next to register at a two person table.\n\nOwner decides to sit at my table, play with his phone, and have a casual chat with his coworkers. Hey man, I love your food but can you give a guy some space to enjoy it? I mean, do I need to be Xi Jinping to get some quiet time to enjoy my noodle?", "author": "Chris H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "A pretty ok restaurant.  Solid 3-stars. \n\nPros: \nBig portions.  We ordered the chicken/corn dumplings and the pork/chive dumplings, and there were 12 of each.  We came for the noodles, but the dumplings were the highlight. \nGood flavor.  I can't say anything bad about the taste of the food.  We ordered dumplings, black bean noodles, and the xinjiang noodles.  I was expecting the noodles to be like a soup dish, but they were actually thick pasta-like dishes.  Everything tasted good, and seemed well prepared.  I would recommend any of those dishes. \nThey also got all our order correct, I had asked for bell peppers to be left off the noodles and they made sure that none were added.\nThe tea with the meal was yummy too.\n\nCons:\nSlow.  Service definitely leaves a bit to be desired.  Don't expect the staff to be overly friendly, though this may be attributed to a language barrier.  \nKinda dirty.  The walls were seriously gross, but our plates/cutlery appeared to be clean. \nParking... It's San Francisco, what do you expect.", "author": "Jen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Fam and I wanted to go eat dumplings and noodles on Christmas morning, but our usual places were all closed.  Thank God we stumbled on this gem!!  They make their noodles and dumpling skins in house here, and boy do they make them well.  The wheat noodles are nice and chewy here - really, really pleasant to eat.  The dumpling skins are nice and chewy as well, and the filling is very nicely done - good seasoning AND the fat renders into broth super nicely in the lamb and sea cucumber dumplings.  The Xian noodles were good too, like rough-cut/rustic ho fun noodles.  Overall, I am a big fan. The place is small though, so there could be a wait.", "author": "Tracey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "This place was perfect for what I was craving. Picked it randomly because it was the only thing open at 3:45pm and first time in the area. \nI asked for a popular dish and they recommended the cold noodles. Well please with the Cold noodles and tea. The Noodles have a lot of flavor and are fresh real noodles. Good Garlick aftertaste! Check this place out!!", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "A hole in the wall restaurant but they serve authentic northern Chinese food.  I love the beef pan cake, and the dumplings. The noodle is freshly made on the spot and you can see him pulling the noodles.  The texture of the noodle is perfect.  You just have to get use to the hole in the wall environment.", "author": "Kit L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-25", "description": "Shandong Noodles has become one of our favorite neighborhood eating spots, it's a rather modest looking place on the outside, when one wonders in, it's not always clear of how your seats are will be assigned, but when the menu comes out and you start ordering, the food just delights beyond your expectations.\n\nWe rather like the pan fried dumplings, which delight with their steamy beef nuggets inside, and the cucumber salad adds a cool taste to the meal, but best of all, so far, are the Xian cold noodles with their peanut sauce. \n\nFrom how each dish has been pleasurable, I'm excited to go back and try some more of the menu", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "The xianjian noodles are amazing!! Let alone, i will give that a 5/5. The noodles taste fresh and are bouncy! There are two variations.. the cheap one and the expensive one which is over $20. Ive never had the expensive one but hopefully someday will. Knowing the cheaper one is just as amazing should be enough anyway! The orange spicy sauce is so amazing and hot!! It goes well with just about anything. I love the pan fried dumplings here too. I would skip on the steamed dumplings, there are other locations on taraval that specialize in that.", "author": "Tina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Hands down the best handmade dumplings and noodles I've had so far. These are even better than the ones I had in China", "author": "Ron A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-09", "description": "Terrible. One of our items was the wrong one, the noodle soup didn't come with small bowls, scissors, or even a spoon, and the dumplings come on sets of 12 instead of 20 like the menu says. Outright deception! Staff doesn't come around too much. Avoid like the plague.", "author": "David L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-24", "description": "Didn't come here for a while. I ordered the following:\n\n-Pig Ears (Good but the portion were smaller than before)\n-Beef Stew Noodle Soup (Just OK / No taste & only 3 small pieces of beef)\n\nI don't think I will come back anymore!\n\n*Service were just OK", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-22", "description": "If you like supporting small businesses, Shandong Deluxe is right up your alley.  Not only are they family owned/operated (I think the father and son work the kitchen while the mom and daughter work the tables), but their size certainly qualifies as \"small\"!  House of Pancakes up the street may be smaller, but seating here is just as tight and limited.  Just ask the people who had to slide in out of their seats so that the people at the neighboring table could get out...\n\nWith a menu that leans towards Northern Chinese cuisine, the vast majority of Shandong Deluxe's dishes revolve around dumplings and noodles.  However, they do offer a few staples from other Chinese cuisines (like Xiao Long Baos).  Still, my family and I were more interested in trying their specialties:\n\n-- SALT & PEPPER FRIED TOFU...$5.95\n(http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco#o7IfCb2v24QebqmazCE6wQ)\nThe portion was a pleasant surprise, and I liked the crisp batter, but the dish was underseasoned.  Not that I would want a ton of salt/MSG, but the tofu was really bland, which was only exacerbated by the fact that there were so many pieces.\n\n-- SHEN JIAN BAO - Pan Fried Pork Dumplings...$4.95\n(http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco#HrDs0ocIp3boMbZf4TKHVw)\nAlthough it's a Shanghainese dish, I had to try it.  The skin had a nice thickness and there was a good amount of filling, but the meat just wasn't that flavorful. It's still not bad overall, but it doesn't come close to my favorite down the street (Dumpling Kitchen).\n\n-- PORK DUMPLINGS WITH NAPA CABBAGE...$5.95\n(http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco#MGLI_kwAUQflWl9qYQifNg)\nSee above.  While the dumplings were just as plump, the filling also fell short.  I don't know if there was too much cabbage or lean meat, but the pork just wasn't that juicy.  Still, it's not like they were bad (I liked them better than the Shen Jian Baos).\n\n-- BEEF STEW NOODLE SOUP...$6.95\n(http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco#fQGzbeZXJohvGwgr5rjxGw)\nProbably the highlight of the night.  The beef was mostly tender and I thought the noodles terrific (the consistency was perfect).  Even though the broth could have been \"beefier\", I liked how it was slightly peppery.\n\nAlthough none of our dishes may have overwhelmed us, I can't say we had any complaints about the experience either.  The wait wasn't bad, service was nice, and prices were quite friendly.  There may be better restaurants in the area, but Shandong Deluxe deserves some praise for putting out decent food at great prices.  For that reason alone, I'd come back.\n\nCASH ONLY.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "bean curd shred was good\ndumplings were ok\nla pi was good", "author": "Diane W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "Finally came here for dinner since it opened even I live just two blocks away. The reason is because I've been a fan of House of Pancakes that is across the street, the line here is always hella long, and the fiancé had a bad experience here. Therefore, it wasn't really on my list to try. But we were hungry and there was no wait, so why not try!\n\nMaybe because my expectations were already lowered hearing my fiance's experience, but I was pleasantly surprised by their pork/Napa cabbage dumpling. Compared to the pork/Napa cabbage dumplings at HOP, I think I actually like these more. We also tried their spicy beef noodle, it was overall okay- noodles were good, but the soup, beef, veg was just okay. Also tried their bean curd since I'm just a fan of bean curd, and it was average. \n\nCash only. I have yet to eat something here that is impressive. And I would not wait an hr to eat here.", "author": "Iris H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "The noodles is very good, make fresh on site. but the broth and flavors needs improvement, no deep! Too plain!  just salt and pepper, don't know how to use seasoning.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "The place to go for dumplings in the Sunset. I came in late in the afternoon for lunch and the restaurant was still packed even though it wasn't lunch time. I got the Pork Dumplings and the Zhajiangmein aka Black Bean Noodles. The Pork Dumplings were freshly made and had a lot of meat. The Zhajiangmein had noodles that were handmade in their own kitchen, there was also the right amount of sauce for the portion of noodles. They should add more chicken though for the noodles though. The service here is fair, there was only one waiter taking orders and serving the restaurant. Would return later to try the other types of dumplings they have to offer.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "Food here is pretty good, especially their noodle dishes. I usually get their lamb noodle soup, just basic lamb chunks with hand pulled noodles, a few mushrooms, served in clear broth. It's nothing too fancy but somehow it's hits the spot. Dumplings are alright, not amazing or anything. They have some interesting dumplings like the sea cucumber dumpling. Curious but nah. They have this dish called Xinjiang Style Chicken with Noodle that is worth trying. It's a spicy dish, so avoid if you're not a chili fan. There's pieces of potato, chili, chicken (with bones) served over a bed of thick, measuring tape looking noodle. Imagine chow fun type fo noodle but extra chewy and thick, that's the noodle's texture. This dish takes time to prepare, some people call in, or just order it first thing when you sit down. It's definitely a family size dish, you can probably split it with 4-6 people.\n\nOther than the food, this place has the best service ever! No one to greet you, no one to look over at your table when you're like raising your hand for their attention, slow to take your orders, doesn't bus tables quick enough even if there's a long line of people waiting to be seated, has a credit card sticker at the door but won't let you use credit card to pay because they are closing in an hour. Everything you can name for bad service, they've done it. Typical Chinese place, but worse? Probably.  If you can brush off all of those stuff, then yes, definitely give it a go.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I can't believe it's only three stars on Yelp. The only explanation is probably you can't rely on Yelp review to tell you the true story of authentic ethnic food. \n\nDelicious. Delicious. Delicious.", "author": "Shuang J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "Having been born and bred in Beijing, I'm a slight snob when it comes to Northern Chinese cuisine. Shandong Deluxe has the core makings of a good Northern Chinese restaurant, but I think the execution fell a little short of expectation. \n\nThe restaurant itself is a small, hole-in-the-wall place, with crowded tables and a small corridor in the back that has both tables and kitchen staff making the food. Service is friendly and efficient enough, although being able to speak Chinese does make things easier.\n\nCold flat noodles with sliced cucumber and sesame sauce:\n(http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco?select=MMi8D5prN9FI1lLQyJMstQ#CLgjGww5rHW9BEN4g6zhkg)\nThe sesame sauce on this dish was amaaaazing, definitely reminiscent of the kind I used to have in the street vendor noodle dishes back in China. The flat noodles were initially of good texture, and you could tell that they were hand-made, but unfortunately they were a little over-boiled, which caused them to be a bit waterlogged and softer than optimal. I liked the contrast of the crunchy cucumber and soft noodles, but there was some watery sauce on the bottom that was a little unappetizing towards the end when the last bits of noodle were swimming around in there. Good flavor, but I think the execution could use a bit of work.\n\nDan Dan Mian with hand-pulled noodles:\n(http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco?select=MMi8D5prN9FI1lLQyJMstQ#Lr8rLySle8GICq5agDaxvA)\nI haven't had Dan Dan Mian at many places since I don't usually eat spicy foods, but the broth on this had good flavor. It was pretty salty though, and the spiciness was a little reminiscent of the sauce that was in the condiment section of each table. I tried some of the actual hand-pulled noodles though, and those were really good. You can really tell that they were hand-pulled, as the elasticity was on point. \n\nPork and chive dumplings:\n(http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco?select=MMi8D5prN9FI1lLQyJMstQ#nWJIZ6YVJ2AUsFAERMczGw)\nThese dumplings were a little disappointing. They had the \"hand squeezed\" look of authentic Northern dumplings, but they were way overboiled and super waterlogged. I was not a fan of the execution on these at all, and they would have been really good if they had not been so overboiled. The pork and chive mixture inside was tasty, but a little bit salty, and there was that juiciness that was reminiscent of soup buns. They sell frozen dumplings as well, so I might opt to just buy the frozen version next time and go home to boil them myself.\n\nI might drop by again if I'm in the area to try some of their other noodles (beef tendon sounded good!), but I'm a little wary of the execution of the cook here. Also, I'm not sure if they over-salt their dishes or use MSG, as my friend and I both had slight headaches after eating here.", "author": "Maggie X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "This is a great restaurant on the busy Taraval street. Although the service isn't always as quick, the food is always consistent. In fact, the hand cranked noodles and frozen dumplings are a treat. The price for the food is really reasonable.", "author": "Justin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "Go there for the food, not for the service; especially during peak hours. Love the dumplings- heavy filling in chives, great favor, but not proportional to the protein. Noodles are fantastic; handed made and great texture. The soup, not many variety. There are only 2 kinds: spicy or clear broth, but worth trying. Pot stickers, not the best, but huge serving size. Overall , love their food 4/5. Service: 1/5", "author": "Simon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "A hot bowl of spicy pork and seafood noodle soup.   Hand pulled noodle.   So perfect.  I'm now warm and toasty.  Attacked my bowl so fast I didn't even think to get a picture.    I've been to their sister restaurant on Geary and second.   I usually love their cold xian noodle appetizer but needed something warmer today.\n\nTheir dumplings are good esp if you like lamb.  Their potstickers are good and we always get the hot sweet soy milk.  \n\nI really like their noodle soup.  Noodles are perfectly cooked with a little chew.  \n\nPlus nice waiter didn't mind me charting until my next appointment.", "author": "Regi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-19", "description": "Shandong is a frequent of mine for their some of their cheap and simple dishes.\n\nMy favorites and the must trys of Shandong are:\n*Bean curd Noodle Salad - My reason for coming here.  The dish is served cold and contains bean curd noodles tossed with salt and I think sesame oil.\n*Dumplings - There are about 10-15 types of dumplings on the menu.  My favorite is the pork, shrimp, and chive dumplings.  The dumplings are boiled and comes in orders of 12.\n*Lamb skewers - Delicious!  The lamb is sprinkled with many spices and the lamb didn't have a gamey taste.\n*Hot & Sour Soup - They don't skimp on the contents.  It contains plenty of pieces of tofu, bamboo shoots, chopped woodear mushrooms, and carrot slivers.  Do beware, it's really spicy.  Most of the time I tap out at a bowl and a half.\n\nI'm not a fan of their Shanghai soup dumplings/Xiao Long Bao (6 pieces) because most of the time they're a fail.  The skin is too thick but most of them seem to crack before they hit your table and the soup has already leaked out.  Aside from that, the pork filling is delicious.\n\nWHAT TO KNOW:\n*Cash only. Banks located nearby\n*Make use of the hot sauce on the table.  It has a good kick to it.\n*Noodles are made in house\n*If you go during peak times, expect a wait\n*Service is a hit or miss.  Sometimes it's attentive, most of the time you're stuck waving someone down\n*Open daily\n*Metered street parking which can often be difficult to find", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "I prefer cup of noodles over the noodles here. \nI only ordered the noodles so I don't how the other dishes are. Other people on our table ordered the chow mein they said, it sucks and did't finish it. The waiter and waitress are sometimes deaf, because you have to yell for service.", "author": "S C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "Food is less than expected!  But service is absolutely terrible!\n\nI had lunch there on a weekday.  I ordered two noodle dishes and had finished eating around 1:30 pm.  Requested the check, paid, and while waiting for the change back, one of us went to use the rest room.  As he is still at the bathroom, a group of 11 people came in and was looking for a table; the owner/waiter (his picture was on the wall, so I assume he is one of the owners) quickly clean the table when I was still sitting sipping tea waiting for him.  The owner/waiter picked up the change and try to pocket them but felt he shouldn't at the same time.  He struggled back and fourth 3 times taking the tips, then put the change back onto the table.  In the mean time, several of the people from the group of 11 begins to sit down at our table impolitely!  So the owner/waiter said, \"please take the change back, no need to give us tips!\"  From my perspective, this is what restaurants should never do, chase your customer out!  I really think what he meant in action is, \"never come back and tell everyone not to come either!\"", "author": "Benedict L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-07", "description": "I wish I could give it a non-star. This place is suck. I was born and grew up in Shandong, China, and I know how Shandong food tastes and looks. I should not expect that Shandong food here tastes the same as Shandong food back in China, but food here is no where close to Shandong food. There are not many dishes are Shandong food on menu. \n\n1. Pork Dumplings\nThe skin is so thick and the filling is so small. Shandong Pork Dumplings should have thin skin and big filling. The Napa Cabbage is not fresh because it is squashy. You name your dish pork dumpling. Are you kidding me?\n\n2. Black Bean W Pork Noddle (Zha Jiang Mian)\n Zha Jiang Mian is a disappointment. It is freaking salty, and I can't find much pork. In addition, it has big pieces of Chinese Onion pieces. I like Chinese Onion, but why the heck it comes in big pieces? It should be in small pieces so that the sauce can have much more onion flavor.  Further more, it should come with small and thin cucumber slices. Where is it?\n\n3. Five Spice Fish (Xun Yu)\nAre you kidding me? The fish pieces are very hard. It means that it is not fresh at all. It was probably cooked and frozen a few days ago. Five Spice Fish tastes good only if you eat it right after you cook it. This is not authentic at all.\n\n4. Xinjiang Doddle W Lamb\nThis is not a Shandong dish. I don't know how it should taste. However, I can't find much lamb but just lots of noodle. \n\nI don't want to comment anymore. Nothing is authentic. I came with excitement but left with huge disappointment. I will NEVER come back again, and I do NOT recommend it to anybody. It is not expensive, but it is not worth the money. \n\nIf you want to have some authentic Shandong food. I recommend you Taste of Shandong (Its Black Bean W Pork Noddle comes with small and thin cucumber slices and small Chinese Onion pieces. Absolutely authentic!!!) on Judah St and 9th Ave. It is proven Shangdong taste and it is not expensive, either.", "author": "Yukai K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "This place serves authentic chinese food for a great price. Their portions are rather big so plan to go with a big group. Some dishes i would recommend would be to order the hand tossed noodles(8-9$) or the spicy chicken pot (28$).", "author": "Ricky C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-20", "description": "Great noodles, but you can skip the buns and onion pancake. Feels dirty and some food came surprisingly slow... but if you like the noodles at terracotta warrior, these are almost as good!\n\nThe black bean noodles were great! While I've tasted better black bean sauce, the hand-pulled noodles were chewy and had amazing texture. For less than $10, it was a pretty good portion.\n\nThe lamb noodles were similarly great. The lamb was soft and flavorful while the noodles were perfect. The soup was a clear broth so the lamb flavor was really clear and strong. Also under $10, good portion. \n\nThe onion pancake (~$6) came really late, after everything else. It lacked flavor and was flimsy, not crispy or crunchy at all. \n\nThe pork dumpling with chives (~$6) was not bad and definitely was flavorful. The meat was also nice and juicy, but the noodles were just better.\n\nI highly recommend the noodles!! If you can overlook the decor and inconsistent service, this is a solid place to grab authentic hand-pulled noodles. You can skip everything else on the menu though.", "author": "Grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "Despite the mixed reviews, this place is still pretty popular and you're definitely getting what you're paying for; yummy authentic food + less than average service. But I'm still a fan!\n\nTip: Cash only!! \n\nPros:\n-authentic, fresh, homemade, flavorful dumpling filling with THICK hand-made dumpling skin. My family does not make dumplings on our own from scratch so I've learned over the years to appreciate the quality of thick, chewy handmade dumpling skins!!! This place is definitely where it's at.\n-not too salty, but just right. In my opinion, Shandong has the proportions right for  taste+filling vs. thickness of dumpling skin. YUM!!\n-fresh. Everything you order is hot right off the stove. Gotta love hot foods :) \n-fast. Ok let me clarify - while the service isn't the best (don't expect it to be, it's a hole in the wall restaurant), once you do manage to get your order in, it's in. And they're cooking it! Our 3 orders came out quickly together after we ordered.\n-cheap! We ordered 3 dishes for 2 people (ate til we were full) and paid $24 total including tax and tip! \n-the orange homemade hot sauce. It's hot and it's good. Mix it with the soy sauce. Enough said.\n-conveniently located on Taraval near the muni line. Can take the L-line there and walk over within 3 mins. \n\nCons:\n-if you read the other low star reviews, it's mostly attributed to service. But like I said, don't expect to be treated like you're royalty. They're busy cooking everything from scratch! Be supportive and take initiative to help yourself :P\n-even if there is a wait list, wait inside or check back often to see if there is movement. If the restaurant isn't packed, they're not going to look at the wait list. My friend and I were sitting on the chairs outside and were wondering what was taking so long. We went inside and realized no one was checking the wait list and there were a few empty tables. They gave us a table and hot tea right away after that.\n-...but no menu. They have a box of blue paper menus near the entrance. Or table was close enough for me to notice that so I went up and got one.\n-we had to call our waiter over to order. Seems like this place is short staffed. (However after we got our order in the food came out pretty fast afterwards!)\n-had to ask for refills on the hot tea\n\nLe Menu:\n-chicken and corn dumplings. My friend visits this place often and highly recommended this one. Especially if you love corn!\n-pork and leek dumplings. Also a good one\n-leek pancake. YOU MUST GET THIS. Super hot and crisp, delicious, and satisfying.\n\nWe were both super full and I even got to take 6 or 7 dumplings home to bring for lunch the next day = win :) (and btw, they were still amazing the next day). I shall be back again soon!", "author": "Grace J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "This little restaurant is great! It offers authentic Chinese food from Northern China. Their hand made noodles are the best I ever had in the US. The handmade noodles made here are exactly like the noodles I had in Urumchi, Xinjiang when I traveled there. Stir fried lamb with noodles is my most favorite dishes.\n\nThey also provide dumplings, steam buns, Chinese pancakes etc. All those are handmade.", "author": "Cool G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "The food is good but the service and wait time is bad. That's probably why 3 star on yelp review.\n\nEverything here is pretty good. Love their handmade noodles and dumplings here. Give this place a shot before skipping them.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "I can't believe this place only has 3 stars!! Here's my story. My friend brought me here once and I ended up coming back 2 more times after that over the span of 2 weeks. I NEVER DO THAT!! Plus, I was on spring break from the east coast, so these meal choices were precious. 3 times in 3 weeks. That alone should tell you how good this place is. \n\nI've been incredibly happy with almost everything I've gotten here. My favorites include:\n- BEEF ROLLS: the best I've ever had. Great ratio of fresh veggies!\n- DUMPLINGS: the skin is better at San Tung, but the filling is better here!! The skin is too thick, but its okay because the filling is SOO juicy and flavorful. \n- CHIVE PANCAKES: delicious chives stuffed in a wonderfully crisp pancake. \n- FUNGUS, EGG, AND FLOWER NOODLE: the noodles here a great! And the broth was not too salty like it usually is at other Chinese restaurants. \n- BLACK BEAN NOODLES/ja jang mien: because hand pulled noodles!!\n\nThe only dish I wasn't a huge fan of was the Dan Dan Noodles...which tasted like a mix of peanut butter and chili to me. This might just be a personal preference though. \n\nI've noticed most of the negative reviews are mainly about the service. But damn, when prices are that cheap and the food is that authentic, I've learned to expect that! The $ you save is compensated in the lack of service. That's just how it works at cheap Chinese restaurants. \n\nThe main con for me is the rate that they bring out your dishes. Every time I've gone, they've been quick to bring out most of your dishes, but there has ALWAYS been one dish that arrives after you finish eating everything else! \n\nPS make a trip to the bathroom, where you can see workers making the dumplings out in the open!", "author": "Carolyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-12", "description": "I hate to write a 4 star review for my shan dong people, but the service here was lacking.  I came at 11am on a weekday, the place wasn't packed, but for whatever reason it took them 35 minutes for a bowl of noodles and dumplings... was highly disappointed (they also messed up my noodle order and brought me another tables noodles).  However, the food was all on point, tasted like home cooking that I grew up with.\n\nI got the noodles with mushrooms - taste was pretty authentic, definitely like my moms cooking! The noodle broth had a very deep and rich flavor, with hints of cinnamon, cloves, and star anise - just how they do it in Shan Dong.  This is northern cuisine, which is notorious for having heavy flavored foods and really big people! \n\nDumplings were well worth it, one serving is about 12 dumplings, and they are SUPER legit and cheap.  You can easily tell that the skins were made in house.  Honestly I don't know why chinese food has to be so cheap, when it's just as laborious as making fresh pasta.", "author": "Timothy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-21", "description": "This is a pretty cozy neighborhood place. You can tell it's super Chinese because decor is an afterthought, and they didn't bother to remove the Japanese paintings from the previous restaurant that was here. There's nothing wrong with that. I just think it's funny. \n\nAnyway, I wasn't able to try the dumplings, but we had the Lamb Skewers, Spicy Beef Noodle Soup, and Lamb Noodle Soup.\n\nThe Lamb Skewers had a good amount of meat on them, but they were pretty tough and kind of bland. Although it looked like they were seasoned thoroughly, they weren't that flavorful. I thought they didn't have enough cumin to bring out the lamb's flavor. A little salt could've helped too.\n\nIn both noodle soups, the noodles were the highlight and had a delightful toothsome chewiness. The soups could have been better though. The Spicy Beef Soup didn't have a strong foundation. It was spicy and a little sour, but there was no beefiness in the broth. It kind of just tasted like hot sauce and water. The Lamb Noodle Soup was a little bit better, but the broth still wasn't very robust. There was a shiitake earthiness and slight gamey flavor in the broth, but it was still leaning heavily on the bland side. In general, it doesn't seem like their broths are very well developed. Like San Tung on Irving, maybe the thick saucy type of noodles are better. I'll have to try those next time.", "author": "Nei N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "Family own and run?  check.\nSmall hole-in-wall type place?  check.\nAuthentic cuisine?  check.... well, at least, judging by the mostly Mandarin speaking dining customers it seems so.\nQuick service?  check.\nSatisfied customers?  check.\n\nBeing on Taraval Monday afternoon, we cruised by several restaurants between 19th and 21st Avenue, examining menus as we walked.  We chose this restaurant since it had a) the most interesting menu and b) the most dining customers.  The restaurant name posted on its front signage prominently describes their signature specialty:  hand pulled noodles (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q) (okay, they describe it as \"hand cranked\"?).  Here's what we ordered:\n\nAppetizers (shared)\n1) Handwritten appetizer #A - My English description is Yuba strips and marinated vegetables with peanuts (http://www.yelp.com/user_local_photos?select=7T256d1661SEA9KHsEFO-w&userid=saJuyv784apZzH--psHZ3Q) - Reminds me of Hodoy Soy's Yuba strips, but a bit more watery from the cucumber.\n\n2) Bean Curd Noodle Salad - Tasty but pretty one dimensional.\n\n3) Shandong Style Marinated Chicken (http://www.yelp.com/user_local_photos?select=GXIwks6wo5RA0RFazqDYPA&userid=saJuyv784apZzH--psHZ3Q) - Reminds me of drunken chicken without the alcohol.  The timing on the marinating is good as the flavor and texture (soft and not dry) were spot on.\n\nEntree\n4) Beef Stew Noodle (http://www.yelp.com/user_local_photos?select=XG9J6HxZ1jhAeO6za33R7w&userid=saJuyv784apZzH--psHZ3Q) - Hand pulled noodles (unmistakable with the varying width of the noodle strands) are not my favorite as they tend to be more doughy than ramen al dente crunchy.  Soup was okay with five-spice ingredients, mainly star anise and peppercorns (careful when biting those black balls on the bottom).\n\nVegetables (shared)\n5) Sautee (sp) Bok Choy (Ching Gong Chai) -  The English wording doesn't quite match the veggies served here.  Need to refer to Ken K. for a more accurate translation, but they cooked this well with diced garlic.\n\nWhile walking to the restroom, I noticed a lady kneading and folding chive turnovers (Jiu chai he zhi).  The older gentleman in the posted photo (http://www.yelp.com/biz_photos/shandong-deluxe-san-francisco?select=3z3b7zYuf185YImVHchAtA#3z3b7zYuf185YImVHchAtA) walked the dining room, serving food and checking on dining customers.  At the front window, it clearly displays the man pulling noodles (noodle master) and the lady doing what she was doing (dumpling duchess).  Watching other diners order a variety of food, I will be back to try them and discover what their signature dishes are.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "I checked out this place with a friend who is local to the area. With the high concentration of Chinese restaurants in the area, it was nice to be able to pick one out that came highly recommended.\n\nWe came here for dinner on a Monday night at 6:30pm and got a table for 3 right away. Seating is somewhat limited and the restaurant got busier around 7:30pm with a short wait so come early. \n\nWe ordered 3 dishes for 3 people which wound up being the perfect amount of food. The dishes were as follows:\n1. Pork Dumpling with Chives - The dumpling skin had a good texture. It wasn't too thick and had a good chew to it. The pork was well seasoned and had a great consistency. Sometimes I find that dumpling places can be a little sloppy with the meat and there's often unsavory bits that are inedible but there was none of that today. The chives are a classic complement are were a nice flavor bump. Definitely above average. \n2. Onion Pancake - Great item. The plate came with 8 good sized pieces. They were crispy, a nice thickness and extremely flavorful. The only thing I would say is that they were a bit oily.\n3. Xinjian Noodle - This was one of their signature dishes and it fell a little flat for me. I'm not entirely sure what this dish is made up of traditionally but we opted for the beef version. Aside from noodles and beef, there were veggies including red and green peppers, white button mushrooms and onions. The noodles themselves were pretty good. I am told they are hand pulled and made in the restaurant. The overall flavor of the dish was okay. Nothing too crazy but good. The veggies were kinda meh and there was a lot of water seepage from it all. \n\nAll in all this place is decent. I don't think I'd run back the exact same dishes but I'd want to try what else the restaurant has to offer.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "I don't know why this place has such a low rating. TBH, this place is a great place to go for noodles, esp \"LA MEIN\".\n\nI used to get dumplings and noodles (dan dan mein) at \"dumpling kitchen\". Since they don't open on Wednesday, bf and I passed by this place at 11:30, right after they opened, and decided to give it a try. The first time here, we are IN LOVED with their noodles.\n\nFirst-time visit, I got the spicy pork noodle (less spicy cuz idk how spicy it would be for \"shandong people\"). The bowl of noodles came out pretty fast. The bowl of soup is orange/red-ish? OH! It must be hot sauce i guess? I tried the soup with a spoon hoping its not THAT spicy, but guess what, it tastes so good, a little hint of spicy taste last on my tongue, its not like super duper spicy. (Cuz i got some crazy hot sauce from other \"shandong\" place before). The texture of the noodles: chewy and elastic, pretty awesome noodles here. I guess they make it themselves? cuz I haven't tried any of the machine-made-noodles has this kind of texture. It's really really good. WOULD RECOMMEND TO FRIENDS.\n\nWe also got the pork dumpling with spinach. It has a huge chopped spinach with pork inside the dumpling. It tastes nothing really special, just spinach with pork with the outside part (flours/men fun? LOL) but we like it too. FYI: dine in or take out -12 pieces. Take out with \"raw/uncook dumpling\" - 20 pieces. Don't let the menu fool you LOL.\n\nWe also got the beef fried rice noodle (beef chow ho fun). Not much beef, but a big portion of rice noodles. The rice noodles are kinda dry and oil. Sadly, bf doesn't like it, but I took all the beef LMAO. AND he took half of my spicy pork noodle!! (THIS IS HOW AMAZING THEIR NOODLES \"LA MEIN\" IS)\n\nSecond visit: We got the lamb noodle, and yes the soup and noodles came out just like what we've expected it. Im craving their noodles from now on LOL. \n\nAll in all, this is a very good noodle place to try if you're craving noodles like me. Will definietly come back to try the other stuff.\n\nPS: they accept cards and take out. no wifi. good for groups of 3-5 people.", "author": "Kalum Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-13", "description": "This place is relatively new and its growing pains are pretty evident. We were the first to be seated with the wave of hungry dinner patrons, but it was obvious that the restaurant was completely overwhelmed. Waiters would ask already seated guests to swap tables in order to accommodate other tables.  Food came out slowly and was either lukewarm or bland. \n\nCase in point, my combo seafood noodle. I love hand pulled noodles, so +1 for that. The noodles themselves were thick, not too chewy, and super long. The dish featured little pieces of squid, conch, and shrimp. It was a nice mix, however, they were all incredibly briny in taste. It was as if they were taken fresh out of the ocean and thrown straight in. Don't get me wrong, I like my seafood fresh, but not that fresh. Also, the broth was heavily flavored with white pepper salt.\n\nAs for the lamb noodle, it also featured handpulled noodles along with a bed of vegetables (celery, carrots, tomatoes) and little bits of lamb. The lamb was awesomely tender, but the pieces came few and far between bites. I guess I shouldn't expect so much from a dish under $7...but I do. Or at least my taste buds do.\n\nWe also ordered pork/shrimp/chives dumplings. They came out looking like they had been sitting nearly 10 minutes.\n\nAll in all, I have no plans to come back soon.\n\nBy the way, they didn't have a doorknob on their unisex bathroom...literally a hole in the door. So pee fast.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "I started to write a tip, but with the length of it, I decided to write a review. A few important things to point out: \n\n(1) They only take CARDS for purchases OVER $25. \n\n(2) The HOT SAUCE is delicious and very SPICY; more like pureed peppers (not the dry chili peppers in oil). \n\n(3) BEEF PANCAKE is not synonymous to the Beef Roll. Other restaurants call it the beef pancake (e.g. across the street), something that looks like a burrito. But my fault for not realizing that's not the name here. The beef pancake is tasty though, it's a thick green onion pancake cut into fours and deep fried. \n \n(4) The hand pulled laimein NOODLES are good quality, but I did not expect the spicy beef noodle soup to taste the way it did. It tasted more like a tom yum soup, SPICY and SOUR. I would not be ordering that dish again since it's not my palate preference... Would prefer the noodles in a different broth. I only came in here as I am on a quest to look for laimein closest to the kind I've had in China. \n\n(5) PAN FRIED DUMPKINGS are also not what I expected. The consistency is more like a pan fried BAO (BUN). A bit disappointing as there are 6 to one order. \n\nI may only visit again to try their noodles outside the soup. \n\n(6) The SERVICE is absent minded as she will frequently forget to get napkins, glasses of water, bowls as she goes back and forth. Service isn't good, but I gave her a break as she was the only one working the floor that night.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-08", "description": "Went here because a friend told me they have really good Xinjiang style Chicken and decent home-made dumplings. \n\nWaited about 15min before being seated at a Sunday at 7pm, we(2 ppl) ordered a serving of Xi'hu lamp dumpling, spicy beef tripe and the Xinjiang style Chicken which turned out to be plenty for us, we boxed the remaining chicken and dumplings in the end. \n\nBeef tripe and lamp dumplings were served way faster than the chicken, they are decent. And we waited for 15min for the chicken, but oh boy, it was worth it. the texture was very tender, the flavor is well balanced. I loved it and given my background of Xi'an, I think it is very authenticate.\n\nIn the end, we ordered four diff types of dumplings 20*4 togo.", "author": "Cheng C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "The dumplings and noodles are very authentic! The price is very decent! You got lots of portion! But the service was not so good!", "author": "Li L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-09", "description": "I would give this place minus 5 stars if I could. Service was very rude, tardy, and inefficient. Food sucks. Combination of bad food and bad service.", "author": "Joelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-05", "description": "YUM! This place is SO cheap for such GREAT food! The portions are really big too! We got 12 great pork and chive dumplings for just $6. Definitely get the noodle soups with hand pulled and freshly made noodles, and I recommend any dumpling dish. Sure it's loud, and service isn't too friendly but it makes it feel just like China. I got the Chicken Noodle with tasty chicken and deliciously chewy noodles. The soup was actually kind of tasty as well, because it was not too salty and had a lot of chicken flavor. The only thing I didn't like about this experience is that I would keep slipping down the booth seating, but that all got fixed when I moved the table closer to myself!", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-20", "description": "We ordered celery dumpling and beef pancake then added dumpling (pork & shrimp) with noodle after words.\n\nThe dumpling tasted fresh and a little on the salty side. Beef pancake was a little in the greasy side. Our biggest mistake was to add the dumpling with noodle soup! It took them long time to make it. I had to rush them several times. Honestly, the quickest meal to cook is noodle and dumpling. And I not sure why it took them so long to make the order. So the excuse that I was given was that add on order will need to wait after the rest of the other orders are made! Most of the restaurant will prepare the add on first so they can let the customers finish and go. \n\nAs I'm typing this review, I'm still waiting patiently for my order!", "author": "Jaylene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "I am from Shandong, China. They made the exactly same taste as the best food in my hometown. I gona visit again defenitely \n\nmust try their dumplin", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "These guys knocked it out of the park.\n\nWok Mongolian Beef was literally the best beef I've ever had. I'm used to that bad east coast chinese food where ordering beef is guaranteed to be rubbery. This was perfectly tender and had absolutely amazing flavor. Huge portion, tons of great veggies.\n\nAlso had pork scallion dumplings. They were good. Not next level, but good. Again, the portion was huge. I expected 4 to 6 dumplings like the average dim sum place. Nah, this was like a dozen. It was WORK getting that plate empty with two of us.\n\nService was slow but I wasn't in a hurry, so it's all good.\n\nReally though. Get the mongolian beef. Super nice prices too. Almost everything is under 8 bucks, and with the portions as big as they are? Gotta do it.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-13", "description": "This place is good, noodles, dumplings, nice staff. Don't try the order online option it doesn't work, call in. \n\nOverall very decent option for dinner.", "author": "Jon K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-08", "description": "It's poor rating isn't out of nowhere. I went there and ordered those \"popular\" dishes. None of it is good and I promise I am not a picky person on food. I went there because it offers Xinjiang style chicken, its one of my fav dish. And it turned out to be totally a disappointment. The dish looks fully cooked and got the right sautéd color, yet it tasted totally plain. I couldn't tell there's any different for the flavor of the chicken and the potato, except the texture :( The size of the food is good though, but the chief wasted the gradients. If you're looking for real Xinjiang style chicken, definitely PASS on this one. The taste is not even close!", "author": "Meimei M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "The price here is pretty attractive. \nGot Marinated pork in baked bun(rou jia mo)and \npork&cabbage dumplings. They didn't taste very good (I am not saying that they were bad;however,I mean I had better baked buns and dumplings in other restaurants.\nThe service is good and I will come back for some noodles next time:)", "author": "Rila C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Since it's on Taraval, parking is never too horrible. Lately, they've been starting to get popular (and rightfully so, their food is good!). I usually come here when I want Northern Chinese food fix (dumpling or noodles) and don't really feel like driving/waiting for Kingdom of Dumpling.\n\nThe venue fits about .. 30-40 people? It's not a first-date type place for sure, but I don't come to expect that from Chinese restaurants anyway.\n\nPrices are on-par with Kingdom of Dumpling and in terms of dumplings.. they are very comparable, so YES, they are really good. The skin isn't too doughy or thick and they're juicy. I've also gotten the beef noodles a couple of times and the beef is super tender and flavorful and the noodles have a nice bite to them and isn't too thick or doughy (hand-pulled, yee!)", "author": "Emily C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "The people working there only speak mandarin so it is somewhat hard to communicate. My friends and I figured out whatever we wanted on the menu, we point. \n\nMy friends and I came strolling in around 9pm on a Friday night. The restaurant apparently closes at 9:30 and we had no idea. One of the waitresses were trying to tell us that they were closing soon & if we wanted to order, we should order now. All of my friends and I except one couldn't understand what she was saying. Luckily, one person out of our group was the translator.\n\nThe food was pretty mediocre for Chinese. The dumplings were nothing special. The noodles here are apparently hand-pulled. The portions were huge depending on what you ordered. So definitely a bang for your buck.", "author": "Kathleen U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "I've experienced bad service many times, but this is a whole new level.. Such a shame since my gf and I really like Chinese food. \n\nWhen we arrived, it was really booked so we thought, \"hey this may be good\". As soon as we were seated deep in the hallway towards the restroom, I kinda had a bad feeling but still stayed positive on ordering the food. \n\nWe ordered the following:\n\n-Beef Pancake Rolls - Pretty good but I've had better.\n\n-Leek Pancake - Meh, I wouldn't recommend it. Should have gotten something better.\n\n-Shrimp and Chive Dumplings - The first two bites were not bad, but it gets tiring and I lost my appetite when I reached this dish (you will know why in the next paragraph) \n\n-Zha Jiang Mian - It's good but again, I lost my appetite later on and couldn't finish it, which is rare for me.\n\nThe main reason why I was really really really annoyed by this place is because there's a stupid metal circuit box right next to my face right on the wall at our table. Every few minutes, a different restaurant worker will come to our table to open the circuit box and hit switches. Every time they open the box, it's right in front of my face and my gf saw the insides of the box, which is super dusty. I don't appreciate them hovering the circuit box door over our food 20 times (yes I counted), it really made me lose my appetite. One of the workers, middle age man just slapped my shoulder and told me to move so he can open the circuit box. \n\nMy feedback is, either they remove that table right next to the circuit box or they should pay for a more efficient way of using energy. This is not how customers should be treated, they really have to fix their attitudes, especially when it's something they are doing wrong. The food could have been good but I really lost my appetite with the constant interruptions at our table with that stupid circuit box they keep opening and closing. \n\nIn conclusion, I will never ever come back, nor would I recommend this place to anyone. If you want real good Chinese food on Taravel, I highly recommend House of Pancake or Dumpling Kitchen. Or even freaking drive down to China North Dumpling on Noreiga for better Shandong food. It's really a shame since I wanted to like this place..", "author": "Victor Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Uhhh. Who ever gave this anything but 5 is crazy. \n\nGet the Hui Lamb Noodle Soup. Best noodle soup in my life.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-07", "description": "I brought a bunch of visitors here after touring Treasure Island. ...\n\nWe ordered all kinds of stuff...\n\nBeef pancake...it was ok\n\nXiao long bao....don't bother...skip it\n\nFried tofu...good\n\nLamb with all kinds of noodles....not for me but most liked it....\n\n19.99 chicken potatoes with thick noodles....we requested a tad spicy...that was very good.....enough for 3-4 easily......this dish was the best.....well worth a try", "author": "Leslie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "We love this pale so much that travel regularly from Berkeley to eat here. Our picture is up on the wall because we probably ate out weight in soup dumplings here during the years. Everything is delicious. Our favorites are the soup dumplings ( xia long bao), the lamb dumplings, the pork shrimp and chive dumplings, beef pancake, fungus and cucumber salad, bean noodles, peanut noodles. So so tasty. We always take home frozen dumplings with us :)", "author": "Bella H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-20", "description": "Decent food but beware of inflated (and arbitrary) pricing on to-go orders. The past two times I called in an order they tried to charge me more than the prices listed on the menu.", "author": "Collin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-16", "description": "To my surprise,  I found out that the wontons and dumplings are frozen.  I watched our waitress pull our order out from the two freezers they have.  Anyone with a good palete will tell you frozen food taste different and our food did.  If I wanted frozen, I would have made it at home.  First this tells me they don't sell enough to keep it fresh and secondly, they don't care its frozen.  Bags and bags of wonton and dumplings are stored in the freezer.  Don't waste your time and money here because its not fresh.\n\nI gave it two stars instead of one because of the clear soup...it really was a one star because its frozen food.  The soup was a little plain and hopefully not full of MSG....a little salt and a few more pork bones would greatly help spark up the soup.\n\nMillion dollar question....will I go back.  NOPE...NOT FOR FROZEN FOOD!!!!!!!!!", "author": "MickYee M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "This place is the best dumpling place in town, PERIOD!!!! We got it recommended by a Chinese friend and it quickly became ours, and our friends and family's favorite! The Xiao long bao (Shanghai soup dumplings), the pork- shrimp- chive dumplings and the lamb dumplings are my favorites along with the cold peanut noodles(E1), cucumber salad with fungus and dry sauteed green beans with chilis. \nThe chicken feet dish is awesome too but its big feeds two or more! All the noodles are hand stretched in the front of you! Whaaattt???!!!!yup that authentic  buy some frozen dumplings to go because its a great quick dinner on week nights or to give as a gift to your foodie friends", "author": "Kriszta K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-10", "description": "The taste has become disgustingly bad since they have opened and let alone the worst service even for a Chinese restaurant. Arrogant waitress and cooks that refused to own up to anything. Do not eat here", "author": "Alex S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-04", "description": "I would give a zero rating if yelp allows. The services are not acceptable. We got to the restaurant quarter before 12pm and the restaurant wasn't even a full house. We ordered 5 items and only 3 appetizers came after 20 min. And our 2 bowls of noodle soups never came, we waited for 40 min and asked where are our noodle soups. They told us they are still making our noodle soup. How long does it take to make 2 bowls of noodle soups ??? Apparently it took them more 40 min  just to get started.  It is ridiculous! ! We canceled the noodle soups and asked for the bills.\n\nAlso, no apology from the server and whatsoever. Worst customer service, me and my family will never go back. I won't recommend the restaurant to another people as well. This restaurant looks like a joke.", "author": "Stacy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-03", "description": "$35 minimum if you want to use card to pay so I would advice people to bring cash if not coming in a big party. Place is also pretty small and crowded. \n\nThe food was okay but the noodles were pretty much stuck together and it was hard to mix it with the sauce since it was a huge block. \n\nThe servers did not even come by to check up on us and by the way... they reuse their tea kettle. There were 4 tea bags in our tea kettle and our tea poured out clear like water even when we left it to steep for a while to see if the tea would get stronger but NOPE. The tea still came out clear like water with a slight yellow tint.", "author": "Michele M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-09", "description": "I'm surprise this place only have 3 stars. Taste is 5 stars, but overall four stars because of the setting. CASH ONLY.\n\nIt is all about their hand pulled noodles and dumplings here. When we ate the appetizer noodle dish, we can tell that the noodles were definitely hand pulled, not by machines. If the taste of the noodles did not make it apparent, there was a young man pulling the noodle dough in the kitchen. The hand pulled noodles are more chewy and I like my noodles chewy over soft ones.\n\nWe also ordered black bean sauce noodles. The noodles were delicious but the sauce was lacking . I prefer hella sauce on my noodles but they only put enough to cover the noodles. The sauce would have been better if they put more vegetable and tofu/or meat pieces into it.\n\nThe dumplings and xiao long baos were delicious. I love their hot sauce too.\n\nThe restaurant is really small and cramped. It does not have a waiting area. It is not stroller friendly. This family was waiting with their huge stroller in the main (and only) walk way in the restaurant and basically blocked the only route to leave the restaurant. FIRE HAZARD!! The staff members should've caught that and told them to wait outside. We went during busy lunch hour on a saturday so it was hard to get the waiters attention when needed and we had to wait longer (which is expected), but we had to wait an abnormally long time for this one dish - which is the pan fried leek pancake.", "author": "Shirley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-03", "description": "It took an hour to get your take-out... Waited half hour for xioalongboa and got informed that they forgot to cook it... \n\nWaiter is not friendly to answer question.", "author": "Min-cheng H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "I don't understand the low reviews of this place.  The place has excellent value authentic northern Chinese food.  Portions are huge and the prices are very cheap for the kind of quality (handmade) food that is expected.   12 pieces of handmade dumplings for $5.95??  And they are open on Christmas day!\n\nSpicy pork noodle (aka dan dan mein) was very delicious.  The lamb noodle was perfectly cooked with delicious pieces of flavorful lamb.  Chives dumplings were good as well.\n\n-1 star for overcooking the handmade noodles (I like more \"qq\" in my noodles). \n\nSolid choice for this area.", "author": "Addison C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I came here with my parents for a Sunday lunch. Fortunately we got there before 12p and there was no line yet, but shortly after a crowd started to build up outside. There's another Chinese pancake place down the street, but this place has more seating, which is nice when you don't feel like being crammed which you eat. Don't get me wrong, it's still a small restaurant, just not tiny.  \n\nThis time we ordered shanghai dumplings, the beef wrap, tendons and the zha jiang mian (soybean paste with hand pulled noodles). The dumplings were decent. The beef wrap was delicious, the cucumbers add this freshness to the bite. (Their beef pancake is also good, just a different taste as it is fried and is just beef). While I usually favor tripe, the tendon was in this spicy sauce, which made it so hard to stop eating. My leaves happy.", "author": "Natalie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "Didn't really find this place all that great. Ordered a couple of dishes here: Xiao Long Bao, Beef pancakes, some noodle I forgot the name of. The XLB weren't really special, definitely had better elsewhere. The noodles were like eating a softer version of stir fried rice cakes but it lacked flavor. Apparently the noodles are hand pulled. I didn't really taste a huge difference except that the noodles were chewier than normal. They were also really thick too. The beef pancakes were super oily and salty. The dishes were affordable so at least I don't feel too bad for getting mediocre food...", "author": "Benita M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-21", "description": "The only good thing here I'd say is the beef wrap. Everything else is just ok. Also, everyone gets the chicken dish for $20.99. I tried it tonight and it's not good. It's a big plate with chopped up chicken and tons of bones. Definitely not worth the cost and taste isn't good. I'd be happier with chicken chow mein or something. Maybe it's an acquired taste but    not for me.", "author": "Larry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Typically my friends and I order the DaPanJi (Chicken with chilis, handmade noodles, bell peppers, and potatoes) and the Xian Cold Noodles. The chicken might take a little longer to prepare, so my friend calls ahead of time occasionally so that it  would be ready when we get there.\n\nIts not a very big place, so I get there close to when they open to beat the lines.\n\nService is typical of a Chinese restaurant,  you call them over when you need someone.", "author": "Geraldine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-21", "description": "I have eaten here a few times in the past and it was generally good. The dumplings were good, the soup noodles a bit hit and miss.\n\nSitting here and writing this now, I'm not much inclined to come back. The service always tests my patience as asking a fork for the kids requires persistence (just grab me a damn fork already) and tonight I gave up after asking both waiters and got it myself.\n\nThe food is okay. Their dumplings are still good - try the pork with chives. Their spicy beef noodle soup is actually too spicy and I used to just plow through it, but now they're skimping on the beef slices. The noodles are homemade and they're still good and chewy, however. The beef chow fun is riddled with cabbage and sprout fillers and not much beef. Their fried tofu is good, but it's usually good everywhere. There's a cold noodle dish (can't recall the name) that looks like a gray pile of dead noodles, but surprisingly good. The beef pancake is an oily and salty mess-avoid it.\n\nAnyways, after tonight I'm probably not going to come back. It's not that the food is terrible, but the service and food is not enough to make me want to come here when there are better places to go. House of Pancake up the block is much better, so rather than bounce between the two as I had in the past, it's just HoP from here on out. 2.5 stars.\n\nOn a side note, this one time we were having dinner here, this big huge fight erupted in the kitchen. I think it's the husband and wife fighting and it was loud. Went on for like 5 minutes and everyone in the restaurant just blinked their eye, not knowing what to do. Was funny. Unprofessional, but funny.", "author": "Bor C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "YUM! Cash Only. Small place. Cheap for amount of food they give. Very flavorful. Not a lot of vegetarian choices, but they have just a few. Would definitely go back again! \n\nWARNING! Their service sucks, even if you can speak Mandarin.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "4 stars for their hand made noodles which i consider a traditional chinese art.  Something about seeing a 15 year old looking boy pull noodles to master his family's secret teachings pulled on the strings in my heart.  Ok sorry if that sounded racist but I'm chinese so its ok.\n\nhowever, if youre looking for cantonese style chinese, which is almost 80% of the type of chinese food you normally eat, this is NOT the place.  So therefore, stay away from the beef chowfun (it wont be what you expect) and all other typical chinese dishes you order at a fast take out or dimsum/bbq/noodlehouse/fancydinner chinese place.  you have been forewarned.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "Love their food. Service, though, can be slow during busy hours, especially during dinner hours. I've been here a couple times and have only been pleased with one waiter, who provided great service (he even asked if we wanted to refill our tea, all the while running around serving and taking orders). I guess you can say that my experiences seem to improve with the number of visits. Their food is definitely good, especially their dumplings and hand-pulled noodles.", "author": "Sara T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-15", "description": "You come here for their famous hand made noodles... Clearly earning them 5 stars as they are soft as the baby bottom.\n\nCarb king and queens this us your place!\n\nHowever their quality of everything else is subpar! That's why the heavy ding...\nRoasted beef in spicy beef stew is chewy and hard, not soft and supple I have found in many other places. Tendons cooked over short period of time and hard as a rock\n\nTheir dumplings fillings are also minimal\n\nSo if you care about noodle fix.. This works..\nEverything else is mediocre at best\n\nI had to wait in long lines to get in on a Saturday 2pm", "author": "David H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "I wish I could give a no-star review.  Me and my friends have been here for couple times, every time the same dishes taste and ingredients are different, the people are working there are not friendly at all, dishes are dirty. This time we even find something like gum (rubber looking) in one of the egg and tomato dish. And the Shanghai pork dumplings are not fresh, smelled and tasted rotten. We will never come back again.", "author": "Summer B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Love it. The Shiao Long Bao is better than Ding Tai Fung in Valley Fair. The noodle soups aren't overly salty and didn't have a trace of MSG.", "author": "Jayce T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-31", "description": "I normally don't write bad reviews. However, after eating here tonight and reading all the yelp reviews (dating back to 2012), I felt compelled to warn others about the service. The owner has made no attempt to improve service since 2012. She's very friendly and nice but her workers look very unhappy. I wonder if she's even paying a living wage. \n\nThe food is hit or miss. Some dishes were pretty decent tasting. Despite the decent dishes, I would never eat there again because of the service. It's not worth spending my money and time when its stressful dealing with the staff. \n\nWe had to ask for everything a few times (high chair, extra bowls for soup). We had a 2 year old with us and they never gave us a fork or spoon for her. Instead, they gave her a cup for tea and chopsticks. They seemed irritated every time we asked for anything. \n\nA couple, seated at 4 top, had been waiting for their food 30 mins when they were asked to move another table. They threw a shit fit and started to yell at the waiter in front of the restaurant. \n\nSkip this place. It's not worth the yelp hype. Go to one of the other places on Taravel so you can actually enjoy your food in a less stressful environment.", "author": "Kar Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Wow- we got the Xinjiang- style chicken dish and it was AMAZING. It came on a huge dish, and the food was piled high- chicken, chili, potatoes, noodles, bell pepper, ginger- it is a big dish that can easily feed 4 people. So good! \n\nWe also ordered the dumplings- which were really good- we got the pork and spinach dumplings, and the chicken and napa dumplings. It was perfectly done- the skin was thick and yummy, too!\n\nThe noodles are hand pulled here so we tried the black bean noodles- excellent!\n\nBut, it's a tiny restaurant so the wait for a table can be long. Also, they squeezed too many tables into their small area, so the people in the next table were really close to us- on both sides!", "author": "Charissa N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-05", "description": "Sure, there are quite a few Shanghai noodle and dumpling shops that reside on Taraval street... but what makes this place different from the rest?  \n\nOodles & oodles of hand-pulled noodles... and when I say oodles & oodles of noodles... I mean it... like long, long strands of never-ending noodles... so many noodles that by the time you get midway... u'll notice that there are still HELLAEVA bunch left! \n\nFOOD & TASTE:\n\"Spicy Pork Noodle\" ...comes with ground pork, bean sprouts, spicy chilies, and choice of white or green noodles.  Taste?  Not bad... flavor kind of dissipates... I've had better in Vegas.  Wow, did I just say that?  :-/\n\n\"Pork & Vegetable Wonton w/ Noodle\" ...is just what it is, wontons in noodle soup with bok choy, and choice of white or green noodles.  I mistakenly ordered this... thinking it would be Pork & Vegetable Noodle soup, which I later found out (by reading the Chinese) that I should have ordered the \"Muster Pork Noodle\" instead.  :-/  Taste?  Well, I really enjoyed the chewiness of the noodles!  Hand pulled noodles... can't beat that!\n\n\"Shanghai Steam Pao\" ...funny, I've never seen \"STEAM PAO\" for XLB.  Apparently, they even have a sign on the wall too, haha!  So as for taste... Kingdom of Dumpling still tops the winner of XLB on Taraval st.  The steam pao here were pipping hot, full of flavor, but what happened to my soup?  :-/\n\nCONVENIENCE: *** [CASH only... sucks, for Wells Fargo customers, but BofA & Chase are just up the block.  Parking can be easy... metered or 2hr. residential spots.]\nAMBIANCE: **** [Small resto, open space, high ceilings... my sis mentioned that it looks just like the ramen place, only thing different is the food.]\nSERVICE: **** [They must have read the previous Yelp reviews, cuz the gal was consistently checking up on us... ready to order, any questions, refill on tea, and boxes to go.]\nPRICE:  $  [$4.95 for (6) XLB, $5.95-$6.95 for noodle soups.]\nOVERALL: ***/* [3.5-stars... Not bad... not great... but does the job.]\n\nNOTE: Ask for some scissors to cut the never-ending noodles... cuz slurping ain't gonna cut them for u!  \nNuff said.\n\n[#14 of 100 YELP CHALLENGE 2013]", "author": "Lily Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "Yummy hole in the wall place with awesome beef tendon (hand-pulled) noodle soup.  Oh, that was heavenly.\n\nThis place isn't fancy, and don't expect great service, but they serve northern Chinese comfort food that makes me wish I could move back to San Francisco.\n\nI definitely recommend their hand-pulled noodle soup, which are perfectly toothsome.  Add a little dollop of the hot sauce, and I could live happily on this forever.  \n\nI also tried the crab meat dumplings (pretty good wrapper, but I didn't find the filling especially distinctive), the green onion pancakes (wonderfully greasy and crispy), and the Xian noodles (interesting, but I don't know if I'd order it again, I'd rather have the hot dishes).\n\nWe had to wait forever for refills of hot water for the tea or for the bill.  Luckily, I didn't need change, because we probably would have run out of time on the meter.\n\nBtw, they are cash only.  There is a nearby BofA ATM.", "author": "michelle l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "Kinda crowded but the food was served quickly.  Hand pulled noodles is to die for, texture was great.  Dumpling was wonderful, not soggy!!", "author": "Wailun Eugene W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-06", "description": "Worst service ever. Waited 45 minutes and our entree still didn't come so we left angrily. They are way understaffed and the wait staff is incompetent. We were completely ignored and people who arrived after us got served before us. Never again.", "author": "Suzan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "In the past couple months, whenever I had a craving for northern Chinese food on a cold day, Shandong Deluxe always popped into my mind.  Why? Because it's affordable, filling, and warms me up from the inside.  My perpetual favorite is the Xinjiang noodle although I think all of the noodles dishes I've tried here are great too. The dumplings here are better than the famous dumpling place 10 blocks down Taraval although opinions may vary.  Since I like spicy food, the spicy beef tendon is a great starter dish. \n\nDepending on who's working, the service and English may be so-so but it's definitely not a deal-breaker. \n\nCash only!", "author": "Renee L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "One star for service and 4 stars for food (previous visit). Ordered a rather simple dish, spicy beef noodle. \n\nRestaurant was near empty when I got here, 30-35 minutes later the place is near full and have yet to get my noodles, even though everyone else has been served.  \n\nI was given tea (albeit, Lipton tea) and told \"it's coming\". I'm just gonna leave.", "author": "Alejandro C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Returned here recently, again because the Pancake House across the street was closed (on a Wednesday?). The dining room was full but the staff cleared off the table where normally to-go orders are put and offered us it. It happened to be next to the breaker panel, and three times the staff needed to interrupt us to reset a circuit. These amounted to a comedy of errors rather than a serious disappointment, as the food was very good. \nWe ordered the freshly made pork and spinach dumplings, onion pancakes and a beef stew--all of which were wonderful and delicious. This place has been redeemed in my opinion.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "We arrived a little before 12pm on a Sunday, wrote our name down for a table of 4. Waited maybe about 15 minutes for a table, not too bad at all.\n\nWe ordered a lot of food for 4 people:\nbeef pancake: beefy, I prefer this over the green onion pancake, maybe due to the fact it has meat\ngreen onion pancake: crispy\nblack bean sauce noodles: tasty and very saucy\nbeef tendon noodles: tasted like something I could make at home\npan fried dumplings: these were huge\npork and napa cabbage dumplings: ordinary but good\n\nI believe everything was homemade, all from scratch, the wrappers/noodles/fillings...\n\nI think we could have ordered 4 things and had been satisfied, maybe one less dumpling and pancake. I think it was about $11/person, not bad for the amount of food we ate.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "As a Chinese we are happy with the food here, price here and the services here! Will go back for sure!", "author": "Becca B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "This place is delicious! We had fungus with cucumber, beef dumplings and the spicy beef soup and the seafood, pork and chicken noodle soup. The broths in each soup were fragrant and flavorful, the fungus and steamed dumplings were perfectly seasoned and delicious. The staff is attentive and helpful. Wonderful!", "author": "Susan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Why do people say cash only? Maybe they changed policies? I had dinner there tonight and paid with a VISA.\n\nI like getting either their Spicy Beef Noodle or their Beef Noodle. I think the soup might be the same, except for some hot sauce in the spicy one. The soup is very good and tasteful.\n\nTheir noodles are made in house, and because I prefer firm noodles I like what they offer. I don't like how their noodles clump together when you first get them but it's very easy to just loosen them up before eating. \n\nI also really enjoy their napa cabbage dumplings. I always order this when I go. It's a good balance of veggies and meat. You can taste the napa cabbage, but it's not all you taste/eat. \n\nService is typical of Chinese restaurants. They don't really spare smiles, but to me they do their best to serve their customers.", "author": "Bonnie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-26", "description": "A good place with handmade Chinese ramen and dumplings. I had beef stew noodle soup here. I like heavier broth so it didn't match my taste but I think it is still good. And lighter broth is supposedly healthier. I totally will come back and try other items.\n\nThe decoration is odd here though. It is a Chinese restaurant but the art on the wall is Japanese.", "author": "George C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-07", "description": "Yuck. Don't eat here. Food is so gross.  Found a quarter inch of oil floating on the bottom of my beef chow fun.", "author": "W W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "Gummy homemade noodle, soothing hot soup, delicious dumplings...what not to love about this place. It gets crowded most night so come early! Service has always been good to us. Must order their homemade noodle and dumplings! 5/5 stars for this place!", "author": "Brian K M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-30", "description": "Shandong Deluxe replaces Ramen Doraku in name only. the decor remains. (a  ramen doraku nameplate is still up in the back).\n\nspecialites; (stated on front window)\n-shandong dumplings\n-shandong hand pull noodles\n-xiao long bao\n-won ton/noodle soup\n-small plates (appetizers, northern style)\n-shandong bread? \n-more listed  unsure of translation\n\neats:\nfish steam dumplings (12/6.95)\n-some fish taste with chives, dumplings huge like potstickers\n-not a dumplings fan, so just ok.\nlamb noodle (6.95)\n-tender lamb pieces, very  tender noodle, not chewy, not al dente\n-broth had lamb,  star anise, szechwan mustard, and msg flavorings\n-didn't have that hand pull noodles chewiness\nfood: 3.5 stars\n\n.takeouts:\n-service not a problem.\n-not many tables, fills up fast.\n-semi-open kitchen, lady in back making dumplings\n-portions large. taste ok (3 stars), good value (4 stars)", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "After reading the reviews on Yelp, I had to lower my expectations just a little bit.  We decided to eat here after biking.  Got here around 8ish and waited about 40 minutes- more like an hour when you're super hungry and watching everyone else eat.  \n\nI made a bathroom run so I have no idea what the names of the dishes are called so I'll try my best to describe them...or copy and paste from yelp =P\n\nTripe salad- \"Not the fuzzy type\" that my bf was expecting but overal very good.  \nXinjiang noodles with beef- This dish was ok.  The noodles were good but the strands were continously long- it was quite a struggle splittling this 4 ways.\nBeef Pancake-  \"Oooh, whats that dish?  It looks like a pancake stuffed with beef\"... \"It's a beef pancake\" Duh!!  The outside was greasy but crispy.  It looks burnt but boy, it was good.\nSpicy Beef Noodle- Big portion, right amount of spice, a little lemony.  Again, the infinite noodles made it difficult to split but this time we were smart- ask for scissors!\nGreen Onion Pancake- super thin.\n\nI was surprised by the low reviews.  I thought this place was pretty decent.  We could've passed on the noodles with beef and the green onion pancake but at least we tried it.  \n\nVery inexpensive. Very.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-22", "description": "My curiosity piqued.  How would yet another, a third, dumpling spot on Taraval fare?  Apparently, not so well.\n\nAs Yelper Bri Y. mentioned, ShanDong Deluxe replaced Ramen Doraku in name and menu, but not in decor.  I found the menu hilarious, since there was handwritten scribble all over ours, crossing out misspellings and updating options.  At least someone is helping to proof the menus?  Although shouldn't this be done prior to printing?  But I digress.\n\nSo the food....in summary, lacking in flavor. Here's what the FH and I ordered:\n\n- Salt Pepper Tofu $5.95 - super bland\n- Onion Pan Cake Egg Wrap $5.95 - I could do without the egg next time (well, actually, doubt there'll be a next time), and the onion pancake itself was limp and virtually tasteless\n- XLBs $4.95 (for six) - sad. These XLBs were small, shriveled, and nearly soupless, not plump and juicy like I had hoped for\n- Spicy Beef Sauced Noodle $6.95 - chewy noodles were actually pretty good, but the broth had zero flavor and just tasted spicy\n\nService was fine, and we were told we needed to pay cash because the restaurant would be closing soon.  No problem, but if you are closing, why are you still accepting walk-ins?  Also, for being a new restaurant, why are your condiment containers already caked with dried sauce?  Not impressed.\n\nSuper disappointing and unsatisfying meal.  Next time I'm sticking to the other two similar joints down the street.", "author": "Mel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Always get the Pork dumplings with Napa and Beef Chow Fun. Portions are very generous and super tasty! I haven't been disappointed yet.", "author": "Julian T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "First time I came here it was for the noodles. Saw the guy in the window hand pulling them and immediately thought FRESH! Then while enjoying the outstanding flat flour ones, I saw it! It was \"love at first sight.\" It looked really sexy. A mountain of chicken, potatoes, bell peppers etc, on top of big fat No.3 type flour noodles, all swimming in a deep red pungent sauce, with 100 small red Sichuan chili peppers for company! Wow!! It was called \"Xinjiang Chicken\" and it was gigantic. (And not cheap at $20.99.) But I knew at first sight, that I had to have it! Visit #2, \"Xinjiang Chicken please!\" After a short wait, it came. As I dug in, I closed my eyes and there it was, i was in the Urumqi main market, The Erdaoqiao Market, the Silk Road, the smell of grilled kebabs in the air. Handmade pita bread being rolled around me. Middle Eastern type music wafting through the market. Asian faces with strong middle eastern lines all around. The shopowner beckoning me to come into his shop in Turkish, and to try his special \"Xinjiang Chicken,\" and as I went in and sat down, and he brought it to me, my eyes opened to the taste of fire and cardamom in my mouth.  It was so good, I almost started yelling in Turkish (the language of the Uigher minority who inhabit Xinjiang,) \"mashallah, Öldüm ve cennete gitti ettik\" (oh god! I've died and went to heaven!) but I didn't, to keep the Cantonese people around me eating this delicious shandong food, from thinking I was crazier than they already thought, (about a white guy eating a 100 pepper dish, smiling and howling.) So, like to travel to faraway, exotic places? Yes? But you don't have the time and money? Can I interest you in a trip to Xinjiang? It only costs $20.99 and 2 hours max. If you go, don't forget to try the \"Xinjiang Chicken,\" and don't forget  to hit me up afterwards and I'll tell you how to say \"delicious, thank you\" in Uighur, (Turkish.)", "author": "George F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "I came here for the dumplings but left wanting to try more noodles. A good sign that I'll be back in the future. Their Pork and Napa and Chicken and Corn dumplings were good and actually different from the other dumpling places I've reviewed around the Bay Area (Town, Kingdom, King, etc.). These dumplings seem to have a thicker skin, larger, and the filling is flavored differently. I normally like Pork and Napa over Chicken and Corn but it's the opposite here. There's a larger selection of dumplings here than most places too, including crab, fish, and different lamb combinations. I also tried their signature Xin Jian Chicken Noodle plate...which is huge and has to have at least a whole chicken in it. It's worth a try but it's more for 3-4 people and doesn't have much noodles in it since the noodles are huge, thick, wide styled noodles. The portion sizes here are pretty generous and if I were to come back, I'll be looking for more dumplings and one of their handmade noodle soups.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-17", "description": "I'm torn.  The food is good, but the service is horrendous!  I'll be nice and give 3 stars for now.  \n\nI was excited when Shandong opened in the Sunset, because I thought it was related to Shan Dong in Oakland Chinatown that I've heard so much about from friends.  Both places have hand pulled noodles and fresh made dumplings, but I don't think the restaurants are related.  \n\nThe place was packed on a Tuesday night, and the bf and I stood there unacknowledged as we waited for the next available table.  We watched in puzzlement and worry as the staff was visibly frazzled and the diners were either waiting for food or trying to get the staff's attention.  After 5 minutes we were finally greeted with a \"please sit\" and some hot tea.  \n\nThe menu is divided nicely into soups, noodles, dumplings, etc.  However, unless you know what Sam Sun, or Xinjiang style, or Hanamaki mean, it is difficult to pick what to order.  There are no descriptions for any of the items, which is a huge mistake because people generally want to know what they're about to eat.  This, along with the fact that the place could barely function with 18 diners, was very unsettling.  But then the food came, and it was okay.\n\nThe onion pancake was crisp and chewy at the same time.  The vegetarian dumplings were the perfect thickness and consistency, and filled with edamame and tofu (I think).  The noodles (I don't even known what we ordered) were the best hand pulled noodles I've had in the city.  They had a great flavor and chew, and were in a light, spicy, garlic broth with plump shrimp and cabbage.  The house chili sauce enhanced everything, and I was lost in spicy, chewy, deliciousness.  \n\nThat is until we were done eating, and it was an effort to try to get the staff's attention so that we could pack our leftover dumplings, pay, and be out of there.  \n\nI want to go back, but only when they are not busy and overwhelmed.  Hopefully they'll learn the ropes of running and operating a restaurant soon, because the food is pretty damn good and it would be a shame if they don't improve their service.", "author": "Sandy K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-25", "description": "This place was okay..nothing really special.\n\nThe best dish would be the spicy beef noodle. The noodle are all hand made and it really taste so fresh. \n\nThe green pancakes were pretty good too just a bit greasy. \n\nEverything else was just ordinary. I got the veggie shrimp dumplings and it felt like it was microwave. \n\nThe place is super small and gets pretty crowded during lunch time. \n\nThe price itself is cheap and if you looking for a quick fix...I GUESS you can come here. \n\nOverall, i have experienced better.", "author": "Adam J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-01", "description": "If you're craving tasty, hand-pulled noodles then this place is a pretty good option.\n\nOrdered the:\n\nXianjian(sp?) cold noodles - it's saucy with a slight kick to it. For some reason it tastes very much like a Vietnamese dish.\n\nXiao long bao - decent, but the wrapper was a little too thick at the tip (that's what she said) for my liking. If I'm craving XLBs, I will stick to my go-to Dumpling Kitchen.\n\nBeef stew noodle - broth was very flavorful and the hand-pulled noodles were fresh and delicious. The beef chunks were good, too, but there could've been more of it. Definitely a satiating meal on its own.\n\nBeef wrap - I thought it was a bit bland but the wrap had a nice crisp to it.\n\nFor all 4 dishes the bill came out to be $26.50. I've had cheaper meals, but the pricing isn't too bad.", "author": "Tee C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "So... I am always looking for a new place to eat near work.  On the sign it says ShanDong Deluxe, but their cards say ShanDong Delicacy.   At 230pm there were a few tables eating a late lunch.  They did not have take-out menus yet so I stood there and quickley decieded to play it safe with Beef Chow Fun and Xia Long Bao.  Overall the food was good.  Nothing to brag about.  \n\nBut as I was waiting a table received their order of Xinjiang Chicken Noodles and it looked tasty.  I asked the waitress to point the dish out on the menu and it was $19.99 and seemed like a good portion to split with 2-3 people. \n\nThe place was small but very clean.  And had a health score in the mid 90's.\n\nIm going to wait a little while and try again with my co-workers to get a better sence of their food.", "author": "Sheenie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "The hand made noodles is very good.  Must have.  I come here often, maybe twice a month.", "author": "Jack L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "This restaurant is small with very limited seating. Thankfully when we came, the line was relatively short and the turnover was quick.  We ordered the pan fried hand pulled noodles and soup dumplings.  I could see the noodles being handmade in the kitchen.  The noodles were chewy and tasty.  My only complaint was that it was on the greasy side.  The soup dumplings were flavorful and the hot sauce (condiment on the side of the table) made it taste even better.\n\nThe service was fast and friendly. Prices were affordable--but this establishment is CASH only.\n\nWe were super thirsty after eating here....must have been the MSG...", "author": "Janet E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "I ordered lamb tonight, and the food was raw! It was red and chewy. \n\nI feel so upset and angry!", "author": "Lulu C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "for a taste of Northern Chinese cooking in the Parkside, this is your best option. The dumplings are not quite as good as the Kingdom of dumplings down the street, but the other dishes worth mentioning are listed here:\n1- lamb skewers with chili pepper flakes and cumin - excellent\n2- xian cold noodle salad is wonderful house made broad noodles in a savory peanut sauce dressing. (sorry peanut allergy folks). this may be the star of the show at this restaurant. it's tossed table side by our server and if you are hungry, you should definitely order this one. or share one order with a friend.\n3. persian cucumber salad here is wonderfully dressed and has a garlicky hint.\n4- cold soy bean curd noodle salad. nearly every Northern Chinese restaurant has a version of this dish. but this one served here may be my favorite rendition. the soy bean curd noodles are an excellent sponge for the dressing. very refreshing\n5- the chive pancakes with yam noodles are pan fried and are very tasty. I would recommend this dish for pancake fans from anywhere ..\nNOT to be served with aunt jemima syrup, this is the Northern Chinese savory kind of street food. another version has  beef slices and green onions. one of my first personal experiences with this type of pancakes came from a food vendor on the streets of Beijing in 2007. the second time it was at of all places, inside of a WALMART in Beijing!\nhm hm good.\nJYW likes this place and the people are friendly.\nby the way, the noodle dishes use noodles pulled by hand by the chefs on site. very chewy and great in a hot soup dish.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "Excellent food, cold noodles, hand pulled noodles and dimsum! Ive beeb here before. Its not even crowdy right now (monday at 5pm) but on most nights and wekeends expect a line and a 30min wait.", "author": "Pinky A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Dumplings galore! Word to the wise, it's always better to get chopped ginger with your soy sauce & vinegar dipping sauce.", "author": "Dru C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-10", "description": "What is everyone talking about that I did not get to experience?  I came with the parents over the weekend and by the end of the meal, we pretty much decided we would not be coming back anytime soon.  The following is what we ordered.\n\nXinjiang Noodle with Pork: I'll admit the noodles were good.  You can tell that they're hand-pulled.  The sauce and everything else?  Not impressed.\n\nPork and Corn Dumplings: Wrapping was too thick.  \n\nXiao Long Bao:  They forgot our order and so it came out towards the end of our meal.  Judging by the dumplings though, we definitely did not have high expectations.  The XLBs were weird.  They were almost like...pyramid shaped?  Some were punctured already so the soup had already leaked out.  Would not recommend it.\n\nBeef Wrap: Ok.\n\nDry Cooked Chicken Wings: These were just not good.  There was no spice to it whatsoever, despite all the peppers on the plate.  (I guess it was just there for decoration?)  All I could really taste was this sweet and spicy sauce.  My sister likened it to the sauce you would find at Panda Express, but even worse.  The small-ish wings were served on this giant plate, which made it even sadder.  Man, I should have taken a picture.", "author": "Vanessa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "Not much of an update but pretty much 2 years later my sister, brother and I found ourselves back here tonight--we laughed over how intense my last review was from our not-so-good previous experience!  Wowsa.  \n\nService is still lacking but the food today was ON POINT!  We'd definitely be back for the Mackerel Dumplings and the Wok Fried Napa Cabbage with dried shrimp (smells crazy dank but it's sooo legit and tastes good added inside dumplings!).", "author": "Nadia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "everything i had here was good, but the highlights were the fresh noodles with just the right amount of bite, the xinjiang chicken", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "The food here is fantastic! Noodles and dumplings house made by hand?! Who knew you could find that in the Sunset? Keep in mind this is not Cantonese food that most sf natives (like me) are used to, this is Northern Chinese cuisine which has different flavors. I was not familiar with it and was hesitant as the place does not say extravagant - it says Authentic. So I asked our waitress, Carina, for recommendations.\n\nCarina not only told us house favorites, she was able to describe how each item is prepared,  ingredients used,  type of sauce, etc. I was impressed & when the food came out it was even better than expected. I will definitely be back!  What really gives this place a five star rating (on top of all the above) is that it is a small,  local,  family run business with extremely honest employees. I accidentally left my purse behind filled with my wallet, my tablet, etc. and didn't realize until after my massage hours later. Not only was my tablet and my wallet still there, they kept safe in the back for me - and all my cash was still in it! I tried to give the father the cash, but he wouldn't take it. In the end I insisted to the waiter to give it to him. I'm amazed with their integrity as individuals and the pride they put in every dish. I highly recommend Shandong  Deluxe! \n\nTip: Try the beef wrap, pork and chives dumplings, beef stew noodle (soup) & the pan fried dumplings! They were delicious! (Coming back soon to try their Xian cold noodles, which is the house favorite).", "author": "Linda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "I am coming to this place almost 2-3 times a week. Fell in love with their Mongolian beef, and had the best Xinjiang Chicken with noodle, and Xinjiang chicken in California. \nThey still can work a little bit on their kababs)", "author": "Hajy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "Yum! My friend, a SF native, took me here. I tried the veggie dumplings, chive pancakes, and enoki mushroom salad, and my friend had a beef chow fun. Everything was delicious. I especially want to commend the cold appetizer options at this place-very authentic Northern Chinese, and plentiful options. The enoki mushroom salad was vinegary, mixed with cucumbers, and so refreshing. I also had a hot soymilk which was yummy, but I sadly noticed that it's not made on premise, they just pour it out of a gallon. Was a tad bit pricey as I'm used to eating Chinese food in New York, where you don't spend $20 a person when you go out for just some dumplings and noodles as I had to here.", "author": "Crystal Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-30", "description": "This restaurant has very good noodles with reasonable prices and I really want to come again, but I doubt their health standard is up to the scale. When I visited, I didn't see the health rating hanging in front of the door. \n\nDuring the visit, I noticed a few things. The server grabbed raw food from the fridge and used the same hand to serve dishes to customers. We were sitting right next to the kitchen. There was a bucket of potatoes sitting on the floor. A lot of food preparations were done right outside of the bathroom. The table was very sticky and dirty. For food safety issues, I don't recommend you to bring kids eating here.", "author": "J L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Wifey and I are suckers for hand-pulled noodles.\nThey're like old-school an' stuff...\n\nEating old-school Chinese stuff reminds us that we're Chinese.\nGotta pay homage to the motherland, huh?\n\nAnyway, order anything with noodles here.  Good.\nPan-fried buns here are tasty as well.\n\nBut ya wanna know a secret?\nPromise you won't tell?\nGet closer.\n\nCloser...\n\nOrder the Xinjiang style chicken with noodles.\n\nThe most expensive thing on the menu at twenty bucks.\nThe order is big enough to feed 4, but is well worth it.\nChewy noodles, lean chicken, hearty sauce, and enough Sichuan peppers to numb your britches for a week!!\n\nThat's what China's about, beeyotch!\n\nWord.", "author": "Gracie-C Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "Pork elbow is good, beef tendon is on point, all the appetizers are pretty on point. The soup noodles are huge and the pork chive dumplings are tasty and full of juicy flavor. Have been coming here for dinner multiple times and it has always been a tasty satisfying dinner. Service language choice is basically chinese or mandarin but if you point on the menu and are open minded, service is super easy and pretty quick.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "I really wish I could give a negative score. I've waited for 1 hour for a bowl of spicy beef noodles!!!! Many people were getting their dumplings. I'm positive that noodles take much faster to boil than dumplings! I've asked several times for my order, I just got fed up and left. I literally just made a yelp because how frustrated I am with the wait staff particularly the female waitress!!", "author": "L W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "This is an update a/o 10-17-15\nI was craving pot stickers today and went solo to get some along with some green onion pancake. I remembered them to both be good. \nThe pancake was thin and greasy, lacking taste. The filling of the potsticker seemed \"loose\" and not so good. The green onion pancake I buy from the frozen section of the Asian Markets are 1000x better theirs. \n\nWhile I was eating, I noticed that one of the cooks was tasting the broth of something a customer ordered with the utensil he was cooking with. It went back into the wok and he used this same tool to finish off the dish and scoop it for the customer. eeewwwllll\n\nI won't be back for multiple obvious reasons!", "author": "May G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-12", "description": "SLUUUURRRRRPPPPPPPPPP\n\nIt's a bit off putting when the first moment you enter into a restaurant and you see their staff members slurping on a bunch of noodles during their lunch break. This wasn't your typical noise of chattering and clinkering of plates but just multiple splurping noises coming in at different times. Luckily, there were plenty of seats around to be seated at that time. After standing around awkwardly for a couple of minutes, thinking that someone would come by to offer a table, I walked up to the front counter and asked to be seated. \n\nShandong is your typical hole in the wall chinese restaurant with servers that only care about just getting the food to your table and nothing else. The only reason why you would come back to the place is because of their food and how affordable it is.\n\nAnd that's pretty much what deems this place as good. The hand pulled noodles are whats so amazing about this place. It's freshly made, has a great al-dente texture to chew and of course...it's easily slurp-able. After initially judging others for being so loud in eating their food, i found myself joining in on the slurping noises! I really like their pork and chives dumplings and find them almost to the standard of Kingdom of Dumpling's\n\nOne thing to note is that it is CASH ONLY. There are plenty of banks/atms available though so finding cash shouldn't be too hard.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "My mom flew in from shanghai, and amazed by how authentic the dumpling and the rest of the dish were. My grandparents are from Shandong, so We are familiar with cuisine very well. \nThe owners woke up around 3-4am every morning to prepare for all the dough, making from scratch. You can easily tell all the dumplings are well handmade.  \nFlavors are awesome with great price tag!!! \nI love this restaurant, it's nice and cozy, and has free wifi!! \n\nHighly recommended.", "author": "Fanny Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "The best Shanghai Dumplings (小笼包) I have had in San Francisco, hands down. All of their dumplings and noodles are handmade fresh, not frozen.  This place is great and is about as authentic of a Chinese food restaurant you can find outside China!  Their homemade spicy sauce is delicious. Great selection of dishes from different regions of China (Xinjiang, Hunan, Sichuan, Yunnan, etc.)", "author": "Andy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "It's a higher than average Chinese restaurant.  \n\nI liked their black bean noodles, but part of me wishes the portion was larger.  \n\nAlso ordered their beef roll.  It's def a must order.", "author": "Joshua P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "Don't come here! It is so bad. We ordered two dishes: beef pancake and black bean pork noodles. Beef pancakes look like they are made two days ago and reheated at least twice, which is gross. And they are saturated with oil, literally dripping from the pancake. And the black bean noodles is not even black bean noodle! It Is a weird dish with green beans and tofu in it! Trust me I lived in Beijing for 4 years, I know what a black bean noodle should look like...", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Looking for authentic Chinese food? This is the spot, and the best spot on Taraval. My regular is Dan Dan mian (spicy noodle soup) and guo tie (a larger sized dumpling). It's all very cheap, and the portions can feed two, but expect a small line at night. It's worth the wait. \n\nIt's a great spot for a large group. I believe we reserved for 15 people once and they made it happen. If you are going on a date, it's also a good place, but it's not so quiet if that's what you are looking for, but still a good place for conversation. \n\nEnjoy!", "author": "Stevie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Noticed this place on Taraval tonight, so my friend and I decided to try it. And,, it turned out to be a pretty nice restaurant.\n\nAlthough there was only one waitress serving, the service was still good. She was quite attentive! In addition to the service, the dumplings were also a highlight of my meal tonight. They were fresh and not dry at all. They were full of fillings that treated delicious. Besides the dumplings, their hand made noodles were awesome! Try to get the soup ones though :p. The portions were huge! One plate of Xin Jiang noodles could be enough for two people for under $8 (before tax)!! However, I didn't find this plate to be extremely impressive except that the noodles itself was good. I will be back again though :).", "author": "Pui L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-13", "description": "Food is nasty as their service. How can a waitress pick nose in front of customers?! Ew......We saw her picking her nose while we were asking for the check. Again, she was walking to us with the check and picking her nose in front of us!!! \nBesides the nasty service, their food is bad too. Don't order the smoked fish! It's very dry and without sauce. It's different than the one we normally have at somewhere else. It's the worst smoked fish I've ever had. Nasty!\nDO NOT go to this place!", "author": "Chalina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-09", "description": "I'm so disappointed..\nAfter checking the reviews here, I figured it was worth trying -after all, I live a block away from the place.\n\nI ordered 2 pancakes. Twenty-five minutes and several other pick-ups later, I'm told that my order might not have been in after all. He proceeds to try to retake it. Uh No. I let him know I'm leaving and he assures me is coming in five minutes. Fifteen minutes later, I get my order. A total wait of 40 minutes for 2 orders of pancakes. The beef pancake tasted like they had dumped a cup of salt right on it, completely inedible. The onion pancakes are paper thin and super greasy... In fact they both were.\n\nDefinitely not worth the wait or the money.", "author": "Miss E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-28", "description": "I can see why there are low ratings. I was sitting in the way back and saw them getting all the dumplings for each order out of a large freezer. Many were very seriously frozen together and had to be beaten apart. If you're in the front of the restaurant and wonder what that thumping is that you hear fairly regularly, now you know.\n\nI didn't see all that when i initially placed my order for dumplings and noodles.\n\nNevertheless, despite this glaring warning, I was curious because of the (now clearly suspicious) positive reviews. The dumplings were horrible. They were pretty much inedible. They had clearly been frozen and were not any where near fresh. They did not even LOOK decent. They did not even taste kinda good. Bleck. Horrible is being nice.\n\nI asked the waitress for what they were famous for. I figured it must be something other than dumplings. She suggested the noodles and suggested one dish as the most popular. She said the sauce is the part that is the best and what to really look for.\n\nHmmmmm\n\nWell the noodles were crazy oily, like many reviewers noted. Not only that, but there was hardly any sauce. I added a bit of the mustardy sauce they offer. After adding that, I'm fairly sure this is the \"sauce\". It totally tasted the same, or at least VERY similar to the original sauce... Just more of it. The noodles themselves seemed decent. but i wonder what's the real story about them considering the dumplings and sauce fiasco. Basically the noodle dish sucked.\n\nI won't even go into the smell, and the feeling that oil is in the air. My guess is that the smell is from oil. Hmmm\n\nAt least I had fresh baked cookies that I had made myself at home.... Otherwise I would have had a really hungry night ahead.\n\n:(\n\nI feel bad writing such a scathing review. The waitress at least seemed nice. It's not her fault the food sucks. But it was just to terrible, I had to do what I could to warn others. Save yourself.", "author": "Zoe D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "This is an easy win for me. \nPancake: more please!\nHand pull noodle: one of the best hand pull noodles i've had in a long long time.\nSeaweed salad: Chinese style, more like kelp.\nDumplings: corn and chive- both good. I think it's better than kingdom of dumpling these days. I love the owner of kod, but their quality has gone down. And they got the same hot sauce.\n\nStaff was friendly, unlike other yelper said, they seems quick and clean. Lets hope it like that everytime I come back.", "author": "jasmin t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "Fresh hand pulled noodles with bean paste and pork probably the best item we had, a close second was beef wrap pancake.... so good! The dumplings are fab. \nTopped off with watermelon juice to counter the amazing hot sauce on condiment tray.\nLow prices.", "author": "Ena O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-02", "description": "If there was a 0 star option then I would give them that instead. Although some or a few choices here are quite delicious, their customer service is indescribably HORRIBLE. Okay, my fault that there's so much people in line and waited for almost two hour to be seated. Then Ms.Waitress comes and tries to take my order without her notepad, then fails her attempt and gets her notepad and takes my order (lamb skewers, celery and pork dumplings, Shanghai dumplings, crab dumplings, and pan-fried meat buns). \n\nFirst dish of lamb skewers were fine. But the Shanghai dumplings are disappointing. The skin of the dumplings were made poorly, therefore once I clamped my chopsticks on them, it broke immediately. Yuck, thought you were dumpling masters. \n\nFinally after asking the waitresses twice why our order is taking OVER 30 MINUTES to get out, it finally came, yeah, the wrong order. Then we had to tell them it's the wrong order then the pan-fried meat buns finally came out. Sorry, let me introduce that again. The OIL DRENCHED meat buns came out. \n\nThen after TWENTY MINUTES, after TWO more asks to the two waitresses why the orders are taking so long, the \"celery pork dumplings came\". Uh, no. Just kidding, it's corn and chicken dumplings. So I was to my extent and told them that it's not what I ordered and asked for the check. Okay. She comes and shows me that she cancelled the two dumplings and it's thirty dollars for eating four skewers of lamb, four Shanghai dumplings, and four oily meat buns. I was like, \"This is thirty? Are you sure?\" Then she recalculated and it was actually 19.50. \n\nOverall--horrible. It was unpleasant seeing other tables who came after us with tables filled with food in less than twenty minutes. Afterwards, I got the takeout menu and recalculated the check. We were charged extra $2.50. Could've given that money to a homeless person or for the meter, y'know. Go to this restaurant if you want horrible customer service and get ripped off. Tips? Didn't give any. They didn't deserve any. Took my fifty cents back for my piggy bank.", "author": "Cherry N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "I bumped into this place by accident. Had no idea it is northern Chinese cuisine and I've never had it before. Looking at the menu and the prices, I was a bit concerned - do these low prices mean that I am risking Salmonella?\n \nThe young guy who took my order was helpful. I ordered some noodles with Chicken and Veges and chicken dumplings. \n\nFood arrived pretty quickly, first the noodles and then dumplings. Portions are huge here. I had eaten a decent meal about 2-3 hours earlier so wasn't particularly hungry. But as I dug into the food, I kept going on and on. It was delicious and fresh. Not greasy. And since seating is around the kitchen area, you can see it is prepared hygienically. And, the coke I ordered to wash off grease (something I always do at Chinese restaurants) was totally unnecessary. \n\nCheap, delicious, non-greasy, huge portions, hygienic and served by a friendly staff. What's the catch? I couldn't find one. This place is a hidden gem.", "author": "TwinPeaker J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "The food there always makes me feel like I was home back in China. Their cold noodle and xinjiang chicken with potato and noodle are things I crave for from time to time. The cold noodle is a typical cold dish in China but I can't find it often here. People who didn't grow up with Chinese food may find it strange at first. But this place is the number one restaurant for my Chinese friends and I. We all have our own favorites but we all LOVE the two I just mentioned. \n\nThe only thing is it's a bit small inside and can be quite crowded. There's usually a line outside too. Well, if you see a Chinese restaurant that's super clean and empty, it's probably not real Chinese food anyway. Plus, you can just order takeouts.", "author": "Ironchef C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-13", "description": "Ordered a chow mein that was drenched in oil. \nordered an soup based mein and the soup had lots of oil too.\nWay too much oil in the dishes.", "author": "Maybo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-20", "description": "This place is pretty small, but very clean and comfortable! Not a good place for a party more than 4. Very affordable and filling!\n\n\nMy friends and I ordered 3 dishes...\n\nXinjiang noodles with chicken: nothing special, but their noodles are very soft and chewy. They have green peppers in there. I ate one thinking it was a bell pepper, but it was so spicy!!\n\nJellyfish salad: too salty and sour. The jellyfish was good tho. \n\nChicken and chive dumplings: the dough was chewy and the filling was good! Wish they had more juice inside it tho.", "author": "Josie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-18", "description": "The dumplings are standard - just like at any other place on Taraval.\n\nThe hand-pull noodles in soup are fine.\n\nI do like the onion pancake here.\n\nThe Beef Roll Pancake is better at House of Pancakes.\n\nThe Spicy Pork Noodle is super spicy; they warn you about it. I had to dilute it with hot water, but even then there's some chili that is just extra spicy.\n\nOverall, there are better options on Taraval. I wouldn't bother going here if I had to wait (which is common b/c the place is small and they get a decent amount of business). I would come again but recommend other places on Taraval to friends.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-04", "description": "Customer service ain't the best, but their food sure is good as long as you know what to get. Their tomato and egg noodles are good, and so are the rest of their other noodle soup choices. Their polished pancake dessert is killer, got to try it.\n\nSadly it's a little cramp inside, so I always order take-out from here. If I was ever in a pinch about what to eat, I'd call up this place", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-12", "description": "This is a negative 5 star review. My best friend and I are not Chinese, but we live in the neighborhood and  expect to be treated courteously. They at least wiped down the high chairs for our sons, but that was it. We had to ask for a menu 3 times and every time I told the server (chunky Chinese girl with glasses) that we were ready, she just nodded and walked away... Helping other guests and ignoring us. I'm tired of that. Wake up people. We have money to spend and want to spend it... Don't forget about customer service", "author": "Antoinette C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "Not sure why this place only has 3 stars.  It's delicious, and so cheap!  We had absolutely no problem speaking English - there were 2 completely fluent English speakers working there at 5pm on a weekday.\n\nThe tofu with preserved egg was delightful, but the star was certainly the Xinjiang chicken with knife-cut noodles.  Onion pancake was delicious too - thin and just a bit crispy, and it went well with their house made spicy sauce!!", "author": "Jon E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-05", "description": "I was meeting a friend for lunch in the Taraval area and we decided to go to Shandong Deluxe because House of Pancakes was too crowded. My friend ordered the beef chow fun, but I wanted something vegetarian today so I ordered the vegetable dumplings. I was disappointed with it. The dumpling had shredded cabbage, crystal noodles, and what looked like it could have sesame seeds. It didn't have any flavor and the vegetables had the texture of grounded meat. I liked that they gave a lot of dumplings so it was worth the money. But I wouldn't order the vegetable dumplings again. My friend's chow fun dish looked good and there were other people who ordered noodles that looked delicious too. I might return to try those dishes.", "author": "Andrea G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "Hand pulled noodles are not bad. We usually go for the zha jiang mian. It's nice and chewy, but it's an occasional hit or miss with the flavoring. Their dumplings are yummy!!! especially the one with chives and shrimp. If you like it, you can also ask to buy frozen ones and boil them whenever you're craving them at home if it's a further drive for you. \n\nUnless you like a lamb-like tasting beef pancake.. I would not get that one. I'm not sure what it's called exactly, but it's one of the two pancakes that's advertised in their window. They say that the lamb-like tasting flavor might come from all the different herbs and spices they use... but who knows, I did not like it at all. \n\nBe careful not to mix up the vinegar and the soy sauce bottles.. They tend to be identical and both are not always provided on the tables. Their hot sauce is really good, but be very careful because it's pretty spicy! I usually use that on all my food =P. \n\nIt's a hit or miss on the wait times.. sometimes they're ridiculously busy and other times they have no lines at all. From what I've observed, their longest lines are usually during lunch... especially on the weekends. Highly recommend getting there before 12 if you want to barely skip their rush hour! I could be wrong, but I also believe it is cash only. So make sure there's some Jacksons in your wallet.", "author": "Johanna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "Good food, bad service. \n\nIt was night and day coming here the two times that I've been. The first was a weekday afternoon with NO ONE. The second was a PACKED weekend. So I would recommend coming on a slow weekday (if you have the time). \n\nAll and all food was great. I loved the hand crafted noodles and flavorful broth. I don't exactly remember what I ordered, but you can't go wrong with any of the noodle soup dishes. Though I have been warned that there are apparently two chefs that make the noodles and one of them don't cut the noodles. So be prepared to eat a ridiculously long strand of noodle. You can request for a pair of scissors, but I don't recommend it because they were kids paper scissors (how unsanitary). The best bet is to ask them to cut the noodles prior when you're ordering.  \n\nOn to the bad service, when I did come back that second time I wasn't expecting such a long line. Taking into consideration that it was a weekend, our group didn't mind waiting for a little bit. But the wait got ridiculous, because the owner/server kept on letting people he knew cut us in line for about 30-45 minutes. I can understand that you would let people you know in first as a courtesy but after awhile it was just unfair to the rest of the patrons. After that our table was largely ignored because none of us spoke mandarin Chinese, so of course getting service was difficult. And when we were finally serviced (kind of) they were a little short/blunt with us. \n\nI would have given this place more stars if it wasn't for the service. Eaters beware!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "I only come here for one thing and one thing only: the pork and chive dumplings. \n\nI've been in love with them ever since the first bite after my roomie introduced me to this place since it's so close to Grandma's Saloon where we have our league nights for pool on occasion. It's so delicious and surprisingly not oily at all! Very well made and super cheap (12 dumpling for $6.99).\n\nOnly reason why I docked a star is cause I never eat inside of the restaurant itself which is semi cramped with only a dozen tables or so available and also because I've ONLY tried the dumplings, nothing else. I docked another star cause I usually only order pick up which is a feat all on its own because they sometimes have a difficult time understanding English so it takes me longer than I'd like just to place a pick up order over the phone. Other than that, it's worth the struggle. I find myself finding every excuse I can, if I seem to be passing by Taraval, just to make a quick pit stop for those damn dumplings.", "author": "Alexis A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "I'm glad I have Chinese friends who explore restaurants and bring me to their favorites. The food here was great. Tried an assortment of pork and shrimp dumplings, pork pot stickers, beef pancake, and noodles (hello carbs!). All were delicious, but the spicy beef noodle soup was my favorite. It definitely has a good kick to it, and the noodles were chewy and fresh. I wasn't a big fan of the pork and fungus noodle, as I thought it was too earthy and bland. The beef pancake was crispy and fried and amazing, though I'd weigh a lot if I ate that every day. Dumplings and pot stickers were quite large, and stuffed full with meats and vegetables.\n\nService was just fine, once we were seated. It did take them a long time to turn over tables, which is too bad when you have 15+ people waiting outside. I recommend being persistent and checking up on the list--I think a group or two who came later were seated before us, just because they were hovering around the hostess stand. Not a lot of room to wait inside, so bring a jacket just in case you have to wait outside. Looking forward to going back!", "author": "Alison S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-11", "description": "I ordered dumpling and noodle to go, it just spent me more than 30mins, the most important thing is nobody was inside the restaurant, so I just don't know why they just looked like didn't want to cook my food. So bad experience, it made me not come here again.", "author": "Chan Kuei C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-22", "description": "I came at around 5. It's 6:10 right now. Still waiting. They haven't even started cooking my dish. \n\nWill not be returning. Any place that takes more than half an hour to make freaking ramen is a no-go for me, hand made noodles or not.", "author": "Stacey D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-19", "description": "Several new restaurants have opened along Taraval Street, this is one of them. Long story short, I definitely had better with better service. Since it is a new restaurant and it is sort of small, it is often packed with people. However, the table turn over rate is terrible (probably due to the lack of staffing), they will leave tables uncleaned for at least 10 - 15 minutes (at least when I was there). \n\nWait list, forget about that! They did not follow it whatsoever! On the day I went, my family and I waited over 30 minutes, we were pretty much next for a table of 3. Somehow, after  they cleaned the tables, instead of going through the list, they asked people \"how many people are in your party?\" And then proceed to seat people. The family they seated first, arrived well-after we did. SERIOUSLY?!? Oh hell no! Luckily, I was standing inside the restaurant and demanded we be seated since we were next on the list. Originally, they offered us 3, one of those tiny table for 2 people. I said, no and requested a the four people table that was open. After we sat down, it took at least 10 minutes before we received a menu or water. \n\nFood-wise: It was blah for me. I have traveled to China and Taiwan before and had hand-pulled noodles. It definitely cannot compare, but compared to U.S. standards, it is quite crappy.  We ordered the Liang Pi (a cold noodle dish popular in Northern China and specially in the city of Xi'an, it is very refreshing to eat on a hot day!), dumplings, scallion pancake, one hand-pulled stir-fry noodle with lamb, and one hand pulled noodle beef broth bowl.\n\nThe Liang Pi was a let down. The noodles were horrible and the flavors just did not mix well, it was very oily. For a dish like Liang Pi, the noodles itself is very important. As for the dumplings, the skins was slight tough and the pork filling tasted funny (not in a expired way, but flavor-wise). Also, the stir-fry noodles with lamb, the flavors are interesting, its main base is a tomato sauce. The only two dish that I thought were decent was the scallion pancake and the beef noodle soup, you cannot screw up on the basics!\n\nFood: 1.5/2\nService: 0/5", "author": "Wing Yan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-12", "description": "I'll admit the noodles were good, very chewy and unique. However, Shandong Deluxe made so many missteps my family will never go back. \n\nService was meh, we got cold tea and none of the waiters wanted to look at us when we tried to flag them down for extra bowls. The decor was confusingly Japanese for a Shandong province restaurant, and fans were constantly running so everybody in the restaurant was sitting around in their North Face jackets. The smell of the restaurant was just bad, as if we were sitting next to a bathroom or fish tank. The table top was visibly dirty, and the teapot was broken but repaired with a mind-bogglingly ghetto/ingenious rubber band and toothpick contraption. \n\nXinjiang noodles with beef: The flavor was ok, but the sauce didn't adhere to the noodles well. The vegetables in the dish were a very random assortment. It's like they were trying to make a pizza and dumped button mushrooms, tomato sauce, garlic, and bell peppers together before realizing they were running a noodle house. The bell peppers and tomato were cut up in a way that made the dish not cohesive with the celery or beef.\n\nBeef stew soup noodles: Tender beef, meager vegetables, plentiful noodles, and SALLLLTY. \n\nNoodles with spinach dumplings: Good dumplings, bland everything else. \n\nMy parents and I all wrestled with the noodles' length, which were a good two feet long. You cannot slurp a noodle of that length. You must pull it gamely into your mouth, inch by inch, like a snake eating another snake. We grew increasingly exasperated as our meal extended into dozens of meters, each bite turning to rubber between our tired jaws. We tried to order some rice pancake dessert, but the waiter said the wait would be half an hour, so we left. My mom tried to be optimistic and said we could get the pancakes next time, but everyone knew there will never be a next time.", "author": "Skye L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-12", "description": "These people have no ethic and moral to be in the restaurant business. I'm fine with a restaurant that doesn't offer any good customer service. I'm also OK with dishes that aren't in the best of the world but  \n\nDON\"T LIE IN FRONT OF MY FACE SAYING THAT THERE'S CHICKEN IN THE FRIED RICE WHEN I SEE NO CHICKEN ! \n\nHere the story goes...\n\nI requested a refund because we waited TOO LONG for it! They even want us to leave and let other customers to take the table. We were fine too and  waited another 15minutes outside. I went back in to cancel the order as soon as I know that they haven't start cooking it yet. \n\nTHEY DO NOT WANT TO REFUND and insisted to wait for few minutes.... \n\nWOO HOO.... chicken fried rice is ready! \n\nI asked them, WHERE IS THE CHICKEN? I DON'T SEE ANY CHICKEN??!!!! THEY SAID CHICKEN IS INSIDE! \n\nBULLSHIT! \n\nThat's how I got my refund back! This restaurant doesn't deserve any stars. \n\n(SHOUT OUT) This is America not China. Don't you ever use your dirty tricks to cheat people. You are making the rest of the chinese world look bad!\n\nFood wasn't great at all. It's just the hype of \"free styling noodle in the air\" with their photos on it. Other dumpling & noodle places are better than them.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-07", "description": "I write reviews either when something is right or horribly wrong, this place was just barely horribly wrong. \n\nFood was meh, I liked the dumplings, the skin was nice and el dente, xin jiang was mediocre and the intestines were oddly soggy. \n\nPlates, cups, chopsticks were all dirty..  Had to give the another wipe down, tea water was lukewarm and didn't even brew the tea bags. \n\nThis place needs a lot of improvement.  But not a bad option if you are craving for some dumplings and hand pulled noodles. \n\nIMHO, Yolo somewhere else if there are alternatives.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-06", "description": "Food: I ordered the beef tendon noodle and was pressured into getting the dumplings. 3 Stars.\nService: A big WTF. -1 Star\n\nThe food is okay; adding that spicy chili sauce they had definitely made it better. It is also a large portion. For the dumplings, I definitely had better. It is nothing special. \n\nService-wise, the staff made me super uncomfortable. Just entering, the auntie that works there seat us down, gave us 2 orders of dumplings, told us it was still fresh they just made it, and told us to eat it. I was confused and absolutely clueless at what's going on at that moment. I kept asking the auntie how much was it. She did not answer. She told a younger female server to come to speak to us. My friend and I kept asking how much are the dumplings, she did not answer. We ask if it's on the house or they're doing a promotion deal because we were the last customers of the night...After a 5 minute exchange about the dumplings, she finally said it was not and took out the menu and told us the price. Afterward, she said they are willing to do buy one get one 50% off. Feeling forced, the auntie was staring us down, we took the deal. We just wanted to order the noodles, but it looked as if she didn't even want to show us the menu and basically just told us what to order.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "We didn't actually see anyone pulling noodles, but the kitchen was out of sight.  These are DEFINITELY hand pulled noodles, something very hard to find in SF.  We had the \"spicy\" combo seafood and pork noodles (wasn't that spicy, but very tasty) and the pork, shrimp, and chive dumplings.  Good stuff.  Also tried the chive pancake - really good, huge portion.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-15", "description": "Another amazing restaurant named Shan dong in the sunset? Yes. Delicious hand pulled noodles in a yummy broth.", "author": "M-E C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-04", "description": "Food is good, but service is horrible. Expect waiting very long (we waited over an hour tonight), grabbing your own menu, and along a least a dozen times for water (they didn't give us water when we were seated). \n\nDumplings, hand pulled noodles, and the beef pancake are the only reasons to come here.\n\nIf you want better food and great service, don't waste you're time coming here. Just go to Shanghai dumpling house on Balboa.", "author": "Teresa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-29", "description": "My mom's dad was originally from this province of China before they immigrated to Taiwan so she knows a thing or two about this type of food.  We ordered XLB and I think this was one of the soupiest dumplings I've ever had!  We also got that spicy noodle dish, I forget what it was called.  Most of the other tables also got this noodle soup dish and I loved the hand pulled noodles but other than that I left most of it for my mom and dad.  The green onion pancake was delicious although a little oily.  The chive stuffed pancake was also good but it was chive overkill for me.  We also got an order of shrimp fried rice for my boyfriend which he polished off fairly quickly, (so much for leftovers).  We also got the shrimp, pork dumplings which were also very good.  \n\nEverything we ordered was good but there were a bunch of things not available on the menu.  I wanted to order the beef chow fun to take home, no, they didn't have it, then the rice cake, no to that too.  So rice it was.  \n\nThey gave an honest effort with the decor and it was nice compared to other hole in the wall chinese restaurants.  We will definitely be coming back.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-08", "description": "Same as king of noodle. They took over the (recent) Doraku Ramen. Yay\nFor the noodles and Shanghai dumplings--hit or miss.. some days it's cooked perfectly...some days the noodles are overcooked and/or the dumplings aren't juicy.", "author": "Miss J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "Our family loves this hole in the wall restaurant. The dumplings and noodles are delicious.  Have a glass of water handy if you're ordering the spicy beef noodle soup.  \nService is lacking, but the food makes up for it.", "author": "E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "They have really authentic dumplings that I've ever had in the San Francisco Bay Area. Even compared to some of the great dumpling places in China, they may still be able to get their spot on the top list. \nWe only ordered beef dumplings, leek shrimp dumplings and Xinjiang chicken. I also ordered beef dumplings, leek pork dumplings and cabbage pork dumplings to go. Beef dumplings are by far my favorite. It's super juicy and has very rich flavor. \nAs for the service, they only have two waiters/waitresses and it does take a long time from start to finish, and there is at least half an hour waiting time. I would usually give four stars in this case. But since the dumplings were so good and blew my mind, I would totally recommend this place!", "author": "Dorothy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "All of the northern Chinese specialities are excellent: hand pulled noodles 手拉麵，dumplings 水餃 and the cold noodles 涼皮.  Especially amazing was the discovery that they have Xi'an Cold Noodle Salad \n西安涼皮. This dish is tangy and luscious and has little bite-size morsels of gluten that perfectly absorb the vinegar and  sesame paste sauce.  \n\nI lived in China for three years and I am pleased to go to a restaurant where I hear witty, fast spoken Mandarin. The customer service is quick and straight forward. They are able to accommodate one larger group table that is served giant portions of delicious smelling food. \n\nEvery time I go I look at all the dishes to see what I will have next time I come. Welcome to the neighborhood!", "author": "Jimi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "This place makes great handmade noodles. We always get their chicken chow mein and scallion pancakes. The beef rolls are good too. We like the pork shrimp and chive dumplings. Great garlic hot sauce. We go here regularly.", "author": "Marica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-05", "description": "We got the beef stew noodle soup. Sadly, they barely added any meat and the broth was tasteless. I had the mapo tofu here before and this time around it didn't have the pork and literally tasted like the jar of mapo tofu sauce from the grocery store (super sour). Pork and spinach dumplings were typical. Overall this dinner was a bummer.", "author": "Kob A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-14", "description": "I was in the area and needed some food TO-GO... (Giving 2 stars because they were willing to take my TO-GO order.) I actually made it 5 mins before closing. It was a packed house...There were still a ton of patrons. The barely English-speaking waitress told me that the kitchen was closing and needed me to order immediately. She didn't bother hiding the fact that she was irritated and rudely rushed me to order. Being my first time there, I asked her to suggest a noodle dish. She recommended the Xinjiang Noodles. So I took her recommendation and also ordered the shrimp with chives dumpling, green onion pancake and mongolian beef. Spent $30 total. \n\nAs I waited for about 10 mins, I watched the same waitress turn away a couple that wanted to eat there. Astonishingly, I also watched two separate goups walk in that seated themselves. At the time, the waitress was in the back and didn't see the two groups walk in. However, I witnessed the whole thing unfold and saw her extremely pissed off reaction when she discovered what happened. She ended rushing them through their order as well.\n\nAnyways, I got my food and went home right away to eat it. To my utter disappointment, everything was ridiculously nasty. With the exception of the shrimp dumplings that were tolerable. I am not a picky eater. But even with my asian palate, I couldn't bare eating the food. The food was just ridiculously flavorless. The worst dish was the Xinjiang Noodles!!! I couldn't believe it!! I even tried reviving it with some soy sauce and hot sauce but it was so far gone that it was beyond edible. The mongolian beef was practically just as bad. And the green onion pancakes were nothing to rave about. Not even sure if they deserve 2 stars and $30 bucks..... Bad service plus bad food should equal to zero stars. Not going there again.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "Cold, long wait, on a Friday evening. Small restaurant and line doesnt move very fast. Overall food was good, we tried about 6 different things. Highlights were the pork dumplings, potstickers, the beef roll, and the spicy beef noodles.\n\nWe didnt love the hot and sour soup.\n\nThe prices are insanely good.\n\nI'd go back\n\nWe thought the service was attentive and quick, not sure why all the bad reviews on service surround this place.", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-22", "description": "An extra star for the hand pulled noodles alone.  My relatives and I really wanted to try this place out for lunch today. We got seated right away and we ordered one beef stew noodle bowl and one beef tendon noodle bowl.  Both arrived promptly and in fairly good sized bowls. The broth was well made, not overly salted with additives. The hand pulled noodles were soft and chewy. I loved it! Warning, the noodles were crazy long, so be prepared to ask for scissors or a knife to cut them. My beef tendon were soft and succulent, just this side of gelatinous heaven. It came with Chinese mustard greens for color and balance.\n\nWe also ordered the xiao long bao, which has the juicy broth I expected, but not the ginger flavor in the pork meat which I didn't expect. I'm not a fan of ginger so I was taunted by the little morsels...didn't help that I had 3 baskets of xlb at Shanghai Dumpling King the night before...xlb overload!\n\nI wouldn't recommend the beef pancake, mom assumed they would be pan grilled, not completely fried up into a greasy brown hot mess. The meat filling was good but the over fried dough was a total turn off.\n\nService was brisk and the parking was pretty good in the afternoon.\n\nCash only!", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-15", "description": "I wish I could give no star. Words cannot explain how disappointed I am right now. \n\n- the WORST food ever(noodle? What a joke. They will serve you some flavored shoelaces.) \n- no consideration for the customer \n\nPlease don't go. Just, please.", "author": "Wakako K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-31", "description": "Had the preserved vegetable pork noodles, dumplings, 生煎包, sesame sauce cold noodles. Overall the dishes taste very authentic and tasty. If it's just food I would've given 5 stars. We didn't have the best dinning experience as tea cups were dirty and the service was the greatest. I would definitely come back again on a weekday.", "author": "Da D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-25", "description": "Been coming here the past few weeks with classmates during lunch break.  \n\nTypically we have about 4-5 people which allows us to order a variety of dishes.  \n\nEverything from appetizers to dumplings to large massive chicken.  \n\nTheir opening dishes are pretty good and are probably the best out of the bunch.  I really recommend the cold cucumbers in garlic and hot oil beef and tendon.  \n\nThe dumplings are aiight, not too much better than store bought frozen ones from 99 ranch.  \n\nWe also often order the stir fry noodles and other noodles but it's pretty standard faire and nothing to write home about. \n\nAll in all though, this place offers genuine China Chinese dishes at a standard price point.  Not many of these kinds of places around but more and more are popping up, competing with the existing cantonese style Chinese restaurants.", "author": "Dennis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-13", "description": "Nice interior design.  Ordered E3 because the waitress said it was there most popular dish (celery, tomato and some spicy sauce).  The hand pulled noodles was pretty good.\n\n Cash only", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-24", "description": "I come here so often, very good servers and very Delicious dumblings ! Shangdone dumblings are so famous in China as well!", "author": "Charles K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-28", "description": "Ramen House changed into Dumpling House. Same decor (even with the ramen plaques) but better food. Small place so you can see the fresh dumplings being made in the back area of the hallway. I was mildly surprise at how much I liked their noodles. I have been going back for a quick meal of warm noodle soup and hot dumplings.\n\n* Spicy Beef Noodle (4 of 5) $6.95 - Flavorful and filling. I think this is my favorite spicy beef noodle in the Sunset Area. I would like more beef, but they give so much noodle. The spiciness it not too hot, but not too mellow. And not to sour, as some places serve it. It has a great amount of noodle and I really like the noodle choice. It is chewy, stringy, and fresh tasting. \n* Pork and Chive Dumplings (12) (4 of 5) $5.95 - Fresh and tasty. I have no complaints. The freshly cooked dumplings are tasty. Best to eat it as soon as it gets to the table.  \n* Black Bean Noodle (2.5 of 5 ) $6.95 - It is a pass for me. They use the same noodle as the soup one, but their sauce base is dry and not that tasty. Their black bean sauce does not compliment the noodle or coat it to be a good tossing noodle choice. Too bad. I was really hoping this was another hit. But it is a pass for me. I will keep with the noodle in soup.\n\nBeen going back often when I want some hot noodle soup to warm up from the cold and wet winter. I don't recommend for large groups since it is a super small place. Good for 1-4 eaters. Cash only.", "author": "Janice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Really authentic northern Chinese cuisines! Like the homemade place. Feels like sitting in the dining room in my home with family!", "author": "Savi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-16", "description": "Excellent lamb noodle dish.  The meat was tender and the noodles were chewy.  This time the noodles were easier to cut using the spoon, since the noodles are so long that it is hard to put in a small bowl for sharing.  Chive dumplings was also good and tasty. \n\nService wise you have to actively ask for the check, boxes, small bowls for sharing, and to order.  I guess you don't expect the greatest service here, but I thought they could definitely improve on taking initiative to engage their customers.", "author": "Ben S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-20", "description": "Here is my experience. We were two people and ordered two dishes. One is a simple Chinese dish (need maybe 5 mins to cook)  and other is Xianjing style chicken.( all the problems from this dish)\nWhen we been there just six customers at there and they separated each different tables. I thought our two dishes would be on the table fast but the fact was a joke. Wait about 1 hour just for that Xianjing style chicken so I just let their staff know( yeah..it was staff..cuz their waiters were disappear. ) Finally, I run out my patience and also, I found their waiter which is a Chinese boy. I asked how long should I wait a chicken usually, and he said,\"30 mins at least\". OK, fine, so why didn't you tell me when I order this? he said\" I thought you guys already know that\". Oh~~~ this is my first time been there and why should I know before? Also, it was your think..SO..WHO ARE YOU? A SEER?\nBTW, their food just so-so. Trust me, cuz I am came from northern China if your geography was get an A, B or C you will be know what I am talking about. \nDo NOT waste your time and money put their poor little business in. Their food or customer service beneath each Chinese restaurant around SF and Bay Area.", "author": "Young L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "Yes yes yes!! Yum this is amazing food I love it when I'm hungry I can war up to 5 dumplings", "author": "Archit B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-24", "description": "good food, but really bad service. make mistake all the time, give us wrong order, cancel our order when the chef argued with the restaurant keeper.", "author": "Paine W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "Oh grandma in back making the dumplings how i love seeing you there and grandpa in the kitchen cooking... the patriarch and matriarch of the family hold this place down...\n\"Yes the xiao lum bao are good... , the hand made noodles... the cold salads of black funger, cucumber, or bean thread in a light sesame dressing..\nit's experiencing a incredible popularity thing so be patient... the staff is nice and trying their best... and well... i love it...\nI have eaten here thirty times in the past couple monthes i'd say and i'm not growing tired of it... although their cousins are running the shanghai pancake house up the street and it's great too!... it's funny their items don't really take away from the other.\nGreat people Great food Great times...", "author": "Adam O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "I always come here when I don't know where or what to eat. Yes, it's a small restaurant so the wait could be long sometimes. And parking could be difficult especially around lunch or dinner. But this place has the best northern style Chinese food in town and I have tried everything on the menu.\nI always have the fish dumplings and their noodles. All the noodles are hand made and taste just like the one I had in China. I also like the beef pancake. It's so juicy and flavorful. If you come here with a group of four or more, the xinjiang style chicken with noodle would be a good choice. It comes with potatoes, green peppers, dried chili, and of course, chicken and noodles. The noodle is different from other dishes. It's flatter and chewier and larger. Two of those noodles and some dumplings would be more than enough for me. But if you like foods with strong flavor, you should definitely try this one. \nI would recommend anyone who wants to try authentic northern style Chinese food to this place.", "author": "F. Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "It's great to have this restaurant open up on Taraval Street   I'm told that the chef here is from the Shan Dong Restaurant on Geary between Arguello and 2nd Ave. Also the menu looks similar to that from the House of Noodles on Irving near 18th Ave (and I also recognize one of the staff as being from there). It's the same good noodles and decent dumplings.\n\nThis place may got pretty busy now because it's fairly new. As a result, they're service can be slow after ordering. Hopefully they work out this kink.", "author": "H K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-23", "description": "I wouldn't recommend coming here with a big group. This place was tiny and even some of the two-person tables were cramped. We had to wait a while before my group of nine was fully accommodated. They let us combine two big tables together but we had to wait about 40 minutes for that to be available.\n\nI ordered the zha jiang mian. The noodles and sauce were good, and the tofu was okay. It didn't really have a lot of meat though. Other people at my table who ordered the same thing felt it could've used more pork too. Serving size was decent considering the price. We also ordered xiao long bao for the table. This place obviously isn't a place which specializes in it so I didn't expect much. They were pretty average, mostly because the skin was a lot thicker than what I'm used to.\n\nThe service overall is pretty friendly, especially considering that our group was large and most people in our group weren't Chinese. The waitress seemed to have trouble speaking English and would constantly speak Chinese to me and one other person to translate her words to everyone else. She was able to take our orders in English but seemed confused when people would ask her questions. Not sure if anyone else had that experience but it might be something to be aware of.", "author": "Allen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-16", "description": "Wasn't sure what type of restaurant this was. \n\nCame in for some lunch with my family and we were seated in the corner table. Why do I mention this? Oh because the corner table couldn't have been more cramped! The seats at the table were so cushioned that when I sat down, I sank into the seat and felt that the table was very high and I had to put greater effort to bring my arms up and over the edge.\n\nThe food is so-so....typical greasy Chinese food. We ordered Mongolian beef, black bean noodles, the seafood stew and an order of Xiao Long Bao. I did not really enjoy anything here honestly.....I'm not saying the food was terrible, I just couldn't tolerate the grease here at all. What made it worse was the restaurant became somewhat smoggy after a few more tables filled up. It was very uncomfortable to be sitting in there, breathing in those fumes, while trying to consume what we could. \n\nService is hard to get. I think it's primarily because we don't speak Mandarin, but it could also be because we were seated AT the corner table.\n\nI don't think I will be coming back anytime soon.\n\nC", "author": "Alex T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-20", "description": "Was very skeptical about coming here. I'm glad I got it out of the way for lunch and not dinner. \n\nI got 4 things:\nChicken chow Marin\nBlack bean noodles\nChicken dumplings with napa cabbage\nTofu skin salad\n\nI enjoyed the tofu skin salad a lot. It was very good! The rest of the dishes were unfortunately too salty. The dumplings too!! \n\nIt's very weird that they don't include any serving utensils for their dishes. It's very much a struggle to get food on your plate. \n\nThey have a hot sauce which is a rip off of kingdom of dumpling a few blocks down, except not as spicy. \n\nThe service was good even for one server. \nIt's new so they're working their kinks out. \n\nI give them 2 stars for the tofu salad and the server. \n\nI'd probably won't be back anytime soon.", "author": "J V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "Omg! Their foods sooooo good! \nI ordered onion pancake, mutton stewed noodle and spicy beef tripe, btw this is my first time try beef tripe, taste is wonderful!\nService is good too!", "author": "K. J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-29", "description": "Not bad.. I tried it on the recommendation of some old Chinese folk-friends of mine.\n\nThe noodles itself were fantastic. Chewy, freshly made, and overall quite good in the noodle department; you can see the cooks making the noodles behind the kitchen.\n\nThe spicy beef broth on the other hand was a bit oily and tangy for my liking. This may be more of a taste-issue on my part, so please take the review with a grain of salt.\n\nI guess Chinese noodle soups and my taste buds aren't meant to be. I wasn't a big fan, so I just picked out pieces of bok choy and noodles and left the rest. (8$ lunch)\n\nThe service was good; rather sporadic but what do you expect for a cheap eats. Clean eating area... it seems to be a neighborhood spot for local Chinese peeps though.", "author": "Roy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "Skip the xiao lung bao and go for the dumplings, so juicy and tasty.  Economically more bang for your buck.  Leftover dumplings are even juicier. Everything is made to order resulting a bit of a wait on food.  If you sit in the back, you might see them pulling the actual noodle.  The deluxe noodle dish cost $19.95, good for four people, fat flat noodles with supposedly the whole chicken with two feet.  Chili is swimming among the big square plate.  I prefer the stir fried noodles over the soup ones.  The black bean noodle was really good the last time with tiny little tofu on the bottom.  I loved the fried bao.  Try the garlic chili sauce next to the soy sauce and vinegar.  It adds a zing to your food.  Excuse the service, there's only two people running around.  Don't bring more than five people or else there is a long wait or you have to sit on top of each other.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Not sure why the reviews are so bad. I went in here today for the first time and I enjoyed it. I ordered the beef noodles, the potstickers and the cucumber salad. The noodles were chewy and homemade, the broth was light and the beef was tender. The potstickers were my favorite, very juicy, chewy dough with lots of meat. The cucumber salad was average, I have had better. The place is small but decent, I have been to smaller restaurants. The service was average, it is the typical chinese restaurant service so don't expect much. I will come back. And I will recommend this place.", "author": "Melissa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-17", "description": "To be clear, I am not rating this restaurant based on how the food tastes. Mainly because I never got the chance to taste the it!! Sat down and was able to have my order placed within a couple minutes of deciding what I would like. Thought to myself, \"the server is nice, and the service is pretty quick.\" Then it just went downhill from there. Waited half an hour and nothing had come out, so I inquired about our food. The server went to check after he finished up what he was already doing. That took about 10 minutes and came back to tell us that he have out order to another table. A little frustrated that they didn't notice we were sitting at a table with no food for so long, but it happened so nothing we could do about it. Now I'm expecting that they would at least rush to cook our food first since they made a mistake but nope. Sat an extra 20 mins and we said f... It.", "author": "Alfred W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "It's a shame that I will probably stop eating here. Their food is pretty good but it was a nightmare picking up a Togo order. \n\nI waited 50 minutes to get my food after calling in ahead of time after work. I constantly checked to see if my food was ready and they were trying to ignore me.\n\nHopefully they can get service right here.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "I found my grandma's taste in this restaurant. Even though I am Cantonese, born and raise in Hong Kong. My mother side grandparents were originally from Shandong China. I was eating Shandong food more than 1/2 of my childhood. I guess I am familiar enough to talk about Shandong cuisine. I've read about the other comments compare noodles or dumplings from Beijing and Xi'an. It is hard to compare because Shandong and Xi'an or Beijing styles are very different . I highly recommended the pork and napa cabbage dumplings and Wan Tou ( 山東大饅頭 ) ( the big Shandong Bun) which is a real big shandong bun, nothing like the soft little buns you will find in dim sum place. I also like the Shandong bun with pork, napa cabbage and edemame beans inside which was recommended by the owner ( they lady making dumplings at the back) after I've had a nice conversation with her. I 've lost this taste since my grandma past away back in the 90s. I felt touching which brought me back a lot of good memories because of this pork bun. My grandma made this bun exactly the same way. \n\nI guess I created my fusion way to eat this plain big buns when I was in kindergarten and I would like to share with everyone. I used to cut this bun into pieces, toast it and put butter on it. Give it a try, taste very great even though it does not sound very healthy. \n\nI really want to give five stars but I took one star out because of one waitress. I am not sure which part of the world she's from? I ordered 7up, she looked very lost and asked me what was it. So I asked for Sprite and said it in Mandarin, she brought me a glass of ice water? I asked again for Sprite, she looked very lost and asked the other waiter to help me. The other waiter apologized to me and told me she was 3 months new to the country and not familiar with the names of sodas in the US.... Huh?? What can I say?  I've been to different parts of China since early 80s, that girl looks like she is in her 20+. I saw 7up and Sprite most of places in China. Plus,  I have to speak English, Cantonese and Mandarin in my job almost everyday, no one ever complain about my Mandarin even though it is not my first language. I am confident that my Mandarin is understandable due to my family background. I wonder if that girl was from China? Venus? or Mars? \n\nOther than that girl, I will give 5 stars. I like the lady owner a lot, she is very nice lady.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "Restaurant: Cash Only, although there are several banks nearby\n\nService: Server took our orders late and ended up serving us food that was supposed to be for the table across the room.\n\nFood: \n* Subpar compared to the other dumpling places around the area.  \n* Pan-Fried dumplings looked delicious, but lacked in flavor.  \n* Shanghai soup dumplings were a huge disappointment, as 4 out of 6 had bursted before it arrived in our table.  \n* The chive/pork/shrimp dumpling as well as the pork/corn dumpling was okay, but couldn't really tell the difference in their recipe from Kingdom of Dumplings further down on Taraval close to the beach or King of Noodles on Irving. \n* Now that I think about it, even their hot sauce they served was shockingly similar, but the hot sauce here had intensely more garlic, and has more of a oily creamy texture.\n* Their beef fried pancake was bland.\n\nThe food was fast, we got all of it within about 13 minutes or so, and the restaurant was pretty clean.  But to be honest, it was somewhat of a let down because there are already two really good dumpling places around that offers better food at similar price points.  \n\nThe Shanghai Soup Dumpling fiasco was the most disappointing of all.  If you can't get that right, please, for the love of humanity, don't plaster that dish as your house specialty on your window.\n\nI haven't tried their noodles yet, so I can't review this, but right now I'm seriously questioning whether or not I should go back at all.  Perhaps it's about time to refocus the kitchen team back to bring back decent flavor in their food consistently.", "author": "J T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Love the dumplings here! Tried a lot of times and different kinds! I often buy frozen ones in bulk after I had dinner there so I can make them at home.", "author": "Z L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "Food here is super delicious. Authentic Northern Chinese cuisine reminds me so much of Xi'an city in China.", "author": "Yining Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Been here a number of times as its closed to where I live right now. The northern chinese is pretty good! Try the hand pull noodle! And 羊肉膜！", "author": "Alanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "I almost don't want to leave a review for fear of it getting too popular but I love this place!", "author": "Jessica G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-13", "description": "These people have a nasty attitude. My name was on the waiting list, but the idiot servers kept seating the people that's not on the list first. After 45 minutes of waiting I got fed up and went in to voice my concern. They told me I can leve if I don't like it. \n\nWhy do we keep supporting these people that treat their customer like crap?", "author": "UR D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Love the Xin jiang chicken（新疆大盤雞）. The best Chinese food restaurant in Bay area", "author": "Hx T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Simply put, you are not here for the service, you're here for the food. Top notch dumplings, home made noodles, and pancakes. One of my favorite places!", "author": "Nelson S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-28", "description": "The food here is good...but not the service, me and my girlfriend went here to try their chicken dish, which cost $20 and we ordered other stuff. However they made us to wait for over 30 mins for the chicken dish, but the table behind me some how got the chicken dish before us even they came much later than us. During the time we wait, I tried to ask the one of the lady to check out our order, but all she said was I knew you had ordered one. \"Nice\" services.", "author": "Di W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-25", "description": "Service is bad. Half of the furniture are broken in some way, the table we were sitting at was rocking and the chairs were making a sound. There are only two kinds of noodles in this place, the thick and the regular. Ordered the wonton noodles and another friend ordered the Chow Mein, same noodles but prepared differently. Came back another day and wanted an order of the chow mein to go, they gave me chow fung. Portions are large depending on what one orders.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "The portions are pretty big and so is the bill.  I guess I always thought Chinese food is cheap, but that is no longer true.  $45 for 3 dishes.  Food taste pretty good here.  But the quality of the meat is almost as bad as street food quality in China.  Noodles are done well.", "author": "Byron L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-15", "description": "After looking at my good friend Cindy FB posting.   I've too decided to have dinner here over the weekend.  The food was OK,  but the restaurant COLD air intake/exhaust was miserable.  I've had to ask the waiter to bring me some hot water so I can warm my hands.  Shan Dong Deluxe Restaurant Fail :(\n Fix that fan of yours, or use your restaurant as a freezer.", "author": "Jeni F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Large portion and tasty food. \n\nXin Jiang Noodle is a must order here. Hand pulled noodles with a choice of beef or lamb stir-fried with celeries, bell peppers, onions and tomatoes. Lamb is very tender and we love the taste of this dish.\n\nDumplings and Xiao Long Bao are just ok here. It's pretty standard and there's not much to write home about. \n\nThe restaurant is new. Service can be a little slow, but the food comes out very fast after you place an order.", "author": "Saran R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "We ordered to-go twice within a week as we liked it the first time. My husband is a picky eater when it comes to Chinese food. We love the handmade noodle and will certainly go back to them. It is however, a little on the salty side for us but again this is personal preference.\nWe did not dine in but the server answering the phone was nice and my husband said the waiter/waitress were very friendly too when he picked up. There was a nice older lady who even opened the door for him when he left.", "author": "Chung T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-20", "description": "Came here for lunch on a slow Wednesday.\n\nThe waiter stick us in a corner with a table with space only enough for 2 bowls of soup, while the rest of the restaurant is completely empty save for 1 table.  The waiter looked like he's got better things to do elsewhere, if only the customers would be considerate enough to stay away.\n\nThey are supposed to serve Northern Chinese food so we ordered dumplings and hand pulled noodles among other items.  Let's just say, frozen dumplings from Kingdom of Dumpling and Korean instant noodles are pretty good options, too.\n\nThey have a whole range of stuff, if you're in the mood to try more 'adventurous' items.\n\nGood luck!", "author": "daphne w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "The DApan Ji is good, but took long times.", "author": "Wei H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "Love, love, love the soup here, the noodles are delicious and the dumplings are always moist.  \nThe service has always been fine when we've gone, they've even answered the questions my bf had about another table's dish on more then one occasion. \nThis is my new go to Chinese food restaurant.\nCASH ONLY.", "author": "Angie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-03", "description": "I ordered the beef tendon noodles to go. Noodles were exactly the right consistency - chewy and al dente.  Soup was good, not greasy. The tendon was too smooth, soft and slippery for me. I like tendon cooked more thoroughly.", "author": "G C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-24", "description": "Xiao long bow is really good! It's freshly made, which takes longer to serve. Noodles are also freshly made in the semi open kitchen. Glad to see Santong style noodle and dumpling place on Taraval street. But, don't expect too much on the service. Cash only!", "author": "L K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-02", "description": "Good dumplings.  Really bad noodles.\n\n\nThis was my second time here.\n\nI ordered the Jajaing Mein: bean paste and pork noodle:\nThe noodles are hand made, but over cooked.  The sauce is watery, one dimensional--as if they gave up on draining the noodles and just slopped a ladle of canned bean sauce.  Instead of finely minced pork and tofu, there were sparse bits of dried tofu and token amounts of meat.  Instead of cucumber of green onions, there were leftover bits of veggies (raw green berms and a course lay chopped white onion.)\n\nThe dumplings were good.  Firm skin, hot, good filling.\n\nThe reason why 2 starts, not 3:\n\n1. Service: the waitress recommended the most expensive items of each section with no consideration to others ordered.  She's also constantly in a rush for tips.\n\n2. The noodles were *really* sad.  For a shandong restaurant, I'd expect decent noodles.  As it is, I could cook better than this as a 12 year old!\n\n3. This is the Sunset district of SF.  Chinese cuisine is expected to be at a high standard.  This is more of what I'd expect in the boonies of Manatoba.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-06", "description": "Went there yesterday, after reading the article in the Chronicle.  A bit disappointed with the food and service.  Small place.  Seems to be family run.  Very disorganize and cleanliness is not so good.  We had to return the plates, cause bits of the previous diner's food was still on the plate.  The teacup was greasy.  \n\nWe ordered the cold cabbage salad.  I was expecting the typical \"bai chai\" with the vinegar and chili spices, but it was a bit different.  Taste was okay and the portion was acceptable.  Their spicy hand pulled noodles soup with seafood was good.  Better than most places.  \n\nWe ordered one of the pan fried pancakes with meat fillings.  The outer crust was burnt and inedible and the inside was not cook and the meat filling was a bit bland.  \n\nThey need to work on service and clean the tables a bit better after each group of diners.  \n\nMy final opinion, food is okay but they need a little more work before they are ready for prime time.\n\nJMHO", "author": "brian l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-07", "description": "This will be the 3rd and last time I am going to eat here, the first time was okay, no complaint.  I had lunch here to day, I order some potstickers and some pan fried bao, the dough was so thick that we had to split them out, we also ordered some beef noodle soup, it was very very salty.  We nicely asked advised them of the salty soup, they added some hot water in there and made the soup then tasted like water, my entire family was not please with the food. I had much better food than this place, this place is really going down hill.  I do not recommend this place AT ALL!!!", "author": "Tiff K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "Zero star. Worst service ever. Was only given one menu for six people. One of the servers asked us to order quickly. I told her very politely that my mom just went to the restroom and maybe we could start with whatever we had ordered and then add more. She then said, \"You'd better hurry because you have occuppied the table for so long already.\" Lady, you want your customer to order from a restroom???\nWe were very upset and my father tried to complaint. She did not even listen but just apologized very loudly without sincerity and just wanted to embarrass us in front of other customers.\nFood was horrible too. We ordered some vegetarian dumplings and pot stickers and there was only cabbage and LOTS of gingers inside. Hello, you are not here to fool native Chinese. \nWould not recommend at all. No more business for them,", "author": "carrie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-01", "description": "Don't even bother to come here, the food wasn't great and the service was beyond horrible. They asked us to pay and leave but we haven't even received all of our food. The table next to us had their $100 bill from the bank rejected and they were extremely insulted. But I guess it just a hour and a half I'll never get back.", "author": "brandon y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-16", "description": "The name and decor of the restaurant is catchy. There is a picture of the owners with Mayor Ed Lee.  You would expect a typical asian restaurant in sf, hot tea, quick service, soup and appetizer served first etc. The table was dirty.  The restaurant did not deliver.  The tea was cold so I asked for a replacement. It was cold. I got the green beans first, it was just drenched in soy sauce and cold. I got the hot and sour soup, it was thin.  The dumplings and bean curd were ok. Had better.\nWe also did not get sauce bowls either.  The service ruined the ambiance for a wonderful friday night. The staff should learn from other restaurants on Taraval about service. Maybe they never dined out at a restaurant.\n\nFirst time in my life I had to leave a low tip.", "author": "Sharon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-14", "description": "I would give this place a no stars if I could.  Consumers BEWARE!!!  I ordered the mushrooms but when it came it it had cucumbers in it.  I let them know I could not eat cucumbers and I didn't want the plate.  Initially I thought that was that, but instead they brought the plate back to me with the cumbers picked out of it.  I had thought they made a new dish for me and bit right into it.  I told the waitress I didn't want the dish and that I am pregnant and could not risk getting sick. She replied in Mandarin \"what there is no cucumbers\".  Then I pointed to the cucumber that i had picked out, and she pretended not to understand.  I replied fine.. I will never come back here again. Then she walked away.  I went on trying to enjoy the rest of my meal, until I heard her talking to another costumer in english..in fact helping him translate English to Mandarin.  After I heard that I was fuming with anger.  I cannot believe HOW LOW the restaurant will stoop to to make a few dollars, really the plate was 6-7$.  I can't imagine how may other corners they would cut to make a few bucks! Unethical would not trust", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "The dumpling is very good, especially fish dumpling, it is so fresh and better than china. And another perfect food is chao ma noodle, a little bit spicy and very delicious!!", "author": "Dalu L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-15", "description": "This used to be the old Ramen Doraku, which was always empty...one morning I was passing by on my way to work and noticed that a new sign had gone up over the old one. Since then I always saw at least a couple customers in there, and even more as the days went on.\n\nWe thought we'd take a chance and visit for the first time last night. The decor inside is pretty much unchanged, but bright and cheery. \n\nWe ordered the pork and chive dumplings, spicy beef noodle soup, and pork with peppers. The overall bill (without tip) came to be about $21, which was pretty good considering the portions! The dumplings were tender, and very plump. I daresay they were plumper than those from Kingdom of Dumpling down the street. Mmm, more delicious porky filling. We were both really impressed with the flavor of the soup noodles, and all three items were really fantastic.\n\nAs longtime devotees of Kingdom of Dumpling (and Kingdom of Noodle) I have to say that we both thought this place was better, based on what we've eaten so far. Even the housemade hot sauce was reminiscent of KoD, but a little bit more flavorful IMO. Looking forward to going back and trying more.\n\nI think one of the cooks used to work for Kingdom of Noodle--anyways, she was very friendly and the food came out quick. \n\nOrder the noodle soups, you won't regret it!", "author": "Bri Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-05", "description": "Chinese restaurants usually get fewer stars than they deserve because of the lack of service but this place has awesome noodles and dumplings and pancakes. Enough said.", "author": "Shis Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-18", "description": "The worst service ever!!!  We placed an order for chicken dumplings and they never told us that they ran out. We had to ask them what happened to our order. We then asked to substitute for another type of dumpling and they came back 5min later telling us they can't give us an order because there are too many customers waiting to be seated. Our kids did not get to eat since they were waiting for their order.  This is place is so inconsiderate when it comes treating customers.  I would not recommend coming here, there are so many other better dumpling places on Taraval.", "author": "Corinna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "One of my fav restaurants. If there is a wait, def worth it! Every dish I have ever ordered has been way beyond good. And if you get Joe as your server, best service ever! :) I have lots of friends who visit the city, and the place I bring them to is here. Favorite dishes are the xingjiang pan chicken, dumplings, & for dessert their sweet pancake!!", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Very tasty and authentic Chinese food! I come here for their hand-pulled noodles and cold noodle. Their dumplings are absolutely amazing too. Can't find anything bad.", "author": "Rebecca A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-04", "description": "This review is primarily for their service and hand pulled noodle dish.\n\nThis place is the absolute worst place I have ever gotten food. Even Dragon's City across the street has better service. Waitress was extremely inattentive and our tea wasn't warm at all. \n\nMy boyfriend and I just shared their hand pulled noodle dish (xinjiang noodle) for dinner. I was looking forward to eating it after all the rave reviews about it. I didn't mind that they didn't de-bone the chicken in the dish, (as a typical chinese restaurant wouldn't anyway), but there was some sort of seasoning/dirt/loose bone pieces the chef had used that caused my mouth to hit a brick wall every time I chewed. My boyfriend had observed what was in the dish and there were little round black balls that were completely solid in the middle. Didn't really know what they were. Most asian restaurants don't give a crap if there is anything wrong with the dish so we didn't bother asking for another one. We ended up eating what we could and taking home the rest, only to further examine that the chef probably had used some huge 'star anise' seasoning, which might have made it difficult to eat. It literally tasted like there were rocks in my mouth. In terms of flavor, the xinjiang noodle was alright, nothing spectacular.\n\nI suppose the other dishes on the menu are just as great, but I have yet to try. I'm sorry but this experience really ruined it for me and I don't think I will be going back here.", "author": "Amanda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-02", "description": "I wish I could give this place a higher rating.  We live very close by and have tried it a number of times since they opened years ago.  Early on, the food was pretty good but the service at that time was terrible (incorrect orders, long wait times).  Over time, the service got better, but the food has suffered.  Out of the last 6 times we have eaten or ordered take-out from here, more than half the time the food was terrible - no flavor, bland and inconsistent textures.  Every once in a while, the food is cooked and flavored as it should be, which keeps me coming back to hope the next time will be better.  I wish their food was reliable and consistent!", "author": "B K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "So I called for take out and had to repeat to the lady 4 to 5 times for my order... She said 15-20min. I went there and waited for ANOTHER 15-20min.  Got home. She got half my orders wrong. I went back and wanted refund, instead she goes thru the order and says that we ordered that. I said I wanted pork with green bell pepper, she gave me dumplings...insisting that I ordered dumplings when I repeated 4 times to her PORK WITH GREEN BELL PEPPER. I remembered for a reason. Honestly if they just provided some kind of customer service I would've let it go. But she didn't even apologize that she did t wrote down the correct dish. If you can't speak or don't u understand English....hand it to someone who can or just don't work there.", "author": "Linda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "We did not have a problem with service. Food was good and fresh. The peanut based chili sauce was good, with a lot of kick. Go for the dumplings and noodle soup, like in kung fu panda. And go early. It's really busy starting at 6PM.\nMake sure you went to the bathroom before heading there\nWill  I come back? YES", "author": "Jean-Yves F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-15", "description": "TL;DR - \"Fuck, I should have went to McDonalds.\"\n\nMy biggest complaint was the Xinjiang Style noodles, a family-style dish with zero sharing capabilities.\n\nSo the noodles arrive, and I was thinking \"this is not looking that tasty. Whatever, it might taste better than it looks.\" So I'm trying to get myself some noodles here and my hand is literally sky high trying to pull these noodles apart. Whatever, not a problem, I will put this bitch down on my plate first and try to slowly pull it out of pile. Oh come on, are you serious? It's not budging and it's all tangled up inside. \"Fuck it. I am trying to eat tonight. I am just going to cut it.\" Bitch. Please. If I knew it was going to be that difficult to just get these thick chewy sauce-lubricated noodles on my plate before even getting to eat it, then I would have not even ordered it.  It was not easy cutting those noodles with a ceramic spoon, I will tell you that. Whatever, the climb is over and I can finally eat. \n\n\"Fuck, I should have went to McDonalds.\"\n\n\nWe ordered the two following:\nPork Dumpings with Green Chives\nXinjiang Style (Beef)\n\nOur total came out to $15. On the way out, I saw this other table (who was there before I came) order the same exact noodles and it was untouched. Hmm... I wonder why. Bottom line is, they don't really put enough thought into what the serve and how they serve it. That's not a problem if your food tasted great! I have been to the dirtiest hole-in-the-walls, but at least those places compensated everything else with the taste of their food.\n\nOh, and one more thing, my girlfriend got diarrhea.", "author": "Douglas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "It has been a long time since I had a satisfying bold of noodles. Really tasty and at a reasonable price. The service is a little unorganized, but generally friendly vibes.", "author": "Ken T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-21", "description": "Everytime I'm standing outside of Hot Pot Garden while waiting for a table, I stare across the street wondering.. \"WTF IS A HANDCRANKED NOODLE??\" This past Wednesday, I finally found out.  Ohhh fresh hand-pulled noodles.. gotcha!\n\nThis tiny place has potential to become a hidden gem after some improvement.  My friend and I walked in at 7:30pm on a Wednesday to a full house. Luckily a large group was finishing up and we were able to snag a table. Unfortunately, it took about 10 minutes for someone to get the table ready.  There are 2 waitresses and an older man who seems to be the owner/manager.  All three were very friendly, but my only complaint is that both girls seemed waaaay too flustered and definitely did not know how to prioritize duties-chickens running with their heads off.  For example, while taking a tables' order, the table next to them interrupted and asked for water. The waitress immediately left to get water without completing the tables' order and seemed to have forgetten about them for a few minutes.  I went back tonight and service was horrible.  This time there were two waiters who were nowhere to be seen unless they were bringing food out or to clean a table. When they did come out, they didn't bother to look around.  It took forever to get our tea refilled,  which was never very hot.  When we got our refilled teapot, the guy was so lazy that he climbed over a chair and stretch over to put the teapot on the table. Wtf?!\n\nMy friend and I ordered the chicken and spinach dumplings, beef pancake, and combo spicy noodles. Let me tell you, this was way too much for the both of us. \n\n-combo spicy noodles: 3.5 stars thick \"handcranked\" noodles in a spicy broth with chicken, pork, and seafood.  The noodles were perfectly cooked and weren't mushy. Warning:these noodles are looooong. I see a lot of complaints about the noodles being extremely long, but chinese hand pulled noodles are supposed to be long. Simply ask for a pair of scissors. The broth had the perfect amount of spice but there was not enough broth and had a crazy amount of noodles. By the time we were done with our meal, the bowl looked untouched. This is definately a bowl full of gluten that will make you stuffed to your neck.\n\nChicken and spinach dumplings: 3 stars. Nicely filled steamed dumplings. They can be plain without sauce, which the waitress forgot to bring to us. They had the perfect ratio of spinach to chicken.\n\nBeef pancake: 4 stars. Yum! A tasty beef patty stuffed inside of a dough then panfried to perfection. Crispy on the outside, meaty on the inside.  I'd give it 5 stars if they werent so greasy.\n\nTonight we had the shanghai pork pao (soup dumplings) and blackbean with pork noodles. You get 6 dumplings for $4.95. They were mediocre, nothing to rave about.  The blackbean noodles seem to a popular item. The noodles were perfectly al dente, but none of us were too fond of the flavor.\n\nParking can be hard since there are a few restaurants along the next couple blocks.  Try to get there right before 6 so you can grab the parking meters. \n\nCASH ONLY. Total bill came out to be $26 after tax and tip.", "author": "Cheryl Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-18", "description": "Great meal for an awesome price. The shanghai dumplings are some of the best I've had and the owners take great pride in their food", "author": "Lindsey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "I lived at Shan dong for 18 years but They still got one of the best dumplings I ever had. The dumpling chef is amazing. She came from a small city in Shan dong and knows exactly the authentic formula!!", "author": "Ye Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "IF I COULD GIVE A ZERO I WOULD! I went there with my friend and there were 2 tables that weren't cleaned. So we waited, after 10 mins, they still not cleaned. The waiter just ignored and walked pass us when we asked them how long we have to wait. She went straight to other customers and didn't even care to look at us. This is the worst experience I ever had and we left after standing there for 10 mins. Their customer service is horrible, I do not reccomend going because they don't even treat their customers right. Why spend money in a restaurant that doesn't care about their customers? I rather starve then go in that place again!", "author": "Andy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-30", "description": "The spicy beef noodles are REALLY good! I feel like it is their signature dish here. They just recently opened this year and the noodles are homemade in the back. The pork and corn dumplings are pretty good too. There is a good amount of meat and corn where the dumpling is not too doughy. Service is good, parking isn't too bad. This place is small so make sure to come early and get a table. They take cash and credit :)", "author": "Nancy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-30", "description": "I will admit, I only tried this place because the line for Kingdom of Dumpling down the street was out the door. BEST DECISION EVER. This place is clean, service was excellent and the food was stellar. Chewy, hot savory noodles in a refreshing spicy broth with beef and mushrooms were the starter. Upon gulping that down, we tried the dumplings next- beef, pork with nappa cabbage and pork with chive. The owners work behind the counter and churn out piping hot fresh food. \n\nOur host/waiter was super -engaging and friendly. He even took a picture of us for his guest wall. When we first walked in, we were seated in the very back because it was so crowded. As people started to trickle out, he offered us a better table with squishy chairs that felt like sneakers (in a good way). \n\nShandong Deluxe is clean, the food is fresh and the service is friendly. Not something I can typically say about the average Chinese restaurant. I highly recommend going here and busting a gut. Your wallet won't suffer and you'll waddle out stuffed to the gills with delectable delights.", "author": "JiEun J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "Wow, this place is divisive.  \n\nI've eaten here about 5 times now.   I have to admit that the woman who runs the show is not a good waitress, almost comically so... but I've never had a 'real' problem with her.  She has bumped into us a number of times.  \n\nI am more interested in the food anyway. \n\nNo one is mentioning the lamb skewers.  I love these.  They taste almost exactly like lamb skewers I had somewhere in Yunan.   \nThe Xinjian diced chicken dish is expensive, but a huge amount of food not meant for 1 or even 2 people.   Tons of not too dry chicken, potatoes in a super flavorful sauce. Not spicy, but a little on the numbing side.  Plus big hunks of ginger, tons of whole garlic cloves and star anise.  (To Amanda S.  You don't eat the star anise!  And those black balls were peppercorns.)\n\nWe've tried, i think, 4 of the dumplings.  Favorite so far is the regular old pork and chives.   I see they have a listing for mackerel dumplings. That sounds crazy.\n\nAlso tried the \"Beef Pancake\". I really enjoyed this. It was not thin. Half inch thick maybe. Seemed to be made from layers of dough and ground beef. The irregularity of the thickness of the dough was a plus in my book. The best part was that it was fried to a crisp on the outside yet quite juicy on the inside. Yet another large portion. My friend commented that it tasted oddly European. I've had various kinds of Chinese beef pies over the years, and these were quite distinct. \n\nThe Xinjiang noodle dish is a bit odd though.  VERY mildly flavored.  (not just water and tomato sauce as someone said) but pretty mild.  The lamb was good though. Not chewy.  The texture of the noodles was great, but you have to be into firm noodles.  I saw someone refer to them as shoelaces.  If all your used to is soggy limp noodles, these are going to seem reallllly firm.  Mine were not cold.\n\nLook past the funky service and get some good and rather unique Chinese food.", "author": "howard t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-12", "description": "I told Hubby we've been in this place before, when it used to be a Japanese restaurant.  Remnants of that restaurant are still visible with the picture of a Japanese woman and the one arm waving cats lining the counter.  Hubby's a sucker for reviews in the newspaper.  It was jammed at 11:30 AM for a table on Saturday.  We waited about 30 mins for a table for 2.\n\nThe waitress barely spoke English.  She took our order and some how managed to misunderstand what we wanted or mixed it up with another order. She wrote down 6 orders and only when the Shao Lung Bao arrived did we realized something wasn't right & we told her we didn't order that.  A waiter popped out (improvement in the English comprehension dept) and said it was alright and took the dumplings back inside.\n\nWe tried:\n1. Pork/Napa cabbage dumplings - was OK, not great.  I think the dumplings at King of Dumplings and another restaurant on Irving St are better.  Came with about 10 of them, the covering was overcooked and started to fall apart when you tried to pick one up w/your chopsticks.\n2. Chicken chow mein - handpulled noodles were good, Only tiny bits of chicken, lots of cabbage, green onions.  The texture of the noodles were good, still oily but not in puddles or lakes at least.\n3. Onion pancake - not fried crispy enough for my taste.  Decent and passable.\n4. Beef wrap. Now, the author of the article in the SF Chronicle 96 Hrs section (10/3-10/6/13) said it contends with the House of Pancake across the street.  We found basically Hoisin flavored chopped beef with cilantro and cucumber wrapped in a Chinese type tortilla and pan-fried.  The insides were still cold.  I don't know if it was intended to be a cold dish or hot dish but I didn't like it, $6.95. \n\nWe had leftovers to take home.  Hubby says if he goes back, it'd be to try another noodle dish.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-13", "description": "A new restaurant with lots of potential. Decor is nice but funny thing is it is Japanese themed (I think the place was previously a Japanese restaurant). Relaxed and comfortable ambience. The lady who owns the place is said to be known for her pulled noodle (la mien). She came out to talk to all the customers. Friendly, but my Mandarin sucks so I could barely communicate. Anyway, I tried the Tomato noodle. The noodles had great texture. Soup was good, subtle and lots of yummy mushrooms and vegetables. My husband had the pot herb mustard pork noodle dish. He really liked it too. Portions are huge. We should have ordered just one bowl to share. Overall, a great meal. Definitely going back to try the other dishes and will try to post photos next time.", "author": "Gillian Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-07", "description": "Food is ok. Dumpling taste is just ordinary and skin is too thick with less stuffing. Service is suck because of language proficiency and such a tiny restaurant with serving slow. Seem like some people just came here for pot stickers and dumplings. Tried noodle but also is just ok taste with cheap price. 2 stars for dumplings only.", "author": "Howwie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-23", "description": "avoid at all cost... \n\nservice was slow.  the xlb were steamed for too long and have all clearly exploded with the inside spilling out and visibly destroyed but they still presented to me.  that's the level of respect they have for what they serve and their customers.  i sent them back to the kitchen.   rest of the food were so salty i got a headache.", "author": "Adele W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-17", "description": "Wife and husband team with one helper in the kitchen, one not very experienced wait staff, running  this 40 seats restaurant. \n\nI have visited this place three times during the last three weeks.  When the pace is slow, food and service were fine. But when it is more than half full,  the kitchen get overwhelmed, food quality went downhill fast. At the same time, the lone wait staff, although trying very hard, failed to keep up with the customers.  I hope the owners will correct these short comings soon.   \n\nIf you want to have a good experience with Shandong Deluxe, go there during off peak periods, that means early or late meal hours, and no weekends.  \n\n\n\n.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Authentic noodles and dumplings made on site.  Chives pan cake is the real deal!!", "author": "Sans S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "We went there on a sunday afternoon; it was almost 2pm when we got there.  The restaurant was full of customers, only 2 small tables were empty, but we have 4 adults + 1 toddler and waited for 20 min or so.  When we sat down, I found people from 3 other big tables just finished and left!  Anyways, we ordered beef tendon noodle soup, onion pancake, Xiao Long Bao, pan fried pork dumplings, and pork and bak choi dumplings.  They are quite tasty, and the portion of beef tendon noodle is quite large!  The service is a little bit slow, and the tea is not hot.  But the food came out quite fast.  I think they are improving.  I personally would like to come to this one rather than king of dumplings (their wait is even longer and service also not as good, and their tables and chairs are too packed).\n\nBTW. There was no waitress, only 2 waiters.  I think they fired the waitress yelper Wilson Y. mentioned in his review...", "author": "Cat. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-11", "description": "My Wife & I at there last night, The Noodle soups were amazing! and the green beans were also fantastic. The Mapo Tufu was decent , but the weakest out of the list. I might be partial to how my wife makes it and there is many different styles to the dish, so it was just so so. My wife liked the noodles even a little more then King of Noodles, I think it could be, def the meat in the soup was allot less fatty then King of noodles. Either way, it is great to see more Mainland Chinese Restaurants opening. The people working there were very nice and the prices good, we will be back, next time Jiaozi!", "author": "dub g."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-08", "description": "The service was terrible. I wanted to order take out and had some questions about the dish, like how spicy it is and how big is it. The waiter replied me \"please hurry, we are busy here.\" We ordered and it took us almost 1 hour. We had to cancel one of our order otherwise it will take longer. They never apologize, never smile, never care about you.", "author": "Hsin C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-07", "description": "I came here with hub last week because I've passed by it often and been wanting to try it. It was Halloween evening around 6pm and the place was almost filled. We were seated near the kitchen area. We ordered a pork/chives steamed dumplings, pan fried pork buns, and the xingjiang beef lo mein. Food came after a decent amount of time. Server was lukewarm, not too warm nor cold. The dumplings were ok, filling was good. The pan fried buns weren't so great, meat was dry. The noodles was not tasty and they advertised it!! The sauce tasted like a cross between ketchup and hot sauce. But anyways since we live in the neighborhood we decided to give it a 2nd try tonight....another Wed evening around 5:30pm,\nUpon arrival only 2 tables were filled. Hub wanted to try their spicy beef soup noodles. We ordered that , a shredded pork stir fry with green bell peppers, &a bowl of pork/fungus/egg flower sauce noodles. After 15 minutes the dish came....then half way thru the dish, the server walked by and told us over her shoulder, \" your noodles coming soon.\" 5 min later it came. Hub said the the beef was good but the soup was just spicy water. 10 min later I asked the server when my noodles would come. She looked at me as if I said something wrong. I asked her again. She said, \"did you order it? I didn't write it down.\" No apology whatsoever. I told her I did and asked if she could make it fast. She said she would have to ask the cook. 10 min later it came. It tasted just ok.\nSo...I don't think we will return....didn't like the service, attitude, food was just ok, nothing to rave about. Unless they improve.", "author": "agnes f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-19", "description": "Cash only, no matter what. Doesn't post that any where. Horrible service, couldn't even get a side of rice....really!?!?", "author": "Joanna Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "Servise was horrible! During the rush hour, the signing sheet was nothing but a decoration. There was no sense of management and organization at all! My family and I already sat down at a table (which we basically cleaned ourselves) and placed the order, but we were asked to get up and have the other group to sit at our cleaned table.  It was just extramely rediculous and disrespectful to the customer! My family and I will never go to such a lousy restaurant again!", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-22", "description": "To be honest, their noodles are pretty good.... But everything else... Can't compare to kingdom of dumpling... And most important, the services is BAD", "author": "Tim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-20", "description": "(Account confusion-between devices-apologies)Everything already said about the service is true.  I guess they just don't care about their customers time. Unbelievably slow. Friendly enough. Come for the dumplings. Lamb in particular were good.  I had spicy pork noodle. Boring.  Noodles weren't that special to me. Nothing that bowled me over. The table next to us ONLY ordered dumplings and dim sum. Smart. Their hot sauce on table is tasty. Not super hot but flavorful.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-27", "description": "This place sucks. Their customer service is horrible. You have to keep asking for every little thing and they lag on everything. They do not even acknowledge you when you walk in (you have to walk up to them). Seating is cramped. We ordered the sam sun noodles, spicy beef noodles, and the shanghai soup dumplings. The spicy beef noodle (super oily, fatty, no flavor) and the shanghai soup dumplings were ok (have had a lot better at other places), but the sam sun noodles had a nasty after taste and just didn't taste right. I think it's great that they make their own noodles and own shanghai dumplings, but the taste isn't there. Will not be back.", "author": "Ellen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-14", "description": "Long wait; not worth it. Each dish comes VERY slowly and sporadically, waiter brought wrong order b/c he said he wasn't use to the new menu numbers.  No apology. another really long wait for the correct dish to come.\n\nCrab dumping overshadowed by the dense meat.\nLarge belt noodles w/ chicken and red peppers: not enough noodles and chicken had too many splintered bone pieces.\nLamb dumplings: these were good.\nService: poor\nWon't be coming back.", "author": "Pat W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-10", "description": "This is the worst restaurant I have ever eaten at.  Their was literally no taste to the dishes, the service was less than poor (we never even got our complete order).  If I wasn't an ethical person, I would have gotten up and left and not paid the bill.  This food was inedible.  DON'T EAT HERE!", "author": "Patricia J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "The food is super delicious, but the service is so-so. I usually have to go get my own menu and have to flag the waiters down to get their attention. The place is also pretty cramped too and it's cash only. However, their food makes up for all the negatives! My favorite dishes are the beef wrap, xinjiang cold noodle, and chinese spinache dumplings. I always order these every time i go! Price is also super cheap. 2 people can definitely dine for about $20 and you'll be stuffed!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "Northern Chinese food closer to 19th than Kingdom of Dumpling? Count me in for a try~\n\nFood Quality is AMAZING. People have recommended their noodles, and I have to join them. If you don't get anything else there, get something with noodles in it. Their hand-pulled noodles are definitely something to come back for. \n\n- Spicy Beef Tendon: I guess I'm bias toward the Kingdom of Dumpling version's thin slices. The one here is quite thick in comparison, but just as delicious.\n\n- Onion Pancakes: These are probably the best I have found on Taraval so far. Highest of quality, the perfect amount of dough. It's on par with my former favorite Northern Chinese food restaurant in Milbrae. \n\n- XLB (Xiao Long Bao): Could have been more soupy, but other than that, it was quite enjoyable.\n\n- Beef Tendon Noodle: They are quite generous with their tendon here. Soup was good, and of course their noodles were divine. They could have added a bit more vegetables, but other than that it was enough food between me and my guest.\n\nService: Could have been better, but they were really busy (even for a Wednesday night), and didn't really notice our small table. \n\nOver all a fantastic experience food wise. I would recommend this to anyone who is having an inkling for fantastic quality noodles.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-14", "description": "Fast service, surprisingly clean for a Chinese restaurant and the food was excellent! We tried the cucumber appetizer, bean curd, tripe, shanghai dumplings, and the spicy beef noodles which were all very good. Their homemade hot sauce was delicious. Best of all, the place was stroller friendly which always wins bonus points for us! Will def come back again.", "author": "Lydia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "This is a small new restaurant that  overall exceeded my expectation. good for party up to about 4 (have two tables can accommodate 6 peoples . noise level good. can speak and hear @ reasonable level, cost (party of 6 about 100 dollars (including tax and tip) Service was rapid and good. Dumpling were delicious, noodles was good. \n\n\nPlan to go there with a smaller party next time.\n\nPLEASE NOTE: CASH ONLY", "author": "Howard L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "Came here today for lunch with my parents. The restaurant is small with a very limited seating. So sometimes there will be quite a wait. We actually accidentally found this restaurant, my dad saw that they do hand pulled noodles so we decided to try this place out. Their dumplings are pretty good. I got the pork, shrimp and chives ones. The chives weren't overpowering and you can still taste the pork and shrimp. Very well balanced. Their green onion pancake are pretty greasy for not being that golden brown. We ordered the spicy beef noodle and the beef tendon noodle. I wasn't such a fan of the spicy beef noodle, it's just sour and spicy. The beef tendon noodle (is not spicy) had a nice mushroom tasting broth to it which I thought was quite nice. They also give you a nice big bowl with a good amount of noodle. The staff here are pretty forgetful and it is hard to get their attention. Also, their English isn't very good so you might have to repeat things to do a few more times. Probably wouldn't come here again for their noodle but instead their dumplings.", "author": "Tiffany Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-18", "description": "i got their spicy sichuan noodle soup and it was very delicious. but my friend's beef stew noodle was no good at all, kinda like hand-pulled noodle in plain broth...to someone who is used to the saucy, cantonese beef stew, the beef stew noodle was quite disappointing (but then again this place is NOT cantonese style)...i would recommend getting their beef wrap because they put sauce INSIDE the wrap, totally different from that of taiwanese style! overall this place is decent but just make sure you look at pictures beforehand and get the right thing.", "author": "Louis O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-22", "description": "To be honest, their noodles are pretty good.... But everything else... Can't compare to kingdom of dumpling... And most important, the services is BAD", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "Came in for an early dinner and was seated quickly. The waitress helped us pick items and explained the different options. It helps if you know Mandarin. We ordered a few dishes, one was the lamb lai mein (hand pulled noodles) soup or at least that's what I'm calling. It was unique, three or four different kinds of noodles but had a lot of white pepper added and made it spicier for others. If you can't eat pepper or do not like your soup too spicy make sure to tell the waitress when you order. The green onion pancake was supper thin and crispy so if you like it this way like I do then it is a must order! We order the fennel dumplings and vegetarian dumplings. Both were good and look forward to try different kinds. Arrive early as it is a small place recommended for parties of 4 or less.", "author": "D. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-15", "description": "well today i went their and i ordered a big plate chicken. And the chicken is supposed to be  rattus chicken but a customer beside me knew that wasnt rattus chicken and told me so they were lying!! they were tricking me for my money! i dont recommend that you go their.", "author": "Jasmine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "After spending 2 1/2 hours at a doctor appointment at UCSF, I was hungry.  We stumbled upon this place after parking across from Dragon City only to find it is now Taraval Seafood House.  So, not sure about trying it, we crossed back over to Shan Dong.  It is a casual atmosphere with friendly efficient service and low prices and excellent food to boot.  The lamb dumplings are delicate with thin wrappers, tender lamb filling, and a little broth inside like xiao lung baos; perfect with the sauce over it.  The beef wraps are chewy but not overly so with tender beef, onions, and cucumbers.  The Mongolian beef is tender with not as much beef and more vegetables with crisp onions and peppers in a vinigrey chuili sauce; it is ass kickin spicy; so you better have water nearby and some rice.  I can hardly wait to go back and try other things.  So, for excellent Shan Dong cuisine at low prices in a casual atmosphere with friendly service, Shan Dong cannot be beat.  Keep up the good work guys.", "author": "Brian S."}
