{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "love this bakery.\n\nbut making this review so I don't forget\n\nFrench Garlic Bun - skip. bread is always hard (2nd time buying). Go for the rectangular garlic bread!", "author": "Yeanne L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-26", "description": "So, I decided after the pineapple bun debacle, to try to get a selection of fancy cakes for dessert tonight.  They're pretty and I was feeling generous. Hubs picked it up and we sat down to enjoy our desserts after dinner. We purchased the mocha, peach and strawberry cake so that we could try a few flavors. \n\nI didn't know you could make cake filling taste like plastic foam till I had this cake. It was awful. Though it was just slightly sweeter than average Asian cakes, which is good, the texture of the filling is best described as a marshmallow foam. I actually stopped chewing and looked over at my husband with my sad panicked face while my mouth hung open. My eyes screaming, \"What have I done?!? To deserve this?!? I wanted to trust you, Sheng Kee!!\" I didn't want to chew the foam. Being a good Asian, I tried to power through it but hubs made the call and swooped it up and away before we wasted anymore calories on this cake. \n\nWith all the other fancy Chinese bakeries around now like Paris baguette and 85 degrees. I don't see a bright future for these guys. It's sad. They failed the authenticity test on their baos and when I came back to try their cakes, I was disappointed once again. \n\nFool me once, shame on you. Fool me twice, shame on me. I won't be coming in to try your latest \"Dirty\" bun for a third attempt. (Who wants to eat something named Dirty anyway? The marketing department needs a taking to.).", "author": "Marie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Their buns are pretty good. I like how you get a tray and pick up whatever  in the display case without anyone having to help you. Watch out though, their deep fry chicken/fish/pork buns aren't that good. There isn't enough grease in it. The quality of the meat isn't all that great. Otherwise, the rest of the selection is worth your time. If you buy enough buns, they will give you a box.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "We came here and got a green tea filled pastry, a cream bun, and a fruit pastry.  I'm not sure if it was because we came a little later in the day, around 6:00, but they didn't have many selections left. The pastries were average and tasted a little old but overall it was okay. The staff were nice and the place is clean.", "author": "Anna J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "This bakery is so cute! They have an array of lunch items like kawaii sandwiches, buns, flavored breads, small cakes, & yogurt. I got their boba milk tea, chocolate walnut cookies, and strawberry yogurt. It was all absolutely delicious, almost too cute to eat ! I especially loved their yogurt, it looked imported from China, which would make sense since it wasn't as sweet as the American yogurts I have tried. It had the perfect amount of tartness and it did not feel heavy in my stomach like yogurt usually feels after I eat it. So kudos to Sheng Kee for having a yogurt I can actually eat! I will definitely visit this place again next time I am in SF area.", "author": "Esca N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-27", "description": "I had a BBQ pastry. Unfortunately it was mostly the pastry and not much bbq inside. The positive of this place is the dining area while many bakeries in the area has only take out feature. Lots of local folks were sitting, eating, drinking and chatting here.", "author": "Aya T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Came here since had $20 gift certificates to use. Not a fan of Sheng Kee since its main ingridients are lard, sugar and food coloring. So I tried looking for the most healthy stuff. \n\nSo I got dinner rolls (least sweet), whole wheat walnut raisin bread (not that sweet but does have purple food coloring), almond sponge cake (strong artificial almond odor), pinapple bun, red bean bun, and a brioche (mildly sweet and not too sweet). \n\nI also took a few photos and you can see the nutritional facts for the dinner rolls and walnut bread. Its hard choosing the stuff you think is healthy.", "author": "Organic T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "Your average chinese buns. Most of the buns or  pastries average price are between $1.50 to $2.30 depending on what you get. Decent price. I got about  6 buns which total close to $10. This place looks very clean. I like how this place lets you pick your own buns by using a tray and tongs. Just have to browse and pick your favorites. I would rather do that since its more comfortable than the workers who have to do it for you and dont feel rush too. Their buns are good for snacks. Decent selections of buns and pastries", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Their pastries remind me of 85degrees. Came here on a Sunday morning to take to a friends place for breakfast. They have a lot of options and their pastries are super tasty. I ordered 8 parties and 2 coffees and it was less than $20 which I thought was a good value.\nHowever, I have to warn the coffee is not great.", "author": "Mariana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Fresh. Cheap. Good. \n\nThose are the words you want to hear describing any bakery. Sheng Kee Bakery delivers!\n\nCocktail Buns. Dan Tat. Pineapple Buns. \n\nThose are my go-to, no-fail bakery choices here. Sheng Kee Bakery also has Almond Cookies, Eclairs, Fruit Tarts, Macaroons, Croissant Sammies, & other bakery goodies like the seasonal Moon Cake, but it's all about those...\n\nCocktail Buns for me. \n\nThe Cocktail Buns are so soft, so buttery, so eff addictive good! And maybe the best part, so darn cheap! My advice to you... ask for the Cocktail Buns and if it's warm... ask for plenty! And thank me later, buttercup. \n\nSheng Kee Bakery is located in the outer Sunset on Irving St. just past 19th Ave. It is on the Lincoln Way side of Golden Gate park so great for picnic ideas too. I've been coming here for years, ahem decades, pre-yelp and it has never failed me. It's your typical \"Chinese Bakery\", but a notch above with cleanliness, organization, & super friendly workers. Fresh. Cheap. Good. Oh baby!", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "My family and I went here to get a few goodies before heading out to the California Academy of Science. It was definitely a treat. \n\nThey had quite a few pastries to choose from. I did not know where to begin.  Anything with taro root is very popular right now and this place did not disappoint in that department lol. \n\nI like how you grab your own tray and tongs, so that way you get to pick and choose what you want. I also like how the pastries were in  plastic containers where you can open and close them. \n\nThe pastries were pretty good and not overwhelmingly sweet. We will definitely go back when we go out this way again.", "author": "Crisel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "Decades ago, we trekked all the way to SF to buy the *right* breads.  It is a must-stop whenever we were in the neighborhood.  Of course, we make our pilgramage each year during the Moon Festival for the highly coveted moon cakes.\n\nThen, so many branches opened in south bay. But they are all those modern Taiwan style breads. Not the original Russian ones.  That's OK, we enjoyed them equally well.\n\nThen, that day, we stopped by this original Sheng Kee, for nostalgia mostly.  Sigh...\n\nThey became the same as their new south bay branches.  Why was I surprised?  The transformation probably started from this store.", "author": "Sin-Yaw W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "Credit cards accepted for purchased only MORE than $10!\n\nYour average Sheng Kee Bakery with OK service. It's a bit smaller than the one in South SF so I felt like they don't have as great of a selection in pastries. However, I felt like their cake selection was about the same. \n\nI've only tried their egg tarts and pineapple buns here and they're just your normal Sheng Kee quality. Really tasty, but also a bit expensive. With all these Asian bakeries in the vicinity, (like Pineapple King Bakery) I tend to opt out on Sheng Kee unless I really feel like treating myself.", "author": "Andrea K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-04", "description": "July 4, I decided to give them a try since we were in the area and wanted Pineapple King bakery in the first place. My brother and I were really excited and got 3 items which came to a total of around $7.  I handed the cashier a $20 and happily received the change back from her but as I was heading out, I realized she had only given me $2 in change and not $12. I went back and asked for more change but she said in broken English something about how I gave them a 10 but they'll check for me when they close and call. Great maybe they'll catch it. They called and adamantly insisted that they were correct. Not only did my brother see I handed them a 20, but I did not have any 10s on me because I had gone to the atm before for cash and only had 20s.  I'm very disappointed that this had to happen during my first time at this location but since they took 10 and didn't admit it, they lost a customer. Be careful at this location and make sure you say the amount you are handing them. I'm giving them a 2 star because I'm going to eat their bread.", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-27", "description": "1 star for the service. 3 stars for the raspberry mango mousse and the two Portuguese tarts. 3 items for $30. \nIt took them a few minutes to wrap up the raspberry mango mousse. When I asked for a bag (because I had 2 boxes of food), they said \"Fifteen cents.\" I only had credit card. Then they said \"$10 minimum.\" Needless to say, I walked out without a bag and all of the kiwis and strawberries fell off from the raspberry mango mousse. Either they can work on their service or I can work on my juggling skills. The taste for everything was fine: not too sweet, but sweet enough.", "author": "Ato Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "I hate this kind of review and often doubt the veracity of such reviews, but now I'm going to do it. Normally I'd let it go, but it was just too disgusting. \n\nA friend brought us a box of coconut buns and we tucked in, really enjoying them. Unfortunately, I found a fingernail in my bun. Initially I thought it was a really tough piece of unshredded coconut, but upon further inspection (see photo), it was definitely a nail. \n\nI'm still giving them two stars because the coconut bun was really good. Except for the nail. Sadly that wasn't the first time I've had a nail in my bun BOOM!", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Despite the reviews this place is by far the most diverse, interesting and best quality in the city. Unlike others they are great at many things not just popular for one item.", "author": "j. g."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "It's so sad that this bakery hires imbeciles to work their counter. I've always loved their pastries, but poor training in customer service is a complete turn off. The cashier rings me up and doesn't bother to ask if I needed a bag. Seeing that I'm carrying things left and right (cake, breads and pastries) she simply says that she forgot and did not think about it. I asked for a bag and she refuses to give me one, and asks me to place all the pastries and breads inside my cake box and to tie the remaining items to the ribbon tied to the box. She reluctantly gave me a small paper bag and said that I should have cash to pay the 0.25 charge if I want a bag. Sadly I didn't have cash, and she should have asked. \n\nVery poor experience.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Very bad customer services,  the employees sometimes yell to the customers.    I only go there when I didn't have enough cash.  The smaller bakery on the same block is much better in terms of both products & services, but only take cash.   If you are fans of Sheng Kee,  the one on 9th ave is much much better.", "author": "Lillia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "This location is in the heart of San Francisco old china town. You do feel like you're in China when you're walking around here. This or the one on Irving and 9th Ave are both great. They always have fresh pastries and bread.  Love the whole wheat here.\n\nTheir toast bread varieties are so fluffy, delicate, and with an awesome light touch of sweetness. I don't like whole wheat but Sheng Kee style while wheat is just superb! \n\nI definitely miss this place.", "author": "Ahmad A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-24", "description": "I appreciate the variety of buns and cakes they have but I feel like they're getting to be overpriced. Sure, a bun that's around $2-ish is not pricey but it feels so when the flavor is meh and there's other bakeries around the block which taste slightly better even if they don't have a large selection. I've tried several of their cakes and didn't like any. \n\nA perk is that they do individually wrap each bun upon checkout.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-11", "description": "I love the baked goods here, but one of the coconut buns I bought on Saturday, 4/10/17 had a metal piece in it that hurt my tooth. I'm glad I didn't give it to my kids to eat! Perhaps they need to do a little more quality control/be aware of their supplier.", "author": "Susie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "It was an afternoon in San Francisco and my pops wanted some coffee. Lucky my cousin Steve, & his beautiful wife Priscilla know all the good spots for coffee and a little something, something.\n\nSheng Kee Bakery is where we ended up at..........for my island peeps - what is \"Sheng Kee Bakery?\" \n\nTo put it simply.......it's like a St. Germain Bakery that we have here on the islands.\n\nApparently Sheng Kee Bakery is pretty big, with locations all over like - San Francisco, Berkeley, Cupertino, Richmond, Milpitas, Union City, Brisbane, San Mateo, &  Daly City.\n\nThey serve the standard buns/breads, and some Chinese treats that I like - (Custard Tart), as well as some fancy pansy cakes. \n\nI originally was gonna eat a custard tart, but upon passing the cake display, my plans changed, as I decided on a Green Tea Mousse Cake.\n\nUmmmmmm, Green Tea Mousse Cake.........with a strong green tea powdered flavoring on top!  Noms! To complement my afternoon treat, I had a cup of Peet's Coffee too! \n\nThis place also sells tea's, coffee, & that Milk ball tea thing-a-ma-jig...........sorry, I don't drink that stuff (maybe I'm missing out, who knows). \n\nAnyways, a pretty cool bakery. The place was clean, service was fast, but unfortunately there is only metered street parking here. \n\nA great place to stop by for a snack!", "author": "Fran C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-16", "description": "I went to a chinese bakery when visiting a friend in Queens like 4 years ago. I had this chesnut pastry there that I still fantasize about. I love chestnuts, hazelnuts, pistachios, almonds, all those goodies.\nBut, I digress. The coconut pastry did not disappoint. My friends had a savory toast w/ bacon and other stuff, and a jasmine matcha pastry (which they were on the fence about). The coconut pastry was a dollar, I should've gotten more for tasting purposes, but health.", "author": "Marin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "This is where it started.\nFor me, the first and largest location in the City, strategically on Irving Street as budding Chinese businesses like San Tung and Wonderful Foods were the neighborhood draws.  We know how the street evolved to be Clement Street South in the avenues.  \nNow, there are even more food and drink spots yet this staple still hustles and bustles unlike any other bakery in the area.  \nMy recent trips are mostly for their tea eggs, 2 for $1.99, that sits in a warming pot by the register, mainly for a friend.  This is only available at this location.  In the past, my main buys were pineapple shortcakes or red bean buns.  Well, since increased competition from that Taiwan coffee place in Newark and Cupertino, they really needed to step up their game.  Hence, the three recent pastry purchases brought smiles to my face (pics below).  One afternoon, being parched, I had their $1.99 mango green tea which hit the spot.\nThe new menu offerings also gave me an opportunity to see how this neighborhood changed and try Tpumps teas.  Nice perks.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "This location is okay, and I do like the Sheng Kee Bakery chain generally speaking as well as all of their products.\n\nWe had the SLC Mango, which was a slice for $3.39 and it was okay, not spectacular as most of their other deserts I've had here have been.\n\nIt's similar to JJ Bakery, 85 Degrees, and those other Chinese / Taiwanese bakeries in California (SF to LA) I've been to.\n\nThis location has seating inside to enjoy eating a snack too.\n\nParking is typical of the Sunset District and shopping area of Irving Street, a little bit of luck, a dash of good karma, and a lot of luck goes a long way.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-06", "description": "#82 I was craving a pineapple bun while I was in the area but they didn't have any plain ones left. The lady working was nice enough to check in the back if they had any leftover. I spotted some brioche that looked EXACTLY like the brioche at 85° Bakery, but it tasted kinda different. Like less sweet. Or maybe I'm just trippin. I also tried the thin almond cookies but they were way too crunchy. Meh, I'll just stick with their fruit cakes.", "author": "Kirstie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-24", "description": "One of my favorite asian bakeries is Sheng Kee. This time, I went with my friends and we ordered some pastries. Usually the bakery is filled with people, but there wasn't much people there at the time I went. \n\nMy friend got a flaky danish with green tea filling and a butter poundcake. However, when she dug into the danish pastry, there was very little green tea and it was located at the bottom of the pastry. It was disappointing to see how a wonderful looking pastry had little filling. We noted to not get this pastry next time.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "I like this place because they have different cakes that are really good and very pretty this place is clean the staff are a little on the rude side but I'll come here again for the cakes.", "author": "Michele T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-31", "description": "Sheng Kee is a stable for Asian bakeries here in San Francisco. You can't beat the feeling of coming in and filling a tray with both sweet and savory pastries. Parking in this area is horrific but just take your time. There are tons of people doing all kinds of illegal driving maneuvers", "author": "Diego A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-10", "description": "Great bakery on irving street!\nFour stars because the service is sometimes a hit or miss. But for the most part, people are decently friendly. Maybe it's my fault because I only speak English. \nThis bakery has amazing bread!\nMy favorites are the custard bun, red bean bun, and the green onion bun. YUM! I definitely want to try more, but my options are a little limiting because I don't eat meat. Overall, delicious food!", "author": "Robyn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "I've tried BBQ buns, almond croissants, green tea moon cake, pineapple croissants, and can't remember the rest. Its not amazing, but it's not bad. It's clean, and the pastries are all labeled.", "author": "Ha D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "I'm a big fan of their mocha rolls and their cakes! They always look so pretty in the display case, and you definitely won't be disappointed. I'm a fan of the mocha roll especially because of how light and not overly sweet it is. As for the cakes, I really like their mango mousse and black forest cake. Yum! Whoever came up with designing the cakes, props to you.\n\nThey have a good variety of asian pastries here, from pineapple buns to taro buns and other fun little cute ones you probably never heard of. Their bread is always fresh; when you poke it, it's always very soft! This location is smaller than the original further down Irving, but they offer the same stuff.\n\nI guess the reason why I give three stars, no matter how much I love their pastries, is because of the milk tea. Sad to say, but when I got it (it was $2 with pearls which isn't bad at all, however...) it was too sweet, and what was disappointing was that I found chunks of sugar at the bottom of my drink. It was like the kind of sugar used for coffee (sugar in the raw? something like that.) and bleh.. it was gross. So yeah.. don't get it.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Yummy & fairly standard Asian bakery. Good savory items, okay pricing. Gets busy weekend mornings w/the older crowd, tables can sometimes be left messy :(\n\nGood place to s too by for some carbs to munch on.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-28", "description": "Sheng Kee has a pretty upscale decor compared to other Chinese bakeries, but their food is no better. \n\nAt a glance, you might be a little overwhelmed with the large selection of baked buns that they have. But don't be fooled, the ones on the shelf are rarely fresh. Cleanliness is also a problem. I've spotted little crawlers inside the store on several occasions.\n\nEven considering all that, Sheng Kee is still an alright place. They don't have the best birthday cakes, but they have presentable ones at a reasonable price. (Around $20) If you want a cute one, they have a cake shaped as a head of a bear and a pig : )\n\nThey wrap things up rather nicely so this is a good place to stop by if you're getting things for the office!", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "love love love this place. thier pineaple curstard bun is amazing. Only this store has the best custard bun. Ive tried other stores and others dont have that much fillings inside as this one. staff is friendly and quick. Egg tart, the newly cheese tart and green tea cheese tart are awesome too :) Must go place when I visit sunset.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-03", "description": "Sheng Kee has been in the Sunset, on Irving Street for what seems like decades. I used to love this place and was to be my go-to place to pick up an entire cake or fruit tarte. But over the years, prices have risen so much, that I wish my investments have the same % increase. \n\nNow that I've lived in LA (626) for about 7 years, I've discovered many other Asian bakeries that seem so much better. \n\nThe selection of baked goodies here is nothng spectacular. They carry the usual pineapple buns, egg tarts and the common savory pastries. The sizes are not too generous, and they really have nothing original or stands out. The freshness is debatable. On rare occasions do they bring out fresh items while I was in there holding a tray, compared to JJ in Arcadia or 85C in SoCal where they're constantly bringing fresh stuff out from the kitchen. \n\nOverall, it's a decent bakery that serves the Sunset crowd. There is often a line to pay and the place often seems crowded. Perhaps it's because the place is small and there's only one cashier counter. Still, some items in the display case do look good and are worth trying. \n\nTip: Try the honey cake for about $1.50 or the fruit tart for about 20 bucks. Both are memorable.", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "Sheng Kee Bakery has a wide selection of sweet and savory and plain breads and pastries in Asian and European styles. They also serve sandwiches, soups, and Peet's Coffee. \nEach time I have gone to Sheng Kee, the quality has been consistently good. Their BBQ pork buns are always solid, and especially delicious when they're hot out of the oven. I like their sweet buns such as the taro bun and the yam bun. Their chocolate croissants and turnovers are also top notch. \nThe staff are always friendly and helpful. The prices are well marked and quite reasonable. While, for example, the pork buns here are $1.80 instead of more traditional dim sum bakeries which may sell for $0.75, the quality is more consistent. \nThe bakery does feel like a chain, which it is, but the quality makes it a good neighborhood staple.", "author": "Allxie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-28", "description": "Sheng Kee Bakery is a nice place to go if you're looking for some Asian style pastries. There is a wide selection of baked good to choose from. Though I enjoyed going through all the choices, I felt that a few things held Sheng Kee from being an outstanding place to eat.\n\nFirst... the good! When you first go into the restaurant, you are bombarded with a ton of choices. There are numerous items ranging from pineapple buns to pork sung rolls,  to sandwiches and even cakes. And looking at the price is great... because most items are under $1.50. Grab a tray, get a wax sheet on it... and go crazy!\n\nIf you are a fan of the corn, ham, and egg filled pastries, you'll enjoy this place. I, for one, am not as big on these types of desserts/baked goods. They lack some refinement to me, as I tend to go for pastries that have a lighter taste. The desserts here tend to be heavier and more dense/filling. I'm also a bit wary of the overall quality of the food. Again, it's just not as refined as I would like it to be.\n\nIf you're in the mood for something a bit more savory, Sheng Kee has a few items for you, but not much. There are some bbq pork pastries, as well as curry turnovers and a chicken pie... that's really it, though, unless you count the pre-made sandwiches in the cold case. I would have loved to have the chance to get more savory items.\n\nAll-in-all, Sheng Kee is a nice place to stop by for some very affordable (and filling) Asian baked goods. The items you can get here are decent, but they won't blow you away or make you say 'wow!'\n\nThis place is 'A-OK'! But I can't say it goes above that.", "author": "Luke C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-17", "description": "I've gone in here before, for a pastry or something -- didn't pay attention, but they were fine.\n\nFriday I got a chicken salad sandwich.  HOOBOY!  Yummy bread, tasty chicken salad, with fruit (!)  and just overall the best chicken salad sandwich I've had in my memory.  And very, very reasonably priced.  But really, if it'd been pricier, I wouldn't have cared, b/c .... BEST EVER.\n\nI'm goin' back to try other things, that's for sure.", "author": "Chet M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-31", "description": "I have enjoyed most of their stuff, but their vanilla roll is so disgusting...it tastes gross -- like gummy sweet cardboard....", "author": "Jihyun L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-14", "description": "A little difficult trying to find parking, but not impossible. It is meter parking. \n\nThey have a great selection of all kinds of baked goods! I chose out a birthday cake for my friend. It's the one with a variety of fruits as the topping and inside is white cake with peaches. YUM! The fruits tasted very fresh! I love this cake!\n\nThey employees here weren't exactly friendly, but I was just in and out of this place so I didn't care much for their attitude.", "author": "Thanh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "This is a great Asian bakery staple in SF. Is everything in their store perfect? No. But most of the items you will find are pretty tasty and the variety of options never disappoints. They also have lots of good \"specials\" every once in a while. I only buy their fresh breads/pastries though so I can't speak on their cakes. It's a great place to pass by and just pick up a snack or two...or three. \n\nMy personal faves are the taro breads that come in so many iterations. Their savory pork sung, red bean and chocolate varieties are great as well. \n\nSolid place that I can always rely on to pick up asian bakery goods at or introduce people to if they're new or visiting because it always has options and delivers well on taste most of the time.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "Sheng Kee is a pretty foolproof bakery with fresh breads/buns that are not overly sweet or oily. My favorites are the taro buns and pineapple red bean buns. The green onion buns can verge on overly oily and a little too creamy for my liking. I'm a huge fan of the beef curry horns (available near the register because they're hot). I consider them an indulgence because their exterior is extremely buttery and flakey, with just the right amount of golden browning. The interior has slightly sweet curried beef, and overall the little horn is aromatic and delicious. \n\nNote: $10 minimum for credit cards!", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "I recently visited the near 9th Avenue and was less than impressed by their offerings.  With the discovery of another location closer to my girlfriend's apartment, and the specials advertised in their window, I decided to give it another try.\n\nWe shared a variety of buns including the ham & egg, ham & cheese, bacon & corn, taro, and curry beef, as well as a tiger tea to wash it all down.  My favorites were definitely the ones with ham and bacon in them, but the biggest surprise was how much I enjoyed their tiger tea.  It may only be a mix of thai tea and milk tea, but it was surprisingly refreshing and enjoyable.  I'm actually quite excited and optimistic about going back to try their other varieties very soon.\n\nIt's location may be difficult to get to by car since parking is sparse in the area, but it's just close enough for my girlfriend and I to walk to regularly.  I'm a big fan of this location over the one closer to UCSF and I'd even say the service was actually quite good here.  Definitely worth a visit if you're in the area!\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Been going here on and off for more than 10 years.  The prices over the years has been going up, but then again look at the location of this place and the economy.\n\nThe buns have been good and consistent.  The service has been quick and responsive.  I have even tried there milk teas here.  It's just as good as the other million boba tea places on this street.  However,  not much in terms of tea flavors.  Then a gain this place isn't a tea place.", "author": "Guest U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "You can always count on sheng kee to deliver weird Western inspired asian bakery stuffs. I'm here lit as fuck and gnawing on garlic bread and looking wistfully deep in thought while 80s music pump through the buttery scented air.", "author": "Anchovy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-26", "description": "I like this Sheng Kee more than the one in the Inner Sunset. I love the Portuguese egg tarts, the shredded pork bun, and the buns filled w/ custard. Those are my absolute faves. I like this one because it has more options then the other one. I always like the Tiger Milk Tea too, which is the only place you can get it I think, but I'm sure other boba places would do it too. My definite to to for asian pastires when in the outer sunset. :) \n\nOnly accepts credit cards if you spend more that $5... which is always pretty easy for me!", "author": "Julie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-16", "description": "This place is getting increasingly more expensive over the years. But I guess that's the price for living in San Francisco. Anyways, this where we get our cakes for family occasions and birthdays, and I don't recall anything significantly terrible about prior experiences. The establishment is well-lit and there is a large selection of baked goods all neatly organized. The building feels pretty spacious as well. However, if you are driving to Sheng Kee, I'd recommend you don't drive at all. Parking is true terror, especially during the weekends. Traffic is usually congested around the area. It's way better to walk or bus there if you are nearby. \n\nAs for the food, I can only review their cakes and custard bread. They are moist and delicious. Like I said, we've never had an issue with the cake before, albeit there have been times where there was a little too much frosting and too little cake. The food here is good. I'd recommend it!", "author": "Golden H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-16", "description": "I'm generally not too crazy about Asian style breads or cakes. However, there's something about those individually wrapped breads and pastries at Sheng Kee that just seem so appealing and irresistible. Seriously, I'm a sucker for good packaging and presentation. \n\nMy mom prolly buys bread from Sheng Kee almost weekly. Hence, I've tried the thick toast, egg, wheat, raisin, red bean and taro breads. Not my favorite, but pretty good especially when fresh. I also tried some of their baked buns both savory and sweet. Not too crazy about those either. I do like their little moon cakes though! The jasmine and oolong tea flavored ones are my favorites....besides the white lotus one. \n\nThe cakes at SK are like most Asian cakes - not too sweet, usually some sort of sponge cake with light cream. They generally look very nice and are always a hit when you bring them to a party or some sort of celebration. A few of my favorites are the mango mousse, chocolate and mocha cakes. I have also tried the taro filled one, which I thought was OK as was the green tea cake. Most of the cakes are decorated very nicely and topped with fruit. The cakes are also reasonably priced and it's nice that you don't necessarily have to special order (unless you want to get something specific or large sheet cake)....very convenient if you need to just drop in to pick up a cake since they always have a bunch ready made. You can also buy some of the cakes by the slices if you can't eat a whole one.\n\nParking at this location can be tough as you all know Irving street is poppin'. You may need to circle the block a few times if you're looking for the metered spots. Otherwise, park in the residential streets a block or two away and you should be fine.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-21", "description": "This location is significantly more spacious than the ones nearby (namely, the one on 9th, the one at westlake, and the one at ranch 99) which sometimes means that it boasts some more \"interesting\" items. \n\nToday, mom came and picked up a fruit cake, but while exploring, found an item called \"cake sushi\"...it comes as 4 slices of their sponge cake rolled in toasted coconut on the outside and layered with ham, pork sung, cucumbers, and mayo inside. I know, sounds kind of peculiar...but this sweet/savory thing is something Sheng Kee actually does pretty well. I was pleasantly surprised by this cake sushi.\n\nSheng Kee likes to experiment. Sometimes it works: chocolate pineapple bun and milky brioche...and other times, it just doesn't: green tea mochi bun. Regardless of the hits and misses though, my family likes coming to this Sheng Kee because it's a one stop shop on Irving (i.e. this one is near Sunset Super and Lam Hoa Thuan).", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-18", "description": "Place is decent but service is not good. All they care is making money and try to sell you stuff that's a day old at regular price. Be careful when you get your change back. They tend to short change you. It's not the first time it happen. That's why I'm posting it this time.", "author": "dave w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-16", "description": "I came in yesterday to buy a cake and they have a pretty good selection. I usually like going to Sheng Kee for the consistency of taste. Usually I fulfill my cravings all the same. They are priced more expensive than other Chinese bakery. There seemed to be a much smaller selection at this location. \n\nAnyways, on to the cake: ive tried their taro cake and that really realllly good. This time, I was deciding between strawberry mousse and French chestnut mousse cake. I was dissapointed that both cakes have a very deceiving exterior. Go see the picture. Initially I thought it was only the strawberry one, but I asked the worker and she said there's only one layer of mousse inside. I ended up getting the chestnut cake. They accept credit card!!  Also, they decorated a piece of white chocolate with the birthday greeting, which is a nice service. \n\nMy family LOVES chestnut, but the cake was all a lie. There was a thin layer around the outside of the cake to give it an appearance of having two layers of mousse, but in reality, there was more cake than mousse. Needless to say, I was disappointed. If anything, Sheng kee could've added a disclaimer!The cake doesn't taste as good as Chinese fruit cake nor the chestnut cake from Napoleon in Chinatown. For the taste and value, I dont like the two matched. In the future, I do not plan on returning to this Sheng Kee this bakery for cake or pastries.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-01", "description": "Just merely okay in my book. The milk also wasn't all that great, either. Maybe it was an off day, who knows. \n\nDuring my visit, I may have been yelled at a few times. The positive side being that I was acknowledged by the employees rather than being ignored. I'll take what I can get. \n\nWill try again on a luckier day...", "author": "Aren A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-02", "description": "Somehow, this location of Sheng Kee was even more disappointing than the other. Mainly because the pastries seemed poorly made and not very fresh, and the service was just awful. \n\nApricot pastry: No apricot flavor, oddly bitter and tasted a most rotten\n\"Rough\" pineapple cake: Not sure how to translate it into English, but these were less sweet than the popular Taiwanese pineapple cakes and also tasted off, like the pineapples weren't fresh\nCroissant: Flaky and light, but really, really greasy-feeling from all the butter\n\nThe women working behind the counter were incredibly rude--snippy, curt and bizarrely angry. Even speaking the same language as them (Mandarin) yielded a severe deficiency in courtesy. The clientele included some creepy old Chinese men who don't mind ogling you if you're female and over the age of 12. While there was far more seating here, more than of the tables and chairs were filthy and covered in crumbs, dirt and miscellaneous other things not found in nature.", "author": "Josephine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "If you are from Socal, this bakery is similar to JJ bakery, or 85 degrees. Not quite as big and doesn't have as much variety as 85.\n\nI mainly come here for the brioche. It's fresh and cheap! It's perfect for my french toast! I have tried a few of their pastries and are pretty standard for a typical Taiwanese/chinese bakery. \n\nThey have another location on Irving and 10th (?). That store seems to be better kept, and the employees are much nicer. Ultimately it doesn't matter in terms of buying bread, but was a pleasant surprise. Let's be honest, customer service usually isn't a priority for  Asian places.", "author": "Thuy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Great place for quick grab n go Asian pastries and baked goods. It can be pretty busy at times here, and the usual crowd can lack manners.. But the establishment is clean and efficiently run. They have a fair amount of tables inside, but it's not really an environment conducive to studying or staying for very long.\n\nAs for the goods, well, they're quite good! Prices per pastry range from $.99 to $2ish each. Everything seems fresh, and you can frequently see employees bringing out fresh batches to restock the shelves. Some of my favorites include the taro buns, pork sung buns, coconut buns... It's hard to go wrong here! Actually, I usually stay away from the meat ones since they're not kept heated, and thus bacteria can grow quickly.\n\nAnyhow, Sheng Kee is quick, inexpensive, and has something for any carb lover!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-29", "description": "Terrific Chinese pastries and bread. Wonderful cakes also. A little pricey but the quality is definitely  there. The best fruit tarts I have ever tasted, about $26.00. Apple turnovers are my favorite, $3.00 per. Cash Only!", "author": "Dirk D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "Years and years ago, this brand of bakery used to be good. Breads are now stale and flavorless. I only come back for their green tea cakes. Nothing more.", "author": "Hoang T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "The Fresh Strawberry cake is mind blowing.  We've gotten two now and it's amazing.  The cream is light and fresh, the cake is moist.  Yummy.", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-03", "description": "Terrible. Terrible. Terrible. I bought the Blueberry half Moon yesterday at this store，12/2/2014。when I back home I took out everything ，I found out the date was12/1. It's out of date, and the cake was moldy .I wouldn't come back again, it wastes my money. Fortunately, I find out and haven't eat that.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "If I need a quick snack this is the place to go. The variety is amazing! It's good if you are looking for both something salty and something sweet. They have milk tea too. It's not super flavorful but it's cheap. I do recommend the tiger milk tea. \n\nIf you got a birthday to celebrate, I recommend the cakes.  They are just precious.", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "Sheng Kee Bakery is a cute bakery on Irving Street.  They have tons of freshly baked breads, pastries, tarts, and cakes.  Also, they have $.99 boba!\n\nI bought a couple of breads, some cakes, and got the passion fruit green tea with boba.  The drink was okay, boba was good and chewy.\n\nI wish I could tell you how the breads tasted, but my aunt's dog ate all the bread out of my tote bag.  All that was left were the wrappers/bags.  Since the dog basically ate everything without a trace of crumbs, I can assume that they were both pretty tasty.\n\nAs for the cakes, I accidentally forgot them in my aunt's fridge and am now back in LA.  I'm sure her tummy is also enjoying the cakes as well!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "I really enjoyed the blueberry puff, it was mostly puff pastry with some blueberries at the bottom. I also like the almond pastries and the fruit pastry with custard filling. I was a bit adventurous and tried the pre-packaged date pastries...I was expecting something sweet but it was more of a savory/ sour flavor which I was not a fan of.", "author": "Bernadette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Been going there for years. They have variety of cakes, buns, bakeries. Reasonable price and can't wait to go back.", "author": "Dear J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Sheng Kee Bakery reminds me of a bakery I loved back in LA. \n\nIt's always clean, well-stocked, and full of people hustling and bustling--fighting over the bread with their claw like tongs. They take credit card, but you have to have over a $5 purchase..just bring cash in case ! \n\nMy favorites are the pineapple bread, the green onion hotdog bread, and spongecake. You should try those! They are to die-for. \n\nFor most newbies, please note: don't use your fingers. \nYou take a tray, cover it with one of the white papers, and then take a tong to select your bread. It seems silly that I should mention this, but I've seen way too many people using their fingers instead of tongs. \n\nHonestly, I always take the bus when I come to this location so I never have problems finding parking, but I do know it is crazy on the weekends because everyone likes to come on Irving Street in their free time. Good luck to those driving and hurrah to those riding the bus!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "Delicious self-serve bakery. Loved the taro braid, the egg custard tart, and the red bean bun. Also tried the curry beef horns and chive bread - against my sister's recommendation - and was underwhelmed. It wasn't bad, but it was expensive for what it was.\n\nConclusion: I wouldn't bother with the savory pastries again, but the sweets are awesome-delicious!!", "author": "Joseph M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Great Chinese bakery with a large selection of pastries and buns. I love, love Chinese buns. These are great quality and you have your pick of fillings to choose from. \n\nWe tried a taro bun, a pineapple and coconut bun, a yam bun and one other I can't remember now. All of them were delicious and fresh. My husband couldn't resist ordering the two for one drinks. He ordered one without sugar. Haha. Of course it came with sugar. They just meant without extra sugar. Just so you know. The nice thing about it was that it wasn't too sweet as they usually are.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "Been going here once every few months to grab some quick lunch. The food and drinks here are okay, comparable to supermarket packed lunches. My only complaint would be how the baked goods at the deli/display cases aren't kept warm except for the ones at the cashier's counter. Half the time when I'm there to grab a bun or two the goods would always be cold.\n\nAnd hmm, their Portuguese tarts aren't doing so great lately. It couldn't hold its form and the texture is a little runny. A couple months back it was still good.\n\nTheir cold refrigerated stuff are good though. I like their Chocolate Swiss Roll Cakes.", "author": "Danny Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "Sighhh.. It sucks that my favorite bread is here but I got treated like shit just yesterday by one of the middle aged ladies that worked there. She probably thought I didn't understand Canto or something but when I was at the register paying for my bread, I heard her mutter something in Canto to one of her co-workers which basically translated to \"oh, she's buying all the big ones again\" and then stuffing my bread in a paper bag like she was annoyed cause she didn't want to waste a bag on me and that I'm super cheap buying the bigger breads. Are you fucking kidding me? For one, the brioche is my favorite. I also bought this giant, round milk bun cause my little brother doesn't like anything else but this. I just felt so insulted and left pissed off. \n\nBefore paying, there was a younger lady restocking and organizing the bread and she was really nice. I was about to grab one of the milk buns from the front but she offered to help pull the tray out so I can grab one from the back. I was fine with the one in the front but since she offered, I just said okay. After grabbing the one in the back, I realized it did seem kinda sketch. Now I'm wondering if the back ones are the older ones...", "author": "Stephanie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-26", "description": "To me, most of the Sheng Kee bakery is all the same, but this one was the one I went to for many years. Lot of selection of breads, rolls, and cakes. The ladies working there seem to be very hasty and sometimes even rude. My mom once told me that the ladies working there would yell at the younger, less tenured people working there in front of all the customers. Very embarassing and not professional at all. In terms of the bread and desserts, very good! I never once had a bad experience getting bread or dessert here. Plenty of seating as well, but the tables can be kind of sticky!\n\nMy favorites are the black forest cake, fruit tart, Portuguese tart, milk bread. It's a place to quickly grab a dessert and go home.", "author": "Carmen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-16", "description": "Do not buy cake from this location. They sell expired cake. We bought one today. It taste terrible. The fruit/strawberry is old probably expired, too. However, pastries and the bread are pretty good. We just won't buy cake from here anymore. Paris Baquette cakes are way better or superior than sheng kee.", "author": "Deming L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-23", "description": "I just recently found this place with my boyfriend and I am hooked. The pastries are delish and the best part is that you get a free bag and no tax on their food. \nIdk why people are giving a bad review for paying 10 cents for a bag because the bags are free. You live in SF with a plastic bag charge on almost everything from grocery stores to etc. Smh. \nThe pictures will be misleading because those pictures are usually fake food looking like the real thing. Most restaurants and fast food places use fake food to take pictures with. \n\nAnyways, I plan to keep coming back and trying different pastries. \nThe service has been good to me as well and I love how they have their own tongs you use instead of all the germs from people's hands.", "author": "Star S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-12", "description": "This place has long lines, staff are rude, customers even more rude, parking is hell and loud like hell. \n\nCame here because I didn't want to run across town. There is always a parking problem here. Once in the door there is a line that forms for people paying for their stuff. People behind you will be standing 2 inches behind the other person thinking it makes a difference. At the register, sometimes they will have regulars that are in a rush, cut in line if not the cashier ask what you want in a rude tune.\n\nBut what are you going to do if you want a decent birthday cake but don't want to run around.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "This place is a newfound discovery in my world, but I'm enjoying it so far. I think the pastries are fairly priced. I come here before work with my guy and we love standing out like sore thumbs amongst the typical crowd that hangs at Sheng Kee. We are always pleased with whatever treats we choose. \n\nAnd the cakes are so beautiful! I always want to try one. Maybe one day I will!", "author": "Mariah O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "So many fresh baked goods here! I went around looking 2-3 times at everything because I wanted to get so many things. And everything was so cheap! Ended up with about 8 goodies for less than $15.. awesome! They asked me if I needed a bag which I thought was odd since I didn't think it would be ideal to carry out 8 different little pastries with me, but I said yes. I didn't know they charged for the bags.. 10 cents not a big deal, but they could have just mentioned it at least?  anyway I can't wait to eat all my goodies, the only downside is you're gonna have to eat everything right away before it gets old. Wish I lived closer!", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-15", "description": "Bought a selection of pastries:\nBBQ pork- flaky crust, savory filling\nEgg, Ham and cheese sandwich- sweet bread, has mayo, egg over cooked\nCustard bun- soft, custard inside\nFried chicken patty sandwich- red sauce ketchup based, chicken was ok, bread was sweet \n\nBBQ pork bun and custard bun was my favorites. I will be back for more.", "author": "Jai M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "BF got me the Taro cake for my birthday because he knows it's my favorite, and usually my family buys me this cake every year. \n\nMy family used to always buy the Taro cake in milpitas  & this location's taro cake is just as delicious. They use fresh taro to make the tasty filling  =)\n\n(http://www.yelp.com/user_local_photos?select=lUBeAawm2GoJvdW0WeGY9A&userid=NOKodUWSTYVUEpqBRCOfKw)", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-25", "description": "Cute bakery, I'm addicted to their breads.  I like their breads and eat them for breakfast.  At $2.50 each what a deal.  Their other pastries are okay as well.  Will return for goodies!\n\nUPDATE:  unfortunately their breads have partial hydrogenated junk in it, will have to stop eating it now.  Sad.", "author": "Eating And Living Well U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-23", "description": "It was pretty chilly so I stopped in for a coffee and ended up leaving with a box full of goodies.\n\nAlmond coffee is amazing! Indulged in egg tarts, sponge breads, hot dog buns and angel food cakes. Everything is light, fluffy and very tasty. I will definitely stop by again when I'm in the city.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Cheap. There is seating. On the newer side and clean. They sell boba. 5-10$ card minimum.\n\nRecommend: pineapple bun\n\nNot recommend: taro bun", "author": "Gee H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "Nice place - with an excellent location. The baked goods are on par with most 'good bakeries.' However, they don't do much to put themselves apart from anyone else. So, it's good, but I want more. The staff, wow, they staff, soooooo helpful and they carry a synergy that makes you feel better. \n\nI'll come back when I'm in the area and feel like having some regular baked goods. :)", "author": "Jane E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-16", "description": "Minus 2 stars for horrible staff - rude, seems to hate humankind in general.\nMinus 2 stars for questionable hygiene - have seen them drop food and pick it up all casually...\nMinus 1 star for overcharging me (on several occasions) because they can't cashier properly.\nPlus 1 star for decent pastries. \n\nOverall, I think I'll stay away which is a pity as I used to go here all the time...", "author": "Kay D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-21", "description": "Kind of dissapointed... Photos are deceiving. ..\n\nI spent about an hour in traffic to get through SF to get to this place. I was alittle iffy because I read the reviews, but I was just so desperate for bakery goods so I just judged the place by the pictures on yelp. And I was so wrong. All of their baked goods are not fresh and breads are hard and stale. The packaging could be definitely improved. They just gave me a box and stuffed all the pastries in there. No cover seperate plastic sheets for each of the goods. So all of the pastries would be touching and squished on top of another. I asked if they could put it in seperate bags but they just didnt understand me. \n\nI most likely will not be going back to this place. Sadly.", "author": "Crystal H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-14", "description": "I'm on the hunt for the best taro breads/rolls and unfortunately, Sheng Kee Bakery did not win this battle. I must admit their selection of various breads, desserts, fresh cakes and taro desserts were very impressive. Would you believe they had four different types of taro desserts?!? This is a taroholic's euphoria! \n\nFirst off, they had a taro root bun (not very much taro filling) and a pineapple taro bun which were very similar. Nothing special. Next, the taro twist had little taro paste inside with shredded coconut flakes baked on top. Lastly, was the small taro ball pastry with a surprise mochi inside. Everything was just okay... it didn't meet my expectations compared to my fave in the OC. \n\nThey also had one of my all time favorite: sponge cake but I resisted and dove into the taro desserts because I couldn't find those back home. \n\nSince I didn't get an opportunity to try the other fancy desserts, I could be missing out but will not know until another visit. One thing I appreciated about this bakery was all the pastries were individually bagged while sitting on the trays. No disgruntle workers here; just lots of standard Chinese baked goods.", "author": "Santi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-11", "description": "The last (brief) time I was here to pick up some Portuguese egg tarts, I had completely failed to notice how large this Sheng Kee was. Much larger than the small store-in-the-wall down in Daly City, and probably even larger than the recently renovated Cupertino location.\n\nTheir pastries are, as usual, quite tasty, and you're bound to find something you like from among their many, many options. And whatever you get, it helps to toast them first! Compared to their sister locations though, this one does carry a few things I haven't seen at other places, including a much more varied selection of custard-fill pastries. And let's not forget to mention the sales they throw, which is not something I've seen elsewhere: when I was there, they had a buy 4 get 1 free on the BBQ pork puff pastries, and a buy 3 get 1 free on the flaky mochi-filled pastries.\n\nAnother big plus is that they take credit cards now too!", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-27", "description": "Stumbled upon this place after walking around Irving. I shared a hawaiian bun with a friend. It was a bit greasy for my taste. Too much mayo and not enough pineapple!!\n\nI also got a portuguese egg tart since I haven't had one since Hong Kong last summer. They were SO GOOD in Macau.. but that's not the focus here.\n\nThe egg tart wasn't the best I've ever had but it was still really good!! The egg part was creamy and really soft, it was semi sweet and the crust was really crunchy. I didn't really see how it was \" portuguese \" style. I liked that it was still warm when it was served to me. A bit pricy though for an egg tart.. $1.35?\n\nAnother pastry I got was the lotus pastry. I was going to splurge and get green tea, black sesame, taro and much more but I ended up just getting black sesame since I wasn't sure if I'd like it. The pastry was good, it was flaky and filled with paste and you could definitely taste the black sesame but one was more than enough. \n\nGreat selection of pastries, but a bit pricey, I feel that you could definitely get similar if not same selections in Chinatown.\n\nP.S. the buns did look relatively good though, I might get some next time I'm around the area.", "author": "Virginia Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-07", "description": "I've been going here for years and least once or twice a week. In the past the service and products were AWESOME but now in my onion the service and products haven't been as good. \nThe new lady that's the cashier is rude and she always charges me more and when I tell her she just glares at me but CLEARLY it's a hot dog bun and NOT a HK Ham & Egg Bun. How can you confuse those? One is cut down the middle and stuffed with Ham and a wedge of egg, the other isn't! This has happened too many times to me now. I miss the older woman with short hair that used to be there all the time.\nSadly I won't ever be going back for a buns, maybe a cake for someone's birthday but never again for anything else, also the buns have gotten very salty. :(", "author": "Olivia O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "This is one of the better Sheng Kee Bakeries around the bay.\n\n-It's like a real cafe with coffee and boba (though I'd get my boba elsewhere like Wonderful Foods Co, a block down). And they got plenty of seats and tables for you to rest! It's never full (:\n-They always have the pastries you want stocked up. Pineapple buns, taro buns, hot dog buns, custard buns, galore! Did I ever mention how much their pastries are so soft and delicious! Packed full of flavor. \n-What I love most is the TOAST SELECTION here. To die for. Love the Taiwan Toast (though it's pricey for a whole roll... $5.49?), and Coconut Toast. YUM! I always buy some for my family so we can have a quick breakfast. \n-Wide selection of cakes. Never too heavy fruit mousse cakes and fruit cakes. Their cake rolls make a wonderful light dessert or breakfast (green tea roll with red beans!)\n-Service is always friendly. I've never had a bad experience with them. Yes, they don't greet you at the door, but they make sure you're in and out of the cash register. Good thing because lines aren't fun when you just want to eat!\n\nOnly bad thing is the parking.  Irving Street is so CRAZY. Swear. It's like a mini Chinatown. You can be lucky and find parking on the street (meters) or drive further down the number streets and you can find free residential parking if you don't mind the walk. \n\nI'd bring cash just in case (lots of banks and atms on Irving so no worries). I know the Sheng Kee at Skyline Plaza takes card now, but it doesn't seem like this one does yet.", "author": "Joan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "This is one of my 3 favorite bakeries in San Francisco, especially since it's next to 2 of the best tapioca stores in San Francisco.\n\nI have a sweet tooth so I used to drop $20 every visit when I lived in the SF bay area.\n\nThere's usually a lot of choices and even by the end of the day I still find 2 or 3 things left that taste fresh.\n\nThere's tables if you want to sit down (I usually get mine to go)\n\nThey raised their prices since I was last here but most of the pastries are very inexpensive, affordable and reasonably priced.\n\nThe staff always smile and although it can get crowded at some times, people are polite.\n\nParking can be a pain during the weekday before 6 p.m.", "author": "Jonah H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "Baos and baos, pretty small Sheng Kee area of baos but there are many.  Also they have bobo drinks for 99 cents.  Wow hella cheap, didn't even know until I looked a the receipt.  I have always loved the fake egg and ham bao since I was a kid.  Sheng Kee has a fat ass slice of egg with ham bun.  Sweet.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-26", "description": "I am torn because the pastries are really good here. \nHowever, I took down two stars because every time I go there (more than 20 times now), it smells like wet/dirty rag. A bakery should smell like butter, or at least does not smell like something that reminds you of a wet bathroom. \nI wouldn't say this if it was just one time. But I smell that odor every time I go there, and I do not have a super sensitive nose. \n\nMy suggestion to the store is : Whatever it is, a floor mop, a rag to wipe down the tables, etc, please please be aware that it is really important for a bakery to smell good! Please use disposable wipes or clean rags to wipe off the surfaces/floor!!!", "author": "Jane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-17", "description": "Sheng Kee Bakery is indeed cleaner than most leading Chinese bakeries. I've tried their sponge cake, pineapple, pineapple custard and cream cheese buns. Their pastries are very delicious and the amount of sweetness is perfect. I like that the sweetness in their pastries are the right amounts. I've been going to Sheng Kee and other Chinese bakeries for so long, I tried pastries from almost every bakery.\n\nI started feeling hungry for something sweet right after coming out of the KFC/Taco Bell restaurant across the street. So I walked across the street to Sheng Kee Bakery and bought myself a Chocolate Cupcake for $1.35 which was very decently priced.\n\nOther than that, I like the Chocolate Cupcake because the amount of chocolate is perfect and it is not super sweet. Every Sheng Kee pastry is light but you'll still get the right amount of sweetness from every bite. Although Sheng Kee pastries tend to be a bit pricier than other Chinese bakeries, but it is still worth the money spent knowing you found the bakery that satisfies your pastry cravings. Oh yeah, I've also tried their moon cakes before and it's very good!\n\nQuick Tip: CASH ONLY", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "Asian bakeries are the best! I was introduced to this place by my boyfriend, and I can't get enough of the taro pastries. I've searched high and low for my taro baked goods at other bakeries, but it does not compare to this yummie place! The prices are reasonable for the quality and the variety. \nCome early, so you can get the morning selection =)", "author": "Jemille G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-08", "description": "Geeze I hate the service here. Like every time I come in..I try to tip to see if maybe the cashiers would be nicer to me since I come pretty often..but nope. Crack a smile ladies! C'mon...lol.\n\nThe pastries are good, but the service is terrible. It's just so conveniently located for me that I always come in. It's an inexpensive, quick bite to eat and the food items last you until the next day. :P\n\nCakes are always a go-to for birthdays too. They had really cute ones for Father's day. \nWe usually get the Mango Mousse cake.\n\nThings I crave: \n- Chicken PIe\n- Canaan(spelling?) toast--bread with butter and sugar basically.\n\nAnother thing that's sort of unique: Green tea with mochi pastry. Pretty good--interesting to have mochi inside of a baked good, haven't had that before. \n\nBut seriously cashiers, be nicer to your regulars! -______-. Especially the ones that tip. I've stopped since then because it made no difference.", "author": "Mariel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-16", "description": "Grab a pair of tongs, cover your tray with a a piece of wax paper, and pick your favorite Chinese baked goods. My favorites include the blueberry cream cheese danish, pineapple buns, and the coconut bread. The sweet coconut swirls in the bread bring a nice gritty texture! Toasting it makes a quick breakfast to go. They have red bean moon cakes right now!!\n\nPrices range an average of $1.19-$1.89 per danish. It easily adds up when you see all the food behind the glass containers!\n\nSheng kee also makes great Asian cakes. If you've had them before you know they're lighter and usually contain fruit and only light whipping cream. They're so good :)", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "As Sheng Kee starts to close, and the clock nears 7pm.. Chinese moms and grandmas line up for the race to grab as many Chinese buns as they can get.  \n\nOn your marks, get set, go! Grab those buns!!!\n\nOKAY -- so maybe it's not a race, but it sure can get pretty hectic with all those Chinese ladies grabbing the half-priced buns.  Imagine, an outsider from afar watching these women DUEL to grab as many buns before others can.  It's actually pretty remarkable to see these ladies wait until the magic 7pm time arrives.  This tells you how GOOD their baked goods are.  They're all really delicious.\n\nWell, of Sheng Kee's baked goods, which would I recommend?  I like their taro root bun, their egg custard tart (dan taat), their almond crisp (delicious, buttery goodness! MMM!!!!), and most of their cakes (mango mousse cake is my favorite).  I also like their breads, like their pork soong bread, and any taro-filled breads are EXCELLENT.  \n\nI've been coming to SHENG KEE since I was a kid, and have loved their products for ages, and I'm glad Outer Sunset has this bakery!  It's a staple of Sunset's Chinese community and their fans.  Y'all should try some of their baked goods...better come before 7pm otherwise what you want might be snatched up! :)", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-02", "description": "I asked if I can get a discount on a bag of bread that is torn in the corner, since I don't like to waste things.  \n\"No we don't do discounts.\" Responded the counter lady.  \n\"but then nobody would buy this.\" And the bread won't be able to complete its mission to be eaten. \n\"Somebody will always buy it\" was the response.\nNow, I am fine if they would have put a new bag on the bread, or if they said the staff would eat it. Bit this we don't need your business and we don't have to try attitude really irritates me.\nI am taking my business elsewhere, and I hope you do too.\n\nedit: right after I put up this review, which isn't even viewable on yelp at this point, I got a message stating that I am just too cheap to pay full price.  I am just including full facts of what happend to me personally, you can decide for yourself what this place think about customer satisfaction and how they respond to customer feedback.", "author": "Jamie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "Located down the street from one its sister locations near 9th and 10th on Irving,  this can be a busier Sheng Kee location especially during daylight hours. Sheng Kee is a chain of Hong Kong style bakeries around the Bay Area. Although I think a portion of their baked goods are trucked in, I like the place and more importantly their HK style milk tea. \n\nThis location seems to draw a family-oriented customer base. My personal pastry favorites are the fruit tart as well as the spongecake like cupcake.", "author": "Paul F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "I come here about twice a week to buy a load of buns for my family's morning breakfast. The buns are of quality and are pretty tasteful. My favorites are the H.K. pineapple buns and the sweet bread. The cakes are delicious and has the right amount of sweetness and taste. It is much lighter than the American cakes and is never overwhelming or too rich for the sensitive taste buds.  The cakes are also creative and beautifully designed yet simple. The desserts are also very yummy with my favorite being the peach cheesecake. I savor the cheesecakes as they are very light, not too rich, and so yummy. \n\nSheng Kee is probably the best and well known Asian bakery in the Bay Area.  With a variety of delicious buns, desserts, and cakes they are one stiff competition.", "author": "Denise W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-10", "description": "11-9-2014 8:00 a.m\n\nWow, unbelievably horrible service!  Yeah the pastries are pretty tasty, but what happened to me yesterday was pretty ridiculous!  I had driven for an hour and had to pee really bad.  I asked the miserable ugly 21-30 yr old cashier for the restroom key and she gave me a stink eye and asked if I was a customer. Wtf? Duh I pointed to my wife and daughter as they were loading up a tray of goodies.  She says to me \"You can get the key after you buy.\"  Part of me wanted to give her an f-bomb along with a pimp slap but I had to go so bad I didn't want to argue at the time.  I grabbed a pastry and slapped $2 down on the counter.  As she gave me the restroom key I said to her \"WOW that is absolutely SHITTY service. I can see why you get bad YELP reviews.\"  After relieving myself I returned the key and gave her my biggest stink eye ever.  Wifey tried to calm me down, but f-that. I only wish I had taken a pic of this bitch to post up on yelp.  Good news was, the pastries were pretty yummy, and I didn't piss my pants.", "author": "Jian B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Great selection of Chinese cakes, mini cakes, and pastries. \nI stop by here on my way to school on some days, and I always find a sweet dessert to have during the day! The staff is great, everything is very dainty and organized. Super sanitary and easy to navigate. \nThey have a variety of buns as well such and pork bun, pineapple buns, etc. \nThey're prices are ALWAYS cheap, and you're bound to find something in their bakery. They have a huge variety from savory to sweet! I admit the pastries look better than they taste! But dont get me wrong, they're definitely good!\nDefinitely recommend.", "author": "Veronica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "I give them 5 stars for the high turnover, as in really fresh baked buns, danishes and croissant like pastries + I love their light fluffy sponge cake. \n\nI've been trying all the dim sum and bakery type places in the sunset area. For me Sheng Kee, is all about the pastry. Their coffee is okay if you want to eat your goodies there. But, this bakery is great for bringing home to the house guests something not found in many other places in the US. Garlic croissant twists, pineapple buns, ham & cheese in 4 or 5 different style buns. That furry shredded bacon topping is something I never tried before Chinatown, now I know what it is, I sometimes get that topping on buns here.\n\nEverything I have tried here has been very freshly baked. They refill their boxes of select your own goodies, constantly. There are other American or European style bakeries that rival the pastry they make here, but if you like the white flour, light fluffy, crispy stuff, that is not too sugary most of the time, this is the place.\n\nP.s. If you are sad that there are no twinkies, made anymore. One slice of their sponge cake, though triangle shaped and in 3 or 4 flavors, well :D it's very \"twinkiesk\" in that way only a little piece of sponge cake can be.", "author": "Uva D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "The smell is amazing inside! I can't write a good review because we came in looking for moon cakes (which are already prepackaged from an outside vendor), but they are tasty! Cash only -- no tax??\n\nSo glad to know this place is just down the block from where I live! I can't wait to venture down there to try something in the future!", "author": "Leana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-11", "description": "The place exceeds all over Sheng Kee's I've been to for sure! \n\nIt has your usual pineapple buns, taro buns, ham & cheese croissants, but also MORE -- a way bigger variety of rolls, pastries, and bread. What is a pineapple bun with taro inside? What is a sugar coated toast? Must try you all!\n\nWhat is It also has a lot of different cakes -- a slice is only $1-$2, not $3-$4 like the one in Richmond (East Bay)!!!!\n\nThis place also has a Peet's bar ....that also serves...BOBA. How ridiculously cool is this? \n\nHOWEVER.....Food review time.\n\nREVIEW: Green tea sponge roll with red bean filling\n\nSadly, this was just meh. The sponge roll was a bit hard because it was refrigerated. The green tea tasted a bit powdery as if the matcha wasn't mixed in well enough. I didn't like the red bean filling because the red bean was cold/hard because of the refrigeration as well. It just didn't mix/mesh well together. I wished the roll had more cream or something to hold it together since it was just dry overall.", "author": "Evelyn S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-14", "description": "I have a Sheng-Kee back at home, but since I was visiting SF, I wanted to see if there was a difference in selection in the Bay Area.\n\nThere was actually a smaller variety of things to choose from than I thought, and none of it really stood out to me or looked appetizing.\n\nAlso, the cashiers seem very uncaring and rude. I had my purse on the counter and she impolitely told me to move it to make room for the food the customer next to me wanted to put down. My bad, but she could have asked nicer. \n\nWhile they packed my food, they started squishing all of my goodies in this one box and didn't even care if they cracked or got smooshed inside. It seems that their most important concern was squeezing everything into the least amount of boxes possible.\n\nFurthermore, when I asked for a bag to hold my two boxes filled with treats, the same rude cashier snapped \"You have to pay ten cents\". I totally forgot about the \"paying-for-a-bag\" rule, since it doesn't apply everywhere. Okay...you shouldn't even be giving me that attitude when you didn't even offer me the idea of buying a bag when I was purchasing the Asian treats. But by that point, I was fed up with her rudeness and just left unhappily.\n\nNot visiting ever again. And their staff needs to take an anger management class or needs to learn how to respect the human population.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-19", "description": "Lots of selection. Cheap. What else can you really ask for? This is a good place to go (and any of their other locations, too) if you want a quick (albeit sweet) breakfast for cheap. Otherwise, I'm at Arizmendi.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "Good ol' Sheng Kee bakery!\n\nSheng Kee has always been baking up some wonderful goodies that are great quality - none of that cheap chinatown stuff!\n\ni personally like their hot dog buns and birthday cakes the most - so worth the prices.\n\ni must say though .. their service sucks! But whatever ... i go in to get my goods and i bounce.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Their buns are amazing. I love their pineapple bun ($1.15 each, I believe) and their dinner rolls (around $2 a pack). Texture is perfect for these: soft, with a little give. Sweetness is perfect. \n\nI tried their boba while they were having their buy-one-boba-for-$1-and-get-another-free promotion. It wasn't memorable.\n\nBut definitely go for the buns. :D", "author": "Tiffany N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "$5 minimum for credit cards, just so you're aware. Their stuff is seriously better than the other Sheng Kee's I've frequented. Somehow, it's softer and sweeter here. It also tastes like they might be using real butter. I am a little disappointed they were out of cockatil buns and egg tarts by the end of the day, but I can't really expect much else. Seriously, though, get a giant slab of almond butter toast. Dear lord, it's a heart attack of a slice, but man, it's freaking awesome.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "I've been coming to this SK since as long as I can remember... \n\nMy favorite pastry from here? Maybe it's more like a cake... The mocha roll! I don't think I've found any other place that makes it quite like them - just enough spongy goodness with a hint of mocha and cream. Yummy.\n\nThe bread and pastries here are all worth a try - they also sell small pineapple pastries, mooncakes, etc. Huge variety.\n\nI always get my birthday cakes from here. (: Huge fan of the Japanese Cheesecake! And though I'm not a fan of mango mousse, I actually like their mango mousse cake! Shocking. lol\n\nI think they've started serving Peet's Coffee and making boba drinks! But with such a huge selection in their local area, I haven't gotten around to trying any of their drinks.\n\nThe customer service here is what I would call... somewhat typical... not so great but you're only here to pay for stuff - customer service? lol.", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-08", "description": "Coming to buy a chocolate cake today and when i went home, the label under the cake said that it had expired two days ago....So, this bakery does not throw away expired goods???\nCheck the expired date everytime you buy something here.", "author": "IVY D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Really a 4.5 but what ever, I'm feeling giving. I'm a college student always looking for cheap but worthy food buys (caferteria gets boring). This place is to die for !\n\nFood is GREAT! When heated so I recommend racking up and saving for home heating. I'm just a proper foodie. Bathrooms could be better, they'll learn.", "author": "Ashana D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-14", "description": "I normally never come in here to buy bao. It's overpriced and it's just normal bao you can get anywhere else in Chinatown for cheaper.\n\nBut it was a convenience stop today. And I noticed that they also had buy one get one free bubble tea for $1.99 each! I couldn't pass that up.\n\nI got half a loaf of Taiwanese Toast. One of the ladies was putting new ones out and I wondered aloud if they were warm. She answered me haughtily, saying that it would never be hot because it needs to cool down in order to slice it. Okay. Thanks for the answer...\n\nAnyways, I lined up for the register and even though the line was kind of line, I paid in about a minute. I asked her about the buy one get one free deal, since the menu had some drinks that were actually worth more than $1.99. She said anything was buy one get one free and I was gonna tell her what I wanted when she told me that the milk tea was good. I was like okay, sure, and she proceeded to write it on one cup. And then I was starting to say something else when she said, our taro milk tea is popular too. Well, I was going to get taro milk tea anyways, so it didn't matter... I wasn't planning on getting normal milk tea (I wanted the thai ice tea or the hazelnut flavor), but I didn't mind too much. \n\nSo I got both without ice and waited for like, two minutes. \n\nI think their system is interesting. They give you a number which is on your receipt and then you show it to them when you get your bubble tea. Now, I also bought something else with that and I normally like to keep the receipts. The lady, who ironically enough, was also the lady who told me the whole \"warm bread slicing\" concept, was the one to hand me my bubble tea. She crumpled up my receipt and I thanked her. It was nice to hear a thanks back, since that's kind of rare in bubble tea places. \n\nFor the price, the boba wasn't worth it. Technically, it was $1 each. Eh. The milk tea was completely watered down! There needed to be milk, although the tapioca balls were chewy and nice, and it tasted a bit like coffee (which I liked)... Ugh. Watered down bubble tea. Not cool.\n\nI didn't try the taro one (got it for someone else), but from their words: \"It doesn't match up to Teaway.\" I'm assuming it was watery and lacked milk, just like my milk tea.\n\nI'll be back here for bao, and maybe to try another flavored milk tea. Who knows.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-30", "description": "A wide, interesting array of pastries. They have the right idea but I have to say some of the buns went overboard. I bought the cream coconut bun, both the buttercream and bun were too sweet. I tried the mocha almond cream bun, and same thing - bun and cream were way too sweet. I've had better cream buns in Oakland Chinatown.", "author": "Briget P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-07", "description": "After going to the one in the south bay I wasn't too impressed with this one. It is still cleaner than the bakeries in Chinatown and tastes about the same. The place does need a bit of a pick me up and they still use the plastic bags here. It makes all the pastries less appealing and the steam from the heat they emit when stuff in the bag softens the texture of many of the items. \n\nGreat place to get cakes from what I noticed.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "The Chinese character of \"Sheng Kee\" means \"earn/making a living.\" In some ways, their wonderful $1.50 for 2 buns deal after 7pm, truly meets the spirit of these two Chinese characters. (Ooops, maybe I should delete this part so I can still get buns after 7pm...)\n\nAlthough first founded in Taipei, this place doesn't have so much Taiwanese touch in it, but rather with a bit more HK style to me. \n\nPersonally, I like their pineapple buns a lot, taro and red bean flavor are both great. Green onion bun is also pretty good. They have all sorts of toast to choose from. Pretty impressive selections. The multi-grain toast is really healthy and I like it a lot. It's made with nice ingredients and contains with great taste. You can find the English explanation on the little item-name-card for each item on the shelves.\n \nAs for the pastry part goes, I personally love \"Snowballs\" the most. It's called \"yuki ichigo\" in Japanese, which means \"snow-strawberry-girl.\" That's also the reason why I like the strawberry snowball the most. (Mango flavor is pretty good. I personally can't resist berries though..)\n\nTheir moon cakes are simply spectacular, I love the tea flavor ones. Oolong tea, jasmine tea, green tea flavors are all great. They have some interesting baked savory items, such as curry beef dumplings and chicken pie, are both popular. As for the two different kind of egg tarts, I prefer Portuguese egg tarts more because it's made with puff pastry. The other kind made with shortcut pastry is good, but not my favorite.", "author": "Moneta L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-18", "description": "They have a wide selection of baked goods and everything is baked fresh daily. I came here because I was looking for the Portuguese egg tarts and they had it! The staff is friendly and I love that they take credit card; alot of Chinese bakeries are cash only which can be inconvenient. They have multiple locations too which is great.", "author": "Van H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-17", "description": "The baked goods are pretty delicious!\n\nThat said, the staff there is down-right rude. The lines are long and parking's hard to find.\n\nThe staff treats customers like they are a burden for being in the store. Their system for selling goods is a mess and the staff yells and each other and customers the entire time.\n\nAfter we paid for our buns, my girlfriend and I walked out and laughed at how ridiculous this place was.", "author": "Tyler K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-29", "description": "Came here a couple times before and everyone was very sweet and nice. However, the most recent time I went the atmosphere of the bakery was completely changed from what I remember. Once I walked in I could immediately tell there was tension between the workers. The shelves were dirty and there were big dead flies in a couple of counters. I got my bread and sat down with my friends. After about 10 minutes of eating and conversing with my friends, the new Asian short hair lady came over to us and rudely asked if we had boughten something. We replied that we had and she demanded for our receipt. Because we were done with out small bun, we had thrown it away. She told us we had to dig through the trash to find the receipt. Never have I ever experienced such bad service. Probably never coming back here again. The Asian ladies and rude and mean and don't use gloves while handling the food. There are better bakeries elsewhere and in SoCal.", "author": "Sharon G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "I first experienced Sheng Kee bakery goods while working on an HP running event in Cupertino several years ago.  I can still remember the pineapple bun with the sweet peanut butter filling and the miniature moon cakes with the lotus paste.  Shortly after that visit I found out that Sheng Kee had a location in San Francisco.  I have been a regular customer at this location ever since.\n\nAlthough I truly miss the peanut butter version of the pineapple bun, I regularly purchase the ones with the custard or red bean paste fillings.  I love the custard bread with raisins, and on more than one occasion I've found myself eating an entire loaf of bread in less than 24 hours.  I like the sliced cake rolls also especially the orange or strawberry ones because they have a different flavor and they're not too sweet.  The super flaky beef curry pastry found inside a hot box near the counter is very good.  This morning I tried the moon-shaped chocolate bun for the first time, and I loved it.  This is without a doubt my favorite Chinese bakery in the City.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "I literally, just this moment, had their almond croissant. OMG, DELICIOUSNESS!\nThat almond croissant alone deserves four stars, lol.\nOverall, I'd probably give 3 stars but DAT ALMOND CROISSANT = 4 stars :)\n\nI've tried their pork sung bun, pineapple bun, bbq pork bun, cream cheese bun and egg tart. They're all average-tasting. Hubby and I both like Sunset bakery's pineapple bun a lot better.\n\nThe boba milk tea isn't bad if you're really craving it.\nMaybe a bit sweet, and I'm a person who loves me some sugar.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-20", "description": "MMMM!!! I LOVE WARM BREAD!\nI literally touched all the bread to make sure to buy the warmest one. The housemate chose a warm red bean bread, and I ended up choosing another warm one, forgot what it was called, but it had an interesting center - I wasn't really feelin' it though. I also grabbed a taro vitasoy that totaled up to around $3-4ish. The environment was nice and fun to chat in, but I definitely had yummier (and cheaper) bows elsewhere. Overall, I'll give them a B+!", "author": "Linda K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-29", "description": "Food - 3.5\nService - 3\nAtmosphere - 3\n\nOverall - 3\n\nIf I wrote this review 4 years ago, it would probably be an easy 4 stars. But there have been so many changes to this franchise and the quality of it's bread that I give it a lowly 3.\n\nFor one, the quality of the food has dropped tremendously. The raisin custard buns are less crispy, the sugar seemingly more saturated. The onion breads are less onion and less bread. Almost every single item on the menu has fallen in size, and uses a ridiculously low amount of toppings it's stupid. It really is.\n\nThe prices have risen. Kind of ridiculous as well. That enough merits the lowering of overall stars.\n\nThe only positive is the consistency of the heated pastries (normally located by the register) namely the curry horn, bbq pastry, and chicken pie. All still delicious, and even with the price risen I would still spend the money on it.\n\nWould I come back? Yes, for my childhood. Do I buy many of the breads anymore? Never.", "author": "Dion W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-06", "description": "The pastries , cakes, buns, breads are great! The customer service ok. but that's kind of expected for this place right? Um.\n\nLots of variety.", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Like 85 degrees but not. Really good cakes. One of the few places in the city that I get cakes from. I love that they have sun cookies (flat flaky pastry filled with sweet yellow lotus seed paste), but the pastry part wasn't as good as I hoped. The pastry was really good in the melon cookie (same concept but with melon filling), so I may have just had a bad batch of sun cookies. \n\nOverall, good pastries, fun to try all the different kinds. Very good cakes.", "author": "Leslie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "You're no 85 Degrees, but your buns still melt in my mouth and cause great waves of pleasure to cascade through my body.  \n\nYour custard buns are heavenly, taro buns divine, your hawaiian buns are best HOT out of the oven..and your custard bread can be eaten alllll dayyy long.\n\nI'm not a bigggg fan of your on tots...best get those in china town, but the buns the buns....I can't get over your buns.", "author": "Aly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "I don't know if it was one of those days where I was so hungry I can eat a cow or that this place has the best pastry I've ever had. It was not only delish but also price friendly. My favorite is the milk bun and brioche! The coconut bun was good, too, bun the red bean was just ok. I'm from Sacramento, wish they had that kind of goodies here. I'm sitting craving the brioche!!!", "author": "Samira M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "The last time I was here was in high school.  Goes to show that I don't get around in Irving much.  However, I practically ran over to buy a drink at this place after my horrible lunch at King of Won Ton.  Bought a slice of chocolate roll, apple turnover and a chocolate/vanilla square cake for the family to nosh on.  \n\nThe cakes were very chocolately which is rare for Chinese bakeries because they usually look semi-brown.  I really liked the flavor of the cake and it was fresh too!  DH said the apple turnover was excellent.\n\nBought a whole chocolate roll to take home.  That was $5.  What a deal considering some places in Chinatown charge more.\n\nWill consider gettting birthday cakes here!", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I often miss Sheng Kee when I'm in socal-- I love their shredded pork buns, ham/egg/cucumbers bun, dan tats (custard tarts) and basically everything! I don't think I've ever purchased something and didn't love it!\n\nWhile I'm super excited about 85 degrees here in Irvine, I still have to say, it's no Sheng Kee! Sheng Kee cakes tramples all over 85 for SURE! Like I said, almost everything is good in here! Perfect for breakfast, snack or even a light lunch!", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "I really like their pineapple buns and the yellow swirl sponge cake. It's so delicious and you know its fresh too! \n\nThe Mango Moose cake it yummy too! So is the fruit tart! \nCall in 24-28 hours in advance if you want to change up your fruits in the fruit tart.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "Loved it!\n\nI saw a great and extensive selection of cakes and pastries. Too bad I couldn't try it all! We purchased a strawberry mousse cake for a family dinner. It was my first time having a mousse cake, and it was nice and light. There were peaches, kiwi, and strawberries on top, it made the dessert feel a little healthier. The cake reminded me of a sponge cake. It's hard to find these bakeries in San Jose.", "author": "Camery V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-05", "description": "Sheng Kee is a necessary evil. Why is it evil? For a Chinese bakery, it's not that great. Why is it necessary? Cause sometimes I'm in the area and I need a quick bite, and nothing fits the bill for an in-between-meal snack like a cha siu bow.\n\nIn fact I get my hair cut around here, which means I get here after my long ass commute, before getting home for dinner, but already a little famished.\n\nOnce a month. Same routine.\n\nAnd there are the other places I stop by, Walgreens, Wonderful Foods, etc. But in the case of those places, it's either necessities or boba, respectively.\n\nAnd then there's cha siu bow at Sheng Kee. I guess that's better than the taco supreme at Taco Bell.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-22", "description": "I believe this place bakes rainbows and happiness into their pastries.  I Love me a good Chinese bakery, and this place takes it to another level.  The selection of buns and pastries is huge, and range from sweet to savory.  While its not a cheap as a lot of other bakeries, all of their items are so flipping yummy that you wont hear me complaining.  \n\nTheir cakes are stunning - hopefully I will have a good occasion where I can try one soon.  \n\nIf you want a truly incredible snack - try the cream cheese bun!", "author": "Virginia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-03", "description": "I like getting Almond Croissants ($1.89) here. I also liked their milk tea actually (regular or almond), although the almond milk tea is very sweet.\n\nI would not recommend the weird croissants like green tea mochi.", "author": "Derek M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-03", "description": "Forget Safeway cakes for your kid's birthday. You won't find any neon yellow overly sweet icing on Sheng Kee cakes because they're light, tasty, and just plain wonderful.\n\nThey also offer pastries and rolls. Try any of the following and you won't be disappointed: black forest cake, strawberry mousse cake, chocolate roll, red bean green tea roll, taro toast, fruit tart, pineapple bun, egg custard tart, almond cookies, ham and onion pastry..I could go on and on!\n\nSheng Kee is spacious with lots of seating, clean, comfortable, open early, and very affordable. Take a friend here, load up on goodies, and then sample each other's..but don't fight over the food!", "author": "Patty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "\"Asian pastries that white people love\"\n\nOverpriced for what it is, quality is pretty average all around. Nice variety, but I'm not a fan of over half their inventory. Their more traditional chinese pastries are ok, overall a bit too sweet for my palette, but it does not surprise me that they would make their items on the sweeter side.  \n\nTheir fruit cakes are terrible. I don't know why people love that crap, there's too much damn cream, the actual cake is pretty delicious but the ratio of low quality cream and canned fruit outnumbers the cake in like a 10 to 1 ratio. Maybe people think that cake is more healthy because there's so much fruit? It's garbage. You want fruit, eat a pie. If you gotta have their overpriced cakes, go for the ones with the taro or walnut cream fillings. Those fillings are actually pretty good. Not mango though, that is pretty disgusting. Mango cream? Who came up with that idea?  It's bad.  I don't even know if they have chocolate cake because nobody ever buys any other cake from this place other than that goddamn fruit cake.", "author": "Wes C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "Founded in Taiwan, Sheng Kee is now in most major metropolitan areas in California.  For the most part, they're surprisingly consistent from store to store.  It's a good reliable place to get Chinese pastries and Sinicized western cakes.\n\nSome of my favorites are their sweet buns filled with taro, coconut, custard, or cream (Chinese interpretation of the Mexican Pan Dulce), Portuguese Egg Tart which is similar to an egg tart but caramelized (served warm), Curry Pastry Puffs which is really good here (served warm), moon cakes and various traditional Chinese pastry.  Their Asianized cakes are pretty good as well.  They're generally not as sweet, use more whipped cream rather than frosting and are airier than their Western counterparts.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "I like this Taiwan style bakery.  Great selection, friendly staff and reasonable prices.  I lived in Shanghai for eight years and there were many similar style bakeries there...Sheng Kee is very much like them.  If you like your baked goods with a \"slightly less sugary\" take than our local SF bakeries (and I do, though I'm a born and bred San Franciscan) you can't go wrong with Sheng Kee!", "author": "Matt D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "This place has been my go-to bakery fahevuh. Super cheap, quality Hong Kong style buns, pastry rolls, muffins, etc. Best part is the cakes, which are truly excellent, especially the mango and chocolate ones. Well worth a trip across the city if you're on the Bay side of things. $2 for a super flaky, fresh baked apple turnover? I'm there.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "I was pleasantly surprised on how yummy everything was.  I bought about $10 worth of pastries and for some reason I had a craving for taro so I picked almost everything taro.  The custard bun was also delicious and will definitely grab more of those next time.  The Dan tat's did not travel well and were mushy by the time I got home.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-14", "description": "Stocked daily so get here early if you don't want to miss out on your favorites.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Yes, CLEANER than most, to quote Bennett W.  -and, A BAKERY FOR ALL SEASONS.\n\nStep to the self serve lucite pastry bins, directly left of the entrance, like jewels in their respective showcases.  -then, U around to the small case, past the bottled soft drinks, past the assorted sliced breads and baguettes,  heating filled savory crescents  by the cashier's counter. \n\n You will see the French pastries directly ahead when entering, in the chill case beckoning you with colorfully decorated pieces of sugary delights in all shapes & sizes.  \n\nThere is seating for patrons who want to imbibe their treats immediately.  Coffee & tea and soft drinks are also available.  -needless to say, catering to an appreciative international  neighborhood.\n\nIt could easily become a daily habit!", "author": "Clifford L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "I've tried Sheng Kee Bakery's cakes a couple of times and they are perfect for elderly Asian folks. My relatives such as my grandparents, aunts, and uncles would always say everything is too sweet, but not the cakes from here! I ordered the Black Forrest Cake for my dad's birthday dinner. Everyone loved it and said it was just right for their taste buds. This is the to go spot if you want to please your elders. This cake was light and fluffy and not sweet at all so I knew the older relatives would like it.", "author": "Anji W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-28", "description": "To be honest, 85 degrees beats this place's butt. \n\nMoon cakes were pretty good. I miss the ones I get from home, but the small ones are a bit pricy, but they're definitely good. I tried the red bean one and the pineapple one and good.\n\nPineapple buns were pretty good. I got the one with custard and it makes a huge mess, but ya know, it's a pineapple bun. if you can't get that right, then there are big problems.\n\nThe hot dog and cheese bun (which is a fave of the bf) is pretty good. I don't love the cheese in a bun, but it was decent. \n\nIt brings me back home to socal where these baked goods are everywhere and it's nice to be reminded of it.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "3.5 stars, rounded up.  \n\nI was walking past here tonight on my way to dinner and got distracted.\n\nFor good reason too.  \n\nBecause starting at 7pm, all the little bun items are 50% off!  \n\nMe = Chinese = the most frugal of all the Asians = sales make me HAPPY.\n\nCome here at 6:40pm to get the goods.  Around 7pm, most of the good stuff is gone.  The trick, perfected by the many Asian mommas, papas, and grandmommas and grandpapas, is to come at 6:40pm, grab your desired buns, and then just stand around and wait until 7pm to pay for your food.  Very Asian, I know.  \n\nThey have all your standard buns that you'd find in a nicer Chinese bakery: red bean, green onion, hot dog and green onion, pineapple buns (and, as the sign clarifies, \"pineapple look alike crust, no pineapple inside.\" LAWL.), taro buns, custard buns, and much more.  I like the red bean ones as well as the corn-ham-mayo-grease ones.  DELICIOUS.  They also have cakes (MANGA MOUSSE FTW), perfect for birthdays or any other occasion.  \n\nI only bought 2 buns tonight, but the Chinese momma next to me was piling dozens and dozens of buns on her tray.\n\nI was like DAYAM, WOMAN.  \n\nShe explained to me while we were in line that it wasn't all for her.  It was for her eight children.\n\nRight.  Right.  Chinese mommas don't have eight children.  \n\nAnyway, I'll admit. . .I was actually pretty tempted to load up on more, but I overheard one Chinese momma say, as she was inspecting the buns carefully, \"Zhen de bu jian kang!!\"  which roughly translates to \"This is really unhealthy!!\"  \n\nAnd then I looked at the buns, saw the grease, and decided that two would be enough.\n\nFor now.\n\nBut anyway, this place is otherwise awesome and authentic.  And it's on Irving Street; you can't get anymore authentic than Irving.  \n\nI'm talking about everything west of 19th avenue aka Asian-side-Irving. \n\nThis place only loses 1.5 stars because it is FREAKING EXPENSIVE for an Asian bakery.\n\nOkay, so you might come in, notice that all the buns are like $1.50 and be like, Vivian C. what are you talking about?\n\nUh. . .well, if you know anything about Chinese bakeries, you'd realize that anything over $1.00 is LE EXPENSIVES.  Their chicken pies are $1.50.  WUT.  Chicken pies should go for roughly 80 cents.  \n\nBut whatevs, it's still cheaper compared to everything else in this city, so you still come out with a good deal.  So, it's all good.\n\nI love my Chinese bakeries. JIA YOU*, Chinese bakery!\n\n*JIA YOU = pretty much Chinese version of FTW", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-01", "description": "3.5 Stars.\n\nLove the HK Style Chestnut Cake!! Light, airy cake packed with a thick layer of chestnut bits/paste, and topped with fresh fruit. YUM! The presentation looks very nice also. Definitely reminds me of those bakeries in HK. However, it can be kind of pricey since a 6-8\" cake can be ~$30. But I think it's worth it :) However, if I'm not ordering a chestnut cake, I would choose Schuberts (in the Richmond) over Sheng Kee.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-19", "description": "hmm...it's just like the description after the rating...\"A-OK'.  Nothing that really excites me.  The place seems clean but my pineapple custard bun doesn't look like those i remember eating as a kid.  Maybe this is now the cool way of making them and I'm just outdated.  A good pineapple bun to me has a nice thick layer of that crunchy stuff on top.  The only one that resembles pineapple buns from my childhood were the regular ones. Meh.  I want the custard.\n\nThe cocktail bun was good.  I ate it the day after I bought it, had it in the sealed baggy but it was kinda dried out already.  Still, the inside is yummy.  The \"old lady\" cookie is good too...not too sweet and the filling had the right amount of chew with the extra flakey outsides...i bet a ton of shortening was used.\n\nSK isn't mind blowing, but if I'm ever in the neighborhood i'll stop by for sure.", "author": "Sally T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "Sheng Kee has been one of my favorite since I was a kid and this one was not a disappointment! I got the wheat bread which is so gooood. I love how their thick toast and so soft.. I also got the shredded pork bun for my brother which we pretty much grew up eating.  They have such a huge selections of pastries and buns.  They're fresh and you can never go wrong with that. \n\nTheir service is very friendly and there's a seating area too so you can enjoy it there.  \n\nHonestly, Irving is the street to be for good food.  Sheng Kee's really convenient too because there's a bank either on the same block or one down and the only downfall is probably parking but sometimes you get lucky with the residential areas.", "author": "Lisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-23", "description": "Sheng Kee always does me right! Today I had the potato salad sandwich and a cup of coffee. It set me back a whopping $3.76. Thanks Sheng Kee.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-12", "description": "Asian bakery is all there is to say. If you want asian breads or snacks you can get it here. Occasionally buy cakes from here and they can be pretty pricey....bought a cake for my grandpa's birthday and it was $24 bucks... Not such a big deal but the cake is only about 8in? maybe 10? I would have rather bought a cake from safeway.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "Decided to stop by Sheng Kee this morning just for a quick and inexpensive breakfast.  Probably not the most healthy meal, but I went with the egg custard tart (not the \"Portuguese-style\" one) and the pineapple bun with coconut. The pastries all range from about $1.35- maybe $2.\n\nService: No line or hardly any wait at all at 9:00 in the morning.  To the point, and you're in and out.  Simple.\n\nFood:  Both the pineapple bun and the egg tart were soft, flaky and light--good textures.  The coconut paste in the pineapple bun had a subtle flavor and not too sweet, which I liked.  As for the egg tart (dan tat), it wasn't anything overly amazing, but I definitely have no complaints.\n\nVerdict: Sheng Kee is pretty good if you're in Irving--tasty, quick, and cheap.  Although, if I had some extra time, I'd walk the 5-8 minutes up to Sunset Bakery for the baos and other pastries or head down to Golden Gate Bakery in Chinatown for their egg tarts. Mmm.  You get a good deal, but there are definitely some other reaaally good options in SF.", "author": "Lindsay L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "Pastries/buns - average\nCakes - yum, above average\nVariety - good\n\nI like to come here predominantly for the cakes. I'll come for the pastries if I'm in a bind, but otherwise I'll get them for bakeries in Oakland Chinatown which I think taste better. This SKB has pastries/buns, cakes, sandwiches, dessert rolls, beverages, snacks like mochi and small moon cakes, dan tat (egg tarts), and a couple hot items kind of like little Asian hot pockets in the morning and midday.\n\nDecent place... tables aren't the cleanest. Parking is street and metered. Pay the 25 cents/ 9min. It's worth it. I see lots of parking enforcement along Irving and they are not shy to give tickets.", "author": "Jenn D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-06", "description": "It's okay. The thin almond cookies are good.\n\nThere is an asshole who works here who needs to take customer service 101.", "author": "Erica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Love love love Sheng Kee! I grew up eating Sheng Kee since i was in elementary school and now that I have gone to college I tell EVERYONE about it. I use to always get their Coconut bun, but now they have cut down the size and amount of coconut on it I would recommend my coconut lovers the Pineapple Coconut Bun. They put wayyy more filling inside and it's much softer. \nAlso, a couple of my stable picks are, the Pineapple.. custard and red bean buns! Another good quick breakfast food are the rolls they have on the bottom display.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-01", "description": "Sheng Kee's a chain bakery that's popped up in quite a few places. They sell a great selection of baked Asian good ranging from hotdog buns to cakes. The prices aren't cheap as the mom and pop bakery shops around various places. Their overall quality of parties and cakes are average.\n\nOne lame thing about the Sheng Kee is they store their pastries in room temperature plastic boxes. There's nothing like a good warm pastry.\n\nThe overall quality of their pastries are mass produced tasting quality. There isn't that special something that a mom and pop bakery puts into their pastry. There's a few things that stand out over the rest. Their thick sliced bread are good. The cheese hotdog buns are tasty.\n\nThe cakes are better looking than the plain supermarket cakes and they taste better overall. It's more asian like cakes here with all the fruits compared to other traditional ones with creme and jelly.\n\nOverall, Sheng Kee makes some decent quality pastries and cakes. They don't have the quality compared to small places.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-07", "description": "This store does not abide by the saying \"The customer is alwasy right.\"  Last week, I went in to purchase my 99 cent Thai Iced Tea.  The girl behind the counter did not put ice in my drink.  I'm American, we like our ice.  I asked for ice and she basically refused to provide me any. \"Oh, it's cold enough.\" I then proceed to ask for my money back if they can't provide me ice.  It took seriously three minutes to resolve.  I receive another Thai ICED tea, bu tthis time with ICE, but I had to fight for it.\n\nI'm not going back there again.  They can kiss my ICED ass.", "author": "Jean A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-17", "description": "My family has a long history with Sheng Kee.  When we lived in Sacramento, we would always visit this bakery when we visited the Bay Area to buy the next week's breakfast.  But for some reason we stopped doing that & I think I know why now.  The boyfriend & I decided to grab some ready'set breakfast since we both have to get to work so early.\n\nThe Pineapple bun was completely hollow on the inside.  Although the top was crispy, it was nothing special.  The Pineapple custard bun was like the regular pineapple bun but it was just filled with not a lot of mediocre custard.  The Cocktail bun was tough  & the filling was way too sweet.  The BBQ pork bun was mediocre @ best.  The Hot dog cheese bun - one of my favorite things to eat - was super salty & the cheese did nothing.  Finally the Curry beef horn.  The pastry was thick & therefore tasted raw & the filling did not have a lot of flavor.\n\nThe food was all nicely packaged & the store is really clean.  Unfortunately all of that doesn't matter when the food is just par & the prices are high compared to the many bakeries that exist in the immediate vicinity.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Hands down my fave bakery in SF. Popped by here for a bakery snack on my way for a long drive. Ended up trying several things: chocolate croissant, BBQ baked bun, garlic bread, chicken pie, beef curry horn.... And I can't wait to come back and try everything else. Extra fresh. Extra flaky. Extra tasty. :)", "author": "Judi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "I'm a sucker when it comes to baked goods in individually wrapped bags. Sheng Kee has an assortment of yummy buns and pastry all nicely put together in clear-view wraps. The red bean buns and raisin bread are my faves. And all of their delectables are freshly baked DAILY!\n\nParking is a beeyatch in the Sunset District so head over to WestLake Shopping Center instead.", "author": "Dee T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-10", "description": "This was a simple stop we made while visiting SF.  the selection here is pretty good.   Pretty straight forward place.   The goods were tasty and the Taro boa was nice.  Check this place out.", "author": "Mo m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "I'm not sure what the hype about 85 degree bakery is in SOCAL. I went to college in Irvine and when 85 opened up, I was like... this is just like Sheng Kee from Frisco where I grew up except there a super amount of people in line all the time.\n\nSheng Kee is what I grew up with and to me it's always better than 85. The taro bread and the custard bread here are super good. My family always loves to get our cakes from here, with the super nice looking mango (and tasting) fruit cakes being the favorite, while sometimes we stray and get the taro or something else.\n\nDelicious", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-01", "description": "Disgusting. Tried 9 different mini cakes at a dinner party. Shared them all and threw them in the trash after 1 bite. 9 people brushing their teeth and using listerine to rid the taste. Unfortunately the memory stays.", "author": "Marina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "Mien Bao?  Bread?  Dahn Go? Cake? Beng? Cookie?  yes, they got it all.  All in that nice little shop with the glass panels and plastic wrapped individual pastries.  I've been coming here once in a while, mainly for the cakes and tarts that come out of this wonderful shop.\n\nI absolutely like their Fruit tart as it is such an eye pleaser and taste bud pleaser too!\n\nLast night, I came here to get a cake for my mom's birthday.  And being the picky person she is, no cheese, nothing too sweet, nothing chocolate or coffee, nothing too tart, and some other ones I can't remember.\n\nBut the great thing about them is that their cakes are not only delicious but I was able to find one that met all my mom's desire.  They had a Mango Kiwi mousse that looked hella good, and tasted good too.  \nhttp://www.yelp.com/biz_photos/pWVSjwLLjclFGWmhkqsWLw?select=cTkhSx7oVZv2ikgypUWRhQ \n\nI was even tempted to grab a hotdog cheese bun as a snack, it was alright.  maybe if i heated it up, it woulda tasted better.", "author": "Vincent K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-06", "description": "When I first came here, I was amazed at all the differest kinds of pineapple buns.  Seriously, there's coconut, taro, custard, chocolate...and of course, original and HK-style original (apparently there's a difference).  I've had all of them, and like snowflakes, they're each original and unique.  Having said that, given the amount of cholesterol in these things (the topping is made of egg yolks plus sugar), perhaps these are best as a once in a while thing instead of a regular habit...thing.  Anyway, for a really interesting pineapple bun experience, try toasting these (especially the taro and chocolate ones)...they get all crunchy on the outside, but the filling gets nice and gooey.  Yum!\n\nMoving on to the other buns, I've had \n- the taro twist (a personal favorite; wonderfully mild flavor...eat 'em hot), \n- the coconut twist thing (also delicious and also not that healthy)\n- bbq pork bun (i've had better..and cheaper)\n- red bean bun and taro bun (see bbq pork bun)\n- moon shaped chocolate bun: unique.  I can't say I've ever encountered a bun quite like this one and I'm still not sure what they were going for with the Mexican bun crust plus the super sweet chocolate inside.  Still, I've had it more than once, so I guess it works on some irresistible level.\n- vietnamese sandwiches: the ones at irving cafe & deli down the street are better, plus I bit into a jalapeno and my mouth went numb for an hour...\n\nSome other reviewers have mentioned that this place is pricey, and it is (in fact, their prices have gone up recently).  Plus, they no longer have the special $1.50 for any two buns after 7:00 pm thing (I once saw an old Asian woman knock a plastic tray full of buns out of another old Asian lady's hands...intentionally).  I'd say those two things have knocked them down a notch in my book, but as was mentioned before, this really is the only nicer Asian bakery in Richmond/Sunset, so if you're looking for a higher caliber of bun, this is it.", "author": "Jeffrey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "We really have enjoyed this place. Very tasty buns and cakes. Everything seems to be made fresh on site. Wish they had even more selection. Also like how there is an area in the back where you can sit and enjoy a bun with a coffee.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "this is my favorite spot for getting milk tea. $1.6 a cup.  much cheaper than cafe bakery, ABC or most places.  And you don't need to add sugar because it is ready to drink already with cream and sugar.  The sales ladies are all very nice!  i love this place.  Thank you!", "author": "D F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "Out of all the madness getting in and through San Francisco, this bakery was pure joy. Coming from the SGV into Bay Area was a complete turn-around for me and I was so confused by the way everything worked and how people even got to places.. it looks like hell. (First time!) Every where we drove, we were lost and confused. This place made me feel home, and their bread is just as good as it looks and the pricing is decent.\n\nAlso a plus because their store wasn't as tiny as the neighboring \"restaurants\"", "author": "Cinpy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-16", "description": "The cream puffs are amazing. They're kind of like a filled egg pudding or something like that. They're my favs. The palmiers are among the best I've had.\n\nVegetarians, beware! I bought several yummy goods here for years... then they started labeling the ingredients and I saw that my favorite tart had LARD in it. Yes, LARD.\n\nThat aside, the desserts are just fabulous.... just read the ingredients before you stuff your pie hole.", "author": "Amelia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "This place is adorable, seems to make the food fresh, and has a huuuuge selection. I recommend practically everything with cheese on it. All their buns and savory foods are delicious and very cheap!", "author": "Cecilia A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "We stopped by to pick up a few of our fav Chinese baked goods.....we bought the custard filled bread loaf, Hong Kong pineapple bun, custard filled pineapple bun and a taro filled pineapple bun....\n\nThe custard bread is so yummy....freshly baked Hawaiian sweet bread with layers of custard..........we ate the whole loaf in a few minutes.\n\nThe pineapple buns.....so many different types and fillings, so fresh and sweet....and all so good.  Plus...they are all wrapped individually  to insure freshness and ease of eating neatly.\n\nFor a few bucks......my sweet tooth and hunger pains were gone!", "author": "Raider J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-08", "description": "Expensive!!! they asking high price for a bun. \nTaste just like so so, but no surprise.\nBy the way, they are not offer buy one get one promotion any more.", "author": "SteveMorris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-25", "description": "The pastries here are hit or miss.  \n\nThe hits are true hits:\n-the almond croissants - super almondy, great flakiness to the croissant\n-curry puffs - these are so delicious when warm\n\nThe things that I've tried and haven't liked at all:\n-the taro pastry - looked promising wearing it's nifty plastic baggy, but when I tore into it I discovered it tasted like turd.  Maybe I'm just spoiled by the one's at 85 degrees C, those taste like heaven when you bite into them\n-the brown sugar cake - this one looked like a turd, but i decided not to be judgemental.  i should've been, it tasted as it looked.\n\nA couple other things I picked up but haven't tried yet:\n-egg custard tart\n-portuguese style egg custard tart\n-i didn't pick up any cakes but I just wanted to mention how pretty the cakes looked, will definitely try some the next time i'm there\n\nI have about 100 g more of processed sugar in me now than before I went to Sheng Kee.  I think the sugar low is about to hit, means its about time to take an afternoon nap.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-31", "description": "clean. decently priced.\nI just picked up an 8 inch strawberry mousse cake for my youngest brother's birthday.\nthe thing with Chinese cakes is this: you must remember that the frosting is always much lighter and more airy than your traditional American cakes. \n\nI normally don't like frosting on Chinese cakes, I just can't stand the white cream or the way the cream they use to make flowers tastes. \n\nSHENG KEE FROSTING IS DIFFERENT! \n\nIt's so damn good... I enjoy it. It's not TOO sweet which and it is never too rich. \n\nTheir other pastries are good too. Custard bread is one of my favorites, I used to just eat a few slices for breakfast...\n\nI miss the days when one of my uncles worked here. My family freaking grew up on Sheng Kee pastries..", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "CAKES CAKES CAKES!! ...and pastries.\n\nThe cakes look beautiful and taste amazing. One of my good friend got me a green tea mousse cake with red bean filling for my 18th birthday. It was not exactly the best tasting cake, but it was still pretty good. The taste of green tea was potent but the filling was sweet, so it counterbalanced the bitter taste of the green tea. The mousse cake was light and fluffy - perhaps too light and fluffy. I prefer my cakes to be a little richer and denser.\n\nI say go for the chocolate cakes and you won't be disappointed! The fruit tarts are a winner, too.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "That is one of my favorite bakery, everytime when I wake up late, I will go sheng kee to buy breakfast before work, but I only buy sandwich, because their bun kind a expensive. I also love their cake especially tiramisu and the cheese cake, eat them all the time! Yummy!!", "author": "Emily W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-13", "description": "This place is delightful. The cakes are nice and soft and their $1 tapioca drinks are tasty. The only issue I have with this shop is the conditions of their eating area, the tables are dirty and the couch/booth is worn out and ripped.", "author": "Riko H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "Sheng Kee Bakery has delicious pastries! They have such a variety of different buns and breads and cookies. They have sweet to salty, lunch to dessert, and chinese to american styled pastries. \n\nTheir loaves of breads are oh so tasty - my favorite is the coconut and custard bread. It is soo buttery, and soft , compared to American styled bread which is coarse.\n\nThey also have light, fruity cakes for birthdays and you can order there or pre order. The prices are a little high for these pastries and cakes but you get what you pay for. I come by and buy a bunch to bring home to my family and friends if I am around the area!", "author": "Alice T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "Everything's overpriced and they don't have any signature items. Their pastries and breads all have a really rough texture and are chewy. Their cakes are fine though. I especially enjoyed the chestnut cake and the Japanese cheesecake.\n\nSheng Kee is like the ONLY upper-scale Asian bakery chain in SF and that's not a good thing. It'd be good to have more competition since they pretty much have a monopoly. COME TO SF, KEE WAH BAKERY!!!", "author": "Cheri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Vanilla or chocolate?\n\nBoth. As a sponge cake. With a layer of cream between the two halves.\n\nBuck in price. Much more in taste.\n\nImpossible?\n\nSheng Kee makes dessert fantasies come true.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "Sheng Kee offers walls of unique savory and sweet exotic flavored pastries baked on site AND they offer Peet's coffee. I prefer the low budget pineapple bun. No pineapple included; simply a sugar criss-cross pattern on top of a croissant-soft bun.", "author": "Carrie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Sheng Kee on Irving is old school.  I used to come here a lot when I used to stay in the avenues.  I actually have one on my side of the bridge but for some reason I prefer or only come to the Irving location.\n\nUltimate fave: Moon-shaped Chocolate bun!!!  It's the same concept of a chocolate croissant but taste way better.  The bun is sweet like a Pan de Sal or madeline, topped with flakes of chocolate and filled with even more chocolate goodness. Take a bite of a freshly made one or microwave for 10 sec....it will not disappoint. \n\nPork Buns are OK but I really enjoy the hot dog/cheese buns and the cream cheese buns. They're so good, esp when fresh and warm. I haven't tried the Strawberry Stick but the hubby loves it!! Mango Mousse cake is also pretty good.\n\nWhen in the area, I always try and stop by to bring some treats back home.", "author": "Resa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "The buns are a little on the pricier side, however they're still yummy. What's so nice is that everything is individually wrapped so it's nice as a housewarming gifts to people, or just good to package for on the go. I think they've changed their recipe the past few years because the buns don't last as long as they use to. Also I think they're more chewy now too. Regardless still yummsies!", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "Walking into Sheng Kee Bakery is like walking into Japan for me; okay, so I am well aware that Sheng Kee is Taiwanese, not Japanese, but that's beside the fact. Asian bakeries in general evoke a sense of nostalgia for me as I find myself feeling a little \"homesick\" for Japan and the pan-ya there.\n\nSheng Kee is the next best thing though--I love looking at the displays of breads, moon cakes, etc. Their regular cake selection is also enticing up front, along with the mochi rolls. Mmm! Prices aren't so bad either, for example:\n\nCheese Hot Dog Bun: $1.09\n*BIG* Egg Custard: $1.25\n\nOh, their egg custards are wonderful when they're fresh and un-burnt. My parents bought a slew of the egg custards here once and my sisters and I...well, we decided we would eat at least one, if not two, or more...they were quite delicious.\n\nThere's seating in the bakery for chit-chat or a little reading/relaxing. I like to see myself coming here more for that last part, since so far I've only popped in to grab a few breads to-go. \n\nNext, I'll have to try the cakes.", "author": "Helene K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "No complaints about their bread, except that I always get greedy and buy too much, then I can't finish it. I love the salty ones, like the ham and corn one... love it... but also like the traditional pineapple bun and the cupcakes they have by the cash register.\n\nThe prices I think are aiite, just like any other Sheng Kee really, and if you wait for the 7pm deal, just be ready to grab whatever the hell you can, no time to be picky!", "author": "Daphne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Sheng Kee have a great selection of pastries and cakes! I love their coconut and raisin loaf bread! its really to die for to me! i always over purchase every time i step food into Sheng Kee. They have a variety of cakes you can purchase or you can special order one as well. \n\nIf only there was a Sheng Kee by my house i will go there few times a week to stock up!", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-10", "description": "This is my jammm. Freshest asian bakery - everything is still steaming out of the ovens - ANY time I go in. No joke. I can't get enough: \n\nBBQ Pork Buns (SO FRESH)\nCustard / Creamcheese Buns\nVanilla Spiral Cake (always on sale)\nAlmond Cookies\nSweet Bread (always still warm)", "author": "Monalisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-09", "description": "Awesome Chinese bakery that is also super cheap. An awesome place for a $2.99 lunch (small pasty + drink). There's also always a bunch of old people just lounging about which adds a sense of authenticity to the place. Feels like China cuz that's what old folk do.", "author": "Paul B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-08", "description": "I was craving either a red bean cake or a mooncake so I figured that if any shop was bound to have it, this one would have it. Of course they did -- and they had a bunch of flavours too. I grabbed a mooncake and a red bean cake (and then got them mixed up in the bag and somehow managed to pull the right one). The mooncake was super tasty which satiated that craving quite quickly.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "I love this place , haven't been here in awhile but I love the food here ,it always fresh never Burt or anyless,", "author": "Seaera T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Fantastic price for a delicious array of baked goods! A neat place to stop by for a quick breakfast, and a great fusion of East meets West.", "author": "K Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-20", "description": "One of the best bakeries in town and lovely decorated cakes.\nLove the buns and pastry selections...the swiss rolls (cake rolls with cream in center) are my favorite but so are their taro buns, red bean buns, etc etc....", "author": "Yan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-16", "description": "The worst service ever! They gave me the wrong change. I bought a couple of \npastries.It cost something like $4.05. I gave the clerk $10.05. She gave me back $1.\nWhen I remined her that I gave her $10.05, she refused to double-check. \nShe insisted that I left the phone number and that the store would contact me when \n(or if) they \"find extra five dollars\" at the end of the business day. Rather than \nresolving the problem right away, they were rude and extremely unfriendly. \nI've never felt so insulted in my entire life. I will never go back again.", "author": "Ching S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "I really like the loafs of bread. They have raisin, custard, cream, etc. They are great for family snack items and is cheaper than buying a bunch of individual pastries, although their patries are delicious too.", "author": "Andy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-02", "description": "Sheng Kee is an ambassador between two worlds.  With its variations on classic Chinese buns, it tries to lure in Americanized Chinese customers while towing along their old school Chinese customers.\n\nI fall into the former category and appreciate that there are English labels telling me exactly which buns I am picking out, but I also yearn for the flavors that are missing when comparing Sheng Kee buns to Chinatown bakery buns.  Sheng Kee seemingly takes a classic Chinese bun and sweetens it noticeably to bestow it a universal appeal.\n\nAlthough Sheng Kee buns do not provide ultimate satisfaction, I still eagerly grab a few whenever the occasion arises.  My favorites include the hot dog green onion bun and red bean filled pineapple bun.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-01", "description": "The cakes and pastries are delicious... But the service here is awful. I went to buy my gma a cake for her birthday, while I was paying the lady gave me the wrong cake. I tried to tell her but she just threw my change at me and shouted next. Finally after ten mins they gave me the right cake. So frustrating.", "author": "Annabelle S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-12", "description": "Bought the Mixed fruit sponge cake yesterday for a birthday party and never have I been so embarressed! \n\nTHE CAKE WAS FROZEN! The fruits inside the cake was icy and the inside frosting was frozen! And trust me this isn't suppose to be a ice cream cake, I don't even think they sell ice cream cakes. Way to dissappoint Shen Kee! Even the little kids past on the cake! \n\nThe sad part was I even asked the girl what was inside that cake and she had no clue, she said its can fruits and the cake was fresh and just came out! LIES i tell you, we even had the cake sit out for about an hour before we cut the cake due to not having enough room in the fridge, so imaging if we did refriderate that cake.. totally bummed! Sheng Kee Bakery has failed me so many times for cakes that i think i'll only come back for the buns and rolls!", "author": "Jacinta D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "3.5 stars. \n\nYummy yummy yummy! \n\nI really like their cream cheese buns and their cream cheese toast loaf. I guess I just like their cream cheese mixture. So fattening but oh so delicious. \n\nI also like their honey cake rolls except I honestly think they're lemon flavored. I also bought cakes from them like two years ago. Almost comparable to Schubert's but Schubert's wins. \n\nTheir service is a little rude but nothing you can't just brush off. \n\nHowever, they are pretty expensive for an Asian bakery. About 1.20ish? per bun, it's ridiculous especially when you can get about the same for 0.60 in Chinatown. However, they are close and convenient and I'll definitely come back for more.", "author": "Bonnie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-21", "description": "I have never been a fan of Chinese pastry, but was walking by one day and saw they had more variety and seemed to be expanding more into French pastries which I do prefer. I applaud the attempt, but it definitely still has a Chinese influence to it that made it way too bread-y and less like a pastry.", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Come in and grab a cheap snack. Hot Dog buns and blueberry/cream cheese danishes. Sure, they're terrible for you, but sometimes its exactly what you want.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "Various types of pastry here and wide hangout place. I had the milk tea and Portuguese egg tart, which I enjoy a lot. Recommended for people that want a place to hangout or relax.", "author": "Gooi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-23", "description": "I've had multiple of the fruit type cakes from here, including a strawberry one for my birthday, and always enjoy them.  They always seem fresh, and I love how light-tasting they are, even though I'm sure I'm ingesting tons of calories.\n\nThe main reason I am docking stars is because all of the individually wrapped baked goods in the front are made with margarine.  The last time I went in I looked at all of the ingredient lists because I really wanted some sort of bun, but to my dismay, everything I saw listed margarine, no butter.  What bakery uses margarine??  It needs to be butter people!  Butter is better!  \n\nDespite the fact that I can taste an obvious difference, I'm also of the belief that margarine is actually bad for you.  It's one molecule away from being plastic, it doesn't ever mold, and even flies won't touch it.  Try leaving some out if you don't believe me.  If that doesn't make you want to steer clear of the stuff, I don't know what will!", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-06", "description": "3.5 stars.\n\nGood pastries but they're pricey comparing to other bakeries in SF. \nShould try: Pineapple coconut, pineapple custard, egg custard.", "author": "Chew H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-06", "description": "I love the baked goods here, although I can't help but feel like I am supporting a corporation whenever I purchase anything here... One of my favorite things is their green tea with red bean roll.  I love their variety of buns, but I can't help feeling as if there are better buns elsewhere.\n\nI know of better bakeries elsewhere, that are more mom-and-pop places", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-17", "description": "Love all of their mousse cakes! My current favorite is the french chestnut. The prices has sure gone up though. From what I remember about this place, they only accept cash (unless they changed it recently.. but the westlake location does take cards!) Good thing BoFA is next door. I'm not too crazy about their buns and other pastries. The po-tats are alright when very fresh, but gets kind of oily.", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "I like this bakery because the have tasty cakes and light sandwiches. We usually get birthday cakes from here and they have not disappointed so far. They do have fresh selections of pastries that are good but nothing like the ones in LA's 85 degrees.", "author": "Jennie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-30", "description": "I actually went to Sheng Kee today to get a slice of roll cake, but when I walked in, I was amazed how many buns and breads they had. I couldn't decide what to get, I wanted to buy one of each kind. Finally, I decided to get the Taro Bun ($1.25). The bun was big and light. It had a sweet taro filling and slivered almonds on top. I couldn't wait to get home and eat it. God, it was good. Sticky, fluffy dough with sticky sweet paste inside. \nI also like how all buns are individually packaged in resealable mini plastic bags :] .\nI will come back and try other buns.... and the roll cake! and also mini cakes. I love this bakery. Oh, can't wait to visit them again!", "author": "ponch l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-15", "description": "I'm not much of a typical sweets person (i.e. not a fan of cookies and cakes and the like) but for some odd reason I really do like sweetened versions of traditionally savory things... such as bread, sweet potato fries and kettle corn.  Yes I am a weirdo.  Anyway...\n\nBAKED GOODS:  Sheng Kee carries my all-time favorite sweet breads.  Love love love me some Toasted Coconut Bread, Red Bean Toast, Custard Bread and even their Raisin bread is good (I am not a huge fan of raisins as they remind me of mouse turds) .  Also have bomb-ass mouse cakes - I'm totally in love with their mango and chestnut mousse (I know it sounds nasty but just try it!!! it's amazingly refreshing).\n\nAMBIENCE: Cute bakeshop right in the heart of SF's third Chinatown (this is an ongoing debate - I say the first Chinatown is the touristy one by Nob Hill that everyone knows about, the 2nd one is on Clement street in the Richmond District, the 3rd one is on Irving).  It is always warm and toasty and smells wonderfully like freshly baked  bread in here.   If I could bottle the smell of Sheng Kee bakery believe me I would.  One star knocked off just because service can range from being awkward to indifferent to just plain rude at times.  I've learned the secret is to say as little as possible - just grab what you want, bring it to the counter, pay and go.  Then pig out on what you just bought! MOOOO!!!!\n\nPRICES: Are actually not bad at all.  Last I checked a whole loaf of one of their specialty breads is still $2.99.  And the cakes should still be around $30, maybe a little more for the mousse cake.\n\nPARKING: Is a royal pain in the (___I___)  Try to walk there if you can.  Otherwise you have to deal with Asian Moms driving around in minivans they can't park... we know how that is...", "author": "Catherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-19", "description": "Sheng Kee is one of my favourite bakeries and I've always only gone to the one in Milpitas so when I found this place after moving to San Francisco I was a very happy camper.  It's a much bigger store than the one in milpitas, has tables for you to sit and enjoy your baked goods, but the baked goods section is just a tiny corner of the store.  I think they might be more known for their cakes at this location since almost every time I've gone someone was either ordering or picking up a cake.  It def makes me want to try it out next time I have a reason to buy a cake! The pasteries are just as good as the one in Milpitas but the selection isn't as wide.  They have a lot more interesting choices but I like the simple pineapple buns and such. A lot of the time they don't have it (I'm just assuming I come to late and they run out) which makes me a little upset since it's what made me fall in love with Sheng Kee. \n\nAll in all, with such a big location I think they should take away a few tables and use that space to put our more baked goods for us!", "author": "Alice L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-06", "description": "Shen Kee has been one of my goto places for birthday cakes for years, until yesterday. I picked out a very pretty Fruit Basket Cake on display in the frig. However, as the store clerk brought it out of the display, she carelessly smeared the giant strawberry that was sitting on top of the cake against the roof of the display and knocked it on the shelf. What really got me was that she proceeded to use a plastic glove to pick up the strawberry from the murky shelf and placed it back on my cake!!?! Needless to say, I told her that I didn't want that cake because it was unsanitary. She rudely responded declaring nothing was wrong with the cake. Fortunately, before a cake fight pursued, another more mature clerk stepped in to assist me with selecting another cake. I selected another cake alright. But be warned, the clerk returned the unsanitary cake back in the frig to be sold to an unsuspecting customer. My feedback to Shen Kee management: make customer service training mandatory and have stricter food handling guidelines. I will not be returning.", "author": "Katie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-24", "description": "Last week I dropped by and discovered it to be close by San Francisco Department of Public Health.\nChecking their health score indicates there is something wrong:\nhttp://dph-extranet2.sfdph.org:7777/pls/eeop_htmldb/f?p=132:2:8548371799552003::NO::P2_LOCATIONID:3241", "author": "Darwin B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-21", "description": "Avoid their cakes. They're beautifully decorated, but they don't use \"real\" cake. The cake layers inside are exactly like what you'd find in a swiss roll. (And the closest they get to chocolate cake is 'chocolate flavored' well-at-least-it's-the-right-color swiss roll layers). The \"whipped cream frosting\" tastes extremely plastic and processed, not at all the way real whipped cream should taste.\n\nTake all that money you use on expensive packaging and put it into your cakes! We'll notice.\n\nFor cakes, go to Schubert's or Blissful Bites!\n\n4 stars for their coconut bread and curry beef horns.", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Remarkably solid Chinese-style bakery.  I didn't have any of the cakes or anything, just a few of the pastries, but they the flavors and textures all reminded me of my youth in exotic Southern California.  I don't know what that says about Chinese pastries in general, but I appreciate the taste of nostalgia regardless.", "author": "Norman S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-15", "description": "Got the BBQ pork bun and the pineapple bun with custard.  \nBoth buns were fine, nothing to rave about, and room temperature.  The BBQ pork bun was average, and while the pineapple bun looked nicer than average with almond slices decorating the top, the flavor was dull.  More style than substance.  \n\nAs far as the set up, you pick what you want out of glass shelves and take it up to register to pay.  The inside was big and cleaner than most smaller mom and pop places, but the prices were higher as well.  Around $1 for what normally costs 70 cents.  Not breaking the bank, but there are better places for price and taste.  Do yourself a favor and go up the street to Sunset Bakery, or Chinatown if you can go that far.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-27", "description": "I LOVE THEIR CAKES. Light, fluffy, with fruit all over. If you haven't tried one before, you need to try one now because they are amazing. Nothing is too sweet or too bitter, and I usually get whatever is in the display because everything's good no matter what!\n\nTheir taro breads and dried shredded pork thing bread is so good. (Those breads with the swirled stuff in the center) yummyy", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-25", "description": "Not an 85C and definitely cannot be my substitute.  I've had better buns at smaller asian bakeries.  Their buns are nasty...I can taste the margarine they use in the bread.  The buns are super dense and greasy and not worth their price.  The mooncakes are good.  I like their lotus ones.  Their cakes are decent since they are the light sponge fruit cakes that all Chinese bakeries are known for, but nothing to write home about since they are more pricey here.  \n\nWhat I used to love here were the loafs of taro bread.  Don't see them any more. :(  I will save my calories for 85C.", "author": "Cheryl L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-06", "description": "I know! cause My mom work at the bakery! & made all your birthday cakes or weddin' and the rest of the cakes! that she been working there for 27 years.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "I love perfect little Chinese buns!\n\n(get your mind out of the gutter...I'm talking about the pastries)\n\nHot dog bun---savory and delicious with a little cheese in the pastry.\nTaro bun---mild taro flavor, slightly sweet pastry...great for breakfast. \nCoconut bun---mild coconut flavor, sweet pastry...great with tea.\nAll are individually packaged to insure freshness as well as cuteness!\n\nI am told that the prices here are high for a \"Chinese\" bakery, whatever that means.  I also thought this was a Taiwanese bakery?  Don't worry, I'm not going to go there...I'm too afraid to ask for clarification.  I may be white and American, but I've spent some time in Taipei and know better than to discuss Cross-Straight relations and China with the Taiwanese.   \n\nI know this much, for sure...I will be back for more!", "author": "s r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-10", "description": "Red bean buns. My family loves them, especially the ones from Sheng Kee Bakery.", "author": "Sophia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "Sheng Kee Bakery is such a gem!\n\nI work across the street from this bakery and am so glad that they are there for my pastry needs.\n\nThey have so many fresh baked rolls to choose from. Here are some of my favorites: green onion and cheese roll, chicken roll and the sweet bread roll. I don't know the correct names but I do know they are delicious and at $1.05-$2.00 (depending on the roll of course), it's a such a steal! They are big enough to fill you up and keep you satisfied.", "author": "Denise S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-19", "description": "I am not a big fan of overly sweet American desserts so Sheng Kee cakes are perfect for me. Asian cakes tend to be less heavy on the creme with more emphasis on fruit; Americans may find them a bit bland but they're perfect for me. Got a strawberry mousse cake that was delicious. The cake could have been a little more moist but I love the subtly sweet mousse.", "author": "Donna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-05", "description": ":( omygod i'm so disappointed with their egg tarts! It was horrible! I usually am not picky abt egg tarts because of the fact that i LOVE em to death, but wow.. Shengkee broke my heart! They were very dry and tasteless! And the portuguese egg tarts? I thought it was gonna taste better but man was I wrong! It was 4x worseee! It was sticking to the aluminum plate thing. I couldn't even take the egg tart out. Very hard and messy to eat! The Portuguese egg tart was too soft that it was falling apart and still no taste. I'm so heart broken right now!", "author": "Verdina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "Taro, Custard and Red Bean...not your typical flavors. \n\nYou can't find it in Grain D'Or, Boudin...not even in Krispy Kreme Donuts.\n\nI speak to the fortunate few who live in San Francisco to be grateful that we are exposed to the richness that diverse peoples in this city have to offer in food\n\nSheng Kee Bakery is one of the best bakeries for you to try Chinese pastries such as the taro, custard and red bean bun. Each is wrapped in its own delightful little bag. If you stop by at around 10 am or whenever they open...they are displayed, fresh & warm, from the oven. The brown color is cooked perfectly & I think they put the right amount of bean paste in each bun (even though some prefer more in quantity but I think it would make the bun taste too sweet)\n\nMore than worth the price, it's different from your typically overpriced croissant \n\nMay this be why the majority in China did not welcome Sarkozy at the Beijing Olympics?\n\nPerhaps...chomp", "author": "Charmian D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-04", "description": "This bakery is the bomb!! We love it!! Delish and orginal baked goods! :)", "author": "Jd W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "The funniest thing happen today; I was driving down Irving thinking about the Chinese pastries I used to have as a kid out on Taraval Street.  My mouth started watering and as I parked the car to go to the bank I looked up & in front of me was Sheng Kee.  I've never noticed it before, I suppose my subconscious was willing me towards it.  Anyhow when I noticed they have Chinese pastries I had to go in and did I ever.  i walked out of there with 5 sweet buns and egg bread!\n\nOMG the coconut cream bun is superb.  I also got the pineapple bun, and a few others, but I can't remember what they were, but they were delish!  I am so glad I stumbled upon this place and I will definitely be going back as soon as I devour my pastry stash.\n\nAlso, the place was very clean & inviting.  I also, liked how all the pastries were individually wrapped.  \n\nFYI its cash only.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-17", "description": "Overpriced, individually-wrapped meh (yes, I'm using \"meh\" as a noun here).  They justify the higher prices because it looks clean inside and everything is packaged somewhat better than most other Chinese bakeries, but when it comes down to flavor, there's really nothing that special that I wouldn't be able to find better tasting and cheaper somewhere else.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-22", "description": "I feel like this location's quality may have went down. I had a mango mousse cake from this location, barely tasted like mango or even sweet at all. I also ordered my favorite green tea and red bean roll. There was something not quite right about it. The flavor was kinda sharp and made my tongue itch a little. I was very disappointed since I have been coming here for years and it is closer to my house then another Sheng Kee.  \n\nSheng Kee may be a chain which means same quality at all locations, but I rather go to the Sheng Kee at Westlake.", "author": "Jess H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-28", "description": "I found a baked fly in my bacon bun today.  I have posted the pictures.  No more buy one get one free after 7pm for the fatty.  BTW I still ate the bun.  I probably have swine flu now.  Sucks to be a fatty.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-08", "description": "Love their pastries and cakes!\n\nWe come here to get some of their cakes for birthdays and they're great! Colorful, sweet, and decently sized for an ok price. They look like fancy cakes with chocolate pieces and decorations. \n\nI'd like to come here when everything is fresh, but to me, it's pretty expensive. After 5 or so is when I'd come in. Cheaper prices and still yummy pastries.\n\nI haven't tried too many foods here but I'm sure they're all great in their own way. If you want to get a pretty cake for your friend or loved one, come to Sheng Kee! Cakes with mango mousse and chocolate, mmmm... so good.", "author": "robin w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-10", "description": "If it says 'taro' or 'mochi' (bonus: or both!) on the description, rest assured you'll be happy.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-04", "description": "This is an excellent cake place BUT I'm going to talk about buns!\n\nThey have a great selection of breakfast buns (made fresh every morning) that come in little resealable plastic wrapping. Recently, I got the Corn and Ham Bun, the Tuna Bun, and the Hot Dog Onion Bun for $3.75. The Corn and Ham sits on a a small dab of mayo that rests on top of a pretty awesome, sweet-bread-type bun. The same goes for the Tuna and Hot Dog Onion buns. The Tuna bun comes with a little drizzle of tomato sauce which makes it equally good as a lunch bun. And the Hot Dog Onion Bun is pretty straight forward. \n\nI also recommend the red bean bread (which has red bean paste swirled around in the dough before it's baked) -- but do make sure to eat it within three days because after three days, bread dries up and it's really hard to recapitulate the sweet wonderful-ness that is red bean bread in the toaster oven.\n\nThey also have a refrigerated section with actual lunch sandwiches ($1.49-1.75): Chicken Salad, Tuna and Egg, Ham+Tomato+Lettuce, just to name a few. If you're in that section and end up eye-ing the individual slides of roll cake ($0.85), turn around, walk towards the cake display and get the full roll ($4.99) instead. \n\nI come here pretty often, and I always leave happy.", "author": "Julia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-20", "description": "I loved the red bean moon cake pastry. But there was a mocha cream cone which was entirely too sweet and rich, hence the 3 stars. I'd return for the red bean moon cake fo sho. Plus there is no minimum on credit card charges! Sweet!", "author": "Monica A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "Love it. The Portuguese egg tarts were amazing.", "author": "Terry B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-03", "description": "the only time their baked buns are nice and hot is in the morning when they freshly bake it, which is very early in the morning, so  i do not recommend coming here in the afternoon if you're looking for hot pastries.\n\nthis place is ONLY good for cold pastries and cakes.\n\ndid i mention that their items are overpriced? $1.75 for an egg tart? no thanks!", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "Awesome cakes!!!  I tried green tea and mango.\nGreen tea was okay but mango cake was really good!\nAnd the price! It was cheap [$1.85 a piece]\nI tried cake at Cafe Madeleine which cost me $5.50/piece.\nSheng Kee is far better or both taste and price : )", "author": "Jay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-06", "description": "have you tried their sliced white bread with swirls of custard in the middle?\n\nbomb\n\nthe mango cake with alternating white and mango chocolate pieces surrounding...\n\npretty good.\n\nthis place, can't go wrong pastry wise but serious, try that sliced white bread with custard swirls..you will NOT regret", "author": "Whitne Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "I came here today to get a cake...and the selection of cakes here are great! They have everything from mousse cakes, cheese cakes, flavored cakes, and fruit cakes. All the cakes here are so pretty too. Almost too pretty to eat. \n\nI often visit more casual types of bakeries when getting a cake. Once in a while I stop by here to pick up a cake, because the quality is pretty good and the presentation of the cake is beautiful. The lady behind the counter was very helpful in helping me pick a cake. Everything looked really sweet, so i wanted to get one that wasn't too sweet. I ended up getting the fruit basket cake($23). The cake itself is not like a typical spongy Chinese cake. It's a little more dense and more firm but its still light and not too sweet -which was perfect. The middle has whipped cream and mixed fruits - but it was fruit cocktail - and we all know that's from a can. I prefer fresh fruits..but that's okay. I think it has a layer of custard or something on top of the cake, topped with whipped cream and tons of fresh kiwi's, strawberries and peach. \n\nOverall they have all the typical Asian style pasties here from your breads, pork buns, cocktail buns, cookies, etc. I heard that after 7pm everything is 1/2 off - hmm..I wonder if that applies to cakes? =P Overall, the cake is good, but I prefer the more Chinese style fluffy sponge cake.", "author": "Betty S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "Perfect for small-snack munchies (red bean cake, mini flan cup).", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-17", "description": "They got it all.  They got cakes, buns, sandwiches, various desserts, cookies, drinks, etc.\n\nEven with the impressive selection of baked goods, I only come here for the strawberry mousse cake (I'm a creature of habit, don't hate!).\n\nThe cake is lightly made, slightly less dense than your average \"Chinese cake\".  It's not overpowering in the sweet department and the mousse is a wonderful alternative to white frosting.  The presentation is done beautifully and each time I buy it, everyone always approves.  WIN WIN!", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-05", "description": "Would be good if this store had a line for the cashiers/to pay for products. Maybe a ticket machine to call out customer numbers or just a set line/ropes for people to stand in.\nI go there a lot -- and everytime some little old lady tries to cut in front of me! And pretends she was 'in line' before me. It's rude and makes me want to never spend any money at a store that is not organized. With a nice orderly line - -the store would sell a lot more pasteries/baked goods AND customers would be happy.\n\nAll the products there are very nice and tasty. Esp. the buns and tarts.\n\nBut they need to organize a better way to check out without getting into a screaming match or worse, a shoving match with someone else. It seems the more pushy, more elbows you throw -- you get to cut the line. I could step on these ladies like bugs -- but then that would be wrong.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "Holy crap, you sell \"Vietnamese\" sandwiches. And I quote Vietnamese because it has everything a Vietnamese sandwich would have in it (carrots, cucumber, cilantro, radish, meat, etc), only that their cucumber and carrots are cut much larger than the shreds I'm used to. Also, the fancy pork isn't quite fancy pork because it had little peppercorns in it. There is also a slice of ham in the mix, different, but nice addition. And the sign says \"sub-sandwiches\" but you know what I mean.\n\nFunny thing is that they have these ready-made sitting by the registers on the counter above. Just grab n go for lunch!...that is of course after you pay $2.99 for the sandwich. Despite not being made in front of me, it still tasted fresh and I'm pretty sure they bake their own bread considering this is a Chinese bakery. \n\nI guess I should also take this time to say that I also love their mousse cakes and fruit tarts. I could eat this whole bakery if I had a longer lunch break.", "author": "Kimberly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-13", "description": "Really good buns! Love the cheese and ham bun. Their sandwiches are 50 percent off after 6 o'clock but they still taste fresh at the time. I'm not a big fan of their cakes though.", "author": "Allie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-02", "description": "Sheng Kee has the best cakes and buns from cosmopolitan China. I highly recommend the bakery. The interior is presentable compared to other local bakeries. Most of the products are sweet and not salty. The cakes are flawlessly designed and the buns are offered in a wide variety. My favorite is the custard bun and something with chocolate inside. The cashiers are not that easy to deal with, but are always ready for you to pay. The products are inexpensive.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-17", "description": "This bakery sets the standard for excellence.\n\nIt's not cheap, but you get what you pay for. I'm talking about their cakes.", "author": "Miguel T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-31", "description": "Grew up with their buns and they have always been very good! Recently, they have been coming out with new buns.  The hawaiian bun is very good!", "author": "Carol K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-10", "description": "Please open up a Sheng Kee in Marin... PLEASE PLEASE!\nI miss walking down the street at 7pm and getting half priced deals on Pork buns, Taro buns and Custard buns, well on ALL buns.  I always come out with a smile every time I leave Sheng Kee.  I still need to try one of their cakes, they look so beautiful and hopefully are tasty as well.", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "Ive been coming to Sheng Kee bakery since before I could walk and it has been apart of me since then. There are so many other varieties of bread, wheat, multi grain, 7-grain, wonderbread, sourdough, etc etc...but Sheng Kee's Taiwanese full loaf still rates number 1 on my list of breads. \nIt is always delicious, with just enough sweetness and firm texture that keep me coming back....no not like crack, cuz drugs are BAD!\n\nTheir take on the vietnamese sandwich isnt too bad either and their sweet pastries and coffee cakes are always spot on! \n\nOO DISCLAIMER: \nas a child, i began to slowly hate regular cakes and all those cakes my friends (who were mainly white) would eat/have on their birthdays. I remember times where i would simply refuse cake and have mothers force feeed it to me. This was all because of Sheng Kee....their cakes are naturally less sweet, not overloaded with sugar and frosting, and were the only cakes i would eat as a child. To this day, i still despise normal frosting and always take the other option at birthday parties....altho even those are becoming rarer and rarer.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-29", "description": "Went into this large bakery on the busier side of Irving where all the Asian stores are. Always looking for good Asian food- including breads, but was very disappointed. I had two buns - one a puff pastry bun with shredded pork, and the other a coconut bun. Both were not very good and I had to nearly force myself to finish it since I didn't have a good lunch.\nThey have friendly counter people, but the buns are not very good here.", "author": "Bryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "Carb lady here! What can I say, I love my buns! I always get a little tooooo excited and leave with more then I should (esp. the savory ones, yummm). As for the cakes, try the mango mousse cake! It was so tasty, I bought an entire cake despite there being any special occasion!", "author": "Karen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "Pretty darned good.  I had a bun with corn and mayo filling, and a hot dog bun with green onions, as well as a mocha roll for dessert.  Not the best hot dog bun I have had, but they were warm and didnt look like it had been sitting out all day long. And the mayo on my corn bun didnt give me a stomachache from being god knows where for god knows how long. \nDefinately yummy, and makes me want to go back to try the sweeter pastries and buns.", "author": "Janet R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "I'm generally very careful about diet selection, but this bakery is one of my few exceptions for unhealthy choice of foods. My favorite is the pineapple custard raisin toast. It tastes like heaven when you warm it up at home in a toaster. The fact that it's 160 calories and 6g of fat per slide does not stop me from driving all the way there just to get the toast. The price is definitely not cheap ($3.99). In fact it's even higher than some of those healthy toast at Wholefoods.  The pineapple custard bun and the almond custard bun taste pretty much the same. The loaded sweet fillings left me feeling really guilty for ever consuming them. I have no excuse but telling myself it's a treat once in a while. Cash only.", "author": "Elle W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-12", "description": "i wouldn't buy pork buns from Sheng Kee because its disgusting \n\nplease go to cafe bakery if you are craving for a pork bun (the best!)\nhttp://www.yelp.com/biz/B0lqvrhX9BNPMggTFmFj8g\n\nHOWEVER, Sheng Kee does offer wide variety of breads that are good. they are known for their unique flavors bread loafs -- ie. red bean loaf, custard raisin loaf, PLAIN loaf, raisin loaf. everything is good and DIRT CHEAP! you can buy a $2.50 whole loaf of bread for dinner! \n\nAlso, Sheng Kee offers HALF PRICE on ALL sandwiches (in the cold section) after 6pm (not 3 or 5 minutes before 6pm, but EXACTLY after 6pm.\n\n*2 minutes before 6pm*\n\nme: (carrying two Vietnamese sandwiches to the cashier) \ncashier: (rang up $5.98) sorry you have to wait 2 more minutes\nme: really?!! its ONE minute before 6pm\ncashier: yea, the computer doesn't read the half price yet\nfriend: *laughing* THIS IS CRAZYYY. i cant believe it makes a difference\nme: (waiting and looking at the clock as it finally turn 6pm)\ncashier: OK! $3.00 please\n\nTIP: you have to buy them starting at 6pm because their computer/cashier doesn't read the half price until its 6pm. weird isn't it?!!  PLEASE just let me have my Vietnamese sandwich for $1.50 please!!! (the sandwich isn't worth $2.99  BUT its definitely worth $1.50)", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-02", "description": "I don't usually think of the Chinese as being masters of bread, but hey, SF is about defying stereotypes, right?\n\nApparently Sheng Kee has quite the operation going, with 10 Bay Area locations (of which this is the only one in SF) dating back 50 years to a little place in Taipei.  Based on what I saw here, I'm guessing it's the buns that made them famous.\n\nThey have lots of flavors both sweet and savory, some stuffed, some with toppings.  I tried the Pork Sung, good but a little odd--what's that carpety stuff on top? [Judy K: it's the pork sung, aka rousong, aka meat floss.  Nummy!].  Also had a Pineapple Taro bun, which was pure bliss.  There's plenty of tables but no atmosphere, so I recommend grabbing your stuff to go, picking up a boba at Wonderful Foods, and heading into GGP for a delicious walk and/or picnic.\n\nAlso a good spot to get moon cakes.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-10", "description": "Can't go a few days without slammin some incredibly sweet and exquisitely made coconut-creme-raisin toast that i have to keep replenished throughout the week as the perfect compliment to my morning kohi.\n\nIts like 2.50 for a loaf which is crazy cheap for how much work it seems they put into concocting this morsel of oral pleasure.  I have the most fun just watching many of the cute, hk girls working get all excited and stressed out when they are busy during the day.\n\nYou hear them all yelling, screaming, laughing, and stickling their tongues out at each other...it makes me wanna throw on an apron and join them in the madness.  Ya gotta try the curry puff---oishii yo!", "author": "omar b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-26", "description": "Cute little bakery in San Francisco, near San Tung's. We ordered to go and decided to stroll the streets while we waited. The goods here are yummy and range from savory to sweet, and don't cost much either! A nice little place to stop by and buy some snacks for the next day. We came at the end of the day so they were out of  lot of things already.", "author": "Jacqueline N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-09", "description": "I live a block away from Sheng Kee, and I absolutely hate it because its impossible for me just to walk by. Everything is so delicious. My favorite is the chocolate bun. Its huge, and is only 1.85. This place is the gem of the Outer Sunset.", "author": "Magdalena G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-01", "description": "i have a confession:\r\ni adore Sheng Kee's buns.\r\nthere's just no resisting\r\nthe sweet coconut ones.\r\n\r\nthey're so cute and pudgy \r\nwith deep golden sheen,\r\nyellow coconut paste\r\nand tan sesame seeds.\r\n\r\ni could have selected\r\nany other delight,\r\nbut nothing compares--\r\nit was love at first bite.", "author": "M A N I K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "I love their mango cakes here and their half ham/turkey cheese sandwiches. They always have fresh Chinese pastries! Mmm. I miss this.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "I've walked past Sheng Kee Bakery twice and have stopped in for a pastry both times.  On first try, the redbean pastry was delightful.  On second try the custard pastry topped with roasted almond slices was amazing!  I know what I'm getting the third time :)", "author": "Sarah Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-15", "description": "Sheng Kee's method for keeping prices low seems to be to reduce the amount of filling in the buns.  It seems like every year, there's less filling.  When you bite into a red bean bun, it's mostly air, which is frustrating.   I mean there's only a teaspoon of red bean paste in there and the rest is AIR.  The bun is the same size on the outside but the shell is thin, hence it's an air pocket.  I'd rather pay more to have more filling in the bun.\n\nBut complaints aside, their buns are tasty and they make really good cakes (the rolls with a thin layer of cream, the triangle wedges).  I've had their large cakes too and they're just right.  Western cakes tend to be too sweet but the Asian bakeries, like Sheng Kee, tone down the sweetness of their cakes.\n\nThey have good bread too, especially the red bean bread.  The Taiwan toast is really good after it's been toasted.  I also come here every year for mooncakes. The mini ones are good and just the right size and you can choose the kinds you like which is better than buying a prepackaged box of mooncakes.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-25", "description": "Sheng Kee!  Why does everyone in my family love you???  I cannot count the number of bday cakes I have consumed from your bakery!\n\nDo I like you?  YES!\n\nDo I love you?  No.\n\nMy family loves the fresh fruit in your cake...especially the fruit medley one!  Me?  It tastes like fruit-cocktail on sponge cake.\n\nThey find you simply delish!  I wonder what that odd cream is you use in your cake...almost the consistency of blended cottage cheese?\n\nThey say they love how you are not too sweet.  I think a cake should be sweeeeeeeeeet.  Your cake consistency is a bit thicker, similar to a Jelly Roll...great for a jelly roll, but not what I look for in a cake.\n\nOh, Sheng Kee...they went to you for my birthday cake last week.  I sat and pondered why?  Why, when they know I love sweet, fresh, light cream filling in my cake...and prefer the cake consistency to be a light, spongy texture that is slightly moist not jelly-rollish... why?  Because they LOVE you...and it doesn't matter what I think.  \n\nI left your jelly-roll like strawberry cake with the odd cream at my mom's and did not take a slice home.  How you thrill their taste buds.  I on the other hand, will head over to Clement for a late bday cake from me to me.\n\nSheng Kee...you are alright.  Great to some...but just okay, to me.\n\n3.5 stars...not quite 4.", "author": "Ladi Da A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-27", "description": "I like their stuff here but often times what they ring up and the prices on the shelves are totally different and when I tell them that it's like they are stupid, deaf or something. They just keep on repeating the price that doesn't match the prices on the shelf so I end up paying more than it was on the shelf so I stopped coming. That Chinese girl is stupid. I told her the drink is $1 and she quoted me another price like $1.20 or something. And when I told her that, she just looked at me and keep repeating the same price $1.20 as if she's stupid and a robot don't understand what I'm talking about.\n\nI used to come here every day. But I stopped, since that incident. That was the second or third time. I don't like giving people second chances anymore.", "author": "Robin T236532i9 W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "I have been to this Sheng Kee Bakery at 1941 Irving Street several times before... This Sheng Kee Bakery is a little bit bigger than the one that they have at the 99 Ranch Shopping Area but they have the some kind of the yummy deserts and baked goods that, I like to eat... My favorite yummy things that... I like to buy and eat from this Sheng Kee Bakery at the Irving Street area is the Ham & Cheese bun, Green Tea Mini Size Moon Cake & The Fruit Cake whiich is one of my favorite cake and not to sweet and yummmmmy!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-21", "description": "Ive known Mark and Joy the owners of Sheng Kee since i was still a wee little boy. Back then, they only really had this one bakery and then got a factory and etc etc. \n\nI used to work in the stock room at their factory, fold boxes during mooncake season, make the rolling trays, package mooncakes and bag up toast. etc etc etc....\n\nAnyways, its just nice to see a place you've grown up with still around. \n\nI still enjoy their chicken pie things not sure why..and their napoleans are still yum..I dont really eat much cakes but if someone  does happen to have one for a birthday or celebration its always been quite yum~", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "Great selection of pastries. Every time I go here the place is clean and have a great variety of food. The place is a little pricey, but you most likely will find unique and different pastries here.", "author": "Sonlay V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-27", "description": "Come here at 6:45pm on weekdays to gather all the choice buns near the window shelves.  Every weekday after 7:00pm, it's 2 for $1.25.  But come here right before, at around 6:55, then you're in for a shoving match plus all the hot dog buns are usually gone.  \n\nI guess this bakery is a routine stop for all the Chinese ladies in the neighborhood because they must loiter around outside waiting until it nears 7pm.  At times I couldn't get a hand in to get a bacon bun.\n\nJust beat them Chinese ladies out of the way cuz you can have breakfast for an entire week for about $5.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "one doesn't have to go here for sheng kee bakeries. they are all over the bay area, either standalone or in conjuction with ranch 99 or lions et al. \n\ni've been blessed to have tasted some of their mooncakes, birthday cakes, and toasted almond/cashew cookies. just GREEAT!", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "this is a review only about their cakes as I have not tried their pastries.\n\nvery asian cakes that are not too sweet, with a soft fluffy center, and variations of mousse flavors and toppings that include fruits and flavored chocolates. I would describe the cakes as a fusion of traditional chinese cake with a western world twist . Overall a very satisfying cake and at $24 for a cake that serves 10+, not to bad. they have several locations located in daly city and in the sunset for customer convenience.", "author": "Robert Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-05", "description": "Ok, I was wrong. This is Taiwanese bakery indeed. I thought it's cantonese because none of the bakeries in Taiwan nowadays serve items like they do in Sheng Kee. Don't get me wrong, they taste very good, but if it were in Taiwan, it would be terribly out of date. It's sooooo old-fashioned, but once in fashion for sure. I ate breads like Sheng kee's when I very very young, so that's like 20 years ago. In Taiwan, no one would buy things like those anymore, but here, it's a great place to go for nostalgic purpose.\n\nWow. \nAlthough I prefer the bakeries in Taiwan so much more than this cantonese bakery, still, it's the best I've tried in US, better than the Tapan bakery in NYC.\n\nYou might wonder why you don't get any pineapple in the pineapple buns. It refers to the checkered shape of its top, not the taste of pineapple. At home, it's the cheapest bread in any bakery that you only get it when everything else is out. But here, they remind me of home so I fall in love with them after visiting sheng kee.\n\nMy favorite is the Pineaple Taro loaf. A whole loaf of yummy bread costs $3.75? Must be kidding! So cheap and it'll last for a week!\n\nThe moon cakes are very good and it comes in 10 flavors or so. The jasmine and oolong are my favorite. \n\nOk, here comes the Taro mochi cake. I grew up in the town where taro mochi cake originated. It is THE dessert at the president's table when he holds dinner parties for foreign VIP. It's called the national treat in taiwan. I would never imagine to find them in a cantonese bakery. But they are indeed, pretty good here.", "author": "Yuchi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-08", "description": "The place I go to when I a) forget I'm trying to be calorically good or b) want to wander around on Irving Street for goodies to put in my messenger bag. The hot dog in a cheese bun makes me forget that I don't like hot dogs, the almond cookies are pure elysium, the custard buns are ambrosial sugar madness, the white sweet bread is god with peanut butter and strawberry jelly, I heart the fruit tarts so much it hurts (aching surging overwhelming love pains pumping through the ventricles), the vietnamese sandwiches are fab, and the mocha creme buns are my ultimate undoing. Basically, you can't really go wrong with anything at Sheng Kee.", "author": "Natasha P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-23", "description": "Recently also tried the mango mousse cake which was pretty good (still not the biggest fan of mousse), but it was beautifully decorated. Today I got the green tea w/ red bean cake because I couldn't decide and the colors and decoration was just so perfect. I am a fan of green tea, but not a fan of red beans. And that was exactly how my liking turned out to be when I had the cake. Props for being open till 8pm even on a Sunday though. Pretty good service. But CASH ONLY, which somewhat sucks. Parking will always be a BITCH around this area.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-27", "description": "Sheng Kee is the place for carb overload.  They have a big variety of fun, tasty, rolls, pastries, buns and cakes to choose from.  Some of my faves are the taro buns, pork sung buns and red bean buns - can you tell?  I like buns -- hurhurhur.  They also have a pretty good warm bbq puff pastry and warm curry beef pastry.\n\nThe Irving store has a better variety than the Westlake location but everything they have is yummo.", "author": "Jeannie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "moon cakes, i missed you! geez, i haven't had a mooncake in years and this was a special treat for me to find this.\ntaro pastries - i didn't know you existed and i'm happy i found you!\nchicken pot pies - my perfect little snack on the go!\n\ni was very pleasantly surprised to find this place after hitting Golden Gate Park. such a great chinese bakery with everything individually wrapped. great to buy a bunch of things for breakfast, parties, or asap", "author": "Chanda I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "The last time I went to Sheng Kee I ordered the Coconut Taiwan Toast Bread. Although economical, Margarine is not what I would consider to be a food. Out of fashion since the nineties, there are many good health reasons to avoid the stuff, but my primary complaint is that to anyone with a decent palate, the stuff is gross!\nIt was a horrible disappointment to bite into coconut mixed with Margarine swirled in this bread. I would have prefered honey, butter, coconut oil, even lard would be less disgusting. What a horrible thing to do to such a beautiful bread!\n\nI am a fan of nearly everything this bakery does, but wish that they would change the bread recipe to more reflect modern taste and health conciousness. Why is the coconut bread only available in white bread? Why would I willingly consume margarine in 2009?\n\nI will be buying the margarine free foods that this fine establishment offers. It is really a lovely bakery. MARGARINE IS GROSS!", "author": "Kimberley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-02", "description": "Great boba. Great desserts. I accidentally ordered the wrong thing and they switched it out for free!! Thanks again!", "author": "Vera F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "I'm a PIROSKI junkie! Sadly, I've not been able to find any bakery on the East Bay that sells the delectables, and have to travel all of 45 minutes to Irving Street to get my fix. I grew up in HK, and lived above a bakery that sold  three kinds (are there more?). Sheng Kee brings back those good memories!\n\nIf anyone in the East Bay knows of a bakery that makes n bakes em, please let me know ...", "author": "June L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-02", "description": "What's not to like? Fruit-topped cakes, all manner of Chinese buns and loaves. It's tasty stuff.\n\nParking can be really horrible in the immediate area ... but you probably knew that.", "author": "Jason K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-22", "description": "I know this place is popular for their pastry products. For me, their cakes are too sweet and rich for my tastes, though. That's just my opinion, because I was asked to buy a cake from them once for a New Year's Eve party.", "author": "H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-23", "description": "Sheng Kee, I heart you so much.  On days when I'm craving dan tats (egg tarts) from Golden Bakery in Chinatown, I can't fathom the thought of driving through the crowded streets and then to find parking for that one dan tat.  That's when you come to my rescue. If I'm lucky enough to buy you at 7:00pm, I can get another one of you for free. Two dan tats for $1.50.  And to spice it up even more, you come in two types of dan tats.  Your basic dan tat or Portuguese dan tat, which has become my ultra fave.\n\nI love you.", "author": "hello k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-23", "description": "I have a problem with baked goods, and when I say problem I mean I can't stay away from them!\n\nMost of the time I crave rich pastries, but sometimes I want something lighter. When this happens Asian baked goods come to my rescue! At Sheng Kee their goodies are light and not too sweet. They are the best Asian bakery I have found (in terms of variety and quality) and is luckily right down the street! \n\nThey also make the most beautiful cakes! These cakes seriously look like pieces of art. Luckily you have the option of buying just a slice so you can see if they cakes taste as good as they look without spending serious cash (and by serious cash I mean around 25 dollars).\n\nMy only complaints are with their savory items, I've tried a few and wasn't impressed, but I hear their ham and cheese rolls are pretty good. The staff is pretty unhelpful so if you have any questions it might be better to ask other shoppers.", "author": "rachel c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "All the buns are super fresh and all are packed individually.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-09", "description": "Yum.\n\nCount on the Chinese to make things cheap (without lead, I hope).\n\nWhy aren't there more bakeries like this one?  The red bean bread was fantastic.  I'm going back for one of their cakes, which are surprisingly affordable for how much attention to detail was put into them.  Check back for an updated rating...", "author": "Chris R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "Honestly, this is a great place to get cake. I always come here for the cakes and the bread. They also have a lot of different locations which is awesome", "author": "aryana c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "Most times, I prefer a French bakery to Chinese bakery. But, the taro bread at Sheng Kee is something French people know nothing about. I love how gooey the taro is, and the bread is super soft (I know, it's white bread so it's not that healthy... so what). \n\nAs for the other baked goods, I'm not too much a fan of their cakes- but mostly because I just don't like that style of cake.", "author": "anocha s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-27", "description": "I am so frustrated with the website. I am looking for a big cake and i am not able to find anything from the website. I am going somewhere else. It's a shame!@", "author": "Charles C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "For: A Pork Bun by Any Other Name\n\nThe bbq baked pork buns here are not my favorite but they're ok.  They're somewhat on the dry side, and rather under-spiced.  The texture of the bun is a little elastic, while the filling almost completely lacks texture.  In fact, it looks to me like they pureed the filling before injecting it into the bun.  I would eat it again if I was hungry nothing else was on the shelves.\n\nPork buns aside, their green onion hot dog buns are one of my guilty pleasures, and their myriad of perfectly right-angled, ultra-modular bread loaves appeal to my inner robot.", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-10", "description": "I'm on a quest to find the best portuguese egg tart (on par with what I've had in Macau) in San Francisco.  The ones at Sheng Kee don't come close, unfortunately.\n\nThe curry beef horn is okay.  After a few bites, you realize something is missing....BUTTER!  I suspect they use shortening in the savory pastries here.  The mini-chicken pot pie is awful.", "author": "Eating Sleeping T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-14", "description": "All our beloved Chinese grannies hang out here, so it's got to be good, right??  Well, actually, mine prefer the cheaper places (and smartly so, I'd say), but Sheng Kee is not bad at all.\n\nThey have pretty good breads and pastries, but nowadays I only come here for two things: the curry beef pies(somewhat similar to a small empanada) for $.99 a piece and a box of flaky, buttery pastries called 'Tai Yeung Beng'  (Sunshine Cookies?!) - 8 for $6.99.", "author": "Kalista W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "love love love this place.. my friend took me here for the first time and i was in awe.. yummy goodies galore! all the breads, sweet and savory bun pastries, tarts, cakes, and so much more.. it's hard for me to decide what i want to place on my tray, i have my faves and want to try something new every time.. one year, my friend cooked me a bday dinner and got me 4 diff cake slices  from here as my dessert platter.. yumm", "author": "Raquel T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-08", "description": "Good pastries. Terrible coffee.", "author": "Wesh W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "Had to get some moon cakes for the autumn festival weekend.\nShared it with the star of White On Rice.\nThe coconut was top with pineapple coming in a close second, and the chestnut moon cake was good regardless of coming third.\n\nThere other baked goods are what else, good.  Pineapple bun... mmmm.", "author": "Po L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-31", "description": "I love the green tea cakes that are rolled up and served in slices. They have beans and cream and taste kinda like a twinkie. My fantasy is to buy the whole log and eat it all, the cake is so freekin' good.\n\nThe only draw-back is that they close kinda early, so when we go to P.P.Q. the bakery is closed when we come out. Gotta remember to buy our cakes before dinner.", "author": "kenneth m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-31", "description": "Nothing fancy here folks. Just your average bakery. Sheng Kee has evolved into a huge corporation and with that being said, bigger factory sized bakeries. No longer are the cakes baked on premises, they're prepared somewhere, frozen and delivered. \n\nNumerous times have I had a cake from Sheng Kee that was still half thawed. \n\nI do however, favor their Chicken pies. Tiny little hand held pastries, with a flaky puff pastry crust. Their filling needs a little work. I can only imagine if they put the filling from Cafe Bakery on Noriega into their crust here. Mmmmmmm....", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-13", "description": "went there yesterday and saw what looked like a nice shiny, crusty apple pie,  picked it up and it was heavy! thought, maybe cuz there's lots of apples  but when i cut it open i found a solid, hard chewy doughy crust about 1/8\" thick!!!!!  both top and bottom crust was like this and the rim was rolled over to form a round hard mass.!!  there was one thin layer of apple in between the crust.  the weight of this pie came from the DOUGH!!!\nthis was THE absolute WORST apple pie I have ever had.   for $5.99 it was a waste.\ndont EVER buy this pie.", "author": "dee c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Best egg Crust portuguese style and BBQ Pork pastry! Yum, Milk tea only $0.99", "author": "Jacqueline X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "I desperately needed a cake to surprise my dad on his birthday. It was almost 7PM and I was stuck in traffic on the Bay Bridge, freaking out! Thankfully, my bff called and asked them when they'd close. 7:30, phew, I still had about half an hour. Anyway, when I got there, it was about 7:15, and there were still plenty of people waiting inside. They were really quick and I got in and out in about five minutes.  The lady who helped me was pretty nice too and did everything with a smile, which I really appreciated. The cakes are reasonably priced, and are pretty good (try the mango mousse one). And they pretty much write anything you want on your cake. Once we asked them to write \"Happy Birthday Bitch!!\" and they did. Hahaha, good times. And I'm sure their other baos and other such items are good too.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "My family always always get the baked buns here. They're very addicting! My girls can finish a whole bag (each bag has 12 buns) in a day and a half. I also like their raisin loaf. They're baked fresh everyday. I usually come here for the bread loaf but their cakes look/sound good too!", "author": "Jean T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "By FAR one of my FAVORITE Asian bakeries. I love getting the little angel food cakes and other special little items they sell here. They also have a location in Daly City which I tend to go to more since we take our fur baby grooming in the area and it's less of a hassle to get to. But whenever we're eating at Pho Hoa Hiep on Irving or going to Wonderful foods we stop by and take some pastries to go.", "author": "Petra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-20", "description": "LOVE the pastries here! Not healthy at all, but what pastry is. \n\nI almost always come here for birthday cakes, and have tried almost all of them. The like the mousse cakes the best! Tie between Mango mousse and Strawberry mousse. The chestnut cake is also high up there on the rankings. I don't particularly like the green tea cake though, a bit bitter. Oh man, and the cake rolls with the cream swirls are really cheap and delicious! \n\nThe buns here are pretty good but they are a bit expensive, at LEAST $1 per bun. BUT if you come here at 7:00pm there's a special: 2 buns for $1.50. They close at 7:30 so you should come here 5-10 minutes before to beat the rush, yes.. there is usually a line of people with a tray full of buns (sometimes 2). My personal favorite is the pineapple custard and raisin bun, second would be either cream cheese bun or the white cream filled bun. \n\nGreat place just might be a bit pricey.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-30", "description": "Has all of the wonderful staples of an Asian bakery... all kinds of filled buns and ornate little cakes. I really love the Purple Queen dessert which consists of panna cotta, red beans, and taro pudding. It was a symphony of delicious flavors.", "author": "Aurora S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-27", "description": "Positives:\nTheir breads seem fresh and the prices are generally cheap.\n\nNegatives:\nTheir cakes are not that great and quite pricey! Also, in this modern era of ATMs and credit, they don't accept anything but cash!\n\nSorry folks but lately I've been on an anti \"cash-only  restaurants\" mission. There are so many competitors out there and with modern technology, who doesn't have a credit card machine? Besides, those stores are quite silly. They don't realize that people actually SPEND MORE and EAT MORE when cards are accepted. They think they're the only smart ones in outwitting the IRS...", "author": "Mashimaro M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "For $7 I ordered the taro root bun (2), red bean bun, puff pastry, and taro pastry with mochi inside. The taro root bun was really good but the filling was a bit lacking. The red bean bun was OK, the beans inside were a little too dry. The puff pastry took me by surprise because I didn't know it had a filling of some dried pork. That one I didn't really like so much. My favorite was the taro pastry with mochi inside. I wish I took a picture of it because it was so cute, it looked like a little purple rose. I didn't think it would have that much taro flavor but it did and the mochi in the center was a perfect compliment to the pastry on the outside. Although the price was kinda steep, $1.85 for the bite sized taro pastry, I'd still buy it again because I've never seen that before. I'm now kicking myself for not buying some more. Anyone taking a trip up there soon?? I'll pay you to buy me some!! =)", "author": "Lei S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-19", "description": "I get over-whelmed and want one of everything whenever I come here and somehow only walk away with a loaf of their cheese-bread.  It's hard to explain...it's like a little kid trapped in a candy store and can't figure out what to get at the end.  I'm glad I live kinda far, else, I might just walk in everyday just to look around.\n\nTheir Mango Mousse cake are THE Best and the other cakes are good as well.  All the fruit cakes here are delicious and I have never disappointed with them.\n\nWith my loaf of cheese bread, I usually get my $1.50 milk tea - which is actually pretty okay.", "author": "Bessie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-08", "description": "Love their tarts and assorted baked goods.  a bit more expensive than most chinese bakeries, but I love how it comes in packages so it's all sanitary.  Except that it's not warm like the other bakeries and I guess you get one or the other... whichever you feel is the lesser of 2 evils or if it's sanitary v. great taste... whatever.\n\nThey prob. have the most selection at this location b/c it's the first store in SF Bay Area.  What I like best is their deal after 7pm where it's 2 baked good items for the price of 1.  \n\nsometimes i come here to grab the cold sandwiches for work the next day.  I mean $2 for a sandwich?? can't get that anywhere.  And their bread stays soft for a couple days.. can't ask for more than that..", "author": "AhLin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-14", "description": "Buns buns buns oh how I love me some buns. Even though I don't eat pork (which eliminates half of the buns) I still love me some yummy yummy buns. Like red bean. Or taro. Or custard. YUM! YAY!\n\nWe took some along to Napa on a wine tasting adventure and they definitely came in handy for soaking up the vino.", "author": "Irene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "Been coming here for the past couple of years for cheap and delicious Chinese pastries.  My favorite are the mini-moon cakes (red bean and green tea are my favs) Sheng Kee serve year round and the custard buns and tarts.  Definitely plan on coming here for dessert after eating at one of the many great Chinese/Vietnamese restaurants nearby", "author": "Ben T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "Love this place. I've been here every time I  visit SF. Love their Saseme Thin Cookie, Custard Bun, and Paper Cup Cake.", "author": "Joe C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "You really get what you pay for here. I definitely notice an increase in quality when I come here versus a chinatown bakery. I usually get the coconut bun, which is so delicious in the morning when it is fresh out of the oven. I also get the ham & cheese bun, which is good too but a little too overwhelming. At first, i thought the ham & cheese was better than the coconut bun but not anymore. This place also has some really nice looking cakes but they're quite pricey. The only reason I didn't give this place a full 5 stars is because they're really expensive for a bakery. I believe the cocunut bun is $1.19 which is outrageous for a bun. I can get a bigger one for 70cents in chinatown but of course the quality is not as good as this place's. Overall, come here if you want to splurge a little on a good quality bread. OMG, how can i forget about their taiwan toast. It's absolutely delicious. I know it's just plain bread but it tastes very good since Sheng Kee uses quality ingredients. Again, it is very pricey. A little of $5 for a full loaf.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-04", "description": "In need of a cake?\n\nSheng Kee is a great place if you are in dire need of a cake for that special occasion. There are many selections of cake that will suit your needs such as a fruitcake, chocolate cake, coffee cakes etc. Prices are great too. All their cakes are not overwhelming sweet and are always very moist. Prices are very good as well.", "author": "David W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "Mucho kudos on the variety of breads they bake...I love their coconut breads and their sweet potato is also a favorite. They offer wheat, white, pineapple custard bread as well. But stick to what you're willing to experiment with.\n\nI found that if you french toast the coconut bread, it gives off an amazing flavor. \n\nCash only, but I haven't found a chinese bakery that accepts credit cards.", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-08", "description": "Yummy breads and cakes here. They used to put a lot more cream cheese in their breads but the past few years, they've been kinda stingy.\n\nThe cakes are all beautiful and the price reflects it. The last cake I tried was the green tea and red beans cake. It was how shall I put it? It was \"interesting\". It wasn't bad yet it was good. \n\nI haven't been there for the \"7pm\" sale but I hope to one day witness this for myself.\n\nToo bad they don't take credit cards.\n\nEDIT 2/21/08\n\nI originally gave them 5 stars, but I had to drop it down to 3. I bought some buns and they had so little filling. It was mainly just the bun. That is not cool. I don't want to eat just a bun! I will not be purchasing any of their buns but will continue to buy the cakes.", "author": "? ?."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-23", "description": "I've only been to Sheng Kee at the Daly City location because my sister lives nearby there, but never knew I had one in my backyard as well!\n\nAbsolutely love the custard buns... actually, I'm eating one as I'm writing this review! Also love the little hot dog buns.  Can't wait to get more...\n\nScrew it, I'm going there later today to get more.", "author": "Serge S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "Had the egg bread and now it is a weekly staple in our house.  Put peanut butter on it and you will see what I love so much.  Delicious!", "author": "Desmo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "My family and I have been going to Sheng Kee for years!!!! I am a huge fan of their sponge cakes, because they use fruit moose and fruit to top the cake or put it inside the cake. I also LOVE their Pork Buns and their moon cakes. I would say though their ordered cake always testes much better then their ready made cakes, but they are still good!!! This is a must bakery to check out in the Outer Sunset!!", "author": "T C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-02", "description": "Bake goods are good, but the price has been going up & up.  Do not expect any good customer service they basically has a tiny counter space not enough space for people to pay for their goods, & they never say hello or thank you to the customer.  Is a dessert place so lighten it up!", "author": "Kat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-24", "description": "I used to come here a lot when my oldest bro lived in the area.  He would always have old, expired food in his fridge and on the tables and would only order take out so I would have to grab my own food before heading over there or risk starving.\n\nSheng Kee served me well when I didn't want to go into a restaurant and order take out and just wanted a few buns.\n\nI liked their tuna bun, good 'ol cocktail bun, cream puff bun and so on.  Luckily whenever I went, it wasn't ever too busy.\n\nTheir cakes were good when I first started eating them but I got tired of the texture and wanted something more close to American spongy cakes but not so loaded with sugar.\n\nSome of their prices can be a tad on the steep side for me tho.", "author": "Gilbert C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-28", "description": "They have very delicious coconut, taro, pineapple and red bean pastries. Yum yum. Their breads are also very fresh and delicious and good just to eat by themselves. They also have a wide range of chinese cakes which are all very delicious. I like their mini cheesecakes which are around $9.  I didn't realize this, but they also have these special taro pastries which my bf brought back for me from Taiwan. Sheng Kee has their own version and they sell six of them for $10.99 in a pretty box. You can also buy them individually.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-11", "description": "Warm custard bun on a foggy day = post-pho bliss.  I have only had the custard bun here but it was fluffy and creamy in ways that other custard buns in my life have not been.  Don't tell anyone, but I am secretly on a quest for the perfect custard bun (despite being dead set against sweets -- I hate sweets!!!)  This one came pretty close.  Because it was not overly sweet!  But I will have to go back and sample more to be sure. ;-)\n\nUpdate: their Japanese cheesecake with fruit topping is also very nice.", "author": "Molasses C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-15", "description": "I love their cakes with the chestnut filling! The fruits in the cake is very freshh! and the cake is moist too! Also the custard bread loaf! I love custard! The ham with corn bun tastes like how it would taste. Hmm but it sucks that most chinese bakery uses lard, margarine, and etc.", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-03", "description": "I love Sheng Kee for their buns. Esp pineapple buns. And spongecake. And everything else pineapple. But hands down the best part of this place is the variety of cakes they have, for a decent, affordable price! Nobody DOESN'T get a Sheng Kee cake for special occasions.", "author": "Cindy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-09", "description": "So affordable, and we got a great shot of the Golden Gate driving down 19th Street.  My kids really enjoyed the shredded pork bun and milk tea.  So nice being back home in the bay!!", "author": "Marisa I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-10", "description": "Great strawberry whipped cream and sponge cake. It is not that horrible buttercream and 2 cups of sugar to make you sick kind of Bakery. Just really fresh, made that day good.\n\nPre-order your cakes here. Good prices for delicious sheet cakes.\n\nParking sharks here, watch those FOBs that think its like the 30 Stockton run on and crash into my car and I will sue you for the value of your $800,000 house Mrs. Wong.", "author": "miriam b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "This place is really good if you like bake goods... the price range is ok..but  the food is really good. If you walk in and looked straight ahead...displaying to the public are the most wonderful and delicious cakes that you will ever taste (or seen) in your life.They are so0o good!! I recommend getting one to eat either for an occasion or just for yourself.\n\nI love their sponge cakes...but most of the time I get their pineapple bun.", "author": "Maile W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-01", "description": "Growing up, I always have this squared-like type of bread from my neighborhood bakery. I can never forget that taste. The perfect dough-processed with soft white bread feeling. As I get to the U.S, I just found that taste again from Sheng Kee Bakery. \n\nGet their White loaf of bread, Bun with Dried-minced pork jerkey on top and their Cocktail bun. \n\nIf it can brings back the good memory of my childhood, then it can totally brings you so much JOY too...\n\nTreat yourself & buy the nicest warm breads in the morning, when you only need to pay so little money.", "author": "Inne S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-17", "description": "I use to come here a lot for the loaves of bread. But since the prices for wheat and flour have gone up, so has the prices here. My mom came in for the raisin loaf and it was about $4. I haven't bought a loaf of bread since prices have risen so high. I'm forced to get normal bread from Safeway. Boo! The prices of the freshly baked individual wrapped buns have risen slightly. I still get the shredded pork bun, freshly baked Portuguese egg custard tart and the individual cake slices (mocha). They offer individually wrapped buns for half off for an hour before closing. I don't know if they still offer this discount. \n\nI like the cakes here. In particular are the strawberry-mango mousse cake and the mocha mousse cake. These cakes have been received positively received at family functions. There is a good balance between the lightly whipped mousse and the moist cake on the bottom. These cakes come with a price - the small one is $22.95.  But oh so worth it!", "author": "Candace F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-29", "description": "Nice to have a dessert/cake house in the neighborhood. I would give 5 stars if they served more Chinese desserts like egg tarts.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "I was kind of overwhelmed here because there didn't seem to be any order to the chaos.  I just walked in and followed what other people were doing and the people who worked there were just chatting among themselves instead to helping customers.  Whatever.  I got a taro bun for $1.80 and it was super good.  It was the middle of the day and it still tasted fresh.  I saw people paying with a card.  The register sign said you can pay with a card if it's over $15, but the people in front of me used it to pay for something that was like $9, so maybe they aren't that strict about it?  I would definitely go back here and try something else.  The tables were clean, too.", "author": "k h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-05", "description": "Their cakes are yumm. Cake is firm and fluffy and the cream is bouncy. We got a fruit topped cake for my mummy's bday here. Kiwi, Strawberry and peach galore. The only thing i didnt like are the stripes of strawberry jam embedded into the cake--made it too sweet. You can expect consistent deliciousness here.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-20", "description": "Love, love, Love their variety of buns:  pork sung, taro, red bean, & chocolate mochi filled pineapple bun (looks like pineapple, not tastes like pineapple).  But what happened to the chocolate mochi bolo bow?  Irving St. & Westlake doesn't make it anymore.  I crave for those.  Does any of the Sheng Kees still make them?", "author": "Jeannie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-26", "description": "Solid-love getting a pastry or treat on my way to the beach.", "author": "Melanie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-15", "description": "3.5 stars\n\nAfter waking up and taking my dog for a stroll in GGP on a saturday morning, my stomach starts to grumble a bit and my mind starts thinking about what I want to munch on.  Quick take-out? sandwich fom andronicos? congee? So as I'm driving up Irving, I see a parking space near sheng kee and decide .. Ah! ill just grab some buns to snack on.  I come to sheng kee pretty often, but alot of them time I leave a little unsatisfied.  You can't go wrong with the loaves of bread, but the individual assorted buns are a little of a let down sometimes.  For a snack I usually grab some of those pre-made half sandwiches or chicken pot pies.  When my sweet tooth is kicking extra hard, i like to pick up some taiwanese candies.  They have a lot of fancy cakes to look at, but in my opinion they dont taste as good as they look.", "author": "david w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-25", "description": "The cake taste is not bad, but that is the only part that I went back !   The lone line, the bad service and the attitude is just terribly  horrible !!!  Totally unprofessional !!!  I got in line like everybody else, wait it about 15 + minutes to order a b-day cake for a special occasion.  Pay and need to wait another 30 minutes for the birthday letters.  Fine.... patiently wait it.... came back over 30 minutes.  Saw someone on the side table doing nothing with the Sheng Kee uniform on.  Ask her that I have pay for the cake, waiting for the words.    Can you please just bring it out for me, Please.  Ask her very nicely.  Some nerve, she said I am on a coffee break !  Go get in Line !!!!   With an attitude !!!   Some nerve.   I mean all she has to do is just take 10 seconds to get it  for me.  About the cake that I have pay and is all rape up, all ready to go.   But instead she when straight back to the cash register.   If I wasn't in a hurry for a party.  I would just left and go somewhere else to buy another cake....... is not like they're the only bakery in the bay area.  piss me off,  never again.    Schubert's on Clement Street has better cakes and much better services.", "author": "Steffon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-03", "description": "Why aren't there more Chinese bakeries on Irving? It's our bread and butter kind of breakfast and snacks!", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "Bond likes his Martini's shaken not stirred. Charlie Brown likes the Little Red Headed Girl. Brittany Spears likes exposing her junk. An' I love Japanese baked goods...right down to the tasteful packaging.  But recently I was surprised to taste the light airy flavor of a Sheng Kee cake. Wonderful flavor without being overpowering or dry. Though a chocolate morsel from Tokyo will always retain my focus, the SKB fruit cake is an acceptable, temporary distraction.  Butcha gotta git to the Sunset to get....", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-13", "description": "Despite the fact that I don't understand any of what's printed on them, I really enjoy the tiny red bean mooncakes here... and anything made of taro.  Something that's naturally purple in color just has to be good.  The atmosphere is diner-like and the staff is helpful.", "author": "Bert M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-16", "description": "I love dropping by early in the mornings and picking up a fresh, just out of the oven loaf of custard bread. Makes for a convenient breakfast and snack. I'm always tempted by the other pastries and cookies but have stayed loyal to my custard loaf and every once in a while, a coconut cream bun. Try reheating it in the oven for a minute for sweet, coconutty bliss!", "author": "Nathalie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "The bao and cake here are delicious. Walking 20 avenues just to get some delicious. They're presented beautifully, with your eyes almost able to gorge on the look alone. The prices are lean too, with individual buns costing between $1-1.50 and slices at $2.50-3.50. I am a now a regular and make it a point to come here at least weekly.\n\nTry the taro, red bean, custard or chocolate buns. The mango mouse was good too, but sadly not as \"mangoey\" as I was hoping. Very light and non-greasy foods here - a great sweet treat.", "author": "Delicious R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-30", "description": "absolutely one of my favorite bakers since i was a kid. there are just some days when i'm totally craving the asian cakes. i think it's something about the spongy, light, cakes and the whole bits of fruit stuck in between each layer.\n\nyou MUST try the japanese cheesecake!", "author": "Mayson J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "Their sandwiches are best.  After 6PM they are half off.  Great deal!  The employees have a bit of an attitude though.", "author": "Jean Lee W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-18", "description": "this is my one stop place for shredded pork bread (it sounds better in chinese) and tiramisu!\n\ni found a new love...\n\ntheir little triangle spongey cake things... (it has two flavors chocolate and strawberry) YUM! ill have to go and get some more 2m!", "author": "JUDY L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-05", "description": "I love their Pineapple buns and Green Onion bun! Their Mooncake is also one of the best around. My parents gave a box of Sheng Kee mooncake to my in-laws and my mother-in-law ate it all in 2 days! The secret to their delicious mooncake? Well, according to my brother who use to bang mooncakes from little molds at ShengKee, lard...lots and lots of lard! The prices are also a bit expensive for a bun. But, I recently found the secret to buying cheap Sheng Kee buns, go there at 8pm and everything gets marked down to half the regular price. At least thats what they do at the Sheng Kee at Skyline plaza. People start hovering around the pastry windows with trays around 7:50pm. As soon as 8:00pm come around and they put out the sign for the discount buns, people start grabbing buns like they're giving out free crack. I once had to fight some old lady for the last pineapple bun... Ahh, good fun..", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "i love the pineapple taro buns!! its my favorite!\n\nthey have good cakes. i've tried their cheesecake before and didnt like it. black forest cake...eh its also okay. but their mango mousse cake is VERY YUMMY! they also have good bread.", "author": "B B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "Misleading label... why named a loaf of bread & bun \"pineapple\" if there is actually no pineapple....the shape of bread don't even look like pineapple either...I hope someday I can see some bread that has real pineapple inside...", "author": "Shun-ling L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "i like coming here because i like their asian pastries! their cakes look so good and they taste good too! i've been coming here since 5th grade and i still come here once inna while. altho it's a bit pricey for their pastries like their moon cakes, but their really good. my girl and i use to stop by around 630(i can't quite remember.) their sandwiches goes on sale, so it's cheap. lol i usually save the sandwiches for dinner because i'm too lazy to make food. \n\nprice are good for the quantity! \n\njust a heads up, they're cash only no credit card.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-01", "description": "so it's 7:30am on a tuesday morning and the majority of the fresh buns aren't out of the oven yet. isn't this the prime time for people to come and get their breakfast? \n\ni couldn't get my bbq pork buns because they weren't ready yet. so i settled for the pineapple buns. too bad the pineapple crust was only spotted on the top of the bun. the bun itself was fresh and soft and fluffy. just the way i like. \n\noh yeah, and who can start the morning without a cup of hot milk tea? i certainly can't. i looooove hk style milk tea.", "author": "Mei N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-11", "description": "back in the day when i lived in the awful outer sunset (41st and judah), my friend lydia c, would always want to go to sheng kee whenever she visited.\nthe buns are pretty good... there are sweet ones as well as savory ones.  i don't think i've tried their cakes though", "author": "charlotte s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "Amazing pastries.  Really! The one thing that kills me is how much damn plastic that they use.  Everything is covered in platic in this place.  What a waste.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-26", "description": "the cakes here are really pretty but as others have said are overpriced.\n\ni've purchased the fruit basket cake for $23 and they really do layer on the fruit! (i remember a lot of kiwi on it) however, besides the fruit, the rest of the cake is ok tasting...\n\ni've also tasted the mango mousse cake from another location and that one is pretty delicious...same price i believe", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-06-21", "description": "Sheng Kee is the best Chinese bakery in the Sunset. Their coconut rolls are my favorite... At 99 cents, how can you go wrong? Pop it in the microwave for 24 seconds, and when it comes out, unravel the sweet bread from its spiral shape, with yellow coconut flakes falling off, sprinkling the plate. At the end, scoop all the extra coconut into your mouth.. Heaven. They also make good melon cookies, dan tats (custard tarts), Portugese custard, red bean rolls, cocktail buns, and coconut BREAD (yummyyoo)! Everything is good except the big custard bun. I didn't like the custard in it. The cakes here are a little overpriced though - try Schubert's.", "author": "O K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-18", "description": "The selection here is MUCH better then those at the Richmond, CA location and the items seem fresher.  I bought some mini croissants (3 for $1.25) and they had a nice crunch but crumbled a lot while I ate them.  The service was a bit slow as well...two cashiers, 3 customers and it took several minutes to pay for my purchase.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-25", "description": "Everytime I walk down Irving, I am drawn to the wonderful smells emanating from this store.  Their sweet breads and pineapple breads are very good.  Prices are reasonable too.", "author": "Grace M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-21", "description": "it was quite cruel that hyphen magazine's booth ended up right outside the doors of this institution, for soon enough, we were heading in and out of this place, at a little more than a snail's pace.  \r\n\r\n*drool*  man, those pineapple buns were good...", "author": "Jill k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-23", "description": "Sheng Kee makes delicious baked goods. Wowow. Like, all kinds of Chinese pastries. Their cakes are really good too. Not too sweet like those Safeway cakes. This place in particular is usually a bit crowded and there are at most like 2 cashiers so it takes a bit of time to pay for stuff, but their stuff is soo good.", "author": "M J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-18", "description": "Excellent sweet breads; every one I've tried has been delicious. And I like going in and looking at the freaky hot-dog-green-onion or tuna buns. Someday I'll probably even buy one.", "author": "Heather R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-06", "description": "99 cent apple turnovers that will make your taste buds SING!!!", "author": "Keika L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-06", "description": "Its a pretty good bakery....The chocolate roll is off the hook!! OMG so good.  The cakes are decorated nicely and taste good.  However there is a price for the little decor....its pricey.  I grew up in Chinatown, so i know the usual cost for the buns and this place is charging waaaay too much for the usual buns; cocktail, pineapple, BBQ pork etc.  In chinatown you can usually get more for the same price and it actually taste good too..  But this is the place to go for cakes and the rolls....MmMMm.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-27", "description": "The buns seem freshly made but I don't know what kind of flour they used. The texture of the buns just dont go right. I guess people buy buns there probably because they don't have many choices here.", "author": "Erica C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-23", "description": "This place individually wraps their baked goods to make it seem more upscale and classy, but that does not make their stuff better tasting. I've had so much better at locations that are not too flattering, but its not about appearance, its about the food. Don't waste extra money here when you can save and get so much more at an authentic Chinese Bakery.", "author": "Maggie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-02", "description": "This bakery is sooooo reminiscent of the bakeries I would go to with my Grandma whenever I would go visit her in Japan. The highlights of my forced childhood family trips... bakeries and the infamous electronic gadget district in Tokyo.... anyways, yes this place has fresh patries. the aroma of butter just draws you in and I can never leave here buying just one roll.... cheese, corn, and ham bun? mooncakes? hotdog and cheese roll??? puff pastries filled with curried beef???? oh how to choose how to choose?????", "author": "Marina K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-20", "description": "Raisin bread...get some!!!  Oh, pass on the egg custard tarts, though...you can find tastier, flakier ones elsewhere.", "author": "Joyce L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-09", "description": "I come here for their custard bread.  It is one of my staple foods.  The red bean or dry shredded pork bread is good too.", "author": "Mick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-10", "description": "What can I say? This is the place where those dreaded Chinese cakes come from. I mean, it's not a bad cake, but shit.. they all taste the same! I swear!! Other than that, they have nice little pastries and rolls to try. I can't say I've tried them all, but by far I'm always munching on a few here and there for breakfast in class. Every ones always asking me if I made that shit or something. HAHA funny peoples.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-19", "description": "Stupid amounts of bread, stupid prices ($0.99 for a hot dog & cheese bun!?), stupid crazy good chinese slogans equate to a stupid good cheap eat. I just wish it had ambiance, or else I would eat in there with my fly gear, stuntin'.", "author": "Haz O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-01", "description": "I love their coconut bread. My parents have been coming here for bread for years now.", "author": "Jen P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "If you like bread, and haven't tried Sheng Kee's \"Taiwanese bread\" yet, you must! I have absolutely no idea where the origin of this bread is, but it's very common in Japan and something I missed a lot in the US. It's a white bread, almost perfectly square, and soft but with sufficient density to stand up to toppings or as a sandwich. Definitely one of the best breads for toast, french toast, or a sandwich! Sheng Kee also has tons of filled buns, and the taro one comes highly recommended.", "author": "Will A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "My review: There are a lot of Sheng Kee Bakeries out there. I have bought many pastries and cakes there before. The workers are really nice and it's pretty darn cheap compared to other bakeries. I recommend a person to try it here at least once.\nRumor I've heard: They scrape off the mold on cakes and put it back outside.", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-25", "description": "This is the place to go for the goodies. They have this really tasty egg tart. There's two types, only the one that is a bit over $1 is tasty. Its even better than the ones from the Golden Mountain or something like that on Grant in Chinatown. Plus service is much better. I LOVE their chocolate mousse cake. There's like 3 different layers of delicious chocolatey-ness. The corn and harm bun isn't bad either. I never had bad experience with any of the workers here. Plus I remember I got something free here too. This is probably my favorite Chinese Bakery, thus far.", "author": "Audrey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-15", "description": "not known for low prices but always good quality, and every location is freakin' clean, unlike most local chinese bakeries\n\nthey put everything in a really cool box, too\n\nthe coconut rolls are also good. hella good. like \"holy crap i just ate seven of them???\" kind of good.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-26", "description": "i ordered cakes alot from this bakery in the past year. throughout the year of 2006, i been moving around and tried other cake places around bay area. for this Christmas, i ordered mango raspberry cakes from here, because of time limitation. i brought this cake with confident remembering the past experiences that i had. \nafter Christmas dinner, i cut the cake... everybody was like uuh oohh, how beautiful cake is...\nbut, after i taste it... it was sucks !! everybody else didn't say anything, i don't think they dare to say something.. but seriously either they change the chef or the try to change some quality ingredient to cheaper stuff.. i don't know...\n\neven the regular Taiwan toast are sucks ! not moist and fresh enough.\ni will stick with Schubert next time i have to buy a desert ! \n\nthanks for your embarrassing moment, sheng kee", "author": "sherly A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-05", "description": "I love almost everything here.  The breads, rolls  and cakes.  I don't even know where to start.  Just try everything from this bakery.  The coconut toast, cream cheese toast and pork sung are my favorites.  I love the mocha roll here.  Recently, I ordered a mocha chocolate cake here for my sister's bday it was really yummy.  The japanese cheesecake is very fluffy...I didn't get a chance to have a slice the last time we ordered one.  You can't go wrond if you order a cake here.", "author": "Allison T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "Great selection at a great price. Tried their shredded pork bun and egg tarts and red bean mooncake pastry and it was all good. Will definitely come back and try more next time...I am thinking of definitely trying some of their baked pastries too such as the curry beef horn...oooooo.....", "author": "Topazskye L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-03", "description": "This is the closest place to satisfy my pineapple bun craving. The ones they make aren't quite as good as some of the ones I've had from Chinatown bakeries, but they're still pretty darn good. Based on other reviews, I'll have to try some of the other sweet breads.", "author": "Kathleen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "I love the clean and modern atmosphere of this place. Their simple baked goods are something I always look forward to when I'm in the area. I'm obsessed with red bean and they have it in several great varieties including the basic red bean bun or pineapple bun. Cheap and great food, and a nice place to hang around in a nutshell!", "author": "Steven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-03", "description": "This  place is pretty good if u are a munchie person. I used to come here as a kid getting the flakey stuffed chicken bun, jelly rolls and sponge cakes. Now, I come when I get a major craving for my childhood cravings.", "author": "Jason C. J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "Mmm.. custard raisin loaf bread, slices of yummyness.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-09", "description": "I would replace an entire meal just for two PorkSung baos. \nI (think) they're $1.35 each now.. And I dig through the whole tray to find the biggest one with the most PorkSung on top. \nI do think that there is a bit too much butter, but I'm quite biased... I hate butter.\n\nAnyways, the cakes are cute even though I'm not much of a mousse-cake type of girl.  Almost identical to the ones from Schubert's... although I must say I prefer the latter.", "author": "Diana W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-03", "description": "I LOVE this place! Their breads are made daily, and their nightly special thing where it's like 50% off is a way to prove it. So if you go get something in the middle of the day, you know it hasn't been sitting there for weeks. It's really clean too! And their cakes taste& look awesome!", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "Their cakes are really fluffy, not heavy, consistently tasty.  Great birthday cake options and we will not go anywhere else!\nPastries are good here as well.\nYou do have to have CASH to pay, parking can be challenging.", "author": "Miinno N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-13", "description": "I LOVE Shenh Kee and take every opportunity that I can to stop in for custard buns and hot dog buns.  I also like anything they make with pineapple in it (I don't think the \"pineapple buns\" actually have pineapple in them, but other pastries do).  The service is unique.  No pleasantries, no b.s.  They ring you up promptly and get you out the door.  These people don't mess around--they are the definition of efficient.  On occasion I get a friendly smile though.  My only complaint is that I think their cocktail buns need some work.", "author": "Kandi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-08", "description": "My co-workers at Saks 5th gave me a cake for my birthday, it is quite far where I live now, but I'll try to go back and get their cheese bread, even my 80 year old father liked it.  They should put one store here in Union Square.", "author": "sfbutterfly l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-29", "description": "Their bread is not so good, it is just an ordinary bread, not tasty and a bit dry. I like Utane Toast from Ranch 99 Foster City better because it is softer and very tasty especially when you toast it.  The price is also cheaper.\n\nI only buy the cakes (tiramisu or fruit cake) for friend's birthday from them and they are good! Also the sandwich is pretty good for a little snack between lunch and dinner.", "author": "sofie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-26", "description": "I picked up a strawberry birthday cake and it was lovely!  The cake had glazed fruit on top, light and not-too-sweet frosting that did not sog the pound cake, and cute decorative flourishes (swirly design on the side, fruit artfully arranged).  I ate a coconut bun while waiting and it was yummy too.  I reccommend!  The person who asked me to pick up the cake assured me that it would be cheap, but the cake cost $20.  Is that what these things go for these days?", "author": "Eleanor E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-18", "description": "DON'T go to this place\n\n- the people working there are RUDE. they just want you to pay and leave and are unfriendly.\n\n- DON'T do custom orders here. I've verified with them twice of my custom order and it didn't turn out as ordered. their displays of cake looks nice, but BEWARE, your order does not look like that!", "author": "sleepy b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-03", "description": "cakes are artistic and tasty, especially the mousses \nbuns are buttery and sugary - usually fresh \nbread is just buttery - always fresh during the right times of day\nswiss rolls are cold - good deal if you're in the mood for ONE slice \nmooncakes are the best - they have the best non-yolk fillings around, especially the black date paste [dou saa] inside \n\nside note - sheng kee tends to be a little overpriced than other bakeries within the irving corridor radius.", "author": "Court L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-24", "description": "-this happened bout a year ago\n-is it their goal to piss off customers? or only the ones not of their race?\n-i came here to pick up a cake dressed as a pirate for a themed birthday party\n-after the stares, found out they only take cash so i run out to the car to where my man handed me cash\n-parking is a biatch by the way\n-upon ringing me up, i found out i was 25 cents short and, that was all the cash we had\n-i was asking the customers if they can spare a quarter, looking like a pirate and they all \"pretended\" not to understand fucken english.....\n-great! i leave the cake on the counter and run back to the car to fucken look for a fucken quarter prolle on the floor of the car or up my ass\n-my man found while digging in his wallet a 2 dollar bill he's kept in there for ages, with a heavy heart we use that to pay their fucken quarter\n-it felt like a trya banks social experiment \"will people treat you differently if you're a pirate\"- no shieyt sherlock!\n-i went to another one of their bakeries in san jose and actually commented on their service there too, i didn't know they were branched till today!\n-1point cuz the cake did taste good\n-i walk out of there looking like a pirate to a leathered acura cl with navi, my authentic prada purse with matching wallet, with a great job making bout 70 g's a year and to my CPA boyfriend feeling like crap\n=YOU MIGHT HAVE EVERYTHING BUT..... FUCKING 25 CENTS (totally forgot about the $200 CASH! i had in a card in my bag as a bonus from my boss, fucken ey)", "author": "serbelle i."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-07", "description": "love this place! sheng kee is one of the best asian bakeries around, i just wish they were closer to me...cakes are yummy, pretty and well worth the 5 stars. one of my favorite things aside from the cakes is the green tea  with red bean swiss roll thingy. love. love. love.", "author": "meL Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-02", "description": "I like how everything is individually wrapped here. I know it's bad for the environment but I find it really cute for some reason. Anyway, if I'm in the area I grab a couple of buns before grabbing the 28/29 to school. So far everything's been good. Not a big fan of the BBQ pork, but all the dessert-y type stuff gets my seal of approval; I think the red bean is the best out of all the kinds I've tried and I'm usually not a red bean person!", "author": "melissa f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-20", "description": "fear not the sheng kee, oh sf newbie.  yes, it can be intimidating to not be able to read the chinese characters.  and perhaps you know not of the flavors of a pork sung bun ( i don't), or even taro root.  but, young butterfly, allow yourself a chance to follow the way of the sheng kee and yee shall find a pathway toward enlightenment (or more likely not, i'm just grasping for an intro here). \n\nok, hows this... i imagine a music video for \"the scale\" from the new interpol album.  in the video, i peruse through the many different buns.  trying to decide between a pinapple and a custard.  as my eyes scan left and right, they work in concert with my brain attempting to process the resulting tastes of the various pedestrian and exotic buns (i think i quoted the title of an adult video just now).  and then my hands reach to jostle the different bins, as if i've got epidermal taste buds that can pierce through the crisp plastic wrappers, giving me insight on which of the many buns would maximize my satisfaction (whoa, we're deep in the adult video section).  all the while, elder statesmen and queens of the sheng kee secret society jaunt in and gather their deserving booty with utter confidence (gee, i hope sister joan from the catholic grade school i attended doesn't read this.)  i make note.  and then as i begin to head toward the counter, a warm new batch of mystery buns is stocked on the shelves.  i spin around, rehash my decision and question my snack choosing ability.  what?  shall i be mocked for going for the hot dog and onion bun ?  i've lost my mind.  what am i thinking ?\n\n4 stars for the coconut custard bun.  man oh meng.  thats where you should be.  put down that ham, corn, and cheese bun please.  get it together.  maybe after 4 beers at pac bell with the giants down by 5 and zito long gone.  the coconut custard bun.  buy one for the trip back to the car.  one for later as the evening snack.  and one more for the next morning with the coffee.  then go to your local 24 hour fitness, sit through the speech to get you to sign up (but resist to the best of your ability), and get your free workout.\n\nps.  do stay away from their coffee.", "author": "Ed S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-21", "description": "went here and picked up: taro bun, red bean bun, custard bun, pineapple bread and a large (cake size) fruit tart.  the fruit tart was pretty good and didn't have an awful syrup flavor to it.  the buns held up well and stayed soft for breakfast through the week although the custard bun was too buttery and sweet for my taste.  maybe i lucked out, but all of them had an ample amount of filling inside.  the pineapple bread was really yummy at first but started to get stale after the first couple of days.  i'd definitely go back and try more stuff, but now i know to be more careful with storage for the rest of the week.", "author": "Aparna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-26", "description": "sheng kee bakery cakes are a staple at every family event we have because they are just sooo good. i know the chinese bakery goods are what they are known for but try the taro cake, the black forest cake (chocolate with cherries), the mango mousse cake, and the tiramisu. and the mooncakes here are amazing too. try the pineapple ones if you're just getting started with them.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-03", "description": "Overall, their cakes and buns are very good. I love them all, just a little pricy. Their stores are usually very new and clean. For all my kids and friends birthdays, I got it from them. It is expensive, but its all worth it. However, there was one incident, I wasn't happy about their service. I came pick up my daughter's bday cake. Then they told me they made a mistake, my cake wasn't there. They told me to get a different one. How can I just get another one? Its a kids bday, I had made plans to make a special party for her, the design of the cake was specially picked. You can imagine how frustrated I was. They said they could make one but I had to return in the afternoon. If they offered me a half price or a cake for free, I wouldnt be so mad. No, they didnt! Thats not a good way to do business. Especially to a customer like me, i've been buying so many cakes from them. They made the mistake, they should have given me a free cake or at least a discount. I was very angry that day, ruined my daughter's bday too!", "author": "The Black Cat C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-21", "description": "the BEST chinese bakery in USA, Sheng Kee is a International Brand Name, Unlike other mom and pop chinese bakery normally outside clean but kitchen super dirty, Sheng Kee always can trust and believe.", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-26", "description": "maybe because i had too much of this place. this place is regularly my breafast on daily basis and i'm kinda sick of it. i wish they do come out with some better delicious bread stuff rather then the same stuff all the time. they should have more variety or just switch off more often. they are still good compared to a lot of other bakeries out there.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-20", "description": "the buns here are awesome. always fresh and yummy. their cakes look delicious but too bad theyre kinda pricy. another con is that they dont accept cards. i always use card!! overall,  their buns are great!", "author": "Rhonda H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-01", "description": "This place is horrible.  Their services suck.  On April 27, 2009, I bought  a birthday cake for my friend and asked the cashier to write the name on it but she only gave the sign to put on the cake. That night, when my friend opened the box, the cake was already cut and was spoiled.  My friend was really disappointed, and it was her birthday too !   Whatever you do, don't buy cakes here !!", "author": "Fanny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-18", "description": "mm i love there loafs of red bean bread.. its making me fat.. but its so good! i cant trust myself when i have it laying on my table.. i also bought the coconut mooncake which was nasty.. tasted really greasy. and the green tea mooncake. that was ok. but come here for the bread=) its super cheap too!", "author": "christy w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "everything there is fresh. beautiful cakes, mouth watering! if they screw up the shape of a baked good or something is not as fresh, it goes to the cheaper pile to be sold for less. cake is a must, so creamy and deliecious!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-23", "description": "The food is pretty good, but I'm not that much in favor of chain stores.", "author": "Cindy W."}
