{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "I said goodbye to the Bay at Shotwell's and I couldn't have been happier.\n\nLoved having last laughs with friends, actually being able to hear them talk, and securing a table without jostling crowds. The dim lighting with pool table in the background was a sweet bonus. And the bartender? Super nice. \n\nThanks, Shotwell's. I'll be back again someday.", "author": "Catherine N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "We were watching the warriors game elsewhere and needed a change of pace. (They weren't doing well in the first half.) My group of four decided to go to Shotwell's as it was close to our last stop. We dropped by on Saturday, May 26th around 7:45pm. It wasn't too busy from what I remember. We managed to find a table in the back by one of the TVs.\n\nI didn't take part in the ordering, but I ended up with a beer. By this time, I'd had a fair amount to drink, so I have no idea what beer it was. I just knew it came in a chimay glass. I'm not a huge beer girl, but it was easy to drink. (Beer lately has become my go to when my stomach can't handle any more alcohol, but I still want something to sip on.)\n\nAtmosphere wise, this place is your typical sports bar. Dark with lots of TVs. Had a good time with all the other basketball fans. Plus, they came back in the third quarter and won! Always adds to the fun and festivities when your team wins.\n\nFun bar to catch a game. And I can't argue with a bar that brings it home. That's a winner in my book.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Solid neighborhood bar. One time I saw a pig wearing a tutu there. And they have medieval madness.", "author": "Z J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "What a nice neighborhood bar! A lot of the bars I've been to in San Francisco have a THING happening, but Shotwell's is a place for when you just want to enjoy some tasty brews with your pals and hang out chatting in a dark and cozy setting. \n\nThere was a good line up of affordable craft beers with a handful on draught and many more in bottles. There are pool tables if you're looking to keep your hands busy with something other than beer, and the bar is dog friendly (though we sadly didn't spot any pooches on our visit). \n\nShotwell's exterior is charmingly old-school and the interior is similarly designed with beadboard and dark wood. It's a place you want to settle in to. With the low prices it's easy to park it and spend the evening.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "Great service and cool atmosphere. No happy hour but\nAffordable beers and 3$ PBR ! Good music too .", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "My favorite casual bar in this area. Barman is super friendly and it's walking distance from all the other bars (if you're looking to bar hop).", "author": "Anila G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Super local dive bar to hang out in!  Stopped in for a few drinks on a Tuesday night while visiting San Francisco.  Locals were very friendly.  Enjoyed listening to an impromptu guitar session :*)  Drinks were reasonably priced and made just right.  We took advantage of a competitive game of pool (which earned me a 1:1 challenge from a local) and the self serve Jukebox (\"Sister Christian\" still rocks it out).  \n\nOverall, a fun little place to hang out, even on a weeknight.", "author": "Tonya W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Had a great double date night here playing pool after our original plans fell through. The game was pretty close as my gf and I are both newbies. Our boys tried to teach us as best they could but it so much fun seeing them squirm as we screwed it up royally for them. \n\nFinal score 1:1 with a rematch scheduled to figure out the winner. \n\nBartender is charming but the options are pretty limited for non beer drinkers. The wines are not great but the beers are apparently quite good. \n\nThey also have trivia nights on Monday!", "author": "Eunah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Nice looking place, warm and cozy ambiance, decent selection of beers on tap. Will be back again to try the mulled wine.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Fun place! Love the casual vibe, eclectic music mix and gilt-framed mirrors. Friendly bartender. The bf and I felt really welcome here and enjoyed our drinks. We'll be back.", "author": "Liz J. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Oh fancy Beer, How we have a on going relationship. Shotwell's had me covered. We went here to meet a co worker and their friends.  It was a fun spot to hang out.. Even though all the seats were taken there was plenty of room to stand and have a brew or two or three. \n\nThe place was cool and casual, and the staff was kind and hard working. It never took long to get a drink even though it was pretty packed. The music was loud enough to enjoy, but soft enough to have a nice conversation..\nKeep the drink's a coming and they will keep coming back! Good Pub!", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "One of my favorite neighborhood bars, perfect for an after-work drink with great beers on tap and friendly bartenders. Shhh, don't tell the tech bros, they'll ruin it.", "author": "Dee C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "A great, dog friendly bar in the Mission. Great low key spot to hang out with friends and enjoy a beer! We were there on a Sunday night and I liked how it wasn't too loud or too quiet - we were able to have a nice conversation.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Refreshingly unpretentious West Bay venue that offers a surprisingly extensive beer menu, chill vibes, and lots of room to spread out - whether over pool or pinball.\n\nAs for the beer, there's a good variety of brews, whether draft or bottled, and the prices are quite decent. Service is quite friendly, the ambience rustic and warm, and even the crowd is casual and laid-back. A great addition to the neighborhood.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Nice old school beer bar. Got a bowl of pretzels with my beer, which was a nice bonus. The bartender tolde they do NOT have a happy hour, so they may have phased it out.", "author": "Bruce E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Bartender is amazing, and THEY TAKE CARD, I REPEAT THEY TAKE CARD!!! This is the place you want to be, after work and on the weekend or even if you need a break to have a drink on the weekday. Also...pool table and pinball...you can't lose.\n\n***THEY TAKE CARD***", "author": "Daniel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "No frills sort of Mission bar that's cash only. \n\nI stopped by for a short time around 9pm on a Saturday and it wasn't crowded yet (except for the large group I was with). Once we left for the next place there were only a few parties remaining.\n\nI wouldn't really describe this as divey but it has that low key local pub sort of feel. The decor is dark with lots of wood and pretty clean. There's a few craft beers on tap, a few in bottles and also wine and cider. Depending on the beer, it'll cost you anywhere from $6 to $10, which is pretty typical. \n\nI could imagine this being a nice place to chill with friends for a quiet night. The bar is actually fairly spacious feeling with a decent amount of standing space available towards the back. They also have a pool table and pin ball machine to really give off that neighborhood bar feel.", "author": "Liza X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-16", "description": "I've been here three times and always leave disappointed. The beer is warm and the pool table takes up most of the floor space. \n\nI prefer dive bars nearby with more charm, like Uptown.", "author": "Trevor B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Shotwells is a fun and low key bar in the mission. I live just a few blocks away and honestly didn't know it existed. Just a heads up that they don't serve shots, or mixed drinks. Just brews and wines. With that being said, it is a pretty intimate bar with pinball and pool. If you are looking to rage go elsewhere, but if you are trying to kickback and have a drink and conversation with a friend, this is a great location and atmosphere for you to check out. One of the hidden gems in the mission.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "Stopped by this place on a hot Saturday night.  Place is big enough with booths and tables and chairs.  Nice selection of craft beers to choose from, but it's cash only.  There is a pool table in the back too.  There is a nice, casual, and chilled atmosphere for those who just want to sit back and relax with some friends and enjoy some craft beers.", "author": "Chan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "A little on the emptier side when I stopped by late Friday night, but still a great ambiance. I looove the bartender here--he was super helpful and generously gave me plenty of samples when I couldn't make up my mind about which beer to get. They have arcade games in the back and a pool table as well. $1/game...what.a.steal!!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Low key spot to grab a drink and play pool with friends in the mission. Its a small spot, so stick with a small group (under 10), but I do enjoy that its not too loud and you can hear your conversations.", "author": "Claire W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "Pretty trendy spot in a trendy neighborhood. It was hard to find a seat on a Wednesday night at around 9pm. Still, standing around with my go-to Anchor Steam in hand worked out just fine. Layout is simple -- a bar and a backroom with a pool table, lounge-like tables and chairs hugging the walls. The rest of the space was wide open to handle the overspill. All-in-all a nice neighborhood bar. Would love to come when it's not busy, but that's probably never.", "author": "Will S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-31", "description": "Shotwell's has that neighborhood pub vibe. Very laid back with a good selection of beers on tap and bottled. There's a pool table and a jukebox. They only take cash, but they do have an ATM inside. A nice spot to check out. I like it.", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "What a great place for beer, conversation, and a couple games of pool.  Cheap prices ($5-7 for a decent selection of draft beer, $1 for a game of pool) unpretentious attitude, and mellow, lived-in vibe.\n\nBe warned that late at night, all three street corners across from Shotwell's will have a lady of the night (aka hooker) standing on the corner - wearing the kind of clothes seen in Pretty Woman.  If you get an Uber your driver may be harassed by the working ladies.  Good for a bit of a laugh although it may make you uncomfortable.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "Cute divey bar. \n\nThe place is tiny and fills up fast so make sure you get here early!\n\nIt is cash only and there's only beer and wine. \n\nOrdered a Sangria, it is a little sweet so make sure that's what you want before you get it.\n\nAtmosphere: good for 20-30 year olds. Also a little older crowd with pinball machines and a pool table.", "author": "Chhaya N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Casual, laid-back bar with great service.", "author": "Kerry G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-19", "description": "I had the impression there would be more selection, but I like the vibe at Shotwell's - super cute neighborhood bar, friendly bartender, divey but not gross and dirty. Though the menu was not extensive, I liked all the beers I tried. Plus, they have a pool table.\n\nWould definitely return!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "The search is over trivia lovers! Your fabulous fun hosts will test your brain power and your ability to belly laugh. Recent themes have included 'Feminist Trivia' 'Halloween Trivia & Dog Costume Contest' and it's always 'No Sports'! Monday nights, be here or cry in your beer.", "author": "Aimee G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-03", "description": "I really like this beer/wine bar. It's usually pretty quiet and they have a pool table. Their drinks aren't that pricey and the cider is really good!", "author": "Katie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "Nice little beer bar. Pool tables available and juke box to select your favorite tunes. I would come back.", "author": "aaron t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "This is one of my favorite beer bars. Their selection is excellent and their prices are low. To top it off, it's never super crowded or loud, so you can actually find seats and have a conversation!\n\n$1 pool table, pinball machines, and chill music round out the casual, divey atmosphere. \n\nOne last thing: cash only!", "author": "Dan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "Fantastic neighborhood bar!\nIt's clean & has a great beer selection @ just the right price.\nThe owners are awesome!\nThey have a pool table, arcade games, & a juke box :)\nWhat more can you ask for!?!", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Awesome bar. I come often with friends to have a drink after work. \n\nGood people and good bar food. Nothing fancy... just a good pub.", "author": "Mark J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "Really good neighborhoody beer bar with cider and wine for non-beer people. Dog friendly. I go every Monday night for their weird/geeky/feminist trivia (at 7:30).", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Its the best fancy bar in the Mission. There is an interesting variety of beers. I had a Belgian beer. Its a little out of the way, but its worth the trip. Its nice, clean and not too pretentious.", "author": "Thomas J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "Liked Youngs double chocolate stout. Monday night was relatively quiet. ..liked the ambience", "author": "Indrani D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "This bar has everything: Monday night feminist trivia,  dark lighting so I don't need to wear makeup, and a pool table. What more can a girl ask for?", "author": "Claire S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "Cool, divey-ish spot away from all the craziness in the Mission. Great selection of beers on tap. Ample seating for a low-key happy hour with decent prices. They also have a few pinball machines and a pool table and game nights. Definitely a good bar to check out (4:30 pm open) with knowledgeable and cool bartenders.", "author": "Juan T. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "Reasons to go:\n- Trivia Mondays. Follow the trivia master on Twitter to get the special weekly topics. Recent ones have included: actresses that got naked to early in their career, Tim Burton.\n- Cheap drinks. I get my pear cider for $5.\n- It's even cheaper if you're 1st place (a free round) or 2nd place (50% off a round) at trivia.\n- Tamale Lady showed up just in time for trivia this week!\n\nRecently the normal trivia master's place has been usurped by either his roommate or the bartender. Neither of them seem to know how to speak into a microphone and speak way too closely to the input. Makes it really difficult to hear them.\n\nStill overall.. a fun dive bar to spend my Monday nights!", "author": "Ziyan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "Shotwell's is a great neighborhood bar for anyone who's looking to catch up with friends or relax on a Sunday night.  The crowd is a little more put-together and slightly older than the crowds in other parts of the Mission.  You'll probably see some Googlers and guys with great mustaches / beards and cool leather boots.\n\nLike the others have mentioned, the Jukebox selection is good (I put on the Smiths and Prince), and the Pinball machines in the back are awesome because the games are so long.\n\nOnly shitty thing is that it's cash only, but it's the Mission so you should probably be used to it.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-11", "description": "So, I get it. You close at 2 am and, like many of us, you're eager to get home when the work day is over and, sometimes, you like to duck out a little early. The thing is, you don't have to be a dick about it. \n\nI went to Shotwell's with a few friends on Saturday night to grab a last drink before heading home. We arrived at about 1:35, ordered some beers, and sat down. About 5 minutes later, one of the bartenders yells that we have 10 minutes to finish our drinks. Literally, two minutes later, he yells that we have five minutes to finish our drinks (apparently, time flies at Shotwell's). Then he comes to our table and tells us to hurry up because he doesn't want to have to take our drinks away. Then about a minute later, he yells that we have \"less than 60 seconds\". So, we left. It was 1:47.\n\nBeing yelled at to chug your $10 beer is really not the ideal way to end an otherwise pleasant evening.", "author": "Renee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "This place reminds me of my favorite local pub in London, UK. The wood carving around the bar is immaculate and their is only one small tv in the corner. There is a pool table and, oh yeah, the beer list is out of this world good. The bartender's are very friendly and the vibe is chill unless Fri or Sat night in which case it is standing room only, hot and loud!", "author": "Jim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "This is a cool place, and I hadn't really realized that it was right down the street from me until recently. Apparently, it's one of the oldest bars in San Francisco, opening before 1900 as a grocery store. This is detailed further on a little plaque by the bathroom if you care to check it out.\n\nThey have a nice selection of beers, both tap and bottle, with emphasis on more interesting selections. The ambience is pretty nice too, with a couple of pinball games in the back and a pool table. There is music, but not so loud that it drowns out your conversation so it's a nice place to grab a drink and have a chat.\n\nOh, one note, it is CASH ONLY, so either bring some skrilla or your ATM card.\n\nParking can be tough in this area, but there is street parking nearby if you're willing to circle the block a few times.\n\nDefinitely check it out. I'll be back for sure.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "Went here after Central Kitchen for a friend's birthday since Trick Dog was too packed.  The ambiance is ok, pretty plain with an electronic juke box that you can choose music from (as long as you pay), $1.00 pool table and two old school pinball arcade machines.  They have a good craft beer selection on tap and in bottles/cans.  My main gripe was that they are cash only which wasn't a problem but it does deter some people from spending money since they would have to pull out cash from their ATM (and get charged a fee) or find their banks ATM.", "author": "Landon Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "Was here for the first time recently. Only beer is served and I'm not a beer drinker. The outside promises a saloon vibe and the inside doesn't disappoint--could have almost stepped back in time to gold rush days were it not for the TVs, modern pool table and pinball machines.", "author": "Sandy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "Overall Impression: 1 dollar pool table, 1 dollar pinball, chillax foreign people, let's go!\n\nCost: Very cheap drinks and an affordable pitcher of cider.\n\nTaste: Only one choice of cider on tap which wasn't too sweet so it was interesting. I would probably try a different beer next time.\n\nCustomer Service: Only one worker that night but he was very attentive to the needs of everyone. Big round of applause for his dedicated work that night.\n\nAmbience/Atmosphere: Very relaxed environment and we were able to get a pool game in without any issue. The pinball machine might take your money though, so be weary of that.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-06", "description": "Okay food. Very expensive for what you get,  it good view. My biggest complaint is the host. Our service was good but on Friday night, 5/6/16, the host refused to help us when our server was busy. We were a big group, spent over 500 dollars and received no respect from this host he was just horrible. He asked me and my friend to leave the restaurant. If you think the view is cool this place is worth it but otherwise give your hard earned money to nicer people. Much better businesses in San Francisco would not recommend", "author": "Zach W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "What not to like?\n\n- Extensive drink selection, including a long list of beers.\n- Friendly bartenders who know what they are doing.\n- Open and yet cozy interior\n\nCame here with a bunch of friends on our Mission bar hopping extravaganza and we all loved it. \n\nI'll be coming back.", "author": "Liza K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "I dig Shotwell's. First, it's named after the street, so I appreciate the straight-fowardness. Can't go wrong with that.\n\nPlus, the interior is _awesome_. Thick wooden bar, big tables, cool wood paneling. Yeah, that's my jam.\n\nTheir beers are pricey, ye be warned. I hear good things about the sangria, but I can't attest.\n\nThe good: great place to hunker down for the evening.\nThe bad: cash only, BUT they have an internal ATM. Get out those dolla-dolla bills.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Cozy local place, good beers and it has pinball machines! The waiter Tom is a great guy, and very welcoming to us Swedes.", "author": "Richard S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "Pop quiz.\n\nGiven by Dennis Hopper: https://www.youtube.com/watch?v=Ug2hLQv6WeY\n\nGiven by Shotwell's: Two hours of some of the most challenging trivia ever encountered. Each correct answer deserved a drink. Each wrong answer deserved another.\n\nHappening Mondays from 8 - 10. Good luck hotshot.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "Love this place! Great beer bar, friendly service, chill rock music, equipped with a friggin $1 pool table (I feel like those are getting rare!), and juke box in case ya don't like that indie rock shit. \nCash beer and wine only. \nMy friend \" It's like my house I could just curl up and sleep here\" I'll def be back in the hood after work for this place", "author": "Stella H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "I was looking for a place in The Mission to bring some friends who like craft beer and pinball. I found Shotwells. It's a little more down tempo, so if you're looking to rage face, it's probably not the place for you. The place itself is a historic saloon-style bar with an old timey feel. Even today, it probably wouldn't be weird to see gold rush era guys sitting around lamenting their bad days.\n\nThey only serve beer, wine, and sangria. Normally, I feel like these places are a little pretentious, but nobody gave me a second look when I ordered a PBR and my friend ordered a Miller High Life. The staff is very friendly and one of the patrons suggested I try a cider since I'm not super into craft beer. The cider was awesome. Highly recommended. \n\nThey don't have a full kitchen but they do have snacks. We ended up trying some pimiento cheese and crackers which was really good and my friend ordered the bourbon spiced almonds. There were none left for me to try which I take as a good sign.\n\nIn all, it's a great place to drink some beer, shoot some pinball, and play some pool. It's worth the extra couple blocks if you're near Valencia street.", "author": "Josh Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "I like Shotwell's because it's a lot like the bar I would own (if I ever owned a bar - I won't). \n\nI appreciate any tap selection that includes both a stout and a sour. Shotwell's does, and they represent the other beers as well, of course. \n\nPool table. Pinball. Juke box. A neighborhood bar that's happenin' and also has an empty seat or two.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "The couple walking in front of me clasped each other's asses as I walked alone to Shotwell's; the art-deco double doors beckoning, a sign radiating the soothing word \"beer\" in a vestibule above the entrance. It was one of those evenings where I hoped it would stay dark forever, and (unlike The Mountain Goats in their wonderfully bitter song \"No Children\") I KNEW the worst wasn't over. My only hope of escape was to get completely anesthetized , totally self-indulgently polluted, entirely locked out of my own mind, in hopes that sometime after my fourth or fifth drink, I might be able to forget about the end of a relationship painful enough to drive me me towards the watering-holes of the Mission District instead of relaxing in the comfortable sleaze of my favorite Richmond district dive. \n\nIt was one of those nights where as I sidled up to the bar, I had to do a double take. The man reflected in the antique back-bar COULDN'T have been me (sometimes I lie to myself, especially when I'm looking more disheveled than usual), but when he (as I did in that exact same moment) ordered himself an Almanac \"Birre de Chocalat\", I had to come to terms with the fact. I chatted with the owner (David, an incredibly friendly dude), who allowed me to sample Almanac's \"Sour Chocolate Porter\" (a fantastic note of bittersweet chocolate, a faint hit of hazelnut, and an aftertaste like a tart cherry pie) amidst the beautiful chandeliers, engravings, and authentic moldings from Shotwell's time as a gin joint in the early 20th Century. \n\nAfter a second beer (Magnolia Proving Ground IPA), a third (Anchor Steam), and a fourth (a Drake's Dennoginizer [Dennoginize me David!]), I began to realize that Shotwell's was a pretty fascinating cross-section of what San Francisco had become: North-Face wearing techies living for the weekend, service industry folks with tattoos, old punks, and writers carrying me away, the internet jukebox blasting punk and hip-hop, everyone drinking away the tension of the week. In so many ways, Shotwell's may be one of the most perfect bars in San Francisco: the people are friendly, the beer is good, the bartenders aren't assholes, and the music is just loud enough for everyone to get carried away in the atmosphere of a place which doesn't need to try to be trendy but succeeds through its timeless authenticity. That night (and maybe every night) it was just what I needed.\n\nI finished my beer, stumbled out into the night, and began the long trek back home to my district. Suddenly, everything seemed alright...until the hangover hit me the next day.\n\nOverall: Five Stars. A strong candidate for what I would make my local bar if I lived in the Mission.\n\nExtras:\n\nAccessible by all Mission Corridor Bus Lines (20th St. stop), the 9, 9l, and BART (if you don't mind a bit of a walk).\n\nCash Only.\n\nMulled wine and Sangria available.", "author": "Casey U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Great neighborhood saloon. People are friendly and the vibe is fun. There is an eclectic beer selection so get ready to taste some special brews. One pool table and two pinball machines give you options.", "author": "Deacon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "Upon getting off at the 16th and mission BART stop, we were thoroughly lost (our attempt at winging it) and found ourselves in a grotto of pizza joints and liquor stores. We walked a few block as directed by Yelp to arrive at this 4 star establishment. Definitely a very chill vibe with unique beers on tap and bottled. I got the allagash white (pretty girly choice) and my bf got green flash IPA. \n\nIt seemed to be populated with locals, which was a breathe of fresh air. Bartenders were indeed very friendly (as seen on yelp) and there were pool tables galore. \n\nIf you're in the neighborhood, I'd recommend stopping by, grabbing a beer with friends, and enjoying the crowd.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Grabbed a drink at the bar with a few friends. I just got the cider special; it was pretty good. People watching was fun, and people were really into the pool table the whole time I was there. The bartender was awesome enough to give us some mis-pours during the evening too. \n\nA good place to hang out, grab a drink, and people-watch.", "author": "Sneha P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-16", "description": "This place was a little more of a walk from BART but I am glad we made it. What an awesome little British pub in the middle of Mission! \n\n(+) \n- Great feel with a large bar, update draft list on the back mirror\n- They have a pool and shuffle board table\n- Plenty of seating around which helps when you're there a while\n- CIDER!! They had Two Rivers on tap at the time, Ace in a bottle I think\n- Bartender was super friendly and helpful - suggested the ice cubes for the cider which is rarely offered\n\n(-)\n- Definitely had that stale beer smell when entering but you get over it\n- Not sure what else ... will need more market research :)\n\nThis is a place we will definitely go back to when we find ourselves in the Mission.", "author": "Jenn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "Looked this place up on yelp and the word 'neighborhood bar' kept popping up. Decided to check it out. I was here on Black Friday evening, having just arrived in San Francisco for the first time ever and since I was staying close to the mission district. It was a quieter night since it was a holiday weekend, so I sat down, ordered a beer and started talking with the bartender. What a cool dude! He said he was a transplant from Boston himself, and gave me excellent suggestions on what to see, where to go and even how to get there in San Francisco. He even recommended a place to eat later when I was leaving. There's a pool table as well and the music wasn't loud.\n\nYou know it's a neighborhood bar when you go in and the bartender knows your beer. The guy sitting next to me was a regular and said he wished it was quieter this way all the time, but that it usually gets crowded. Decent beer selection although I've only tried a couple of the ones on tap. I'll definitely go back if I'm in San Francisco again!", "author": "Siva J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "It's strange that people deduct stars in Shotwell's reviews because there's no hard liquor. That keeps the crowd mellow, civilized and super convivial without being creepy. They also have a great selection of beer (including ginger beer) and cider, and a few good wines and sakes. All of the bartenders are spectacular-- friendly, knowledgable and willing to offer samples. The vibe is basically perfect.\n\nThe Monday night trivia is also under new direction as of this summer and the new hosts are eclectic and hilarious. It's usually accompanied by a delicious food pop-up behind the bar and a lot of healthy competition.", "author": "Rachel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "In the near decade that I've lived in California, Shotwell's is the closest thing to a real pub I have experienced since emigrating from the United Kingdom. No frills nor thrills, just cozy and well stocked. Plus the barman's a top lad who knows how to host, and pull beers.\n\nIt's not just about the personal nostalgia - that's just symptomatic of how good this spot is.", "author": "Ashwin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Shotwell's is so, so wonderful...a cozy and casual pub, just the way I like it. The beer selection is amazing--Allagash is my weakness--and the crowd is laid back and friendly. \n\nI feel right at home at Shotwell's and it's definitely one of my favorite spots in the area. I wished I lived closer so I could make more excuses to grab drinks there, but whenever it's suggested, I am always decidedly onboard. A perfect spot to catch a breath and get a little toasty with your pals.", "author": "Meredith C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-22", "description": "A very nice traditional pub, nice decorations, mirror board menu, pool table, pinball. It reminds me of the pubs in London. The bartender was friendly and he charged me happy hour prices for my drinks though I got there a couple of minutes after happy hour ended.", "author": "Marcus T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Thanks to some awesome SF friends, I was able to discover Shotwell's in the Mission district. I came here for a birthday event and they were cool with my friends bringing in cupcakes for her own party. \n\nThis place is CASH ONLY and they have an old school cash register to match. I think this is kind of weird, but since they serve only beer, it makes sense unless you can drink 3-4 beers without getting intensely full.\n\nThe value I think Shotwell really has is that they have a significant list of Belgian beers. I never appreciated this before actually having visited Belgium but they have such an excellent selection that I was surprised. They are also reasonably priced for what you can get here (factor in import fees, etc.) so overall a great thing for anyone who loves Belgian beers.\n\nThe bartenders are very friendly and this place gets packed up on a Saturday night. Go early!", "author": "Lorrie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Love this place. This is a local hidden gem. The bartender is super nice and helped us pick another place to satisfy our stomachs!!", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "Laid back place to grab a drink with a friend or two. Very casual, which is refreshing. Nice bartender, lets you sample some beers on tap to help you find one you like. Free pretzels to snack on as well for those who are like me and need some food while having a beer.\n\n Cash only, but there is an ATM by the entrance (with a $2 fee).", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "I could see trying Shotwell's out NOT on a weekend night.  It has a good decor and great beer selection.  Unfortunately, we got there late on a Saturday and it was packed with 20 somethings out for their night on the town.\nCash only, but they have an ATM if you don't mind paying the fee.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "The bartenders were so friendly and helpful and I didn't feel too cramped like some other places in the Mission.  Shotwell's was definitely a lively stop. Great beer selection and not too pricey at all. \n\nI would definitely go back because my group was able to get seats within not too long of time. Some played pool, some played juke box music, some chatted at the bar, but we all had a great time.\n\nCash only, like all the other places in the mission.", "author": "Jennifer S. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Shotwell's is a great spot. They mix up the beers on tap and have a good selection. The bartenders have never been rude to me and the crowds are normally pretty low-key, but never totally dead. The ambience is nice. Low lighting, old fashioned style and wood heavy decor. A nice place to have a few drinks. However, if you meet a man there named Antonio who offers you 3 magic beans for your cow, do NOT trade with him. He is a dirtbag and scam artist.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "This comfortable neighborhood bar has a boatload of great things going for it. The staff and ownership are exceedingly friendly, and the patrons are equally welcoming. The beer selection is top notch, with a clean draught system and proper glassware. They know beer! Add in their fun environment with great amenities (pool, pinball, jukebox) and you can't go wrong here.", "author": "Evan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "Great strong beer selection, BarTunes jukebox, pool table, nice bathrooms, awesome bartender/owner. Really cool place. Only downside is that it was surprisingly cash only. Luckily we had cash on us.", "author": "Justin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "Lots of beer, cash only, kinda collegy, a solid place to take people you know well to grab a brew. Real loud on the weekends.", "author": "Marisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-07", "description": "I like this bar. Why? You won't have too much problem finding a seat here.\n\nThe crowd is your mixed mission crowd, but more lay back than usual. \n\nCheap, good selection of drinks. Chill spaces that you can actually can have a conversation with friends. It is a good mixture of new and old school.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Pricey, but perfect ambiance, excellent beer selection, and great place to hang out with your friends.", "author": "Neil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-21", "description": "Came here to celebrate with a friend. They have great beer and games. Loved the music. Definitely recommended. We had a great time here.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-30", "description": "Do you hate being able get drinks easily? Friendly bartenders make you want to punch a baby? You strongly dislike a good selection? You want to pay a lot of money for a beer? Do you have a hatred for free pretzels? Pool tables make you want to jump into traffic?\n\nIf you answered \"yes\" to any of the above questions, then don't come here. Seriously, its totally lame.", "author": "Will J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "Great beers and great service. Bartenders and fellow customers genuinely nice people. Old fashioned saloon atmosphere, full selection of craft brew.", "author": "Tim D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "South Park pinball, 80s music, AND awesome beers. \n\nKind of upscale divey. And all kinds of awesome.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "Came for a drink on a Friday night around 10, a bit of an older crowd, but good beer selection!", "author": "Abby S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "I came in on a weekday evening to get a beer and buy a shirt for my friend. As it turns out, they don't have shirts on hand onsite. You can only order them online. They also only take cash, which was a bummer. Their ATM does have lower fees than other ATM's though. Bright spot = the beer was good. Although I didn't totally accomplish what I wen't there for, I'd still go back.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "Not used to writing reviews, but had to for this place! It has a great atmosphere, with a good beer selection. The service is amazing, I got recommended several beers, and all were wonderful! Patrick (the bartender) was friendly and just made me and my friend want to come back. 10/10 for service, ambiance, and beers!", "author": "Joey A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "I met 3 girls here who all tell me this is THE place for beer. And since i like girls and i like beer i decided to come here. \n\nThe place is very tastlyfully decorated and has a great pub feel. The lighting is nice and the place feels welcoming. I decided to ask the server for his favorite beer and he planted some glass of the most amazing ginger ale i have ever tasted. I had another with a burger and i was in heaven. I stillhvae not tried any beer but the ginger ale is AMAZZZZING\n\nHighly recommend", "author": "Brad G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "I'm still not used to the cash-only policy every bar in the Mission seems to have, nor am I ready to give up the amazing cocktail culture of Chicago just yet - Shotwell's, like many of its neighbors, is primarily a beer bar. But for a cash-only beer bar, Shotwell's does a pretty darn good job.\n\nShotwell's wins because it has:\n- A great suds selection\n- Friendly bartenders\n- An unpretentious crowd that was just crowded enough without being obnoxious and still allowing an easy conversation\n\nWill be back.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-11", "description": "Hipster overload!  Gawd...and the place stinks - very musty.  It's a small little bar in the Mission, and only serves craft beers.  I was discussing with my fiance how they have a large pool table in the back that takes up 25% of the entire bar - for the space it physically covers and the 3+ foot radius outside of the table that is used for the people playing and poking you in the arse with their cues.  It's really a poor use of limited and I'm sure expensive real estate space, especially for one that only serves beers ranging from $3 (Labatt Blue,lol) to $8 or $9.", "author": "Kyle I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-03", "description": "I walked up in here and there were people doing the Charleston.  The CHARLESTON.  \n\nShit must be strong here if I walked in on people doing the Charleston.  But there are no spirits here, folks.  The beer is what had the people trippin, cuz they've only got beer for you to order.  (and Wine) Oh but the varieties!\n\nFrom American Micros, to Belgian and German - Beers on tap range from $5-6, bottles range from $3-8.  \nThey have Anchor Porter on tap, and even Young's Double Chocolate Stout.\nCASH ONLY.\n\nThere is a pool table, and pinball, a jukebox, and bar snacks.  My friend and I reenacted the arm wrestling scene (on top of the pinball machine) from the Stallone movie Over the Top.  A guy recognized what we were doing  and switched with me because \"It wasn't a lady-bully Stallone's son was arm-wrestling, it was a boy.  Lemme in there.\"  I moved outta the way. What a gentleman.\n\nI need to mention the crowd.  It was a mix of non-trendy, low-key people unaffected and unchanged by the Mission hipster movement.  I maybe spotted one pair of skinny jeans, and for a bar in Mission- that's surprising, and comforting.\n\nOne last thing, not that I'd ever bring my dog here, but this bar is also dog friendly.  Bartender gave me a few dog treats to take home to my pup.  Dude.  Who Does That?  Nice Mutherfuggers from Shotwell's do.", "author": "Rho T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "Shotwell's is what you'd call a \"local watering hole\"; they have a modest but well-thought out selection of beers, a generous helping of free bar chex mix, and no funny business (no cocktails, hard alcohol, etc.)\n\nIf you're into the whole saloon-esque walk in, pick up a drink, shoot a bit of pool kind of thing, this joint is yet another one of those san francisco \"we do one thing and we do it right\" places--if you're looking for a \"the hangover\"-esque night you won't be able to remember in the morning, I suggest you look elsewhere.\n\nAnd for you hangover-esque party kids: if anything else, at least give this place a shot for their $4 Big Daddy IPA, and don't forget to bring cash!", "author": "Scott S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-08", "description": "I wandered past shot wells en route to Schmidt's. \"Since 1891\" it said. So after a delicious sausage excursion we came in for a drink and to watch the Giants hand the Dodgers their ass. I like any bar that serves pitchers and I really like bars that serve pitchers and have pinball machines that rack up obscene scores. I got 18million points on the Mystery Magic machine. \n\nThis bar is comfortable, clean, and friendly. It's basically everything you could want in a neighborhood bar. Coupled with over 100 years of operation, you could really do worse.\n\nTiger Saw!", "author": "Jordan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "Potential to become my new favorite bar.  While they don't serve food, it is the Mission, so belly filling food on the cheap is available.  They have cider on tap, as well as stout, and great music.", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-01", "description": "Love the vibe here but I did not love the fact that it was cash only and their ATM machine was broken -_____- not a whole lot of diversity going on either but the nice bartender and beer selection make up for it!", "author": "Adrianna V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "So my friends and I stumbled upon this place when we couldnt get into the Budweiser event at Fort Mason. The place has an older western ambience in which i loved. I was hoping they had trivia so my friends and I could play but they only had it on Tuesdays I believe. We settled for a couple games of cutthroat pool and some beers. My only complaint is that the place was extremely small; probably could only fit 50-70 people. My friends and I had trouble finding a place to sit especially after long walks around the city. Keep in mind also: Shotwell's is a cash only establishment. Make sure to bring some paper when you are there.", "author": "Calvin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "I stumbled on this spot on a Friday night. Awesome bar with a laid back vibe in a good location. The bar is cash only and no hard liquor but there is a pool table and it has a pretty open space. The people in general are friendly and everyone is there to have a beer and hang out.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "Shotwell's is the bomb!  It's got that great local bar feel - which can be hard in the mission where every trendy SOB from South Bay drives in to pollute our scene.  Even on Friday night there was room to sneak in a party's of 8 without feeling cramped. \n\nThe old wooden bar is pretty, the pool table is level, and there PINBALL!  \nAnd did I mention beer?  Cause they've got it. And the good stuff!  A lot of great micro brews on tap and bottled. Come for the beer, stay for pinball.  Or come for the pinball and stay for the beers.  Or find your own bar cause I'm not sharing.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-07", "description": "As a past resident of Shotwell St, I have a special place in my heart for Shotwells.  Awesome atmosphere, great beer selection, free pretzels!!, perfect place to show up at on a weeknight still in your yoga pants...or maybe thats just me.  Have had many great nights with friends/roommates here and will always return.  Thank you for all of the Friday AM hangovers!", "author": "Raina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Cool bar with cheap beers, laid back atmosphere, and crowd of folks I'd actually like to get to know.  We didn't get a chance to use the pinball machines/pool tables, but were excited to see that they had them.  The only downside was the need to get cash (CASH ONLY) and the late-night walk through a not-so-awesome part of the mission to reach the ATM.  Of course that ATM was broken so walking even deeper into the mission to reach the next one didn't improve the situation.  However, Shotwells was the highlight of an otherwise sketchy evening.  \n\nDisclaimer:  There is an ATM on the premises, we are just too cheap to pay the ATM fees.", "author": "Kim K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "What a fantastic bar! As soon as you walk in you feel comfortable and welcomed. Great atmosphere! Amazing beer selection. Always service with a smile :) would defiantly recommend checking Shotwells out!", "author": "Tiffany G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-06", "description": "\"Can I get a rum and diet?\"\n\"No. We only have beer here, but let me tell you about every other bar near here that does serve alcohol so that you can have the absolute best night out tonight\" \n\nYes, the bartender here really did sound that nice. I have only recently become accustomed to drinking beer, and I really really wanted a rum and diet, but after a bartender is that nice and approachable and knowledgeable about other bars nearby that she is willing to lose your business by sending you elsewhere just so that you can get the drink you actually want, you can't really turn this place down. Plus they have a pretty decent and cool beer collection at this little hole in the wall pub! Complete with pool tables too!\n\nIt is a small local bar, which an awesome bartender who knows a ton about beer, but it is cash only too....Which I think just makes things hard sometimes! And I wouldn't come here with a big group since the place is on the small side, and don't come dressy either. This place definitely seems to draw a certain type of crowd.", "author": "Sarah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-07", "description": "I love this place!!! Great beer selection and Dave is the best barman EVER!\nThis place is hands down my favorite place to drink in the mission!", "author": "Karen-Amanda I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-14", "description": "While adventuring alone in my new neighborhood, I stumbled across this gem. After asking the bartender Erin what it is that people do when they go to bars by themselves, she promptly facilitated an introduction between me and a group doing a crossword puzzle. We ended up on a trivia team together and placed third. It was a great night!\n\nThey also have a super beer selection.", "author": "Kate D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "My first time here was on a date a couple years ago, and i doubt i would have ever come here if it weren't for that date. This bar is really awesome and they've got a great beer selection. Last year i managed to try a 28% abv beer that i had to chase with a hefeweisen. Awesome!\n\nQuiet nights are quiet, but really nice. Busy nights aren't so bad either. Bring in food from outside, or they've got Schmidt's a block away and you have some pretzel sandwiches available for $5 if you go pick them up.", "author": "Phuong M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "This is another wonderful and unpretentious neighborhood bar. The bartender is always welcoming, and helpful. I love their beer selection, it's complete in it's tasty spectrum of offerings without being stupidly excessive like some other beer places.\nI like the warm and uncomplicated vibe and that I can get a table or a bar stool on most evenings. I also like that it's a great place to go for a beer alone.", "author": "Uda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-30", "description": "Awesome spot, great selection on tap and a cool vibe.", "author": "Tora T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-20", "description": "Friendly bartenders, a great selection of beers, and a constantly rotating selection of pinball machines.  Joyous!\n\nCash only.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "Good place for a relaxing night for beer and a few games of pool. The bartender was friendly and encouraged us to try out the different types of beer so we could find one that we liked. Not that pricey and a nice place to chill with a few friends during the week!", "author": "Kim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-11", "description": "I am PISSED.  Absolutely LIVID.  Why, god, why?\n\nWhy must I go on vacation (and not even a real vacation, as I don't think it will be very relaxing) RIGHT when I find my NEW FAVORITE BAR?\n\nAfter a long hike on the most perfect of days, a lovely friend and I stopped here to partake in the long-awaited post-hike beer.  Granted, we may have not ended up here had our first choice been open (and although I want to try it, I'm glad it wasn't) but this is a place that I will be going to.  A LOT.\n\nIn case you don't trust me (and sometimes that may be true), here are my reasons:\n\n1) They have what is possibly my favorite beer: Young's Double Chocolate Stout\n2) A Boston Red Sox sign behind the bar.  And a strong Massachusetts showing.\n3) Free meat.  \n\nSake if you're not in the beer mood, great staff, spacious bar with pool tables, easy parking (or so I've heard)...what more could you ask for?  If I could, I would live there...although the pool tables may get uncomfortable after awhile.\n\nMaybe I could work there?", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "I don't hang out in bars, but I love this place. Warm and friendly. Everyone says HI when you walk in. Great beer selection.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "Cool dive bar with several great beers on tap. Pool table and arcade games in the back.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-26", "description": "I would've enjoyed my time here if it weren't for the annoying bartender. My friends and I came in tonight to play pool and we didn't order drinks immediately, guess she didn't like that? she kept harassing us to order some in a very rude manner and once I did she became nice all of a sudden but kept telling my friends over and over to order drinks or get out. My beer was great but definitely not coming back due to the horrible service.", "author": "Rose L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-22", "description": "Um, yeah, kinda fell in love with this place.  Good juke box, a pool table and fun pin ball machines!  Great beer selection and the nicest bartender I have run into since I moved to the mission a year ago.  I will DEFINITELY be back, time and time again.  Only problem for me, i tend to get ill when I drink beer and this place only does beer to the best of my knowledge... but a great beer selection it is.\n\nGreat atmosphere\nGreat employees\nGreat Beer.", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "Any bar that has a sign asking patrons \"No Fighting Please\", is a-ok with me.  It's my new go-to place when hubby is getting on my last damn nerve.\n\nNot as dive-y as I expected.  Funky, yes...witness $2 Tuesdays for Labatts & PBR, but also catering to more um, experienced tastes with several Belgian/Germans on tap and in bottles.  Chimay, Paulaner and the usual suspects, but also some new ones (for us, at least) including Maredsous 10 Trippel, a supercharged brew from the Duvel/Ommegang folks.  \n\nWould love to see some of the excellent microbrew 2.0 Belgians (Green Flash, Lost Abbey) from San Diego in the mix...the only real local brew (Speakeasy's Big Daddy) wasn't available the night we there.\n\nEasy street parking is a plus.   Ditto the chill rules about bringing your own food (mostly Mission burritos, judging from the yummy smells) and more importantly, your dog!  Witnessed a sweet and well known pooch during our visit who received pats graciously and curled up under the table for a nap shortly after.  \n\nAlso dig the bar mascot, Shitty Kitty.  The handrawn mal-adapted feline drinks wine, wears beer for deodrant, and judging from his shirt (see photo), thinks life sucks.\n\nGreat vibe--we'll be back.", "author": "rhonda s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-28", "description": "This place is great.  Fun but not tooo rowdy.  Not trendy, but not a dive.  Just a good old fashioned neighborhood bar with great service, solid beers, and a great jukebox.  What more do you need?", "author": "Raymond G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "I'm sorry, Shotwell's, to have so wrongly judged you by your outward appearance on our first meeting. I've since learned from my mistakes, and know that it's what's on the inside that counts.\n\nYou have a fantastic rotating beer selection. And at reasonable prices to boot.\nYour bartenders are ridiculously friendly.\nYou have a wonderfully long \"hour\" of happiness.\nYou always have an open seat calling out my name.\nAnd you are relatively devoid of the ever-present hipsterness and douchebaggery that ravages so many of the nearby establishments.\n\nI like you. And I hope to see much more of you in the near future.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-30", "description": "Moved from Philadelphia to Sacramento & so far I've been bored. I finally got a day off that I could drive to SF & came here first. In 5 minutes I made friends! Great specials, great people! Chupa is awesome & even gave me a list of bars for me to meet women. YES! YES! YES!", "author": "Orville S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-15", "description": "Back when this was Inner Mission I gave it a firm 4 stars but now that I've been back (totally by accident for the record) and had such a good experience, I think I'll just have to upgrade it to 5!\n\nThe second my friend and I wandered in here on a sunny Sunday afternoon, I had some serious deja vu and then realized I had met a local friend here late one night for a couple drinks a few years back. It was a welcome surprise though. I still love their beer selection. The bartender (Dean - hope he's still there cuz he rocked!) kept my friend and I thoroughly entertained while we enjoyed our afternoon libations. The people here are friendly, there's pool, a seriously solid jukebox and even some delish sangria. This is a great place for a low key afternoon or evening after you've finished sunning yourself with the hipsters in Dolores Park. \n\nNext time I wander in, Shotwells, you can damn well bet it won't be by accident.", "author": "Hilary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "I'm really jealous that there isn't a place like Shotwells near where I live. It's close but not really close enough to be my neighborhood bar. They have a pretty extensive and varied beer selection.  I tried a \"sour\" beer - the Duchesse de Bourgogne - for the first time. When I enquired about it they gave me a tasting first to see if I would like it before ordering. Props for that. Also props for having Young's Double Chocolate Stout. And again for the bar pretzels! I also liked how mellow it was. Not empty, not full. Great place to just meet up with friends and chill. Wish they didn't feel the need to turn up the music as more people arrived - my throat was sore from having to speak so loudly - but at least I was able to carry on a conversation - an impossible feat in most Mission bars.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "It's walking distance from my friend's place. It was surprisingly packed on a week night. The drinks are affordable. The atmosphere was pretty lively.", "author": "Rigel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-29", "description": "Just a note... I was at the bar when the 'one star commenter' asked to use the restroom. When politely told by the owner, \"The restrooms are for customers.\", the man acted offended and said he'd been buying rounds of whiskey and had a receipt to prove it and then stormed off.\n\nHmmm. Shotwells is a beer and wine bar, no spirits. The bar is also cash only.\n\nPlease click on the funny button below. It still makes me laugh. :)", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-05", "description": "Shotwell's has a comfy, homey feeling that I often miss in San Francisco bars. When I lived in the Mission, I used to come while I was waiting for my laundry to dry. The fact that I felt comfortable there wearing raggedy laundry-night clothes goes to show that this place is pretension-free.\n\nI enjoy the pool tables, the Monday trivia nights, the fact that they show Giants games, the decor, the laid back crowd, and the very friendly bar tenders.\n\nI'm also a fan of any establishment that creates an opportunity for me to meet other people's dogs.\n\nI would also say they earned at least one of these five stars by serving Köstritzer on tap. Well done, sirs and madams.\n\nThis is still a Friday night favorite of mine, even though it now requires me to leave my windy abode near Alamo Square and bike up a few hills.", "author": "Beth K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-08", "description": "Shotwell's is a nice, friendly, easy-going place that I like quite a bit, but I'm not crazy about the location. It's a little awkwardly located for me and just a bit sketchy for me. But, on the inside, I like it!", "author": "Lisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-23", "description": "To whom it may be of concern: \n\nThe yelps below about using the restroom are total fabrications from two dishonest troublemakers who claimed the had their \"whiskey receipts from the bar\" to prove they were paying customers.  Well, enough said (it's a beer/wine only place).  And besides, anyone who frequents Shotwell's knows that nothing could be further from the truth, for any of the lovable staff.", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "120 years of practice makes perfect. \n\nMy buddy, Jason F., lives nearby so while sleeping on his floor we went a few times. They have a great beer selection but no hard liquor. They have some pool tables and PINBALL (I'm in love). \n\nThere's also a little sandwhich place next door where you can order some late-night eats and bring them back into the bar (I'm pretty sure they leave menus on the bar tables, so look out for those). \n\nLaid back local beer scene. That's what it is. Don't come in expecting more than that and you'll have a great time.", "author": "Caro D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "Great dive bar with a neighborhood feel.  Good beer selection, Ace Cider on tap, a pool table and good music.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-21", "description": "This place has an incredible atmosphere, nice and old, great lighting, tables, etc. feels like a mix of a saloon and an English pub (a real pub, I lived there) \nOh, and very very nice staff - it has the ability to be 5-star beer bar why isn't it? \n\nBeer selection is not 'Great' in my opinion, but its solid for a beer-oriented place, had a Tripel from a local start up brewery I'd been looking to try for a while, and tried a nice black lager as well...most of the other beers were regular SF staples (i.e. lagunitas, speakeasy, and some just ok euro imports). Bottle selection was well done, but not that huge. \n\nMainly though, its just OVERPRICED - most of the on tap beers were $6-7, and $1/off for happy hour. Thats really what's frustrating, you can get the best beer in the world at Toronado for $3-4 during happy hour, or pay $4 or so at Gestalt, or $3 at The Page all with a much bigger and better selection. And this is kind of in the middle of nowhere - they need to improve their on tap selection (not more taps, just better beers) and drop the prices a bit, in my opinion. \n\nOther than that though, this place rocked, I would come back again, but not for a session due to the prices - sorry.", "author": "Ben B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "Oh man! No more Monday pub quiz!  What WILL I DO???", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-30", "description": "My husband and I were brought to Shotwell's when visiting some friends from the area, and MAN did we have a good time. I loved the casual, unpretentious, neighbourhood pub feel of the place, and as other have mentioned, the beer menu is fantastic. It seems like the perfect place to hang out with friends and meet your neighbours.\n\nAlthough I'm a Vancouver native, my husband is originally from the Bay area, and I know that sometime in my future there will be a move to San Francisco. Knowing that a place like Shotwell's exists makes that move A-OK in my book.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "Why all the way down in the Mission? This would be my ideal neighborhood bar and I wish I could transport it with me wherever I move. \n\nI can't really say why I love this place so much - but it's a great bar to hang out at on a weekend afternoon. The staff is really friendly, knowledgeable, and the beer selection is good. They definitely carry some imports you don't find at other bars (Hitachino). Plus, the Utz mix is such a great bar snack!", "author": "Julie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-21", "description": "I visited this bar for the first time last night.  The parking was easy and it was clean, relaxed, and comfortable.  Monday night was Trivia Night, which started at 8 and was over a little after 10.  It was the perfect way to while away a couple of hours with some new friends without getting home too late.\n\nThere's no hard alcohol, but a large selection of good beer.  I got a huge stein of Hefeweizen for only $6!  A couple of people tried the sangria and liked it.\n\nI tried the Ladies Room and it was clean (always a plus in a bar).  There's also a jukebox and pool in the back for your enjoyment and a couple of TVs.\n\nIf I lived in this neighborhood, this would probably be a regular hangout.  For now, I'll have to be content to show up on Monday nights for trivia.  Our team won, so I'll definitely be back soon to use my free drink ticket...and try to help our team to victory again!", "author": "Kimberly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "You can bring your dog- 'nough said!\nReally awesome low key spot Monday through Wednesday - packed with douche bags the rest of the week.", "author": "Jo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "One of the best Neighborhood bars around this part of the city I've been to.  We've been a few times, so we are by no means regulars, but we always come back because we just really dig the vibe of the place.  Good music, a couple of pool tables, and a consistently great beer list with a good happy hour.\n\nJust found out they do Pub Trivia on Monday nights, so I might start becoming more of a regular very soon.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-03", "description": "My favorite bar in the city.  Great beer, good lighting and atmosphere.  It's a great place if you want to talk to the people you are with.  It's like cheers with better beer and better looking people.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-22", "description": "It's a good place to visit if you're within walking distance. They have a pretty good selection of rotating taps and bottles of beer. The menu was laid out in easy-read fashion, which was nice.\n\nThey have two pool tables and two pinball machines, although only one of the machines was working when I was there.\n\nMy only tiny gripe is that they don't serve liquor. Sometimes you just want to get cra cra, you know?\n\nGood relaxed environment, diverse seating arrangements, good for conversation, good jukebox.", "author": "Corbin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "Strengths:  Casual, neighborhood, lots of beer to choose from, pool table, dogs allowed!\n\nWeaknesses:  Nothing, except for difficult parking.\n\nOpportunities:  What's up with cash only?  Don't like that.\n\nThreats:  There are many bars around the Mission, but this one is very casual, no wannabes.  Monk's kettle can steal some beer lovers from this place, and maybe Morac for loungers.\n\nTotal:  $20 for 2 ppl.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-22", "description": "First off I am not the biggest fan of a bar that doesn't serve hard liquor. But overall this place is cool. Beers are served in the correct glasses and the atmosphere is old school saloon style.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "Three highlights then a negative\n\nHighlights\n1. Good beer selection (both tap and bottle)\n2. Nice folks that work there\n3. Pinball machines in the back\n\nNegative\n1. Do not take credit cards or debit cards\n\nStumbled upon this place when Schmidt's around corner had too long of a line to sit at the bart and I was pleasantly surprised. But I was slightly embarrassed when I told everyone I got first round and went to pay with a card and the bartender said \"sorry only cash\". The only thing I had in my pocket was lint and a paper clip. To their credit they do have an atm machine in the place but I hate paying for the service fee for those things.\nSo as luck would have it my friends had cash and they paid! :)\n\nAfter getting our drinks we worked over the pinball machine in the back and I have to say it was really a blast to play with friends.  Next time \n\nShotwells I am bring cash and quarters!", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-09", "description": "Cute bar, fun pinball games, rude bartender!", "author": "Aimee E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-09", "description": "Even though this place only serves beer, I still give it 4 stars for their wide variety of imported beer selection. I love the look and feel of this place. The neighborhood might seem sketch but the bartenders are super friendly and there's plenty of seats. The beers are priced decently too. I would come back for a  low key chilled night.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-02", "description": "I put my coaster on my half-full pint glass. I walked outside. Next thing I realized I was at another bar for a good while -- about the length of the run time of Wagons East. On my way home, I opt for a night cap. And. Lo. My half-full pint glass with a coaster on it is still there. The bartender takes the coaster off and hands me my pint, to uproarious applause (from me). That's as good as it gets. Then, add on the warm welcome by regulars and bartenders they gave my puppy in his first SF bar experience and we now have more warm & fuzzies than a Pendleton winter catalog. Then things become really fuzzy when a bottle of Allagash Curieux was popped & shared with two londoners & the bartender. Thankfully I put my other coaster on my other pint glass and the warm, fuzzy evening ended in a hug, a damn good hug that is.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-20", "description": "Two words: 1. Beer. 2. Jukebox.\n\nBEER: Belgian beers are kind of my thang but I usually don't have quite a variety to choose from. Maybe I should do a tour de belgian beers in San Francisco. Care to join? ;) Anyway, I do an eeny meeny miny mo and pick one. Delirium. Bubbly, light belgian beer. Not my thing but ah well, now I know. The bartender is slightly nice and slightly helpful.\n\nJUKEBOX: A great variety of music. I choose M.I.A. He chooses The Ting Tings. I choose Yeah Yeah Yeahs. $1 gets you three songs. What is played prior to our songs getting played? Rock. Shit, is it obvious that we picked the upbeat, pop music?! No pointing fingers, please!\n\nOther perks that I didn't get a chance to do: \n-Pinball machine\n-Pool table (Brick dance anyone? Only Weeds fanatics can enjoy that question.)", "author": "Ileana H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-12", "description": "The best beer bar in the Mission, and one of the top three in the city for sure.  Also, the two pool tables are a nice touch.\n\nThe bartenders are really cool and knowledgeable.  We would describe what we liked, and they would hook us up, over and over and over, including darks, ales, stouts, Belgians, and even some sour beers that were surprisingly good.  You will be drunk before you are able to sample half of them.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "\"my absolute favorite neighborhood Mission bar,\" to quote Kristin P.\n\nI wholeheartedly agree (and not just because it's where we met.)  Shotwell's is amazing.  Yes, the beer on tap is great, but I especially love their imports.  The unique beers they choose change with the season and are always spot-on.  Not sure what kind of beer you like?  No problem, give the bartenders a few tips on what you usually like and they'll hook you up with the PERFECT choice every time.  \n\nThe atmosphere is very chill and not just the place - the people too.  When I first moved to the Mission, my neighbor told me that this place was like Bender's with less facial hair.  He was sort of right.  \n\nI heart Shotwell's.", "author": "Gretchen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-17", "description": "Shotwell's is my absolute favorite neighborhood Mission bar.\n\nAs other reviewers have said, the beer tastes SO GOOD here.  Anchor Steam must pump directly from the brewery, its some of the best in the city, no question.\n\nThe bartenders are super duper nice.  We love bringing our dog here and she loves coming because of how the bartenders spoil her with treats.  One one occasion, a group of us came in on a crowded Friday night and a friend with a bike had forgotten her lock so we asked if we could bring it in.  No problem-- the bartender/owner helped us make our way through the crowd to the back where she easily hung her bike on a wall rack.  He really went out of his way to help us and our kind of annoying request.\n\nNo hard alcohol, although beer-haters can have a cider or sake.  Or just have a beer, for god's sake, they're delicious.", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "If your looking for a beer, this is the best bar in the city hands down.  Honestly was kinda sad when the rest of the world found it, but there is no bar that can make anyone feel like they are that their personal spot like Shotwell's.", "author": "Tobin J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-19", "description": "From 1891 to about seven years ago this place was called Shotwell's. At the end it was getting pretty bad. \n\nNeighborhood gossip is that the owner let his brother run the place and the guy got hooked on meth. There was some talk of him selling speed, or allowing it to be sold, out of the bar and one day the the owner just changed the locks and sold the place out from under his brother. I bet Thanksgiving gets a little awkward in their family.\n\nFor a few years it was a place called Two Thieves. Two of the guys that worked at Crow Bar on Broadway bought it together. Their boss called them thieves when they told him they were leaving and that's where they got the name. One of the guys now owns three bars all with the word Thieves in the name, I have no idea what happened to the other guy.\n\nWhen the Thieves guy decided to move on to greener pastures a new couple of guys took over the bar and chose the absolutely terrible name Inner Mission. I guess it took them a couple years to figure out that Inner Mission is neither clever nor funny because they've changed it back to Shotwell's. \n\nMy Inner Mission review still stands, I've been back a couple times since the name change and aside from a paint job it's the same bar.\n\nhttp://www.yelp.com/biz/inner-mission-beer-parlor-san-francisco#hrid:R9FViYZMbEwYHib6efNR3g", "author": "Manny F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "I am more than just a fan. I think I love this place. It's super laid back and the bartender is really friendly and cool. If they don't have that particular beer that you like, you can tell the bartender what you're in the mood for and he or she will recommend one to you. Oh and it's a mostly-beer spot. No hard liquor so no mixed drinks. Oh boo hoo. Go somewhere else for that stuff then, and leave me to my lovely Belgian beers at Shotwell's.\n\nOh, the only thing I haven't liked was that I was once served a Paulaner with a slice of lemon on the rim (NO FRUIT RUINING MY BEER PLEASE). Gross.", "author": "Reese W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "Great place. I went here for trivia night. I don't like that they only take cash. Trivia night was awesome though.", "author": "Marty W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-12", "description": "What a cool, relaxed, and unpretentious spot to sit with a great brew. The beer selection is wonderful, focusing mainly on Belgian and Trappist brews. Most of their beer and cider is bottled, but there are a handful of taps.  There are also a few different types of Anchor Steam on tap, too.  They serve wine, of both the grape and rice variety, but this place primarily caters to the beer drinker. \n\nIt's pretty low key in here, and I never have problems hearing people when we are having a conversation.  I prefer it here earlier in the evening or on a weekday, since the bar is small and starts to feel crowded once the tables fill up. Another thing I love is the glass of loose cigarettes for 50 cents apiece, located on top of the sweet old-timey cash register.  I don't smoke regularly anymore,  so It's nice to have a cigarette to cap off my night of beer revelry without actually buying a whole pack that will just sit around getting stale.", "author": "Christian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "BYOF.  Its Ok to bring outside food because there's none here. Plus, Monday night is trivia is Fun {with a capital F}!", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "I have only been to Shotwell's once but I really liked it and would go again but the biggest thing against it is it is in the middle of nowhere! I am sure people in the residential area like having it there but there doesn't seem to be many food choices or other bars in the area. \n\n2 Pool Tables\n\nGood Beer Selection\n\nNice group seating\n\nQuiet Neighborhood", "author": "Alex W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-14", "description": "This bar is pretty sweet with some decent stuff on tap. It's hard to wade through the mess of the Mission when it comes to bars, but this one feels cool and local. It definitely picked up in the evening, but it still felt relaxed and casual. Being 8 blocks from my house doesn't hurt, either.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Thanks to my roommate Victor L. for suggesting to go here because it's pretty much a great local hangout. Super awesome beers such as:\n\nDogfish Head Palo Santo Marron\nYoung's Double Chocolate\nSeason pumpkin porters?!\n\nVery chill place to hang out or run into people. Bartenders are nice, and the people that hang out here are very chill. This will probably be the place I will end up when looking for a drink.\n\nNo hard A or credit/debit cards here. Cash only.", "author": "Charles L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "Great place to relax, they have a really surprising selection of beers on tap (let's just say nothing with the word \"Light\" in it), two pool tables ($1 play), two pinball machines (75 cents per play). The only thing that would make this place better is a dart board. $7 for most belgian drafts, a litlte cheaper for domestic drafts but they're all microbrews. I love it!", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-07", "description": "Came here for a drink when visiting a friend. CASH ONLY (but they have an ATM). Its a pretty cool place, it definitely seems like a neighborhood bar, a good place to go chillax and become a regular. The atmosphere is super casual and laid back, but there are still fun activities (pool and video games).", "author": "Carly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "I love this neighborhood bar!\nIt's beer only, but it's good beer\nThere's pool and pinball (careful, the pool players are good)\nThey bartenders are great. They love the Giants and tennis\nThe patrons are really just friendly and welcoming\nMy only compliant is that they switched to a digital jukebox - now there are more choices and well, I miss the old jukebox, but the new one does have Rod Stewart's AND Neil Diamond's Greatest Hits....", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "One of the top bars in the Mission -- always has some good characters and plenty to do -- like pool, pinball, etc.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-25", "description": "Visiting a bar on your own to work or read is like taking yourself to a movie- in the right mood, really fun. Especially xmas eve. Like owning the road on a midnight bike ride, the place is yours.\n\nFirst I checked Atlas down the street since I wasn't sure about catching wifi- closed as expected. Same wifi connection worked here.  I like the slightly out of the way location, away from the main valencia strip but just a few blocks walk from my place.\n\nI picked best seat to set up a laptop and make animation. Power outlet by the jukebox, bench seat with 3 tables, central to the bar and pool tables.  There were just a few intimate groups having fun and making the place live.\n\nLovely atmosphere, lighting, old fashioned woodwork, mirror backed bar.  Classic 80's heavy tunes all night- the cure, joy division, siouxsie, new order, my kind of shit. \n\nGREAT beer selection, tap and bottle.  No hard liquor- just beer, sake and sangria.  Mid-priced (not cheap), like a mini version of a swankier northbeachish place such as La Trappe.  I started with anchor steam xmas ale on tap (made down the street and probably one of the few places serving it that way).  Mmm, cloves and nutmeg.  Silly me, I treated it like cafe work and didn't go easy.  the nice bartender came by the table so I enjoyed the service.  After a delerium and sangria my animation started to wobble so I packed up with a few hour's work in the can.  Got home and threw in a dvd until i almost barfed on the couch- thanks for getting me accidentally trashed, shotwells.  Sure took my time getting to christmas brunch today but glad I paid a visit.", "author": "Pat L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-17", "description": "Definitively better than okay is how I would rate Shotwells overall.\n\nTheir beer selection is decent, but they don't do liquor.  Gotta tell ya, a bar that doesn't do hard liquor...well...where I'm from, that's not a bar.\n\nStill, it's got a comfortable atmosphere, it's totally convenenient and the bar tenders are pretty cool...which I guess is a necessety since they don't really have to have any bartending knowledge. \n\nOn the huge plus side, they're always awesome to my dog.  On the down side, the only take cash (no tabs).\n\nNice pool table and decent pinball machine.", "author": "Thomas K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-17", "description": "Things that are great:\nlighting (warm and dim).\nbike hooks (by the pinball machines)\npinball machines (next to the juke box)\nJuke Box (beside the pool table)\nBeer selection (revolving and intriguing)\nTrivia Night (Mondays.  Geeky and arcane, but not impossible)\n\nHere is a story about Shotwells (with pictures): http://stretchyhead.com/shotwells/", "author": "S H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Another hidden gem just a few blocks off the hipster hub of mission st. Nothing new to add other what  others have said. I will be back for sure!!!", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "If I can't find Lisa I know she is probably here - and that makes me happy... because I like it here. \n\nI had Kronenberg for the first time and loved it - HUGE glass = $5 :) The bar is very clean but loud because it is one big room with pool tables and pinball. Lots of beers to try too!\n\nAlso, the 2 kick ass pinball machines in the back made me very happy. My $.75 lasted a VERY long time. Will come back!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-13", "description": "I was the Foursquare mayor for many months, what more do you need?\n\nSeriously - these are my peeps and I love them and what they've done with the place. I go here for Kronenbourg, Mary Coppins, therapy/counseling, Habibi, Glee musicals, important televised sporting events, and special, special friends.", "author": "Zara E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "looking for an out of the way beer/wine bar in the mission? here's your spot.\n\nbelgian beers on tap, lots of dark wood, knowledgeable bar tenders, a pool table, jukebox... the list can go on but i won't.", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-07", "description": "I stopped by Shotwell's for a drink on a recent trip to SF, and I have to say I wasn't uber-impressed. It's a local bar, so I understand the local crowd, but there was literally nowhere to sit, and few places to stand without being in someone's personal space. \n\nThe bartender was friendly, but not engaging, and the beer was pretty standard fare. \n\n2 stars.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-28", "description": "Shotwells is excellent at what it aims to be: a bar for locals and those who want their good, delicious beer without a lot of pretension.\n\nI first discovered it when it was known as the Inner Mission Beer Parlor.  It was all about good beer and good atmosphere, and that's what it's still all about today.  The guys who own it are friendly, love beer, and will happily talk to you about local brews, their favorite beers, and everything else.  I stop in once every few months (not enough, I readily admit), and they always remember my face and ask how things are going.  And then we discuss whatever their favorite current beer is and I go on to have a great time.\n\nThe atmosphere is relaxed, there are two pool tables and even some pinball machines in the back.  For the combo beer lover and social media junkie, they even run a Twitter and Facebook account to discuss their current offerings.  So stop by, have a drink and a good time.", "author": "Seth F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-28", "description": "This bar is great for day time drinking.  Cool bartenders, easygoing vibe, great beer selection.  By the way, I believe it's only beer and wine here.  But if you're hungry, it's easy to order food from down the street and every once in a while they'll have specials of food inside the bar.  I like how these awesome dudes play R. Kelly on the jukebox here.  Oh, and they have a pool table and a pinball machine in the back.  Bring cash yo.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-29", "description": "Holy Crust, I think i just found my new favorite bar.\n\nSeriously.\n\nI'll lay out a few criteria that I lay down for my usual bar judging and we'll go from there.\n\n1)  Environment - Does this look like a place I would come hang out in?  Be it with parents, friends or strangers, do I want to come hang out here regardless?  Is this place comfortable and alluring?  Do they make good drinks but i'll want to leave after one?  Does the place lack personality?\n\n-Shotwell's is a great place.  When you walk in, you're just like...  \"damn!\".  You don't feel weird, you don't feel lost, you're not intimidated.  This place feels like your favorite pair of underwear from the beginning.\n\n2)  Selection of Beer - Shaken, Stirred, Neat, Twist, fleh.  Not saying i don't love hard alcohol but i've come to realize I'm a huge beer fan.  However, i want some variety in my beer with a good dash of originality.  If as interesting as your bar can offer are Sierra, Stella, Widmer and Guinness, then I likely won't be back.  Offer me a good mix of both light and dark, lagers, ales, wheat beers and Belgians with something I have yet to taste.  Don't give me the selection at Safeway but on draft.\n\n-Shotwell's has a great selection of both taps and bottles.  A good mix of imports peppered with a few choice domestics, i was a happy camper. Never mind coming in for a cold one, If i didn't have somewhere to be I could have easily stayed for about 5 based on the selection.\n\n3.  Lack of B.S. - Pretty self explanatory.  Don't pretend to be something you're not, be a little friendly to the customers (people paying your wages and throwing you tips) and we'll all have a good time.\n\n-Check.  Good bartenders, friendly, helpful and not afraid to bust my balls when I was getting a little too mushy with my girlfriend.  Fair enough and it's pretty hilarious.  \n\nIf I lived about three blocks closer, I'd be here about twice a week.", "author": "Steven R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "I love you Shotwells. You are a cozy snug pub with arcade games and a wide variety of beers. I love your wood paneling and I love that I can always have a handle for my beer when I order a Kostritzer. You are quick and always give me correct change. Thank you.", "author": "Megan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-20", "description": "I liked this place a lot and it reminded me of my old Chicago neighborhood haunts. The bartender was knowledgable and served me the best Hefeweisen I've ever had, a darker one I can't remember the name of, but if you ask her I'm sure she will tell you. Great selection, clean and simple decor, and dark....interesting vibe and good people.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "I wish I could pick this bar up and move it to North Carolina. My husband and I came here twice while we were in SF, and both times we had bartenders who were really friendly, helpful, and funny. Beer selection is great. The bar was around the corner from the Inn San Francisco, where we were staying, and it was just really nice to be able to hang out in an unpretentious, laid back bar to unwind after running around and being touristy during the day.", "author": "Jenni C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "Very cool local pub with good beer selections - friendly spacious cozy and just good stuff. I loved my Abita pecan ale.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-27", "description": "Extremely rude bartender  gave me attitude when I unknowingly handed him my credit card.  Since this place is cash only, he gave me a glare and said \"You new around here?  We're cash only.\"  \n\nLiving in the 21st century, I rarely ever carry cash, let alone enough for a round of drinks for friends.  Total was $20 for 4 beers, and  I gave $20 (all I had at the moment) then began to ask my friends for some bills to leave him a tip.  The bartender, assuming that I did not plan to tip,  decides to yell out at me, \"REALLY DUDE?   WOW.... just WOW\"\n\nNeedless to say, I will never come back here.  This guy was a total buzz kill.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-15", "description": "I like pretty much everything about this bar, though I have a hard time calling it by any name other than the Inner Mission.  Why change the name if that's the only thing that changes?  Still the same solid selection of draft beers, the same pool tables, the same laid back crowd, the same Obama paraphernalia, and the same too-few tables.  I am also a fan of the jukebox and though I have not played pinball yet, I like that it's there.  \n\nThe bartenders are superbly friendly and (as I already mentioned) the beer selection is very good, covering an impressive range of beers.  No brown ales on tap, but I've come to accept that San Francisco is apparently not a brown ale kind of city.  Some friends of mine always order the sangria, which is also good and cheap.  The bartenders don't seem to mind when you bring in snacks of any kind, which is good of them.  On nights when you can find a seat, this is the place.", "author": "Josh C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "\"Hey, your pinball fell into my beer.\"  OK, maybe Reese's is safe with the world's best combination of good things, but Shotwell's isn't too far behind.  \n\nPinball + Great beer + Wonderful folks(employed and patrons) + ChexMix + Baseball on TVs + Location \n\nDracula (5balls/$.75)\nMedieval Madness (5balls/$.75)\n\nAnderson Valley Brother David's Triple and Russian River's Damnation were the two *new* beers.  My 1st trip there so I don't know how often that changes.\n\nAlso available on tap were some SF classics:  Anchor Liberty Ale / Anchor Steam Beer / Speakeasy Big Daddy / Speakeasy Hunter's Point Porter \n\nOthers I forgot and a limited selection of bottled beers too.  (Limited only because of my personal beer snobmanship and other bottleshops Mecca like selections, but lacking they are not)\n\nThe bartender was friendly, attentive, and knowledgeable about the product.  Amazingly enough, these seemingly basic attributes are rarely all found in today's version of customer service.  All the Sunday customers were having a good time talking, watching the World Baseball Classic, playing pool, reading, and enjoying the SnackMix stuff that was offered in bowls.  One thing I always remember about a bar, is the salty goods that they offer while you're drinking.  Hmm, salty goods make me drink more $5-$7 beers, why would a bar owner OK giving me $1.43 in crackers?  A trick it is not, an added service with a high return is exactly what it is.\n\nYes, all those things together is what makes me happy and SHOTWELL'S is a clean, comfy place to enjoy them all.", "author": "Smiley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "I really like the vibe of this place.  it was crowded, but a good bar on a friday night should be!\n\ni think the pool inside is free, so that's good.  nice crowd...cool lighting.  the hefenweisen is huge.", "author": "Lawrence C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "Shotwell's is amazing. Incredible beer selection (they have Delirium Tremens and Wittekerke), cool bartenders, pool tables, a good jukebox, et cetera, et cetera.\n\nShotwell's (née Inner Mission Beer Parlor) was my favourite bar when I lived closer; now I'll take any opportunity to go there again.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-10", "description": "My husband and I converted all our friends to being Shotwell-ites, too!\nIt's official! This is the best bar in the universe!\n\n[Only downside: the husband now spends all our laundry quarters on pinball! But it's so fun to watch him play! Ack!]", "author": "Erin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "Great selection, clean and well-tuned pinball. The staff is particularly cool.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "Super fast, friendly service. Sat in a booth by the fire...very cozy. Guinness was really good and so was Bloody Mary.,", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-11", "description": "Great vibe to this place - I like the neighborhood feel of it.  The layout of the bar is well-done and the decor is a nice balance of kitch and class.  This is strictly a beer bar which is cool - but sometimes a guy wants a vodka soda.\n\nThe bartender was cool.  Only downside - no creditcards accepted (but I can live with that).  Half the fun is watching some bad pool and having some great conversation - I will definitely be back.", "author": "prior O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Really great little pub located on a quiet corner in the Mission. We love going here for happy hour on Fridays before the crowds come in - usually between 5-7 is good. The bar staff are always happy to suggest a brew and they have good pretzel snacks distributed generously across the bar. Hubby loves this place because it's dog friendly - adds to the vibe and entertainment. Over the holidays they had a fantastic mulled wine. Would love to see more seasonal drink specials. Interested in dropping in here for St Paddy's day this weekend....", "author": "Nadia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "Super nice guy owns the place and the bar is dog friendly! He had some great dog treats for my dog, so she's sold and I had a great little cocktail at a great price in my neighborhood. Good stuff. :)", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Shotwell's is just totally deserving of its 4.5 stars.  I freaking love it here, and while I'm biased for it being my neighborhood bar, I really couldn't ask for anything better (okay, it'd be great if they served food, but at least they're on the tamale lady's route).  Extra star for being the only bar in SF (afaik) with Palm beer.", "author": "Jillian Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-22", "description": "I will be the first to admit that Shotwell's isn't quite my scene, but I wanted to give it a chance anyway. \n\nOnce I arrived (after reading rave reviews here), I realized that I have been to this bar before, circa 3 years ago. \n\nAnyway, it's probably my fault, but I ordered the board special \"sangria,\" instead of one of the many beers on tap, and quite frankly I was disappointed. \n\nWhat kind of place serves \"sangria,\" sans fruity chunks of delicious vitamin a, b, and c? How else am I going to avoid scurvy? The sangria was poured from a plastic pitcher...I could see the fruit chunks IN the pitcher, but just wine was poured into my glass of ice...so, it was more like a wine cooler?! \n\nHmm....", "author": "Misha F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Shotwell's is my favorite bar in the Mission. The beer selection here is hand-picked and has some of the best Belgian and specialty beers I've ever seen including some styles I'd never tried with totally reasonable prices for what they are serving. The staff is super friendly and the atmosphere is definitely neighborhood bar. Pub quiz on Monday is awesome too, competition is fierce! Awesome place to hang out with friends, drink some of the best beer around, shoot a game of pool, and stumble home with a smile on your face.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-17", "description": "The owner made contact with me but not my friend that was totally offended by this establishment!  A for effort but IGNORE for not dealing with the person who experienced the RACISM!", "author": "Desiree M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-27", "description": "We stopped in here for a pre-dinner drink and I could have easily stayed the entire night! The bartender was super friendly and turned us all onto  my new favorite beer combo - the Shipyard Smashed Pumpkin topped with Young's Double Chocolate Stout.  It's the perfect place to grab a beer, or two, and catch up with friends. I can't wait until my next visit up North to go back!", "author": "Alma E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "Great beer selection, friendly staff, generous and engaging.  What more could you want.  Also, really cool vintage beer signs.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-20", "description": "Just moved into the neighborhood today (Sunday), had heard great things about Shotwell's.  Earlier in the day had noticed the sign on the door, happy hour until 7:30 Mon-Sat, and until 8 on Sundays.  Great.  \n\nJust before 8, we walk in, and ask if happy hour is still on.  Bartender looks at clock, that's running fast  (8:10), and says happy hour is over.  I smile and say \"clock's a bit fast\"... bartender, with a nice dose of attitude: \"It ends at 7:30, so it's well past.\"  \n\nWasn't going to make a fuss, ordered drinks, double-checked the sign on the door and the sign on the bar.  It's from 4-8 on Sundays.\n\nJust before leaving, I show her one of the signs-- \"Just so you know I'm not crazy, happy hour's until 8 on Sundays.\"  \n\nBartender, while looking at the sign that says 8:  \"Oh! That's funny!  It's actually till 7 on Sundays!\"  \n\n???????? Are you kidding?", "author": "Jason M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "I love, love, love this bar!  As a liquor drinker, this is really saying something as they only have beer and wine.  The beer selection is damn near curated its so good, with an array of draft and bottled beers that go well beyond the usual suspects.  The bartenders are always nice, not too cheery or too gruff, and - here's the kicker - the *crowd* is great.  Maybe this place is just off the radar of all the people who crash the Mission on nights and weekends, but its always just so comfy and laid back in here, I can't get enough!", "author": "Daryl W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-14", "description": "I would have given this place 4 stars, but one bartender ruined the end of the evening here...\n\nI came here with 10 other friends after dinner to chat and hangout. We walked a few blocks to get there and had plenty to drink during dinner so first thing I asked for was a cup of ice water while everyone took a look at the big beer selection. Ironically everyone in my party was thinking the same thing (but others already had started to order beer as well). One bartender was really nice, the place is nicely decorated with good seating. Overall, it was a great place so we decided to stay there instead of hopping to another bar that was on the schedule.\n\n1:20am was rolling around and many people from my group had to drive at least an hour to two hours to get home, so drivers were trying to sober up before heading home. \n\nMy friend went to the bar to ask for 2 cups of ice water just a few minutes before we were planning on getting the group together to leave. The other bartender said, and I quote:\n\n\"NO! You guys have been ordering waters all night...it's NOT funny. No!\"\nhe shakes his head and continues to chat with an annoyed face with his co-bartender and some customers at the bar.\n\nI understand they're trying to make money, but it wasn't like my party of 10+ people didn't order good amounts of beer and give tips. It was a nice place...but \"Last calls\" were going to happen soon, people are being responsible by slowing alcohol consumption, hydrating, before going behind the wheel and we get rejected with rudeness!!!\n\nIf that didn't happen, I would've gave better. But that ruined the whole experience! Ruined the night so some left the party and headed home, others of us hopped over to a new bar, and had some more drinks that they could have made money on....", "author": "blanc m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "This neighborhood bar was a pleasant surprise. Having passed it many times on my bicycle, I associated the television showing sports with the kind of place I'm usually not that into. But I finally gave it a shot and really liked it. Two things in particular make this a winner:\n\n1. The owner, David, is awesome. Good company, good recommendations for drinks and for places to eat nearby, nice guy.\n\n2. Great selection of tasty Belgian beers at reasonable prices.\n\nI'll be back!", "author": "Jon A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "Great neighborhood vibe even if you're from out of town. Paul is about as wise and generous a bartender as you'll find anywhere - he has superb taste in beer and gives sage advice like you'd expect of an old timey barkeep, not to mention excellent music tastes. An excellent choice as a bar patron and beer drinker of any background", "author": "Alan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "Another good Mission bar.\n\nThey had Liberty Ale and Big Daddy on tap. My friends were also very happy about the Molson and some other good beers that I can't even remember their names. They don't have hard alcohol but they do have wine and sangria. They also only take cash.\n\nThere's a pool table in the back, tables along the sides and a decent sized bar. They have happy hour, even on Sunday until 7.", "author": "Jackie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "There's just something about this place that I really really like. It's small, cozy/saloon-ish decor at the bar, good beer selection, mellow (at least the two times I've been there)...oh, that's right, it hits all my prerequisites for fun divey bars! Came here on a late Friday night and it was busy, but not too packed. Hung out at the bar, enjoyed my beer (I do love me some Dogfish Head), and was able to have a non-screaming conversation with friend. My second visit was on a Friday night during that weird in between happy hour and out out time...totally dead. I'm ok with that. I'll be back. I'll also remember cash. Third time's a charm.", "author": "Karena Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "My girlfriend and I went to Shotwells the bartenders were funny, and the drinks were excellent . We had so much fun with some of the regulars that we didn't want to leave. It was a trivia night  the bartenders new how to pour a great drink and every one was happy.", "author": "rachelle t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "Tom was very generous with the pours, and the beer selection was outstanding. The stout was creamy and delicious, the IPA hoppy and crisp. I played some pinball with George, a game of pool with new friends whose names I was too drunk to remember, and played some air guitar with Willie and Brian when the jukebox played Zepplin. Then the tamale lady showed up. What a great place!", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-19", "description": "Awesome beer choices, and it's never too crowded. Also, free bar snacks... can't complain :)", "author": "Willa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "I walked in to see one guy at the end of the bar watching baseball with a beer and no one else to be seen.  Soon enough I found out that he was the bartender/owner, so I liked this place immediately.  David (the owner/bartender) is a nice guy who made me feel right at home at the closest bar to my new place and I'll be back again (probably today).\n\nThey have an excellent beer supply with good taps at reasonable prices.  I'm glad to have a cool bar so close to home.", "author": "Jim S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-28", "description": "Not sure what impresses me more, the 1891 establishment date,  the friendly service, the  pool tables, or THE KILLER BEER SELECTION!!!!!! I'm a sour beer fan and The Monk's Cafe is one of my faves and Shotwell's has it on tap! Great place to hang out in the evening or any time.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "If you've lived in the mission for a while, you want a bar that's not totally slammed every friday@ 6, but isn't clooney's or the broken record.  This is the bar.  Don't let them go out of business.", "author": "Hawkeye P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "Oh Shotwell's. Where to begin...\n\nThis is my kind of bar. I don't like mixed drinks or shots, and I get really tired of the generic beers at most bars. A fantastic beer selection and guys (and gals!) behind the bar who REALLY, I mean, REALLY know their beers. I'm terrible at making decisions (and you will be too, if you had to choose from their taps/bottles), so I often ask for recommendations with some ideas of what I'm looking for. And they've never let me down. \n\nBeen here both on weekdays and weekends. Prefer the weekdays or weekend afternoons (to catch some obscure hockey game on their NHL Center Ice package) because it's less crowded, low-key. But it also never gets disgusting/sweaty-crowded like other bars, even during peak hours. \n\nHonestly, this place should get six (or seven or eight or nine...) stars.", "author": "Christie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "I love me some Shotwell's .  Great owners, beers, neighborhood peeps, pool, and pinball.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-01", "description": "This place gets five starts because of the bartender.  He recommended that we go to gracias madre to eat. I am forever grateful to him for that.", "author": "Laura F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "Ohhhh Shotwells, how you complete me. This just might be my favorite bar in the mission, if not the entire city. Your jukebox is sound. Your pool tables are legit. And your beer selection is top notch. (Any place that serves Dogfish 90 minute IPA's automatically exudes notoriety in my book--Thieves may have you beat just because they serve it on tap).\nANYWAY, finding a pool table in the mission can be difficult, sometimes impossible, but I've always managed to get one there. And if there are people occupying the tables, the players aren't grade-A douche bags playing by their own unorthodox \"rules\" who bogart the tables with their unruly friends. It's mellow but hip, easy to miss but hard to pass up....Shotwells is a great little local bar that I'm glad to have stumbled across.", "author": "Jessica U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "It's a neighborhood bar, its a 'tasting' room of fine brew.  Put it together and what do you get? The best bar in the city.", "author": "Suzy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-21", "description": "Good beer makes me happy; therefore, Shotwell's makes me happy. I like the neighborhood feel and of the hipsters there, none were too dirty or pretentious-seeming (in contrast to the ass-grabbing swingers I encountered at Pops later in the night).  I had been when it was the Inner Mission and liked it just the same. Now that I'm back in the Bay Area this will surely be one of my regular watering holes when I'm in the mood for quality beer.", "author": "Cassandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "Comfy, clean dive bar. Populated but not over populated. Mission hipster crowd. Dress casual. Places to sit. Room to stand. Pinball and pool tables in the back. With an amazing beer selection. Beer, wine and sake only. Two words, \"Mission\" and \"Dive.\" Can't complain.", "author": "Alex H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-24", "description": "Friendly bartenders, gregarious patrons, excellent draft selection & a great pub ambiance.", "author": "Sally M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-05", "description": "UPDATE, I'm not observant at all, the pool tables are a dollar a round, not free as I stated before. Still the most legit bar in all the land. Great crowd, great owners, large selection of awesome beer. They also have a twitter feed (@shotwellsbar) and do beer float days with Humphry Slocombe every so often. I haven't had the pleasure of being there for one of these, but I hear nothing but good things.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Very chill place.  Has great atmosphere and good bartenders.  The best thing yet, they allow dogs!  Awesome.", "author": "Tony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "This is definitely a neighborhood gem. By that I mean definitely the cleanest bar I've been to in the Mission. It gets 5 stars for that. Great warm vibe and not overly crowded. My group of friends like to stop by for a few beers and to play pool. They have a decent selection of beer and it's not too pricey. This bar is an inviting and casual place to kick it with your friends on a weekend night when you're not trying to do anything too big!", "author": "Janie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-07", "description": "kostritzer dunkel on tap. among other really great beers.  but they have more in bottles than on tap. which you don't immediately realize from the menu, especially when you're jockeyed by your own reflection staring back at you, quizzically surveying the menu.  that is a real shame, though - the bottled beer, not the reflection, well, not necessarily.  i'll change my review to a full 5 stars when they get the bottled to draft ratio right.  (oh, and if they would try to enforce the sf health code and not allow dogs in the bar.  i love 'em too, but out on the street people who are highly allergic - like yours truly - retain the option of not petting and crossing the street if need be.  i don't like getting driven out of enclosed spaces when i want another.)\n\ngood space, crimson walls studded with old saloon mirrors.  good place to stop in for good beer at good prices, friendly and great bartenders.  but after the third round i remembered what the problem was with beer only bars - no gin or whiskey.  they must have had wine too but i never got passed the beer list.  and i don't want to pull apart every dog hair landing on my nose but i really think they ought to go back to their previous name as \"beer parlor\", which is a whole lot less misleading than \"bar\" which suggests to me there might be more than beer.  but maybe this was a first step and they're working on getting their alcohol license? i'll definitely be back when that happens.  but for now i'll be hitting up shotwell's beer parlor when i'm on this pretty tree-lined street in this part of the hood.", "author": "Nikki F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-22", "description": "They have a working Medieval Madness pinball machine. I don't need to say anything else.", "author": "Morgan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-28", "description": "Good solid spot to meet up w/ friends.  Great beers.  Friendly bar keep who suggested most everything we ordered and never dissapointed. Not pretentious and an overall clean and beautiful bar.", "author": "Natalie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-02", "description": "Why five stars? They have YOUNG'S DOUBLE CHOCOLATE STOUT on TAP, only the GREATEST STOUT EVER. Please message me if you know of another bar in the city that has it ON TAP. I love this bar. Did I mention that I love this bar?", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "Great prices, unpretentious, good people, cool bartenders, wide selection of beers, lots of seating.  Can't be beat.  One of my top 3 favorite bars in the city.", "author": "Victoria M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-17", "description": "ended up being better than i expected.\nthe juke box is full of old school goodies. got a table on a saturday night.\n\nthe douche was in full effect that night. i think they were out of towners who were lost......\n\nfriends were very impressed at the beer selection.\nquiet enough to chat with everyone in my group.\n\nthe negative..the bathroom was the stinkiest bathroom i have even been in. hands down. i thought i was going to die. \n\nwill go back..just run the couple blocks home to piss.", "author": "dawn a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "Great little pub for SF area, the place is well over 100 years old which makes it fasinating in it's own right...have all types of beers but you better know your beers cause if you don't you might choose something that kinda sucks (like I did, but can't blame them that's my fault)...I tried my other friends beers and they were amazing! so definatly check this place out if you are looking for a chill pub to come have a brewski at", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "Real tight place. My dog had a helluva time, and I enjoyed myself as well.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Love my local. Friendly people, cheap pool and good beer. Oh, and if you happen to be on your own - the bar staff are great company.", "author": "Brett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "I'd like to spend some more time here. It's dark and cozy.", "author": "Monika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-18", "description": "The beer is great, the crowd is pretty chill and non-assuming, and the PINBALL.  Oh lordy, I lost about a week's pay into that Midieval Madness pinball game.  You can get a crowd going just waiting to play that thing. 5 balls for 75 cents. I think I'm a pinball convert.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-27", "description": "Came here after getting tired of the Elbow Room. This place is pretty quiet but at the time that was a good thing. I loved their Hefeweizen on tap. They do not serve liquor here so beware if you are trying to get hammered.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "Solid neighborhood bar with an outstanding selection of beers.  Would be a four-star bar except that no bar that doesn't serve liquor can get higher than 3 stars from me.", "author": "G Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "Great beer. Good atmosphere and a friendly bar maid. What more do you want? Drink up Johnnie!", "author": "Scott K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-23", "description": "Formerly know as Inner Mission.. Different name, same bar.. I think this new moniker suits it very well...  Beer, pool, jukebox.. All u need for a great neighborhood bar..", "author": "Carlo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-20", "description": "It was supposed to be a few wines on a mellow Saturday afternoon but then we got to Shotwell's and it was all over!  We got there early enough to snag a pool table and take over the jukebox........very surprising music collection - it was either The Clash or the yummy white wine that made me fall in love with this place!  The beer was awesome too....as was the bartender.  Great atmosphere and no snobby people!!", "author": "B P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-29", "description": "You can't beat the combination this place has got going on...  2 pool tables, 2 pinball machines, sweet jukebox, great eclectic beer selection, cool owners (who are still damn cool after your group breaks a few glasses).  What's not to love?  I love this place so much, I follow their Twitter feed.  Bad-effing-ass.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-28", "description": "This place is chill, dark, and has a great beer collection. They have some great Belgium brews. Try the Duchess, a sweet, dark temptress, vinegary, and delicious beer.", "author": "Spoke K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-10", "description": "Love this place. Great beer, music, and staff.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-15", "description": "I'd give this place one star, if my conscience would let me, in order to keep people away from my favorite bar.\n\nBut it won't, so I can't.\n\nGreat selection of beers, awesome vibe and patrons, five ball pinball machines and the best bartenders ever.  Now stay away.", "author": "Daniel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-15", "description": "A hidden gem.  Very clean, airy, with bartenders who really know their beer/spirits. Large selection of beer from all over the world, and just very comfortable in a neighborhood bar kind of way.", "author": "Kris A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "This is a great place to go if you truly enjoy tasting beer. An extensive selection of imports and domestics alike, and great ambiance coupled with knowledgeable and friendly staff make this a favorite of mine. Doesn't fit a stereotype. I Love Shotwell's!", "author": "T M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-10", "description": "Super chill bartenders. They have all sorts of beers on tap, and they know their beer. It's lively but not so much that you can't hold a conversation.", "author": "Victor L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-21", "description": "Solid beer selection, superb owners, great pinball, killer jukebox, chill crowd, nice location, awesome atmosphere, rocking happy hour. It's my go-to and I love it.", "author": "Alexis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "this is my new favorite bar. great jukebox. awesome saturday bartender.  good beer selection. 2 pool tables. bike racks.", "author": "Hello D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-14", "description": "awesome neighborhood bar and fantastic beer collection.  i didn't recognize much but I told the bartender (who was very cool) what kind of beer I like and they picked one out for me.", "author": "Erin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-04", "description": "lovely little bar away from the main stretch of mission. perfect for some lowkey hanging out and drinking with friends. they have a decent selection of beers and also a few sake options. for some reason, the medieval madness pinball machine randomly gave us 3 free games.", "author": "Angi C."}
