{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "I absolutely agree with so many of the other reviews -- this is definitely one of the best Thai restaurants in town (and yes, I know there are many!). \n\nLuckily, I live super close by and Siam Lotus is my go-to for Pad Kee Mao!", "author": "Meesh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "As far as decent thai food goes, Siam Lotus does its job. You can eat in or get take out. I frankly need to expand my taste buds and not keep ordering pad see ew, pad kee mow, or pad thai. They got some decent fried rices too though I guess that doesn't help my case much. They have more on the menu you can try! Really!\n\nAs for the food itself, it's good though not particularly overpowering in flavor though that can be a good thing for some. Adjust the spice level as you will, a medium isn't all too bad and ought to be a good level for most people. \n\nAll in all, this is an unassuming restaurant that serves decent thai food for the price you pay.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Best Thai restaurant in town! Test the coconut pad Thai and coconut soup!!\n\nThe tenant is also always super nice and welcoming!", "author": "Anne-Sophie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Visiting town. Ordered Drunken Asparagus Noodles, Spring rolls, jasmine tea. Delicious, big portions, reasonable prices, made fresh. They had traditional dishes and obvious spin offs like pumpkin for the season. The waitress was wonderful and busy.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "We arrived in San Francisco for vacation and we were looking for something to eat before we could drive out to Napa. I was in the mood for some Thai so I looked to Yelp for some help in finding something around us.\n\nThe area we happened to be in had a lot of places to choose from but Siam Lotus seemed to have one of the better ratings so we decided to give it a try. I went with my go to Pad See Ew. Unfortunately I was left pretty disappointed. Sauce could have used more flavor. It tasted very bland and they didn't offer a spice level. It could have used more sauce over all because it was a little dry.\n\nWhile the food didn't hit the mark for me I will say that the staff was very nice. They were very attentive and extremely nice.", "author": "Lexi N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "I almost always avoid eating on the Haight and this place is a perfect example of why: subpar food at stupid tourist prices. Bland $17 curry with undercooked potatoes, sour papaya salad. With how high the bar is for Thai food in SF in general, you can safely avoid this place.", "author": "Jeremy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "This is a great Thai place in downtown SF. We ordered the Veggie Spring roll and a Pad Kee Maw. The spice level was below average so make sure to tell them \"Spicy\" if you want medium spicy. \nThe Spring rolls were one of the best we had in a long time. The quantity is adequate and the people are very welcoming. \nDefinitely recommend!!", "author": "Gopal I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Randomly stumbled upon this place after shopping at amoeba & we're glad we did.\n\nHere's what we ordered :\n\nGrilled lemongrass chicken w green papaya salad & sticky rice $14.25 spice level 3\nSo good! The chicken wasn't very spicy @ a 3 so we asked for extra chili, but the papaya salad was. Great mix over the sticky rice & such good flavor - perfect white meat chicken.\n\nSpicy rice noodle w chicken $12 spice level 4\nWe also added more Spice to this one, but it had such good flavor and a nice veggie mix.\n\nThe ladies were so nice and attentive, we'll be back!", "author": "danielle a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "We stopped in this place while we were checking out Haight Ashbury. It looked unassuming from the outside but we were hungry and it was right there. I ordered the salmon and Brussel sprouts and it was amazing! The flavor was so good, the price was decent and the service was great. I would definitely eat here again.", "author": "Tabitha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "This is the take out plate.  Should have been crispy chicken with rice, pineapples and raisins.  The rice really need more flavoring.  You have to get there early to get the crispy chicken.  I was happier last tome with the cashew chicken.  The chicken wasn't as dry as it was last night.  Prices comparable, but this particular meal I think was over priced.", "author": "Diane L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "No waits. Good amount of street parking on weekdays. Huge selection to choose from. Check out the Specials section on the menu. \n\nShared: \nNorthern Chicken Curry Noodle (khao soi)\nDrunken asparagus noodle with pork\n\nThe Northern Curry Noodle was tasty and flavorful ! Loved the pickled mustard on top. The dish was a little spicy. Just perfect for me. Appetizing and delicious. Highly recommend. The Drunken Pork asparagus Noodle was average. Lacked a little flavor. Both of the noodles were cooked well. Their portions are a decent size. Definitely satisfied my Thai craving with the khao soi. The service is quick and pleasant. I like this place, I'll be back when I'm in the area.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Amazing Thai! We were so surprised about it since we randomly selected it when passing by (we normally check Yelp first). We ordered prawn Pai Thai and another plate with chicken curry, both to share. Everything was so good and the service was professional, very friendly and very helpful (she reminded us about the peanuts and egg in one of the ordered dishes, just to make sure none of us was allergic to it). 100% recommendable!", "author": "Claudia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Very affordable and the server and greater were both very kind. The pork belly and Pannang Curry was delicious. Must share the coconut ice cream with a fried banana. It's been a long time since I have received wonderful service. Parking is very challenging, but welcome to San Francisco.", "author": "Jo E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "This Thai dish was delish \n\nAppetizer: \n- Thai Tacos\n\nMeal: \n- Mango Thai Basil\n\nWe chose this place because of the awards and accolades it received. We started with the Thai Tacos (voted best in 2017) and were not disappointed. It was an interesting take on Tacos with Thai food and it was yummy. Make sure you put some of the cucumber/carrot on it because that's where the sauce is.\n\nThe mango Thai basil was good but my only complaint would be there wasn't enough of it. I'd say 75% of the plate was rice and 25% was the meat, mango and basil. Of the 25%, 75% was mango. I like a lot of protein in my food so this was slightly a let down. I did like how it tasted, just wish there was more to eat!", "author": "Isaac A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "Service was pretty slow and the curry only had tofu with zero veggies. It's an okay substitute if Ploy II is closed.", "author": "Christy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "Amazing food and very friendly staff!!! We ordered Chicken satay, rolls and Panang curry. All of them were delicious", "author": "Nancy86 B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Such a gem in the Haight. The ladies here are so welcoming and polite. Made us feel right at home", "author": "Albert C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "This place is so Bomb! I couldn't believe how amazing the Pad Thai and Pad Kee Mao were. Just the differences in flavors and the perfect way they combine the spices was crazy. Beautiful and such hospitable waitress. 5/5 and will mosdefinately was returning", "author": "Shaun B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Best Thai in Upper Haight, service is also wonderful.\n\nA couple of my favorites:\nPineapple Kisses\nPad See Ew\nPumpkin Curry or the other one when pumpkins aren't in season (they'll recommend it for you)", "author": "Tim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "My girlfriend and i came here for her birthday and our anniversary because the thai restaurant across the street was closed until 3pm. We ordered the chicken pad thai and it was tasteful. She ordered the chicken curry and no complaints have occured. We also got the thai tea float. The scoop of ice cream was coconut flavored and it went well with the thai tea ! \n\nThe servers were nice and gave terrific service ! This place is very casual and family friendly. Good for kids. Whenever we're in town, we're definitely coming back!", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-31", "description": "The restaurant is right in the middle of Haight street, in between all the funky Tibetan gift shops. Apart from the surrounded funkiness, the restaurant is not very good for their food.", "author": "Aswin V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Friendly people. High quality food and ingredients. Great value for the price. We've been twice in two days and will come again.\n\nUPDATE: We've now been back several more times and we still love the place. One of our favorites.", "author": "Seth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I was really set on only going to one Thai place since getting to the neighborhood- mostly out of finding it and liking it. But... as we were walking around The Haight we stumbled upon Siam Lotus. Quickly, we checked the yelp reviews and they looked great- so we went in on a sleepy Saturday afternoon. WOW. This place is super good! We ordered the duck fried rice and the pad see ew. They let you adjust the spice you want to make it perfect- we went with mild and were very pleased. The oil that ends up on the food isn't so much that you feel it covering your lips as you chow down on those noodles/rice.. but it is just enough to give it taste. I would even go as far as saying this tastes \"cleaner\" than other Thai I've had in general. This place was so good it is now in the list of go-to places for takeout. Which by the way, is super easy to order through their website. Overall, a fantastic Thai place and great food.", "author": "Nadia H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "Mediocre food. My friend and I both had two famous Thai dishes: the Pad See Ew and the Pad Thai. It was just okay. The vegetables were cut too big, the bean sprouts weren't fresh and crunchy, and the flavors were bland. San Francisco is full of great restaurants. If I could go back in time, I would go elsewhere.", "author": "Marissa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-24", "description": "This is your average Thai food joint. My dad and I needed to grab a bite in The Haight and decided to check this place out. \n\nI went with the veggie pad thai without egg. While they piled on the veggies, what my dish did lack was flavor. It was quite oily-- more oily than any other pad thai I've had. The noodles were cooked well and I enjoyed the tofu that accompanied the dish but probably wouldn't order it again. With all of this said, the portions are quite large here and the service is quick and pleasant. Wasn't quite memorable but didn't have a terrible experience by any means.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "We went for dinner today after 9pm, as this was one of them opened late night. Ambience is really good, with big enough bar. We were welcomed and seated immediately. Since we weren't hungry, we ordered couple of entrees, spicy basil friend rice and red curry directly without any appetizers. Guess due to late night with not much crowd around, food was served within 5-10 mins. \n\nDishes:\n* Spicy basil fried rice - we were very disappointed with the portion served though it tasted good. \n* Red curry - Portion was decent though both of us felt it was too much coconuty which was honestly quite overwhelming and not able to consume it after few bites. we had way better red curry elsewhere. \n\nOverall, this place is ok once in a while, but may not be one of our go-to place next time.", "author": "Swepna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "My favorite Thai in town. Amazing food and great service! The owner make you feel like home! Amazing Thai experience in the US.", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Seriously good authentic Thai food.  I had the crispy pork belly goodness and it was outstanding.  I strongly recommend it.", "author": "Vanessa B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "Oi Vey. Not good. Lunch with 2 companions: \n\nPad Thai: substandard with noodles that must have come from the vendors bargain bin\n\nPapaya salad: Tiny portion... many ingredients from WW2, papaya slices ready to expire\n\nSweet and Sour (pork): ODD. Soggy fried pork pieces soaked in the vinegar sauce\n\nDuck Soup: reported be be OK\n \nShulda got a clue when we arrived and we were the ONLY table with people in the restaurant @ Noon. Put my jacket on a chair on the table next to me and Server/Owner/Ms.ThaiLand 1952 took it off and handed it back to me. Odd since we were the ONLY people in the restaurant.  She had the aggressive attitude of: \"HEY I have a restaurant on Haight Street, you eat what I serve and pay the price\". Disappointing. BAD service. Bad Food. Bad big price. BAD BAD BAD. Oh, and the fake 4 & 5 * reviews won't help this joint.", "author": "Matsuo U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "Solid Thai in the Haight. This came as a recommendation from a local right down the road. The exact words were, skip Hippie Thai and walk the few extra blocks and you know what...I'd tell you the exact same thing.\n\nSiam Lotus is a tiny restaurant that offers an awesome gluten free selection. Though their isn't a menu for it, the waitress will tell you exactly what you can and cannot have. She will also check to see if something can be made gluten free for you. To me, that was a huge perk and I really appreciated her going out of the way for me.  \n\nThai Basil is the way to go. This dish was perfectly spicy and filled my craving for an awesome Thai meal. I wish it came with rice, but that is something that could have easily been fixed on my part.", "author": "Kendal Ann M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-07", "description": "I've been to my fair share of Thai restaurants and honestly I've had better. \n\nThe food here is ok. It was not worth the price I paid for. I got rice, chicken wings, Thai tea and pad kee mao and it came out to 30$! I mean if the food was good then I wouldn't have complained but it wasn't. \n\nI got the Thai basil chicken wings (best dish of the two) and I got the asparagus pad kee mao noodles (disappointing). Both dishes especially the pad kee mao dish were more on the bland side. Their Thai tea was too sweet for me. \n\nThe service was nice, the lady who served my friend and I was so sweet and brought everything that we asked for. \n\nTo find parking will be challenging so expect to drive around for a while. It is metered parking so bring coins!", "author": "Myly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "My partner and I come here once a week, and are finally giving Siam Lotus what we owe it--a glowing, five-star review. First, let's talk about the food. We've tried nearly everything on their large, vegetarian-friendly menu, have never been disappointed. (Seriously, I just glanced over the menu again, and could make an argument for choosing just about anything.) It's also a great place to stay for dessert: I'd highly recommend the black sticky rice and coconut ice cream. \n\nPlus, especially for a restaurant right on Haight, it's never too crowded and has a warm, neighborhoody vibe. Service is fast, and the staff are always super friendly and already know our drink order (two Chang beers). When our friend visited from out of town, Siam Lotus was the first place we wanted to bring her, and they made her feel right at home--even giving her a sack full of Thai chilis and a six-pack of beer glasses as a gift. Basically, it's the cozy, family-owned Thai restaurant of your dreams.", "author": "Emma E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "DELICIOUS COMFORT FOOD. Very well seasoned. Just hands down best meal I've had in SF. I ordered the chicken pad Thai. My friends had veggie curry, golden curry, and the chefs special -salmon with garlic and chard. Tried all of it and it all was on point. \n\nAs if that isn't enough, the staff here is soo nice and satisfaction oriented. I left with a little left over for my trip back to LA and I don't feel gross-full or bloated. \n\nThis is the type of place to have dinner if you want to be taken care of genuinely. I highly recommend this spot.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "I am between a 2.5 and a 3 .\nThai tea was pretty good . It was better than a lot of other places i have had and this is probably what contributed most to my rating .\nCalamari was okay ~ just average but the sauce it came with was interesting and different however .\nMint salad with chicken tasted like it had fish sauce in it so if you arent a fan of that taste i would not recommend it . It tastes better than it smells and tastes better wrapped in the lettuce .\nI also got asparagus drunken noodle spicy lvl 4 . Overall it was not too spicy but it had chili in it that burned my tongue due to its spiciness ! It was not too flavorful otherwise . \nPortions are pretty good and big but i dont think the food was that flavorful or anything special .", "author": "Julia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "This place is the bomb! Chef's Special Northern Curry Noodles are unique. We'll be back.", "author": "Vaibhav M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-24", "description": "This teeters more towards a 3.5 star, but going off of what Yelp gives me the options for. \n\nA pretty quiet spot in the Haight area. Came here with a group of three and got seated immediately. We were craving Thai food all day so we immediately ordered a few appetizers to split and our own entrees\n\nCalamari - 3/5 decent and nothing too special. They had a sweet sticky dipping that had a nice little flavor kick to it\n\nMinced chicken with mint salad - 4/5 tasted fresh and had a fish sauce kick to it, I think. So if you're not familiar with that flavor, be wary of this dish. Otherwise, it had a healthy flavor and was great wrapped up in the lettuce leaves. \n\nDrunken noodles with asparagus - 3/5 they ask you what level of spice you want (1-5), and I'm pretty tolerant of my spice so I got a 4 and it definitely had a nice kick to it to help clear up those sinuses, but aside from the spicy factor, there really wasn't too much flavor with these noodles unfortunately :( had to ask for side sauces to douse the noodles in to get it more flavorful\n\nOverall, it was an average experience with average service", "author": "Jay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Best Thai Food on Haight Street!  Couldn't have been a better date night.", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Very delicious curried masumen squash! Best I've had in years. \nService was nice and quick, and I felt just fine going by myself while visiting San Francisco for a conference.", "author": "Sally B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Ate late lunch here after SF Aids Walk. Took bus here since we knew there would be limited parking. Nice decor. Service excellent. Entrees ordered (curry chicken and catfish)  tasted excellent. Smaller cafe and no wifi.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "4.5!\n\nThe service here was so pleasant! And I def the decor is very cute.\n\nDef enjoyed the duck fried rice and lemongrass chicken. Presentation was so pretty. We came here around 12 on a Friday before the king rush and the food came right out.\n\nBe forewarned: on the menu it kindly states there are only 2 people cooking so please be prepared to wait a little if the restaurant is busy. \n\nWould def come back if I'm ever in The Haight.", "author": "Jo Ann D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "Great Thai food! Wonderful for kids! We ordered pad Thai and chicken from the starters for the kids. For us we ordered the veggie green curry and the chicken with papaya salad from the chef's specials. All was great!", "author": "Moran G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-27", "description": "We took a friend to birthday dinner here, but the food didn't reach our expectations. The coconut soup was thin. However, one of the special offerings stood out - sweet and sour seafood deep fried with bell peppers.  I think the addition of bowls of heavy brown rice were too filling and we could barely get through the Green Bean Prig King which did not have a well defined sauce. Hospitality was good.", "author": "Carolyn D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Wow! Can't believe I haven't rated this place. It's my favorite go-to for Thai in the city *and* just happens to be around the corner from my pad. \n\nThings I order:\n- Crispy Chicken and Pineapple Fried Rice (holy yum)\n- Pad Thai (the best)\n- Spicy Basil Eggplant w/ Fried Tofu\n- Coconut Soup (yes)\n- Green Papaya Salad\n- Northern Curry Noodles (spicy!)\n- Duck Curry (when I can afford it)\n- Duck Fried Rice\n- Golden Triangle\n\nI've had some dishes that I'm not crazy about but everything is solid, and \"crazy\" in the context of I *LOVE* the dishes listed above. The staff is always super sweet and kind. \n\nI've also taken lots of veg friends here and it's a place that works really well! \nThey do lots of takeout business in the neighborhood, which keeps the place itself really mellow and the wait is never that long for a table.", "author": "snowhappy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "Mediocre thai food at best but what really killed it was the waitress. Don't really like leaving one star reviews but felt this was important since it was a combination of bad service, mediocre food, and bad service.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "#1 in Upper Haight.\n\nUpper Haight doesn't really have great food options, but Siam Lotus is an exception to that.  This is a super solid Thai spot, and not only is it the best Thai place in the Haight (beating the decent, but not spectacular, Ploy II), it's just the best place to eat in the Haight period.  It always hits the spot, never disappoints.\n\nAs a plus, aside from the normal Thai stuff (i.e. Pad Thai), it does have some less standard options, such as the Crispy Chicken with Pineapple Fried Rice which I highly recommend.", "author": "Max B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "Holy s#!* that was delicious. Everything. All of it. Even the music was good. We came on a lazy Sunday afternoon right after a large group had walked in, but the food came out fast, regardless. Our waitress and the owner(?) were extremely friendly, too.\nHighly recommended.", "author": "Gabriel V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Omg ! I had the best Drunken asparagus which was so delicious  \nThey are lovely and welcoming people and food served very quickly.\nIt could be a perfect spot for vegan options.", "author": "Violet D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Its a sweet family run place. Had the spring rolls and the pad thai. Both were average. Didn't love it. The portions are also decent sizes.", "author": "Ashmita V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-05", "description": "The Pineapple Fried Rice with added Shrimp here was lackluster and tasteless. I suspect that they used canned pineapple, the shrimp was sparse and fishy tasting, and the rice was barely seasoned and contained no other ingredients - besides 4 shrimp and about 9 cashews. \n\nI was so disappointed in this dish - that I picked out the shrimp and left the rest. I prefer to indulge in carbs that delight my tastebuds - rather than dull them.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-13", "description": "I had a late lunch here. I started off with some Golden Triangles, which were somewhat unconvincing. They appear to be a potato-filled take on the classic \"Golden Bag\" thai starter. Then I had the Golden Curry, which was apparently something of a house specialty, owing to its strong coconut flavor. That was pretty good. I also had a thai ice tea, which was perfectly fine. Overall, this was nothing outstanding, but my meal was filling and reasonably tasty.", "author": "John L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "Very attentive staff!  I ordered Drunken Asparagus Noodle.  On the bland side till I added some chili paste.  Good flavors but ila little on the greasy side.", "author": "GARY T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "I LOVE this place! Great Thai food. It's a gem!\n\nHuge menu and the service is fast. Lots of choices for a vegetarian!\n\nThey ask spice level and they are spicier than most Thair places so go easy. I eat quite a bit spicy and I got a level-3 and it was perfect. Level-4 would be much higher than what I would like. \n\n1. Golden Triangle - these are potato filled Thair Samosa. They were okay. Nothing special. \n\n2. Pad kee mow ($11) - loved it! Highly recommend it. I got it with tofu and it was delicious! \n\nTheir portions are big so you may not finish.", "author": "Hiral P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "This place is very good, I think. There were many dishes you can choose.\nWe ordered four dishes and they were delicious. You also can decided the taste of the food. So humanized! Both of us enjoyed a good dinner! Will come back soon.", "author": "William D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-23", "description": "The plates look nice,  but the food is not good.  We are used to Thai restaurants and we have tasted a bunch of Thais around San Francisco,  this one is not cheap and the worst we have tasted so far.  \nWe ordered :\nMango Thai basil with shrimp : you won't get more than what's in the title,  and the shrimps were not thoroughly cooked. \nCoconut pad Thai : bland and fatty ,  even adding spicy sauce and tons of salt \nThai Tom Tim noodle soup: the smell was not good and the taste was...   \nGo to the one on the other side of the street,  with the stairs, it was closed and we ended up here,  double disappointment.", "author": "Adelaide B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "We eat takeout from Siam regularly.\n\nRecommendations are on point! They suggested the Drunken Asparagus one day and we really appreciated the suggestion, it's now a new favorite. \n\nWe've tried various curries, noodle dishes, and more. Everything is good. Preference for noodle over rice dishes. Generally, this place is a crowd pleaser.\n\nIt's generally very easy to get a table for 2-6 right away without waiting (maybe larger groups as well, we just are usually not a big group). The ambiance is casual and well kept but nothing special. It's a good place to hang out and the service is always good.\n\nGlad to live nearby", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-07", "description": "Good Thai place to go up in Haight. Not the best Thai food, but it's okay. Service was quick and it was reasonable.", "author": "James D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Absolutely some of the most delicious Thai food I've ever had. Their homemade peanut sauce recipe is to die for.", "author": "Mollie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "The best Crab Fried Rice I've ever had.\n\nI randomly dined in here with my girlfriend to kill time before a book event down the street. We were craving Thai and this was one of the few that were walking distance from The Booksmith.\n\nI consider crab fried rice a waste of money because crab meat tends to have a subtle flavor, the flavor gets drowned out when mixed in a fried rice dish, ultimately rendering the dish into a regular fried rice.\n\nThis place, however, does Crab Fried Rice amazingly. Not only can you taste the crab, you can smell its aroma as well! Very appetizing and delicious and I highly recommend it.\n\nAnother great dish they have is their chicken wings. Perfect combo with the fried rice.", "author": "Oliver D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-29", "description": "Mediocre food in surprisingly small portions for the price that you pay! You will better Thai food in most other Thai restaurants in SF.", "author": "Yali W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Very good fairly priced Thai! Very good at providing appropriately spicy food and friendly service. I ad the drunken noodles with asparagus , I would come back again", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "Decent Thai. \n\nI ordered Tofu Pad Thai and my boyfriend had Chicken Pad See Ew. It was not bad, but nothing to get too excited about. \n \nI ordered my Pad Thai spicy. The waitress repeatedly warned me that it would be extremely spicy, and wouldn't let me order it too spicy. I should've stuck to what I know (I eat thai frequently AND I've been to Thailand). I ended up adding more hot sauce to it. However... she did let my boyfriend order his dish spicy. It was indeed spicy & sweat inducing. (Clearly, a little bitter about that.)\n\nThe restaurant had one, maybe 2, other couples in it and the service was slow. It took a while for someone to take our order and the food came out slowly. I don't know how they would handle a full house. \n\nOverall, decent. Not itching to go back.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "Not bad. Food isn't bad..so so, but, the location pretty key, and the staff is very very nice. Check it out for yourself.", "author": "Thet M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "In upper Haight there are many options for noodles and thai food but Siam Lotus is my go to neighborhood spot. They are super fast and have a very diverse menu, though I must admit I don't venture away from my mainstays: pad thai, pad see ew & panang curry. They are spot on and worth repeating.", "author": "Molly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "Although I live in San Jose, every time  I go to the city I end up eating at Siam Lotus. Everything I have eaten on the menu is delicious !!!!! They have classic Thai dishes like curries, twists on classics( coconut pad Thai), and different dishes ( ginger catfish). You can taste the freshness and love in the cooking, something I search for in a restaurant. They even sell some of their sauces to go ... I'm hooked on the salad dressing !\n\nGreat food, great location, and awesome people/service ! :)", "author": "Daria V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "This is my favorite local Thai place. I've liked every dish I've tried there, and the crispy chicken and pineapple fried rice has become my go-to comfort food. The staff is very friendly, and they've also been very accommodating and conscientious of a peanut allergy in our family (a risky proposition in a Thai place). They also tend to get the food out lightning quick.", "author": "Pat M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-28", "description": "Terrible food, rude service.\n\nThai food is a favorite of mine so when we passed this place we decided to stop for a snack on a whim, and we were very disappointed. \n\nAt first the service was friendly enough and our drinks came out fast. I ordered chicken satay and a bowl of tom Kha for my boyfriend and I.  When I ordered she asked if we were sharing and I said yes, assuming she meant for an extra spoon.\n\nThe food was pretty bad. The chicken satay had clearly not been marinated and tasted boiled-not at all like the flavorful meat I experience most places. The cucumber salad with it also seemed tossed together and lacking on flavor. Even the peanut sauce was sub par.\n\nThe tom Kha lacked coconut flavor weirdly and was very short on both vegetables and chicken. I believe it must have had milk since shortly after eating I got a migraine that I get when I consume dairy. The portion was large, which surprised us but we figured out why when we got the bill.\n\nThe menu says only 'individual soups' and shows the price as $5. I thought that would be perfect for a snack. It does not say any sizes or use the word 'cup' of 'bowl'. When we got the bill we had been charged $9.59. Normally I wouldn't say anything but I didn't love being charged for something we barely ate that was terrible, so we politely asked about why it wasn't the menu price and she turned incredibly rude and told me I ordered wrong and should've said cup if I wanted a small portion. My boyfriend asked her politely despite her rudeness why the menu didn't show a large size if she was charging for it, or at least didn't say 'cup' or 'bowl'. Then she said that she asked if we were sharing,so she gave us more. She was incredibly rude and kept telling me that I ordered wrong.\n\nWe both work in restaurants and know that you should never double the price of an item without informing the person. If the $9.50 price wasn't on the menu then you should ask if they want a larger portion for a higher price, not just assume that they want an off menu size and will pay for it.\n\nIt was clearly a scam, but even worse was how terrible she acted when we politely asked about it. Do not trust this place.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-22", "description": "Beware. They overcharged my credit card. While I can't prove it was intentional, as you'll see below, it sure looks that way.\n\nI ordered takeout. State law says cooks don't share in tips; it was the cooks who did all the work on my order (not the servers), so I usually leave no tip or just a little one in this situation. \n\nSo I added a $1.16 tip on the $22.34 order. As you'll see in my photo (a scan of the credit card bill and the receipt the restaurant sent the credit card company), they entered this $1.16 tip as $4.00. How can that have been a typo or an entry error? Those two sets of numbers are nowhere near each other on the keypad. \n\nThe dollar amount here is small. But it's the principle. And if they did this to me, to how many other customers have they done this as well?\n\n[Update: one of the owners emailed me, apologized profusely, and offered this explanation: \"We line our credit card bills by number order and yours was most likely misplaced within the pile. Therefore a different order's tip was added to your bill.\" You be the judge, but it's always good practice to double check those credit card bills].", "author": "Tim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Came here with my girlfriend Saturday night; no wait for seating. It's a small place that doesn't look fancy, but the food was fantastic. I got the prawn pad Thai and she got scarlet roast duck curry. We shared the Thai tacos for an appetizer. We both eat lots of Thai, pho, and Indian in Vegas and this place was right on par with our favorite restaurants. Total bill was just under $40 for 2.\nGetting a side of rice for the curry was a good idea, and if you're unsure what to try just get pad Thai - it's simple and made so well that anyone will enjoy it.", "author": "Eric S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "Ordered via Grubhub, which was a breeze, but I was pretty disappointed in the food. I'm a big Thai food fan, but had never eaten here, despite it being a short jaunt from my house. Grubhub told me the veggie spring rolls and the pad thai were popular, so I got em. They're also pretty common at Thai places, so figured they'd be a good benchmark.\n\nUnfortunately, they both fell short. The spring rolls were plain, but made better with sweet and sour sauce. Still not worth it to get three small spring rolls (three!) for $8 (eight dollars!). The pad thai was a healthier portion. I ordered shrimp as the protein, which, if you've ever ordered anything with shrimp, you know they're not going to give you as many shrimp as you want. This was actually a surprising exception! However, didn't change the fact that the pad thai was not that great. While some thai noodles veer too far into greasy/salty/spicy as hell, I would have gladly taken that over whatever this was.\n\nDespite the convenience, probably won't be heading back. Stars for the quantity of shrimp/noodles and the inclusion of sweet and sour with the spring rolls. An additional half star in spirit for the ease of Grubhub, but I think Grubhub earned that all for itself.", "author": "Julien I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "This Thai place is fantastic! We originally were going to head over to Cha Cha Cha (which is other gem) had a hankering for Thai. Ordered the Thai tacos, Mango Thai Basil-Chicken and Lemongrass chicken. Perfect for 2. Sweet mamasan waitress took our order :) ample seating, great for groups.", "author": "Corinne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "The food is great! The service is quick & they're very friendly. If you're a Haight local this is a gem. One time, I even came in 6 minutes before closing & they graciously took my order. Enjoy!", "author": "Candice N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-13", "description": "The tofu pad thai was so bland I think they may have forgotten the sauce. I had one bite and couldn't finish it, it tasted like nothing. Would maybe be willing to try again since this place has pretty decent reviews but completely unimpressed by the pad thai.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "Thai food rarely wows me, and I rarely crave it. When I do, I usually stick with my go-to pad thai or potato curry. Went with the latter this time, and it was very creamy (full of coconut milk, I'm sure). The soup that we shared was also very creamy, and even though coconut milk isn't dairy, it still turns my stomach the wrong way. So I had a bit of a tummy ache that night :( But food was pretty good - just nothing special.", "author": "Kathy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "My favorite Thai restaurant in the neighborhood! Good value for money, amazing service and yummy food.", "author": "Mar R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "Came for dinner and our food came out within around 10 minutes which was very nice because we were in a rush to go to a show (obviously not a good idea to sit in and dine when you're on a time crunch but whatevs!). Good the coconut pad Thai and the half moon bay sugar pumpkin curry both with chicken. The coconut pad Thai was sweet from the coconut milk they put it in and the noodles aren't the usual thin rice noodles but rather the wide kinds, an interesting surprise! It was good overall. The pumpkin curry had a good kick to it, just slight but yummy. Lots of pumpkin too! I'd come back :) they seem like really nice people too!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "When I used to come here many, many years ago, they made a crispy Thai basil chicken (not the wings). It was to die for. PLEASE bring it back", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "The waitress was super nice, gave good advice on what to pick. The price ranges are from $8-18. Good for medium parties. A good place to go if you are around the Golden Gate Park.", "author": "Florence D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Some of the best Pad Kee Mow we have ever had. Veggie curry great too. Server hustles and is very friendly. Love the Thai iced tea.", "author": "Kathryn P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-09", "description": "They surprised me every time I came here, either for lunch or dinner. \nEnvironment: It's clean, not so loud. For sure you would see a lot interesting people on the Haight.\nService: friendly and lovely. Most of time there are 2 people serving, so the service is quite slow during peek hours, but absolutely not lousy at all.\nFood: amazing! I have difficult time to decide what I want to order here because everything is so good, like home cook. Some spectacular dishes I have tried:\n- Northern Curry Egg Noodle (Kao Soi)\n- Coconut Pad Thai: it's not regular pad thai, it's more than that, with very great curry sauce\n- Grilled Beef Salad\n- Panang Curry\n- Green Bean Prik King\n\nI will come back, surely!", "author": "Phuong P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "We love this place. Been going to this place for past 6 years since very close to where we live and enjoy their delicious dishes every single time. Highly recommend!", "author": "Punit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Glad we came in! Food came out fast, thai tea was great. Mango tofu and pineapple chicken were good as well. And it was affordable! \n\nWhat really made it was the service. They were very nice, accommodating, and helpful! And filled up out water a lot :)", "author": "Bayley S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "I had the pad se ew with chicken. Probably the least tasty pad se ew I've ever had. 0% flavor. Just finished the meal and I'm pretty bummed.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Healthy clean fresh tasteful lunch!! The best Thai I have been to yet!! Fresh local seasonal ingredients infused with the traditional Thai cuisine! The owner was our waitress, she was very friendly and knowledgeable and proud of her restaurant! Highly recommend this restaurant!", "author": "Sandi I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "Came with a group of ~15 on a Sunday night (~6pm) and surprisingly it was empty. Great service overall.\nRoast duck fried rice is so good here. Coconut soup was also delicious.\nWould come again.", "author": "Elisa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "During our family vacation to San Francisco, we found this place using the \"Around Me\" iPhone app when we were walking Haight Street on Wed. August 5, 2015. In fact, it caught my eye because I though they might be related to Lotus of Siam in Las Vegas where I've dined before. Turns out, it is not related - but who cares? This was a wonderful Thai dinner!\n\nI started with the Hot & Sour Soup and ordered it extra spicy. They repeatedly warned me that it would be extremely spicy, but I paid no heed and said \"bring it on anyway!\" Actually, they were right - it was delicious, albeit extremely spicy as they warned.....I ate it all anyway, and my sinuses were completely cleared :-)\n\nNext was the Crab Fried Rice. Just awesome. Fresh and fluffy...it felt very healthy. \n\nMy wife hadn't had Thai food before, so she ordered the Chicken Curry Butternut Squash since it sounded simple and familiar. She totally loved it.\n\nThe service was excellent too. Two ladies served us, one of which was \"Nart\" the owner. Both ladies were extremely nice and attentive. We were there early in the evening, so it hadn't gotten crowed yet, so I don't know if we would have gotten the same attentiveness if they were really busy. \n\nAll said, this was a marvelous dinner - we'd go back again in a heartbeat next time we're in San Fran!", "author": "Darren L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "We had the chicken panang curry and the chicken pineapple fried rice. Both of them were amazing. Specially loved the latter. The place is very clean and the people who work here are super nice and friendly.", "author": "Joyeta S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "My go to Thai spot in the Upper Haight, I love everything but can't stop getting the Emerald Curry.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-02", "description": "Service was very slow, they ran out of flat noodles and chicken wings and Food was very salty or so bland. Clearly, their was no balance of flavor unfortunately. This restaurant is a very Americanized Thai restaurant and is definitely not authentic!! My family and I ordered the pad Thai, basil chicken, duck fried rice and spicy eggplant with fried tofu. The pad Thai wasn't even orange In color and it lack that depth of flavor other Thai restaurants have. Originally we ordered their chicken wings, but they came back 20 minutes later saying they ran out so instead we ordered their Basil chicken. BIG MISTAKE! The chicken was too salty that it was almost unpalatable. The spicy egg plant with fried tofu was a huge disappointment, Panda Express version of eggplant and tofu taste so much better!!! There again lack depth of flavor and spicy. And the eggplant looked like it was boiled rather than stir fried. The only dish that was mediocre at best was their duck fried rice. They had ample amount of duck in their fried rice. However way too much 5spice!", "author": "Roseanne V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "I really loved my experience here, came to have a late night dinner with my boyfriend and we were welcomed even tho the kitchen was closing in 15 minutes.  I ordered drunken asparagus noodles and and the roasted duck it was a delicious blend of orgasmic flavors,  sheer poetry.  I highly recommend this place and will definitely be returning on my next visit today San Fran.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "For what it is and where it is, this place is awesome. The food is all fully flavored and the portions are fairly large. The place feels like a neighborhood restaurant and the service is always really kindhearted. \n\nAll of the curry dishes are good. I have had them all and the Emerald Curry with prawns is by far my favorite. I have never had a bad bite of food here ever. The appetizers are all great. I love the Thai tacos, fried shrimp rolls and the golden triangles.\n\nThis place is a great spot to go grab a bite to eat in a relaxed setting, but it also is a great spot to pick something up when you don't feel like cooking and want something relatively healthy..", "author": "Ben M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "I've come here several times for lunch with colleagues. It was highly recommended and now I know why. The food is fantastic and the service is great. They are incredibly friendly and the food came out rather quickly. I've had the sticky garlic pork. WOW. This is always a go-to dish for me at Thai restaurants, and this might be one of the best I've had so far. Excellent quality. Lots of toasted garlic which was meant for both flavor and decoration! The sauce was so lovely. I could just eat that sticky pork glaze without the pork over rice alone! A must-try! I also enjoyed their prig-king with pork. Also very tasty... some heat as well! Each of these dishes come with a house salad. The \"rice plates\" are mostly $8.95. Definitely a good spot for a quick and delicious bite in the Haight!", "author": "James Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-13", "description": "I came to eat here with my boyfriend and a friend. It was still early for dinner, but we decided to eat anyway.  I ordered a Thai iced coffee and the pad-see-ew.  Upon ordering, they advised that they ran out of the thicker noodles.  That was a huge disappointment.  Especially since it was still early for dinner.  So, they offered to use the thinner noodles. I said ok, because I was really craving for the flavor of the pad see ew. \n\nThe Thai coffee was filled to the top and seemed a lot stronger than most Thai places.  I had to request more milk or half and half.  \n\nI guess the thicker noodles make a difference in the dish? The dish was lacking that nice stir fry flavor.  I don't know if it's because the thinner noodles are more moist when cooking?  Either way, the dish was a bit bland for my taste and it made me regret agreeing to substitute the thicker noodles.  I should have just ordered something else.\n\nI'm not normally in the Haight area, but I think I'll give another restaurant a chance instead of coming back.\n\nService was good, although when one of the ladies brought us plates, one of the plate had some rice residue stuck in the center.  I guess they don't check the plates to make sure it's really clean after they wash it??", "author": "R. A. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "This place was great, server was amazing they made great suggestion!! Ask for server name Minnee and Bly, she's really nice! I ordered pad see ew and shrimp rolls with ice coffee, which was strong!!!", "author": "Mo I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "I was craving Thai food and this was just okay. I had the veggie pad see ew. Very friendly service!", "author": "Maggie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Though the signs said that there are only two people in the back and service might be slow, they were really quite timely with our meal. Ordered the street corner pork, which had a spicy dipping sauce that had an awesome kick to it. Definitely worth a try for an appetizer. Extremely friendly staff, flavorful food and nice ambience.", "author": "Abe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "My second time eating here! Recommended by a local crystal shop owner. \nService and food are always great. :)", "author": "Victoria D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-19", "description": "Good service, but the food was very \"American Thai\". I missed some authentic thaifood there.", "author": "Camilla J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-07", "description": "The food was all really good. My only hangup was the two pubes I found in my noodles. At first I was like whatever it's one pube. Then I found another one and couldn't eat anymore and didn't take my leftovers. \n\nPube me once, shame on me. Pube me twice...shame on you Siam Lotus. Shame.", "author": "Skylar N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-21", "description": "I just bought a tom gai kai soup at this place to go, worst Thai soup experience ever. $10.50 for a 2/3 full round plastic soup container with 6 pieces of chicken and a few mushrooms, ridiculous rip off with all due respect. Several ingredients missing like snow peas etc. I'm doing a social media campaign against this place unless they fess up..", "author": "Steiner A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "We have tried more than 10 Thai Food restaurants in the city and NONE have come close to Siam Lotus in terms of quality and flavor. We have also been to Thailand several times and experienced authentic Thai cuisine and Siam Lotus definitely delivers similar quality and flavor profiles in so many of their dishes.\n\nThe location in The Haight is a bit grungy, as per the usual for this location, and the physical space itself is average but the food combined with the hospitable service will inspire you to come back time and time again. The staff aims to please, and the owner/chef will wow you with all of her dishes.\n\nSome of our favorite items:\n\nLarb Gai (Chicken Salad): amazing flavors and very fresh!\n\nPenang Curry: great with any protein, this dish is rich in flavor and very tasty!\n\nStreet Pork (appetizer): grilled pork with immense flavor, some of the best I've had!\n\nPricing is reasonable and it's easy to get a table. Give it a try!", "author": "Bryant W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-13", "description": "Small little Thai place in Haight.\n\nMe and my friends were just looking for some Thai food and we came across this little hole in the wall. We were the only ones in there so we got served pretty quickly. I ordered the garlic chicken with rice and my friends had some tofu and fish dishes with noodles. I ordered mine medium spicy and it def wasn't spicy enough for me. But the food was pretty good and the price was decent as well. We ordered the fried tofu too and it was pretty yummy... like the dipping sauce.\n\nDon't get the Thai Iced Coffee..it's way too sweet.", "author": "Krista S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-11", "description": "Delicious. Everything we had here was wonderful and delicious. The server was sweet, and knowledgable of the menu. The food was good quality, and was made with love. The ambiance is okay, and there are many cool things to visually stimulate you while you wait. Excellent.", "author": "Aloysius A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "This place is great, the ambiance is very nook like. When we arrived the place was pretty packed but we got seated fairly quickly. \nI ended up ordering a beef and mint salad, the beef had great flavor and the portion was perfect. But what I didn't like was that the marinating liquid that seeped all the way to the bottom which was crazy salty. To finish off I ordered their coconut ice cream which I fell in love with, highly recommended if you're a coconut lover. (Which I later found out they buy from Mitchell's) \nOverall service was good, and we ended up staying past closing time and never did they rush us to leave, so I greatly appreciated that.", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "Great tasty food, good prices, very friendly service, big portions... My Thai place in SF from now on!", "author": "Pierre R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "Yum! It's a little, unassuming place - clean, quiet atmosphere, could seat maybe 30. It was about half full when I was there. \n\nThe server got to me promptly, and I chose one of the chef's specials, the drunken asparagus noodles with beef. The dish came out quickly, which was good, because I was sort of in a hurry. Don't get me wrong, though: it was clear that it hadn't been waiting in some big pot under a heating lamp, and that they made it to order.\n\nThe rice noodles in the dish were just what you'd expect: wide and somewhat chewy. The vegetables were also good - the asparagus with the bell peppers was a good mix. Really, though, the beef was the best part. I don't know what it was about how they cooked the beef, but it was just right. When I go back, I'll be sure to get another dish, but I'll have a hard time not choosing beef again.", "author": "Riley A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "I love this place. The staff are personable, they care about your experience and want to make sure your food is how you like it. My go to is the panang curry- probably the best I've ever had.", "author": "Karly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "Oh well, i've tried so many thai restaurant, and by far, siam lotus is still my first choice. I've tried almost all of their food. And since most of them, or all of them, is delicious, it usually takes me a while to pick my favorites. These come to my mind first though:\n-northern curry egg noodle \n-tom yum fried rice\n-lap tao hu (tofu salad)\n-sticky garlic (beef is the best choice)\n-tom yum noodle soup\n-mango with black sticky rice (you have to try this!!! Your experience isnt complete unless you end your meal with this dessert!!!)\nBy the way, their coffee is amazing. I dont normally like thai coffee cuz its sweet, but their coffee has just the right amount of sugar.", "author": "Alan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "I had a day to kill in Haight Ashbury and stopped in here for lunch on a whim.  So glad I did. Small and quaint dining room. Clean and lots of space between tables. It was a slow paced weekday so there were only a few other diners. Service and food were excellent!   I had the Panang Chicken Curry and it may be the best I've ever had.  Large portion served as a rice plate was perfect for one.  And delicious!  Spicy but not nuclear.  My lips had a nice lingering burn that was quite satisfying.   Great Thai food. Wish I could come back with a group so I could sample more dishes.  Maybe on my next trip to San Francisco.", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "Thai food is almost like the Asian equivalent to pizza for us Americans... it's total comfort food. It makes you feel warm and fuzzy inside. And even when it's not perfect, it really hits the spot.\n\nMy friends and I were in need of some nourishment after (timidly) dancing around Amoeba for a free show put on by Thievery Corporation's Rob Garza. We were not shaking our butts as enthusiastically as some other concert-goers, but we were still feelin' it. \n\nSiam Lotus is a cozy little bistro in the midst of the madness that is Haight-Ashbury. It's a quiet refuge from the manic streets outside its glass window. I felt relaxed immediately after stepping inside. How very zen a place can feel upon first glance. \n\nThe food was yummy. We opted for three different types of curry. I ordered the Tofu Curry, and it was delicious, albeit a bit too mild for my palate. I like it to burn, baby, burn. I shall have to specify to make mine at least medium spicy. \n\nMy favorite part was the fresh coconut water.... served in whole coconuts! They just crack a hole in the top and stick a straw inside. Amazing! Not much actual liquid inside, but the presentation was quite standout.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "This place is one of the best Thai places that serves one of the best pad thais- hand down. I was starving after a day of running errands and I remember going to this place a couple of years back in Haight and it was pretty good , but I couldn't remember the name. I kept looking up Thai restaurants but nothing. Until I found it yesterday and it's still as good as ever! I ordered the pad thai with shrimp and I for some reason thought the shrimp were going to be these dinky morsels that other restaurants use but no the shrimp was gigantic and although the portion looked small on the plate- it actually was quite filling and I left with left overs. All in all - 5 stars ! Bonus: They have a cute waiter but I don't know his name because he wasn't wearing a name tag.", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Truly amazing! This is a charming restaurant with a mom and pop feel to it. I've been here twice for lunch and the staff couldn't be friendlier. It's now my go-to when I have a craving for thai food.\n\nThey also have several vegan options on the menu. Actually, I think most of their menu can be made vegan by request (just sub meat for tofu and ask for no egg and fish sauce). I always get nervous that restuarants still use fish sauce in their vegan/vegetarian meals, but the waitress (possibly owner) assured me that she understood and that everything would be made vegan.\n \nIf nothing else, try the Eastern Thai Veggie appetizer (it will blow your mind). I've also had their pad thai, pad see ew, green bean prig-king and red curry, all of which are great and highly recommended.\n\nI really can't think of anything bad to say about this place. Oh yeah, I just wish it was closer to my apartment!", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-05", "description": "I love this place! I love that the chef comes out in her white chef's hat and asks if everything is okay? What can she do to make it better? How are the flavors? She really tries and gets to know her customers and explains to me how it is back \"home\". I've never been to any other restaurant where the chef comes out  and does this. Its so personable that it keeps me coming back.  From the looks of it all her regulars love her and the restaurant just the same!!!\n\n5 stars alone just for the chef!!!\n\n5 stars for the food. Everything is delicious.\n\n***Standouts***\n--Northern Curry Noodle\n--Roti w/ Curry\n--Golden Triangles \n--Lap To Hu -- Eastern Thai Veggie\n--Golden Curry with Tofu (Very popular at the restaurant)\n--Pad Kee Mao with Tofu (My favorite Thai Dish)\n--Wild Cod Emerald Curry (they can make it vegetarian with tofu!!!)\n\n***Standouts not on the Menu***\n--Emerald Curry Fried Rice!!! (My all time favorite)\n\nIf you are looking for authentic food this is the place to come!!!\n\nSide Note: I hear they have the best Pork Kra Pow (Thai Basil)  in town!!!\n\nWith all these yummy foods, whats there not to love!!!\n\nP.S. Happy Hour Beer is $2!!!! From 5pm to 7pm!!!", "author": "Amber D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-29", "description": "First time and last time here. Staff was very friendly and helpful. But the restaurant and its food are old and tired. Cheap eats for sure. I had their standard pad thai. Had I not been super hungry I would not have taken more than a couple bites. There was really no flavor and its presentation was just a blob of noodles in a bowl. Obviously it has beeb around a long time so a lot of people must like it.But I will pass on a second try.", "author": "Jim P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "It is true.  This really is the best Thai in The Haight.\n\nThis nondescript store front blends into the neighborhood so much so I walked past for years and did not stop.  It was not until I was actually staying in this awesome neighborhood that I noticed this place.\n\nThis was our annual trip to SF.  We discovered this gem last year.  This year we went 3 times and each visit was more delicious than the last.\n\nWe brought a friend, a native and he was like, I have never....\nThen we ate and he was like, I will always....\nIt is THAT good.  And that fresh, and THAT affordable.\n\nI have tried most of the menu and I have not found ONE dish that did not dazzle. \n\nI have never even felt an ounce of disappointment.\n\nAnd when all the cool restaurants are busy or if it is Saturday night at 7 you can always find a seat!\n\nJust know I know my Thai and this shit is BOMB.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Came in here for a quick thai fix. The waitress was really kind and attentive! I ordered my usual, Pad Kee Mow, and my bf ordered the Tom Yum Noodle Soup. They asked us how spicy we want it on a scale of 1-5. I picked 2 to be on the safe side. I can tolerate spiciness but I want it to be enjoyable. My boyfriend chose 1. Our food came! The Pad Kee Mow wasn't amazing but it tasted healthier than any of the ones I've eaten. The level 2 spiciness only has a tiny kick. I think I could've went for the 3. I just added the hot sauce on the side to match the level I want. My boyfriend's Tom Yum was delicious! It had a sour-y kick to it like most others. His level 1 spiciness wasn't detected at all so you didn't taste it at all. \n\nIt is at the pricier side for a meal for two. Both were roughly $10.95. Overall, it was good food in a quiet place but the price may be the deal breaker.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "So it all begins with a failed (and frustrating) attempt to go to the Now and Zen free concert...\n\nLong story short, my boyfriend and I got separated from our friends and while they were able to get into the concert, we were not.  To make matters worst, we carpooled with a friend that got in so we were pretty much going to be stranded until the concert ended.\n\nSOOO of course, instead of moping around and being sad that I was going to miss live performances by One Republic, we decided to look for a place to sit down and eat.  With zero expectations, we stumbled into Siam Lotus.\n\nWe ordered the papaya salad, tom kha, a yellow curry, and some mango curry special thing.\n\nTHE TOM KHA WAS THE BEST TOM KHA I HAVE EVER HAD IN MY LIFE!!!!!!!! So so so comforting, creamy, and delicious!  It was also the first time I had papaya salad and it was good!  Curries were tasty as well.\n\nTLDR; no free concert but an AWESOME DELICIOUS COMFORTING MEAL.", "author": "Maggi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-20", "description": "I ordered Veggie Pad Thai and I was pretty impressed. Stopped for lunch with a few friends and we had a really positive experience. The waitress was nice and attentive, granted it was not really busy so she didnt have much to do, but I would still say that it was more positive than I have had at countless thai places. \n\nI would def stop in again for a reasonably priced meal.", "author": "Jennifer S. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "restroom is for customers only LOL - so i sat down and ate..actually the only REAL restaurant in the Haight and Ashbury district...\n\nI ordered Pineapple fried rice..typical order ..but amazing taste and presentation!! i loved it . Good service and not expensive at all..\n\nI totally recommend this place...i dont live in SF but will come back here when i go back!!", "author": "Gisselle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "This is always our first stop in the district before an afternoon of shopping. It' s such a cozy little restaurant with such delicious food.\n\nTry the coconut soup as opposed to TOM YUM especially if you like cilantro.. it's a warm and very flavorful start. This last time I had the butternut squash massuman curry with chicken and it was soooo good. I also recommend their coconut prawns, my sister ordered them, and it too was cooked perfectly. \n\nThe servers here are always quick and very attentive, and the prices are great for the quality of food you get. \n\nA definite must try if you enjoy Thai.", "author": "Lynn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-30", "description": "I found a note to myself to review this place.. problem is... it's been over 4 years since  I've been there (yeah, it's an old note) that I can't remember what I ate. \n\nKnowing me in 2008, I'd venture to guess that I had the Pad See Ew, and that it's super delish. \n\nI do, however, remember that I loved this place... so much that I was always trying to get Patricia to go with me. Of course, she always convince me to go somewhere else since there are so many other options in our hood.", "author": "Charlie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "Went here for dinner with friends and it was delicious!\n\nOrdered the Pad See Ew, Cucumber salad and a pitcher of beer - hands down the best pad see ew I have had in the city! Just the right amount of chicken and broccoli. \n\nWill defiantly make another visit!", "author": "Stephanie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Definitely the best Thai food on Haight. I would probably give it three and a half stars, but based on its superiority over the nearby competition, four seems appropriate. \n\nService is friendly and attentive, almost to a fault. Sitting by the window guarantees some interesting people watching as it's by a somewhat sketchy corner of Haight. Anyways - the food! Probably the best pad see ew I've had in the city. Perfectly flavored, delicious fried tofu. The Thai iced tea is delicious and the prices are all quite reasonable with a good specials menu. Looking forward to trying all of the curries.", "author": "Courtney A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-16", "description": "The food was just alright, pretty bland actually. I went because Ploy II was closed. \n\nThe service was TERRIBLE. The two waitresses working that night walked past us over and over without seeing if we needed anything. It was not that busy. Everything was slow and they were acting as though we were burdensome.", "author": "diane b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-05", "description": "Had lunch here before an afternoon of thrift store clothing shopping.\n\nEverything was fine.  I had the pad thai, wife had thicker noodles (pad see ew?), friend had curry.", "author": "Frederick H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "Absolutely DELICIOUS! We were walking through the haight and looking for a place to sit down and eat. Yelp helped us find this gem. WOW! What a surprise! The food was outstanding. We had 6 people in our party. We each ordered something different and everything was amazing. I personally had the coconut soup and the coconut pad Thai and added bok  choy, both were the best I have EVERRR had! Highly recommend!", "author": "Saria F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "Siam is a very quiet little thai place with a friendly wait staff. There isn't a scene at this place just a simple little restaurant. I really liked Siam and would definitely go back if I was in the area. We had the mango and salmon w/ pangang curry and the pad see ew with chicken, both were solid dishes. The folks that serve here are really nice. We had their thai tea, very caffeinated but had a very bold taste. Overall, solid experience.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "Really good Thai food! Haven't had some truly good Thai in a long time, this place is authentic and actually makes it \"Thai spicy\" when you ask for it so be careful. Had the panang curry and it was delicious. Small place but does the job. Enjoy...", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "We went for the gluten free menu.. .and what we got was the sweetest woman ever to serve us. She was so polite and made some addition suggestions to items that weren't on the menu. You can tell that she was having a great day and that she has some stake in the business. It was absolute pleasure seeing her enjoy herself. \nI don;t get down to the Height that often... but I will come back just for kicks.", "author": "Kathie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "Sticky garlic chicken.... 25% chicken, 75% brown rice. Still pretty good.  Don't pair with an IPA. \n\nThis is actually my new favorite place for thai in the city. I even like it better than Lers, because this place is less pretentious and the flavors of their dishes are better. Its like the perfect delivery thai. The perfect, \"I am in sweats and its finals and I hate all of you and have thrown personal hygiene out the window\" kind of thai.*\n\n*Thats not why I was there.", "author": "Emily D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-11", "description": "LOVE this place. \nStaff=Awesome \nFood= Awesome (OMG Try the duck salad even if you are on the border of liking duck or like me who used to say, \"I only like duck when it is in French food\"-Duck salad is NOM NOM. \nLocation=It's in the Haight\n\nMy Thai friends had been visiting the states for awhile and were missing good Thai food. I brought them here and they were both VERY happy! I guess other places they had been to  just didn't live up! \n\nI used to go to Ploy II but Siam stole my heart a long time ago. I also used to live around the corner and sometimes will drive back there just because it's that yummy. \n\nWhat more can I say to convince you to go? Oh yeah, $2 beer for happy hour that I think ends at 7pm. \n\nNuff said", "author": "Kat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "When I want the perfect cup of Tom Kha soup, I drive down from Marin county to get it here. I've been doing this for about 9 years, off and on. Wonderfully balanced, not too spicy and not too sweet... it's a little taste of heaven. I've never had to wait, the staff is always kind and courteous and everything I've tried here has been fresh and fabulous.\n\nThe Phad Thai is excellent - not sticky, perfectly cooked and the recipe is pretty authentic. The Spicy Eggplant is fabulous - great texture, rich and satifsying. The Pumpkin Curry is wonderful and if you really want to treat yourself, the Mango Salmon Panang Curry is nothing short of remarkable. The only thing that is a little bland is the Thai Iced Tea, but I'm not really complaining. \n\nPricing is standard. Ambiance is nice - even though it's a lively restaurant with most of the tables full, you can still have decent conversations over dinner and not have to strain to listen or speak. Overall a great experience, fun for family dinners or visiting with friends. Fresh ingredients, perfectly cooked, gourmet flavors that sing to your palate in a friendly, laid back atmosphere that will have you pleasurably hooked from the start. Don't pass this one by, folks.", "author": "elizabeth d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-12", "description": "I'm sorry, but there's much better Thai to be had all over the city, and even on Haight Street, and even in the Upper Haight, and even on this very block.\n\nI'll let Alyssa G. tell the story because she's much more succinct than I am--and I'm not trying to be, really!--but I'll second that it's a poor replacement for Ploy II, teenagers who wear too much eye makeup aside.\n\nIt feels very well worn.  Everything.  The tables.  The chairs.  The menus.  The menu.  The food is all right.  It's not spectacular.  It's not atrocious.  It's not Ploy II.", "author": "John S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "Siam Lotus Thai Hot and sour soup balances flavors to produce a pleasant and tangy treat. Vegetables al dante, fresh. Excellent warm up for Holiday shoppers or browsers dodging the coastal crud.\nWe ordered several appetizers, enjoying them along with the green papaya salad.\nThe real star of the meal was the Savory Mint Roast Duck. Having cooked numerous duck dishes at home recently, I am well aware of how rich the meat is. Siam Lotus serves this dish up lightly chilled, boasting a blend of freshly chopped herbs, not yet set long enough to bruise, a hint of citrus, minced fresh roots and savory baby greens. The texture of this light and fully flavored course is accented with parched rice, ground peanut and crispy wisps of duck skin. While rich in flavors, this is a light dish. Nice surprise.\nI am inspired to treat my next homemade duck to a twist of Thai.\n\nDid I mention the service was fabulous, modest and friendly. The chef came out to answer our questions, allowing us to tell HER how much we enjoyed our meal.", "author": "SF D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Solid Thai food. The waiters are knowledgeable and friendly when it comes to honestly answering questions or offering suggestions. Food was spot on, perfectly portioned, sufficiently seasoned, and fantastically flavorful. All the noodles in the Pad Thai were perfectly coated in goodness (none of that silly business where the noodles are all clumped together and the seasoning/sauce does not reach each strand, lol). Can't wait to come back and try more of their menu!", "author": "Tuwie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-04", "description": "The crab rice is amazing! I love how the crab does not overpower the rice and how the jalapeño adds a bit of a kick. I also had the level 2 spicy pad Thai. It was good but not spicy. I'll probably go for a level 4 or 5 next time. The service was great. Can't wait to go back!", "author": "Gaby P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "Ate here last night (Saturday); I think they may have been unusually busy so the hour-long wait from being seated to being served may be abnormal. But there can't be any excuses for that coconut pad thai! It's one of the most disappointing things I've ever eaten at a thai place; just boiled large flat rice noodles and a bland curry sauce (ordered medium spicy) with a handful of bean sprouts. Maybe it would have been less disappointing if it was just labeled curried noodles, but I was expecting something like pad thai. Not stir fried, no peanuts, no egg, hardly any flavor or texture, and I was ravenous after the hour long wait, so it probably tasted worse than I experienced it! My husband ordered mango chicken or something like that and it was much better than the coconut \"pad thai\", so maybe just don't order what I did.", "author": "Holly A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-02", "description": "Eh - don't eat here. It's not terrible and you won't want to walk right out - but an order of Pork Prik Khing just tasted like fish sauce. It was edible and it wasn't bad - the ingredients were good quality - but it certainly wasn't an interesting or developed flavor. Save your money and time and go across the street to Ploy II - much nicer ambiance, better prices and MUCH better flavor.", "author": "Emily K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "Had a great dinner last night at Siam Lotus.\nThe place is simple and casual, cordial waiters and fast service.\nLet's get to the best part: the food. I ordered a plate of chef's best noodles with beef, asparagus, peppers, thai basil and some other seasonings..it was a really good choice. If I had to say one thing was wrong is that the asparagus weren't much cooked.. but it's still a 5 star for me.\nI'll be going back.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-31", "description": "Other than the fact that I like Thai food, the reason I entered this place was because they had a restroom and I needed to use one badly. \n\nI was thus pleasantly surprised when I tasted their Pad Thai. It is seriously one of the BEST pad thais I've had in the US.", "author": "Melissa A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-29", "description": "I was meeting a friend for dinner and we had originally chosen Ploy II, without checking their hours. Unfortunately, Ploy II is closed on Mondays so it was time for plan B. Siam Lotus is just down the street on the same block, which made it very convenient to find an alternate Thai eatery. \n\nOn this particular night, Siam Lotus got a moderate amount of traffic while we were there. Most of the customers were in and out in about 30-45 minutes, which means service is relatively quick.\n\nI tried the Emerald Curry - green chicken curry with eggplant, green beans, bell pepper over white rice.\n\nThe menu is fairly straight forward, authentic Thai cuisine. The serving was appropriate, I was able to finish my whole dish. \n\nThe servers go around giving water refills often, so our glass was never empty. As a plan B, it was a great choice.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-14", "description": "Very popular, local Thai off Haight St. Their Pad Thai is a good choice, so is the Garlic Chicken, and Golden Curry. If you're in the neighborhood, it's a great option as a casual fare. The service is good considering how busy this place gets, I've seen lines up to the door. It's a great place to catch up with friends, and I always get their Thai Iced Tea! If you are in the neighborhood, try it.", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "Authentic Thai food in the Haight! I'm very impressed with the food here. We love every dish we ordered tonight. Some hard-to-find dishes include Khao Soi (egg noodles in curry sauce) and Kanomjeen Namya (rice noodles in fish curry sauce). \n\nKhao Soi is a Northern Thai dish. It's topped with crispy noodles, making the presentation so grand. Kanomjeen Namya is very unique here. The noodles are topped with a big fillet of salmon. The curries here are seasoned well with herbs that most Thai restaurants tend to ignore. \n\nWe also love Larb Duck, Som Tum with grilled chicken and Tom Ka Gai. There're so many other dishes to try. I finally found a great Thai restaurant in my neighborhood!", "author": "Saran R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-17", "description": "Good Thai food. Definitely more Americanized but still pretty good. Wasn't asked for spice level preference and the staff seems a bit rude. Would still come here again if in the area though.", "author": "May K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "We were walking along Haight street and came upon Siam Lotus. Since it was\naround dinner time, we thought we will give it a try. There was a big group seated on one side and our server told us that he couldn't take any more orders until the big group had been served. We were very hungry, but decided to wait anyway. He brought us our wine and told us it would be 15 minutes. We decided to give him 30. The kitchen was trying very hard to satisfy their customers. Guess what? 15 minutes later, our server took our order and we did get our food quickly! Kudos to the kitchen staff who tried their best to keep their customers happy.\n\nTried the crab fried rice, panang curry and street-charbroiled pork. All were very good!\nFor dessert, we tried the fried banana with ice cream. Now, this one wasn't top notch.\nI've eaten this for dessert before and I know that the banana used should ideally be very ripe so that it's sweet. The one used here was almost raw and didn't taste very good.\n\nAverage cost for a bottle of wine is $20. A bit expensive for not-so-great wine.\nRestaurant accepts credit cards.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "Very mediocre food. Ordered the lemon grass chicken which tasted nothing like lemon grass chicken but tasted like chicken satay. Other members of my dining party were equally unimpressed. If you need somewhere to eat, this place won't be bad but you will wish you went somewhere better. It's San Fransisco, there is no room for mediocre--do yourself a favor and eat elsewhere.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "This place rocks. Brussel sprout salmon in garlic chili sauce.\nAgain Yelpers led me to a great place.\nIf you like Thai you can't go wrong here.\nNext trip to the Haight we will go back.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "Exceptionally endearing waitresses! Our waitress was so darling. She said she loved working here -- genuinely! That's always a good sign. :)\n\nThe food was a little different than Thai food that I'm used to. I ordered the eggplant with chicken. The sauce was kind of thin and there wasn't much of it. It was very delicious, but I just like eating my rice with more sauce on it. \n\nThe veggies looked really fresh and perfectly cooked, not overdone. I really enjoyed the salad dressing. The summer rolls were alright. \n\nI would give it another try if I'm back in the area.", "author": "Heidi H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "Officially my new favorite Thai restaurant in the city! \n\nCame here on a Saturday night, a little before 6, and we were promptly seated. Thankfully beat the dinner rush because once we received our food, a line gradually started forming at the door. Anyways, my boyfriend and I each ordered a bowl of Tom Yum soup with veggies, the pumpkin curry with brown rice, and spinach noodles.\n\nTOM YUM SOUP- super delicious, loaded with a lot of flavors and assorted veggies, which I loved. \n\nPUMPKIN CURRY- we asked for it to be extra spicy and it had a nice kick. I must admit, pumpkin curry was initially not my first pick for the entree, but I must commend my boyfriend because it was a fantastic pick. This dish also came with a lot of veggies and a decent amount of pumpkin. There was a lot of curry sauce and it wasn't too thick, but not too watery. Just the right consistency, but again like I said, loaded with flavor. \n\nSPINACH NOODLES- this was my favorite dish by far. I dream of these green noodles! It's hard to pinpoint what was so enticing about them, although slightly oily, the combination of the noodles and portobello mushroom just complement each other so well. Definitely a MUST TRY for this place.\n\nOverall, the food was scrumptious, the portions were more than generous, and the service was pleasant.", "author": "Ada C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-28", "description": "Excellent food.\nFresh ingredients.\nCheerful service\nDelightful owner.\nNot to be missed!!!!\nLove it and will be back often.", "author": "Moira l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-15", "description": "I came to Siam Lotus with a few friends after encountering ridiculous waits at the Alembic and Cha Cha Cha on a Friday night.  We were seated right away and I noted that while I had never been to this particular restaurant, I knew beforehand exactly what to expect.  The plain furniture and gold and elephant Thai kitsch decor meant it was the equivalent of every Thai place I ate at in college.  Our dinner was no better and no worse than anticipated.\n\nThe four of us went family style and ordered hot Thai basil with pork, beef panang curry, jalapeno chicken, and chicken pad Thai.  Everything was just fine.  In general, the flavors were pronounced and each dish tasted pretty good.  I can't say any of the meat was great quality, but for a quick casual dinner, the food was definitely sufficient.  My favorite of the bunch was the panang curry, which had a nice little bit of heat.  I also like that Siam Lotus offered brown rice.\n\nService was quick and friendly enough and the restaurant was pretty crowded, if not at full capacity.  I'm sure that better food could have been had, but sometimes you eat at the mediocre Thai place and nobody sheds a tear.", "author": "Steph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "This is the best Thai food in the Haight! \n\nNat, the owner, is super friendly and cares about the food she serves. Alan and many of her servers are super friendly, too.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "Awesome... everything is so good. My favorite is the crispy Thai Basil  chicken wings!!!!", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "For those who revel in the comforts and monotony of predictability, Thai restaurants are usually a safe bet, offering menu staples like Pad Thai, Pad See Ew, and R/G/Y curries. However, it is evident that the chef's skill and creativity are never on realized through these limiting dishes. Imagine having a free throw contest between Lebron and the sharpshooter on your high school team - both would probably make 7 out of 10 free throws, but Lebron's prowess as an all-NBA player can never be displayed in that contest. In the same way, if confined to the same ingredients, a world-class chef and a college freshman cooking for the first time with only a YouTube instructional recipe at his disposal would produce generally indistinguishable Pad See Ew. Thankfully, Siam Lotus's Chef's Special menu showcases the limitless potential Thai flavors can present.\n\nThe Tom Yum Fried Rice's teeming bits of fried garlic and chunks of juicy chicken create a whirlwind of flavors that drive an inexplicable desire to acquire a stock-pot full of fried rice to enjoy for days on end; the Northern Curry Egg Noodle's saturated curry flavor thoroughly permeates the buoyant egg noodles; and the Golden Triangle's crispy outer shell artfully envelopes its creamy mashed potato fillings to make a great starter.  The Iced Coffee is sinus-clearing strong and water cups are never empty.  \n\nSiam Lotus is a must-try for Thai food fanatics!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-28", "description": "My coworkers and I headed across the street to this place since Ploy II randomly closed down for 2 weeks. \ntom kha gai: overwhelmingly sweet\ngolden curry: decent but had no kabocha :( i felt cheated\npad see ew: solid, a bit greasier than usual\nService left a lot to be desired. It did not seem like a busy night but we waited 45 minutes before our order was taken -.- wtf? And another 45 before the first dish arrived. Waters weren't refilled even after I asked twice. Luckily we did not mind people watching, otherwise we would've left..so many colorful characters on the Haight!\nOverall, the highlight of dinner was watching a drugged up man smear ice cream all over himself by the window. Maybe I'll do take-out next time?", "author": "Jenny Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-01", "description": "My favorite Thai spot in The City, hands down.  Everything on the menu is delicious and freshly made.  One of my favorite dishes is the Pineapple Kiss Shrimp fried rice, and I never go wrong with one of the many curries on the menu.\nFamily owned and operated -- the proprietor is a sweet heart and always comes out to chat/ask how the food tastes.  There's quite a few Golden Gate Park inhabitants  that congregate outside and I've seen a couple come in and out of this place, but the staff handles the awkwardness with poise, even going so far as to offer water and a a seat as needed.", "author": "H H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "We've lived in this neighborhood for many years and this place was always someplace that we passed by and I never thought twice about. I overheard somebody talking on a bus one day about how amazing it was. I told my wife about it and we had to stop by. Ever since then we've been regulars. What's most obvious is how much they care about the food and the happiness of their customers. This is clearly a family business.", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-07", "description": "I few days ago I dined at Siam Lotus Thai Cuisine and I ordered golden curry with chicken. I was afraid it would be too spicy so I asked for a sample that I found mild (I'm still building my resistance to spicy food). A few clean plates came to us. When I separated them one had some cooked white rice stuck between them. The curry was good. The size of the portion was neither small not huge. The flavor of the curry was inviting and the white rice was a good match. The chicken was well cooked but the potato was a little undercooked. All in all I liked the food although I did not find it amazing. I give 3 stars because I was not impressed and the plates were dirty.", "author": "X. Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-22", "description": "Ordered the pad thai with chicken.  It was kinda bland, no peanuts, I had to ask for condiments.  Just ok, nothing special.  I by the way spent a long time in Thailand and love Pad Thai.  They need to work on their recipe.  Service was decent.  Nice ambiance.", "author": "Dave A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "I live in the neighborhood, eat her regularly and love this place.  Nart is the owner and she can help you navigate around any food allergies or sensitives you have.  She can tell you exactly what is and is not gluten free, what can be made gluten free, what has nuts or fish sauce or soy sauce - she's excellent.  She cares about the taste and quality, using mostly fresh herbs rather than cheaper dried versions.  This gives the food depth and flavour that is uncommon.  \n\nShe has Thai women cooks in the kitchen because she wants the person cooking the food to know what it should taste like and not just follow formulas.  The pad thai is unusually good, lamb curry is out of this world (and gluten free!), as are salmon with brussel sprouts and the cat fish.  I cannot say enough good things about the staff, food and consistently good experience I have at this place. \n\nPloy 2 may have an edge with their upstairs dining room and assumed trendiness, but their food and service just don't compare with Siam Lotus. \n\nOne tip:  They are closed on Tuesdays because that is the day Nart goes shopping for all the fresh produce from around the bay area.  Makes Wednesdays an excellent day to eat there!", "author": "Kamaljit B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "4 stars for the delicious pad see ew, tasty duck fried rice and great customer service. I'll definitely be coming back.", "author": "Nels A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "Amazing, quaint little thai place.  The food is amazing.  We had the tofu lettuce wrap thing appetizer that was unlike any tofu dish I've ever had.  My gf ordered vegetarian massaman curry that was the massaman curry I'd ever tasted.  She has many food allergies and the woman there knew that soy is gluten as well as where all of their ingredients come from (spoiler alert:  all local).  I ordered the pumpkin curry with pork that was stellar.  We will absolutely be back there.", "author": "David P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-05", "description": "Food was mediocre to poor. I think it may ok if you don't eat much Thai. But if you're a big fan of Thai cuisine like me you may be disappointed. Go to Marnee Thai instead!! It's soooo much better (and prettier inside as well)", "author": "Grace K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "best thai food..\nthai tacos are the best...\ndef coming back. and again and again......", "author": "Claudia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Hands down Best PadThai I ever ate! The butternut squash mussamun curry was different but also very good! If your ever in town definitely check this place out!", "author": "Jordan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Good stuff had the chicken pineapple cashew chili with rice. Awesome! Was starving! In the heart of Haight Ashburry! Saw a couple of drug deals go on through the window. Made for interesting dinner conversation!", "author": "Cecilia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "I walked past this place without even noticing it for years and years until my friend suggested we meet there. Food was delicious! Now I don't have to go to the Sunset or the Richmond for good Thai food, it's right here in my neighborhood!", "author": "Alison S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "High quality food in a very reasonable price - the place is very clean - very tasty - must order the shrimp rolls for starter and the coconut Cary chicken.", "author": "Ed R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "This place is Great!! I am a big fan of Thai Food and I had thought that a restaurant near my home was good but I popped in here one afternoon after spending the day in Hippie Hill and I was Left in awe by the food, The plates have different levels of spiciness, me being the Tough guy I am decided go with a pretty Spicy plate, a few minutes and Man Tears later I was full and Happy. The Staff is very Friendly and made me feel warm and welcomed, the placed is very clean and neat. I definitely suggest to come here if you like Thai Food.", "author": "Johnny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-19", "description": "So a friend of mine from Boston came over and wanted to see the neighborhood. We were feeling rather hungry and found this place. \n\nI ordered the chicken pad thai and a thai iced tea. The pad thai was really good. It looks like they give small portions but that is just because they use plates that are too big. The tea was one of the best I've ever had.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-05", "description": "Pretty good thai food amoungst the many in this part of Haight. They did not have the fat noodles which we all wanted, but we settled for other dishes and enjoyed ourselves. They took a long time to take our order, though, and I wasn't blown away by anything in particular.", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "A colleague and I checked in at Siam Lotus Thai Cuisine. We were the first ones to arrive at the scene. \n\nSeated by the window, I couldn't help notice the \"People Love Us on Yelp!\" sticker. I thought to myself that's pretty kewl... \n\nAfter I settled down, I went with a rice plate, Thai Basil Beef (Kra-Prow) - sautéed sliced beef with chili, garlic, onions, red bell peppers and fresh basil served with salad and steamed rice. My colleague ordered the Golden Curry (Gang Karee) - Chicken in yellow coconut curry with potatoes, kabocha squash, and onions served with cucumber salad and steamed rice. We both requested extra spicy for our dish. \n\nAs we waited for our food, a nice lady approached us from the counter. She noticed that I was taking pictures. Being this area is a known tourist trap; it's not all that uncommon. \n\nShe asked if it was for remembrance sake or for the Internet. I replied with, \"I do this for my Yelp reviews\". At this point I assumed either she was the owner or the manager of the place. \n\nAnyhow, we carried on a little bit of chitchat in regards to food reviews, open table reservations, the economy and such. She pointed out to try their \"Winter Beer Special\" - all tap beer for two bucks a pint! Though it was tempting I skipped the offer. \n\nSoon enough the food arrived. The aroma was fantastic! My beef was sautéed perfectly and the basil took hold of my palate, which was nice. Coupled with the chili, onions, bell peppers and the extra heat it was delicious! The salad complimented the heat just right. As for my colleague, I got thumbs up for the Gang Karee. \n\nSeveral jalapeños and face wipes later, I was very pleased and satisfied. \n\nThe menu offered a variety of Thai dishes and plenty of seating available. \n\nBefore we headed out, the lady introduced herself as 'Nart' and I introduced myself as well. \n\nOverall service was outstanding and deserved an additional star! \n\nI shall return...", "author": "Gary E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "I've been here twice. The first time, I ordered a fried tofu and vegetables dish, which was fairly priced at around 7 dollars. It came with rice and a salad. The taste was alright and unmemorable at best and slightly bland at worst. Then, my friend and I shared a tom yum soup, which for me was a little on the sweet side and not spicy enough. \n\nThe second time, I ordered the mango basil chicken, which I believe was around 8 dollars. It also came with rice and a salad. There were big chunks of mango, which were delicious, but I felt didn't complement the dish very well. The chicken and basil, however, were flavorful and delicious. \n\nI'd come back for the reasonable lunch specials if I were in the area but I probably wouldn't make a special trip here. Overall, the food was quite tasty but not outstanding and the service was just mediocre.", "author": "Joan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-01", "description": "I've lived in the area for 4 years and have always seen this place, but last night I finally tried it.  I am soooo disappointed that I didn't try it sooner, because it was fantastic!  \n\nWhat was ordered: \n-Golden Triangle which came with a sweet peanut sauce.  Basically a samosa, but way better than any samosa I've ever had.   \n\n-Spicy Rice Noodle with beef:  When ordering I asked how spicy and the waitress told me mild, so I asked to spice it up.  For hotness 4 out of 5.  She said, \"are you sure?!!?\" which made me nervous so I changed it to a 3 out of 5.  This was an excellent decision!  It was a great dish, beef was nice and tender, good flavor and spicy, spicy just as I like it.\n\n-My friend ordered the pineapple nuts cashew chicken, without the pineapple.  She loved it and I even got a text today saying, \"I want more Thai!  It was the best leftovers ever!\"\n\nAll in all good service, great food, good dining experience.  One of the more authentic Thai meals I've had in the city.  I will definitely be back!", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "second best thai restaurant in the city of SF! First is grand pu bah. I went through a detailed all over city search for best thai restaurant in 2012 and ate the same thing (yellow curry with brown rice, customized with no potato and both mushrooms and tofu (soft) and all kinds of green veggies) this place was the second best but pretty good.. while the famous names like osha thai, lers ros, thai idea was okish.. disappointing were osaka sushi and marnee thai..  which had so many stars everywhere but was too spicy for my taste...", "author": "Nihit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "Family-owned and operated. The owner, she reminds me of my mom because she is always out chatting with customers and remembers what they like. My family owned a Thai restaurant for 21 years in the city and closed 3 years ago...so finding a place that reminds me of my parents' cooking is difficult.\n\nI love the kao soy they have on the menu and also the duck salad (larb ped). The salad comes with sticky rice, which reminds me of eating on the streets of Thailand, where that is plentiful. Not many places in SF serve sticky rice, and this place does...and does these two dishes right!\n\nA great casual place to bring friends to if you are craving some Thai food.  =) Oh and the mango with black sticky rice at the end of the last two meals I had there...a must. Can't wait to go back again since my mom is in Thailand. LOL", "author": "Siri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Yumm! Very happily surprised. We tried the pad thai, the wok tossed noodles, a salad and roasted duck with fried rice.\nWill go back / order again for sure.", "author": "Virginie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "Heard and read a lot about Siam Lotus, so I was excited to try it.  Food came out quickly and was tasty. Got the coconut Thai curry with pork, but it came with both pork and tofu. I hate tofu, so that ruined it a bit for me.  Drunken asparagus noodles were pretty good.  Food could use a bit more spice but overall a good experience. Service was good as well.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "How had we not seen this place before? We're in the neighborhood all the time, eating pizza, thrift store shopping and going to 2 markets on the same street! Well, we finally tried it last night - hooray!\n\nThe Food:\n\nMy date opted for some coconut pad thai - it was a bit like a yellow curry mixed with pad thai noodles with a little kick (a really little one). He really enjoyed the uniqueness of the dish.\n\nI had the roast duck noodle soup (it's become my test the thai restaurant dish lately). The duck was well roasted - duck is already kind of a generally gummy meat and sometimes cooked to be more gummy - not that I mind, but this was actually little more tender. The soup seemed to have more duck flavor than others I've had that tasted more like duck in chicken soup. The broth was just right thickness between hearty and soupy.\n\nWe left room and ordered mango with black sticky rice because they offered it out of season. (Note to self: when you know mango is not in season, do not expect a miracle of ripe sweet mango when it's offered). They used one of those harder sweet+tart mangoes. Still good, but I still prefer this dish with the soft manila mangoes; guess I'll have to wait until it's back in season.\n\nThere are other interesting things mentioned on the menu I definitely want to try.\n\nThe Service:\nSuper Friendly staff.\n\nThe Parking:\nIf you ride your bike, parking is definitely easier.\n\nBummers:\nThey don't deliver :/\n\nWe'll definitely be back", "author": "Kariz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "Best Thai I've had in years.\nGreat service.\n$2 dollar pints all winter long.\nBest people watching from the front window in the city.\nI love green curry.\nI love green curry.\nI love green curry.\nI had the Emerald Curry and I could have sat there in the same spot, eating curry and drinking pints all week long.", "author": "Sherri K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "This place has great veggie options and is reasonably priced.  I also like that you can order just a small cup of soup instead of a monster portion.  I had the veggie tofu salad and Tom Yum.  Both were delicious and well priced.  In addition there was great service.  I would come again.", "author": "Courtney R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-19", "description": "Food came out super fast and was pretty good. I got the crab fried rice and thought it could've used a bit more salt and spices, but otherwise it was good. Service was efficient as well.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "Great little restaurant. Loved their duck noodle soup and their fried banana and coconut ice cream. My friends loved all their dishes. Definitely highly recommend this place", "author": "B B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Excellent fresh food. Sweet people too. Be careful about your heat level tolerance though. On a scale of 1-5, 3 was a bit too spicy for us.", "author": "Danny S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-03", "description": "WEIRD: my friend ordered the pad see ew and when it arrived at the table, an extremely heavy smell hit us hard; it smelled just like.. DOG. Like your neighbor's Golden Retriever or something! But it was the meat that had this smell. SO BIZARRE; she was so flabbergasted and asked them to make her another one and the second came back; it didn't smell half as strong but was still there. \n\nThat was disgusting and bizarre.\n\nBut I'll give it one more star because MY food, the duck soup was pretty damn good; like pho!", "author": "Cara G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "Great little place. We stumbled inside while wondering around Haight one afternoon and were very glad we did. The staff are incredibly friendly and great and the food is fabulous! I love their Tom Kha soup, best I've had. The coconut curry was exceptionally great and I had a spicy rice dish that was cooked just right. The owner was really kind to us and personally asked how everything was and explained a little about the food. Overall, great food, reasonable prices.\nWe will certainly be back when craving delicious Thai.", "author": "C K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-03", "description": "Wow, a lot of people are giving 4 and 5 stars. Have they not eaten at other Thai restaurants, am I bring a harsh critic, or did I just order the wrong stuff?\n\nI ordered number 30 and my friend ordered a number 27. They're both noodles. One was phai thai with prawns and the other was just thicker noodles with beef and broccoli. \n\nThe food was really good the first few bites, but after awhile, with the door open, my food got cold and began to loose my interest. The food wasn't great. My friend and I found it a bit oily too. \n\nOverall, the food was okay. A little pricier than the other places I go to (such as Chabba on Irving). But I guess this is what happens when you go try new places; hit or miss.", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-17", "description": "It's strange that I've walked passed the store front so many times and just never had the urge to want to try it out. Maybe it's the signage or the the windows don't necessary allow you to peek in and see if anyone is even inside.\n\nThe decor is simply buddha. No purple paint, no photos or illustrations of the Thai king and queen. Not necessarily designed well, but more on the contemporary side nonetheless.\n\nThe menu is extensive and everything on the menu is pretty damn good (curries, noodles, soups). My favorite is the kraw pow crispy chicken. It's on the lunch menu, but usually order it for dinner regardless.", "author": "sally y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "This was the first time I've been here with my friend to have lunch after a bit of shopping in Haight. There are a couple thai restaurants around this area but we decided to try this place because it seemed to be pack and my friend heard that their food was pretty good, so we thought why not give it a shot. \nThe service here is quick because the place is small and they have to work quick since they don't want impatient customers especially since they only have two cooks in the back. So when you eat here don't go crazy because the food might take a bit longer than expected, patience is the virtue. The servers would make sure that you're satisfied with your meal and they would always check your table to make sure your water is refilled and if you need anything else they will be at your service. \nThey also have interesting names on their menu all we got was curry. My friend got the emerald curry which was the green curry and I got the scarlet curry which was the red curry. Even though, the meal titles have unique names I think that's what would bring your attention to the items, I thought the food was delicious because of how the spices went well with one another and the meat in the curry was cooked at perfect temperature along with the rice, plus the dish wasn't spicy as some other restaurants. I would most definitely recommend this place to eat whenever you're in Haight.", "author": "Victoria G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "The atmosphere in here was relaxed when I stopped by for lunch during the weekend. Soft 80's songs were playing and the staff was helpful. There were a variety of lunch specials, I tried the golden curry which I thought was very good. The curry was slightly sweet and not spicy with a good amount of chicken, squash, onion and potatoes in it. Rice, salad and a side of sweet and sour pickled cucumbers were included.\n\nThe food and pleasant atmosphere made for a nice lunch.", "author": "Evelyn T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-09", "description": "Good service! Food is good and good price as well. The tonka soup was great!", "author": "Ibelig V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "To be honest, I was drawn in by the $2 Happy Hour drafts (a great selection including Sierra Nevada, Sam Adams, and Ranger IPA), but the food was tasty and the menu was a bit more extensive than your typical Thai restaurant fare. I had a perfectly sauteed serving of brussel sprouts with salmon that was just the right size for dinner. Dishes are served as either an entree or as a rice plate. If you're sharing several dishes with a group, go with the entree sized portion. \n\nThe service was fast and pleasant, and the waiter was even nice enough to ask whether we wanted additional drinks before happy hour ended.\n\nA great local Thai place. Highly recommended.", "author": "Erik L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Easily the best Thai food I've had outside of Thailand! Food was tasty, not too oily/greasy, and packed with flavor. Great comfort food served in a friendly setting with great service and very reasonable prices.", "author": "C F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-18", "description": "I must say, this was some damn yummy grub!   I had the pad thai, which I know is super boring.  I never order it, but for some odd reason tonight....I JUST EFFING WANTED BORING PAD THAI.   It was the best Pad Thai I've had.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-01", "description": "Nice server. Avoid the coconut pad thai; it's weird. Probably better to go w the normal pad thai.", "author": "Eagan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "When you go to this place you need to just say the following 2 words: mango curry.\nEnd of story.", "author": "Some D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "This place is the bomb.  Beers on tap, not just Thai beer, they have other beers which you never find that in a Thai Restaurant.  And on top of that, the food is soooooo yummy. I'm such a BIG FOOD Critic and this one counts.  A must try.  Definitely coming back. That's right, I said it. Coming back..lol", "author": "Momma J I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "Super, fantastic, yummy Thai food! I consider myself a Thai officianado...... and this is one of the best in the bay!", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-19", "description": "We eat here all the time, and can never seem to get enough.\n\nThe seasonal pumpkin curry is excellent, and their pineapple friend rice is worth coming back for on its own.  \n\nThat they have a friendly staff just tops it all off and makes this place easy to recommend.  \n\nIf you can't eat gluten, you can ask them to make the Pad Thai gluten free and it is delicious!", "author": "S M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-26", "description": "Everything was great until I found a hair in my dish, the waitress only offered me a 20%discount even though I only had like 3 bites. I told her I shouldn't even be paying for the dish and the waitress gave me a hard time for that. Wow. Unbelievable.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Went there yesterday as my wife and I were exploring different neighborhoods in San Francisco.  I eat a lot of Thai food, and have my go to favorites, but this is one of the few restaurants that had lot of atypical menu items that you find in other restaurants. Those items not only sound good, but actually taste good as well.\n\nWhile it's a small restaurant, the tables aren't crammed together like many other places in SF, and the service was very friendly.", "author": "Buddha B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "I came in yesterday for lunch and decided to pick the sticky garlic rice plate with chicken.  The crunchy garlic on top made this dish so good.  I devoured this cuz it was that good!  I will definitely come back.  Prices are reasonable and staff are nice and attentive.", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-08", "description": "Really delicious. I had a specially made veggie coconut pad thai, which was delicious and the rest of our big group of out of town guests raved about their entrees. including mango chicken and a catfish dish. The tom kha gai was as tasty a it gets. Also, I noticed several families here with kids, because it's a family friendly spot.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "I was very happy with their pad thai. I got the shrimp pad thai and it was the perfect serving. I would be happy to come here again, but it didn't stand out as a restaurant I will personally go out seeking. I will mostly likely eat here again as the Haight is a common visit for me.", "author": "Sara H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "Excellent food, fast and friendly service. For Thai food lovers, this place had a few things on their menu which were unique. We had the panang curry with salmon and mango and the salmon was prepared perfectly, while the mango was the sweetest and juiciest mango I've ever had (although this could be a seasonal thing so if you come here other parts of the year it may not be as good).", "author": "Erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "This place is the bomb. I'm actually pissed it took me so long to figure that out and start ordering from here. Even my picky husband, who is quite new to the awesomeness of various Asian cuisines, loved everything we got, from the pork appetizer to the sweet and sour pork (apparently I was feeling piggy that night). I keep hinting that we need to order from here again. It will happen soon!", "author": "Lesly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Freshest most natural thai I've ever had. Highly recommend this place. Had chicken panang curry. Perfect. Friend had salmon mango panang special. He raved.", "author": "William S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "The food here is great but the lame classical music is really annoying. Go to \"We Be Sushi\" and take note of the beats.... always playing something dope in there. \n\nI would most likely get my food to go from Siam Lotus just so I wouldnt have to be tortured by the horrid music..... get it together guys .. you are in the upper Haight ... its a hip neighborhood ... you will catch more flies with dope beats!", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-08", "description": "Thai Cuisine in the hipster land of Height? Can it be? uhhh me thinks not!\n\nJust a couple of college kids, super TIRED and HUNGRY from walking up the GAZILLION hills of San Francisco, looking for a place to eat, couldn't decide on what to eat and decided to try this place. (wish I had the Yelp app on my phone so I could've checked this place out before going in)\n\nThe place is kind of small and cramped. Not too many people inside. The food was hella expensive for what we actually got. The service kinda sucky, and they messed up on our receipts. \n\nI had some soup while my friends stuck with the original pad thai and some other dishes. Honestly the dishes were on the small size and did not look so hip hop happenin'. weird.... you would think Height offered some super authenic Thai food that hipsters can rave about.\n\nNope. My suggestion? skip this place and head over to the nearby pizza place... that place looked much more appetizing AND had tons of people in it. Always trust the crowd, they know what they're doing.", "author": "Aurora P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "We had the BEST meal at Siam Lotus. We're from NYC and there are so many (terrible) options for Thai restaurants here. This was such an authentic experience! The owner recommended us a wonderful noodle dish and a curry dish. Both were so flavorful, with no sugar or grease added. Clean plates, natural and fresh ingredients, great vibe! We loved it! And it's cheap...! A MUST!", "author": "Alexandra J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-19", "description": "Somewhat disrespectful service. Quantity for price wasn't good either.  Mango sticky rice was great however.", "author": "Keith L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "This is our local Thai place.  The food is very tasty, and the specials are good.  We mostly carry-out, but the atmosphere inside is fine. simple but friendly.  Doesn't seem to get crowded often.", "author": "David D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Siam Lotus is my favorite Thai place in all of San Francisco. It is so good, I come here or get take out once a week. Cheap, comfortable, and delicious. Great location in the Haight, and you can always get a table without any wait. \n\nEverything I've ordered here has been awesome: the coconut soup, the green papaya salad, all of their curries....especially the Mas-Sa-mun (peanut-based). My best friend is obsessed with their green curry, hence why we return all. the. time.\n\nTheir Pad Thai (and veggie Pad Thai) is mouthwatering...it's so hard for me to order something more exciting when I know just how great it is :)\n\nWhen I do stray from the classic, the Thai basil chicken is a great choice- fresh veggies and flavorful minced chicken.  Really, the only thing I've had here that hasn't been the best I've had in SF is their Pad-See-Ew. (If you're a Pad-See-Ew lover in this 'hood, head to Thai Place on Divis. The only dish they do better than Siam).\n\nDon't forget to save room for the black sticky rice with mango. If you haven't had this Thai dessert yet- get it here. Please. I dream about it sometimes.\n\nAmbiance and service are nothing to write home about, but they work hard here and allow you to sit as long as you want without bugging you. And on a cold SF night in the Haight, this is one of my fave places to eat and relax! Just delicious!!", "author": "Colette H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Enjoyed this restaurant, this much like any other ethnic food, each has a special way of using the same ingredients and names for dishes but the end result surprisingly different and in a good, beautiful way, The veggie tofu thai salad was amazing and thai tacos filled with chopped chicken spiced with all those Thai herbs and spices wow, all of us enjoyed our meals, from traditional pad Thai to Tom Ka soup, a must return to try other menu dishes... Great job ling, can't wait to get back to San Francisco and visit you all again.", "author": "HJ C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-12", "description": "Best Thai ever and the service is so friendly.  Love the ladies who work there, they always are smiling and despite my frantic ordering style they always get it right!  The place has such a family atmosphere to it and their beer specials for happy hour are pretty darn good.\nMy favorite is their Pad Thai with Prawns and I have them add pineapple. The curries are excellent, especially the lamb, and so is the shrimp roll appetizer.\nEverything is always as it should be here.  I love that I can count on their thai food!  \nThe only compaint I would have, which will not lower the star rating, is that they are closed Tuesdays! And it's Tuesday and I want Siam Lotus.", "author": "J. S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-26", "description": "Decent thai, nothing special. Service was a bit slow as well.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Midday meal, had the mango-basil.  Delicious and unique.  Service was fast and polite.  The Hostess was very pleasant and attentive.  We also tried the deep fried Calimari, but didn't care for it as much.  I don't recommend it only because I've had better at many other places.", "author": "Sharon E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Tiny place, friendly serivce and great food.", "author": "Devangb B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "Excellent food, friendly service and reasonable prices!  One of the best green curries I've had.", "author": "April H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-14", "description": "Holy shit!\n(Can you curse in a Yelp review? If not, then \"Holy sheet!\"  Which is basically like saying the exact same thing, but now with an accent.  Somehow, that passes.)\n-ahem-\n\nSIAM LOTUS THAI CUISINE:\n\nThe food here has the power to change who you are as a human being.  This food is SO GOOD, and SO AUTHENTIC that you WILL BE a different person after eating here.  \nA better person. \nA happier person. \nA wiser person.  \nYou may not walk away from this place all of a sudden now understanding calculus or trigonometry; curing cancer and outsprinting Usain Bolt for the Gold (nice Olympics reference, I know...) -- that's not what I mean by different and better and happier and  wiser. \nWhat I mean is that the way that Siam Lotus' food connects with your taste buds and methodically proceeds to completely envelope every single, solitary nook and cranny of your entire olfactory pleasure center is so much more than 'enough' to render the old you \"old\" and the new you \"new.\"\nI walked in a tired and poor soul.  Lost and looking for meaning.  Or at least a nice lunch and beer.\nI walked out of Siam Lotus Thai Cuisine a rich and energetic soul.  Happy, content, ambitious.  A conqueror of a nice lunch and beer.\nEat here.  You'll see. \nService was attentive. \nAtmosphere was pleasant. \nFood changed me for the better. \nI will go back. \nOh yes, I will go back.", "author": "Carl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "I can't recall everything we ordered, because my mom did all that, but I know their pad thai was OUT of this WORLD!!!\n\nEverything had the right amount of spiciness and flavor. The wait on a Sunday night wasn't terribly bad, but there was one. We just browsed whatever shops were still open at that time. \n\nThey do have some light cocktails there, which are bit on the pricey side considering the size of them.\n\nI highly recommend ordering the Angel Wings, you won't be disappointed with them.", "author": "Jackie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Great food, great service, reasonable prices.  Will eat here again when in SF", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-09", "description": "Went to haight street to do some shopping with a couple of my friends. The drive there made us hungry so we decided to have thai for lunch. There were several thai places around but we chose this place bcause of the great yelp reviews.\n\nWe weren't disappointed. We started out with the shrimp rolls for appetizer. I decided to try their ginger pork dish. Their thai tea was so frefreshing and the dishes we got were really good. We even had room for desert so we ended up getting the mango with black sticky rice.\n\nEven though their service needs a little help, I think they still deserve four stars for the delicious foods!", "author": "Glenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-23", "description": "It was one of those lazy Sunday's where I thought what best would suit my cravings was Mexican food, but when I saw this place, I couldn't go elsewhere.\n\nIn my opinion, nothing fancy-schmancy about the decor, etc, etc, but that doesn't matter at all because the atmosphere is so chill and the food was amazing.\n\nFor ages I couldn't make up my mind when choosing a menu item.  Finally, I went with one of the two lunch menus and decided upon some dish with Tofu, Rice Noodles Veggies, and Coconut Milk broth.\n\nI think it's called something like Lotus Delight.  Anyways, it was so amazing.  Very fresh yummy veggies, a fabulous portion for lunch, and the tofu was so yummy!  I just wish there was a bit more tofu.  Maybe it's hard to pick the wrong thing on the menus, but I knew I couldn't have gone with something better....", "author": "Alanna F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "I love when the people in the restaurant are so passionate about their food, they can recommend the best of the best without a doubt in their mind. I have been to many Thai places on the \"Authentic Scale,\" and this is definitely my favorite. The food was so fresh, fast, an deelicious!\n\n1) Hot Thai tea... So good, served without milk (which was awesome because I'm not a big milk person and the cold tea usually has milk in it, so it's optional here). It was refreshing; I had 6-7 cups because they were constantly refilling ;)\n\n2) I ordered Emerald Curry (Gang Kiew) with Tofu. Could have got the tofu curry but I wanted eggplant! Ordered with sticky rice. Nomnomnom... My aunt doesn't even like eggplant, and she kept eating my dish! That's fine with me, because I love to share.. But she is a picky eater and I'm just saying! Soft tofu, spicy (just the right amount), fresh vegetables, and accompanied with sticky rice. Great dish.\n\n3) My Aunt ordered the something Egg Noodle dish (I don't see it on the menu online) and it was phenomenal. Special northern-style dish that was recommended... Home-made noodles with crispy noodles on top. We had it with beef.. And wow! The flavor, the texture and consistency of the noodles, the beef (my aunt said because I don't eat meat) was all amazing! \n\n3) To top it off, we had the Sticky Coconut Rice & Mango dessert. Now I am not a big dessert person, I usually never order dessert. But the Thai has got it goin' on with this dish, so I order it every time I go out and eat Thai. Ohhhhh the warm, slightly sweet, coconut drizzled rice with a touch of sesame seed, complimented with fresh, chilled mango by the slice... Truly rewarding.\n\nI am definitely going to visit this place every time I visit my aunt in San Francisco. And she plans to get take out from here often. They are green and you can find their menu online !", "author": "Jacque H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-27", "description": "If I could eat a Lotus Bowl from Siam Lotus Thai Cuisine every day of my life I would be so happy.  The lemongrass coconut broth that makes up this soup is to die for.  Always make sure that you ask for peppers to spice up your dish.  The Green Papaya Salad is one of the best I have ever had.  Not only does their food taste fantastic, they present it beautifully on the plate and the service is great.", "author": "Stacey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "I've been coming to Siam Lotus about once a month for the past five years and have never been disappointed. There are so many Thai restaurants in the city that serve the exact same dishes. If what you want is predictable and boring Thai food, you should go to one of those purple chain places that serve sad imitation Thai food. Perhaps Siam Lotus is not for you. \n\nWhat keeps ME coming back?  \n\nThe incredible array of dishes to choose from at this gem of a spot--tons of specials, combinations you've never heard of, as well as the typical Thai standards for those too hungry to order outside their comfort zones.  \n\nBig flavor and fresh ingredients.\n\nStaff/owner are attentive and sweet.\n\nChef will create the perfect degree of spice for the bravest among us (in my opinion, more than a 2 on a scale of 5 is trouble.)\n\nMy go to's:\n\nCoconut Pad Thai\nImperial Noodles \nPumpkin Curry \nSticky Rice w/ Mango\n\nBon appetit!", "author": "Vicky V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "Siam Lotus has the best Thai Food on Haight hands down.  I'm a huge fan of the Red / Scarlet Curries, but the Green / Emerald Curries are a favorite too.  Phad Thai is solid and generously portioned.  For appetizers, check out the Thai Tacos or Spring rolls.  \n\nWhy no 5 stars?  Atmosphere is only OK.  If you want something more impressive, head across the street and up the stairs at Ploy.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-19", "description": "I've been here only once. I love thai food and it was good! The service was ok. But I've been to better thai restaurants and more charming ones.\nThe food was good and it was cheap.", "author": "Katja J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "It's easy to see why this place has won awards. The food was excellent, the prices were fair, the food was hot and the service was friendly. satay, Penang  curry, brown rice. House salad included. Cucumbers salad side. Mango and black rice dessert all excellent!  Don't think twice - only ding is ambiance but who cares it's the Haight. I'll be back.", "author": "Sea F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-03", "description": "I live in Alameda but my dentist is in the Castro. I'm having a bunch of prophylactic dental work done on Mondays, one of my days off, so it's a great opportunity to do City stuff. I used to live around Buena Vista Park, so I took the opportunity yesterday after the dentist to walk my old neighborhood. BV Park can be so much fun. ;)\n\nAfter the fun, I decided to walk up Haight. I was in the mood for something ethnic and actually was thinking of Ethiopian (or the closest thing in the Haight, Eritrean.)  Well, Massawa was closed.\n\nOk, so now to my report. :)\n\nSo I found Siam Lotus. I only had 2 dishes, I was by myself, and it was lunch.\n\nI ordered tom yum and larb gai, both spicy. I usually order the chicken in the soup. It wasn't on the menu but the waiter spontaneously asked if I wanted shrimp (on the menu) or chicken. Also he asked me if I wanted sticky rice with the larb. That's how they have it in Thailand. I knew that from a visit to a Thai restaurant in Germany, never having been to Thailand itself. No Thai restaurant in the US had ever suggested this. I was impressed. Both the Tom Yum and the Larb were excellent, some of the best I've had.\n\nAnd the service remained very good. A couple on bikes came in and one of them was putiing the bikes away. The waiter reminded them to be sure to lock them securely.\n\nI'll definitely be back. I hope other dishes are as good.\n\nEdited to say: I went back with my partner on 07/15/07. We tried some other dishes including the gai kraprow, the thom kha, and the neua yang. They all were excellent!", "author": "Nobbi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "I can't praise this place enough.  I see that many have written fine articles and I can't top them.  I have read some disgruntled reviews & I know they were anomalies as I have eaten there for years when I lived in the Haight & liked it better each time.  I have never experienced bad service or food. Their cuisine is only elevated in recent years. Yes, the food will change you. It is more artfully prepared than before, if that is possible. ..just delightful.  Give this place a visit. \n\nPlus, the owners are lovely, treated a special friend well, treating him with utmost kindness and sincerity in his time of need. That alone, buys my loyalty.  I have moved away from SF now,  but I always go back for a meal there. It's worth the trip. \n\nLook, you can cadge a good parking space in the neighborhood once in awhile, there is plentiful Kezar parking nearby, it's served directly by 4 MUNI lines & indirectly by 2 others nearby.  You can always catch a cab. GG Park is nearby & Haight Street is good for people watching.  What's not to like about the place ?  Go on, give it a visit.  I don't think you will be disappointed. These people have a lot of heart.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-20", "description": "If one is inclined to seek boundaries, they're a bit blurred at Siam Lotus.  This is a cozy neighborhood spot in the heart of an area which attracts many out-of-towners.  The brown rice and sustainability crowd definitely holds court here, but the food pays credible homage to authentic Thai.  Decor couples Summer of Love with Thai folk; tightly packed tables with counter seats.  There is vast menu coverage of both standard Thai fare and several rarely encountered regional specialties and lots of duck variations.  We personally had no issue, but Clara G's account of twice being served what I'll presume to be putrefied meat is deeply troubling.  What we sampled from the kitchen was tasty.  Service is hard to assess; the dining room was packed, and it was clear that their service team was woefully understaffed.  Yet, small groups of servers congregated in the corners, chatting and joking; presumably awaiting the right karma and/or chia to do some work.  In summary, enjoyable but undeniably Haight-Ashbury-- for good or bad.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "On a recent trip to SF, just happened to be passing by, looking for a lunch niblet spot.  Saw the Yelp sticker in the window and decided to give it a try.\n\nYUM! Everyone loved their food - shared the Thai Basil Chicken lunch special with my husband - best version of that dish I've ever had.  The salad dressing was delicious.\n\nFriends had the curry chicken and loved it too.\n\nService was great!", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "My manfriend & I came here for brunch during our shopping extravaganza on Haight Street. We had just ate breakfast 2 hours before shopping but couldn't resist the specials we saw advertised outside. Just as 85% of the other yelp reviewers claimed, you can't go wrong with $2 pints! \n\nInitially, we just wanted to grab some brew & an appetizer until we saw a woman with a delicious looking Thai iced tea. We ditched the ideas of beer and went with Thai iced tea, chicken pad thai & a pineapple glazed chicken lunch entree. Yeah, our whole game plan of just beers & eggs rolls turned into a whole meal & thai tea! \n\n** Don't let the plates fool you! They make the portions looks small but they are actually a good size. I even had leftovers :) **", "author": "Joan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-21", "description": "The food is super good, and the waiters so kind!!", "author": "Philippe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-09", "description": "nommy nommy nommy!!! \n\nTook a break here while taking my i fl bff around one of my (as well as everyone else in the bay)'s favorite spots! it looks like a hole in the wall place (which more often are than not, are always serendipitous to my belly haha), but what caught our eyes & attn was their  extensive descriptive menu and modest prices!\n\nWe are both Thai Cuisine enthusiasts, so I'd like to think we semi-know what we're talking about/looking for haha! \n\nShe ordered a chicken & rice dish (i forgot, perhaps angel wings like she always does ?) and  tom yum soup (to all my filipinos, think spicy, spicy and more sour sinigang, LOL! delicious both A+! \n\nI on the otherhand, fairly knew to trying spicy foods, wanted to try the Green or Penang Curry ( but I was unfortunately not feelings so daring that day!) I opted rather for my typical chicken pad see ewe! Very scrumptious. They give a generous amount of meat and a lot of broccoli!  (double brownie points!)\n\nand to top off our amazing random pit stop (we weren't even that hungry HAHA)\n\nShe had me try her favorite Thai Desert: sweet Mango & Sticky rice!!!!!!!! I am now OBSESSED! so delectable and mouthwatering! The mango was so soft it practically melted in my mouth! It rested on a bed of (so fittingly named sweet sticky rice)... i'm not sure how they prepare it, but our other friend Daniel said it's relatively easy to make! I'm pretty sure there's loads of condensed milk somewhere in the recipe? \n\n\nall in all it was a treat for our shopping bellies! The only reason it's not a 5 is because of the overall ambiance! it was kind of small. I was back to back with a fellow patron. No Bueno! \n\nA- for presentation of food tho :) MUST TRY! IF YOU ARE A THAI FAN AND IN THE HAIGHT & ASHBURY!!", "author": "kimberly p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-14", "description": "I tried this place for lunch after a craniosacral session with my therapist.  I was starving... so I was about to chow big time.\n\nWell, I got seated and I looked at the menu and found it very interesting that they were very heavy on their tropical fruit use.  I am not sure if that makes them less authentic, but I might have liked that if I was here on a day when I was curious to try new flavors.  But today, I wanted my good old staple Thai dishes.  \n\nI ordered a som tum salad and their spicy eggplant lunch entree (comes with rice and salad) all for myself.  Oh, plus thai iced tea.\n\nSom tum was good, spicy (as usual), making my tongue all sensitive and in pain by the time I moved on to the lunch entree.  You know how when you order the Thai garlic eggplant, they mark it as \"spicy\" but often times they are not THAT spicy?? Well, their eggplant was one of the spicier ones I've had.  I first thought it was my sensitive tongue but all the pieces of chili pepper in the sauce confirmed it : P  \n\nThe portions were big.  I was expecting the lunch entree dish to come with just a little cucumber/lettuce garnish on the side but their \"salad\" that came on the side was pretty good sized for what these lunch plates tend to be elsewhere.  I just might be willing to skip the som tum and just do the lunch plate next time and still feel nutritionally balanced :)\n\nCan't comment on their dinner menu yet... but so far, not bad!  You probably would find me here a few more times for lunch : )", "author": "Sascha O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-23", "description": "As a native Thai, this is by far the best Thai food in the city and I don't understand why many people do not know of this mouthwatering restaurant! \n\nI eat here often and everything is delicious! I haven't found anything that I don't like.  The coconut soup and the northern curry egg noodle (aka. khao soi) are my absolute favorites!! You cannot find khao soi anywhere else and it is a must-have!\n\nI have read the reviews and many people complain about the smell, but if you are not familiar with Thai food, then you should stay away from dishes with fish sauce.", "author": "Sutinee N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-24", "description": "I thought the staff was great - good service/ friendly and welcoming.\nThe food was fresh and delicious. We got to people watch sitting at the table in front and 2 guys stopped to read the menu. The one motioned to me if the food was good which I gave an immediate thumbs up. They came in and were happy with their food choices. So I would say if you like Thai or even asian cuisine, you won't be disappointed.", "author": "Carol T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-12", "description": "In all honesty It didn't really taste thai, like the pepper tasted like pepperoni pizza, something just tasted off in both the spicy eggplant and the House spicy chicken, really not impressed, also, this is random but there was just a rather unpleasant smell coming from somewhere in the restaurant.\n\nNot planning on coming back here.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "Very tasty! And DOESN'T give me indigestion! Not super greasy like some thai places either.\n\nTheir Pad Thai is so tasty, and considering I am pretty much a health nut, I usually go for their veggie dishes. Their veggie curry with Jasmine rice is delicious, and full of carrots, zuccini, mushrooms (yuck, but I just pick them out), string beans, red peppers, basil and my fav tofu (!!) in a green curry sauce.  The veggie spring rolls are great, and come with plum sauce.\n\nYou can taste the freshness, and your food comes out steamy hot! The service is quick and thorough, and the waitstaff is very friendly.  Oh, and did I mention the \"symbol of excellence\" award they have? Yep! 100% restaurant score! A+ in my book!", "author": "Michelle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-11", "description": "This is a popular place in the Haight. It's not like there isn't enough competition either. Siam Lotus have managed to stay busy through tough times because they offer decent quality food at economy prices.  \nSaturday nights can be tough with out a reservation, but we got in. We kept the meal basic, with Pad Thai and Satay.\n\nThis is not the kind of place you really want to line up for. The decor is typical, but not terribly exciting. Outside on the street the usual motley crew gathers, threatening to close in on your \"doggy\" bag. This corner is always entertaining. -ugh.", "author": "Roanna Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "Great food and super friendly service!  This has become our go-to Thai restaurant for take-out.  We have ordered several types of dishes- curries, fried rice, noodles, etc and none have disappointed.  The Northern Curry Egg Noodle on the 'favorites' menu is especially tasty.  The first time we ordered from them, they wrote little notes on the boxes on how to construct the dishes.  Such a nice touch.  We have yet to dine-in- unfortunately for the restaurant, the riffraff that congregates outside can be a deterrent.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-13", "description": "lotus is a great spot on haight street to eat.I love the coconut soup,thai tea,and curry chicken ,good food and a great pricee,and there is a cute asin woman who works there who is always smilling. Very WELCOMING!", "author": "Kristopher M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-22", "description": "Relatively inexpensive, good food with an abundance of lunch specials between 12-4pm. Located right in the belly of the upper Haight. \n\nThai basil beef with mango was good - they used HUGE chunks of mango. The mango was a little on the ripe side, so after being cooked up it had a borderline mushy texture, but was still sweet and palatable with the basil and beef. \n\nThai iced tea was a delicious sweet tooth fix. \n\nGreen papaya salad was a little heavy on the fish sauce, but I liked it anyway. Because that's how I roll. \n\nI'm not in that area of SF very often, but I'd hit it again. Service was friendly and attentive, and the price was right.", "author": "Cara Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-17", "description": "Came here after a mani/pedi with the girls the other night. We couldn't wait for cha cha cha... too hungry.\n\nThis place is your standard thai place. I'm going to say everything is good. I don't mean just the food though. I mean the service, food, price, wait... I mean, everything is good. I don't know how else to say it. It's what you expect from thai food and it doesn't disappoint. \n\nWas it standout? Probably not. Would I go back if I was in the area? Definitely.", "author": "Abbey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-17", "description": "Probably the best Thai we have ever eaten.  We shared the chicken pad see ew and the crab fried rice.  Service was quick and amazing, prices are great for what nice portions you get.  Wonderful place!", "author": "Becky J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-28", "description": "One of my favorite Thai restaurants in the city. Friendly service and tasty eats. My go-to here is the snow pea chicken. Especially at lunch when it's served with a simple salad with the creamiest dressing that mixes so delectably with the soy sauciness of the stir fry. It's not on the dinner menu, but I order it anyways... The tom yum fried rice is also especially delicious. \n\nThe nearby Haight sketchiness leaves a little to be desired, and the interior decor isn't outstanding. But definitely some great Thai entrees with good service. Take-out is also quick and convenient. Yum!", "author": "Melinda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "This place is great!  If you like spicy Thai food, this is the place. I come here every once in a while since I work close by and always have a delicious meal. I am writing this review for the amazing staff and service. The kitchen has, I think, 2 cooks so sometimes you have to wait a little, but I really appreciate that they tell you this upfront and it is worth it. I came a couple of months ago because we needed to cater a small gathering at my work, 15 people. We showed up maybe 3 hours before we needed the food and the staff sat with us and helped us make a selection. We asked for one small modification and they let us know they didn't usually do that modification but they did it for us because we worked in the neighborhood and they have a strong sense of business community in the Haight. But please don't ask for modifications after reading this review, it was a one time deal! We returned for the food at the specified time and it was packed and ready to go. \nThere are a lot of Thai restaurants in the Haight, but this is by far the best one for food, efficiency and service!", "author": "erika e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "I have a weakness for fruit used in savory dishes and Siam Lotus had so many \"specials\" offering just that. We had the jumbo prawns with peach curry and it was delicious!\n\nPluses:\n- $2 pints\n- brown rice ($2)\n- vegetable coconut soup was delicious and well-portioned for two\n- Thai tacos; wow, the shell was so kick-ass but the whole thing itself was pretty awesome!!!\n\nI think the only thing keeping this place from being a 5-star rating is the ambiance, or lack thereof. But that's also a part of its charm in a way.\n\nRegardless, I totally recommend this place. Go! Eat! Drink! Enjoy yourselves!!! :-D", "author": "Chung N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-23", "description": "The best Thai food in the city...a gem off Haight and Cole...ordered Tom yum fried rice, pumpkin curry, some salmon mango dish, and fried catfish.  The food is not fully traditional Thai...more like Thai food infused with the diverse cultures that San Francisco melting pot has to offer...service was great...total ace in the hole since we were craving thai food and never been there...definitely going back to this delectable and quaint little place...just be prepared to circle the block a few times to find parking as you know that area has crazy as it's parking status...but the food is total worth it!!!", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "I'm going to give them a low 4 for now... The panang curry was really good, though the beef was a little bit tougher than I like. Also tried the northern curry noodle which was really different from other thai flavors I'm used to; interesting, but not really my thing.  I plan to go back and find out if the other dishes are as good as the panang and maybe see if their beef was just having an off night.", "author": "Ely L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-28", "description": "This place has the most amazing coconut pad thai ever! Before I discovered it, I also tried the panang curry and the tom kha gai soup, both of which were also very good. I usually go around lunch time and there is always space available. The staff is very nice and the food always comes out quickly. They never seem to mind if I sit there for a while after I am finished to do some studying and they always continue to fill my hot tea. I would absolutely recommend this place to anyone looking for some great food!", "author": "Megan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-28", "description": "Bummed. Got the pad see ew and it was totally and completely flavorless. No idea what distinguished it as Thai food as I couldn't detect any spices. Drenched and dripping with oil despite asking for less oil. Just a couple slices of veggies. Disappointing. (really nice staff though so they get the stars!)", "author": "Emily B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-15", "description": "Decently adequate Thai food.  Not a destination.  I would avoid the Pad See Ew.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-17", "description": "Came here after B2B 2009 with a team of Yelpers because our one runner needed some hard core carbs and we're always up for some thai food and were very happy overall. \n\nService was fast when we were finally seated. Presentation of the dishes was appealing. Food came out promptly after ordering. \n\nDishes I tried included:\n- Green papaya salad- Very refreshing especially after the hot day\n- Spicy rice stick noodles with chicken- my fave dish of the afternoon especially when you as for some pickled chillies on the side. YUM!\n- Scarlet Red Curry- Eeh had better, probably wouldn't order again\n\nDishes for the lunch menu were all under $10 so very reasonable, thai tea was $2.50. \n\nOnly negative was it was hard to get a waitresses attention sometime but when we did they were very helpful. \n\nOverall today's lunch experience consisted of good food and good company so I was happy. A 3.5 star restaurant for me but I'll round it up.", "author": "Nadia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-20", "description": "The food was absolutely great and the staff so nice. Best place to get some food near golden gate park.", "author": "Martin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-29", "description": "Two words. Thai. Tacos. \n\nThe rest of the food is standard thai - good, but not blow your socks off. But the thai taco appetizers are worth coming back for again and again...I crave them. This is also a great place to go quickly- service is usually fast, although a bit clueless, but overall I heart this place.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "Delicious and tasty! I highly recommend the sticky garlic and the drunken noodles.", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-26", "description": "I must have come here on an off day. But I ordered the chicken green curry and thought it was mediocre. Second the service was slow and not so friendly. My friend ordered an eggplant and tofu dish with rice and seemed to like his. I didn't think this place was anything great that made me wanna come back.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-21", "description": "Pretty good place. Got the pad see ew, calamari, and satay chicken. Small-medium size servings. Not so bad, but not the place to go if you have the munchies. I'd visit again though. I really liked the pad see ew.", "author": "Athina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "I enjoy this place because the food is pretty damn good and affordable.  If you go there you should try:\n the golden triangles, chicken pineapple friend rice (I'm a vegetarian but our meat eating friends like it), veggie coconut soup, and if you like spicy the green papaya salad.  their food tasted fresh and not too greasy.  Also, the thai iced teas are very good!\n\nBottom line is, its not fine dining but if you are in the mood for some pretty decent, well priced thai food that won't make you feel sick afterwards then give it a try.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "Siam Lotus Thai Cuisine was a 45 minute bus ride but after reading many reviews, I decided it was worth the trip from all the others I'd tried.  Located on Haight Street, it is a great family owned gem in a diverse neighborhood.  Be aware that there are only two people preparing all the meals, which they warn about in the menu so if there's a line, it could be a wait.  When we arrived at 19:30 on a Wednesday evening and there were a few families dining and no line!  Sweet!  After having been walking all day, we quickly decided on a Calamari appetizer, the Mango Salmon Panang Curry and the Brussel Salmon with brown rice.   I'm a big Calamari fan and these were perfectly done - not over cooked or battered.    When the Mango Salmon Panang arrived, my jaw nearly dropped as the dish looked awesome.   I of course got the Salmon with brussel sprouts, something I had never seen done before now.   The sprouts were fresh and cooked perfectly - just crunchy and not mushy.   These blended nicely with the delicate salmon which fell apart easily.   My partner said the Mango Salmon was delicious with the mango being just perfectly aged.    When we asked the about which mango was used, the cook explained that it was a special sweet mango she used for the dish.    \n\nOverall, the service was spot-on and it was a nice touch for the chief to come out and talk to the patrons - especially since they were not brazenly busy.   If you are a big Thai food fan, then Siam Lotus Thai Cuisine is about as non-pretentious and down-to-earth as one is going to find serving exceptional Thai food at reasonable prices.   For me, easily worth the ride and next time I'll allow more time to wander around the Haight area after dinner. Cheers.", "author": "G M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-27", "description": "Hot delicious pad kae mao. Really friendly staff. I had to wait for the bus after getting it to go and they went out to suggest for me to wait inside. Pad Kae Mao was delicious", "author": "Lin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-22", "description": "This is probably my favorite Thai place in the City.  Granted, I haven't been to all of them -- but quite a few and this one always hits the spot.  \n\nTheir plating is lovely, the restaurant is nice and big, and the food is delicious.  I can't say I enjoy sitting at the window seats with the odd stares and glances from the seedy characters out on Haight -- but if you sit toward the back the place is quite cozy.\n\nI love that they have brown rice -- their curry is delicious.  I usually get the tom yum soup and a side of brown rice.  Definitely try the mango with the sticky black rice -- oooooooooh soooooooo good!\n\nAlso the tom yum fried rice is delicious -- I love tom yum anything!", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "Family friendly. Fantastic food. Fair prices. Loved it.", "author": "Frederic A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "I had the yellow curry. Delicious. If your on Haight and want curry then this is the place. Wonderful do check it out. Service was very nice and friendly.", "author": "Tim S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "Loved this place!! Just went there yesterday for the first time and got thai basil chicken and a curry dish. So gooddddd and the service is wonderful, very nice and more than hospitable!! They say everything is handmade down to their red chili paste they bring out on request. Loveddd it and will be back :)", "author": "Lindsey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "This is one of our neighborhood regulars. We go here at least once a month for our Friday night date nights. The staff is very friendly and the atmosphere is calm and comfortable. The food is great, they have plenty of vegetarian options for those of us who need it. I absolutely love the thai curries. We've never had a bad meal here.", "author": "Rochelle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-27", "description": "DIsclaimer: I just moved to San Francisco from Michigan, so my exposure to other SF Thai restaurants is limited--at best. \n\nWith that said, Siam Lotus is the place in the Haight to go to if you want to try really amazing Thai food in a chill atmosphere.  \n\nThe first time that I went there, I was just in the mood for something quick and easy to eat on the run.   That is when I first fell in love with the Fried Shrimp Rolls w/ dipping sauce.  My order took less than 10 minutes to come up, but was anything but fast food.   Crispy exterior, perfectly cooked shrimp inside.  You can't go wrong with this app.\n\nThe same day that I tried the Shrimp Rolls, I returned to Siam Lotus for my actual dinner.  Yep, I was hooked.  My guest had the Southern Thai Tamarind Pumpkin and I had Grilled Salmon w/ Pear chilli sauce.  The server actually asked us how hot we wanted our food!   We were offered a scale 1-5 to choose from.   Great food!  Loved the heat.\n\nThe most recent time that I went there, I got the Fried Shrimp Rolls, Angel Wings, and  Mahi Mahi w/ Spicy Tamarind Sauce (I split this with someone else).  I would recommend the mahi entree along with the fried shrimp rolls to new comers ($20.90 plus tax and tip).   The angel wings were a bit greasy for me.  \n\nI found the prices to be fair.  I found the quality of service to be exceptional.  Our server was very patient, spending lots of time offering suggestions and describing the cuisine.  I kinda loved her.  \n\nCheck it out!", "author": "Floyd R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-03", "description": "Nice decor, decent food, romance in the City.  \n\nOn a Sunday afternoon the place was quiet and half full.  The warm, dark interior was decorated with traditional wooden sculpture.  There were five menus to read.  \"We have too many menus,\" conceded the waitress, but I don't really think so.  When you walk into a library, you don't expect to read every book, do you?  \n\nTwo of the menus were for lunch specials, good 12pm - 4pm.  We both found something we would like almost immediately.  \n\nWe started with satay chicken, and the peanut-coconut sauce had a perfect balance.  Neither flavor overwhelmed the other.  Hey, you want to share food equitably?  Feed your lover, and let her feed you.  Forget about all the emos who want you to get a room.  You'll make sure you each get a fair share of the appetizer.  \n\nThen she had coconut jumbo prawn tempura.  They came with a sweet sweet-and-sour sauce, which was a little richer than we normally find in Thai restaurants.  Again, there was enough meat on  the stick for both of us to play.  \n\nI had Thai basil crab meat with garlic and peppers.  Once more, the flavors did not overwhelm, and the heat wasn't higher than the passion in our hearts.  The white steamed rice on the plate also assured that our palates would not be overwhelmed.  \n\nShe drank tea; I drank Thai iced tea.  The whole feast for two was only $25 + tip.  \n\nWe appreciated the waitress' helpful and attentive service.  \n\nI would not recommend this place to anyone who wants to challenge me to a fire eating contest, but for an average American it is the perfect place to enjoy the spices of Thailand without the pain.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-06", "description": "Just do it.\n\nBrown rice.\n\nIt's so much better for you, people! It doesn't taste any different. Really. Come on -- you know it's true...\n\nI really feel I have to advocate what's good for you. Seeing as I'm the picture of health. I mean, I eat super healthy. I eat less than 10 grams of saturated fat a day. All fruits and vegetables and good proteins. No meat, no dairy. I even know how to order Thai food healthy. \n\nGo to Siam Lotus. Get the spicy veggie rice noodles with tofu. Or any of the steamed tofu or veggie rice plates with brown rice -- they have it here! They have LOTS of healthy options here, and they're ALL delicious. \n\nListen to me! Seriously. I'm the PICTURE OF HEALTH. \n\nUm -- except ignore the last ten reviews I wrote, which were all about my drunken exploits. Because I'm a bonafide dive bar lush who doesn't know when to quit. \n\nBut I EAT HEALTHY, and Siam Lotus rocks for delicious, healthy Thai food. \n\nAnd in general, skip the Thai iced tea. Not so good for ya, even if it is yummy. Unless you're a super good-looking, funny, charming dude and I'm really into you, and you're buying. (Who I did NOT meet via PM on yelp, BTW...)\n\nThen you can have WHATEVER YOU WANT.", "author": "Lisa T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-08", "description": "You know, it's one thing when you visit the neighborhood to shop or take your visiting friends or family around and you can deal with a mediocre meal at Askew or Squat and Gobble or something, it's quite another when you are on the street all the time and have to feed yourself. Sometimes I'll mentally go down the list of places to eat on the street and it'll make me want to rip my eyeballs out in desperation. I like every meal to be a delightful sensory experience or you know, at the very least, taste like something and the overpriced messes they can get away with serving here in this area rarely ever cut it. \n\nAnd so, I order a lot of delivery. Or eat Thai food. The only take out that I usually get is either Best of Thai or Ploy. But, even those two were boring me. Then I remembered Siam Lotus. Ignored, sandwiched between the cheapie fashion store on the corner and the hippie store, I never really thought about it before, but I figured I could at least try it. How bad could it possibly be? Answer: Not bad at all! Siam serves up really wonderful pad thai and fried appetizers - I loved the Thai take on samosas, the \"golden triangle\"  and the pad thai was really great, with lots of tofu and cilantro and none of that stickly sweet taste that BOT usually has.  I have found my new Thai take out haven. I am so happy.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-13", "description": "Meh, just not that good. Stopped in here with the BF one night. Got the roti with golden curry and the eastern Thai veggie. The roti was a lot heavier and greasier than I've had at other places, the curry seemed too runny. The fried tofu on the Thai veggies was way too dry - perhaps it was fried, frozen, and fried again. But, nothing was awful - my boyfriend said his meat dishes were good. I won't be returning, though.", "author": "Brooke T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-03", "description": "Best thai I have had in SF.\n\nThe veggies are fresh.  The flavor is fab.  The tofu is done well.  The people that work there are extremely friendly.  This is the one thai place that I actually will consume my meal in.  Most of the time I have to get it to go and fix it up at home to fulfill my thai cravings. \n\nNote: this place actually makes their food spicy. I LOVE hot food but ordering it hot there, almost makes my heart stop. \n\ndownfall- again with the no delivery.", "author": "Kiera H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "This place serves up very delicious eats.  However, you can not be in a hurry if you choose to dine here.  The disclaimer on the menu even states \"please be patient, we only have 2 cooks for the entire restaurant\", so consider yourself warned.  The food is really good and the prices are good.  The bill for my family of 4 was less than $45 dollars.  The service is not over-the-top excellent, but they are definitely kind and worth at least a 15% tip.  I'm not giving it % Star because the restaurant is very cold.  It's a small place which is not a big deal, but the  front door serves as a wind tunnel for the restaurant.  It would be a good idea for them to put a divider at the front door as to shelter the diners from the wind.  We asked that we be moved to another table but we were still good and I heard someone at the next table mention that she was freezing also.  Oh yeah, great side note: They have daily happy hour from 4:00? to 7pm, $2.00 draft beer.", "author": "Larrisa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-16", "description": "Thai Taco!  It's a crispy, curvy crepe filled with shrimp, chicken, peanuts and sprouts. It comes with a bowl of marinated onions and cucumbers and it is scrumptious!  Believe the hype.\n\nThe Crispy Chicken and Pineapple Fried Rice threw me for a loop, because I assumed it was a single item.  Turns out cc AND pfr were a charming duet of chicken katsu-style and fried rice full of pineapple, cashews, raisins, eggs and aromatics.  The other dishes we ordered were delectable as well and with the food, I could find no flaw.  \n\nThe service was warm, however not superior.  Entrees came to us within a few minutes of apps and the water didn't arrive until our third request.\n\nMinor issues, far outweighed by the quality of the food, but I had to justify the lack of a fifth star, because when you take your first bite of Thai Taco, you will think I shortchanged Siam Lotus.", "author": "Quinn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-21", "description": "Love this place. Authentic bold flavors, super friendly staff, quick and inexpensive. A little to bright but I'm picky when it comes to atmosphere.", "author": "Brian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "Food: Not bad. I tried the chicken pad sew yew for lunch and my boyfriend tried the golden chicken curry. He thought his was pretty good and my entree was simple and tasty. They had a nice selection on their menu. I would return here for Thai if I was in the area.\n\nPrice: Pretty cheap, lunch entrees are $7.95 and up. Good portion for price.\n\nAtmosphere: It was empty when we came in here today for lunch around noon but this place has nice decor with a relaxing vibe (sometimes you need a place like this after roaming around Haight street for awhile!)\n\nLocation: Located on Haight, parking available at meters or side streets.\n\nService: Pretty good, since we were the only customers dining in the restaurant there didn't seem to be an issue with service. Food came out quick and our water glasses were refilled frequently.", "author": "Miss H K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-18", "description": "Dude. Seriously. What's with the whole 'modest-thai-restaurant' cover?! Siam Lotus is the Batman of Thai food in the Haight.\n\nThe Batman of Thai food? Yeah, I don't know either...just hear me out.\n\nWe had pineapple chicken fried rice, jumbo prawns with peaches, & salmon with some other kind of exotic fruit (it is now Friday & this was dinner on Wednesday...I just can't be expected to remember what I ate more than one day ago). Everything was completely delicious, & the prices were super affordable. \n\nThe service was choice, too.\n\nI haven't had any other Thai food in the Upper Haight, & after eating at Siam Lotus, I really don't think I can be counted on to go elsewhere.", "author": "Pete J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-23", "description": "Mango, Mango, Mango, Mango.\n\nOnce upon a time in 2006 we were here for a friend's bday and the waiter ran down the list of desserts and every other word out of his mouth was mango.\n\nEver since, we've called this place the \"Mango, Mango, Mango, Mango\".\n\nMy butcher, who also moonlights as my boyfriend, and I came here one random Friday night, deciding we couldn't justly spend the birthday money my mother sent me on strippers and blow.\n\nThe calamari was decent.  My standard order of Pad See Ew with Pork was decent.  The boyfriend's lemongrass chicken with spinach noodles was pretty good.\n\nAll around, a solid thai experience, but nothing really to write home about.  I added a star for the prompt and friendly service.\n\nCompletely stuffed, we wandered home where I quickly passed out on the couch watching \"Cops\"  in a food coma.\n\nYeah.  Cops.  I couldn't even change the channel the food coma hit so quickly.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-06", "description": "I was a great experience my first and second time there.\n\nService: They are quick, nice, and courteous. On a crowded night or not, they definitely are on point with making their guests feel taken care of.\n\nFood: Tasty and well presented. The price is about average for Thai places in SF.\n\nOverall, its a good find in SF, the city of countless Thai restaurants. lol.\n\nenjoy.", "author": "Rhommel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-11", "description": "Delicious Thai food, and I love that it is right on Haight St. They have plenty of vegetarian options on the menu. The calamari is delicious, as are the soups and all the noodle dishes.", "author": "Erin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "My pal from LA ***MADE*** me go here yesterday. I mean, he didn't have to try very hard, but he did goad me into driving to the Haight. He claimed to have good parking Karma, and lo and behold, after only a few minutes, we got a great spot. (Ok, granted it was 4PM on saturday afternoon...)\n\nAnyway, we got in and my pal told me how they have something GREAT on the lunch special menu. But then we noticed the specials ended at 4PM.  So I scoured the menu and found something else. But when they came to take our order, we found out you could still get the item, at dinner priced. So we both ordered the coconut noodle special.  It was really good. The Thai iced tea was good too. And the service was good. \n\nSo why 4 stars? Good question, and I can't quite put my finger on why it's not perfect.  Maybe it's because I didn't try a standard dish, so it's hard to compare it. I guess next time I'll try pad thai or yellow curry.", "author": "neil c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-28", "description": "Whenever I walk through Haight Street while shopping this restaurant always caught my eye. I love Thai food and I never been to a Thai place where I didn't like the food. Thai never fails me... that is until I came here! I don't know if it's just the particular dish I had, but my sister's fiance who always orders duck fried rice at every Thai place he goes to said this one was not good either. He actually said this was the worst.\n\nI was so sad because I even saw a yelp sticker on their door! Bah.. :( \nThe positive.. my cousin's food was actually good, she got the seafood noodle soup. Maybe I shouldn't be so quick to judge since they had a yelp sticker.. but I can't help it. I didn't like haha.", "author": "Annissa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-11-28", "description": "Despite the comments of the other reviewers, I have to pump these guys up.  While I certainly wouldn't go to Siam Lotus to look for an example of world-class service, the food is tremendous - some of the best Thai in San Francisco, it's affordable, and actually quite creative.  I love many of SF's Thai restaurants, but this has become the regular hangout for me.\n\nDon't worry about the service, unless you're in a huge rush and need extraordinary pampering.  If you go, don't miss the Thai Tacos or the Black Sticky Rice with Mango...yum!", "author": "Josh M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-16", "description": "July 15th, 2006 Update:\r\n\r\nNot sure what happened to this place.   But it seems of lesser quality then I remember.  I've been back a second time and ordered this chicken dish that just tasted weird.  The server pretended there was a language barrier when I tried to bring it up to him, even though he spoke english perfectly fine before then.  Not sure I'll go back here that much.  Maybe once a month?\r\n\r\nI was introduced to this place about a year and half ago when I had just moved to San Francisco...and I've been looking for it again ever since.  I was drunk at the time and couldn't remember anything about its location except that it was in the Haight....  I got to go again this past week and the chicken fried rice was all I remembered and more although last time I think I had ordered the pineapple and chicken fried rice with raisins and some more stuff.  They seem to have renovated the entire place because it looks totally different, but the plate presentation is still the same.  Good, cheap, dependendable source for thai style fried rice in the neigborhood.  I really haven't tried anything else here...", "author": "LaSha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-29", "description": "Siam Lotus is absolutely phenomenal. It's the first place my then boyfriend took me to on a date in Sf when we first met, and it'll be the last place we go to with our families on the night before we say \"I do\".\n\nA simple and romantic little place with yummy eats. Cheers to Siam Lotus.", "author": "Alison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-09", "description": "Thai tacos!\n Crispy, thin rice \"tortilla\" topped with shrimp, chicken, mysterious sweet thai sauce, shredded coconut, peanuts, lime, avocado (I may have made that last ingredient up, I can't remember). Anyways, chamazing!\n\nWe also ordered a special shrimp dish that was really spicy. The waitress kept asking us if we were suuuure we wanted it (because we are total gringos presumably) and we kept saying YES! Bring us the spicy shrimp!\n\nWhen she brought it out, the entire kitchen staff watched on as we tried a bite. It was in my top 2 spiciest foods, but also had wonderful flavor and we finished the whole dish. \n\nMinus one star because every time I come here, the waitresses are horrible with the water refills.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-14", "description": "I like this place mainly because it's located on Haight Street. I love shopping on Haight street just because it has a very \"Bay Area\" feel to it. Everytime I go up north I always shop on Haight..\n\nThis Thai spot is a small spot with great food! I would suggest to get the Pad Thai and Basil Chicken. Don't forget Thai Iced Tea!! DELISH! : P", "author": "Oh So Fresh B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "I work next door so this has become a pretty regular place for some take out lunch. Most of the noodle dishes are just good, nothing too exceptional. Veggie spring rolls are some of the best I've ever had though. Also the veggie fried rice is great. All the girls who work there are really sweet and the service is pretty quick. Worth a visit if you're in the haight", "author": "Caitlin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-26", "description": "LYCHEE SWEET N SOUR PORK!!!\n\nThis place was pretty delicious. I enjoyed my entree very much (see above) and the dude's entree was pretty good too (scarlet duck curry something something).\n\nAlso, the price is right! Cheap cheap for good good.\n\nMy only gripes, which I take off one star for, is the service was kinda slow. Took their time taking our order, and bringing the check. And, my pineapple vodka lemonade? I think there was no vodka.\n\nBut, yeah. LYCHEE SWEET N SOUR PORK!!!!", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "Party of four ordered many dishes - even veg - and each was spot on. Fresh, spicy, light. Friendly staff, excellent food. Recommended!", "author": "Mark C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-08", "description": "The Chicken Panang Curry had a tingle your tongue hotness and had  a cream curry sweetness.  Though, the chicken was dry and the prawns (add $2 extra) was nothing special.  The dish also came with julienne red and green bell peppers, which were crisp and fresh.\n\nThe service needs some work, like the waiter dropping off the menu on my dinner plate.  And not asking me for a drink before taking my order.  And not clearing the table before dropping off the check.  I'm a stickler for observation, when I'm the only customer at a restaurant.\n\nOtherwise, the food was good.  The ambience is nice (candles on the table, art on the walls).  And I saw at least three people walking by, outside, with a slice of pizza from Escape From New York Pizza.  Must try that next time!", "author": "Sam T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-08", "description": "parking is difficult so if you like to walk on haight you can park away and walk here.\n\ni decided to just try the fried chicken and pineapple fried rice.  my friend had the catfish.\n\ni loved it.  it was full of flavor well prepared. the chicken was chicken katsu.  the fried rice had cashew, raisins, pineapple, and i forget.  it was really tasty.  it just wasn't huge or really big enough for me.  hence the 3 stars.  if it was just a little bit more i'd give it a 4.\n\nmy friend had the catfish. same thing. kind of decent size portion but for hungry people its just a little too small.  BUT the catfish had wondeful flavor, was cooked perfectly.  my friend was worried it might be sea catfish so its a bit salty and has that ocean fishy taste, but this was fresh water catfish which made it taste nice and tenderly sweet.  with the sauce they gave.  which also had steamed rice.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-02", "description": "I decided to come here on my work break one day since my manager wouldn't shut up about how good it was.  I asked them how long the wait would be to take some tofu and vegetables to go, and then told me 15 minutes.\n\nSo I waited there for 25 minutes, paid for my meal, then asked for a side of oyster sauce and then wanted to charge me $1.50.  I left really upset because I wasted precious break time on waiting and extra 10 minutes.\n\nI was really disappointed with my food, I felt like it was more Chinese food than Thai.  The vegetables weren't cooked that well, the tofu was almost nonexistent, and there was no flavored sauce or anything.\n\nI suppose I gave it two stars because it's a lot cheaper than most things on Haight Street, but I definitely will not be reordering from here.", "author": "Dylan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-28", "description": "Good noodle dishes, just the right amount of spice.\nThe kicker are the desserts though: ask about the Mango ice cream or fried banana plate.\nSeriously, they love talking about the mango though.\nService may be a little slow, but it's worth the wait, unless you're absolutely starving. I did enjoy the Thai Iced Tea though...", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-25", "description": "I really hate this neighborhood (pardon that lame, overused pun, but my loathing is genuine); however, I'll give due praise for the quaint little restaurant, its friendly service and beef pad kee mao. Enough to rave endlessly and come back craving more? Not really. But maybe in the future...", "author": "Chase S. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "This is really a 3 and 1/2 (again tell Yelp we need 1/2 rating here) \n\nI popped into this place with my fellow vegan foodie off the 71 bus line. Pretty hungry and looking for a new Thai place, the menu offered a myriad of seafood, meat and vegetarian/vegan options (which is rare because most Thai places slap tofu instead of meat and think it's vegetarian. BEWARE, almost all Thai entrees have fish sauce, so make sure the menu is designated vegetarian versus tofu as a meat option).\n\nAfter contemplating the abundance of veggie options, I decided on a classic yellow curry. This is a very typical dish in Thai cooking, but that does not mean that every yellow curry you try will be good. The hook-line and sinker to this dish was the unexpected addition of winter squash (an orange, pumpkin-like sweet squash that plays very well with the spicy curry and sweet coconut milk).  This dish was not only impressive to my Thai-food-loving taste buds, but also was satisfying to my 1/2 Thai fellow vegan foodie. \n\nShe ordered some spicy noodle dish... I can't remember the name, but I remember the dish. It was true to the spicy verses that Thai food can sing so well. Large flat noodles with lots of stir fried veggies with a sweet, brown soy based sauce.  \n\nWith an unsweetened (sorry non-milk drinkers/ lac-tards no soy here) Thai iced tea and a hot tea, the lunch that was expected to be a so-so meal turned out to be a curry-colored diamond in the rough. \n\nA caution to those of your to choose to fulfill your Thai food cravings, this little gem is closed on Tuesdays (boo, right?) and, although this may seem minor, they don't have tamarind candies.  SL has become our new little Thai spot :)\n\ncheers, \nthe vegan foodies (written by Tara, the Karim in Karimaford and admittedly the high strung half of the vegan.foodie.team )", "author": "Maria W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-01", "description": "One of the best thai restaurants in the City and I've been exposed to many thanks to my bf's (and his family's home cookin') years of experience eating in Thailand, Wat Thai and Thai Town in So Cal. The portions were generous (prices, very reasonable) and we were waited on, not had to wait a bit to get service on a Sunday afternoon. \r\n\r\nWe both had the lunch specials - Chicken with Mango + Catfish with Ginger, Bell Peppers and Crisp Thai Basil - a great twist to the usual and was served with a heaping scoop of rice and a \"real\" mixed green salad with hearty greens rather than the dreaded butter lettuce.\r\n\r\nAnd our yardstick, Thai Iced Tea had an excellent ratio of tea, sugar and cream. My only complaint though was the ice was not crushed or shaved (the best kind!) and instead came in the mundane cube form. But I will return!", "author": "Charm N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-29", "description": "Randomly walked in here when my counterpart and I were both feeling pretty low.  About to have a night on the town and both of us were sick!  We needed something soothing and comforting to eat.  Decided some warm hot & sour soup would do us good.\n\nImmediately seated by a strange host, he jumped the gun a lot and talked over us while we were ordering.  Almost like he was in a hurry.  But whatever, we ordered our drinks and reviewed the menu.  Everything was priced decently and looked yummy.  We both ended up with hot & sour soup with chicken, order of rice, some spring rolls, and he got the mahi mahi.\n\nThe  food came out fast and in an order I liked.  Soup first, then spring rolls, then the main dish.  By the time the fish came out I was stuffed.  The soup was delicious and the spring rolls crispy. (I LOVE crispy rolls!)\n\nHe gave us our check pretty fast and we were on our way.  Probably could have been closer to a 5 star review had the service been a little nicer.", "author": "Mary R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "This place is legit.  It has outstanding food.  Its perfect when you are out shopping in the haight and you decide to get a bite to eat.  You must have Thai at this place you won't be disappointed.", "author": "Chris J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "I ordered the Green Curry Rice Plate (take out) from Siam yesterday. The curry was flavorful and the portion size was appropriate for the price. Can't really add anything about the dining experience at the place but looked nice enough. Also found out while ordering over the phone that you can also order online FYI. Good local spot around the corner from me. It's nice to have 2 good Thai places so close to my apartment (Ploy II across the street).", "author": "Todd A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-30", "description": "The freshest Thai food in town!  My favorite dishes are the Golden Veggie Curry, Spicy Thai Basil Eggplant, Coconut Veggie Soup.  The veggies are so fresh and are cooked to perfection.  \n\nGreat service and affordable- you will not be dissappointed!", "author": "Marn E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "I find it difficult to break away from my normal order of Pad Thai. But Siam Lotus had a wonderful array of lunch specials that made me want to break with the norm. Everything sounded great. It was a tough call. I wanted curry. I really really wanted curry. But the crispy noodle curry caught my eye. I am a bit spoiled having eaten curry every day for over a month while traveling in Thailand, I was so very pleasantly surprised at how good this curry was. A yellow curry with crispy noodles piled on top of beef (or chicken, shrimp or tofu) and soft noodles (no rice). It was a huge bowl of yummyness! And what does that sign say? \"$2 drafts ALL DAY EVERY DAY\" What???? And then to top it all off, it's in the wonderful people watching district of the Haight. I could go back here every day and try something different.", "author": "Jay B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-05", "description": "Good prices. Good curry and pad see ew. Other food was okay. we were in a big group and it was not too bad a price for the amount of food we had. Didn't look at the menu since we were eating family style. I'm sure the prices were fine individually.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "I'm feeling lazy so I'm going to be concise.\n\nPositives: Good Thai food, nice staff, cute Thai themed decor, reasonable prices.\n\nNegatives: Parking sucks at Haight, but if you're from around here, you know that. You'd also know that there may be bums around and they WILL have the audacity to ask you for money so they can score some drugs. :P", "author": "Bekki J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-21", "description": "Oh no- they're closed on Tuesdays! (Today is Tuesday, blah!)\nAverage cost, yummy thai :) \n\nThis dish was SO FABULOUS!!! \n\n30. Grilled Lemongrass Chicken (gai-yang) Tasty thai grilled chicken marinated with lemon grass, coconut milk, coriander and thai herbs served with spicy pineapple sauce.\n\nIt is only the chicken though- no veggies or liquidy sauce. Mmmm, so tasty! \nNot greasy or anything either. \n\nRed Curry with Beef and Tom Kha Gai were basic, average. I think Red Curry usually tastes better with chicken or pork because the white meat soaks in more of the curry than beef does. \n\nNo comments about service because we got take-out, but the servers there were all really nice when we picked up the food.", "author": "Amy J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-27", "description": "I think this is the best Thai food we've every had!  The coconut pad thai was awesome and the Thai basil with mango was amazing!!!  Everything tasted very fresh!  The staff is super friendly, too!", "author": "Khani Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "This is the best Thai restaurant in the neighborhood, and the best Thai food I've had in a long time.  Their menu offers more than the standards and their specials are always exciting.  I take great pleasure in their seafood.  I find that many Thai restaurants cook the hell out of their prawns, but not Siam Lotus.  They take care with their dishes.\n\nThe service is not so reliable.  They don't do big groups too well.", "author": "Lulu B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "Simple place - fantastic food.  I had the green curry with chicken, and it was really amazing.  The eggplant was to DIE for!\n\nAlso inexpensive.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-25", "description": "This is one of the best thai places I have found since I moved to the Bay Area in 2001. The service is always really good and the food is.... great *sigh*. They have a big menu with all the traditional Thai dishes (curries, pad thai, etc) and a lot of interesting fusion items. Every time I have eaten here I have tried different things from their menu, and I have never been disappointed. The lamb curry was especially memorable...\nMy only complaint is that it wouldn't hurt if they kicked up the spice levels a couple of notches. If it weren't for that, I would give Siam Lotus Thai 5 stars.", "author": "Daniela A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "As a little warning, I ate here while somewhat intoxicated, last minute before seeing a movie at the Red Vic. I live on the other end of the upper Haight and infrequently make it past Best of Thai when I am in search of Thai goodness. I think after my most recent dining experience here, I may be pulled down here to enjoy the food again. \n\nI would say this place has food with good flavor, great variety and a few unique additions like the Thai Taco. My palette may have been a little off, but I did find both the Thai Taco and the Pad See Ew to be a bit on the sweet and salty side. Perhaps they add something to make Americans think 'damn this is good' or maybe I am just crazy. I will give it another try or two.", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "In any other city, outside of NYC, this would a top notch Thai place.\n\nIn SF, it is average. It is a good place and a good time for a large group.", "author": "Rahul T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-06", "description": "As a former native who still loves the Haight/Ashbury District, this thai restaurant is a must-stop for lunch. Since we were shopping in the area, we needed to get lunch in that area; our choices were between the pizza joint and this thai restaurant. The menu out front was intriguing. So we chose this place. The inside of the restaurant looked nice too. For the appetizer, we got the spring rolls, which had a good mix of chicken, vegetables, and thin clear noodles. Yummy. We got the entree plates, as the lunch specials do not come with rice. My husband got the yellow curry dish with chicken and I got the spicy eggplant with chicken. The presentation was very nice. My husband cannot do spicy but found that it was seasoned with the right amount of  spice. He said it had a bit of zing. I tried it; it was excellent---it reminded me of our good thai restaurants back home in LV, Lotus of Siam in the Commercial Center and Mix Zone Cafe at Charleston/Rancho. My dish was spicy, just the way I like it. There was a lot of food;a  good mix of chicken, vegetables and basil. I don't think that I finished it; good sized portions. (Maybe if we didn't have the Spring Rolls.) We were glad we came her for lunch; we will definitely have to stop by again, the next time. We were seated at the window (pictured below). Soon after, the lunch crowd started to come in. There were a couple To-Go orders. Also noticed the \"Yelp\" stickers all over the front windows. I couldn't wait to post my review.", "author": "Margret C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "Wow, the flavors of the food are amazing!  This place is family-owned and run.  They really take pride in their business, their food, and the service they provide to their customers.  The owner, a wonderful Thai woman, tells me they have been open since 1999.  It is obvious why they are still in business - definitely recommended!", "author": "J R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-06", "description": "I am not a Thai aficionado by any means. The food was good, but service was soo slow. We were the first table there, a ratio of 2 adults and 2 toddlers to like 4 servers.\n\nShrimp Spring Rolls could have  been  a little fresher, the veggie ones were great though. Lemon grass chicken was yummy as was the chicken satay (i love a good peanut sauce).", "author": "allison s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "*****BEST LARB ON HAIGHT.*****\n\n\n*(but called 'lap gai', don't know why)\nI ate here the first week I moved to California, so it has a special nostalgic place in my cold little heart.\n\nHighlights:\nKha Gai, Po-Tak, Phad-Phrik Sot, Spicy Basil Eggplant, Panang & Green curries. oh! And the cucumber salad it refreshing.\nAnd they'll make everything vegetarian if you ask nicely.\nI also had a delicious salmon param with spinach once, it was a special and it was delicious. Bring that back.\nThe waitstaff is always polite. They are on time with orders.\nI only dock a star because they don't deliver and I am not walking when I feel lazy.", "author": "Claire S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "I had a hanker for a hunk of Thai,  in the Ha-iggit. We set out for Ploy II but oops, closed on Mondays, shoulda called first, my bad. Over to that thing across the street, which turned out to be Siam Lotus. Wife sez \"it's decent...\"\n\nOkay so it's decent. Decor is a bit spare, menu options were enticing, the food was pretty darn good, service was OK. A solid 4/5 across the board: decent, but not great. I ordered a \"Han Solo\" from the drinks menu and it was by no means a rockstar scoundrel drink from Star Wars. More like a lame drink from Ice Pirates. Yawn.\n\nWays they could be better: more swanky decor (or more funky decor, _do_somefin'_ with the place), snappier service, put some sauces and flowers on the tables, get some groovy tunes going, and put a handful of crazy things on the menu - crazy fusion, or deep cuts from real Thai cuisine that normal Thai restaurants in the USA are afraid to serve, whatever, just reward the adventurous weirdos who order the stuff. And revamp that drink menu, I know they're making do without a liquor license but they can be creative and come up with some fun drinks that people won't be disappointed by.", "author": "Jamie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "I had an overall good lunch experience at this place but overall food quality was only part of the reason. The pace of the meal was perfect, apps came when they should, soup when it should and meals when they should. Presentation was five stars for sure and big points for some unique thai dishes on the menu (most thai spots in the city may as well share the same menu).\n\nSad truth was that the curry dishes we got were sub-excellent which was unexpected all else considered. The price point was right though, especially for a great lunch experience before the red vic, and I would like to return and try a few more dishes. \n\nThe golden triangles were unique and excellent although more like a samosa than thai. Stay away from the chicken coconut soup.", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "Really good food all around. Seemed fairly small inside, but we didn't have to wait for a table during dinner-time-ish on a weekday. Relatively inexpensive, I thought, though not necessarily what I would classify as \"cheap\".\n\nThere were four in my group, and we were all pleased with the food. The service was pretty good, and fast. I had the crispy chicken with pineapple fried rice, and everything about it was fantastic. I also enjoyed the menu more than a typical Thai place, though I can't really explicate why. I think it just seemed like there was a bigger variety and a lot of unique dishes, rather than just the basic curries and pad-somethings.", "author": "Derek S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-28", "description": "Whether it be fair or not, I don't think that mediocre Thai restaurants deserve patronage.  There are just too many good places to choose from in a city like San Francisco.  I would lump Siam Lotus into that category of \"mediocre.\"  There was nothing wrong with the service or food, but there was nothing that stood out.  The food soup was flavorful, the masamun was average, and the pad si eww was bland.  \n\nI'll give it another chance because as we were walking out, we saw the waitresses eating their dinners and both plates looked delicious.  One was eating the grilled lemongrass chicken & spinach noodles while the other was eating a dish with some massive prawns.\n\nI'm not ready to give up on Siam Lotus just yet, but unless my next experience there is better, they've lost me as a customer.  There are just too many places that have food with taste and treat make you feel like your business if important to settle for mediocre.", "author": "Lucius M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "We went there on a Monday afternoon and I ordered a dish that I am trying to remember because it was really good. It had lamb and a coconut curry saffron sauce that was amazing..I looked at the online menu and can not find it though. I have been thinking about that dish for weeks now it was yummy!!!!", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "Best Thai food in the neighborhood - absolutely fantastic.  Only reason it isn't getting 5 stars from me is that they don't deliver...and on a rainy, dreary Sunday I would choose a place that doesn't require any effort.  Try the crispy pineapple fried rice - heaven.", "author": "Betsy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-06", "description": "I do not like this place. The service is bad and the food is not tasty.\nThe sign says \"Please wait to be seated\" We waited, then a waitress came by saying do you need a seat? We said, yes. She walked away into the kitchen and never came back. Oh yeah there were a lot of open table. So we sat down for about 5 minutes. I asked my friend if she wanted to leave. She said she does not care. We were about to leave then another waitress came and seated us. \nWe ordered the tacos that they are \"known\" for and the seafood noodle soup dish.\nThe tacos are good, but it was way to sweet to have it as a starter. It was more like a dessert.\nThe seafood noodle soup tasted like water.\nI asked the waitress for some hot sauce, she said \"okay\"\nShe never brought me the hot sauce.\n\nBad food. Bad service. Ugly arrangement of tables.\nWould NOT come back here again.\n\nFor great Thai food try Thai Time and Tawan in the Richmond.", "author": "Chatree T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "Good prices and cheap beer. Nice to see in the Haight. I like the Chicken Eggplant with Basil, and while it may not have the most \"authentic\" atmosphere and menu as other places in SF I leave with my belly full of good food. No complaints!", "author": "Travis H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "My husband and I have eaten here 3 times (just about every time we've been on Haight Street) and we've enjoyed it every time. My favorite dish is the peach curry with prawns, but it's only offered in the spring (good for using seasonal ingredients, bad because I CRAVE it year round). \nThere are several favorable reviews about their Thai tacos, but we found them too sweet, especially with the cucumbers and mirin they serve as a condiment. I'd have preferred some fish sauce and sriracha. \nThe tom kha (chicken coconut milk) soup is always amazing--it's one of my favorite dishes of all time, and they do it right. \nThe \"cocktails\" are kind of fun--since they don't have a full bar, don't expect real vodka or rum in any of them, but they're sweet and easy-drinking.\nIf you have any room for dessert, the mango with black sticky rice is heavenly.", "author": "Courtney K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "A real find.  Family run, fresh food, changing menu and very consistent.  Servers are great.  Love the mango salmon curry in particular.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-27", "description": "This place is pretty good, a step up from Best of Thai Noodle.\n\nI've only had the green curry lunch, it was good.\nI'm anxious to try more.", "author": "Chili B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "Order everything on the menu that includes mango:  spicy mango basil chicken, mango chicken jungle curry, mango with sticky rice.  The pad thai was pretty tasty and Chicken Kra Pro (sp?) is super crispy.  The spicy eggplant is my new favorite.\n\nYou will not be disappointed ... with the food, anyway.  Service is iffy, but that's standard in the Haight.  It's a bit pricey, which is also standard for the Haight.  I've been able to blow it off based on the overall quality of the food, which is NOT standard in the Haight.", "author": "T T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-18", "description": "Thanks yelp!  Read the reviews here and decided to stop by while in SF for the weekend.\n\nIt was great!  The pineapple juice was so good here, I got my sister hooked on the stuff.  The food itself was fantastic.  It was a good time, and we seemed to have beaten the lunchtime rush.  Didn't hurt that we were seated beside some awesome people mathematically calculating what they should order to make everyone happy for 20 minutes.\n\nWould definitely come back if I'm ever on the left coast again.", "author": "Wren R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "I traveled to Thailand last year, not to mention I'm a snob about what I consume. I am pleased to say that this is authentic Thai food that is delicious! It's not upscale and I love that it isn't. It is some real authentic Thai cooking. I tried the spicy chicken lemongrass soup, and it was so zesty with ginger. If you're sick order a bowl of that. It'll give you a boost. The pad thai was good, the satay chicken was good. The service was great! Thank you. The servers were so attentive and welcoming. Only positive things to say.", "author": "Miss P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-09", "description": "This was an unexpected find in the haight ashbury neighborhood.  I went with a large group and tried many dishes.  Most are quite decent.  The standouts are:\n\ncoconut pad thai - had this for the first time.  It's pad thai kicked up a notch with coconut milk infused in the dish.  It's probably very bad for you in a tasty way.\n\nhot and sour coconut soup - came in individual bowls filled with chicken and mushroom", "author": "Edda S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-30", "description": "A friend and I ran into this after yet another spacy stroll on a Sunday afternoon on Haight Street.  Went in to get a quick snack and we weren't disappointed!\n\nBetween the two of us we ordered the Lap Tao Hu..which  was fried tofu (not oily at all) tossed in some sort of a green/red chili, mint leaves and lime vinaigrette sauce. Absolutely delicious!!!\n\nAlso had the spring rolls which were decent. All stars for the tofu! Warning: if you want chinese tea, specify if not chances are the waiter will get you heated thai tea..yuck not a personal favorite.\n\nWill definitely go back to try the jumbo prawns in the coconut curry clay pot!", "author": "sri b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-20", "description": "Wow, I'm surprised at the 1 and 2 star ratings Siam has gotten. Ever since I had lunch here a year ago, I ADORE place! I have yet to have had anything beyond delicious and lemme tell you, as a spice addict:\n\nTHEY DO NOT PLAY WITH THEIR SPICE LEVELS! you tell them spicy and you'll be breathing fire when you walk out. \n\nTheir pad see ewe is one of the more flavorful ones out of all the Thai places I frequent and their quirky Thai Tacos...whoever came up with that was a genius!\n\nOh and just let me say that for the Saturday after my birthday this past September it was an hour and a half wait up the street at Cha Cha Cha's for a solid 12 people...10 minutes at Siam. \n\nTell me any other restaurant that can do that.", "author": "Daneca V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "I Love this retaurant - not only for eating in, but take out.  The food is exemplary and the staff are all super nice.  I love their Param Beef, Chicken or Park dish with rice.  I could literally live on this without a problem.  Their peanut sauce is fabulous. The atmosphere of this small restaurant is peaceful, clean and classy.  No trip to the Haight would be complete without lunch or dinner at this fine establishment!", "author": "Norah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "This is an easy one. Great food (non-greasy, yet tasty), great price ($8-$13 for most items), great service (food ready within 8 minutes of ordering). What more do you want?", "author": "Morin O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "Small little place with delicious food and an earnest staff", "author": "Alyxandra D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-17", "description": "Eh, nothing bad, but overall just kinda average Thai food.  You can do way better across the street at Ploy II (assuming it's not a Tuesday).", "author": "Mark A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-24", "description": "Oh Siam Lotus, how tasty you are.  If only you weren't in the Haight I would eat at you more often!\n\nEven though I only make it here a couple of times a year the adorable waiter always remembers me and treats me like an old friend.\n\nThey have this amazing dish with tempura coconut shrimp served on salad with this yummy tangy honey mustard sort of dressing.  Its so good that my husband who hates salad dressing likes it anyway, and we have tried to replicate the dish at home with varying results.\n\nThey have brown rice which is so much healthier and very rare in your typical thai joint.  In any case, I think they are significantly better than the average thai place in SF but with reasonable average prices.", "author": "Deniz T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-18", "description": "Siam Lotus is my spot! \nWhat kicks ass? Everything. \n\nAll the curries are delicious, and the appetizers always kill.\n\nTasty, delicious, cheap, good atmosphere.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-04", "description": "The Tom Yum is excellent (sweet and spicy, with a kick), and so is the service and ambiance.  Great place to stop in for a quick bite in between all the stores on Haight!", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "Best happy hour ever: $2 pints of good beer (we're talkin Fat Tire and Anchor Steam). When is this happy hour, might you ask? All day, every day. \n\nThe food's good too, they have some interesting curries along with the more traditional Thai fare. But honestly, does it even matter?", "author": "Em G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-21", "description": "Yum. Solid Thai food and a good atmosphere.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-26", "description": "If there is one thing reliable about Thai restaurants, its the hot Thai waitresses.  As much as I like Thai food, the hot imports are what truly keep me coming back for seconds or ordering an unnecessary  dessert.  For those men who have been plagued with the yellow fever like myself, this may not be restaurant for you.\n\nYes they do have A Thai waitress, but she is appealing as the gold styrofoam Thai Buddhas.  Fortunately, the food makes up for the inadequacies of service aesthetics.  They have some tasty appetizers like the Thai tacos or a rice side dish like the pineapple fried rice that will party all the way down your GI tract.  \n\nOne more perk, that conciliates my greatest pet peeve of Asian restaurants--they accept credit cards.  OMG, I never like to say that silly valley girl phrase, but I will degenerate myself for something as tremendous as credit accepted in a Thai restaurant.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-05", "description": "My boyfriend and I go there a lot for lunch special.  We love this place alot!  I love their red veg curry with tofu, it's the best red curry I've ever had!  The gay waiter is awesome too; his service is great, and is the nicest waiter ever!\n\nTheir eggplant dish is also good.  Though the price is bit higher than other thai restaurants in downtown SF, I still love their red curry so much, so I go there alot. \n\nso the nice gay waiter and red curry make me go back.\n\nthey are the best.", "author": "moshi m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "Tasty Thai treasure on Haight. Mango Thai Basil was great. Fast, friendly service.", "author": "michael p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "I really love the thai fried rice. Love it. Crave it all the time. Even when I've just finished eating it. (Un?)Fortunately, Siam Lotus is a block from my house. It's my go-to takeout place, and on special occasions, I even eat in the restaurant. I know, I'm adventurous. The service is fast (sometimes faster to eat there than to get takeout? Go figure). I've even bought fried rice here to sneak into the Red Vic. Some of the waitstaff are a little clueless, but they're sweet and attentive. Last Friday, my friend got some bad tofu. That was sad. But I'll go back. I'll go anywhere for that fried rice. Oh, there seem to be a lot of awkward first dates that happen in this restaurant. If Yelp had an option for me to recommend this place for awkward first dates, I'd check that box. Oh, one more thing: It's always happy hour. Bizarre. But awesome.", "author": "Lara C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-13", "description": "Service was good but I felt that the food was a notch down from mediocre.  I was hoping to break myself of the idea that there were no good restaurants in this area too.  No such luck.", "author": "joe b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-28", "description": "Very very very good Thai!  Superb beer specials, extensive menu and lunch was amazingly delicious.  I've never seen jumbo prawns that big!  Sake selection was a nice bonus and the location was perfect.", "author": "Mark T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "Clean place on Haight, very good food, very reasonably priced. Pretty quick too, just tough parking near Haight.", "author": "Ian K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-12", "description": "I found this place 7 years ago and it is still one of my most frequented food haunts in the City. I hate to pull this card BUT, I have been to Thailand, and Siam Lotus serves the real thing. The food is very good, decent portions and affordable. The ambiance is down to earth, none of those silly costumes and distasteful gold Thai decor so often intrusive in Thai restaurants. The background music usually consists of jazz or some easy electronic beats. The staff, some of which have been there since I have started patroning, is attentive if you need them and  never annoying or in your face for tips. They leave you alone with your food. This place is about the food, not about the service, or the decor. Go for the food.\n\nUpdate: Recently went and was very disturbed by the new tunes selection. BAD BAD pop tunes, Mariah Carey and some others, and too loud to ignore too. PLEASE please bring back the hip music! Please?", "author": "Miranda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-21", "description": "In a sea of fish sauce infused thai food, Siam Lotus has found a delicate balance of flavor without the funk.  I love the consistently delicious curries, noodle dishes, brown rice and abundance of vegetables.  The thai iced tea is robust and refreshing, plus they will make your dish without tofu if you are concerned with genetically modified soy products living and breeding in your belly.  \n\nLast but not least they have they have good service for a casual style dining restaurant (especially if you are a regular).  An overall a great value despite the few cheapsters reviewing here!\n\nAs with most take out places though there is always the risk of getting sick from the food.  Lets be realistic 3 stars is about right.", "author": "Fernando F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-23", "description": "Really liked the mint beef salad, very good flavours. All of our feed was good, not greasy, not crazy big portions. Kid-friendly bright informal place. Substantially better than the food we had from Bangkok 900 on Stanyan. Friendly service. Our two and five year old boys wolfed down the food. We will come back, I'm sure.", "author": "Angus H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "Their food is excellent.  The atmosphere isn't that great, if you're looking for that kind of a thing.  Ploy across the street is cuter on the inside, but the food at Siam Lotus blows Ploy out of the water.  Also, there's a better selection of beer.  If they have the soft-shell crab special going, it is a MUST.  I highly recommend this place.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "Finally, I found a good Thai in the city!\n\nI had my Basil Chicken extra spicy and it was soooooo delicious. My friend's Chicken w Pineapple was very good too. \n\nGood space (i.e., privacy), airy, clean and good service!", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-26", "description": "This place had the best and cheapest Thai food I've ever had. Huge portions! there are a couple of Thai restaurants in the area but this has the best quality and you'll have the most left overs from here! The Roast Duck Fried Rice is awesome. Don't waste your time at ploy 2, Bangkok 500 or best of Thai", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-02", "description": "Great dinner spot my friend took me to last night. The Giesen Riesling was really nice to see on the menu, and everything was delicious. We started with a beef appetizer (yum, awesome dipping sauce) and the fried tofu (not my bag so much). I had the pawns in peach curry, which was absolutely awesome, choochee sauce with fresh peaches! Sticky rice is always good :) My friend had the lemongrass chicken, which looked really good too. The service was decent, but it was pretty crowded so perhaps that made it harder to catch a waiter at times. Overall, excellent dinner spot!", "author": "Irene F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-19", "description": "Am a bio grad student at SFSU and had just spent the night in my lab cramming for my genetics exam. I took that genetics test and as soon as it was over (like at 6) my friend and I were super tired and he was like, am going home in need to sleep! am like okay me too, as soon as i said that am like noooo am hangry! am going to \"reward\" myself with the biggest burrito from el farolito, but wait, what could be better than that? OMG SIAM LOTUS's GREEN CURRY!!!! Here is my ode to the green curry from Siam lotus: I love that curry so much i would marry it and have its curry babies. I will also denounce my Mexican citizenship and officially become a Siam lotus national, Once you have that green curry you will never go back to that overrated marnee thai shit, moreover, i am convinced that the little thai waitresses lace that shit with crack, cause' how else u explain such devotion. \nOkay back to the story, I was soooo exhausted but i was on a mission, I decided to make the trip all the way to height street to have a taste of that succulent, chicken green curry, and so i did. It took me about 1.5 hours to get there, but at the end oh i was soooo worth it. The first spoonful of that curry was almost orgasmic, the \"spicyness\" was perfect, and yes I eat that big boy with a SPOON! cause i like to take spoonfuls of that green curry, and may i dare to say i eat it without taking a bite out of the rice! I love that curry so much I would just drink it, as soon as i started eating it my problems melted away and I forgot all about that effed up \"write the karyotype of a person with translocation on the 18 chromosome\" question. I dont understand the reviews that some people give here. I have been eating at this place for over five years now. I live far away from it, but oh may gawd, you must try it. My favorite dish is obviously the Green Chicken Curry with Brown rice, the veggies spring rolls and the mango ANYTHING. I hope i said enough to convince u to at least try it, if u are a curry connoisseur you will know the quality of this magnificent dish. I couldnt think of a better life simple pleasure that enjoying a bowl of green chicken curry from this place. Priceless.", "author": "Terry R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "I came here about an hour before closing with a friend and the waitress was so attentive I felt bad about not making up my mind for 20 minutes.  They didn't try to rush us out, despite us staying until closing.  +1 service.  Lychee martini, despite my disdain for vodka lately.  They didn't have lychee juice, so what was I to do?  Order it with vodka!  It was strong.  +1.  Something not quite right about the food.  I ordered something like garlic pork with lychee I think.  I thought it was good, but not great.  I preferred my friend's fried rice, but I didn't care for the chicken-that-tasted-like-fish part of his order.", "author": "T. O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-27", "description": "Siam Lotus is where it's at. Let me break it down for you: no-frills, but with a pleasant environment. Friendly wait staff and fast service. A meal that won't break your bank. I've never had a bad dish at Siam Lotus, which is why it gets the coveted five stars in my book-that says a lot being that I eat there at least twice a week.", "author": "louise z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-06", "description": "Lots (I meant LOTS) of veg options. The peanut sauce is devine with tofu, the salad that comes with the lunch special has the best dressing. The rice is never stale or dry, The staff is nice and it is very clean! I hate the lunch to dinner break, it has made me have to find other places to go during the off hours.", "author": "kendy p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-29", "description": "I love this place.  I would have given it 4 stars but the last time I went the waitress sucked!  She practically ignored us and it actually took her 15 minutes to give us our bill and the place was empty!  Usually there is a very nice waitress with short curly hair who is excellent.  She gives great suggestions and wonderful service.  The food is flavorful and the prices are reasonable.  I would suggest their basil leaf chicken and their soups. Yummy Yummy!", "author": "Shani H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-29", "description": "Okay, so I've never dined-in.  I can't testify to the quality of the service, although I can say that the 2,376 times I've walked through the dining room on the way to pick up my order I have noticed that the ambience is somewhat bare-bones.  But, hey, it's the Haight.  What do you expect (unless you're at the Alembic--different story)?  Anyway, the food is consistently good; this is one of my local defaults.  And they remember my name when they see me, which is a bonus.", "author": "Chad W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-06", "description": "This is my favorite thai food place. Not just because it's close to my place but their dishes always seem fresh. They have specials that most thai places don't have either. I had a great Salmon Curry special last time. Actually my fiance couldn't decide on just two entrees so we got three! We have a special place in our heart for Green Curry (Emerald Curry) so that was another dish we got. The last was Crispy chicken that was amazing! I love the duck sauce and the fried rice it came with had raisins and nuts that were a nice addition. The staff are really friendly too. This place is a must!", "author": "Caroline F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "Incredible quality, staff that is above-and-beyond friendly and accommodating, and good prices. I love this place.", "author": "S. F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-02", "description": "I'd like to give them the benefit of the doubt, that maybe the horrible service I experienced was a freak occurance, but after talking to some friends who've gone here, I'm not sure that's the case.  When I was there this weekend, we had to wait around a half hour just to have water brought to our table!  But once you get past that, the food is very good.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-08-22", "description": "Do you know the taste of wet paper? Try their spinach noodles.", "author": "Dario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-18", "description": "Mmm!  The Veggie Param has touched my tastebuds and left its mark forever!  It was one of the most delicious dishes I've ever tasted!  The rich peanut sauce is really piled on thick on this dish.  It comes with steamed (or fried) tofu, carrots, bok choy, cabbage and other greens.  It totally filled me up and left quite an impression!  The Pad-See-Ew (known by some other name on the menu) was also delicious, according to my companions.  The service was pleasant, prompt and courteous.  The place was clean, even in the bathroom.  I think it's a great bargain too.  What's not to love?", "author": "Heather D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-03", "description": "there's a waiter at this restaurant that speaks with a thick thai lisping accent that is just gayer than a handbag of rainbows.  and he does these hand gestures that make it look like he's dancing.  it's hilarious.\n\nthe food is good, the restaurant is generally quite quiet.  i've been here several times, and i'm a fan.  i've seen cheaper places, but it's still reasonable here.", "author": "Crystal T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-30", "description": "Truly one of the best Thai spots in the city and my personal fave. The food is excellent with fresh and authentic SE Asian ingredients giving each dish a unique bright flavor. I lived in Thailand for several months and am often disappointed by the dull dishes many restaurants try to pass off as real Thai cuisine. Siam Lotus delivers every time, great curries, fish dishes, awesome salads, and friendly service. They have brown rice, which is always a nice option, and tons of lunch specials that go beyond the ordinary. I love the eastern thai veggie salad with chilis, mint, and tofu and their green curry is clean and delicious. Great, now I'm hungry.", "author": "Kylie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-21", "description": "I love eating Thai food, so Siam Lotus is a regular stop for me around dinner time. All of my visits are good and filling. I enjoy visiting this restaurant not only for the good food, but for the friendly atmosphere of the servers. I especially like the Pad Kee Mao Jae (spicy noodles with vegetables) with tofu. Of the Thai restaurants on Haight, this is the one you should visit.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "This place is sooo good.  Ive been to a lot of thai places and this one i still remember i came here after hours of shopping in the haight and its the perfect place to go to i had the Thai Basil Chicken and it was amazing!  I cant find any other restaurant that matches up to this one.  and of course you have to eat pad thai when you eat thai, you're probably going to get Pad Thai and their Pad thai was great also .", "author": "Shelley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-21", "description": "I do love me some thai food!!! Mmmmm mmmmmm! I've gorged myself at many a fine thai restaurant, this one had some dishes that delivered like I\"ve never seen before or since. I still sit and reminisce on their coconut pad thai from time to time, haven't been out to try it in almost a year. Not certain if the entire menu delivers at this level, but damn, I just loved this dish!", "author": "BOB r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "I went to this restaurant my first night in SF about 4 years ago and remembered hating it (it was probably the company more than the food). But I went here over the weekend because Ploy Thai across the street was closed... and it was pretty good!\nIt was pretty standard decent thai food but their menu was huge! I think all of us were a bit baffled. So many veggie options - and unique ones at that. Very exciting. Somehow I decided to order boring old yellow curry. I think I was tempted by the kabocha squash. It was tasty!\nI got the golden triangles for appetizer and yum. Great peanut sauce too.\nWe had to ask for water and the check and my friend complained about too few mushrooms in his mushroom string bean dish but other than that, I think everyone was fairly happy and the staff was super friendly.\nI have to admit I still like Ploy Thai better but I would come again... especially if Ploy was closed.", "author": "Laura V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-13", "description": "I found this place to be so-so.  I ordered the spinach noodles with vegetables--really greasy and salty.  I also ordered one of their specials, which was salmon and mango curry.  This tasted pretty good.  I thought it would all be cooked together though.  It was basically a piece of salmon with curry sauce poured over the top, and slices of fresh mango on the side.  Just wan't what I was expecting.  I don't think I'd go back.", "author": "Kandi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-28", "description": "Quick, delicious, consistent. If you want spicy, they can go there. Also, the employees just seem like good people. The red curry is bomb.", "author": "Beatrix K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-01", "description": "The food was great and the service SUCKED!!!  Are waiters in San Fran on salary?  Because the majority of them that I met didn't seem to give a hoot if I was there or not.  Case in point: Siam Lotus. We sat at the table w/o menus or water for about 25 minutes.  I mean, come on!  The food was divine but I was so angry at the waiters, who ignored my attempts at eye contact repeatedly, that I decided that no matter how good the food was, it isn't worth going back to, unless i read some really kick-ass review of it.  The emerald curry was fantastic, along with the dish my friend had, which consisted of a pineapple spciy curry sauce with prawns.  Just heavenly. Their sangria was good too, but not worth the 45 minute wait to get the drink.", "author": "Beth G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "I actually like this place, which is surprising to me. Their food is spicy enough and just right for my tastebuds to take in. I also love the consistency of their curries; it's like silk in your mouth.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-29", "description": "my FAVORITE thai restaurant. \ni love this place and will go & eat there EVERY single time i go home to the bay.  \n\neverything is good.  i stress everything.\n\nthings to definitely try:\nchicken coconut milk soup (this soup makes you close your eyes and go \"mmmmmm..\"  (hahaha.. no joke!))\ncrab cakes\npad thai\nchicken and pineapple fried rice..\nshitake scallops & prawns..\n\nand the fried banana or sticky rice and mango.. mmmmm..\n\nit's right in the middle of haight so you can't go wrong.  it's not huge.. but not to crowded either. \n\nafter you walk the blocks and blocks of mom & pop shops.. hit up siam lotus..\n\nyou won't be disappointed!", "author": "Joyce O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-22", "description": "Definitely stoked on the meal we just ate there! We ordered spring rolls which were quite tasty, the Mango Jungle Curry which our waitress warned was very spicy but wasn't unbearably so and was very unique and flavorful, the pad see ew which was some of the best I've had and a coconut curry dish which had a deliciously spicy flavor. Our waitress was very nice and attentive, and there wasn't a wait to get a table and service was quick. Nice little alternative to Citrus Club across the street without the crowds and the wait! Bill ran us $53 for 1 appetizer, 3 entrees, and 3 beers.", "author": "Nick H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-13", "description": "Watery curry, unappetizing looking peanut sauce, bland calamari... nice presentation.", "author": "Marty G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-01", "description": "I'd eaten here a few years ago and had remembered how much I loved their papaya salad, so I really wanted it again when I was visiting SF. My friend and I grabbed dinner here on a Friday night. We were seated quickly, but probably waited a good 10 minutes to order and get water even. Also, it wasn't overly busy so this was frustrating. I ordered the papaya salad for a starter and the lamb curry. My friend got some sort of spinach noodle dish. Well, the waitress either didn't hear, or understand, or forgot my salad dish because I never got it, the entrees just came right out. Normally, I would have said something, but I decided I'd probably ordered too much food anyway so I didn't bring it up, but it wasn't very impressive that they would forget. The food was very good but since they forgot my order, had to just give 3 stars. Also, you have to purchase rice separately, even with the curry dish.  Overall, good, but they could be more attentive.", "author": "Jim G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "My regular place for casual Thai grub. The won ton wrapped shrimp and angel wings are delicious starters, along with a papaya salad. Solid curries and the basil chicken is grubbin!  The Pad Thai (new age which is saucier then traditional) is probably one of the best if not thee best in San Francisco.  One of my favorite's, which isn't always on the menu is shrimp with glass noodles (goong woon sen) in a clay pot.  You don't see this dish too often and its even harder to find someone that makes it right.  Last but not least, you can't leave this place until you have fried banana ice cream!  The bananas are dipped in batter and fried to perfection.  Glazed with honey and chocolate sauce, mmmmm mmmmm delicious!", "author": "Peter S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "I liked this place. Went there last night and had the Golden Curry (Gang Karee) with chicken and squash. What you do is smush the squash in with the rice and then you get double starch. Yum. We also had the Spinach Imperial (Pad Mee) that was very delish. I esp liked the shitake mushrooms in it. It was perfectly cooked with a slight tinge of burntness that makes it extra yum. The service was serviceable. efficient. bye.", "author": "sambacat w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-30", "description": "the thai ice tea was really good (tho a lot of ice). ordered a spicy veggie rice noodle (nothing special) and crab cakes (good) to share. probably could have gotten better thai food for cheaper. i think i'll try having some thai rice dishes instead of noodle dishes.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "I've been going here at least once a week since I moved to the area 2 years ago. The gals that work there are super friendly and the food is really high quality for the price. They know I either get the Pad See Ew or the Chicken Yellow Curry (both are very tasty). Sometimes if I bring a guest I will get the Thai Basil Beef and the Mangio Jungle Chicken Curry. Yum!", "author": "Josh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-02", "description": "Siam Lotus is a really clean restaurant and has really nice employees who were always prompt in getting whatever we needed. I got the pad thai with chicken and it wasn't anything special... the chicken was really dry and it had this really watery sauce that made it soup like... it was slightly bland too.", "author": "Mitchell F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-01-28", "description": "On my never-ending plight to find that divine Thai meal, my hunger brought me to Siam Lotus after yet another Amoeba excursion. The food smelled good, yet unfortunately my meal would not match the aroma. I ordered the coconut soup which, in the words of Droopy, was \"wary, wary bad.\" More like, \"Tasteless,\" which is even worse. I thought I was playing it safe by ordering the yellow curry, and soon found out that no such thing as a safety net exists in this joint. The chefs here have not quite figured out how to thoroughly cook vegetables. There was also this odd aftertaste with every bite....one should not have to ponder what him/her are eating....especially when dining out. I wish this restaurant nothing but  the impending doom it deserves.", "author": "Kenny G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-23", "description": "Siam Lotus was the very first restaurant I ate at some years back when I moved here, and was pretty damn good, and still continues to please.  Their only drawback is the fact that they don't deliver, but worth it to pick up.  I'm a creature of habit and only ever order Pad Kee Mao, however, when I ask for medium spicy they know how to find that perfect middle range. The pad kee mao is filled with a ton of vegetables, and the right amount of sauce, and somehow they know how to not get the rice noodles to stick together in one big glop like I've had at other places.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-28", "description": "The Golden Curry I had here was awesome! As was the Pad See You I tried from my friend's plate. Great food, good prices. Quick service.", "author": "Gabor C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "Best Thai on Haight. Sometimes under-staffed. If you work in the industry you know what to expect from the servers. Polite, and well... Haight Street hospitality. Epic Panang Curry. Check the specials board ya'll! Focus on the food and your company.", "author": "Mauby N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "I love Siam Lotus, this is my second favorite Thai restaurant in the City. (Little Thai, on Polk is my favorite). I really enjoy their calamari, the Chicken in Yellow Curry (although the potatoes aren't always throughly cooked & it's pretty gross eating semi-cooked/semi-raw potatoes), other dishes that have slipped my mind and ALWAYS the Thai Iced Tea. The service is good and the restaurant is pretty spacious. I must say that it's pretty tough trying to enjoy a meal when there are people outside who are hungry and are panhandling for change. Parking is hit or miss, but all of these outside elements one must be prepared for when spending time down in the Haight. Keep up the good work Siam Lotus!", "author": "Sheila M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-15", "description": "I love this place.  Though I miss the old wait staff, and hope for better service these days, the food is good, prices are reasonable.", "author": "holly e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "One of my favorite Thai places in SF.  Great lunch specials and service.  I tend to go for the Spicy Thai Noodles, pumpkin curry with chicken, or spicy eggplant.  I am never disappointed.", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "The food is not the best Thai I've had but is definitely better than mediocre.  The food alone might only merit 3-3.5 stars, but this place earns extra for reasonable prices, friendly and attentive service and beer that was superior in both selection and price -- $2 for a pint of anything on tap: Anchor, Sierra Nevada, Fat Tire, Ranger and others.  I probably wouldn't go out of my way to go again, but would be very happy to return next time I find myself in the area.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-15", "description": "Excellent curry and sticky rice. Tastes just like in Thailand. Wish they had Chang or Leo beer though :0(", "author": "T M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-29", "description": "Everytime I visit the bay area I make sure to stop at Siam Lotus. It's the best Thai place in town NO DOUBT. Food was delicious, service was great and price not too expensive. I would recommend trying everything on the menu as I'm pretty sure it's all good from what I had so far. You should also try the dishes on the chef special menu for something different from the usual. The northern curry egg noodle (kow soi) is a must try!! It's really good and I'm from the northern part of Thailand. The tom yum fried rice is also a must!! The thai tea float is a hidden gem on the menu. If you thought the thai tea was good, the float brings it to a whole other level. I thought the Pad Thai was also very yummy and very similar to what you would find in Thailand. The Pad Thai I've had down here in LA does not compare. The larb tofu was also very satisfying. Now on to the best part DESSERTS!! If you are going to get dessert get the Rotee. Words cannot describe how good this is. You just have to try it for yourself. The mango sticky rice is also good once in a while. However, if you are lucky, they also have dulce de leche cheesecake from time to time. It's one of the best cheesecakes I have ever had, even better than Cheesecake Factory!! So ask for it and you might be in for a real treat :)", "author": "Justin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-29", "description": "i agree with the other reviewers about the service at this place, however, i am willing to overlook it because the pad thai here is just SO DAMN GOOD.", "author": "Eileen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "don't even look at the menu, you want the yellow (or golden) curry.  seriously.  best yellow curry i have ever had.  if you don't lick the plate then you probably don't like good food.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-17", "description": "Unfortunately, the food was not that good. I've lived in Thailand for over a month, and maybe I'm spoiled, but that does not mean there are no good Thai Rests. here in the US. The Pad Se Ew  was really dry, pasty, noodles - beef was dry-  not flavorful, and the lime-ade drink was just awful.  The service was so-so, not really like they care if you ever come back.  Such a great location but that might be the only thing going for it.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "i love this place.  the veggie pad thai is different from any other i've had.  it's fresher and the sauce is sweeter.  not better, just different..and a nice segway from usual pad thai.  the vegetables are fresher than any thai i've had in the bay area.  the spring rolls are very fresh too and more peppery.  the restaurant has a really cozy feeling to it too.  lovely.", "author": "Kate W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-09", "description": "wandered here after a day at the academy of science.  i order some curry dish on the lunch menu...  i think it was the first one.   it was ok, i've had better.  the bf order spicy eggplate rice dish with chicken.  His was delicious!  they only have small tables and wooden chairs - no booths so it wasn't very comfy.  good for lunch tho.  service was good.", "author": "Hello.kitty.kat S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-02", "description": "We've been trying to find really decent Thai food in the Haight/Cole Valley area.  Ploy II is our favorite, so far, but it's not open for lunch.  So today we tried Siam Lotus.  We started with the Golden Triangles, which were tasty, but not necessarily divine.  I had a veggie tom kha, while Sweetie had a chicken tom kha.  Mine was clearly the superior soup.  I wasn't crazy about the floating half-mushrooms, which seemed not to have been very cooked.  I like my tom kha with straw mushrooms, not button.  Anyway, moving on, their lunch specials are really reasonably priced.  My shiitake/green bean stirfry with brown rice seemed to be very overly salty, but Sweetie's into that kind of thing, so he didn't see a problem.  He ordered the Thai basil chicken with white rice, and said it was really good.  I like that they use rooibos tea, which always gives a Thai iced tea that characteristic smoky flavor.  The servers were very friendly, and the decor is cute and interesting.  We'll come back for lunch, but I'll probably try something else next time.", "author": "L. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-08", "description": "Best Thai curry in SF.  The Panang is a great deal - you can have two or three meals for 11 bucks if you order a couple of containers of steamed rice with it.   If you want a quick, delicious, decently priced meal, this is the spot. The staff is really nice, to boot.", "author": "Karthi X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-27", "description": "my favorite thai place in san francisco.  the golden veggie is awesome and they have a great cucumber salad.  i've tried a lot of the dishes there and have never been disappointed.  This is a good place to go when you  are with a group of 3-4.  prices are average for thai in a tourist area, but worth it..", "author": "Katie Sue A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-27", "description": "my king loves the lemon coconut sauce with prawns. it was his first restaurant in SF. he's very pleased.", "author": "Lady O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "I work near Haight Street, and I usually go to Ploy II when I'm craving Thai.  However, the service at Ploy II at lunchtime is seriously spotty, so when I'm in a hurry and need fast, efficient service and decent Thai soup, I come to Siam Lotus.  I always have the Spicy Veggie Rice Noodle Soup, which is tasty and super-filling.  The friendly waitstaff usually give me free refills on soda, and they don't forget that I exist like the young waitstaff working the lunch shift at Ploy II.", "author": "A W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-26", "description": "this is decent thai food, sure, in a city where there's practically one per block. meaning that i don't consider it a destination place: i might not travel out of my hood (where there's thep phanom, thai place II, phucket, chilli cha cha, thai corner express, etc) to eat here, but if you're in the UH, i think it might be better than citrus club or maybe even ploy II. we had veggie spring rolls, pad see ew, and a chicken-veggie rice dish. mine was fine but i saw the coconut pad thai spesh on the way out and wished i'd gotten that. our server was both surly and silent and it wasn't quick by any means but piping hot when it arrived at the table. they were playing KOIT lite rock which was a little bizarre and i think there were some thai hookers sitting next to us (not that it matters) so i felt the ambiance a bit odd but no complaints about the food. it was good, probably better than most typical SF thai places. extensive menu and good veggie options.", "author": "Mary V."}
