{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "They did a excellent job in upgrading the amphitheater several years ago.\nThese days ... I wish people attending actually spend more time \nenjoying the show instead of yaking 80% or more of the time. So annoying. Go to a bar or coffee shop. I considered it wasted on a beautiful place and show", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Even if you don't go for the free concerts, Sigmund Stern Grove is still a wonderful place to enjoy a bit of green. If you go on less busy days, you'll be able to find parking in its tiny little lot. From there, you can enjoy the concrete theatre right next to the parking lot or go for a short walk and enjoy what the rest of the park has to offer.\n\nMy personal favorite spot is... well maybe I shouldn't reveal my favorite location, but I enjoy reading a book there. Regardless, you can spend an hour here or meditate for 4 hours if you so desire. So while Sigmund Stern Grove can get ridiculously busy on event and free concert days, it can also get ridiculously serene and empty any other day. There's something for everyone here whether you want to attend an organized event or just find some peace and quiet.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "I was headed to Poindexter Cornelius Esquire Park to test my balsa wood glider this past Wednesday.  But unfortunately the tape on my glasses was flexing too much due to the above average fog and I had no choice but to turn back.  After twisting my ankle last week I have really had a tough time.   (I am considering doubling my Vitamin D regimen but you can't trust the dosage information printed on the labels so I don't know which brand to buy.)  Thanks for nothing FDA.  FYI Sucks.\n\nAnyway, when I was almost home I had a change of heart and headed to Sigmund Stern Grove.  I've got a pretty sweet glider FYI, so I figured I'd go for it.  So glad to have that park nearby.  As soon as I stepped into the park, for some strange reason I started crying. I was all, \n\"Sigmund, THANK YOU! SO MUCH!!\"  I don't know what happened FYI.   I digress, but few people are aware of Sigmund's heroic action in saving this eucalyptus park which was not easy for him at all.  \n\nYou see, Sigmund lived down the block from me.  I remember, he was just out of college living with his parents in the Sunset after graduating from SF State.  He got a degree in something or didn't graduate.  Either way getting a job was super hard and rents around are so damn high.   So he moved back in.  I mean it's tough. \n\nBut Sigmund's an above average dude FYI and given sufficient time also industrious. To better his situation, and after really thinking it over for a couple months like in that movie \"I Graduated\" by Dustin Hoffman,  Sigmund decided to become a YouTube artist.   That was a good move, I think.  He's so talented.  He could do so many things I'm sure.   For example, he could strap a camera to his chest and ride around the neighborhood on a bike and say if a hill is hard to climb or if he is tired today or another possibility would be a channel exploring personal appliances like taking apart a toaster oven.  For sure, ad dollars would start rolling in from all his new fans  \n\nBy the way, most people don't know this but Sigmund can do 15 pull ups.  Just FYI.\n\nAnyway, one time after spending most of morning planning out his YouTube channel Sigmund got bored and decided to head out to the park to unwind and think clearly and what not.  And then without any advance notice at all, near the benches in the middle of the park, a coyote walks over to near the garbage cans.  It was just like in that Westworld prequel with Kevin Costner \"How to dance with a Wolf\" where this glitching host heads out to the Land Beyond and finds this kind of unfortunate looking dog who is pretty hairy and has a big nose.  \n\nSo then, Sigmund summons the courage of Akecheta the ghost tribe dude with the blood hand imprint on his neck from Westworld, and yells at the coyote to \"get out of here\".   To this day, most likely, Sigmund checks to see if there are any coyotes lurking about and is ready to act again if need be.  On top of all that, he also used his mom's laser printer and google translate to put up a sign to warn people of the danger in like three languages.  So in thanks for keeping the park safe, it was probably named after Sigmund.  FYI.  The end.", "author": "Asper K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-30", "description": "This is a commercialized park area that has caused many traffic problems. The grove is used a couple months during the year for the concerts  where music is played very loud and drunk people can be found walking around the area afterwards, another Dolores Park and illegal parking like that of Outside Lands.\n\nWhen they are having other big events at Stern Grove such as weddings, the grass area is often used as a parking lot for their valet staff. The place is tossed with litter and other garbage the vendor isn't responsible for. \n\nThen there are everyday patrons whom ride their bikes across the paths clearly marked no bikes allowed. And then there are dog owners whom believe the who grove is a dog park and walk their dogs off leash because they believe their dog won't even harm a fly. Not to mention less than half of the dog owners every pick up after them.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-06", "description": "I still haven't even been to a Stern Grove concert once since living in SF maybe ten years. They have free concerts every summer with indie rock too. I started to come to the Grove to play tennis and the courts are good and not too busy. Last time I played, a group of high school guys with a chaperone came by. I have not explored the rest of the park, but I always drive by. It's not very big essentially, but it's a park amongst a vast cemented area with tracks of houses(the Sunset). Parks are important to city life and this one is a nice retreat.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "OMG! this place is amazing~ I will say it's another dog heaven park second to the fort funston. I went there on Sunday at around 9am. it's not crowded at that time and a bunch of parking spaces. So parking is pretty easy for me. Dogs could be off-leash here and they really love it. can't believe that i lived in sunset for 1 year and never found out such a gem in the city. definitely will come back for other trails in this park in the future.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Came here on a Sunday looking for something to do during this past summer.  Since they had the Stern Grove Festival going on, decided to check it out with some friends.  This was my first time to the park in general, but it was an even more amazing with the concert going on!  The free concert (donations accepted) was really impressive, the music that day was great.  The crowd was pretty mixed that day, and everyone was really just there to have a great time.  They had some food/drink vendors available, but it looked like you can bring your own food/alcohol as well. There was plenty of seating all around the stage, and it was pretty massive, much more than I would've ever guessed.  Too bad it only happens during parts of the year, but I'll be looking forward to this when it rolls around again!", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-24", "description": "The Scare Grove Event was terrific! The descent down the path through the eucalyptus trees made for a perfect setting for the Halloween party. Scare Grove is definitely the best kids Halloween party in the city. The wide expanse of the park and the stone seating around the amphitheater gave us ample room to relax, eat or just enjoy the show. In accordance with custom, the kids eagerly flaunted their costumes, breaking them in for a night of partying. We give our son as many opportunities as possible to spend time in his costume before All Hallows' eve.  To be sure that he's comfortable in it before the 3 hour dark trek through our neighborhood. \n\nThe craft  tables were terrific. My son made quick crafts while I held his place in line for the other activities. His fav. activies were definitely the \"make own magic wand,\" the face painting and the scamper through the hay maze to the toddler friendly haunted house. We especially loved the carnival rides. The ride staff were extremely friendly, definitely making it a more of a celebration than a mere event. A Juggler and Characters kept the tots occupied in the lines. Older kids weren't left out either. In the clubhouse, adjacent to Pine Lake, a creepy graveyard path through the trees led you into the haunted house. The live actors dressed as ghouls appearing in front of you and some lunatics stabbing body parts provided enough excitement for terror lovers. I do regret not getting zombie face paint. I was indecisive, as I am partial to being a vampire.  \n\nThe food truck choices were also diverse and didn't break your wallet. The heat lamps in the dining section were a bonus.  Luckily, the night was warm and we were well sheltered from the wind by the trees. Thanks for another great year SF Rec & Park!", "author": "Evelyn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-24", "description": "I went for a sunday concert July 23, 2017 Cumbia in the Grove\nLOS ÁNGELES AZULES.\n\nWe came 1h before, but they already closed the corner entrance to the park. No chance of using regular restrooms then. OK, so we walk all the way around, and then come close by, to see that the main grass area in front of stage is closed too. \nBut where to go? we went up and up, thru dust and slippery paths, to end up on a log. OK not too bad, but you can not see a thing (there were dancers on the stage). The music was OK, but not loud enough - no acustic stage. If it was 500 people in that venue=park, maybe it would be enjoyable. But with so many people -- waste of time. If you do not mind spending 4h waiting for the concert in the park, keeping your 'spot' maybe you can enjoy the concert. Otherwise do not bother. Next week is SF ballet, but it is useless to go since you can not be close enough to see anything. ;-(", "author": "Zorana V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "It was my first time to go to Stern Grove and I thought it was beautiful. We conveniently found parking nearby and decided to go in one of the trails. There's a huge open spot where people perform, which was why we were here, and it was just amazing how there were tall trees around the area.\n\nThe air here felt great and it felt fresh.\n\nThere are restrooms nearby and no, they're not porta-potties. They're legit bathrooms!\n\nCaught a lot of Abras here BTW if you play Pokemon and there's a couple of lures lol.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "Stern Grove dog park is a lovely asset to any family with dogs.  I regularly take my Grand Dogs there.  I am so impressed with San Franciscans courtesy to each other and their dogs.  Everyone I've seen appears committed to keeping the area poop free.  The dogs can run freely off leash and play with each other.  I have not yet seen any real friction. Enjoy a walk to the pond and circle back to sit under the trellis and make friends.  Plenty of free parking.  Great place to take a baby stroller.\n\nOne should be aware that there have been problems in the past with coyotes attacking small dogs that wander into the bush.  So don't think just because this park is in the city, that it is wildlife free. Keep your pups on in the center play area and they should be fine.\n\nThe pet parents are friendly and", "author": "Suzanne K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "One of the most beautiful places in the city to get married.\n\nOne of the most beautiful places in the city to watch a live concert.\n\nOne of the most beautiful places in the city to go for an afternoon stroll.\n\nOne of the most beautiful places in the city to dance by yourself.\n\nOne of the most beautiful places in the city to just sit and relax.\n\nOne of the most beautiful places in the city...\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Absolute greatest place on earth. I spent all of high school at this place on Wednesdays, Fridays and Saturdays. Great community that gathers here, feels like a second family. The kids who go here get a bad rep I think, but they're all great and respectful. The whole place itself has great scenery and lots of different things you can do. Take a visit and buy a cup!!!", "author": "Deirdre C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "Nice park and looks like it also an excellent wedding venue. Has a large concert area also. Didn't see too much of the place but what I did was cool and relaxing. Lots of people walking dogs off leash. Not sure you \"can\" do that but seemed like the norm for most people.\n\nLots of redwood trees and a cool little pond also. Lots of trails and nature in a valley. Little bit of parking in the park down a tricky to see entrance and hill. Maybe 15 spaces tops so dont count on it being available but lots of parking on the street so should be fine and not a long walk down.", "author": "John R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "This place is rad.\n\nI mean you walk/drive/bus by this spot so many times and then when you actually walk IN to Stern Grove...it's like the \"woah, who knew\" factor.\n\nDuring the summer, the free concerts are so fun! Bring a blanket, food, wine/beer/water, and sun screen (you're welcome)! \n\nSuch a fun place to go for a lovely stroll, peace and quiet, or a rad free show! :)\n\nKeep this place lovely SF", "author": "Carina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-11", "description": "Once again 5 stars for nature-Wooo-hoooo!! Stern Grove is a favorite of mine in SF and although there are parks a-plenty in the East Bay, where I live, there is just something so darn magical about the various parks in SF. Maybe it's because one moment you are in the city and then once you enter, there is a sense of peace and solitude in the midst of all the urban fervor.\n\nThings I love most about Stern Grove: easy parking and highly accessible, the scent of the trees surrounding you, and the fact that it's so spread out even with a lot of visitors you still feel the sense of space and calm.\n \nThere are various trails you can meander around as well as wander around the ampitheater section, which, this time of year has some beautiful flowered trees blossoming. There was actually a wedding party taking photos when I was there this last weekend and it seems they were setting up for their ceremony in the redwood grove up past the parking lot. It was all very serene and felt miles away from the hustle and bustle of 19th and Sloat.\n\nIf you walk through the grove and concert area, you will reach Pine Lake Park which in and of itself also a lot of fun, with an offleash dog area and lake with tons of birds to look at (separate review on that to come.)\n\nOverall, just another gem in SF and a reason for me to wish I lived in the city so I can take advantage of all these various wonders any day of the week!", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "I've been here a few times for shows (Tuneyards (2015), Andrew Bird (2014), and Rufus Wainwright (2014)), and it is always quite something. Here are some thoughts:\n\nI've always gone in through the Wawona/22nd entrance, and the walk is gorgeous and delightful. So much greenery, and especially big on the tiny flowers everywhere. But beware! Getting to a free Stern Grove show even two hours before the opener comes on = you will be seated on hilly, angled dirt, despite your picnic blankets. Maybe the latest time to arrive for a 2pm showing should be 10am!\n\nOtherwise, I'm always amazed that the city's able to put on these spectacular shows. The sound is impeccable, and the overall quality brilliant. I imagine it's nice just to take a little hike in the area when it isn't ridiculous summer festival time, too! A true SF gem of a place.", "author": "Shendi X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "I've been here many times over the past years for the Stern Grove festival. This is a great venue. A natural amphitheater that carries the sound evenly wherever you sit, laid back crowd and great scenery from everywhere. Not to mention the excellent festival itself. Big name bands, big sounds and people dancing everywhere you look. \nIf you haven't been here yet, what are you waiting for?", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-21", "description": "This place is as beautiful as it gets. I almost want to call it a hidden gem in San Francisco.. \n\nThe Sunset district has become my new favorite area to explore, this place is like doggy heaven because of all the dogs running loose in the dog park area. \n\nI'm still wondering how you can escape the city and get into this park walk a good 15-20 minutes and come out in a new part of the city. \n\nIt's super peaceful to be here, my advice is to stop taking photos after a minute and just enjoy the atmosphere, fresh air, tall trees, friendly people and all the dogs. \n\nThere is a whole stage in the middle of the park for Summer concerts that seems to seat a lot of people and it's just an overall amazing place that makes you feel entitled to write a review about it. \n\nI want to visit every time I'm back in the city.", "author": "Narek M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Lots of trees and dirt. Definitely a park. Fun place to have a lunch followed by some outdoor fun.", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "How does this exist in the middle of the city!!?! This park is beautiful, very peaceful and kept very clean. I attended a wedding here in the \"clubhouse\" that is on the property. It was an amazing venue for a wedding. I think all the guest's were shocked that this little haven existed like I was. It's also situated near the amphitheater which is a really cool site to see.\n\nThe place they held the ceremony was under huge trees. Our group was about 85 people, which fit very nicely and was still intimate. The house had a wrap around balcony/patio which was perfect to have drinks and apps on. The inside is small so I don't think you could fit a group much bigger than ours. It was truly an adorable space. \n\nMy only -1 star was for the parking lot being a little far from the clubhouse area. During the day its easy, but at night its a little scary to walk so far with no lighting at all unless you bring your own. Street parking if you walk up a big hill might be the better option.", "author": "Natalie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Good place to walk dogs and to go on walks or jogs. They have some amazing festivals which are mostly free to all and sometimes have a very minimal entry fee. Great place for family and friends to hang out.", "author": "Amrita S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-27", "description": "Love this place.\n\nDon't come here. This my own piece of paradise. Stay away.\n\nGo play over at Golden Gate Park instead.", "author": "Glenn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Parking may sometimes be an issue, but this place is totally worth it. My dogs love it here! The San Francisco Chihuahua Meetup group is here the first Sunday of the month from noon -2pm. The dogs love to be off leash and socialize.", "author": "T G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-08", "description": "I decided to take a little adventure with my dog to Stern Grove. It was Jan 2nd and a beautiful sunny day. I have driven past this place for a few years and finally decided to explore it.\n\nWe had a lovely walk through the trails and I discovered they have an off-leash dog section, which was a total surprise! My dog loved that. \n\nIn total we spent about 3 hours walking up and down trails and my dog running with others. It was wonderful!", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-23", "description": "Coming here for a quiet weekday walk really hits the spot. With lots of gems like this in the city, one can truly acknowledge how amazing and unique SF is as a city.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "Really nice play area for dogs. If you park near the dog play area it's an easy (and safe) walk for your pup over to the play area. There are water bowls for the dogs and a path around the lake if you want to take a walk. The one downside is all the foxtails here, but you can mostly keep your dog away from them as long as you stay to the grassy areas.", "author": "Kathleen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-26", "description": "Grab your Derby Jackets a 40 and walk down the stairs to the grove and you have relived my childhood!  \n\nLiving 4 houses from the entrance on Wawona this was my larger than life backyard.  Playing on the hidden rope swing, playing hide and go seek in the dark here, listening to the free sunday concerts from my backyard.  This was my life here in the Avenues. \n\nMy favorite memory... well, almost favorite - can't tell you THAT one! LOL  But a bunch of us got blankets and slept in the croket inclosure under the stars and the sound of the cars on 19th Avenue. \n\nGood times and a great place.", "author": "Erika G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-29", "description": "While Stern Grove is well known for its summer concert series, it also boasts arguably the city's finest dog park, as well as a beautiful natural lake.  The dog run is incredible.  It's essentially two football fields--connected lengthwise--nestled in a valley surrounded by mature eucalyptus trees, which allows even those of us with dogs with less than perfect recall to play off leash without excessive paranoia.  My dog loves the ability to run on long stretches of grass, chase and play with the many well-behaved dogs that come on the weekends, and barnstorm through the woods surrounding the main field.  Most days, you'll find enough dogs and friendly dog lovers to make it social for you and your pup(s), without the park being overrun.  The park is also very family oriented, with people of all generations enjoying romps, and very few dog walkers.  The one concern I would note is the increasing number of sightings of and encounters with coyotes, so you may want to avoid going too close to dusk or dawn, when coyotes are more active, particularly if you have small dogs.  Pro tip: enter the side parking lot on Vale Avenue and Crestlake Drive for easy access and plenty of parking.", "author": "Ronald C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "It's certainly a great place to check out on the west side of San Francisco; in fact, I'd argue that it is a nice gem. There's a large outdoor amphitheatre with ample seating and a large dog park next door. Plus, you'll find a lake nearby. Always nice to see the tall trees and see the dogs playing with each other.", "author": "Paul N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "one of my favorite spots on the west side of the city! \nStern Grove is a must visit, whether it be walking your pup in the meadow or enjoying a summertime concert the park puts on every year. \n\nwhen you walk down the pathway, you suddenly lose all of the noise from the cars and traffic and are in (a what seems like) hidden meadow to relax, read a book and enjoy the scenery. \n\nyou may even see the banana slugs coming out of the ground on a moist afternoon! \n\ni also found stern grove fitting for a memorial for my fish. and therefore Stern Grove will always be in my heart\n\nRIP ROGER \n\ni love Stern Grove.", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-14", "description": "Stern Grove is a hidden gem in the city. It's located at the edge of the Sunset and, on a sunny day is a great place to go on a walk or to go to just lay on the sun.\n\nThe Stern Grove concerts are awesome here. They are free and run on Sundays throughout the summer. Sitting among redwood trees, in an outside theater, picnicking and sipping wine while listening to live music is a great way to spend a lazy summer day.\n\nI have also attended a wedding at Stern Grove. The day was unseasonably warm and the tables were setup on the field area. The atmosphere of the wedding was one of the best I've been to.", "author": "Johanna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-26", "description": "The dog run at Stern Grove is fantastic! I was a fan of St. Mary's for the longest time then wondered how I never made it here for so long. This is my new #1 favorite in San Francisco.", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Dog, and dog-owner, heaven. One of the main reasons I stay in the city as techies and billionaire Ron Conway take over our beautiful, generous city... turning it into billionaire-city-by-the Bay! (Ronnie Con is best friends with Mayor Lee and he tells Lee what to develop and because of Ronnie's deep pockets, Mayor Lee always listens!) \n\nStern Grove is a safe place for small dogs to run free... even though there are many large dogs here too. This park is so big and friendly that small dogs can roam without feeling scared of the bigger dogs. So many great dog owners here too.... I've learned so much about caring for my dog from the many friendly folks who go here. I strongly encourage anyone who loves this place to join the Stern Grove Dog Owners group on Facebook https://www.facebook.com/groups/SternGroveDogOwners/... to keep up on what's happening at the park and to be alerted to any threats from SF Rec & Park who is always looking for ways to privatize our publicly funded parks! We need to keep our dog community strong so we can protect this park from the evil-doers at Rec & Park and City Hall who pander to billionaires in the name of \"activating\" our parks. \n\nIf you think this park is safe, be aware that several years ago, the City tried to turn a large part of this park into a parking lot!!!!! Thanks to the dog owners group at that time that didn't happen! Thank you to those who saved this park! This is such an important spot for dogs and the community that we have to guard it from the greedy politicians.\n\nBTW, the Chihuahua meetup is the \"FIRST Sunday of every month at Stern Grove Dog Park! EXCEPY July and AUGUST which is the FIRST Saturday of the month.\" It starts around noonish and there's always a crowd of maybe 75-100 dogs.I don't own a Chihuahua but I have a small dog and this is her favorite party of the month. The Chihuahua people are very inclusive, friendly and know how to part-TAY! Check it out if you have a small dog, as your dog will enjoy all the sniffing and greeting of dogs their own size. My dog comes home from these meet-ups exhausted and so happy!", "author": "Les L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "My boyfriend and I went there on a Sunday afternoon stroll. It was so beautiful! We are so blessed to have nature like this in the middle of our city!\nIt's deep in a little valley creating a Jarrasic Park-like feel. The doggy park is huge which made me want a little pupper schmupper so bad!  At the end of the grove is a small lake with duckies, and a somewhat provocative rabbit statue.  After walking through all of the grove, we headed over to Lake Merced - another amazing spot!", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "I love everything about the free summer concerts at stern grove. Tips: there are more women's restrooms in the yellow house (as opposed to the buildings directly to the left of the stage area), get there around 10:30 with books to read for good seating- show up at 2 and you'll be hiking up into the hills, and of course, bring blankets and snacks!", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "My friend got married here this past weekend and it really is a nice quiet place for an outdoor oasis like wedding day.  The farther parking lot off of Vale is pretty far from the Concert Grove where the weddings are usually held, but otherwise, it's an ideal location for an outdoor wedding without blowing up a typical wedding's bloated budget.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-09", "description": "who knew such a great park would be right by sfsu!\nit was as if the city didnt exist when you walk into the park and i was starting a hike.\ni would like to come back with my dog because i saw a lot of people walking their dogs off leash, which is always a plus for me!\nmight want to put on some mosquito repellant because of the standing water around in some areas.", "author": "Anita W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "I have no idea how  we missed going to this place during several several visits to SF. It has always enticed me from outside and we decided to stop by this place, amazingly serene place. It has a concert venue just can't wait to come back here in summer. Its a pet friendly grove and one can see several pets enjoying the lushes. Its an excellent hiking spot, or to just lay around with a book on a beautiful day. Please do yourself a favor and bring along some good music to amplify the ambiance. Trust me you will thank me later for the experience. Beautiful Place in all.", "author": "Geetha K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "I got married at Stern Grove this past October. This is a review for Stern Grove as a wedding venue.\n\nCONS:\n-Do not allow balloons, candles, tape, and amplified music outside. (to assure the preservation of the park and peace in the surrounding area)\n-Parking MAY BE inconvenient for guests. There are two parking lots in Stern Grove. The first parking lot, which is located just outside the Trocadero Club house and ceremony area, only accommodates about 10 cars. The second parking lot, on the other hand, provides ample parking for your guests. Guests parking in this lot will be required to take a 5 minutes walk through the concert meadow to get to the ceremony area and clubhouse, which they will either find quite pleasant or an inconvenient chore.\n\nPROS:\n-Despite it being right on busy 19th avenue, Stern Grove is free of ALL traffic noise. It is so quite and peaceful down there.\n-It's VERY affordable.\n-The Trocadero Clubhouse is absolutely charming and is big enough for a max of 180 guests. It is better suited for a smaller party though. ---\n-The front patio is perfect for cocktail hour and general mingling.\n-The ceremony area just outside the clubhouse is lined with gorgeous Redwood trees and provides a natural, cathedral-like space for a wedding ceremony.\n-The rental of the clubhouse includes access to their huge kitchen, complete with operating stoves and sinks.\n-The rental also includes the use of their saloon-like bar. My husband loved the bar because it was, as he put it, \"old school.\"\n\n\nPlease note that since Stern Grove is a public park you have to remember that you can't expect the full service you would find at other wedding venues. Set-up and clean-up are the responsibility of the renters.\n\nBest time for a wedding her would probably be during Indian Summer... from September-November.", "author": "Ella M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "This is my favorite park in the city!\n\nI swear  you can tell that there is more oxygen from all the trees.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-02", "description": "good place to go to get some exercise. They even have section where you can take your pet dog and play fetch with. love that it has a baseball field that conects to the\\\\\\", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-11", "description": "This review is for the park, and not the concert series, which I have reviewed separately here http://www.yelp.com/biz/w6_Oi3o3dZv8W1OfV8UOYA?hrid=IA2gy-Rv4chY00FPeezzhA\n\nSigmund Stern Grove is a beautiful neighborhood park.  Walking down from the corner of 19th Ave. and Sloat, among the eucalyptus trees and nasturtium, you can't help but feel the magic of this place.  \n\nAt the bottom of the drive is the Redwood Grove.  It is dark and shady, quiet and cathedral-like.  For this reason, it has been the site of many wedding ceremonies and remains a quiet place to read or take a break from the sun.\n\nNext to the Redwood Grove is the Trocadero Clubhouse.  It used to be a hotel for the elite of San Francisco, but this use ended with Prohibition.  The Victorian structure remains in pretty good condition, and can be rented for private events, and houses the pre-concert talks for the summer concert series.  My old company held a Christmas party here and we had a grand time shaking the dance floor in the quiet of the grove.  There is a very decent bathroom right next to the clubhouse with lots of stalls for women (yay).\n\nThe grove itself is best known for the Summer Concerts, which is one of the best activities to do in San Francisco.  It is said that Mrs. Stern went around with an opera singer test various spots in the park to determine the best acoustics before setting up the location of the stage. The re-vamp by landscape architect Lawrence Halperin was a welcome change.  Additionally, \"talking posts\" for the sight-impaired have been added, as well as more paths to keep people off of the lawn as much as possible.  Right behind the stage is the largest tree in San Francisco, a towering eucalyptus with a huge trunk.  Hopefully, none of those branches will come down any time soon.  I have heard that if you spend the entire day in the park, you will leave smelling of eucalyptus.  Yum! \n\nThe hillside, which tends to erode from people sitting on it, has been cleared of many trees which were then used to create natural benches, and that are reinforced by deep stakes to keep them from moving.\n\nThe West Meadow is a sunny spot to hang out on a blanket on a clear day.  Please do not use plastic tarps, as these kill the grass and leave ugly brown spots - yuck!  Drinking fountains for humans and pets can be found here and by the Trocadero parking lot.\n\nAbove the seats in the concert grove, there are paths that allow you to wind around the trees and are perfect for dog-walking in a wooded environment.\n\nAcross the main parking lot is Pine Lake Park, which is currently being renovated to include a dog run and new, beautiful grass for our four-legged friends.  This part of the park can be also be entered at Crestlake and Vale.\n\nThe park is rarely crowded and people are responsible for picking up after their dogs.  For some reason, this park does not seem to attract the homeless or lurkers.\n\nA wonderful place to escape the wind and city stresses.  Go when you need to get your Thoreau on.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-19", "description": "Just as the Lorax once did I shall speak for the trees, for the trees have no tongues. Wooded groves are awesome and San Francisco should have more of them, especially ones like this where dogs can frolic off leash. I'm always amazed at how much better I feel when I'm in the proximity of greenery.\n\nThis park is fairly small, but good enough for a long walk with your 4 pawed pal. There are also a couple of open fields for frisbee tossing and tennis ball throwing. About half the park is currently fenced off for refurbishment (hence only 4 stars). \n\nWhile you can't totally lose yourself in nature as in farther away parks like Mt. Tam, Stern Grove is still a doggie friendly gem closer to home.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-03", "description": "I love the idea of having a wooded venue deeply confined within the space afforded by tall gigantic Eucalyptus trees.......only in the city would one find something to escape the daily confines influenced by traffic, work, and just plain old stress.\n\nWe heard about an Indian group performing, so we packed a quick lunch with bread and deli meats from Andronico's, the boys brought cookies from Cost-Co, and I had purchased some fruit from a fruit stand.  Armed with the nourishment and several large blankets, we surveyed the diminishing patch of greenery and found a spot to stake our claim.\n\nThe music was not bad, although I felt it geared a bit more towards hippy folk music.  Our neighbors were cordial and I loved how everyone would mingle and dance together.  \n\nI'd come back here any day of the weekend to lounge around and listen to great music and spend time with wonderful friends.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "A friend and I went and saw Mary Chapin Carpenter a few weeks back. It was my first time there, I was awed by the trees that beautifully surrounded the place, and the way you could pick a spot in between the trees to sit and have a picnic or the cemented levels for those whom didnt want to get too dirty...the acoustics was the best, so was the crowd. And of course the entertainment off the charts. You will definately see me there again and again!!", "author": "Doreen G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Walk there, parking limited from East side. Great for kids to climb and explore", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "Love this place when it offers it's free concerts in the summer. Beautiful remodeling they have done since I remembere what it looked liked before.", "author": "Maile W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-31", "description": "Soo close to my boyfriend's place. Beautiful place to walk your dog or just to take a stroll. It's naturally beautiful here with the gorgeous trees. I want to take some pictures here on one of these beautiful days with my love. :)", "author": "Amy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "Wonderful park for an outing with Rover.  Somewhat ambiguous about where actual off leash area is in the park.  Wouldn't want to get a $250.00 fine from a ranger.", "author": "Mark I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "Great for taking me dog for his daily 2-3 walks a day. Love the fresh air and its close proximity to my house.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "I have passed Stern Grove a million times and have never stopped. I knew it was well known for their Music in the Parks but had no idea is was such a great place to to take your dog. There is a huge off leash dog area where your dog can play. The smells of the trees is an added bonus.  Easy hike on the lower trails.", "author": "Maverick W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "This is a total hidden gem in the city. It gets 5 stars for being so secluded even though it is very accessible. Also they have a nice off leash section for dogs.\n\nI brought a picnic lunch, walked a few trails, and lazed away an hour with a book here and it was like I wasn't even in the city. Awesome.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-22", "description": "Well, well, what can I say. Bella Valentine has a blast here! There are all types of dogs here, extra small, small, big, tall.. all of em! Its cool because there is a cement paved way for you to walk on, and if you like you can also get your shoes muddy in the grassy area. Most of the dogs that Bella comes into contact with are mellow, and sniff her politely. She has never had an experience which was negative. \n\nThere was an occasion (about a year ago) where 2 big dogs were fighting and one of the owners tried separating the two and one of them got bit. The dog owner tried pulling his dog off the other dog, and during that attempt his own dog bit his hand pretty bad. It was bleeding and he was kinda in shock from the experience. The other dog that got bit was bleeding on his ear. Anyway long story short, keep an eye on your dogs when you come here. :P \n\nOccasionally there is dog poops on the grass/cement from parents behaving badly and not picking up after their kids. So watch where you step!", "author": "Alice E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "This is a really nice and peaceful place to walk your dog or just go for a stroll. It's located in the city but has a rural feel to it; this feeling is great when you want to get away. Plenty of room for your dog to roam around in and be social with other dogs. The park even has fairly clean bathrooms available.", "author": "Robert H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "What a beautiful hidden gem!!!  Who knew you could be in Muir Woods without driving over the Golden Gate Bridge?  \n\nThe smell of eucalyptus is heavenly and the redwoods are majestic.  The large fields are perfect for dogs to run around to their heart's content.  Our two Frenchies have a wonderful time here (including the time when one walked right into the lake and my boyfriend had to jump in to save him!).  There are lots of trails to explore and wildlife to enjoy.  We saw tons of banana slugs and some great birds (in fact, a hummingbird was hovering right under the entryway when we walked in!  How idyllic is that?!?)  \n\nParking is a cinch and crowds are not a concern (except for concert days).  One of my favorite places in the city!", "author": "Kristin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "This is a great place to take your dogs. They have a nice little trail around the pond and a fairly large off-leash field. I used to take my dog there everyday when I lived in the neighborhood.\nThe only thing is if you have a dog who likes to go swimming, you should be wary. There is a pond that isn't fully surrounded by a fence. One of our dogs loves the water, so we can't let her off the leash until we get to the field.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-14", "description": "Stern Grove is the place to be at for recreational activities. Better yet, an event held for 10 Consecutive Sundays every year known as the Stern Grove Festival which starts in mid-June ending in mid-August. This is a free event that is good for kids, adults, and the general public.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "This past weekend was my first time back to Stern Grove since junior high (over 15 years ago). I love that this place exists. It's absolutely awesome for family picnics and just being out in the open air with other people who enjoy the park. I love love love that there is free live music, and it's an ACTUAL concert with a real stage and a real sound system and professional musicians. I am most definitely taking my kids back here as much as we can go. Picnic + live music = best way to spend family Sundays. \n\nParking isn't impossible. A little walking doesn't hurt.", "author": "Anio D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "A beautiful park in the south west section of San Francisco is an art and entertainment gem in the summer months. Here you can have a picnic and listen to the symphony or popular music. The Stern Grove festival has been going on for 75 years. The park is over 100 years old.The amphitheater has been improved and redesigned. The sound system is superb. There are picnic tables and Pine Lake in the western portion.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-23", "description": "Beautiful park!  The bathroom is a ways down but no harm is a lil walk, just hope its not an emergency. Enjoy!!", "author": "Siai M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-08", "description": "An enchanted forest hidden in the city! What a magical place!\n\nI love the free summer concert series here .... including the SF Ballet!\n\nGive 5 to the Grove!!!! :)", "author": "RyanLee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-26", "description": "On 8/20/10, I got married here.  Yes, it was a Friday, but man was it a perfect night.\nIf you are thinking about having a wedding at Sigmund Stern Grove, here are some things to keep in mind.\n1) Book ahead of time for summer/fall weddings...but don't limit yourself to weekend ceremonies.  Reserve the ceremony site as well as the banquet hall.  It's a great bargain.  We decided to hold the wedding on a Friday because it was open (at night), and it was a great way to kick off a weekend!  \n2) The weather inside this forest was very calm and mild.  All week long, the fog rolled into the city.  We were afraid it would get into the Grove.  We were prepared with firewood for the fireplace...but didn't even need it.\n3) Rent extra chairs for the ceremony.  It's worth the trouble and $$ here because even though they provide chairs, the backs of them are marked \"Stern Grove\"...not so great for photo opt. \n4) Hire security from the company Parks & Recs suggest.  No need to go outside here.  At no point did we feel a need for security to push uninvited ppl away.  It was Friday...Also hire them from about 7:30-closing time.  Save you some money.\n5) Come prepared with extra decorations...they not only add color, but it gives the entire place a great feel.  (DIY the thing!)\n6) Look into alternatives for catering...we did Pizza Politana and it was a hit.  Not only did they serve great pizzas, but the addition of a kiln on site was awesome for ppl to see.\n7) No amplified sound for wedding ceremony except for wedding vows...but hire horns/violinists/acoustic instruments sound great here.\n8) Rent 15 inch speakers...Avista has some great deals.  Two speakers really knock it out the park :)\n\nOverall, I'd say that it was a great experience for everyone who came.  The site is over looked by many ppl (most don't even know where it is) and for the price, you can save $$ for a great vacation afterward.\n\nLogistically, if you are doing a night wedding, they don't allow you to jump into the site until 5pm.  We set things up in a little under 2 hours.  We ran a bit late for the start, but worth the wait.   Be mindful of this 5pm rule.  \n\nThat's it!  Enjoy your event!", "author": "felix c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-21", "description": "This is wiener dog's favorite park! It's green, for a change. Instead of mostly brown like Pt. Isabel, Fort Funston or Cesar Chavez. \n\nI sat down on the deceptively clean grass and got dog poo on my pants.", "author": "Trixie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-28", "description": "EDIT: SIGMUND STERN GROVE IS CLOSED. The park is being rebuilt from the ground up\n\nI argue that this is the best dog area in the entire city. The shear size of it is pretty impressive. Plenty of parking is a nice bonus.\n\nIts one of the few areas you can go on a long walk with no leash, usually you have to settle for walking along irrigation ditches.\n\nMy only complaint is that there aren't any poop bag poles\n\nDirections:\nFrom 19th head west on Sloat until you can turn right on Vale Ave. The entrance is at the end of Vale.", "author": "Brando Calrissian .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "Since I was a little lad, I've always wanted my own Secret Garden. (Damn those British made for television Victorian-era movies!)... and in all humility, this place does it for me. \n\nBut I'm willing to be persuaded.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "Don't miss the free concert series during the summer. Come here early (10AM or before), grab a nice spot with your blanket. Have a brunch under the sun in this beautiful natural amphitheater. Put some sunscreen on. Give to the Grove.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-24", "description": "Stern Grove is back from the dead, and it's got a brand-spanking-new six-foot bunny and a moat to boot (more on them in a moment).  \n\nThe nearly-completed makeover of Stern Grove not only addresses many longstanding issues with one of San Francisco's better dog-patches, it has substantially improved the park for humans and canines alike, with amenities that make it a pleasant place for an extended romp for two and four-legged creatures.\n\nIt's been a long time coming.  Rec and Park practically abandoned the meadow around 2003, and while field conditions could never be described as optimal before then, due in no small part to a lack of a central irrigation system, the past few years saw Stern Grove decline into a dirt patch that alternated between a dust bowl or mud pit, depending on the weather.  Following the upgrade to the concert area, the meadow was closed in late 2006, torn up and cleared of excess Eucalyptus on the hillsides, Pine Lake dredged and cleared of plants that were clogging the lake, and a new central irrigation system installed.  In addition, an arbor now graces the central gathering area of the dog play area, and stonework, benches, and water fountains (with dog bowls -yay) are spread out over the park.  The result is a park that was already a great piece of open space for a quiet walk with or without a pooch is now a terrific park, with a beautiful green meadow, places to sit and relax, and refreshment for human and beast alike.\n\nNow about that bunny and moat:  At the west end of the park, just beside the camp building and Pine Lake, San Francisco's first Jackalope has appeared (see photos).  Perhaps a tribute to hash-house-harriers, or some other bit of symbolism that's over my head, this whimsical and slightly disturbing statue gives my dog the willies, causing him to walk around it in a wide semicircle.  The moat is a long and narrow pit that has been dug to separate the dog play area from the camp/picnic area (see photos), an attempt to end what has long been a sore spot for the camp, dog owners and dogs not reading the signs noting where the play area ends.  No word on whether trebuchets will be installed to hurl campers or dogs that stray beyond their boundaries back to their proper places.\n\nFor all the pro and anti dog sentiments in San Francisco, the renovation of Stern Grove Park should hopefully give everyone something to feel good about.", "author": "Hugh B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-27", "description": "Sigmund Stern Grove\nCovered in fog or awash in the hot sun, this place is a Bay Area treasure that not one more person needs to learn about because it is already packed regardless of the weather conditions.  \n\nCall on Monday at 9 am to get a seat for 4 at the tables and your in luck though everyone thinks they are getting 6 seats and you wind up sharing with 2 groups but you can make it work. Of course in thanksgiving, when the fabulous Liz S walk by seeking \"alms\" you hand her a 20 spot.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-11", "description": "Stern Grove is our favorite dog park!  It's absolutely gorgeous and there are always plenty of friendly dogs & dog owners around for us to socialize with.  As soon as Bailey smells the eucalyptus trees (about a block away), she starts getting excited in the car.  She just loves trips to Stern Grove!!\n\nWe typically pick Stern Grove over Fort Funston because it's not as much of a production.  Parking is close and we can take Bailey for an hour-long romp without the sand and wind that you get down at the beach.\n\nDon't get us wrong, we love Fort Funston, too.  It's just that a visit typically takes up an entire afternoon.", "author": "Amy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "Seen from the outside on a foggy day, Stern Grove looks more like the Forbidden Forest than a place to spend a lazy afternoon. But when the sun comes out, it turns into a whimsical escape in the middle of a big city. \n\nMy first time going, I felt like I was entering the Secret Garden, walking down a steep trail on the north side of the park, everything covered in a light moss as it was the first sunny day in spring. When I approached the pavilion, I was convinced I had slipped into another world. There was a performance art group with masks practicing for a show. They were wrapping their bodies around trees, letting the sunlight catch their masks while a choreographer shouted instructions from the stage. My friends and I found a nice picnic spot in mixed sunlight where we spent the rest of the day quietly hanging out, listening to the traffic echo through the valley. It was this perfect day that reserved Stern Grove a special place in my memory.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "This is a great place to take your dog and interact with. I live just down the street so I have easy access and it is beautiful during dry clear days. There are benches along some of walk ways, and a \"centralized sitting area\" where you can relax while your dog goes off and has fun. Some of it is nicely shaded some of it around high noon, not so much.\n\nThe grassy field is quite a few football fields large, and its a nice relaxing walk. There are drinking fountains that are made tall for humans, and short for your canine companions. The whole park area is in a giant ravine, so unless you can't keep your dog in your line of sight for the life of you, you have a worry free environment for your dog to run to its hearts content.  Most of the other dog owners are very friendly and welcoming. In just the handful of times I've been here, I've gotten to know many owners and their dogs.\n\nThe only two issues I have is sometimes their are crazy people around. Twice in past couple months I've heard of fights breaking out between dog owners, even saw one and had to give a police report. The other is that during the wet season, the park becomes like a swamp. But I'm not gonna let a couple of bad hot heads and rainy weather keep me down, that's just life.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-15", "description": "Maggie the dog loves this place. She perks up as soon as we turn into the long driveway, and gets more and more excited as we make our way down the long slope. There's usually a good selection of dogs for her to romp around with, from tiny terriers to big goofy retrievers and labs. There's a lot of room for her to run and hopefully be chased. It's the perfect place when she's feeling energetic and we're feeling lazy; all we have to do is sit on a bench while she makes friends with anyone that will play.\n\nPlus, I recently got married at Stern Grove's Trocadero clubhouse, and loved it! They price is right and the facility manager is super-helpful. It created the casual and open atmosphere we were hoping for. And while Maggie didn't make it to the festivities, a few other dogs wandered through the reception on their way to the dog area.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-28", "description": "Home of one of the coolest dog parks Josh and I have ever played at!!  So many cute doggies!  All of them were so very friendly.\n\nThere is also a little lake with ducks and turtles swimming about.  Also we saw a huge fish meandering along in the water.  There is also a little concert field with neat stadium seating.  \n\nIf I lived in SF, I would totally be here as much as possible!!!!\n\nI give Sigmund Stern Grove 5 stars.\nJosh gives it five paws.\n\nWord.", "author": "desiree n."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-23", "description": "I am embarrassed to say that even though I have lived in SF for 12 years (holy crap!),  the first time I went to Stern Grove was this last Sunday for the Stern Grove Concert Series.  What an amazing place!  I love Love LOVE trees and they are abundant here!  Everything is lush and green and when the music stopped:  SILENCE.   Can't hear the street noise down there in the forest... can't hear anything but the breeze moving through the creaky trees, the birds and your own breath.\n\nSo cool.", "author": "LeSLiE W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "Great place to take your dogs and let them run around off leash.  There are signs indicating where you can let them off leash, and where you shouldn't.  And in case you see a lot of other dog owners out there who are ignoring the signs...their dogs may be very well behaved and come when called even with distracting ducks, and ponds to jump into.  But if your dogs are the types that will run off be careful and keep them leashed cause I let my dog off one time and she ran into the pond and came back all muddy to her chest, not fun getting back in the car!! But she had fun none the less.", "author": "Charla M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-06", "description": "i first went here in high school for our senior picnic, and i remember wondering how something as beautiful as Stern Grove could be in the middle of a city like SF.  I've got to go with friends to 2 concerts last summer and it was freakin' jam packed!  \n\nrandom quote:\n\n*peter from family guy, in a spoof of Narnia, falls into a cabinet, that leads to another world, where a centaur greets him*\n\npeter: give me my coat back you goat bastard!", "author": "Ray R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-26", "description": "I'm pretty sure this park is where fairy tales play out when we're not looking.\nI can't believe this forest of solitude lies in the middle of our busy city!", "author": "J C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-13", "description": "Tony (my Boston Terrier) and I don't attend the park very often, as most are driving distance, and he only really needs a backyard, with his size. I had the day off yesterday and decided to check out Stern Grove. Amazing.\n\nIt was a bit wet because of the rain, but the grass field in the middle kept the mud in check. \n\nThere weren't many other dogs, as it was a weekday, but Tony managed to meet some friends. Dogs ranged from small (a tiny chihuahua) to gigantic (2 huuuge mastiffs)! All were friendly, and enjoyed the massive amount of space and the nice hills to climb.\n\nThe other people at the park were all very friendly and seemed to really care about Tony and I. This place is amazing. Go there.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "Who doesn't love the Grove? What more can you say? And I highly recommend renting the club house for your next party or wedding event!", "author": "Larina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-21", "description": "My puppy and I went to Stern Grove as his first puppy dog park experience.  What a JOY!!  Both sunshine and cool shade.  Lots of water fountains for the pooches, benches for the owners (aka human parents) to hang out.  As much as I'd like to say that there weren't dog piles in the grass, there were, so you do want to make sure to wear shoes that you can hose off.  \n\nBut what a treat for my little guy.  All the dogs, big and small, were fantastic or else their owners had them on a leash.  If you're dog is overly rambunctious, the other dog owners shun you so it's a pretty good idea to be mindful of your dog's behavior.\n\nCan't wait for another sunny day!", "author": "Anonymouse C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-20", "description": "Great place to bring your furry, 4 legged pal! I was introduced to the \"dog run\" area of Stern Grove last weekend by a friend of mine who has been bringing her pup there regularly. It's a HUGE grassy area, about the size of a football field, where the dogs are chasing balls, frisbees, or simply sniffing each other! I have a little 6 pounder, so I was a little nervous about all the big dogs there, but I soon found out they stick to their own sized buddies or they're too busy playing fetch. All the little dogs seem to cluster around one another, so that was nice.\n\nMy little Napoleon was able to meet quite a few small dogs there and even ran around with me for a little bit. I also heard that there's a nice stroll around the lake that people can do. There's a parking lot you can pull right into, but if that's full, I would imagine that you have to park on Sloat and walk down to the dog run.\n\nGreat place for dogs!!!", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "This place is fabulous. Beautiful little oasis tucked in the middle of 19th ave craziness. I love, love, love the summer music series they have here. They have a little something for everyone. Reggae, classical, Latin I've even seen some really interesting Hawaiian musicians here. It's a great place to come with some friends and share a great bottle of wine, good food and some wonderful music. Some things to keep in mind...admission is free so come early to get a seat. They do a picnic table lottery which starts in May other then that it's first come first serve. They do sell food there (but not alcohol) but it can be pricey so I suggest you bring your own.", "author": "Michele H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "What a lovely gem - the lush, wooded valley in such an otherwise urban area is a surprising contrast and once you start down the path from the sidewalk the city just seems to fade away...\n\nMy friends got married here and had a lovely ceremony and a beautiful reception even if the mosquitoes did try to ruin the photo ops on the bridge...\n\nCheck out the music festivals - I don't think they do the bluegrass festival here anymore but the Stern Grove Festival is still going strong.", "author": "Quartknee K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "My rule for going to this dog park is the doggies can come once every two weeks right before their bath. The park is large and beautiful, but not enclosed. In laymen terms Momo & no fence= me running around the park chasing them. One day I thought I would trust my beagle off leash to make new friends. Immediately after unleashing her, she darts off for the parking lot. I looked like a crazed Woman running after her. When I made it to the parking lot I spotted her jumping into this poor woman's car. I had to coax her to come out and then another random dog jumped into the same car. Apparently her car is very popular. So lesson learned only one of my beagles can be trusted to not run away. I do like this park a lot because the people are really friendly and there are always dogs there.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "A lovely art-deco-ish mysterious oasis in a redwood grove.   Such a neat place to sit and read with your dog at your feet, listening to the animals in the trees.  I wrote some poetry here.  One day , on May 9th, I came near the old mansion. To my amazement, I heard Russian music from the WW2 era.   Inside, babushkas and dedushkas(grandmas and grandpas) were playing music, singing and dancing.  Some were crying.  Turns out Jewish Family Services rents this place every year for the old WW2 emigre/veterans from Russia to celebrate victory over Germany.   Stern Grove has much magic in it!", "author": "Illiena V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-21", "description": "My dog is not a wanderer but i never have to worry about her running towards a street. It is always chilly when I visit here so wear a warm jacket. it's a nice open area with grass (it used to be all dirt). However, I would ask for more waste bins. Try to get your puppies to do its business before running around for fun because the only trash bag you'll find is at the entrance...\n\nand who wants to carry poop all day long. i know i don't.", "author": "Oanh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-04", "description": "I am a bit biased because I live next door to this park. I'm glad not many people know about it and that it's not in the middle of the City. There are never that many people around unless there is an event or the weather is unusually beautiful. I like to take strolls through the wooded part or take my daughter to the small park they have there. You can get a great workout but it can be a bit scary to go running in the woods even in day light. You may want to bring some mace. A lot of people use the part of the park designated for dogs. There is a big space for them to do whatever dogs do.", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-01", "description": "I came across this park because of a Boston Terrier meetup.com group.  I've been here about three times for that sole purpose for 10 AM meetings.  It's well worth it to get my pup socialized with many other dogs of his breed.   It's pretty funny to see them all running around and though they generally look the same they're all really different.  I've never had a problem parking here.  It's large and I don't even know how large it really is.  There are benches but the owners never really use them during this meetup.  There's plenty of grass for the pups to roll around in and quite a few folks taking advantage of nature's gifts.", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "Walking around this incredibly lovely grove made me feel happy to be alive. There is an abundance of eucalyptus trees and inhaling their fragrance makes you feel healthy. You will notice many bird species. Adorable doggies are  parading with their proud owners. You even get a bit of an aerobic workout walking uphill in the grove. The caretakers home is something out of Hansel and Gretle....Wildflowers abound. What a great get away right in the city.", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "Gorgeous park! Small and intimate and just plain pretty.  I came here for the 2007 Benefit Gala for the park and was lucky enough to have this place to myself.  No crowds.\n\nUpdate*** Came for one of those free sunday concerts and it was amazing. Get there early and DO bring a hat and sunscreen", "author": "Tamar N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-30", "description": "Update: The dog park is open! The dog park is open! I'm so excited! I ran through here the other morning and it's awesome! Green grass, nice benches, lots of doggie bubblers (that's what we call water fountains in the midwest), and the best part is that the pond is much, much cleaner and safer for the pups. As my niece would say, \"Hip hip hooray!\" They get their fifth star back!\n\nWhen is the dog park going to open again? They are pimpin' this place out for Fido...Real grass, no more potty on dirt, and they drudged the pond so it's cleaner and safer for the diggities to swim in. When is this place going to open again???", "author": "Kristin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Stern Grove feels like a smaller, more neighborhood-y version of Golden Gate Park. We go almost every day to the dog park here. Doggie LOVES the off leash area where there are always several dogs romping around. The off leash area is a flat grassy plain enclosed by surrounding woods and a lake. Everyone is friendly and dog oriented. The atmosphere is very relaxed and relaxing. We have not noticed much poop on the ground. In fact it seems pretty clean overall. There are benches to sit down while the doggie plays and a couple of stations of water fountains with some metal dog bowls lying around to use. If you want to go somewhere other than the dog play area, there are some short walking trails going through the woods and there is a paved circular drive if you and the doggie want to take a walk but need to stay clean. We feel so lucky to live so close to this wonderful park where she can RUN.", "author": "p v."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-24", "description": "This review is for the serious Sunset runners who want to take their speedier workouts off the track every once in a while.  While not spacious enough to accomodate long runs, Stern Grove is just about perfect for tempos, hill repeats, and timed intervals.\r\n\r\nWhat strikes me most about this place is the sense of seclusion it facilitates.  It's remarkable that a park just off of SF's main North-South thoroughfare can feel so isolated.  Gorgeous trees tower overhead, creating a natural canopy and lowering the temperature by 5-10 degrees on any given day.  There are plenty of hilly trails to explore, most of which look both long-forgotten and rurally beautiful.\r\n\r\nFor whatever reason, this park attracts quite a number of dog walkers, which may irritate some runners.  In my experience, however, the animals have always been well behaved.  I also wish this place were a little bigger.  But for a brief reprive from the madness of 19th Ave and some very fast-paced and inspired workouts, Stern Grove fits the bill admirably.", "author": "Karin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "It was my first time going to the park and fell in love with it! What a beautiful park. It's in the middle of the city, but when you walked in... it feels like you are somewhere deep in a grove. When approaching the park, I could smell the eucalyptus trees.. smells good! What a gem in the middle of a busy city! \nI have to explore more!", "author": "Daisy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-08", "description": "We went the first time this morning and it rocks.  I love this place.  The people were very friendly and everyone kept their dogs under control.\n\nKudos for the paved walking path.  I usually take my baby and my dog, so it's nice for the dog to run, and me to be able to push a stroller on a paved path.", "author": "Leah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-12", "description": "This place ROCKS as a dog park.  Living in the city it's hard to find a small patch of grass yet Stern Grove takes care of that problem!  There is so much grass for your doogie to play and roll in.  \n\nEveryone at the park is very friendly and courteous.  You rarely find poop on the ground because everyone is good at picking up after their pets.  There's a parking lot next to the park or you can walk down on the many fabulous trails.\n\nMy puppy loves it here and has made many great friends!!", "author": "B P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-03", "description": "Great off-leash dog park with a paved path around it. Weekend concerts sometimes, too. Has a parking lot, drinking fountain that is dog-equipped, and duck pond.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-06", "description": "the Prima Dachshund just looooooves to crap here. her papa takes her to the Grove at least once a week for playtime, where she can run free and frolic. butterflies are free to fly, didn't you know. she chases the big ugly dogs and nips them on the nose if they try to mount her. all the other dog moms and dads just think she is an adorable doll and they share their yummy treats with her. she is a sweet precious darling to the untrained eye but in reality, she is a spoiled manipulative little twit, just as her Mummy taught her.\n\nbut she lifts her leg like a dykey dog b/c truthfully her daddy wants her to be a boy. so now I have a freakin transgender transwhatever little sausage hound. and when she comes home she smells like dirt and eucalyptus and I have to bathe her twice with Paul Mitchell puppy shampoo to try and remove the smell from her fur. the first and last time boyfriend dragged me to the Grove, I bitched for an hour about the stench. I would rather have been at Stonestown, believe me.\n\nbut a happy Princess Dachshund makes me happy so I am willing to sacrifice. despite having crud stuck to the bottoms of my shoes.", "author": "Prima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-21", "description": "I know that the Eucalyptus are non-native and invasive.  But they are so lovely that I just don't care.  Stern grove is absolutely beautiful due to the towering Eucalypti with those silvery fronds, and the way the sunlight filters through.  I too read too many fantasy books as a child, and thus look at Stern Grove and think enchanted forest.  I love Stern Grove, and I adore Stern Grove Festival b/c its all this + great bands + good friends + strawberries and wine. :)", "author": "RJ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-03", "description": "My dog had gone on quite a few doggie dates here. The dog park is located down a hill in a little valley-type area, so the steep surrounding hills form a natural enclosure.  But it still feels open and offers an expansive off-leash area for dogs to play and run. This place is our stand-by alternative if the Fort gets too crazy or windy.", "author": "Joy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-09", "description": "Beautiful park surrounded by huge trees! Once you walk down the pathway from Sloat St, you forget you are in the city, tucked away amidst all the thick wood trees, it makes a great serene environment to take a walk with your loved one, have a picnic or just sit on the park bench and enjoy the surroundings. Definitely come and catch a show during the Stern Grove Festival in the summer! So worth it.", "author": "Yan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-07", "description": "This review is for wedding reception only.\nI fell in love with this place for my wedding reception and was 95% sure I was going to book it.  As with most brides I had many questions that I needed answered so I was advised that the building manager would be present on Sat morning to answer questions.  I attended on Sat morning and a wedding reception was taking place in the afternoon and I felt like I was in the way when asking questions.  He advised me to send an e mail with the question which I did.  He responded by telling me to come by at the week end.  I explained that I would prefer the answers e mailed and that was 6 months ago and I havn't heard anything since!  Also I picked up the impression that they are not very flexible on times and not very helpful in general\nVery disappointed with overall impression", "author": "shorty O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-23", "description": "me, wifey, Boston Biggie, got here late for the monthly BT meet up. But was able to catch up with a few bt left at the park. I was surprised at the size of the park. Do come in on sloat and not wawona. Nice grass, moist ground because it rained previously. But Big loved it. I like how it's secluded from the outside and you can let your dog just roam free. Big can't wait till the next meet up at this park and hopefully his dad and mom can wake up early enough to get him there on time... only complain is the old lady that feeds everyone's dog. \"some owners dont like me feeding their pups\" yeah no sh*t b/c they dont know what the F you feeding them. If someone doesnt like something you would think you would stop. I didn't say anything to her but she kept feeding Big. hello! I was starting to get irritated. Big stopped playing and running just to get treats from her and it took some time before I just said it was time to go.  Some people do that so they get all these dogs attention and feel like dr. dolittle. \n\nOther then the annoying old lady, and another one that brings her dog with major skin disease do to fleas and ticks I had a great time.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-28", "description": "Everyone knows of Stern Grove for their summer concerts in the park, but how could I have grown up in SF and not known that there's a side entrance to Stern Grove that leads to an off-leash Dog Park?! The Stern Grove Dog Park is a great place to take your puppy pal, and pretty clean for the most part. Just watch out for the occasional pile of poop ;) ...There's also a lake at the end of it, which I've heard dogs like to jump into on hot days. Oh and they have a doggie water fountain for your little friend when he gets thirsty from running around...But if you're an anal dog owner about your dog drinking straight from it, then BYOB (bring your own bowl). The entrance to the dog park is on Vale St. (off of Sloat) and if you drive down into it, there's even a parking lot. How convenient.", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "i love this park, it's the best place to bring your dogs. super safe to let your dog go off leash cause they really can't go anywhere if they're already inside the park", "author": "Anita L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "I love this place. I remember attending the free concerts in the park, what a great way to spend your summer. For the concert in the park you must go early for street parking as it gets really packed as the day begin. Make sure you bring your blanket, chairs and ice chest full of beer, wine and lunch.  They have a great selection of music for the summer concerts from ,  jazz,  R&B, Rock and more. It's also where I had my wedding reception and it was a blast, the perfect place to have a wedding or reception or both. I did a both reception and wedding for my Event company VIP Errands and Events and it was so romantic. They had the place from 7AM-4PM.", "author": "Lenisha S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "Almost like you're not in a big city. This should be on the top ten list of parks/hills to go check out in the city. I used to live nearby and run there for variety. I think they have Sunday concerts in the warm months.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-17", "description": "An amazing park, literally a forest in the middle of the city. Serene, tranquil and beautiful. I was back today for the annual opera in the park, and you couldn't ask for a more perfect scene. Quintessential San Francisco - people bundled up in the fog, sipping their wine and eating smoked salmon and pita bread (wait, that was us, minus the wine). A tremendously enjoyable way to spend the afternoon.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-06", "description": "I was born and raised in San Francisco.  I even went to school at Lowell.  But I never, ever, EVER made it over to Stern Grove until I moved to LA.  I came home to my parents' house in SF for New Years and my husband and I took the furbabies with us.  I looked up dog parks and this one looked pretty cool online.  Oh. My. God.  It was more than pretty cool.  It was more than way cool.  It was even more than super duper freakin' cool.  It was MAGICAL.  It was like being in Fern Gully (that movie about ...  I don't know, fairies and forests and magic or something like that).  I walked deeper into this grove and forget that I was in a severely metropolitan hubbub of the world.  I was lost in the mist and fog and magic that makes San Francisco San Francisco.  I was in a real jungle in a concrete jungle.  And my dogs?  They LOVED it.  I can't imagine what a beautiful place it is on a warm sunny summer day.  We went on a rainy day and I still can't believe it wasn't a dream.  It's definitely up there as one helluva dog park.  HELLUVA dog park.  We'll be back, that's for sure.", "author": "Agatha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "Like Big Sur near one of San Francisco's busiest intersections. Great in sunny or foggy weather, any season, Stern Grove is a thick nest of Eucalypts and pines that sits well below ground, forming a natural amphitheater. It feels so far removed from the City, you won't believe it. On Sundays during the summer be sure to catch the free concerts, which draw thousands of music lovers who congregate with wine, food, family and friends. Spend the afternoon dancing and singing and taking in the natural beauty of San Francisco.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-22", "description": "Stern Grove is by and far my favorite park in the city, mostly b/c you can forget you're in the city.  If you hike down in and close your eyes, the faint, faint, ever-so-faint sound of traffic sounds like a stream.  And there's a pretty established dog in part of it, if you're into that sort of thing.  PERFECT for a picnic and some sunning or shading.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "stern grove park is the sunset district's hidden gem.  just two blocks from possibly the most boring mall in the west coast, stonestown, stern grove is a deep enchanted forest perfect for a shroom trip or just a nice walk with your puppy.  from the outside, it looks like a pretty small and normal park, but it really stretches over 10+ blocks and has an amphitheater, lake, creek, playground, and multiple fields.  pretty sweet park, i must say.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-23", "description": "This review is based on the wedding site only.  The concert venue is beautiful and the whole park is great for dogs and general recreation.  We reserved the wedding site on-line without ever seeing it since we are out of state and had fond memories of concerts there.  This was a BIG MISTAKE.  We lost $430 since the deposit is non-refundable and there is no way I would consider having my wedding there after seeing the place in person.  The redwood grove where the ceremony is supposed to be held is really a mud-pit that never dries out, even in the summer.  The \"beautiful reflecting pond\" was dried up with a bunch of garbage at the bottom and a stench so powerful, I can still smell it in my car.  Last, but not least, the clubhouse is really the gardeners house (his room is upstairs with the dirty curtains hanging in the window).  The place is seriously run-down inside and out.  I thought it would be rustic, but dilapidated is the more appropriate term.  There were rat traps in every corner of every room, and did I mention the smell?  It's sad, because the rest of the park is so beautiful.  When you walk into the beautifully landscaped concert venue, with pretty green grass, the difference is like night and day.  The wedding venue is inexpensive for SF, but I expected a lot more than this for my $1500.", "author": "Sunshine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-16", "description": "it's really pretty here! when i am in the grove, i feel like time stops and i am not in the city anymore. all the trees are beautiful and there are so many little secrets hiding in the grove. today's secret- banana slugs! there must be thousands of them in the logs and moss slithering around.", "author": "Oleya P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-24", "description": "astonishing venue. at the bottom of the sunken forest there lies a stage. the seats are made of fallen redwoods. quite spectacular.", "author": "Pflip W."}
