{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-17", "description": "Update! Our wedding reception could not have been more perfect. Everyone *raved* about the food and atmosphere and Paula and Shannon were absolute angels. I can't say enough good things. \n\nSip Tea is an absolute treasure across from Golden Gate Park. It's a perfectly charming tea party experience with delicious tea sandwiches, scones to die for, and amazing bite size cheesecake. Shannon is so accommodating and the whole staff is super friendly. \n\nThey also offer a delightful space for special occasions and we are doing our wedding reception here.", "author": "Selena L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "Cute ambiance and friendly service. Good for those once in a while catch up with friends and family. Price is ok for San francisco, but overpriced overall. Had the \"Tea for two\" and split amongst three people. Bill came out to roughly $25 per person.\n\nFood: Had the Afternoon tea for two which comes with 2 scones, tea, 2 sandwiches and an assortment of desserts. \n\nRecommend: Assam Chai Black tea. No afternoon tea is complete without having black tea with a little bit of milk. Fragrant smell. \n\nSkip: I also tried the \"Mao Feng Shui\" tea which has a \"vegetarian grass\" taste. It's a green tea, which I usually like but I found the grass taste a bit overwhelming. \n\nSandwiches:I would recommend getting the cream cheese with salmon, and ham with mustard. Their sandwiches weren't anything out of the ordinary, but they tasted fine. \n\nScones: Their scones taste ok. Nothing too  impressive. Definitely liked their sandwichs  more. They also provide some jam and cream to put on the scones.\n\nOverall, I would recommend this place b/c it is fairly inexpensive, especially for San Francisco prices. However, the food itself was mediocre.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "It was my first time at Sip. Parking was a bit terrible but I loved the overall cozy, nook-like cafe it was in. \n\nMy boyfriend and I loved the colorful decor, menu, and the overall experience! We ordered the 3-tier afternoon tea set which came with 4 different kinds of mini sandwiches, two scones with spread, and some lovely little desserts on top! \n\nThe meal was quite filling, even for a couple of stoners. \n\nWe will definitely be back again!", "author": "Kaileigh O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "This is a nice find, I am a secret tea admirer. They have a great menu selection from a single tea sandwich a pot of tea, or a complete high tea with sandwiches and dessert appetizers to make a whole group happy and delighted. I had the egg salad and chicken curry tea sandwiches and they both had great flavor and the tomato basil soup was the warm creamy finish to a quick snack. \nGreat job sip. Parking is difficult so plan on parking at Golden gate parka and walking 2-3 blocks. I just changed the review to 5 stars, because the butter and roll served with the food was amazing to my taste buds. Quick tip don't go gluten free, but I bet they may have the option if you ask, go for the butter and roll, you will be pleasantly surprised I think.", "author": "Timothy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Given the change of ownership at Lovejoy's Tearoom, which used to be one of our favorites, we thought we'd give Sip a try, seeing the Yelp ratings.  I'm glad we tried it, but before we return, I think we'll opt for other places instead.\n\nThe food was fine, and apparently, everything is made on the premises.  We got the $27.00 3-tierd set up, and shared it, along with the $5.00 small pot of tea.  It was well priced.  If we were really hungry, there was a $52.00 (if I recall correctly) option for two, which would've been too much for us, since they're fairly heavy on desserts. \n\nWhat we didn't care much for was the loud music in the background.  I guess that just didn't match our expectations of a nice quiet, relaxing tea room experience.  It's located in a pretty lively busy neighborhood, so I guess that's the buzz they're going for inside too. The thought crossed my mind of asking them to lower the volume of the music, but if that's the vibe they're seeking, who am I to change it?  After 10 minutes or so, I didn't notice it as much, but we prefer a much more \"sedate\" environment when it comes to afternoon tea.  The Sheraton Palace is next on our list of tea rooms to try.  I'm hopeful that'll be a more quiet experience.  I've just never been anywhere for tea where the music feels like I'm kind of in a hip bar.  \n\nIf you're going on a weekend, as we did, just be prepared to encounter difficult parking.  I know that isn't as aspect of the restaurant itself, but it is a part of your experience, if that's your destination.  We came yesterday for a 1pm reservation on a sunny Sunday, and there was a flea market on Irving, along with a packed Golden Gate Park.  My husband dropped me off, as he went in search of a parking spot, and called me a couple of times, saying he was about to give up.  Not a nice way to start of our tea.  Fair warning on the parking. \n\nService was initially fine with our waiter, but no one ever came to see if we wanted more tea.  I had to flag down someone, who I believe was the owner, to ask her for a hot water refill on our tea.  She was going through the restaurant handing out the checks, but didn't seem to have time to also look around to see if anyone needed anything else.  Typically, you'll find service a little over attentive in a tea room, but that won't be something you'll experience here.  \n\nA little disappointing for us, given some of the positive Yelp reviews.  I think I'll pass on a repeat visit for awhile, given the numerous options for tea in the Bay Area.", "author": "Lori N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "Lovely!  Came for tea around tea time on a Sunday (the weekend of outside lands, actually).  The place was actually pretty quiet.  I had called about 30 minutes ahead just to make sure they could take me and honestly, I probably could have just walked in.\n\nI ordered the high tea to get the full experience.  Everything is made in house.  The strawberry marmalade has got to be the highlight of everything.  It tasted so fresh and naturally sweet.  You can taste the love.  \n\nThe staff are really sweet.  I probably sat for 2 hours and they didn't rush me at all.  While I was there, a table had forgotten their boxed food and the server ran down the street to try to find them.  At some point, a piano player played 2 songs.  \n\nIf you want tea in SF without all the hustle and bustle, this is the place.  Will definitely be back (when the weather is better in the sunset).", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "Sip Tea Room is absolutely lovely! The place itself is small, but cozy with it's dainty decor, pastels, and a typical cute teatime set-up. Loved the large chalk board with some of their items and how the doors were open; very welcoming and offered a nice afternoon breeze.  \n\nWe loved the Afternoon Tea for Two: four sandwiches, coleslaw, two scones with spreads, variety of dessert, and a pot of tea of your choice. We also ordered sausage rolls and a cup of soup. Everything was delicious and the food was fresh, but I really recommend the sausage rolls! They have a good selection of sandwiches and teas to choose from to suit your tastes. \n\nHowever the best part would be the excellent service. You definitely feel very accommodated and I enjoyed how we were constantly checked up on and asked if we needed anything. There wasn't a wait for anything either. My family had such a great time here and I can't wait to come back whenever I'm in San Francisco!", "author": "Olyvia Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "I think I have been to almost every high tea place in the city and Sip Tea Room is by far my favorite. They really really did a good job making the dreary secret garden (old tea place) into a bright and airy tea room. The place was super cute and for the royal wedding they had trivia at the table! The food was really good. We got the smoked salmon, egg salad, cheddar and apple, and curried chicken. My bf liked the smoked salmon and egg salad best. I liked the cheddar apple and curried chicken. That is how you know the sandwiches are good! In addition the scones were tasty and the numerous desserts were generous (raspberry cake, Burberry cheesecake, and brownie.) My bf really liked the dessert because he felt it was not overly sweet.\n\nAll in all, there was so much food my bf said he felt the food coma coming on! What was even better was that the price for high tea was very reasonable given the amount of food and the quality. This place is definitely a better value than the rotunda, Fairmont, lovejoy and crown and crumpet (similar value as dartealing lounge but I think this place is better tasting and has a better atmosphere.) I would highly recommend this place!", "author": "Jocelyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Visiting from out of town and searching for a cute tea room. Passed this place in an Uber yesterday and decided to come back today. Could not have been more pleased with Sip! \n\nAtmosphere: Easy to find. Very cute and cozy, with just the right amount of charm but not too kitchy. Pretty new to the city, as it's only been there for 6 months. Good size and the smell of freshly baked goods wafted throughout the entire restaurant. \n\nService: I called about 30 minutes before we got there and was relieved that I didn't need to make a reservation a week advance. We were greeted and seated instantly at a cute table for two next to the window. Adorable place settings made it feel like I was in a traditional English tea house. Everyone who worked here was very friendly and attentive. Brought us more clotted cream and lemon curd when we asked for it. \n\nFood: Loved the different options of food and tea mixings they offered on the menu. My boyfriend and I decided on the afternoon tea for two, which came with four sandwiches, 2 scones, desserts, and a large pot of tea. The current scone with clotted cream and lemon curd was my favorite, because it was warm and went perfectly with my Earl Grey tea. Sandwiches weren't amazing, but I appreciated the wide variety of offerings. $51 seemed pretty reasonable to me for as much food and tea as came with the tea for two. Much better and cuter than high tea offered in many chic hotels. \n\nI was pleasantly surprised with Sip and would recommend it to anyone looking for a cute place for afternoon tea in the city! Definitely will come back next time I'm in the area.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "Not impressed. I really wanted to like this spot, decor and atmosphere are super cute, there's so much potential to be better but food/sandwiches/desserts - tasteless and stale. Unless food quality gets better, I will not recommend this cute spot.\n\n**Reply to Sip T. comment: \nI'm sorry my review wasn't to your liking but I don't need to be schooled on how to leave reviews. I am not obligated to put my full name or a photo (which still wouldn't prove anything), this isn't required. As I am not obligated to address your staff of stale desserts. I paid pretty price$ for tiny 3 pieces. Yelp is for providing others with my personal experience and my opinion of your business. You don't have to agree or like it, otherwise everyone would have five stars. Also, you might want to rethink huge forks and knives for such delicate surroundings. Those would be great for steaks. Again, just my personal suggestion but you can continue serving stale food.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "A fellow yelp friend and I met up for tea at this lovely place. This place apparently gets filled up quickly, so it's best to make reservations. We made reservations in the early afternoon and got seated pretty quickly. The space is smaller so I can see why it fills up quickly. Our lovely server is from Scotland, and she was able to explain the menu thoroughly to us. We both got the Sip Tea Classic. It comes with your choice of tea, and a scone and tea sandwiches. \n\nThere are a great number of tea sandwiches to choose from, and I chose the Branston Pickle, Aged White Cheddar & Green Apple sandwich, and the Sip's Curried Chicken, along with the orange cranberry scone. The tea sandwiches were cut into 3 thin slices and were both very delicious! I would def get both again. The scone was also quite yummy, and it had cream, strawberry preserves, and lemon curds to pair it with. \n\nThere is also a number of tea selections, and I got the china rose petal. The china is so beautiful and the tea was a nice soft taste. \n\nService is wonderful, and the ambiance is adorable. If you want a fun English tea experience please come here. Will def be bringing friends here again :)", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Quick Summary:\n- Enter starving, you will be full\n- Easy walking distance from MUNI\n- Reservation is best, but we walked in the time before the reservation times start, so we were able to claim a seat. If not lucky, one might wait for quite some time until the tables are open.\n- Generous waiters and waitresses and helped us on how to eat them.\n\nWe ordered the Tea for Three (there were three of us)\nSandwiches: smoked salmon, egg salad, cheddar and apple, curry chicken, goat cheese and herb, ham.\nScones: Currant and lemon poppyseed (scones of the day)\nCakes: (cakes of the day) \nTea: Earl Gray and Honeybush\n\nA taste of London's afternoon tea in San Francisco. I have a relative who has been to London before, and she said it was just like it - but more portions xD\n\nWhat I felt was extremely kind and generous of the cafe was when we ordered. When we ordered one traditional and one tea for two, the waitress responded, \"Ah, tea for three?\" So, she combined our orders! I was very moved because there was a similar afternoon tea cafe in SF that would not let us eat three people with a \"tea for two\" and demanded the third person to order another. (We ended up leaving that cafe before ordering).\nAfter we ordered and the famous 'three-tier\" plates arrived, all of our sandwiches, scones, and desserts were placed neatly and so beautifully. We got a sandwich each for the flavors we ordered, so it was very fun to enjoy all of them. \n\nWe ate from the bottom up: sandwiches, scones, and then the cakes. We ate at our usual pace, and we stayed for over an hour. Also, we were growing full after eating scones, so the snacks pack volume despite the looks.", "author": "Mito I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-20", "description": "I wanted to like Sip, and I want to give them a good review because I liked the people that worked there. But I couldn't get over the smell of the restaurant, I was sitting outside and could still smell it wafting out the door: like something was rotting? And the food was overpriced. I wouldn't go back, but I really enjoyed the workers so this isn't an ode to them.", "author": "Sydney G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Such an upgrade after the previous Tea room! Really feels like you're in Merry old England having a tea party. The wait staff are delightful and the teas are divine. Highly suggest waiting for a table outside when it's nice out. You'll get compliments on your table from strangers walking by!\n\nTry the sausage rolls and Tea sandwiches. I wouldn't suggest the Ploughman's lunch. It's probably a good representation of English brunch but I just don't get deli meats for lunch ‍", "author": "Dyanna Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Best Tea Room in San Francisco! My mom, our long time family friend, and I came here with an 11 am reservation on a Saturday morning and had a magnificent time. Paula (owner) and Suzie (long time employee) gave us a delightful experience with incredible home made food (down to the crust!) and scrumptious teas. I wasn't a \"tea person\" until I came here--now I have it every morning and evening! We had the and the Traditional English Breakfast cart with the Scottish Breakfast Tea (pictured). We also had the Quiche and Sausage Roll Bites--exquisite! Overall we will most definitely come back again and highly recommend for any party, gathering, afternoon tea, and children!", "author": "Laura K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "I have a deep love for afternoon tea and have been wanting to trying this place ever since passing by it several months ago and peeking in to admire its pretty interior. I finally met up with a friend here on a bright and chilly day for a reservation at 1. We marveled at the charm of the warm and intimate room and enjoyed ourselves for 2 hours or so.\n\nWe both ordered the Sip Tea Classic option of two tea sandwiches and one scone. Our seasonal Cranberry Orange scone was served with strawberry preserves, clotted cream, and lemon curd. Written on the blackboard are amusing instructions on how to eat a scone. A waitress told us that she favored the Cornwall Style and so we went with her suggestion. All the spreads were so yummy on the scone. \n\nI chose the Branston Pickle, Aged White Cheddar & Green Apple (recommended by our waitress) and the Smoked Salmon & Sip Cream Cheese sandwiches. The Branston Pickle sandwich was especially tasty. The tangy chutney goes heavenly with the crisp, tart apple and rich, creamy white cheddar. The Smoked Salmon had very thinly sliced salmon which made me regret not getting the Curried Chicken. \n\nFor the tea, I had the caffeine free HoneyBush. The tea had a mild honey flavor and lovely pink hue. I think I would have preferred a stronger brew. Our waitress said the cups she gave us were new. It felt special being a first time user. The china was so pretty and delicate. Even the tea strainer and holder was delightful. \n\nAlthough the portions were a bit small, the food was delicious. For afternoon tea, the price is affordable. The service was friendly and the atmosphere was pleasant. I'm sure I will find my way back here again.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "My friends and I visited this super cute new tearoom a few months back. I called in advance to make a reservation and was excited to try it out since the price is right.\n\nMost of us got the Traditional English Afternoon Tea although one of my friends got the Sip Classic Tea. The Sip Classic Tea seems to be a better value than the Traditional English Afternoon Tea. The difference is basically sweets (which we don't like that much in general) and coleslaw. \n\nSince I was in a group, we shared several pots of tea, including Scottish Breakfast, Earl Grey, and Darjeeling. It was a lovely way to spend the afternoon. There are many tea options in SF but most of them are incredibly overpriced. Out of the reasonably priced options, I would still rank Lovejoy's #1 but Sip is a close second place and it's easier to get into.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "This is a cute little tea room located right across from one of the entrances of Golden Gate Park. As such, good luck finding parking on weekends, and maybe even on Fridays! The interior design is cute and cozy, though it does get quite loud when there is a full house!\n\nMy friend and I visited on a Friday afternoon, ordering up their tea for 2. Portion size is very generous! The food is delicious and so is their tea. My favorites were definitely the salmon sandwich and the scones!\n\nFood is deserving of 4 stars, but I docked a star due to service. My friend and I awkwardly stood at the entrance for a good 5 minutes, just waiting to be seated. They were definitely not busy at the hour we went. Also, it took quite awhile to flag anyone down for the check as well; all heads were down! It may have just been an off day, so I'll give them another shot when I'm in the Sunset and in the market for afternoon tea!", "author": "Kristi T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "I am not a \"tea-time\" type of person. However, I have been to many places throughout California for high tea because it's one my wife's favorite things to do in the world. Sip has been among the top in terms of food, ambience and service. \n\nThe highlight for me was the food and service. We ordered the Tea for Two for just under $50. If this sounds like a lot, it's completely reasonable. I have been to fancy hotels for afternoon tea and paid much more for much less. This included scones, 4 varieties of sandwiches, a large pot of tea and an assortment of desserts. They were happy to let us substitute a little in the sandwiches. We added cucumber to the goat cheese and herb sandwich, which was fantastic. I also got a french press coffee. I don't drink a lot of tea.\n\nThey say that everything is handmade, and it tastes that way. You can sometimes hear the kitchen in the back running blenders to make clotted cream or smell fresh scones being baked. The sandwiches were all tasty. Great flavors, fresh ingredients. There was a real attention to detail here. \n\nThe service was outstanding. We absolutely enjoyed talking with our waiter. We had a 3pm reservation and we were sat immediately. We stayed till they closed at 5pm and not once were we pressured to get up, or move on or do anything but enjoy our stay. We met several of the other wait staff as well, who were all equally kind. The interior was very nice. My wife could say much more. She loved every detail, and again the attention to detail was fantastic. \n\nWe will be back. Probably soon. They are planning on opening in the evenings soon and having live music and drinks. This sounds like it would be fun as well.", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "I LOVE to sip tea! The dainty sandwiches and sweets, the fragile tea sets, the hot tea that warms your soul. It all makes you feel so...fancy, which I normally am not. But it's the best kind of thing to do in the fall with your girl friends.\n\nI'm not a huge fan of the location, but parking was a snap on a Friday afternoon! The decorations were so cute and I just loved the atmosphere. We were one of the three tables and the service was great. Also, if you're someone who doesn't like attention, maybe don't wear heels. The tapping of your heels on the hardwood (?) floors will disturb the quietness in the open room.\n\nI'd recommend the Tea for Two, Traditional English Afternoon Tea - it's their most expensive tea service. It's $50 and it may not look like a lot of food. But it definitely filled us up. You get to choose your fresh pot of tea, 4 types of sandwiches, and 2 scones.\n\nWe ordered the Honeybush and it's become my new favorite tea. Fruity and sweet. Even with just a little bit of sugar, it was enough.\n\nFor the sandwiches, we chose \"Baked Ham, English Mustard & Tarragon Butter\", \"Egg Salad with Arugula\", \"Sip's Curried Chicken\", and \"Smoked Salmon and Sip Cream Cheese\". My favorites were the Baked Ham and Smoked Salmon sandwiches. The Curried Chicken was good too! Didn't try the Egg Salad though - not a fan of egg salad. We had NO idea we'd be receiving 4 sets of 3 sandwiches! The Curried Chicken was more like a mini slider though so you only get 2.\n\nThey offered 1 Lemon scone and 1 Blueberry scone. My friend and I both preferred the Blueberry scone over the Lemon scone. The Lemon scone didn't have too much of a lemony flavor. But the lemon curd was amazing!\n\nLastly, they gave us an assorted selection of tiny cakes - cheesecake, lemon square, and a chocolate cake with a nutty \"crust\"? The cheesecake was the best one in my opinion. The lemon square kinda fell apart. And the chocolate cake was way too sweet. And I'm not a fan of nuts, in general.\n\nI definitely want to come back and try other things - Sausage Rolls, Quiche, soup of the day, etc.", "author": "Athena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "My friends and I went to Sip Tea Room and had a delightful time.  There were a variety of teas, scones and sandwich options to choose from. I cannot eat gluten and considered not coming because I would not be able to enjoy the full experience of tea and scones.  But, went anyway. While,  it wasn't on the online menu, the tea room baked some gluten free scones and offered me gluten free crackers instead of bread so that I could partake in having sandwich bites as well. I can't speak enough as to how attentive the server was towards us.  Particularly enjoyed the strawberry jam and butter, the scones and the rose infused tea!  \n\nThere is a good vibe and music in the backroad.\nA nearby child was celebrating her birthday and one of the staff played the birthday song on the organ. \n\nI highly recommend Sip Tea Room and we plan to make a regular afternoon tea event with the girls.", "author": "Tess G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Date & Time:  Saturday September 2, 2017 @ 2pm\nDining Companions:  The Husband & Doggie\nScene:  Ladies in Floral & Blush Summer Dresses or Crop Tops w/ Shortie Shorts & Strappy Flat Sandals\nDecor:  Lovely Tea Room:  ChalkBoard Menus, White Tables w/ Grey Cushions & Sunny Yellow Walls\nService:  Sweetest & Most Charming Ladies\nImbibe:  Tea\nDevour:  Afternoon Tea\nTotal:  $41.18", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Tried Sip Tea Room today for the first time today and it was really cute! Got the tea for two for $51, so not too bad of a deal compared to some other high tea places. It came with four finger sandwiches (two for each of us in groups of 3), two scones (each a different flavor) with clotted cream, lemon curd and strawberry jam, and four different desserts which we shared. There was a cheesecake with blueberry sauce on top, a rich chocolate cheesecake (maybe?), an almond cake, a berry crumble type of cake and a little saucer with strawberries and grapes. Everything was fresh and you can tell they make it there which is nice. And the ladies who were running it were really sweet, I think they might be sisters. They had a British accent too so it really seemed like the real deal haha. We got a pot of tea to share and chose the hibiscus, which was delightfully floral and had a lovely aroma as well. The interior was bright and cheery, and the tea pots and cups and saucers were really cute too! Wish we each got our own tea just because I like to try other flavors and maybe a couple of scones since I love scones so much (LOL), but not a huge deal! Overall a delightful experience. And it's right across from golden gate park too so perfect if you want to stroll around and walk off all of the food afterwards. :)", "author": "Carlie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "From the time you enter, Sip makes it clear that everything is made in house. There's no speculating that the cookies are from Costco like at another unnamed other Bay Area tea place. And accordingly, the food at Sip is excellent. My only (very small) quibbles are that I prefer a slightly sweeter scone and I'd like a savory in there (a puff? a tart?) that's not a sandwich. That's just my Sip constructive criticism.\n\nSip has gone modern and more streamlined in its ambiance. It's fine but needs a little something. Maybe take some inspiration from Crown and Crumpet or Satori? They also went modern but sort of \"clever modern\" with cute references to tea culture without the doilies and clutter. Sip is really loud and needs something to absorb the sound.\n\nFor the actual tea I went with chai which was a mistake on my part because I didn't realize that what I actually like is a chai latte. The chai was fine but advertised as spicy so I expected spicy which it wasn't. I actually preferred my bagged Trader Joe's chai at home. Sip's chai was on the bland side and not as aromatic.\n\nWe got the high tea for two. Note that it's for one pot. Serving it this way for two is a great money saving idea for some twosomes. My husband and my taste in tea is too divergent so we sprang for an extra pot. The run down on the sandos: The chicken curry sandwich was EXCELLENT. One of our sandwiches strangely had quadruple the amount of currants as the others. The smoked salmon and cream cheese was also really good. The egg salad with arugula was good but not as special. The husband thought the sandos were on the small side. (He actually had a slice of pizza immediately after tea, whereas I was stuffed.)\n\nFor the scones, the currant was good. I actually didn't taste the lemon in the lemon poppyseed. They came with lemon curd, homemade preserves, and clotted cream.\n\nThe dessert course was one of the best I've had, and I think the best among Bay Area tea places. The lemon bar was very good. Their blueberry cheesecake consisted of plain cheesecake with a blueberry sauce. I might have preferred a flavor to the cheesecake, but again, quibbling. It was very good. We agreed that the brownie was the best. It was soft and moist.\n\nThe husband jokingly noted that the bathrooms in most tea places are unisex. Even though there are usually two bathrooms, the gender ratio at tea houses is so off it makes sense to make them available to both sexes.\n\n\nKathleen's High Tea Rankings\n1) Claridge's, London\n2) Le Parloir, Montreal\n3) The Fairmont Empress, Victoria B.C.\n4) Charlie and the Chocolate Factory Tea at One Aldwych, London\n5) Aubrey Rose, La Mesa  \n6) SIP, SAN FRANCISCO\n7) Lisa's Tea Treasures, Campbell\n8) Crown and Crumpet, San Francisco\n9) Lisa's Tea Treasures, Los Altos\n10) Tea Upon Chatsworth, San Diego (closed)\n11) Lovejoy's, San Francisco and Redwood City\n12) Lovey's, Pacifica\n13) Tyme for Tea, Fremont\n14) Lisa's Tea Treasures, Los Altos\n15) Dushanbe Tea Room, Boulder \n16) Satori, San Jose\n17) Charles Chocolates Tea, San Francisco\n18) Ampersand Science Afternoon Tea, London\n19) St. Julien Hotel, Boulder\n20) Tea Time, Palo Alto\n21) Lisa's Tea Treasures, San Jose (closed)\n22) Samovar, San Francisco (Page St.)\n23) Shakespeare's Corner Shoppe and Afternoon Tea, San Diego\n24) Cafe du The, Burlingame\n25) The Huntington Langham Hotel, Pasadena\n26) Satori, Saratoga\n27) Dartealing Lounge, San Francisco", "author": "Kathleen M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "This is my first afternoon tea in the Bay Area. I got the Sip Classic Tea with egg salad with arugula, smoked salmon & sip cream cheese, scone, and earl grey tea. Everything was only $18. I think that's an amazing price compared to the afternoon teas I had in England. Though there are limited options for sandwiches and desserts, the sandwiches I had were great. I could tell they were made to order with fresh ingredients. I would definitely come again for a lovely afternoon tea. \n\nThe owner was extremely nice and helpful. \n\nI recommend making reservation because the place is small.", "author": "Shelley L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "This lovely gem is situated near the Golden Gate Park. Here you can enjoy a quaint tea service with cozy charm. The masala chai was delightful and the scones were fresh with the typical English accoutrements of lemon curd, Devon style cream,and strawberry Cornwall jam. I appreciated this tea room for its unedited version of an English tea in the Bay Area. The prices were also quite a bit more reasonable than South Bay tea salons.", "author": "JoAnn Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "I've been dying to try an afternoon tea service for a while now. My boyfriend and I went to stow lake boathouse on a sunny Sunday afternoon. We passed by Sip tea room on our way to the boathouse parking lot. I knew I had to try it since sip teahouse was super close to the boat house. \n\nUpon entering, there is a sign in sheet in the front. I highly recommend you set up a reservation. The location has only few tables, so you could be waiting a while. I waited a good 20 minutes for 2 people without a reservation. \n\nTea for two, traditional English afternoon tea \nSince it was my first time ever trying a tea service, I wanted to try the 3 tier food platters. The amount of finger foods sip tea gives you is very filling. On the bottom tier, we got 3 types of sandwiches: egg salad (try this!), ham, and salmon with cream cheese. The ham sandwich was very heavy on the mustard, not appealing to my tastebuds. The coleslaw that came with the sandwiches was very delicious, probably one of the best coleslaws ive ever tried. \nOn the 2nd tier, there was 2 warm scones with whipped cream, strawberry purée, and lemon curd. I recommend eating the warm scone first before anything before it gets cold. The scone wasn't dry at all, which can be a problem with scones. \nOn the top tier, there was a small fruit assortment, two fudge bars with walnut crust, cheesecake topped with blueberry, and almond bars. The cheesecake was very tart, not my favorite. I loved how fudgy and chocolatey the fudge bars were. The almond bars were chewy and not too sweet. \nI got the English breakfast tea with my tea service. You get a whole pot full. I ended up finishing my tea pot half way through, and I wish my waitress came back to check up on us so I could ask her if she can refill my pot with water. It was pretty busy, so I get why she couldn't check up on us. \n\nSip tea room is beautifully decorated. A modern twist on a dainty tea party vibe. Love the small chandeliers hanging from the ceiling.", "author": "AJ C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "Charming place with very feminine decors and kind waiter! I can understand the 1:45 hour limit per seating but how can the girls only talk for less than 2 hours! :-)", "author": "SJ L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Such a pleasant neighborhood find. Charming setting, great service and terrific tea and food. \n\nThe Branston pickle, cheddar and green apple sandwich is a standout in our one visit thus far, but I look forward to having it one-upped by other things in future visits.\n\nThe only problem is now whenever we are thinking about making tea at home, we are faced with the dilemma of preferring to walk over and enjoy SIP instead. I guess there are worse things.", "author": "John V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Sip, sip, HOORAY! We had a terrific tea time today. We were a walk in party of 4, advised to make a reservation for 1.5 hours later. We walked to the car and boom, got the call that a table was open for us, an hour before the reservation. Win! We ordered Tea for Two and an order Saisiage Roll Bites. Yum!!! Tea is tea, but tea with excellent food and a pristine environment is even better. We ordered Yorkshire Golden tea is it did not disappoint. All of the sandwiches, scones and desserts were fresh and delectable. The Branston pickles, British cheddar and green apple sandwich was my favorite. I purchased a jar of Branston pickles to re-crest this sandwich at home. Patrons could do a better job of speaking in quiet voices. Oh, I love that there is a stool at the counter so that a party of one can enjoy a place suited for one.", "author": "Carla W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "Decent place for tea time!\n\nI appreciate the $18 option of tea that includes 2 sandwiches, 1 scone, and a small pot of tea - because most (if not all) tea services START $25 which includes the same thing except with the addition of a platter of sweets.. which I usually end up never getting into.\n\nService was friendly and attentive.  I came at 3:00 PM on a Sunday, so it wasn't too busy when I came, though there was just a small wait to have the tables cleared out. The tables are spaced out pretty well where you don't feel like your personal area is being invaded, and overall, it's a very chill place to catch up with a girl friend or two.\n\nThe place is on the smaller side, maybe 10 tables max.. Decorations aren't ALL OUT like Dartealing or Lovejoy, and the ambiance is more slow, reserved and quiet.\n\nThe food and tea was OK - no complaints but also nothing that stood out in particular. A good option for tea especially if you live near the area. More convenient than all the other places in the city!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "This is a really nice neighborhood Tea place for friends gathering. Workers are extremely friendly! The place maybe too small to accommodate a big group. We ordered tea for two. The sandwiches are tasty but the scones are bit dry! Cheesecake and chocolate mousse are yum! Also tried the soup and salad....soup is tasty but bit on the salty side (Cream of Cauliflower) & salad is just arugula. Could add some color to it with slices grape tomatoes.", "author": "Jaylene L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "4 stars for the food and service. 4.5 stars for the decor.\n\nPlanned this high tea for a month now and FINALLY got the chance to do it last Saturday. My friend and I were very excited and pleased with how cute and pretty everything looked.\n\nI do recommend that you make a reservation if you plan to come here on a Saturday since they can get busy on weekends according to the staff. We made a reservation for 11:00 am and all seats were filled by reservations when the shop opened. \n\nWe had the Tea for Two ($51), which comes with our choice of \n- Large pot of tea, scone of our choice (one/person), four tea sandwiches, coleslaw, Sip clotted cream, strawberry preserves, assorted sweets for two (one of each variety/person)\n\nHONEYBUSH TEA (5 stars) // This wonderful tea had a beautiful sunset orange color and its aroma was just as described: like peaches and honey. The waitress offered us a bottle of honey to add into the tea, and the honey enhanced the taste of the tea so that it actually matches the aroma. We fell in love with this tea. The tea pot, cups, and strainer were also very pretty to look at.\n\nTRADITIONAL CURRANT SCONE (3 stars) // I found my scone dry and unexciting even when paired with the yummy, tart lemon curd. The clotted cream tasted similar to unsalted butter. The strawberry preserves were nothing special.\n\nTEA SANDWICHES (choice of 4 sandwiches, 3 sandwiches/choice)\n       (3 stars for the fluffy, white[?] bread that looked a bit gray)\n1) Branston Pickle, Aged White Cheddar & Green Apple (5 stars) // This was our only vegetarian choice and we ended up loving it. The branston pickle chutney was so savory and yummy, and was a great contrast to the strong aged cheddar and light apple slices. \n2) Baked Ham, English Mustard & Tarragon Butter (3 stars) // This was definitely one of our least favorite, it can be described simply as ham between two slices of bread. \n3) Smoked Salmon & Sip Cream Cheese (3.5 stars) // I generally love smoked salmon sandwiches, this one was okay. A little more creativity would've made a big difference. I also think if the smoked salmon was kept cold right before serving, it would taste better as well. \n4) Sip's Curried Chicken (4 stars) // This sandwich definitely had the strongest flavor. It was a yellow curry chicken sandwich with raisins mixed into the spread, the sweetness from the raisins was just what I needed to cut the heaviness of the curry.\n\nCOLESLAW (4.5 stars) // Nice touch with the addition of apple bits! A little saltier than the average coleslaw with a touch of black pepper.\n\nASSORTED SWEETS (variety of 3 pre-picked sweets of the day/person)\n1) Berry New York Cheesecake (4 stars) // This was my favorite. The cheesecake is surprisingly not as firm as I had expected but overall very yummy.\n2) Chocolate Indulgence (3 stars) // This is just a personal rating because this was VERY rich chocolate. Maybe this is for you if you like chocolate as much as Chocolate Boy from Hey Arnold.\n3) Finger Shortbread (2 stars) // Dry shortbread topped with almond slices. \n\nOverall pretty pleased with our experience here, definitely recommend to anyone looking for a decently priced high tea experience.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-01", "description": "I got to finally try, Sip, a friend of mines new tea shop, which she co owns with someone who is actually British. Since i love tea, particularly, high tea, i decided to take a friend of mine here (whom btw is due to give birth at anytime now!)\n\nI got there early and was immediately seated. Service was excellent and friendly throughout! I decided to go with the high tea while my friend the smaller tea. The high tea comes with two sandwich  choices, coleslaw, a fresh scone that was delicious and assorted sweets and fruit. I really enjoyed the sweets the most, absolutely delicious lemon bars! I had a pot of the Assam tea with cream and sugar and as stuffed as i was, i decided to try their sausage rolls, which were also very delicious, even though i couldn't finish. \n\nThe decor is light and bright and not over eccentric or cluttered. Prices are comparable to other \"well known\" tea places but without requiring any reservations. Sip, is a solid and authentic afternoon tea experience and great for a girls day out, bridal shower or as i do, just sometimes having a craving and not caring if i'm \"sipping\" alone.", "author": "Petra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I came here to celebrate a friend's birthday and I loved it! They have limited reservations in 2 hour blocks at 11am, 1pm, and 3pm. I would definitely recommend making reservations since it is a small place. We ordered the afternoon tea for two, which comes with 4 sandwiches, 2 scones with lemon curd, cream, and strawberry jam, and assorted small deserts. At $51, it is far more affordable than other high teas in the area, and the food is delicious. Everything is made in house, and you can smell the scones baking as you walk in. There's also a delicious assortment of teas and they will refill your hot water for you. We both felt so full afterwards, so there is a good amount of food. It's super cute, relaxing, and homey, and I can't wait to come back.", "author": "Hali M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I haven't written a review in a long while. Today warrants an excellent review.\n\nA friend and I both love high tea, and traveling to different tea rooms throughout the Bay Area and beyond. Today we decided to try Sip Tea Room, and I'm so glad that we did. Out of all the High Teas that I have been to, \"Sip\" has made it to the top of my list.\n\nThe atmosphere is clean, open and simple, but still elegant with chandeliers, china and lace tablecloths. There are subtle hints of the U.K. throughout the room. Not overly done, and not crowded with knick knacks, hats and feather boas (which I always felt to be rather creepy, sharing those items with people that have already worn them for who knows how many times). Room to sit comfortably without being crammed against other tables, or in some places...sofas, and sale items.\n\nThe menu is not inundated with a bizillion tea choices, but the teas available should appeal to a wide range of people. The smell of freshly baked scones fils the air, making tea time even more inviting. Fresh sandwiches were all very good and on super soft bread, the sweet treats were incredible, particularly the lemon bar, and the coleslaw was very tasty. The fresh fruit included with the sweeties had PINEAPPLE...my favorite!\n\nService was excellent. Our wait person was as wonderful as the place itself, and we got to meet one of the owners, Paula, who gave us a little background history on \"Sip\". Both Paula, and her wait person are British, which to me, makes it all the more authentic and fun.\n\nAnother nice \"rule\" is that children are asked to remain seated. Too often I have gone to places where there are \"free range chickens\" who are disturbing to other patrons. Tea should be relaxing!\n\nI could go on and on, but I won't. Others have already covered the bases. \n\nI can't wait to go back and try some of the other items that were not included with our High Tea.", "author": "Cynthia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "I took my daughter here for her 12th birthday. Little girls and tea is like little girls and pig tails. Delicious tea, ample selection, fresh sandwiches and homemade condiments is stands out. The quality you can definitely taste and the lovely service makes it worth spending a wee bit more. Though, I must say it is expensive but we are in SF so I would say the price is quite average.", "author": "SF Cloweee G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "I came here with a girl friend couple of weeks ago on a Saturday.  We had a reservation but still had to wait for about 15min before getting seated.  The annoying part was not the waiting but the fact that for good 5min we just stood there without getting acknowledged at all.  This was a consistent theme throughout our experience.  While the staff is friendly when you do interact with them, flagging them and getting their attention is no easy task.  The tea room is small and they don't scan the room to see if anyone needs them -- they ignore you until you randomly fall into their line of vision.  \n\nThe food, on the other hand, was very well done.  Tea sandwiches were just right -- not too much bread, plenty of filling, very tasty.  Pastries accompanying the tea were lovely, not overly sweet.  Tea selection is typical -- nothing exotic or fancy -- but good quality tea.  \n\nTo be honest, I'm torn about this place in regards to coming back.  For the tea rooms in this price range, San Francisco doesn't have a single one where service, food, and tea would all be equally good.  :(", "author": "Inna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "This tea room is a wonderful replacement of what was there before.\nPaula and Shannon are the new owners. Paula, from England, being the woman who makes all the food in the back kitchen and Shannon, the enthusiastic manager. \n\nWhat's amazing is both women struck me as being true to themselves and this tea room a dream they had. I immediately liked them because of this atmosphere. \n\nOf course how can one go wrong with tablespoons of homemade clotted cream? Homemade jams, scones, tea sandwiches, quiche and other yummy savories!! How can one go wrong with sipping tea in vintage cups and saucers? \n\nLooking forward to their acoustic music that will be coming soon!", "author": "Dianne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Came in with a couple girlfriends to catch up and had a LOVELY time. The place is very clean and light, great for parties or initiate gatherings. The food and service were amazing. We opted to add the sausage rolls to our service and definitely don't regret it. Would highly recommend - can't wait to come back! xx", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-14", "description": "Made a reservation for Sunday afternoon. It was jam-packed! I arrived a few minutes late, but was seated right away. It took my sister another 20 minutes to find parking and they were very accommodating, allowing me to wait seated.\n\nThey don't have many tea options, which was disappointing. I was looking forward to trying some exotic tea flavors I can't normally get at the supermarket. We just had the chai. Nothing special. We also ordered the traditional English tea service for two. We chose two egg salad sandwiches, the ham, and the curried chicken. Ham was standard. Egg salad had a weird flavor to it, so I didn't enjoy it. I'm not typically a fan of curry so I wasn't surprised that I didn't like the curried chicken. It was for my sister. I can't remember if she liked it.\n\nThe space is small, but cute. The staff were busy, but accommodating. I don't think I would go back though. The food doesn't warrant a return trip. Sorry.", "author": "Mallory L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Sip was fantastic. \n\nI planned a ladies' afternoon tea and had my numbers up in the air. The staff responded to my online reservation request and were kind to tell me to increase to 6 guests they'd need a card (their website lists all of this so it was no surprise. Kudos to their website's rule section because it was so helpful to properly prepare!). I changed the number once after that and then still showed up missing one guest and they didn't complain! Instead they swiftly removed the (now) extra place setting and had my friends and myself settled down for tea about one minute after they opened the doors. \n\nI found out later on that this was all 5 friends' first high tea and was so pleased that Sip was their first experience. I've been to my fair share of teas around the world and this was a really pleasant one with good food and good tea. \n\nThey did serve traditional fair, with nothing extraordinarily creative or different, but it's nice to know a traditional staple is out there featuring tea sandwiches, scones with curd, cream, and preserves, and assorted sweets.\n\nThe decor wasn't traditional for the less expensive Bay Area teas I've attended, but that was a huge draw for me. I'm not interested in the stuffier, over-the-top lace and trinkets. Sip has just the right amount of elegance with beautiful table clothes and adorable, eclectic pots and dining-wear, but it all goes together very nicely without being claustrophobic. I'd go back for sure! The ladies' loved each second.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "I love coming here. This is a great place to have tea and take a little me time or have an in-depth conversation with a friend. If you visit once, you're sure to come again!\n\nCrack the scone open at the middle dent & spread on some clotted cream, strawberry preserves or the delicious lemon curd for a traditional tea time treat.\nAll of their food is made with love on-site. \n\nToday they tried a new recipe for the lemon curd and the taste alone evoked the memory of walking through a citrus grove on a warm summer evening. The bright floral notes smelled amazing! I love lemon curd, and all of their iterations have been delicious. \n\nThe atmosphere is laid back, comfortable yet modern, and somehow at the same time traditional. The kind of place you want to be and bring your friends. I know most tea houses are visited only for special occasions, but Sip fits in with the neighborhood's relaxed vibe . You'll definitely want to come back again and again.", "author": "Nessa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "A great spot for afternoon tea right outside Golden Gate Park and the Botanical Gardens! We got there around 2:15 and were seated as soon as a table was cleared. We got the tea for two, which comes with a big pot of tea and a three tier tray of snacks! You get to choose four different sandwiches and two types of scones, and you get an assortment of desserts. We also ordered a side of sausage rolls, yum! The food was lovely and the tea was very good. All served in a lovely teapot with china tea cups in an adorable little shop. I highly recommend coming here!", "author": "Erin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-11", "description": "Stumbled upon it and can't wait to go back!\n\nAmbiance-A....quintessential tea house\nTea - Ceylon fabulous!  -A\nThe ritual of the way they do the tea service- A\nScones -A+.....did I mention I can't wait to go back?\nFinger sandwiches- loved the egg salad, smoked salmon, cucumber.....A\n\nGreat place. Takes resv", "author": "Fitzwilliam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "Found this wonderful gem looking on Yelp. We split the traditional English afternoon tea service and a quiche. Everything was absolutely delicious and well prepared. Our waitress Susy was extremely personable and chatted with us about our upcoming trip to Scotland. We had a beautiful lunch eating and drinking tea here. I would highly recommend this restaurant.", "author": "Kim V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Best scone I've ever had and the rose black tea was lovely. Went on a weekday with my 9 week old and friends. We look forward to returning. Thank you for the wonderful experience Paula!", "author": "Sara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Sip is a really lovely experience!\n\nThey have a nice range of tea packages or a la carte options. \n\nMy friend and I each opted for the Sip Tea Classic ($18) which was a good serving of items: \n1. Choice of 1 Tea Sandwich & 2 Freshly Baked Scones -OR- 2 Tea Sandwiches & 1 Scone (comes w/ clotted cream, strawberry preserves, and lemon curd) \n2. Small Pot of Tea\n\nDefinitely a fun spot for a ladies outing. We saw a grandmother and a young granddaughter come in all dressed up for an afternoon of fun, super cute!", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Great first experience! Would come back again! Staff was friendly and the environment is so cute. BUT a bit pricey.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "Excellent service and experience! Definitely will be my go to high tea place from now on.", "author": "Justine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "My tea room standards are extremely high. I'm from \"back east\", which is generally more Anglophile than SF, and I've eaten many a scone in London.  Tea in SF has been a disappointment for me.  Everyone raves about that place in Noe Valley, but I find it to be...let me be polite, and just say, not my style.\n\nSo I was thrilled to visit Sip.  Right off, the decor is clean and open; enough lace to set the mood without choking you in dusty doilies.  The menu is pretty standard tea service, with enough options to customize to your tastes. I'm a vegetarian, and found plenty on the menu to choose from. The service is polite, friendly, and relaxed.  I wasn't rushed, and my tea was refilled.\n\nI'm looking forward to going back with my friends!  We have already made reservations.", "author": "Leigh Ann P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Did a walk-in on Saturday around 11:30 am, and the inside seating was full so we decided to sit outside. While we were pretty lucky and didn't have to wait, it would probably be best to try to make a reservation next time. Service was excellent. They offered us blankets since it was pretty chilly that morning. We ordered the tea for two with one of their non-caffeinated teas. They filled up our pot twice during our visit. The food was presented on a three-tier stand. Our favorite was their home-made scones paired with jam, cream, and lemon curd. Overall, it was a great way to spend the afternoon. Just to note, parking was a bit difficult for us to find on the weekend.", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-13", "description": "Oh my goodness, what a delightful way to spend an afternoon! I'd come here every Sunday if I could (the scones and clotted cream have zero calories, right?!).\n\nThe ambiance is bright, clean, and cheerful. The colorful and mismatched china is just so...happy.\n\nThe tea selection is great, and I love that you can get an entire pot to yourself. The food is delicious, too - oh my goodness, I want more of those strawberry preserves and cucumber sandwiches with the crust cut off.\n\nYou definitely need to make a reservation by calling ahead - they do weekend seatings at 11, 1, and 3. If people no-show, you can get added to the waitlist, but everyone showed up for our seating.\n\nThis was such a fun thing to do, and I'll definitely be back!", "author": "Audrey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Last time I had high tea was in England. I had very low expectations of this place but it did not disappoint. Wonderful selection of teas and sandwiches along with yummy scones. They use loose leaf teas which is definitely the preference. Excellent service and not overpriced. I the on Beyonce is very cute and very well thought out and definitely resembles an English tea room. Make reservations and advance as they get well quickly.", "author": "P S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "This review is long overdue.\n\nNever before in all my experience in San Francisco have I been so pleasantly surprised when a long-standing staple of the neighborhood is replaced with another establishment. I've been to Secret Garden a few times and while I enjoyed their tea as well, I used to think the seating times slightly inflexible and the service a little slow.\n\nThe lovely new owners are warm and kind and make you feel like they have been around for years and that they have known you for longer. The Sausage rolls are amazing, as are their scones. Like John W, my husband is also not typically a tea-time person but I, for the majority of my adult life, have been. Sip, however has been an exception. He enjoys the food and the service and we have managed to come in at least once a month and sometimes more.\n\nI love Sip, and the warm and friendly family vibe at this place. I can't wait for them to be open in the evenings and enjoy them for more times of the day.", "author": "Shimi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Best tea room in San Francisco! Light, bright and cheery, this is a tea shop for the masses. No doilies or fussy decor, the place feels homey and inviting. Excellent tea selection served in fancy cups and pots, and ALL HOMEMADE scones, quiche, coleslaw, tea sandwiches and pastries. They even make their own clotted cream, jams and lemon curd!! Our party of 6 all raved about the food, the service (owners Paula and Shannon greeted the guests, and the wait staff were excellent), and the ambiance. For groups of 5 or more be sure to make a reservation, as Sip already commands quite a following.  A proper tea room for the West side!!!", "author": "Cynthia F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "It is hard for me to write this review, 1) i am still not sure what was better, the food or the service and 2) I love this place and don't want it to become so full I don't get to go there, but the staff really deserve praise.\n\nSaturday my friend and I walked in with no reservation and asked if we could have tea.  We were told they were totally booked but I saw I table out front with 1 chair and asked if we could sit there? They brought us an extra chair and we had the best time.  From the tea pots that were so darling I (jokingly) asked my friend if I could slip it in my purse, to the best service I have ever received at an outside table it was just a 100% delight.\n\nI am sorry i cannot name our two amazing servers, the lovely gentleman with the stylish glasses and great tie and the beautiful woman in the polka dotted dress with adorable tea pot earrings, you gave us a PERFECT DAY.  The Quiche was delicious, the tea was divine, the Scones were AMAZING (and the clotted cream was heavenly) and I love that they offer a Ploughman's Lunch.\n\nI am so glad Sip has opened.  I will be going a lot.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Came here as part of my bachelorette party because I AM A TEA LOVER! It was a small but cute tea spot. Nicely decorated and I loved the designs of all dish ware for the tea. Made you feel like you were royals. all of the tea was delicious and the food as well! The packages are decent priced (tea for 2 for example). Could not complain about anything. Even the service was good! I saw that they have mother days specials as well (I went in May) and would def want to bring my mom here one day! Overall great experience everyone in my party loved it...", "author": "Corelia E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I brought my 7 year old niece in for a tea service and was very pleased. All of the food was wonderful and the staff was friendly. \n\nMost significant was that the children's tea service is only $14 (Lovejoy's and Crumpet & Crown are around $18, and the hotels start around $40!). They also take walk-ins. Both of these factors are a plus if you're taking children for the first time. \n\nWe would definitely go back.", "author": "Wendolyn A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Love this little spot right outside the Golden gate Park! The curry chicken sandwich is amazing. Totally worth the $.", "author": "theresa l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "The service was excellent and very kind & attentive! I'm from the south and it felt like home to me! I got the goat cheese & herb sandwich and I'll never be able to eat anything as good as this for the rest of my life!!! If you're in the Bay area, go here immediately!! It's precious!", "author": "Amy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "My friend and I stopped by to try Tea for Two on a weekday. Its a great location and so bright and cheerful. Service was outstanding which bumped my rating up to 5 stars. We could tell that a lot of care was put into this Tea house as everything was made in house, all the dishes matched nicely. Our waiter was genuine and took pride in what he was serving us, I wish I caught his name. One of the owners even checked in on us when we were getting ready to leave which was nice. We would definitely come back and look forward to trying other menu items.", "author": "Regina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "What a treat having tea at the Sip Tea Room on a Saturday afternoon. Both Paula & Shannon were great hosts. The coleslaw, scone, sandwiches & the cheesecake were out of this world. I picked the delicious rose tea from a great selection of teas and I was not disappointed. Don't be shy, I had afternoon tea all by myself & it was a wonderful experience.", "author": "Wasiliza L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "What an amazing place! It transports you to a proper English tearoom!\nThe food, the selections on the menu, the variety of teas, there's something for everyone. Paula and her staff are so friendly and welcoming.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Lovely upgrade to the previous tea room. Everything is homemade and delicious, and the ladies who run it are welcoming and kind. I look forward to many more visits.", "author": "C P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Just had the loveliest lunch here with my almost three-year-old daughter. The service was very attentive and the food was delicious. What a nice afternoon treat. I'll definitely be back!", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "It's been a while to wait this place to reopen. I like the lovely decorations, sweets not too sweet, coleslaw is tasty, scone and strawberry preserves are perfect match.", "author": "Qing L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-05", "description": "Called in on a Saturday afternoon right before easter and they were able to accommodate us last minute, so the bf, little man and I were on our way. We came in and I was a bit disappointed when I asked if they had a nondairy creamer but they said they had ran out of almond milk. Other than that, service was great, quick and food was more than we could eat!!", "author": "Linda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "This place is adorable!  My friend and I shared the Tea for Two ($51) and it was more than enough for both of us.  We had the Darjeeling blend which I'd highly recommend--it's a mild, buttery tea, and paired well with all the snacks.  My favorite was the scone with clotted cream and strawberry preserves, and the goat cheese and herb sandwich.\n\nWe also shared the sausage roll, which definitely wasn't necessary, but was really tasty, with a flaky crust and brown sauce on the side.\n\nThe service was so friendly--it felt like everyone there had a stake in this place and really cared about the service and customers.  Mom and pop feels.", "author": "Olivia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "What a treat! Sip Tea Room is such a gem. The decor, ambience and service are enough to keep me coming but in addition to that, their food keeps me craving more! So delicious! You can taste the quality as it is made in-house and served with pride. Came with my husband who also (surprisingly) enjoyed himself while he tried all the different scones, jams and explored a wonderful variety of tea options. We also ordered several bite sized desserts and they were made to perfection. Truly a great place to meet girlfriends, treat your family to a unique afternoon out or just to step outside the bustling city and into a quaint English cottage. You'll be welcomed with a smile and a memorable spot of tea!", "author": "Christina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "First time here,  make sure you make a reservation if on a Saturday.  They were full house from Noon - 1:30 pm.  The owners and her son runs this cute tea room.\n\nThe food was delicious.. sandwiches soft and fresh .. scones were warm and the dessert trio was delicious.  They even had someone playing the piano .. which made the high tea even more relaxing.\n\nI can't wait to bring my sisters.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Wow! Even for having opened only a few weeks prior to my visit, I'm amazed. I scheduled a reservation for my mom's birthday and we had an amazing time. The deserts were delicious, and the tea was amazing. Even better, the staff are all lovely people. Thank you so much for being so accommodating, and I can't wait to come back!", "author": "Jasper-Mikhael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Had a wonderful experience at Sips! Every bite is fresh and delicious. Service is excellent, attentive and friendly. The restaurant was nicely decorated with Tea memorabilia and for Halloween! The servers do not rush you as we had a leisure tea for over three hours! Will be back again and again!", "author": "Debbie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Very cute and kitschy. The tea snacks are good, and they let you bring champagne for only like $10 corkage fee!", "author": "kittCAT L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Awesome experience in every way! Sip is in my neighborhood, just a few blocks away, and I've been meaning to stop in. Saturday I finally did with my sister in-law and we had a great time. The owner is amazing. She was able to seat us without reservations (but next time we won't leave it to chance and will definitely call ahead and book). Food was perfection, tea delicious, and attention to detail outstanding. Beautiful atmosphere, knowledgeable staff, and friendly from start to finish. Cannot say enough good things about Sip. Looking forward to my next visit.", "author": "Naomi Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-24", "description": "Had reservations at 1pm for a friend's birthday celebration with 7 ladies. We were seated immediately and went straight to ordering. We got three \"Tea for 2\" option so we can have three different teas to try. We tried: earl grey, china rose petal, and sencha. My favorite was the china rose petal - the aroma and the taste. I love the little strainers we tee all given so leaves and petals from the tea doesn't fall in our cups. Our order for the good can with: cranberry orange scones, sandwiches (turkey & cranberry, aged white cheddar, branston pickle & green apple, egg salad and smoked salmon), blueberry cheesecake and other small desserts. I was a big fan of the cranberry orange scones. The strawberry jam paired with he scones were delicious! My friends were a fan of the lemon one. My favorite sandwich would have been the egg salad. The sourness is the pickle one with white cheddar stood out to me too much so it was my least enjoyed one. The crust part of the blueberry desserts were burnt tasting, which made us all not a big fan of the dessert plate. Very cute spot with festive and cute decor, service was amazing and very honest. Would return, but not a huge a fan of high-tea food so would return for a special occasion. Plan to come earlier because parking is not easy around here.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Went to Sip Tea Room on a Wednesday afternoon with my mom and sister. It is a cute new spot, our tea, scones, and tea sandwiches were all tasty treats on a dreary rainy day. We arrived at about 4 PM, there was no wait for seating but, I  would recommend getting there a little earlier in the day because they had sold out of two of the three scone options.", "author": "Jaedra D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "I came here for my friend's birthday recently on a Sunday, since this has something she's been wanting to do for a while. I had never really gone to a tea room before, so I didn't really know what to expect. But o... m... g... this has to be one of the cutest tea rooms ever. There were lots of floral decorations and chandeliers, and teeny tiny sandwiches and pastries and desserts served on a three-tiered platter. There were more teas on the menu than I knew what to do with. Luckily, since I was there in a larger group, we were able to order three different types to taste - black Masala Chai tea, and herbal options Big Hibiscus and HoneyBush teas. Besides the atmosphere and food/drink, the server was very friendly and helpful when choosing teas. The only part that was kind of distracting was that there was a photoshoot or something going on that day - since it wasn't expected, it felt a bit intrusive.", "author": "Bianca C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-18", "description": "A pleasant spot for a classic English tea service (as they call it) in the inner land of the setting sun. Maybe not quite up to Lovejoy's standards in terms of scone quality and presentation, but still very good. Desserts are the highlight. I like the fact that the tables aren't too close together. Make reservations on the weekends. Service for three will run you about $100 all in.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "A lovely Mother & Daughter tea. The food was delicious! The Cole slaw is the best I have ever had- their own recipe: crunchy cabbage, grated carrot, a hint of red onion and horseradish. The secret ingredient is a bit of apple. Scones were perfection- light and filled with currants. Served with clotted cream, strawberry preserves and lemon curd. Everything made on the premises. Nice variety of finger sandwiches: my fav was with white cheddar, thin slice of apple and pickle. Trust me: excellent.\nTea was brewed and promptly brought to the table. Now for the most memorable part: dessert. The chocolate square was like the best fudge I have ever eaten made Chocolate ganache. Cheesecake square was light and rich at the same time. I had to take the shortbread home, there was jut no more room. \nWoman owned and run business. They have hit just the right note. We listened to Christmas music and caught glimpses of \"A Wonderful Life\" which was being projected on a large screen. Nice touch and not overbearing.", "author": "Michele F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Today's specials: spinach quiche and butternut squash soup. Both were to die for! Everything is made from scratch, down the the pie crust, what a difference it makes.", "author": "Heather S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "We recently celebrated a friend's baby shower here (party of 7) and it was such a fun place! We made reservations and had a 2-hour window for our party. We were seated quickly and they were very nice and accommodating for our group, especially when we went over our 2-hour mark and they gave us a gentle reminder rather than kicking us out immediately. \nWe ordered 3 of the \"tea for two\" which came on a 3-tier serving platter for each order. Each tier consisted of a plate of desserts, a plate of scones with clotted cream, lemon curd and strawberry preserves, and a plate of finger sandwiches and salad. The scones were tasty - currant, chocolate chip and cranberry orange. We had a selection of sandwiches - goat cheese and herb, ham and cheese, smoked salmon, egg salad, curried chicken and cucumber. The tea was also very good - Hibicus, Masala Chai, and China Green. They also offered to refill the teas with hot water during our stay. \nEverything was very good and would definitely choose to return in the future. It is a small place and it does tend to fill up quickly. Would recommend making reservations for larger groups.", "author": "A W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "I decided to check this place out on a whim.\n\nI love tea houses and have been to many throughout the Bay Area, but I didn't know what to expect here since the last time I visited it was the Secret Garden Tea House and I had a negative experience there.\n\nIt was nice and quiet for a Wednesday afternoon.  I had a table to myself.  There was a couple to the left, two women on the right and two women at the other corner of the room.  \n\nThe hostess brought me water and took my order right away.  She was very helpful in helping me choose sandwiches and scones.\n\nI ordered the tea for one with blueberry and currant scones (got the extra scone) and the curry chicken and cucumber sandwiches.  Everything was delicious!  The strawberry preserves, clotted cream and lemon curd were so fresh.  The chocolate cake and cheesecake were dainty and decadent.  The Honeybush tea was excellent.  Next time, I would prefer no onion in the coleslaw.  \n\nOverall, a wonderful tea experience.  I'm definitely coming back!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Really nice English tea place. I went here at about 3pm after checking out botanical gardens. I saw people order 3 tier tea time snacks!! Service was amazing as well. I just had tea with some snacks, but that was really amazing too. Highly recommended.", "author": "Aditya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-25", "description": "Cute little tea room right across from golden gate park. Amazing service and a wide variety of options on the menu. I think I got a lot of food and tea for the price I paid. I totally recommend this place!", "author": "Lina O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "My 5 1/2 yr old daughter and I had Thanksgiving week off so I wanted to spend a fun Mommy-Daughter day with her.  I surprised her by taking her to tea at SIP.  She was definitely all smiles, because this was something she's been asking again for some time.  So happy I was able to take her and we had a WONDERFUL TIME.\n\nWe got there, and it was great because we were the first guests there when it opened.  The staff greeted us right away.  They were very friendly and pleasant.  Our server came over to our table -- was very friendly and attentive.  She shared what was on the Specials board.  And then quickly took care of my daughter by getting her some hot chocolate.\n\nThe menu had lots to choose from.  My lil girl had ( in addition to the hot chocolate), a ham and butter sandwich with some fruit and carrots.  I selected and enjoyed two of their sandwiches:  arugula and egg salad, and the traditional cucumber & cream cheese. I also had their soup & salad:  mixed greens with a bright and tasty lemon vinaigrette and potato & leek soup.  Very yummy!  I also had their Mao Feng Shui green tea along with a warm currant scone that was perfectly paired with clotted cream, lemon curd, and strawberry preserves.\n\nWe capped off our afternoon with a lil dessert:  a bite of cheesecake with blueberry compote and their chocolate decadence.  \n\nSIP is a perfect little gem to meet with your gal pals, treat your Mom, or of course, take your lil Girl spend some quality Mommy-Daughter time.\n\nHighly recommended and we'll definitely return soon!\n\nThanks for a lovely afternoon!", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-23", "description": "Pretty flavorless and kind of expensive. \n\nI love tea services and have had a lot of them. I was so excited to have a tea place in the sunset! But this place just doesn't flavor their food. The cucumber sandwiches and the salmon sandwiches are flavorless and don't have enough filling for the thickness of the bread. The jam for the scones isn't sweet enough, and if you get a scone without a tea package you have to pay $1.25 for any jam/clotted cream/lemon curd you want, and then they only give you a tiny scoop! For $1.25 you should get a bigger portion! The slaw doesn't taste good. The dessert bites don't seem very British and most of them don't taste good either. All around a very disappointing meal both times.\n\nAlso it's cute inside but it'd be more fun if the tea service cups/teapots at our table matched each other. \n\nThe servers are nice though so I guess I'll give 2 stars instead of 1.", "author": "J M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-05", "description": "I tried this place out on February 22, 2018 as a walk-in (no reservation). I'm so glad this location is still a tea room! I had visited the previous incarnation (Secret Garden) and loved that a tea room was in such close proximity to Golden Gate Park/Arboretum. The service was attentive and quick. I had the traditional afternoon tea service. Everything was good; the tea, sandwiches, mini-salad and sweets. The only thing I wish they had was traditional Petit Fours. I will definitely be coming back again.", "author": "Shivaun O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-24", "description": "There was a previous tea house here before SIP, it was called the Secret Garden.  It was very run down and really needed serious updating. The tea house closed and is now under new ownership, SIP.  \n\nThe new owners have made a tremendous amount of improvement compared to the old tea house.  I give them top kudos for the redecoration and updating.  Sip did a great job!  I think this is why my honest review pains me so.  I would have loved to have given SIP a five star rating.  I'm not sure why this tea house has gotten a 5 star rating?\n\nSurprisingly enough I had reviewed Yelp to see the rating and decided that I would give SIP a try.  I have a childhood friend that I get together with a couple of times a year.  We looked at going to SIP as an adventure.  \n\nThe presentation was lovely.  The service was good, too. The first thing my friend asked for was half and half and they said they didn't have anything but milk.  I've never been to a tea house that didn't have half and half or cream.  The finger sandwiches were average nothing extraordinary.  The scones ok but probably the best thing on the platter because of the truly delicious curd, clotted cream and strawberry preserves.  I love sweets but the desserts were not light or delicate but really rich and sugary.  The fruit cup consisted of one cut strawberry, one blueberry and a couple of orange mandarin slices, not nearly enough for two.  The tea was good although I think it could have been a little warmer.\n\nI think one of the biggest hurtles SIP has is to make better food than their predecessor, Secret Garden.  Secret Garden was terribly run down and the service not so great, however, the food was excellent.  \n\nI think this could be a really great place.  Perhaps the owner just needs to dial it in a bit.  I think SIP has great potential.", "author": "Teri O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "What an excellent opportunity to have tea and in an even better atmosphere. Food was beyond great and so much flavor. Teas were warm and fresh. Desserts were so soft and fresh...wow. Highly recommend taking that special someone.", "author": "Stacy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "The service and food was great. Loved what the new owners did with the place; it is open and bright and the decor is lovely. I appreciate that everything is made in house. I took my daughters and my mom there for afternoon tea. My daughter had the children's tea and my mom and I has the afternoon tea for two. We picked the egg salad, ham, curried chicken and smoked salmon sandwiches and all were good. My favorite of them was the egg salad. The desserts that came with our set were blueberry cheesecake, chocolate indulgence and lemon bars. All very delicious. The scone was very good as well. I wish I could have tried more so will have to come back to try their specials. I'm eyeing their soups and quiches for next time.", "author": "Kristina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "My goodness -- what a treasure!  My son, mother, and I like to try different places around the city for afternoon tea.  This place is at the top of the list for quality, service, and atmosphere!  The tea is high quality, as are all the baked goods.  This isn't the type of place where it's all atmosphere and show -- they really know their tea.  I felt pampered for the price, too.  Highly recommend!!", "author": "Laurel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "My top favorite and not just for tea. All the food is prepared right there and by professionals!\nThe ambiance is perfect for visiting with friends, and the service top-notch.\n\nNot just a tea and cucumber sandwich menu - delicious and uniquely prepared savory and sweet delights!\n\nCan't wait to return.\n\nSusan", "author": "Susan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Just tried Sip and it was tasty with good and friendly service. The ordered the complete tea which is served with three tiered tray. I ordered a smoked salmon sandwich and a curry chicken sandwich accompanied with coleslaw. Everything is made on premises and it shows. Wishing them great success!  Gladys", "author": "Gladys K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "We decided last minute to enjoy some English tea for my niece's 4th birthday. We ordered the traditional English afternoon tea and a few other items (sausage roll, quiche Lorraine, plough man's lunch and extra dessert). Everything was delicious. The scone was nice and warm which was so good with the devon cream and lemon curd/strawberry preserves. The coleslaw that came with the tea sandwiches was the the best I've ever had. The desserts were all really good but I enjoyed the cheesecake the best.\nThe service here was amazing, they were very attentive and accommodating. We ordered hot chocolate for my niece and they made it at the perfect temperature so it didn't burn her mouth as she sipped it. They also put it in a tea cup (by request) so she could have that tea drinking experience.", "author": "Diane N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-15", "description": "I'm one of those yelp users that takes a lot and gives little back. But I feel compelled to write a review on this hidden gem in my neighborhood.  Great price point for afternoon tea on Lincoln, right across the street from Golden Gate Park.  The food is on par with most fancy tea places, with nice ambiance and lovely service.  I thought the scones were fantastic (may be on the dry side for some, but just the way I like mine), and the lemon bar on the sweets platter was very nicely executed.  \n\nAreas for improvement: a wider selection of tea (nothing on the tea menu was particularly exotic or interesting to me), and it'd be great to implement some sort of online reservation system so people don't need to call in during business hours if it's not as convenient.  \n\nOther than that, I'm so excited to have a wonderful tea spot in Inner Sunset!", "author": "Rob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Got there just after close today, but the gracious owners let us in for a pot of tea anyway. We had a nice pot of Dargeeling, scones (the last two in the kitchen!) and some lovely desserts. Wonderful location across the street from Golden Gate Park and the botanical garden.", "author": "maria c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "What a perfect little spot, right across the street from Golden Gate Park. Every detail of the place was chosen with love. The tea was spot on, the sausage roll (with BROWN SAUCE!) brought me back to the Isle of Wight, and their baker is just plain DANGEROUS. They have a piano in the corner that promises future music, and I heard a rumor of mild liquid intoxicants being made available in the weeks to come. We will return to this lovely place with friends!", "author": "Ken P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "I hate having afternoon tea. I'm just not girly like that, I don't understand the appeal of drinking hot tea while eating miniature food on a tiered plate, and sometimes having to dress up and wear a ridiculous hat. \n\nSo I went to Sip Tea Room for a shower with my internal eye roll going nonstop and was pleasantly surprised. It's adorable, the food was good, and the service was spot on. All my \"girlier\" friends raved about it and said it's one of the best small tea houses they've been to, and we will be back!", "author": "Anonymous L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "This email place is so cute, and the scones are amazing. They have a nice tea selection everyone is really nice. Make reservations because the place gets booked up on weekends.", "author": "Lyora Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-12", "description": "Delectable, Warm and Happy that I chose this for my Birthday Lunch. Lovely atmosphere and the Christmas Cake was superb. The only reason I did not give 5 stars is that the bread for the sandwiches was dry, other than that everything else was brilliant ~", "author": "Amadis G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Delicious food.  Fun events.  Friendly staff.  What more could you want?", "author": "The E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "I've been to my fair share of afternoon teas, and this one was something special.\n\nEvery single detail- from the sandwiches to the homemade clotted cream and scones to the desserts- was incredible. We devoured the whole tray within minutes. The tea was delicious. The service was warm. Our only complaint is that it's not open for more hours- we can't wait to go back!", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "What a great time we had at Sip! Such a great group of people. Everyone was so friendly and the service was superb. Such cute decor and a wonderful atmosphere. The food was absolutely delicious! My favorite was the lemon bars! I'll be back soon.", "author": "Colleen I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Went here with a dear friend for my birthday and was blown away at how delicious the food was. Everything is homemade! Absolutely scrumptious!", "author": "Hannah G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Had afternoon tea with my friend here and we had the best experience.\nThe food was delicious and the service by the waiter was great, he was so attentive. We tried the tea for 2 and the sausage rolls (to die for).\nWill definitely be back, highly recommended!", "author": "Diane M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "I came here with my sister last weekend because we are trying to break the habit of always going out to drink alcohol. Sip Tea Room was a welcome change. The food was great and it's quiet enough to have a conversation. The decor is classic tea room and they have a kids' menu: I'll be bringing mine here because they will adore it.", "author": "D E A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Lovey place, delicious sandwiches and scones, great tea selection. Plus, every detail was so thoughtful and adorable. Wonderful, relaxing atmosphere!", "author": "Andrea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "Wonderful place to have tea, the decor is elegant and hip. The service impeccable and the food was delicious. I ordered the Ploughman's Plate and it did not disappoint. I was in London recently, browsing the menu this item caught my eye. The flavors of London on my plate and my dainty floral tea cup left me dreaming about my next visit to London. I will definitely be back to Sip with friends and family.", "author": "Therese K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "If you want to escape the sounds and chaos  of everyday life , then step into Sip Tea  Room , \" A spa for your tastebuds and soul \" . You will experience a day made for a king or queen . Where the  aroma  of home made scones , the warm friendly welcome of the server and owners , the delicate fine china touching your lips as the wonderful selection of tea warms your heart , mind , body , and soul one cup at a time \"  awaits you. The fine culinary masterpiece of delicate tea sandwiches , quiche , flaky crust sausage rolls , and the confectioners sweet desserts  are served on a three tier stand of beautiful fine bone china plates with the hint of flower patterns from an English garden . Each member of  your table will be served as if you were the Queen or King of the day .The prices range from $7 .00 to $25.00 and that my friend is well worth the experience you will embrace and  believe me the tranquil feeling , the delicious home style cooking , the smiles and comfort you will receive from the owners and servers , will bring you back to Sip again and again . If you don't believe me ask Paula , Shannon , or Susie , they have seen me at Sip once or  ???????????? Even twice in one day", "author": "Mary P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "i agree with jocelyn k...we've been to secret garden and other tea rooms..but sip is the best ever...simple but yet elegant and traditional ..great assortment of  teas..celebrated my moms eighty-first birthday..someone played piano happy birthday tune...my mom picked out our tea ...me mum had egg salad & cumber ..i had smoked salmon & thinly sliced meat with a great dijon...scones were the best,, & because my wife couldn't get time off..i ordered my tea sandwiches and scones..the sweets..etc. so i could home..i suggest  make reservations..if only two ask for the window seating..i'll go back at least a month...my wife and i born and raised in this neighborhood and a casual stroll through the arboretum  golden gate park..", "author": "Vince V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Stumbled across this great place!  What a pleasant surprise.  I haven't had high tea since visiting England in 1992!  The chocolate chip scone was our favorite with real clotted cream.  Service was fantastic and as well as the decor.  Thank you for a great experience.", "author": "Elements Of Light L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "The sandwiches are tasty, the scones and clotted cream are divine! This is my new favorite go-to!", "author": "Janice E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "I wandered into Sip on a foggy Saturday afternoon and immediately warmed up with delicious tea and a cozy crowd. Although I hadn't planned on eating, the smell of fresh-baked scones was too tempting. I was so glad I ordered one after slathering on homemade clotted cream, strawberry jam and lemon curd. Now I can't wait to go back for lunch to try more.", "author": "Wynne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "I love this place. The food is delicious and the decor is adorable. It's right by Golden Gate Park and is very inviting after a stroll through the park. I highly recommend this place and can't wait to go back and bring a friend!", "author": "Erin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Loved the atmosphere, the smell of freshly baked scones and desserts, the tea, and everything we ate...all fresh and delicious. We will return to this newly opened tea room!", "author": "Carole A."}
