{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Skylark is a bar with a good vibe. They've got a bunch of art on the walls and a couple of booths. I sat at the bar for a bit and talked to the bartender. The drinks are priced low for the hood and you can get a stiff red bull vodka for about $8.\n\nIt's divey but has good DJ's + staff. I was in the Mission on the lookout for anywhere with good music and a decent crowd, unfortunately in was a Wednesday night. Walking down 16th street, Skylark was  the one place with good music bumpin. To be honest the bar was empty when I walked in with only a few people inside but as the night transitioned a few more people showed up and that's when the energy changed. It wasn't packed by any means but a couple folks got on the dance floor and before you know it there most of the people ended up on the floor. The DJ seemed to be practicing for most of the night but once people got on the dance floor, he picked up on the energy and matched the music with the dancers. With the crowd on the floor he did a nice work of keeping the energy up. My Wed night was shaping up to be pretty dull but Skylark was able to keep my Wed night respectable among the many sleepy bars I walked by on 16th.", "author": "Sasha G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "Good music but it can get really hot and stuffy in there. Bathrooms are always a mess, especially the ladies room ( smh ) but hey you can't go wrong with a $5 cover charge so if you want a place to dance, have drinks but still leave drenched in sweat then Skylark is the place for you. \n\nA lil advice to the ladies, check your shoes before you walk out. I can't even tell you how many women I saw walk out with tissue & paper towels stuck to their shoe because its all over the floor.", "author": "Gwendolyn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-20", "description": "I went here for the first time ever in my life with ny girlfriend and a few of her friends. I am never coming back. Drinks were okay. We got a free cabaret show. However the service was just awful. My friend won a free drink and they did not want to give it to her. My gf tried talking to a bartender named Griffin I believe who was a jerk had no class and was rude to her. We asked for a manager he said there is no manager. We spent quite a few hours and $200 here and for us to be treated this way?! Nope my friend lost her card and while looking for it we lifted up some seats and saw how filfthy this place really is.", "author": "Gee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-11", "description": "Came here on a Friday night while visiting in San Fran.\nTook me 20 mins to get the bartender to even acknowledge me ordered a vodka and rebull and found a fly in it. Took me another 20 mins to get her acknowledgement and when I tell her she gives me a dirty look rolls her eyes and dumps my drink and makes a new one. A simple apology would've been grateful. RUDE RUDE RUDE!!", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Came to Skylark Friday night for the free Burlesque show. Showed up at around 7pm after work and the bartender was attentive. I sat in a comfy booth and met some friends. Then the show started and this drag queen came out and started playing trumpet - have to say he was pretty dang good. He was poppin out some jazz classics with some bawdy dancers faux stripping. it was fun, cheap and cheerful and the joint was hoppin. I had a shitty week at work and the Frose and vibe helped me get my weekend groove on. Only bummer was hip hop DJs come out at 10pm and couldn't stay that long.\nI would come back here.", "author": "Anna A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "Perfectly solid, no-frills dive bar in the Mission. However, unlike most dive bars, Skylark actually has a legit cocktail program. I was quite impressed with their spirit selection.\n\nI came in for a quick pre-dinner pop (aka Tequila shot). The bartender had a heavy hand and my drink cost me less than $10.\n\nI can't really say much more about the place because it was more or less one-and-done for me. That being said, if I was in the neighborhood again, I'd def come back for some more hooch!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "I haven't been to this place for a couple of years. It was a $5 cover but it's SF so can't complain too much about that. Inside is still the same red decor as I remembered it in the past. DJ was spinning a good mix of different types of music from TLC, 112 to Big Sean, Drake, etc which is what I always enjoy. $8 Vodka Redbull just to give you an idea of how much a drink would cost here.", "author": "Gerard Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-18", "description": "About two months ago my date and I went to this bar after eating at that adorable cantina next door. We had a great time. Drinks were good all night. They played throwback 90s music. It was cool. Crowd was mixed. Two months later we went back. Drinks were better this time. I hope my date left the bartender a good tip. The crowd left so much to the imagination. There was a pretty light bright back twerking. Cutie pie. The dj played the exact same music from last time. My date was chilling but I almost died of bad vibes. I feel bad, I know he wanted to stay. I wanted to stay to at least for the good drinks. The music was cute the first time. Second time not so much. I will probably go back because humans enjoy abuse. Naw for the drinks their fire. They need a NEW dj on Saturday nights.", "author": "Terina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-16", "description": "The best thing that Skylark has going for it is the music!  You might not think it from outside, but they always have some bangers to play here!\n\nAside from the music, it's an OK environment.  Nothing super special though.  Their selection of drinks is pretty nice; they always are able to make my favorite couple of drinks for not a lot of money!  The prices are pretty decent here, especially considering its location in the Mission.  It's a really nice place for an after-work or school drink with coworkers or friends.\n\nThe thing I don't like so much about Skylark is how crowded it is.  It's a pretty small place with a small dance floor, which doesn't allow for much movement or dancing for that matter.  It's pretty dive-y, which is great for people who like that a lot, but I'm not the biggest fan of that, but I'll still go sometimes for decently priced drinks, good music and pupusas next door! It's always where I'll end my skylark nights!", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "Solid neighborhood bar that many refer to as a dive, but feels more like a saloon with all the stools along its counter and plenty of chairs and tables at which to sit. In the past, they've offered deals and drinks honoring President Obama. In these darker times, the fun nevertheless continues with cheap happy hour drinks and an inexpensive selection of cocktails thee rest of the day. Service is fast and efficient, and the bar can accommodate group events. Gets the job done well.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Lots of great options of men always. I come here mostly to make out, but also dance. They play all the best slaps. F it up, F it up!", "author": "KT D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "No cover on Satudray night so that was good. \n\nThey didn't have the obamatini which was prominently listed on their menu, so we settled for some wine. Ordered some malbec from Argentina that was absolutely delicious. At $8 a glass it was pricey, but the pours were very generous and at least 1.5 glasses. Cool place to check out.\n\nDance floor is ratchet AF.", "author": "Edward W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "I live in Fairfield and it's my first time at Skylark. My boy Cam from SF told me about the spot and Margaret the bartender is AWESOME and totally hot!", "author": "Angel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Love love love this dive bar in the Mission, where I alway have a great time on the dance floor.  DJ's play dope hip hop beats and my fave bartender, Margaret, is attentive, on point and fast! My go to place in the Mission. Oh, and prices are reasonable. A place where you can still find native San Franciscans, always a good time at the Lark!", "author": "JJ D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Good music, great bartender on weekdays and cheap drinks. \n\nCasual afterwork place on weekda", "author": "Maria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "My favorite place in the mission! I always like to stop here when I end up in the mission. The Dj's are great and the bartenders are attentive!", "author": "Iza C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Skylark is my cheers.\n\nIts filled with locals and the staff know me by name.\n\nIn terms of bars, skylark has a variety of cocktails and great beers on draft. The space is large, ample TVs and great music. Almost every night of the week they have some themed party, but shout out to free burlesque/comedy nights on Fridays! While to some, this may be \"just another dive\" in the mission.... The glue that keeps me coming back is the service. Jordan and Dino (who I hear is no longer there, Hi Dino!) are engaging, charismatic bartenders that are quick on their toes. Zero attitude and always keeping your drinks filled with a smile.... Something that is hard to come by these days, especially in the mission.\n\nPro tip: happy hour is 4-9pm 7 days a week and they allow outside food. Pupusas next door are life changing.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "3.5 Stars\n\nHH\n$4 pints\n$5 wells \nGood amount of seating\nFriday night around 6pm is relatively quiet \n\nOverall Thoughts\n\nCurious to what the night vibe is like once it gets packed", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "Went to The City with My Husband, In laws , & Cousins looking for Fun Bars we went to a few but wasn't quite what I expected happend to be walking toward another bar we were directed to by another pedestrian from the area we heard them playing E-40 and we decided to give it a chance I'm really happy we did it was exactly what we were looking for !! They had a live DJ , & Dance floor it was AWSOME there was allooooot of people there and barley any room to move around so there was a lot of bumping in to people but honestly when your drinking and having a lot of fun it doesn't matter !!! I Can really say this place is amazing and we will definitely be coming back !!!!!!", "author": "Mrs L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Skylark is a diamond in the rough. With its recent update the bathrooms are the cleanest in the mission and it has a new nautical charm with murals by Amanda Lynn. It's almost two bars in one. At happy hour you can sip on whimsical cocktails from their menu or decent wine and after 10pm the relaxed cocktail bar transforms into a dance club. It's the best of both worlds.", "author": "Jetsetgirl B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Love going to skylark. Only thing is its not too big. But they have nice seating on the perimeter and along the bar. Dance floor gets crowded. They always play the best music and everyone loves to dance. It's a nice atmosphere and cool place to hang out at with some friends. They play rap, bay area music and popular hip hop music. And staff is friendly. If you want to dance and sweat, this is the place to go.", "author": "Alexandria S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-09", "description": "Ha! My friends and I ended uo here one night after we spent some time in a bar nearby, where the people were rude and stuck up. There was literally no room. Just elbo room :| \n\nI asked the security guard where I can go, and he recommended me here. There was a $5 cover.  Threw us all off bc in Vegas, we never pay a cover haha! But we paid anyway.  The place is not that big.  Very intimate to say the least.  They were mixing hip hop with 90's hip hop.  We weren't here very long, so I didn't order a drink.  We did go to what is the \"dance floor\" and I danced a little bit.  The whole vibe was something like an underground party.  Speakers bumpin, dancing extremely close, like the sweat from the other person will hit you.  Some of the folks there were extremely gone, so they were more like swaying and throwing themselves, rather than dancing. But watevs I guess.  \n\nI heard reggae nights are the nights to go.  We were only in town for the weekend.  An experience for the books, that's for sure!", "author": "Demetria W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "If you don't mind the smell of ganja, the lingering soot of regret, or washing your hands where someone decided to deposit their gastric contents, then this place is for you!   Having grown up in the city and being exposed to just about everything (family business in the TL), this place feels like SF.\n\nThe bartenders, the drinks, the incessant bass intermixed with the cliche of high hats all make for a great vibe.  \n\nNote:  Having lived just around the corner, this place, for visitors from out of town, may make some people feel uncomfortable.  Why they are my friends, I am not sure-- but this area is not for the faint of heart or snobby foo foo poo poo heads.", "author": "John L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "Skylark is the only dive bar I can rely on for a good time, any day of the week! Discovered this place over a year ago and I haven't stopped coming. The 2 main bartenders (Dino & Jordan) are humble, friendly and great listener if you need to vent after a long crappy day! \n\nThey also have one of the best happy hour deals, $4 for wine or beer and $1 off of cocktails until 9PM daily. And when I'm lucky, I stop by on the day that they play some old school jams or hip hop. People overlooked this place due to the exterior or they think it's \"ghetto\" but trust me, it's spacious inside, drinks are good, bartender are great, and it's my go-to place after a long day!", "author": "Katie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-01", "description": "Hole in the wall spot that plays hip hop music. Could have better mixes on the songs they play. That $5 cover- (Double Dutch charged the same) it's really your preference both are equally the same in music and crowd but my friends opted for it hoping for a burlesque show. Crowd is mixed- anywhere from the nerdy tech boys to the middle age crowd.", "author": "Kai A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Came here on a Tuesday. I don't remember if there was cover. If there was I think it was $5? But you guys know how I hate paying cover for anything. \n\nAnyhow, I really liked this place. The bathroom was near to the dance floor in case you had to yak. There was barely anyone there. The music was nice and the drinks a plenty. If I'm in the mission again, and there really is no cover, I'm hopping in!", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Great local neighborhood hang out with really nice bartenders and a great free variety burlesque show on Friday nights! Yeah can't get any better than that!", "author": "Rasa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "The 5 star rating is for the Friday night DJ and music selection on the night I was there (May 19,2017)--Music: HipHop (current and older); R&B (current and older) think --Naughty by Nature--Prince--Ghost Town DJs--Michael--Tina Marie--Jay Z--etc. If you love the genres/artists mentioned and cutting a rug, you will enjoy this place. The dance floor is small and it gets packed and hot in here, but again, you are coming for the dancing, not the seating selections (although there are some around the perimeter, bar, and front room) or the ambiance (whole in the wall)--the crowd is a mix but looked like a lot of locals who knew about the place and came for dancing. Also, there was a $5 cover which was well worth it considering we danced for about 3 hours straight. The block this place is on is very busy at this time of the night with some interesting folks around...we had a great time!", "author": "Ana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "Ended up going here with a bunch of friends, the hip-hop music was just right. The place had good vibes and the people, mostly locals, minus all the touristy riffraff.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "One of my favorite after work \"dive bars\", and I mean that as a compliment! Good happy hour, great bartenders and they can make a COLD dirty martini. Bartenders are friendly and make your drink exactly the way you ask.  Love this place.", "author": "Daisy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "No Cover Cabaret on Friday nights. Great night out in a friendly bar, but if you're coming to Skylark on a Friday night, be warned that at about 8pm there's a FREE cabaret & burlesque show. It's a bit tricky to see what's going on some of the time because the lighting for the performance space is inadequate which is a pity because most of the performers are really good. It's a short show with lots of variety as there are different acts every week - comedians, burlesque, make burlesque, singers, musicians. The bar really needs to sort out the lighting for the performers though...", "author": "Kym S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "This is one of my favorite bars. Cool, classy, subtle mermaid/seafaring theme, powerful drinks, nice/attractive people. And being in the mission, it's close to EVERYTHING. Want some pizza? Around the corner. Pupusas? Next door. Sushi? Across the street. Sometimes they do fun and sexy shows ;)", "author": "Jesse F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Skylark is a gem. The space is big enough to not feel crowded with a full house and small enough to feel intimate. I particularly love the Esther Williams-esque Skylark Mermaid mural on the ceiling. Drinks are well balanced and they have a wide selection of spirits to enjoy. You can sit in a cozy front windows, at a cabaret table, around the dance floor, or (of course) at the bar. I've danced many a Friday night away on the Skylark's dancefloor! It's my go-to bar in the Mission.", "author": "Kitty O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "If I could give this place a 0, I would. I was very disappointed coming here. I came here with a group of friends last night, April 16, 2016, and wasn't able to get in. Apparently my Florida DL was a fake, according to the bouncer at the front door. Never having tried scanning it, he \"knew\" it was a fake because he had spent several years \"hustling in the streets\" as he put it. \nWhat really aggravated me was the fact that he acted as though him giving it back to me were doing me a favor. I honestly would have wanted him to keep it so I could have called the officials to get it back for me. \n\"How you gon' hate from the outside of the club when you can't even get it?\" I guess though.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "About as divey as u can get and not a good area. But Guinness on draft and only $4 during happy hour and a good burlesques show for free on Fridays. The bathroom is really nice and clean!", "author": "Skinny Coach u."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Services drinks only. Great Happy Hour specials and great drink prices for the area. Walked into a burlesque show on Friday night. Turned into a club with DJ spinning banger tunes.", "author": "Dawit B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-26", "description": "90's hip hop r&b?  DOPE\nstiff drinks? YES\n\n$3 entrance fee on a Saturday when it's dead arse fck in here? dislike, especially because the \"dance floor\" is the size of my bathroom. That's hilarious.\n\nThis is a bar, not a club. You can come here and have a chill night though!", "author": "Susy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-29", "description": "Skylark is chill. Light one up and don't worry too much about it ;).\nAlways good vibes. \n I just wish it were a little cleaner .", "author": "Tia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-25", "description": "Came here to celebrate my sisters bday on a Saturday nite & we had a blast. The drinks are kew prices and the music was great!! Will definitely come bk", "author": "Ari B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-17", "description": "The worst bar I've ever been too, I'm 21 and they took my California ID for no reason because they thought I looked young, I can't believe they would hire some bouncer that takes legal ids that's insane that is against the law. This is such a horrible bar", "author": "Dakota G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-17", "description": "The bouncers at this bar are incredibly rude and pull random people aside and call them out on supposed \"fake IDs\". I'm 22 and the light skin chubby guy with the beard thought he was in a Vegas and tried acting all macho and wanted 50 dollars to get my \"fake ID\" back and into the bar. This guy should be reported to the police immediately. I hope the owner reads this and fires him quickly.;", "author": "Danny J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Great place for happy hour! Even on weekends!\nCame here Saturday night to kill time, and the beer was only $3 and my mixed drink was at happy hour price too. It is a great dive bar to get the night started. We walked by afterwards and we saw how busy it was. We'll try it again after 9pm next time.", "author": "Mayra E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "I was looking for a bar in the area and came along this one.  Went in with no expectations but came out pretty satisfied.  They had NBA games playing on the TV's (the main reason I was there) and the beer selection is decent.  They had a variety of random cocktails as well that sounded good.  The bartender was very friendly and made small talk to all of his customers.  Seems like a lot of locals come here as the bartender seemed to know a lot of the patrons by name.  I would definitely come back here again when I'm in the area.  Very low-key setting.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-08", "description": "This is a great place to end up towards the end of a night out in the Mission district.  This is a great place to end up when you just want to dance and do not care about anything else.  This is a great place to go when you want to walk into a bar that always seems to be a little hazy and fragrant.  In all seriousness, Skylark is a decent place to go dance to hip hop music.", "author": "Alex E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Went in here a few months ago with some friends for happy hour during the day. The waitress was friendly and made strong drinks. My friends and I were one of the few people in the bar. There is art on the walls and ceilings which makes this a memorable spot! \n\nWould definitely come here again. Not sure how the bar is during busy times.", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-06", "description": "Party Rock Wednesdays NO more... *SIGH*\n\nRemember when you can party every night of the week, get smashed, and STILL arrive to work on time, bright-eyed and bushy tailed? Sadly, those days are long gone for me. Nowadays, I can't even make it to 8 PM after happy hour as my eyelids droop faster than when an 80 year-old grandma takes off her bra.  \n\nAnyhow, for those 20-something young professionals who I envy, the BEST night to come to Skylark is on Wednesday nights for Mixtape Wednesday. It's the only night of the week they charge a $5 cover (after 10 PM) so you know it's crackin'. The DJ spins a good mix of Old-Skool Hip Hop to keep your booty movin' all night. \n\nBeing the Golden Girls that we are, I being Blanche, the liquid courage inducing man-hungry fluezy sans the male admirers, my girls and I came to Skylark a week and a half ago for some post-dinner drinks. Happy hour was still in effect (ends at 8 PM), I ordered one of the tasty $5 cocktails from the HH menu. http://www.yelp.com/biz_photos/SdXPtsreVImvvL2V2hP8vQ?select=dcJl5JBPoEVA2HZ_cy2cww The Red Robin is a vodka based cocktail with a tangy plum wine flavor. The nice, male bartender even gave us some peanuts and pretzels to nosh on with our alcohol inducing appetites. \n\nThe HH crowd was not easy on the eyes and I doubt \"drink till he's cute\" would work here unless you wanted to be carried out in a gurney. This ain't the FiDi that's fo' sure!\n\nOTHER NOTES:\n*NO cover except Wednesday nights\n*NO dresscode\n*Divey and dark \n*Live DJ spinning every day\n*Very small dancefloor in back\n*Crowd is ghetto with a touch of hipster\n*2 large booths and about 5 tables for sitting\n*One dirty restroom for each sex\n*2 for 1 drink offer when you check-in via Foursquare\n*CC's accepted", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-22", "description": "Sure, it's a dingy dive. \nYeah, it smells like bathroom, because it's probably not that clean. \nSooooooooo what. \n\nStrong cocktails, decent whisky selection, nightly specialty drinks for $8. Go during the week when it's not packed - you'll actually be able to hear your friend talk across the table before you go to your *actual* destination. Just don't expect to be able to see her. Good place to meet if you like hiding in the dark.\n\n(Note: I feel lucky that my phone didn't get stolen out of my bag, apparently that's a common problem here?)", "author": "Ray J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Outstanding neighborhood bar close to BART. Excellent long running FREE Friday Night Cabaret show produced by the fantastic Hunny Bunny. Great drinks, cool vibe, nice new nautical theme.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "We were visiting from out of town and heard about this place. We had a couple of great local IPAs (at the bartender's recommendation) and he also gave us great ideas on where to go next. A fun spot to include in our very brief visit to San Fran!", "author": "Molly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Love this place! Any time I head into the mission I always start my night with a Skylark $4 pint. My lady loves this place too. Musics dope. And Brian the new bartender is HOT.", "author": "Chris E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "Great service! Great drinks! Found this bar while walking back to Bart one day and it made my day!! 100% recommend!", "author": "Margeaux K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "AMAZING selection of Bourbon: Blanton's, Basil Hayden, Four Roses, in addition to many others.  RARE for a San Francisco  bar.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-03", "description": "Small narrow place and a bit dim.  But this place was live and active.  Many people hanging out, drinking, dancing, and ultimately having fun on a Saturday night.  They were giving away \"sample shots\" of tequila and I was able to get a few in before I started feeling bad that others weren't getting \"sample shots.\"\n\nI absolutely loved the music playing.  A lot of it was old school R&B/Hip-Hop to now.  Anywhere from Montell Jordan to 2 Chainz.  It was a $5 cover, but you were then given a $5 chip used to purchase drinks.  Definitely a smart way to get people to buy stuff at the bar.  I would come here again the next time I am in SF.", "author": "Geoffrey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-26", "description": "Skylark- A local neighborhood bar in the Mission. Last night I just needed a night out due to a frustrating day. Luckily I remembered my friend throws parties here every Wednesday, so I knew were to go. I don't usually hang out on the weekdays but I hear Wednesday nights here is the place to be. \n\nWhen I arrived, barely no one was there, so my friend and I had a drink. 30 mins later a couple of my other friends joined me and I noticed the place got packed! Note this place is not big at all, just a small bar with a capacity of about hmmm maybe 70? Music was old school hip hop and a diverse crowd. Drinks were averaged price, with a small dance floor. \n\nOverall..I had a good time, I had forgotten that a lot of people go out on a Wednesday night. Cool chill spot to hang out at.", "author": "Kathy V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-29", "description": "Good: location, eclectic crowd (which can be good and bad but I liked that all kinds of people felt welcome there), the music was ok. You remember a good DJ. I won't remember this one.\n\nBad: $5 cover. Really?? For this place? The space is not great either, the ceilings are really low so there is not a lot of room to breathe. But the worst part was the bouncers who were so flippin' rude. They were just cold to me but they were so rude to the group in front of me. I felt like I was trying to get in a den in Hunt's Point or something.", "author": "H J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "If you are looking for Hip Hop to dance to without having to deal with all the Club BS, you should come check this place out.  No cover and the dance floor is always packed.  Sure it doesn't have all the hottest people, but everybody is there to have a good time!   From outward appearances, it can seem a bit ratchet, but once you have  couple of drinks and step out on the dance floor, its all love.\n\nDrinks are fairly cheap ~$7 and the bar is pretty quick, even when its crowded.  Open seating, but that pretty much fills up even before the dance floor gets going.", "author": "Veasna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "I've been fan of the Skylark for years, mostly because of the eclectic DJs and music they host. I'm a particular fan of the Monday night reggae scene they have going. The DJs like Vinny Ras, et al. spin some awesome classic roots mixed with occasional dub. You gotta smell the iration aroma inside to believe. Best to go with a group of friends to maximize the experience. When inside, take a look around, the old-school facade has been enjoyed by thousands over the decades. Let's keep this tradition strong!", "author": "Brian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "Always fun-! Good music and super cool bartenders ;-)\nEvery Friday burlesque show is neat--!!", "author": "May Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-01", "description": "If you want your phone to get STOLEN, go to Skylark!!! It doesn't matter whether it's inside your purse or your pocket. It WILL get stolen. And the worst part about this is the people who work here know who the thieves are, but don't do a damn thing about it!!!!!!!!! \nNEVER AGAIN!!!!!!!!!!!!", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-01", "description": "Our go to place when we visit SF. Music on point, they play hip hop/r&b. Drinks are strong and pretty reasonable in price, we drank vodka n cran, I guess the bartender wanted to be super stingy with the cranberry juice. Lol! I didn't mind at all!! It is kinda small and there's one bathroom for the girls and one for the boys. So when there's a line it goes out onto the dance floor. And if you go into the guys bathroom, the door doesn't lock. Lol!!! So bring a friend. All in all its amazeballz!!!!", "author": "MaliaAdrian M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-25", "description": "It was grew except for the lost of my wallet, I was pick pocketed and realized this as soon as I left the bar, and went back in to look for it, but obviously it was no where to be seen. Bartenders and bouncers did little to help.", "author": "Karen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Service = friendly.  Granted, I'm sort of deaf, and when he asked me to pay for my first kamikaze, I totally did not hear him.  Oooops!\n\nHappy Hour, FTW!! \n\nI'll be back here for cocktails.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "Came here on a Thursday night with friends for a much needed night out. Our Mission tour guide is an elitist when it comes to night life in the City so we entrusted him to find flavors from all over in this colorful town! \n\nOur main venue for the evening was at the Skylark. I had a great time perusing the bar, dancing away (sheepishly at first) to the sounds of 90s pop/R&B and belting (maybe shouting) out tunes from the good ol' days! \nThe all female DJ's were awesome! Very attentive to their audience and danced along with everyone while handling things behind the booth. It was certainly a sight to behold. \n\nThe dance floor is relatively small, but not crowded at all when we went. It was the comfortable kind of crowd where you're not touching people as you move along. \n\nThe only issue we had was the bartender gal not coming to the other side of the bar to take our orders. She eventually came and all was we.\n\nA very down to earth venue, great music and a lot of people in their mid-20s who actually enjoy the music that's being played.", "author": "Jennifer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Great drinks. Music was on point. Dance floor a definite plus! \n\nI came here for the first time with friends on a Friday night and had an absolute BLAST! Me and my boyfriend don't go often to lounges like these but we had so much fun, we will definitley be back!", "author": "Rocky G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-10", "description": "Fun dive bar with PBR and entertainment on tap!  Fun patrons.  Bartenders are friendly and fast at slinging great drinks.  Check it out Friday nights.", "author": "Zach T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-08", "description": "Friends decided to come here on a whim. They wanted to dance, and the line at Double Dutch was long. Whatever, no big deal. \n\nWalked over to Skylark, and got inside. Right after making it through the door, I already knew I didn't want to stay. Yes, it was a Saturday night, so I expected a ton of people, but good lord. Seriously, don't be offended if i put my hand out on your back to pass by you. It's a freaking courtesy, i DON'T want to touch you just because. People acted SO offended that I was passing by them. I didn't realize that you owned the entire place. Jeez\n\nAnyway, this place smells of desperation. There's a TON of people just standing around the dance floor. Seriously? You're taking up room by just standing around. We were in there for no more than 3 minutes and my friend gets her phone STOLEN out of her hand. THREE MINUTES. Tried looking for it, no luck. Went outside for air, came back in for a little bit and we decided to be done with this place. Total time spent in this place: 5 minutes. \n\nMaybe I'll come back another time, but good lord. It's more of the people in here that is the deal breaker for me.", "author": "Steph W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-12", "description": "Love Skylark, have been coming here for the last 7 years. They get in some great local DJs and always play my slaps. Great service and nice bartenders, shout out to Brian, always working hard and being respectful and genuine to his customers.", "author": "Cat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-18", "description": "The ambience of this place is awesome. There wasn't a lot of people when we went, the music wasn't overly loud, and they were playing some nice old school stuff (not hip-hop when I was there). It feels like a place you can visit with a group of close friends and you don't have to scream your lungs out.\n\nThey also have 2 nice booths for groups to sit at.\n\nHowever, I wasn't so happy with the bartender. My Hendrick's gin&tonic tasted bad...can't taste the lime juice or the gin's natural sweetness. It's pretty hard to mess up such a classic drink. Next time I might just stick with a beer -- hard to mess up, and I still get to hang out.\n\nNo cover needed Friday night.", "author": "Alice C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-14", "description": "With all the rave reviews, I thought it'd be more fun. The ceiling mermaid is pretty cool, but the extreme hip hop music? no thank you. that cannot be considered as dance music in my world. It gets crowded really quickly, an odd collection of fake hipsters and cocky SoMA/Marina kids. eh. we left early.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "To the people writing negative reviews: what did you think this was, Double Dutch!? \n\nSkylark is the perfect place to kick back and have a quiet beer. Later on, you can rock to a live DJ spinning old flatjacks, seven-and-a-halfs, and even dusting off a few original NWA folkways recordings.\n\nI was trying to forget about a woman who didn't know desire, so I came in here last week. \n\nThe beats were bumping, and beer was even quieter than usual.\n\nA few notes:\n\n1) The DJs tend to spin a lot of semi-acoustic/industrial proto-Gaga post-rap. I dig it, but if it's not your thing, you can always go to Double Dutch or just go die.\n\n2) Don't go to the bathroom if you aren't prepared for weirdness. I opened the door and saw a hundred leagues down into the abyss, locking eyes with a slumbering cephalopod deity.\n\n3) You can't just make yourself stop loving someone. Even at Skylark.", "author": "Benjami N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-21", "description": "All I remember is drunk dancing/falling for two hours while singing along to GUCCI GUCCI LOUIS LOUIS FENDI FENDI PRADA. I'm going to assume I had a good time. \n\nMy friends refused to let me drink anymore so I have nothing to say about their beverages haha. There was no cover and the guys at the door were so nice! I hate when you haven't even entered the bar yet and people are already being assholes. The bar was packed with people but not to to a claustrophobic extent. \n\nI didn't even notice how pretty the outside of the bar is until I drove past it the other night. All those pretty lights!!!", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "This place got 3 stars.. exactly what it should get.\n\nThis is one of various bars on 16th street. \n\nATMOSPHERE: low-key night out. No cover, drinks are decently priced ($7) I bought the skylark drink which was pretty good and sweet for 7. Some tables to sit but it's a narrow bar (like the rest of SF haha) with a small dance floor playing old school hip hop \n\nCROWD: mixed, kinda ghetto\n\nOVERALL: This is the type of place you go to chill or pregame for a bigger place haha, not one to spend all night at unless you really just want something low-key. We came here because it was right across a $10 parking lot and then we walked a mile to Bruno's haha. But there are plenty of other bars to check out on 16th.  Whether you stay or hop, have fun! It's an alright place :)", "author": "Raquel Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-24", "description": "Been going to skylark for a while and usually a good spot.  Went in this weekend and both my friend and I got our wallets stolen.  Hasn't been the first time I've seen this happen.\n\nMusic is usually great, bartenders are quick but the place is getting shady with all the thefts...", "author": "Chris P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "Love this place! I lost my cell here & someone returned it to Jordan the bartender who then returned it to me later that day. That is rare in this neighborhood.  \n\nPlus, this place is a guaranteed good time. Everytime I've been here, the music is great, the people are fun & the staff is fantastic.", "author": "Alisha O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "My favorite spot in SF \nBest music, people, neighborhood \nLiquor stores everywhere so drink first then go in.", "author": "Gabs T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-21", "description": "Not my favorite place but definitely ok.\nThe night I came here I just wanted to relax and have a beer. The music was way too loud. It was almost empty so it felt a bit overkill to have it that loud. But maybe that's a good thing if you're in more of a party mood.", "author": "Diana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Funny what a few shiny lights will do to reinvigorate a dingy, relatively forgotten (at least as far as I'm concerned) rathskeller in the middle of the Mission, huh?\n\nI'd literally forgotten this place was even around, and while waiting for the trusty 22 to pick me up and sweep me away, I noticed that Skylark erected a spiffy new sign that looks as if it were a cast off from downtown Las Vegas that found new life in San Francisco. Bright white bulbs and an old school aesthetic that draws you in like a mosquito to a florescent blue electric aura. It's quite the eye catcher, and because of the new addition to the awning, I found myself bellied up to their bar in no time with a frosty drink in hand as I awaited the arrival of my coach which was scheduled to arrive some 14 minutes from the moment I sauntered through the front door.\n\nIt'll be interesting to see how many people have a similar reaction to my own. The addition of that sign could very well be the best thing that ever happened to this bar!", "author": "Ruggy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-07", "description": "The bartenders and the bouncer were not friendly at all, but I really loved the vibe of the place. Great location near BART and their reggae show for Bob Marley's birthday was a great time. Lots of dancing, lots of green, and moderate drink prices.\n\nAnother semi- downer was that there is a $20 card minimum. I hate that about the mission, that they have cash only policies or ridiculous card policies. Credit is so prevalent that they should help their customer base by accommodating.", "author": "Jennifer S. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "Always a good night every time I come here!\n\nI've been coming here since I was in college some moons back. Still a popping place for both the newbies and everyone else in between!\n\nGreat bartenders and service! Drinks galore and quite yummy and great prices!\n\nThe DJ they had when we went was awesome! The music was crazy and it was a great mixture of the 90s and today which I found myself literally dancing the night away!\n\nSlight downside, their bathroom is not as clean and well-kept regarding my standards.\n\nAll in all, still a fantastic venue to come out to for drinks and dancing!\n\nToodles~", "author": "Mae M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-23", "description": "If you like fat douche bags who won't let you in the door when the place is completely empty, this is the place for you.", "author": "Jon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "Dropped by on a random Saturday night, fell in love.  Played 90s, hip hop (Kevin Little, Mariah Carey, Juvenille, etc.)  small dance floor, but its exactly what I expected when bar hopping in the Mission, SF.\n\nGot 2 drink chips for my birthday. Wasn't fond of the $5 cover but I guess the tokens made up for it!", "author": "Alyssaaa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-10", "description": "This is the shittiest bar service ever. I tried to order a whiskey and coke and the dumb ass bartender kept yelling back at me saying it was loud...guess what? You're at a bar with music, don't yell at the hand that pays your bills fucking asshole. I simply was trying to explain my drink order, sorry if that was frustrating for you, get a new job if you can't handle a loud work area where you make a living off tips. Wow.", "author": "Marlene N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-14", "description": "Headed out for a cousins bday & we all ended up here by someone else's choice.\nI couldn't hang too long. \nNot the greatest crowd. Ghetto & those trying not to be.\n\nLadies,  if you like bastards groping you as you walk the thin line between bar via dancefloor to get to the restroom, this is your heaven. Especially when you turn & have no clue which gross looking gold toothed mofo just cupped your ass.\nLucky I didn't know who did it as my 6'5\" friend may have handled his ass as well.\n\nI'm sure this can happen anywhere but I don't like cramped spots for this reason.\n\nMusic sucked anyway.  Bartenders were efficient at least & the bouncer wasn't a douche.\nNot recommened regardless.\n\nPass.", "author": "Athena S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-14", "description": "Note: I've never been to Skylark on a Friday or Saturday night.\n\nThe few times that I've gone to Skylark, it's been the middle of the week, around 7pm.  The music is good, the drinks are well mixed, and the bartenders have all been friendly and helpful.\n\nIt's a good place to hang out if you want to be able to talk, and not have to talk over loud music.  There are some booths around the exterior, so you can comfortably sit with a nice group of people.  And lastly the ambiance is relaxed and a little retro.\n\nI like Skylark, I always think of it when I'm near 16th street.  Check it out on a nice slow night and enjoy yourself.", "author": "Margaret I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-12", "description": "Was ghetto before and still ghetto now!\n\nIf I ever want to run into one of my homies from Westmoor High School and get caught in that awkward conversation of oh hey how are you how's everything and not have the conversation materialize into anything then stand there awkwardly until one of us is like Let's take a shot!! while Too Short- Blow the Whistle is playing in the background, then I go to Skylark. Wow there were so many grammatical errors in that sentence but it's OK, it's a review of Skylark haha. What more can I say about this place. It has a good location and somewhat cheap drinks. The music is good and the ambiance is hyphy. The crowd is rough most of the times. I wanna say I've heard of a couple of stabbing happening here but you can still have a good time. \n\nSkylark is good for groups and if you just want to dance to the entire collection of Mac Dre and Andre Nickatina which just so happens to be one of my favorite rappers. Security has stepped up their game over the years so that's good to hear but you can tell Skylark is going through a bit of gentrification as all the Mission is going through. Skylark after it closes is always interesting because there is always a fight or something going down but the hot dog cart is there too so I'll take the risk for the bacon wrapped hot dogs. It's a gamble to drive here since you may spend some time finding parking but I usually don't have a problem with it. \n\nOverall, come at your own risk.", "author": "Javier G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "I've been here a few times, and I've never encountered any sketchy people or felt uncomfortable. Though, there are some undesirables that stumble in closer to the end of the night. I've never seen any drama. I don't normally come here on weekend though, just weeknights. It's more chill and has less people usually. They usually have a decent DJ that plays good music. Good place to just kick it with friends and dance. If you don't like dancing, you can also sit at a table and chat it up with friends. Good for large groups and super laid back. Drinks are not badly priced, and some of the bartenders are heavy handers. They are not shy with the liquor at all.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-14", "description": "Ghetto- FABULOUS. \n\nThis is one of my favorite places to hit up when I am in the Mission. Yes - the crowd can be a bit intense sometimes - people ready to fight outside, bouncers yelling at people, a mob outside, but just be smart and go with a group of people (A group of 3 little girls here would be a bad idea!). Once you get through the initial culture shock of the outside, you'll hit up fast working bartenders; a row of cozy little tables with candles and a dance floor in the back. The DJ's spin a variety of hip hop (mostly) and top 40. The crowd there just loves to groove and boogie and it always puts me in the mood to whip my hair bath and forth. The DJ's are really nice - if you type in your song request on your phone and show the DJ they'll usually play it (a dance part isn't complete without BRITNEY) or if you ask for a BDAY shout out -- they'll do it for you without giving you a hard time!  \n\nThe escape plan out of this neighborhood isn't too bad, getting a cab has been pretty easy around here. Also - you'll always find a hot dog cart outside or just walk down the street to Arinell's.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-25", "description": "Oh my goodness, I loved the music here! I came here on a Tuesday (random, I know), but it was still so much fun. There were surprisingly a lot of people here for a weeknight, but not to the point that it was super crowded or overwhelming. The people that were here all seemed like regulars and casually seemed like they knew at least one person working there. The bartender was friendly enough, but she got pretty busy and forgot our order at one point. She made it up to us with a super strong drink that she said was on her and I thought that was really nice. Overall, I had a lot of fun here and I'd come back!", "author": "Steph U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "Came for Reggae Mondays. The people are friendly, the drinks cheap, the music good. \n\nWhat more can you ask for?", "author": "Jane N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "Great location. The dj was playing awesome music. Unfortunately, the lady bartender was not friendly or welcoming. She refused our card payment, even though she just accepted it 10 minutes prior. We had to wait about 3 minutes for her to finish texting until she acknowledged us. Hopefully it was just a bad night for her. Other than that, the atmosphere was pleasant.", "author": "Yasmin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-01", "description": "Bouncers are whatevs, I'm a small Asian girl so no one really messes with me =) I've never been here when there was a cover, but I have seen this place get pretty packed! They have decent music, cheap alcohol and a diverse crowd of people. The last time I was here it was kind of muggy and nasty inside... other than that I have no complaints, pretty average bar.", "author": "Elaine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-20", "description": "-Good music\n-Good drinks\n-Cool bartenders\n-Reasonably priced\n\nNow can you say no, to a place like this?  Came here on a Saturday night and I couldn't have had more fun!  I can't wait until the next time we visit this place again.", "author": "Eddie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-17", "description": "Great music\nGood drinks, standard price\nNo cover -  woohoo!\nA bit small, can get a bit too crowded at times.\nConvenient location to enable bar hopping", "author": "Kinjal S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-05", "description": "My boyfriend and I popped in earlier today, at about 5:30 pm.\n\nThere was an obese guy in a black t-shirt and jeans, with a cap worn backwards, with a dog. Fair enough.\n\nThe issue:  The dog was on the bar, eating dog biscuits, slobbering all over what should be a SANITARY place.\n\nGross.\n\nThe bartender had no issue with the dog on the bar and, in fact, the same bartender who was petting the dog, made cocktails with his hands, squeezing lime. This is ripe for all sorts of germs to spread.\n\nGross.\n\nI don't want to have cocktails while a dog is sitting on a barstool, playing on TOP of the countertop, while an obese, greasy guy is immune to the health hazards this poses.\n\nI'll be contacting the SF Dept of Public Health.", "author": "Sara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "My favorite bar in town.  Its a gritty mix of 16th Street BART overflow and hip young revelers. The drinks are cheap, the bartenders are adorable, the DJs are awesome and dancing is mandatory.\n\nMake sure to keep an eye on your belongings, but that goes without saying in any dark street level bar.\n\nBONUS! There's a free burlesque show at 8pm every second Friday of the month.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "Good people, Good Vibes, Great Music!\n\nStepped in on a Monday, & it was REGGAE NIGHT which was super dope since I'm a huge fan of reggae. Place was packed with an awesome crowd.\nOnly downfall was the drinks were a bit pricey. \n\nAll in all, great place to go for some island music!\nCHEEE HEEE!", "author": "Chantel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-25", "description": "This bar is a money making machine for pit-pockets. I had my wallet and phone stolen here and immediately alerted security. He was not concerned at all, rude and unhelpful. He suddenly found my wallet 20 minutes after it disappeared. Of course, everything of importance was gone. I personally think it was an inside job. I told the security officer who I thought maybe had possibly taken it and he told  me that he knew who I was talking about but when the police arrived, suddenly his mind went blank. The police warned me to stay away from this bar as this is a constant problem. I also reported to the police that I felt that this was an inside job. I will never set foot in this place again.", "author": "Valerie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-02", "description": "My phone was STOLEN out of my purse while I was wearing it. Not an easy feat, these are professional thieves... beware!", "author": "Lauren W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-15", "description": "I've been to Skylark twice now. I'm really not much a fan of the city-considering how grimey it is, but I love Skylark.\n\nWalking up to the bar, you hear old school hip hop bumping out the door & there's an attractive bouncer checking IDs. Even my very straight guy friends think he's cute, haha. Anywho, walking into Skylark it's really dimly lit-just the way I like my bars. The more drinks you get in you & the darker it is-the better everyone looks. When you first walk in, to the left, there are a few booths to sit in. Next to those those is the bar, which normally contains about two bartenders & a bar back. In front of the bar-more seating! And then back in the back corner, there is a good sized dance floor with seating & tables around the wall. So there's definitely plenty of seating.\n\nEverytime I've been to this bar & went to order a drink, I've never had to wait more than 3 minutes. I LOVE that. There's nothing better than a bartender on top of their job. The girls are cute & quick! Which you wouldn't think would be too much to ask for, but in busy places like the city & Oakland, it generally is. The drinks are priced VERY fairly. The first time I went, I was drinking whiskey/7-ups & sweet baby Jesus were they strong. The second time, I was drinking chardonay, which the bartenders were making a point to fill my glass to the brim. They know how to get their money!\n\nThe only reason I didn't give this bar 5 stars is because the music was a bit slow for my taste on a Saturday evening. Don't get me wrong, they were playing tons of Tribe Called Quest, which is one of the ways to my heart. BUT on Saturdays-I just wanna shake my ass haha. \n\nOverall, I will be back to Skylark for my monthly visit in November! Good times, strong drinks, attractive people, good music, and FUN!\n\n:)", "author": "Tori F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-08", "description": "Been coming here since my 21st birthday... Always a fun time at the lark! Security is sweet to me, bartender ladies are always cool, ruby skylark is my drink of choice. Monday nights you can smell the kush in the air for Reggae night, always a good time! The crowd is always mixed. So much fun!", "author": "Jen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Love love loved it here. GOOD hip hop music without it being too crowded or ... I'll say it... Not ghetto! Not a single complaint. Except maybe the mirror in the girls bathroom is covered In stickers and graffiti but that's petty! I'll definitely be back!", "author": "Nikki K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "\"What if we go there and we can't fade up...hang on I'll call them\"\n\n*Ring Ring* \n\nChong looks at me hangs up and chuckles while saying \"wtf! WTF! was I really gonna call them and ask them if it's cool to fade up on Monday?\"\n\nThe idea of going to Skylark arose while contemplating how to make our Monday night more memorable. The final brigade and it was between watching Friends with Benefits or smoking and drinking in the mission.\n\nSMOKING AND DRINKING! SMOKING AND DRINKING! \n\nParking was found all too quick, but don't let this miracle story fool you because a Monday night in the hipster district doesn't usually entail a filled street, maybe just filled bike racks...several filled bike racks...\n\nBut what's this? It got even better. 2 attractive guys (we later found out they were the masterminds behind the music ingenuity we heard all night)  welcomed us and said \"NO COVER TONIGHT\" What? Really?\n\nI got a Corona and an orange juice for 7 bucks plus tip, which is the usual price I pay for a Corona elsewhere, on top of a ridiculous $20.00 cover charge. \n\nTheir beats slap, Chong and I loved every song that played and we meshed with the interesting crowd. The air was hot and sticky and everyone had passion in their eyes (partners immersing as one to the reggae on the dance floor) friends having a good time, and people either by themselves or away from their friends sitting down just mellowing out. I loved the vibe and the ambience, very unyielding and accepting. I forgot what it was like to just get lost in music, something i haven't done since I was young enough to go to the Warped Tour. \n\nDid I mention the best part! Rolling up and fading up in the corner and no one giving you a hard time or trynna hit that! God bless this place.", "author": "Olivia Vanessa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "I'm not quite sure what this place was before or what it's like on a non-Burning Man Friday night, but I am a fan of the Skylark. It's pretty big inside, has lots of seating, big front windows so there's lots of natural light during the day, and there's a DJ at night that has yet to disappoint or bore me.\n\nHappy hour runs from 5pm to 9pm daily and features $4 draft beers (of which there is a decent selection) and wine, and $5 specialty cocktails. Live burlesque during happy hour on the second Friday of the month. \n\nThere are other specials posted around the bar that are available all night and you can order and pay for tandoori and other Indian appetizers and sweets at the bar from the nearby Alhamra Indian.", "author": "Kristina A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-01", "description": "Another fun little bar in a long string of fun little bars that I experienced during my San Francisco trip. This time, we decided to hit up the Mission District. By the time midnight hit, the place had a pretty good crowd, both on the dance floor and in the bar area. The DJ was playing a pretty good mix of music, including some hip hop that brought me back to my high school years.\n\nUnfortunately, I don't have much more to say about the place. It's a bar. They serve drinks (which are actually decently priced, but of course, I'm comparing to overpriced Vegas).", "author": "Paolo D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-08", "description": "Came here twice... the day before Thanksgiving & this past Saturday. Cheap drinks & good music. It just sucks that people take up the dance floor by standing around. The crowd is pretty diverse, an even mix of races. There's one bathroom & a line tends to build up. I read a lot of reviews that this place is \"ghetto\". It's 16th & Mission, what do you expect? The security here are on-point. I witnessed some shit I don't think I'll forget that night. Overall, this place is a cool little spot to go to if you don't mind all the commotion going on.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "The one bar that has a sign that says beware of pick pocketers lol. There is always a fight.a guy was killed there a few weeks ago. If your into the whole trap vibe and hood theme your in the right spot. All your going to find there are a few good girls that didn't know what they got them self into and alot of prostitution", "author": "Alonzo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-02", "description": "I came here on the night of my birthday this past Wednesday. It was a cool experience.\n\nOne thing that sticks out to me was that the people at the door seemed pretty damn unprofessional with charging cover. When my two friends and I got to the entrance, I got that vibe that they just started to just $5 cover when we got there. Maybe it was $5 all night, but I still got a vibe that we got owned and they just wanted to spite us. This notion was reinforced when I paid some girl, and she gave me change from her personal wallet, wtf? Yeah, so this was kinda whack. But whatever, I was already pretty drunk, we were there, and $5 isn't too steep.\n\nThe place is small and cozy, music is decent, and there was some eye candy. Average.", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "Love this place! Friendly atmosphere, good drinks, and no cover! My friends and I love to come here to relax after a long week. I would've gave this place 5 stars if it wasn't so darn small! The back is where the dance floor is at but it gets really crowded, I think I can handle about five minutes of dancing then I have to come up for air!\n\nParking is a BITCH, so try carpooling with a designated driver or take BART! its only down the street! Overall a great place to have fun with friends or FIRE IT UP while making new ones! ;-)", "author": "Miriam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-03", "description": "DON'T JUDGE A BOOK BY IT'S COVER! \n\nThat saying applies to this bar. \n\nOk, so at first I did NOT want to go in. It didn't seem it'd be my scene because I'm so use to bars that play non stop electro/techno/indie funk shit. And the bouncers outside were smoking blunts and seem so thugly that it was intimidating. \n\nI went here on a Friday night and I ended up having a great time. It plays old school rap, terrible hip hop songs that you use to love in high school, reggae, and some recent popular songs. The DJ was pretty unique with the real turntables, no laptops. \n\nThe crowd was super mixed, dancefloor gets crowded, you gotta squeeze yourself in there. I was able to get my freak on without weirdos creeping on me. Bartenders are super nice and the people are friendly.", "author": "Danneth C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "No mistakes, this is a grimy locals joint, but it's cheap and the DJ never does me wrong.\n\nSurprisingly mixed crowd on Fri/Sat as well. I guess no matter who you are or where you came from, everyone can appreciate a little Black Rob circa 2000 spinning on the 1s and 2s.\n\nCrowd is a lot friendlier than first impressions would have you believe as well. I once bulldozed straight into a guy who looked like Troy Polamalu's 6'5\" 350 lbs. cousin, causing him to spill beer all over himself, and he just gave me a gentle pat on the head and offered to buy me a drink for getting in my way.\n\nBeers instead of beatings. I'll take that any night of the week.", "author": "Leo K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "Pros-\n\n- AMAZING HIP HOP!!\n- Cool diverse crowd!!!\n- No cover\n- Cheap wine\n- Cool red ambiance....\n- Really nice bar tenders!!!  Nice staff in general!\n- Contrary to what everyone else was saying, It was not ghetto and      parking was just as bad as it is all over the city... stop whining people!!!)\n\nCons- \n\n- Small !!!!!!!!!", "author": "Beth M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-17", "description": "When I go out to the Mission, I expect the following: \n\n1. Drunk people, especially drunk white people (Thanks Manda!) http://static.px.yelp.com/bphoto/8IWmfmTLWsGMvN-NCWXJbA/l\n2. Drunk people who can't dance (Thanks Manda!) http://static.px.yelp.com/bphoto/-EvZdQpc4yKNkJcrOnDOmg/l \n3. Drunk people throwing up curbside http://static.px.yelp.com/bphoto/awI3RxjNwcHW6cBjr0KgzQ/l\n\nI'm not racist. I love white people. Just ask my PIC J$. \n\nI found all of this at Skylark. I also found cool DJ's http://static.px.yelp.com/bphoto/3U9eCz8-5xCiVO-nxHGu1A/l , lots of space (tall ceilings are a plus), very awesome bartenders who invited me behind the bar to compare tattoos, and a friendly bouncer who didn't threaten to kick my ass. Aside from that, Skylark's distinction among the Mission seems to be the patrons: I lump them into a category called \"I don't live in SF\" crowd. \n\nThere's nothing wrong with this group of people. I used to be one of them, so kiss my leet yellow ass. They're just usually the ones who end up getting mugged walking down the wrong street at 2AM while looking for their cars.\n\nThere's nothing wrong with nothing being wrong. There's just nothing special. Skylark serves its purpose as a start point, rest stop, or ending destination during your Mission crawl.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "I've been here a few times and decided to go one more time before I wrote a review. Ya it still gets 3 stars from me. \n\n-2 for not have any hefeweizen's .. at all.. seriously?! It really needed a minus 2 for that. \n\nWith that said, I like this place. Good crowd of people, good music. We managed to get a table with a group of us. It's a good place to stop and get a drink but I don't think I would spend all night here. Anyone who calls this place ghetto... what do you expect.. you are in the mission after all. :)", "author": "Danielle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-16", "description": "Ew, this place is so gross.\n\nGrindhouse was playing on the large screen above the bar.  Really, could you try any harder, Skylark? \n\nMy friend took some skeezeball up on his offer to  dance, not the wisest idea from the start.  And I had to shake his warm, sweaty hand (twice!), then deal with the leering eyes of his cohort.  Where's the antibacterial when you really need it?  \n\nDrinks were not that cheap, not that good, and there was a minimum $20 charge for a credit card tab.  We paid cash and got the hell out of there, quick.\n\nThe crowd is just weird.  And gross.  I can't stress that enough.", "author": "Joanne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-10", "description": "Went there on a friday evening. They had a free burlesque show, which was \"interesting\".  Drinks were not good. Not cold enough beers, not enough strong or tasty cocktails. There were not too many people and most of them were able to find seats, so that was nice.", "author": "Rohit J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "Was here at 8 and they had inly one bartender so it took a while to get drinks, it was chill though and got a few word in with the bouncer. Came back later at 11 and bouncer hooked it up and let it us all in line skip and all. It was hella crowded though but we were still able to find a table. Had a fun time.", "author": "Dang L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "I've been to Skylark during the weekend, but I have never been here on a Wednesday.  Apparently, I've been missing out!\n\n$5 cover, drink specials, good jams, and a mixed crowd, what more can you really ask for?  \n\nWhile I am totally hating work right now on this Thursday morning, I cannot help but reflect on how much fun I had last night and giggle.\n\nOnly downside: One bathroom per gender.", "author": "Christine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-30", "description": "Good energy and good people. Have been on both a Friday and Saturday nights. Cover is cheap, only $3. If you get there early enough you don't pay anything. The DJ was really good, mostly hip hop. Security guards are cool for the most part. The only bad thing is that one of the times I was there there was a shooting right outside so we all had to get on the floor. I literally cut one of my knees because I was wearing a skirt and there was glass on the floor. I also wish it was a bit more spacious.", "author": "Marlo M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-12", "description": "Great drinks reasonably priced. It was just too hot and smelled \"fishy\" and like a high school dance! The DJ was awesome though! Had the dance floor not stunk, I would've given this place 4 stars!", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-07", "description": "I love this place!!! Nice ambiance, great bartender and lite on the pocket book. \nThe DJ was well-versed and took requests and played a song for my b-day! Jasmine is the best, she remembered where I was from and that it was my b-day and got me a couple drinks celebrating my commencement! She makes the BEST margaritas ever!!! Definitely heading back when I'm SF.", "author": "Tony S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-29", "description": "Yikes! This place is kind of a disaster. My girlfriends and I went barhopping one night on Mission, and this place was our second stop. We literally stayed there for 10 mins and then bounced. It's dark, and the crowd was super pushy. Plus, it smelled disgusting in here! It was like a mix of weed and garbage cans (barf). Before we went in, the bouncers told us to keep watch of our phones and to not put them in our back pockets (umm sketchy much?!)\nTwo stars only go to their music because it was poppin during the 10 mins I stayed!", "author": "Marilyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-12", "description": "Small place and a lil dark however I enjoyed every minute of it, to the Barrista show, to the drinks and even the pupusas being cooked outside , I had a great time and wouldnt mind going here again. Possibly on a Saturday night :)", "author": "Alyce S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-23", "description": "I'm glad I love all sorts of music. Sometimes when I'm not in the mood for some Judas Priest or loungey Brazilian bossa nova, I love listening to hip hop. Back then I used to go to shows in the late 90s/early 00s to check out DJs spinning dope ass beats in the background while b-boys battle each other on the dance floor. \n\nWent here last night because my cousin and my other friend were spinning at The Deuce (event that takes place every last Sunday here) and since I'm going to be leaving this beautiful city in a couple days, I had to come out and play and see them one last time!\n\nIt was pretty chill and laid back and the music (hip hop, including yay area classics, funk and soul) was poppin' (just like my lipgloss!) and the drink special of the night were peach bellinis which I happily sipped the whole night. I didn't get up to dance (food coma---they had birthday cake for some of the DJs and sandwiches) but I had a good time talking to folks and enjoying the music. I'm really going to miss this city and I hope Portland has some bars like this up there!", "author": "kristin e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-31", "description": "My sorority sisters wanted to go out on a Monday night. Usually I'd say no, but decided that I was up for it because I hadn't hung out with them in a long time. What's good on a Monday? No clue. But we decided to go with the Mission.\n\nMonday night at Skylark = Reggae night. Not my cup of tea, but I'm open for a good night regardless. When we got there, there were a bunch of people outside, so it seemed like a good choice to come here. NO COVER..which is always nice, haha. We walked in & the room smelled like straight-up S M O K E. It was NOT okay. It probably didn't bother a lot of people, but I'm not a fan. It was super crowded though. Music was going..but I guess Reggae isn't my style. Some people had 1 drink here & we left for somewhere else.  \n\nI've been to Skylark before on a different night of the week. It was cool. Nothing too special about it though. \n\nI don't go to the Mission much. No plans on coming back for Reggae night...but maybe on a different night. \n\nThere's only street parking.", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-18", "description": "I liked this place. We went there Friday, 6/17/11 at around 12a. The night I went, there were a lot of black people (YUM!), a few white people and then some other mixes. I'm not being racist. I'm just telling you the races who were there on this particular night.\nMy friends got bothered by some guys, but I didn't. Awesome, bassy, dirty, gritty, rap/hip hop music. Just my style. No cover fee. Super cute bouncer. SUPER CUTE BOUNCER. People were lighting up inside; grinding etc. Got super crowded around 1am.", "author": "Fi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-29", "description": "This place SUCKS. Trust me, save your cover money and go somewhere better. The bartender that \"helped\" us was really rude. I approached the bar, the bartender acknowledged me, and some super ignorant dude and his girlfriend pushed by me (there was literally 1 foot between me and the bar) and she served them right away instead. I asked for Avion (pronounced \"Ah-vee-own\") tequila and soda and she said \"What?\" and I said AVION, I turn to my boyfriend to confirm that I'm saying it right, and she whisks away to help someone else. She comes back a few minutes later and I say the same thing- point to it- and she tries to correct me by pronouncing it wrong (AY-vee-own, *eyeroll) and said \"I didn't have a clue what you were talking about so I just had to come back to you...\" Really? RUDE. I then asked for a Bulliet and diet coke... she gives me a bulliet and sprite. At this point I'm like how does she have a job here? To top it off these weak drinks were $8... We left within 5 minutes.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "My friends really wanted to take me here because they said they played good music and had cheap drinks.  I have to say if thats what you are looking for, Skylark is the place to be.  They had 3 dollar well drinks, and can I just say my cranberry/vodka was clear...they are VERY generous there.  Very much worth the $3.00.  We went on a Thursday night and it was hip-hop music and a really good female DJ.  The music was awesome, and the dance floor was small but still danceable....\n\nAs the night went on, the dance floor grew more and more crowded, and people kept smoking weed on the dance floor, which I guess if you want to get a contact high is good for you, but I personally don't like second hand smoke going into my lungs when I'm trying to get down, so that bothered me...All in all though it was a really fun place with awesome music and VERY affordable drinks.  Good spot...def would go back!", "author": "Gaby G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-07", "description": "I would have be REALLY drunk (like fall-on-my-face drunk) to enjoy this place at all. I've accepted the fact that just about every bar/club has its share of ghetto d-bags. BUT, this place is flooded with them...as in every second, there's a dude trying to hump someone from behind... at the bar, at a table, on the dance floor, at the bathroom...seriously, CALM DOWN. Even with my boyfriend there, they would aggressively stare and try to talk to me. \n\nThe music ranged from decent to \"my ears are bleeding.\"", "author": "Gloria B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-02", "description": "Things I liked about Skylark:\n\n*The bartender was super friendly immediately upon arriving\n*My Stella tasted particularly refreshing and sweet (?)\n*The Dj was playing good hip hop like Gang Starr\n*Friendly people approached us and bought us 2 more beers, which then turned into fun conversation w/ potential new friends\n*The appealing eye candy sitting at the bar\n*It's location in the Mission\n*It's a good place to pop into if you're waiting for the 22 bus \n*The round tables in the front, providing better conversation for groups\n*The Trivia question napkins\n\nYup it has some cool features...so basically A-OK sums it up.", "author": "Sonya D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-24", "description": "This review is only for Mixtape Wednesday, and maybe sometimes on Monday. \n\nMixtape Wednesday is a good event with some even cooler people. The drinks can be a bit pricey but they make them pretty well. The music is good, and so are the friendly staff. \n\nCheck it out if you get a chance, you won't be disappointed. Or will you?", "author": "Louis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "According to Rebecca Solnit, author of \"Infinite City,\" the Mission District of San Francisco is at the city's phrenological crossroads between \"Love of Sex\" (SoMa) and \"Desire for Liquids\". 16th Street is specifically designated \"Desire for Liquids\", and after a trip to Skylark the reasons are obvious. \n\nVery strong, reasonably priced drinks. Great music (it was old-school hip-hop night). Conveniently located on the 16th Street corridor just a block from the BART. The scene here is a mix of the young professional crowd, hipsters, and locals from the Mission.\n\nThe place was surprisingly neither jam-packed nor deserted, at 10pm on a Friday, so it was a great launching pad for the rest of our night.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-05", "description": "This spot definitely gets crackin on the weekends. They got a boss looking bouncer outside making sure underage kids don't get in. When you walk in you know this is a hood rich party with sweet dank aromas flowing through the air and the beats hitting strong. In the back, you can see people getting down and sloppy drunk on the dance floor. \n\nBest and worst thing about this place is the men's room. Once you open the door and step in, this wave of rank piss hits you right in the face, so bittersweet in a weird way. The room itself looks like a mini dungeon from a saw movie. But the best thing is the community urinal, it's an honor to see one of these relics from the past still in action. It's an old school tub looking thing that can accommodate 2.5 people at the same time.\n\nAbout the drinks, mediocre. \n\nIf you're looking for a hood party in the city, this place is the place to be.", "author": "Patrick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Fun place for some drinks after work. They're not strict with their dress code and music was on point- 90's hip hop to current . Pretty crowded but still had enough room to dance around. Only frustration were the drunks bumping into me and spilling my drink! \n\nOne of the bartenders was too slow but friendly. Drinks were good. Can't go wrong with tequila on rocks :)", "author": "Y R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "Last night the Skylark saved my life... cause you gotta get down girl. \n\nOk, so it wasn't actually last night but Sunday but who the fck is counting anyways? \n\nSunday was a fun day at Delores with a cute boy who was moving way too fast.  Mucho rapido para mi.  We had left the park and he was talking about going somewhere where we could be alone.   Then it hit me!!!  We're right by my favorite ass shaking location.  Score one Skylark, zero for Don Juan.  \n\nGot there around 9:30pm.  For all you serious shakers I recommend coming early as the dance floor is free and the music is bumpin.  The (cuter then the guy I was with) bartender made me a perfect vodka cran and that's when it began.  \n\nDancin' dancin' dancin!!!!!\n\nBeen coming here off an on for about a decade anytime I've really just needed to move my feet and always been pleased.  Never had anything stolen, seen any fights, smelt anything funky, or what ever else people are bitching about.  Always a good time.  No regrets.... except that I didn't even get the bartenders name.  Goodness gracious.... way too cute or maybe it was the heavy pour.  Nope, he was a little dope.  \n\nOh, also right near the 16th Street Bart which is kinda awesome if you want to shake it for a bit before you head home.   Sucks that Bart closes at Midnight though as I was tempted to order just one more.  \n\nI've mos def been there later.  I've been there until the lights came on numerous nights, but I stand by my favorite time to be there is before the dance floor gets packed and your ass gets grabbed (1:55am).  Realistically though, you can't shake what your Mama gave ya and not expect a little bad behavior.  \n\nSkylark, I don't care what people say.... I fckn love you and your dirty beats.", "author": "Misty M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-10", "description": "I came up to visit SF with a few of my girls for my best friends birthday. I didn't think we'd find anything crackin on a Wednesday night but I was wrong. It wasn't crazzzyyyy, but I had fun! Skylark has a good feel to it, I loved the music, and mostly loved the crowd. I don't know if it's Skylark or it's just Frisco-heads in general, but it was nice to be offered a few \"you don't look like you're from around here, welcome\" dranks as soon as I walked in from chill, NONcreepy boys. That doesn't happen too often in SoCal :)", "author": "Elysse P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-29", "description": "I went with friends to go for drinks and hit the dance floor. The drinks were affordable and music was pretty good. The place wasn't totally packed but had enough people to have a good time with. Its close to public transportation too.", "author": "Rigel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-11", "description": "Skylurk! Can be awesome, can be creepy, can be smelly can be fun...it is what it is! It's a cool spot on 16th if you want to chill with friends, dance, listen to hip-hip or just hang out; kind of an all-in-one bar. Always a lot of people here Friday & Saturday nights so it's def. one of the places to be on the street. \n\nThey have 3-4 of their own specialty drinks and a combo of corona + shot of patron called the juan on juan for $11...Not sure that's much of a deal though since a shot of patron and a shot of patron would probably come out to $12 or so, but whatever, I get it anyways. \n\nPros:\n- No Cover charge\n- Hip-hop music + amazing DJ\n- Good drinks/not slow behind the bar\n- dance floor + tables across the bar.\n- No dress code (it's a bar!)\n- They take card (forgot the minimum though if there is one)\n\nCons:\n- It's small (but kind of makes it cozy and cramped)\n- No baseball caps.\n\nAn awesome thing about Skylark (indirectly) is that it's on 16th street so there's plenty of bars to check out and a ton of food on the street. Add this to your 16th street bar hopping list!", "author": "Arnold N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "i love skylark!!! Best music and nice sized open dance floor. I prefer weekdays cuz weekends get very crowded. Old school hip hop is my fave n this place is slappin.", "author": "Julia .."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-12", "description": "Can you say creepers?  I have been here a few times because my friend is in love with the place, and each time I've felt uncomfortable.  There are dudes who just sit and stare at the dancing girls...I mean I guess this happens at all clubs/bars but since this place is so small, I notice it more. Anyway, I've just never been impressed by this place.  Like i said, my friend hearts it so I'm obligated to go.  She loves the attention she gets from the creepers, so ya... Anyway, this is not my first choice, although I did notice the new sign and it does draw more attention than the old one did.", "author": "Steph L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Went on reggae night. Pretty casual atmosphere and the drinks were big and cheap, my vodka cran was strong and fairly priced for 5$. It was crackin for a Monday night! I would definitely hit it up on a weekend night.", "author": "Julie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-29", "description": "Great drinks, great music... just a great place to hang out with friends. Whether you wanna dance or just have a few drinks this place is it for me.", "author": "Adree A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-29", "description": "This place has gotten pretty sketchy on the weekends. I still love the music ( old school hip hop) and the fact that they don't charge a cover. \nWe were literally in the middle of two fist fights on Friday night. They started at the women's bathroom and rolled out onto the dance floor. Felt like I was on an episode of Jersey Shores. Not a good look...", "author": "Ravi K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-19", "description": "Promise: I had made a statement to my friend to be nicer to people at bars/clubs, well...look where it got me?\n\nScene: Crowded dance floor. Girl (I thought was drunk) fell on me, so I turned around to ask if she was okay. Her and her jerk friends laughed and then mocked me with \"are you okay?\" Wow, when did asking if someone was okay become something to be mocked for - well, eff you very much, next time you fall, I hope you hit the dance floor, literally because this bitch will not be there to catch you. Just sayin.\n\nI went from never coming here to being here three times in the past two weeks with different sets of friends. I guess this is THE spot. I've had fun each time I have gone because of great company, but there were a few bumps in the road here and there with the aforementioned event being the most upsetting.  \n\nThere are definitely good times to be had at this place, but beware of creepers and lurkers while you dance and people who may fall on you and then be mean to you. \n\nRuby skylark is the drink I'd recommend. :)\n\n$20 credit card limit when busy and no limit when it's not. See how much I've learned!", "author": "Dolores L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Great experience last night during the fundraiser for the flood victims of the Philippines.  Of course, it was attributed to the small yet sizable crowd, no creepers, dance worthy music and a non-gross women's restroom for once.  Everyone who worked there was chill and friendly.   This probably isn't the experience you'd get on the weekends.... Home turf tuesdays plays a mix of r n b, hip hop and reggae.  Thank God for that, cause I'm so sick of that trance electro sh**. \nDrinks were strong (enough).  My favorite that night was called a Grapefruit Skylark?  Tasted exactly like the fruit, and hid the taste of alcohol pretty well.", "author": "Sierra D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "Yelp Rating says 5-stars equals \"Woohoo! As good as it gets!\"\n\nIt can definitely get better.  But I will say that if you have your expectations low and are ready for some shenanigans, this is the place to be.  Just come in with a comedic attitude and you'll be fine\n\nEver watch a movie so terrible that its actually good? Or hear a song that is so awful that it becomes a hit? Like being Rick Rolled?  Well this little gem is so bad that its good.   Come here with your friends and you'll leave with great stories to tell.  The only caveat is that great stories are seldom from good experiences.  \n\nIn all seriousness, the music is pretty damn good at the Skylark.  You'll hear some of the best 90's rap and hip hop.", "author": "Tuan M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-30", "description": "The postive:\n-Smoking weed is pretty much legal here in the back\n-The drinks are cheap to average in price\n-There is no cover to get in\n\nThe lame:\n-It's usually slightly empty\n-The floors and walls look \"sticky\"\n-The bathroom line is longer than the line to get in\n-The guys there look lame, and the girls are usually fat. (just being honest no time to get pissy)", "author": "Melzie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "Always a rad place to check out. Not the fanciest place in San Francisco, and not in the best neighborhood but if you like an old fashioned dive bar with awesome bartenders then this is your Bar. It's pretty close to Dolores park so we always make it a point to stop here. They have live DJ's and their drink specials are awesome. Every time I come here I end up spending 6 hours there with out even realizing it.", "author": "Kayla D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "I absloutley love this bar, I come here often and the bartenders are so warm and welcoming. The musics awesome and I always have a great time there! The bartender always has a new creation for me to try and that is hard to find my friend ,I will admit the crowd gets a little wild\"rachet\" but I mean if you don't bother them they won't bother you. Love this place", "author": "Anissa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Lots of mixed reviews but I had a blast here. Came here after having dinner at The Summit and got my dance and drink on with my cousin and our friends. Before we knew it, our buddy Mel decides to get on the turntables and plays many old school songs and happily dedicates Ready for The World's \"Oh Sheila\" to his girlfriend Sheyla. \n\nImagine drunken dancing and romancing with grinding and double shots in hand. Dance dance, da da dance. \n\nWicked hangovers for everyone except yours truly as I was DD, but it was a damned good night. Need a replay! Who's in?", "author": "Tisha G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-13", "description": "Sad to say we went here on New Year's Eve and it was a huge disappointment.  They charged $5 before 10PM, which okay fine it's NYE, acceptable.  They kept telling us people would be rushing in any minute and it would go up to $15/head.  So we just went in.  \n\nPlace was dead empty and you could sit anywhere you'd like.  Bar was empty so we ordered some drinks.  Someone ordered a goose and tonic and the other person ordered a gin and tonic. Badly enough with no one in the whole bar, the sucky bartender made a super sorry drink with 90% tonic.  Really?!  That's why I just stuck with straight shots man.  In order to make those drinks taste like a normal goose and tonic, my friends had to order a shot of goose and a shot of gin, then separately and pour it into their goose/gin and tonic.  That's just all bad.  Killed the mood and the experience.  Could have just made some drinks at home.\n\nAs the night progressed, sluttier and sluttier, yet fatter and fatter chicks kept arriving.  They thought they were hot ish because they started dancing on each other where people were sitting near the bar.  NOT CUTE if you're larger than life.  Have some class.  It's not a hoe show.\n\nThe dance floor was packed.  After the clock struck twelve and everyone started trickling out a million people tried to exit as two of my friends tried to head to the dance floor o the right side of the road.  Everyone was stuck in a jam and this fattty mcfat fat (seriously huge) decided to yell at my friend, saying \"move your fat ass.\"  This coming from her to him when he is a stick.  Hilarious!  But anyway, this place is g-h-e-t-t-o with bad drinks, dirty bathrooms, low class folks, and horrible bartenders. Oh wait, I already said that.  Anyway...don't come here.  Go to the place around the corner.", "author": "Dee H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-30", "description": "I can see this place being a hit or miss just depending on the crowd that is present on the night you go.\n\nWe had some creepers, but they weren't bothersome.  Music was good (actually old school, not hip hop that is 2 years old), and that's enough to keep me around, despite a less-than ideal crowd.  We came here from double dutch, and I was much more happy with this scene.\n\nPretty pricey, which can be annoying, because I'm not sure why YOUR stoli-soda needs to be more than $7, EVER, but maybe your soda water has electrolytes in it... idk?", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-23", "description": "I'm not familiar with San Francisco, let alone the Mission area, and I expected it to be pricey. I was pleased to find that this was not entirely the case. Skylark has no cover, which is an immediate plus in my eyes. The locals claim this place has great music, particularly Hip-Hop. Sure enough, the dj's selections were one point.\n\nHowever, I had to take a few stars off. The drinks were not that cheap. Most of the mixed drinks I ordered were about 7-8 dollars. Since this is more of a dive bar spot, I would've preferred it to be a little less than that (or maybe I'm just super cheap). Also, there was a $20 credit card limit at the bar and I heard that the bathroom situation wasn't that great.\n\nOther than that, it seems to be a pretty chill place. Walk in, grab a vodka redbull, and nod your heads to the sounds of A Tribe Called Quest and Gang Starr.", "author": "Sash E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-12", "description": "To be fair, I'm going to list its pros before cons:\n- good dance music (hiphop and reggae)\n- Ghetto.\n- no cover\n- If you're a woman, chances are you'll be the tallest and thinnest one there. At least that's how I felt.  And I'm only 5'3\"...\n- they serve alcohol, if you can get to the bar.\n- they are near BART\n- um.... \n\nCONS:\n- Ghetto. This is both a pro and con, depending on who you are.\n- If you're a man, chances are you're the shortest and weakest one there. There are some BIG MEN at that joint, and they like to fight.\n- No room anywhere, at all, for anyone. Dance like a sardine, sandwiched between the short, fat women and the massive, punching men.\n\nSo now you've been warned. If you are a massive man looking for a fight, have at it.  If you are a woman of homely appearance, you can go be the Hot Thang.  If you are neither of those, keep close to the door so you can flee when the Samoans start throwing each other around.", "author": "Mari C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-12", "description": "Watch out- this place can be a bit sketchy.\n\nI went here on a Saturday night for a friends birthday. No cover, fun dancing, but my iphone was stolen. right out of my purse. Another one of my friend's also lost a phone, and another, a purse.  SO, beware: keep your belongings close.", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "Juan on Juan = shot of Patron and a Corona ... $11\n\nNO cover\n\nDope, laid back music (not that crappy club shit you hear everywhere else, sorry Jason DeRulo)\n\nMixed crowd filled with all kinds of random ass people.\n\nGood foods spots open late all around the area.\n\n...and sometimes they project cartoons on the wall !!!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "Let me keep this very simple: MONDAY NIGHTS REGGAE.\n\nCons:\nThe seedy neighborhood, the slightly cramped space, and the not so glam venue.\n\nPros:\nAAAMMAAAZIINGG DJ's. Its a laid back atmosphere, with an eclectic mix of friendly locals, the drinks are inexpensive, and the fun goes on till 2. Plus, there's tons of late night food joints nearby for those late night munchies. The dance floor is  separated from the general lounge area, and the best part,  there's no cover charge. Yeaup, all this awesomeness fo' free!!\n\n\nTake a cab to and from the place, and you have virtually no reason not to stop by. See you on the dance floor!", "author": "Gabriella C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-12", "description": "Pickpocketers!!!!! My girlfriend had her wallet stolen out of her purse. Look at the other reviews and you'll see that it's a regular occurrence. Don't go here!", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "This is the first bar that I stepped into with NO ALCOHOL smell! It smelled so sterile and clean, if you closed your eyes you wouldnt know that you were in a bar!\n\nWe were pulled into this bar due to its projected ambience from outside. A DJ was playing music (I cant tell what genre he was playing but all I can say was that it was good music!). Once inside, the ambience was even better....pretty and soothing deco.\n\nThe bartender was nice and friendly eventhough he insisted to see my ID as he thought I was underaged. Ruby Skylark was the drink I ordered. The bartender checked on us a few times to see if we liked our drinks and came back to for longer conversations as maybe he thought we were chattier and friendlier than other drunks, lol. \n\nWe left the place feeling good and happy! Thanks to the service and the A-A-A-A-A-ALCOHOL!", "author": "Elly G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-17", "description": "I was attacked by two huge girls (more like whales) thirty seconds from walking in. The bouncer named, DeDe, confiscated my friends pepper-spray before we walked in. I could have used that to defend myself, so maybe this bar should re-evaluate some of its rules. As soon as my two friends and I walked in, these two girls shove their way through to the front. I turn and say, \"Hey you don't need to shove\" and without warning the tall one (about 6'2\") turns around and launches towards me with a fist. So I duck and protect my face (I'm only 5'2\" and less than 100 lbs btw). I feel her hitting me a few times and as soon as she backs up I go to hit her, but her huge friend comes at me from the side and attscks me too. Shortly after, the fight is broken up by the crowd. I have minor injuries and the bouncers take my friends and I to the corner. Then, they kick us out... No report, no questions. What kind of establishment does that? I'm appalled by the bouncers and the ghetto ass girls that attend this place. For as big as those girls were, I could have been seriously injured. DO NOT GO TO THIS PLACE. You're safety is in jeopardy.", "author": "Aileen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-03", "description": "I'm not very impressed by Skylark. After a while, all the bars in the mission begin to look the same and this is no exception. It is the  first bar from the 16th Bart Station that I always end up at in between plans. I don't think I'm very much into it but the bartenders are nice?...Yeah.", "author": "Hannah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-11", "description": "I will say my glass is half full on this one.. Great music, mostly Hip Hop.. Tables in the front..dancing in the rear..if you can elbow your way through the crowd.. It felt like a closed tupperware in here after awhile..need. more. air..cough* Gasp*.. But aside from that, I had a fan-effing-tastic time popping my booty to da beats. The place was crowded and the crowd was hot, sweaty hot, but having a great time.", "author": "Sara F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "Good music, not too crowded, just my style. Other bars in the area get way too jam packed and too hot. This place can get crowded but not bad enough that I can't move around and dance. Bartender was really nice and you don't have to wait too long to get drinks. Groups usually just stop by for a bit before moving on to the super poppin' bars (extremely packed) so you don't have to wait long to get a seat or table along the side. The bouncers were funny and frisked my friend for his birthday. Hilarious.", "author": "Leslie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-24", "description": "A friend once described this place as \"the gift that keeps on giving.\"  That is correct if the gift you're searching for is a raunchy, outspoken, disastrous harlot of the night.  Can't lie, we (Amol R., Soonde and Jones)  used to spend way too many nights in \"the lark.\"  WAY TOO MANY!  I had to take a stand.\n\nMeat market defined.  The parties aren't bad, if you enjoy a packed dance 'club,' too often full of undesirables.  I would give less stars but from what I remember, the young ladies were always happy to dance.  Sometimes too much so.\n\nthe juan on juans (yes, multiple) and a little jager made for interesting -and luckily for the ages, cataloged (read: recorded)-stories.  \n\nI feel like I'm drunk right now just thinking about that place.  \n\nAlso, if you're gunna go, be drunk.", "author": "jan s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-19", "description": "I am a fan, indeed. I love me some mission dive bars, and when I want to start the night with some hard liquor before I switch to pints, my first stop is always skylark. \n\nWells are 3 dollars, the bartenders are helpful and generous and they have even let me sample stuff on occasion. All of the house drinks are pretty good but the RUBY SKYLARK is what gets the night off to a great start. Its a concoction of ruby red absolut ( a heavy heavy pour), grapefruit and pineapple juice. They taste delicious but look out because they can sneak up on you! They have a wide selection of booze ( ouzo shots and pear cider chaser anyone?) \n\nNo matter the DJ, the vibe continues to be chill. A wide mix of folk no matter the day. If 420, chill beats, dark interiors and sparkly gold cushions are not your thing, please don't ruin it for the rest of us. \n\nPlus one star for trivia napkins, minus one star for single stall ladies room (gross but its a dive bar people!). Plus one star for taking cc ( usually without a minimum during happy hour). Minus one star for shootings happening outside ( I want to hope its unrelated). Plus one star for always running into people from high school in their grown and sexy attire! \n\nGet there early to make hh prices and snag a table!", "author": "Ali R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-20", "description": "Wasn't really sure what to expect when we came on a Wednesday night. Much to my surprise there were quite a bit of people. When we got to the door I was a little shocked they were charging $5 a head for entry. We debated it among the 3 of us and decided to go in anyway since we drove all the way to the city and already committed. \n\nI won't lie, there were a bunch of dudes. I'd say a good 75% were guys. Again, already committed so we chug along. Fortunately the drink specials were reasonably priced and the music wasn't bad. We made the best of it and took advantage of the drink specials.", "author": "Jan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-21", "description": "Music was good. I was totally all over the dance floor...but I think I was the only one...\n\nGiven...it was early on a Wednesday night so that could have attributed to lack of people willing to dance.", "author": "Lidia Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-21", "description": "Went here twice..went on thursday, which the DJ was spinning nothing but 80's music..reminded of my nostalgic days growing up..went back on a monday nite and bonus...reggae nite! love this place immediately \n\nThe drinks were reasonable and strong..cool, local folks..none of that stuckup..im out of town vibe that usually get on the bigger and trendier bars..", "author": "Mark R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "It was cool in here, nice spot. Full bar, nice happy hour. Had a live Dj, spinnin Hip-Hop [very happy about that]. I was here for a good 3 hours. The drinks are standard prices. Top Shelf $10+. They seemingly have a more private area upstairs in the rear. Part of the interior design is this upper level. It's a good size place to dance and do your thing. But, definitely go on a good night is the key.", "author": "Erik R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "I hardly leave reviews as I choose not to persuade based on my experiences, but after a random (7/3/2012)  outing with two of my girlfriends they asked me to leave a review since I already had an account.\n\nThis is for the hardworking ladies who bounce multiple careers and hardly has the time to go out into the nightlife anymore, but when they get the phone call from their girlfriends urging you to go out since \"tomorrow's a holiday, no excuses\".  When you don't feel like getting all dressed up to just go into the city, but have to look presentable since your old pals from college come into town, you have to show them a good time, then you hit up the bars!\n\nYes we often get stares since we RUN in a diverse group (when we're the crowd that comes through Asian, Latina, and African American: holla).\n\nAs we drove into the City, we get the phone call that our other friends from out of town will no longer be joining us. What do we do? Turn back on the bridge or party like we're out of town... I picked the latter (Hey, since I already wasted $$$ of my makeup for the  night that you can't get back lol).\n\nTo our luck, we got to the City with no problem, found parking a block away and started walking to the bar when I remembered (oh snap, I forgot how the neighborhood looks and we're a little too overdressed). Everyone else in the bar were dressed casual and even though we thought we were under-dressed for the club, we were WAY too overdressed for the bar. FAIL!\n\nThe bouncer/security guard was cool. He even directed me to the restroom later that night when I didn't have my contacts on and was bummed when I couldn't find it. There was no line since it was a Tuesday night, but I guess they have something called Home Turf Tuesdays? here weekly so it was mainly hiphop and BAY music. HEYYY! Finally, none of that techno music you could never dance to in Vegas. lol\n\nIt wasn't that packed yet when we arrived at 10:30ish, but there was a good amount of people. We grabbed our drinks from the bar first from the guy bartender who was quick and attentive. Kudos!\n\nThen, we walked to find somewhere to sit (there's limited seating) because who wants to stand up and sip their liquor when you're a lady. We got lucky since there was a table spot right near the DJ set up was and we asked some patrons one table over if the table was free and she said she thought so, but the DJ was sitting there before (oops, sorry if we hogged your table DJ)!  We sat there for a majority of the night since I've never really been sober enough to check out the crowd. It was diverse and everyone was really into their own thing which was cool. Sure, we had a few people come up to us, but we just laughed it off, we weren't trying to have our noses stuck in the air like our **** didn't stank, but we were definitely not getting up to dance with them lol. So we just kept drinking and drinking...\n\nTip: The tables are a little slippery so if someone bumps into the table or if someone's heel kicks the table by accident (which happened), be ready for the aftermath. Glasses and liquor spilled all over the floor. We sat at the table not quite sure if we needed to start wiping the floor (OCD mentality) or go tell one of the bartenders. To our surprise, one of the many DJs that were spinning that night must have seen what happened so he came over and asked us what type of drinks we had, and I wasn't sure why he asked us that question. I was thinking he would've been more concerned with the glass on the floor. He disappeared for a few minutes and we weren't sure if he was going to report us for the mess or not, but HE appeared with drinks for us! And, the barback came a few minutes after him to help us clean up the mess. How nice!! I still felt totally bad even though I didn't cause the incident, so I leaned over and gave her a $20 tip to thank her. We couldn't find the DJ until later that night to thank him for the drinks also. Such a sweetheart. We never got his name though.\n\nWe were ready to bar hop down the street, but for some reason we enjoyed ourselves at Skylark that night enough to stay there for the entire night and then we left to grab food!\n\nA Great Night out with my close gfs  to toast to a Good Life.\n\nOther Quick Tips:\n*Don't expect too much from a chill bar. Cheap Drinks (They have specials), Open Small Dance Floor, and Music you can dance to.\n*If you don't want to be grabbed onto by creepers, then don't make yourself available to do so. We handled it pretty well.\n*We liked how they had multiple DJs spinning all night (especially female DJs) woot woot!\n*Nice DJs and attentive staff\n* More packed and no breathing room on Fri and Sat", "author": "C T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-07", "description": "Bad experience at the skylark involving a bouncer...\n\nTalked to a few other people who have had similar experiences with the staff here. Seems like the management of the skylark hire thugs, not people with any kind of professionalism, and this makes for a dangerous environment, not a place to let loose and enjoy oneself. \n\nIf you choose to go, just be careful.", "author": "Alan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-07", "description": "Really?  What is so great about this place?  *Yawn*\n\nThis is the kind of bar to visit only if you happen to be stumbling around the area and can't physically walk any further.", "author": "Cianne M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "You might get shot, but it's totally worth is for the sweet hip-hop dancy dance that goes down there -- wear your sluttiest outfits b/c lord does it get steamy.", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "This would be the definition of San Francisco.  This place has talented DJs jamming nonstop different days of the week.  Diverse crowd.  The drinks are strong and not too expensive.  This is definitely a place to go to, if you want to get your groove on. Reggae/Dancehall is on Monday Nights and it is 4/20 friendly on that day. Why yes, you read right! 4/20 friendly inside! Awesome environment and you feed off people's positive energy. Awesome! \n\nOne night, my friend and I, pre-gamed before bar hopping and just went inside here, and danced the night away, without having to buy any drinks. Pure dopeness! :)", "author": "Antonina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "Hidden, mad reggae on Monday nights.  Don't come if you want to avoid second-hand smoke! :)", "author": "manish v."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-30", "description": "this whack ass club.... do not go here... my phone was stolen and security didn't help, bartender didn't help, bouncer didn't help.  this place is hella ghetto!!!!!!!!!!  if you don't have an entourage than do not enter this place.  these people are hella sketchy!!!!   when my phone was stolen the security was trying to escort me out of the club when i reported it.  then i went to the bartender and she was trying to give me the owners name but she only gave me the first name and last name initial.  which tells me they all know whats going on there.  then i left and was trying to ask the bouncer who the owner is so i can talk to the owner about the issue he wouldn't tell me.. luckily i have a witness and cops were rolling by 16th street and i flagged them down.  made a police report and will never return here again... they do not know who they messed with ... be careful when you go here.. do not bring any valuable items because if you do they will not help you if someone takes them... \n\napparently thats been a problem from what the bartender told me .. and the cop that took the police report..\n\ni would not even put one star bu only to post this....", "author": "Merrell D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "This place was pretty busy even on a weeknight, which is usually a good sign. I support the whole marijuana legalization ordeal but when I was there, it seemed that many of the patrons were getting lit which is okay but I don't particularly appreciate smelling like pot when I didn't even smoke any! It might have just been the night - it was kind of a themed night so maybe it's not always like that (wow, i'm at work right now and Bob Marley just came on the radio - coincidence??)\n\nThe bar itself is pretty cool. I accidentally walked into the men's bathroom though because I didn't know the women's bathroom was on the right. I was wondering why there was a huge trough in the bathroom and why it smelled and looked really bad. I just shrugged it off though considering it was a bar's restroom. My boyfriend made fun of me though when I complained and told me it was the men's bathroom. \n\nSo today's lesson, the women's bathroom at Skylark is on the RIGHT SIDE!", "author": "Christina B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "Came on Wednesday night because I kept hearing that it's the place to be midweek...\n\nLOVE the DJ!!!  Would go back strictly for this!  But the bartenders are also nice, though they knew the person who was ordering my drinks because he is a Wednesday night regular...so not sure how I would've been treated if I was ordering myself.\n\nBouncer tried to make me pay cover but I laughed it off like he was joking because um...there's no cover at Skylark...is there?!\nThe female running the door for the promoter that night was awesome!!...Nice to meet you Tran!! =D\n\nSkylark is HOT!!!!  No really...it's like a freakin sauna in there!  No sardine dancin on the dance floor for me.  Now I know why we were just chillin at the bar near the door...to get some breeze/air!!  But it's okay...I'll dance anywhere so at the bar it is.\n\nI wouldn't plan to come here unless I was meeting people here, but I wouldn't complain about coming either...it's a cool chill spot.", "author": "Ninja H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-30", "description": "Good drinks, no cover, nice booths, napkins have trivia on them.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "Been here several times on Thursday nights. Pretty decent place, kinda ghetto crowd, if you're into that. Recently, as we speak I've been denied by the one bartender countless times after he acknowledged me. I'll say one visit everything, but the douche with the facial hair. Looks Latin could be white is one of the worst bartenders ever. You can see by my past reviews this isn't a bs incident. \n\nThursday nights ok. The douch bartender. No. I give it\nOne stars bc I've had a decent time here before. The douche bartender just fails it. Wouldve been a 4.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "Skylark is a nice place to keep in your back pocket.\n\nBy that I mean it's a surefire go-to spot. I've seen 2 sides to this place. On special/ weekend nights, it was wild 'n crazy, especially on NYE. Around peak hours it's pretty much crackin'. And no doubt, it gets crazy packed.\n\nMusic consists of a good mix between hip hop, rap, R&B, and old school hits (right on). Drinks like $10 Tokyo Teas are well made but can gradually damage your wallet. But if you don't mind limiting your selection, they offer a number of drinks at discounted prices. But for anyone, having 'x' amount of drinks can lead to 'x' amount of fun. So drink responsibly.\n\nOn the other hand, nights can also be chill. I tend to appreciate the atmosphere more without all the hustle and bustle of a packed house. Slowing it down once in a while isn't half bad. Somewhere in between the pace of the music, spotting a cute female bartender and the dim mood lighting, I was put at ease. Strangely, it was serenity in the works.\n\nOverall, Skylark isn't the best nor the worst. Recommend it, I will because if I'm ever barhopping in the Mission, I'd know this place would come in handy.", "author": "Will S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "If I'm going out and if the city happens to be s.f I have to go to skylark I love this place its okay in size but I cant complain I always end up having an awesome time", "author": "Hanna T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "Enjoy'd a night out with friends last Saturday. \n\nPros: No cover, Diverse crowd, Inexpensive drinks, Bay Area Music. And if you don't want to spend your money at the bar, there is a corner store literally two doors down! : )\n\nCons: Only two bathrooms (one for the men and the other for women), Crowded, Small dance floor, needs better ventilation. Dance floor smelled like urine!!! Yuck! \n\nIf you are drunk enough...any place can be a happy place :) \n\nWould I be back? Sure. No doubt. It's definitely a lively place!", "author": "E C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-17", "description": "I've been to Skylark on both Tuesday and Friday evenings.  Tuesday was  real treat, because it wasn't too crowded, my drinks were just right, and the music was off the hook.  I danced until I started spinning, and had to catch that last Bart train home.\n\nNow Friday, that was an entirely different evening.  We were there way too early; so although we were able to enjoy happy hour prices and socialize, there was no DJ--bummer!  And as time passed, a burlesque troupe prepared to perform.  Um, no, not how I want to spend my Friday, so we left and hit up another spot.\n\nI'm looking forward to another Tuesday evening, and possibly a Saturday.  We shall see...", "author": "Felicia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "This is my Monday party.  It is Reggae Night.  The drinks are expensive, so drink before hand.  Or in front of the front door like everyone else... not joking, there is a party of it's own thrown by those dressed too shittily to get in, i.e. winners.  The crowd is always the same, the music is great, and the air is thick. ;) It is very crowded and never try to go to the bathroom, but if you muscle your way to a table it is a perfect place to start off your week talking with friends in the the smoke.", "author": "Meara G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-05", "description": "I came here on a night where they had female DJs spinning. I must say its one thing to be a female DJ, but the fact that they played good music that night makes it even more amazing. You can say it was rather hot haha. \n\nThey did charge cover that night, but only for the support of the DJs. I guess they normally don't charge cover here, but considering they played a good mix of hip-hop/r&b (especially from the 90s), I didn't mind paying.\n\nThe place has they \"ok let's go have a couple drinks and move on to the next bar\" feel to it. Nothing wrong it, it's just that I don't picture myself being there with a group of people for the entire evening. Hey, at least I considered coming here. It's not the nicest looking place either, but what do you expect? Something like a Vegas nightclub? Pfft.\n\nCrowd here is pretty good too, though it was predominantly hipster. No rude folks or anything like that. In addition, there's plenty of space to sit. Then again, there weren't too many people inside yet since we got there when nightlife hours started. Nonetheless, it's a good place to get your bar hopping night started. Solid 3.5 stars.", "author": "Loren John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "i've been going to this place for the past few years and this place never disappoints me. I usually go here on Thursday and Saturday nights (randomly). The music they play are hip-hop and some old school hip-hop, which are not bad. The area could be a little ghetto, since it's in the middle of Mission but other than that, it's a perfect place where you could just randomly go on a random night out. It's definitely a great last minute night out.", "author": "Toni Rose M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-04", "description": "This place is actually really fun.  When I first thought of a bar in the Mission, I did not expect anything too special.  Man, the drink specials at this place are a great deal:\n\n$6 Slamsterdam - a Jager type of drink (really sweet for my opinion)\n$11 Juan on Juan - a shot of Patron and a Corona\n\nThe other ones i don't quite remember, but there is a dance area for those girls you are with to dance if they want to.  \n\nOne thing to beware is the guys' bathroom is weird.  They have one of those horse trolley things that is really weird.", "author": "Min P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Skylark never disappoints. I've been here mostly on Thursday nights since it's not too crowded. Coming here on a Friday or a Saturday is always too crowded and I usually end up leaving and going to another bar. \nOn Thursday nights they play Hip-Hop, the music is good, and the drinks are moderately priced. \nAside from seeing people outside getting taken away by paramedics due to alcohol poisoning, the Mission is the best part of the city to go bar hopping in.", "author": "Pish P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-27", "description": "It's a bar with music.  The bartendars are OK and the dancefloor is tiny.  The bathrooms are your average bar bathrooms.  The parking sucks (mission) but the crowd is cool (when I went).  Oh yeah, i went on a Thursday night and shout out to DJ Inkfat for throwing on some really great hiphop.", "author": "Don A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "this place is pretty dope. i used to come here during the week to hear good music and have a couple drinks! service was great they play good hip hop and i like the whole look of this place. this is always a spot to visit when i come to SF!", "author": "Christian D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-05", "description": "Fun bar my homies, cronies, and damsels like to hit up for a light weight groove session. \n\nSmall and gets pretty packed. Some rift raft strolls through this place but security/management does its best to regulate. They play \"slappers\" \"slumpers\" and \"thumpers\" old and new on the regular and sometimes allow you to smoke jah herb right smack dab in the middle of the dance floor. Worth stopping by for a a drink and a dance if your in the area and bar hopping, wouldn't stay for more than a few hours in my humble and honest opinion + I've seen a few fights go down here. \n\nI've had some great memories @ the Skylark no doubt!", "author": "Phil H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-27", "description": "Went here on Saturday night for like 10 mins.\n\nNo cover.  Bouncer didn't card us as we just walked past him and inside.  Place was hella crowded.  Crowd was hella ghetto.  Music was straight hip-hop ghetto bay area club hyphy shit.\n\nPlace was small and reminded me of those ghetto basement parties around the dance floor.\n\nSaw someone get punked outside in front of his girlfriend.  Had to bust out the SFPD who didn't do shit, the SF fire department, and an ambulance.  Pretty funny scene.\n\nLocated right next to some Mexican and Pizza joints.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "This tiny place was packing quite a diverse crowd. I appreciate that they don't charge cover, and their drinks are reasonably priced. The bartenders were friendly and attentive. Pretty chill bouncers, good hip-hop/R&B selection on Fridays. \n\nPeople on the dance floor kept swaying into me, either because they were so drunk or they just didn't care. The floor itself was sticky, and funky smelling in some areas. You'll have to wait for the restroom since there's only one for men and one for women.", "author": "Leilani N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "Out of all the bars i went too, this one was one of my favorites. Yes its sketchy but it reminded me of one of my favorite dive bars in LA. \n\nThe music is sick, drinks are cheap and strong, and you have your shady guys trying to hit you up, so beware just incase your boo leaves to use the restroom.", "author": "Aidan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-05", "description": "I only started really going here a few weeks ago for the Wednesday night party that goes on here. Wed night is usually really crackin, but its been getting more and more crowded by the week, almost a little bit too full for fun. \nAs far as the bar goes in general its not too shabby, but nothing special at the same time. Typical 16th and Valencia bar...but thankfully the hispters/bike punks choose to stick to themselves at Delirium so they wont annoy you here often.  Drink averagely priced, but when it gets busy do expect a long wait for a drink as there are never more than 2 bartenders that Ive seen here.", "author": "Vilen G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-14", "description": "It's a pretty cool hip hop bar I go when there's nothing else to do in the Mission. It's pretty standard as far as these bars go. Kinda small, dance floor in the back. The drinks are cheap, and I like it! The crowd is urban and generally the polar opposite of the Marina crowd.\n\nNote: They play Juicy by Notorious B.I.G. every single time.\n\nI also recommend Double Dutch on the next block. It's a little more hip.", "author": "Diana N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-07", "description": "It is an kind of a interesting place. Small with a decent amount of people on a Monday night. The drinks are ok and the place is a bit dirty. What I remember the most of the place is the napkins with trivial.  That was pretty cool. My group ended up going through the napkins trying to answer all of the trivial\n\nI would go to this if I an bar hopping. Pobably not a place you want to stay for too long.", "author": "Jimmy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "not too into bar-hopping but i LOVE skylark. great mix of ppl, lively and entertaining. Fun to sit and people watch or great for dancing. the music is a cool mix that is appealing to all age groups. \n\nsuggestion to all the folks who feel SKYLARK is too \"ghetto\" & \"dangerous\"...TAKE YOUR ASSES TO A BAR IN THE MARINA!!! :-P", "author": "Monica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-21", "description": "No matter what anyone ever says about Skylark, this is the spot!! I've been coming here for almost 2-3 years now & I love it every time.  When I first found out about it me & my girls came almost everrryday! Reggae night (soo chill), Mixtape Wednesdays (better now), Thursdays (so much better before than now), and Fri/Sat's are always the best, but it gets too crowded sometimes.  The bartender's are the sweetest!! Erwin (my fave) he's always smiling, ready to go, and makes the drinks perfect! The music is mostly Hip-Hop and R&B, which is what I like so don't come here if you're looking for some rock or other music you wouldn't like this place or the crowd.  But aside from the music the atmosphere is great, spacious, dance floor gets crowded at times but it's always fun.  This is my go to place if all else fails I know Skylark won't let me down & til this day it hasn't =) my first true bar love Skylark, so many memories & more to come!", "author": "Christina O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-02", "description": "We waited 20 min in line to get into a barely packed bar and once we scanned the room and noticed the scene, we quickly downed our drinks and left. What a waste.\n\nThe music was good (they were playing a lot of old school hip hop) but nobody really seemed into it. Maybe we should've came a little bit later, but it seemed pretty dead to me.\n\nFYI, check in on foursquare for 2 for 1 specials on drinks!", "author": "Stefi C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-21", "description": "Pretty chill bar. The DJ was good. We stumbled into this place on a drunken Friday night and had a blast, but i think I blame that on the alchohol.\n\ngo here with a good crowd and youll have a good time.\n\nive been here sober, not so much fun. the DJ wasnt too good that night.", "author": "Susana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-20", "description": "I love everything about this place. The set up is basically everything I could ask for. I think I have ended up at this place almost every night that I've been out in the city in the past year. The inside is super cool and the art work and crap on the walls is awesome. \n\nThe first time I came to this place, my date told me to order a drink which he planned on paying for it only to realize that he didn't actually have any cash. He was gone for so long that the bartender felt bad and gave me a shot on the house and then let my friend and I have the original drinks that we ordered. That says a  lot about the staff, they want you to have a good time, you want you to have a good time. Fun is had by all. Not to mention the people that frequent this place are often pretty foxy. \n\nThe dance floor is perfect, good music, not too crowded. \n\nAnd its walking distance to La Cumbre. \n\nBottom line: you can always count on Skylark to show you a good time.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-10", "description": "I always wonder what this place is doing in the mission.  It's a little ghetto, but sometimes you need excitement in your life.\n\nI like Skylark because:\n- The play good music (Hello E-40!)...best in the mission if you ask me.  \n- I can get my dance on with my girls\n- It's pretty ghetto\n\nI don't like Skylark because:\n- The bathrooms are gross \n- I don't like having the bathroom door kicked down while I'm in it.  Then again I probably shouldn't have been in the boys bathroom.  I was just trying to pee and the girls line was way too long.\n- Men attack you like a piece of meat and you do feel like a piece of meat, but not a good cut\n- You can't dance with your girlfriends without feeling a penis on your thigh...wow dude, you're short\n- Men are cheap\n- It gets REALLY crowded\n- It's pretty ghetto\n\nRegardless if I make a fool of myself at Double Dutch I definitely roll on over here.", "author": "Justine D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-06", "description": "Michelle, the bartender and \"manager\" asked me if I wanted to \"get punched in the face\" when I asked her if I could request a song from the DJ. Great customer service! Michelle is a real C U Next Tuesday.", "author": "Alicia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-24", "description": "Came here back in the day...liked the atmosphere.  Of course we came from a smaller, even more cramped bar before this one.  Dance floor is small, although you don't really care when you're drunk off your ass and someone is leading you.  Nice and dark, so anyone that is aesthetically challenged, this is the place for you.  It's crowded...and when the club gets out, everyone hangs out on the sidewalk.  \n\nGood times in SF.", "author": "Nathalie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-08", "description": "Dark lighting sets the mood right, it goes along with the raw and dirtiness of Skylark.  Add some Golden Age Hip Hop, a bit of Reggae and alcohol calls for a great night, even better for my wallet!\n\nSlim place, plenty of seating, trivia napkins!\n\nFeel free to tag up the restroom... lol", "author": "Abraham E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-31", "description": "PROS: \n1. The drinks weren't terribly priced. \n2. Eclectic selection of music.\n\nCONS: \n1. Drink selection. \n2. The music was lacking. Better off bringing your own iPod and plugging it in.\n3. Would never pay a cover charge for this bar.", "author": "Pamela V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-30", "description": "One bling-bling star for proving that San Francisco has the friendliest crackheads on earth.\n\nI'll just quickly sum up the review part that I hate this place. The music isn't what it used to be, the crowd is no longer as friendly as it used to be, and it takes at least 15 minutes to get a damn drink in here.  Oh, and 15 minutes to take a leak when there are cretins doin' the nasty or doin' rails in the bathroom.\n\nNow, back to good part. This used to be my one and only Mission hang when I was a B&T kid from the south bay. They got good DJs, it was always easy to start conversations with the people around you, and they mixed stiff drinks and served them up quick.\n\nOn one particular Friday night of cruising into the city, we decided to roll in my buddy's brand new Lexus. We parked a block away and decided to go in for a cocktail before heading out to dinner elsewhere in the city.  \n\nUpon returning to the car, we noticed a group of haggard-looking gentlemen (and one lady) huddled up against the car, lighting up a glass pipe.\n\nMy friend hit his alarm-deactiviation button thingy and the car made its chirp. Immediately, the group of crack cocaine afficionados backed away from the car and moved further into the sidewalk. As we entered the car, one of them explained very politely, \"Excuse me, sir. I did not realize this was your vehicle. Allow me and my associates to back away - we didn't mean any trouble.\"\n\nSo, yeah, if it wasn't for the lure of Skylark, I wouldn't have learned that San Francisco is home to the most polite and articulate crackheads that have ever graced this earth.", "author": "Omid T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-11", "description": "I've been to Skylark Wednesday nights several times but I must say with the less-packed venue, no cover, and plenty of room to sit, Monday nights are underrated.\n\nLast night was the first time I could clearly see the dance floor. They had a california flag hung up and despite the lovely reggae music, all that was going through my mind was, \"a california bear, all up in your ear while I'm playing with your hair, b*tch I'm a player.\"\n\nSkylark Wednesdays have the Juan-on-Juan's though (shot of Patron and a Corona!). those are cool.", "author": "Sheila D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-05", "description": "I spent most of my night in the bathroom or standing outside smoking Newport's with my friend who'd just gotten her weave did and a chickie with a name tattoo peaking out of her full-cleavaging BeBe shirt. I don't know how my life could get any better than that. Then 'Back That Ass Up' came on. \n\nThought I'd provide the soundtrack from last night:\n\"Ain't nothing but a hoochie mama, ain't nothing but a hoochie mama...\"\n\nIn this case, these mamas wore brown lipliner with mauve lipstick, trannie style, and ordered Long Islands. The gold-grilled dudes wanted to just eat em up. Making me hella jealous, biatch.\n\nThe bar is surprisingly clean, barkeep pleasant and aims to get people wrecked. Strange decor, weird space for the dancefloor. Top 40 hip-hop. Wait, where do you want to go again? Good luck with that.", "author": "Ligaya T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-07", "description": "Don't F@#&kin TOUCH me!!!\n\nyes you! \nWhy does every place that plays decent hip-hop in the city have the guys that go behind you and start touching you?  I don't care how hot you may think you are but unless I get a handshake first.... Don't F@#kin TOUCh me!! \n\nI mean can't a girl just go out with friends to dance? \n\n\nOverall okay club/bar. But if you're a woman don't go without 4-5 other girlfriends. If you have male friends along with you that number can be lower.", "author": "Stacy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-24", "description": "This is place is whatevs.  Milf bartending, but she's cool.\n\nGhetto dudes on the floor, which leads to the highlarious moment of the night; when some white dude went to said milf bartender and asked her to handle the rude dudes in the back.  Her reaction was \"uhh hit up the guys in the front\"\n\nThe worst part of this spot was the bathroom.  I know bathrooms at joints like these are not suppose to be good, but this spot was one of the worse that I've ever been to, hands down!\n\nProbably more of a chill spot during happy hour?", "author": "Mark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "I love Skylark. I have been coming here for the last year and a half. The bouncers are always cool as well as the bartenders. Tip your bartender well and you will get rewarded with strong drinks. Sometimes the lines can be ridiculously long and take forever to go in. Great bar if you want to go hang out with some friends and get WASTED!", "author": "Gilbert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "Haters be damned!  This is the best place to go dancing if you want to get low.  Want to hook up?  Looking for the \"beautiful people\"?  Find someplace else.  \nPM me if you want to go dancing on a Sunday night!", "author": "Kati K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "Bumpin' on a Thursday night. Really. Had a chick behind the turntables, a dance floor filled with people, and the drinks coming off the tap. I wouldn't necessarily say that I liked it her, it's a bit dingy, and on a social spectrum, the crowd is decidedly less up-scale, teetering towards thuggish, but whatever. It's a good time. The ridiculous light bulb lighted singage out front is a bit over-the-top, but ensures that your friends won't miss it when you're giving directions.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-23", "description": "Hmmmmm... I only started going to Skylark for drinks when a friend dragged me to the Wednesday night event... little did I know I knew the people throwing the Wed. party and everyone and their mama from Daly City to SF to Oakland was there... So this review is for Skylark Wednesdays!\n\nGood crowd, very diverse in ethnicity and age group... Great music old school hip hop to new school... and most importanly they play a lot of Musiq Soulchild --- Like AIJUSWANNASING Musiq Soulchild --- and it works like a charm because once everyone here's the beginning of Just Friends  \"du du du du du dump, dump, dump, duuuump\" everyone, I mean EVERYONE grabs a girl or a guy and ends up on the dance floor... NO STRESS, NO DRAMA, GREAT BARTENDERS, STRAIGHT UP GOOD WEDNESDAY NIGHT FUN!", "author": "Chrysantha C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-30", "description": "Great place for those that just turned 21 and want to get into the Mission bar scene. Crowd mainly consists of youngins trying to get their mack on as distorted rap music plays in the background (kinda like a low-budget music video).  So if you're looking for a meat market in the Mission, this is the spot! \r\n\r\nWhy give an extra star? Cannot blame the bartenders (service was pretty quick). Plus, I can have a drink here while waiting for my order at Arinell's around the corner.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-09", "description": "I hate the fucking Skylark. The Skylark is for tools, underagers sans fake IDs, and people who like bad hip-hop and equally pathetic DJs. \n\nThe Skylark used to be my regular bar, and it seems like it was cooler back then. Maybe that was just because I had only been to one or two other bars in the city before. I will give the Skylark three plus points though: the bartenders are awesome and good at what they do, the DJs on reggae night are good, and they play cool movies above the bar. But even on reggae night its not really worth going because the patrons are all stupid. Thank god it isn't contagious or it might seep out into the street and infect unsuspecting passerby with an undying desire to dry hump to bad music and wear 50 Cent's clothing line. \n\nPerhaps the worst part of the Skylark are the guys that run the door. On Halloween I left my debit card behind the bar and the bouncer refused to let me back in to get it with no apparent reasoning behind his logic. The other night he refused to let me in because, and I swear to god this is true, I was drunk. \n\nWhat kind of a dipshit doesn't let a drunk girl into a bar?! BARS ARE FUCKING DRUNKERYS!!!!!!!! You should ESPECIALLY let the drunk people in. \n\nFurthermore, on certain nights they charge cover fees to come in and see their worthless DJs. They expect people to pay money to get into the Skylark? What, do they think they are a good bar or something? New Year's was one such occasion and my friend and I straight laughed in the doorman's face. The sad part though is that many people actually do pay the cover fee..... guys you're only encouraging them. Seriously. \n\nSo my advice about the Skylark is that if you're going to go there, make it early enough that the place has virtually no customers, the door guy hasn't arrived yet, and the DJ hasn't started. If you wait too late and go anyways at least be prepared to have a good laugh at the Slim Shady and Lady Soveirgn look alikes.", "author": "Slasha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-23", "description": "Skylark is located in the heart of the Mission district. The crowd last Friday night was very very mixed, and the music was um, different. The DJ that was scheduled to spin (hip-hop) that night had car trouble and never showed. SOoo we were kinda stuck listening to Latin music- from the 1950's with a little Reggae sprinkled in just to keep us guessing.\n\nThe two tables near the front window are the only ones large enough to fit large groups. A half an hour in, we found ourselves playing trivia with the questions printed on napkins from the bar. Quirky huh? And pretty dorky, fine.\n\nThis place has potential. It actually got pretty crowded around midnight, despite the music. Fun place to people watch, plus drinks are pretty cheap.", "author": "Elaine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "This place is really chill, the drinks are strong, the music is good, the staff is fast, and this place entertains a pretty diverse crowd.  I have enjoyed myself everytime I have visited, but I will admit I was a little unsure since its right on 16th street.  I try to stay away from that area no matter what time of day since there can be an abundance of unsavory people.   I know it sounds a little insensitive but its female self preservation, more for safety reasons than anything else. If you do go dark and stormy is pretty amazing, and their drink specials are pretty good.... shot of patron and corona anyone?!", "author": "Loretta M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-05", "description": "I got more action walking the length of the bar than I've gotten in two weeks at home, which was entirely more distressing than erotic. Maybe I'm out of practice at ghetto bars. I tried to recall all of my old defenses: \"I have a boyfriend, a UFC fighter, actually.\" \"I am lesbian\" (that one always backfired, now that I think of it), \"I have 6 kids who need a good man in their lives.\" But just like new computer viruses, the guys anticipated all of these lines and had upped their game--before I could stammer anything: \"I know you have a boyfriend, baby, but just dance this one song with me.\"\n\nI notice that a lot of my reviews complain, \"When it first opened,...\" or \"Back when this place was cool,...\"  so maybe I'm the one getting boring or snotty, but I'm pretty sure Skylark didn't used to smell like a floor of a fraternity house after a long weekend (and don't say, \"how would you know?\" not cool). \n\nThe music was good (for top 40 hip hop and for the bachelorette party we were on), but I wouldn't seek the place out on a weekend any time soon. Good bartenders, as others have noted, but certainly not worth being cavity checked by the guy behind you while you're waiting for drinks.", "author": "Gretchen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-25", "description": "Can you give a bar a good review based on comedic value alone?\n\nWhen my friend Paul suggested we head over here to get away from the smooshy nature of Casanovas, I said sure, I'm always down to check out a new bar.\n\nI walk in, and for a brief moment had to do a reality check and make sure i was still in the mission.  Where are all the hipsters?  Where did all these ghetto-fabulous bootie shakers come from?  I didn't realize that people in the mission were inclined to \"Back dat ass up\".  \n\nWe found seats, we ordered cheap-ish drinks, and had we felt like it...could have gotten our groove on in the back.  Maybe gotten crunk or something?  I do know that when one of the guys in my group went to use the bathroom in the back, he got regaled with calls of \"Heeey white boy\", as they did in fact, back  their ass up.\n\nEntertaining yes....if i am desperate for somewhere to sit at a bar...i would probably be back, I just don't know if it will be a destination spot.  I don't know if i'm able to get THAT hyphy.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-28", "description": "Eh???  what???  I'm nodding yes, but I can't hear a single word you're saying.  (you get the picture)  What saved these lucky stars was the songs the DJ was playing:  from Jane's Addiction to Roxanne Roxanne to B.B.D.'s Poison.  I was diggin' the songs, just wish he toned it down a bit.  \nHappy hour was okay, the $2 beer was PBR (which you could probably get anywhere else, which elsewhere we went after 4 rounds).  $2 well drinks (I don't see the point)\nI'm not shutting it off, but it won't be the first place to go for happy hour in the Mish.", "author": "Gemma P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-04", "description": "This place is not really my scene, which is unfortunate because there's no cover charge, they serve up affordable drinks and they play decent music that'll get your rump shakin'.\r\n\r\nThe layout of Skylark (long and narrow) guarantees that you're going to bump into/step on/generally annoy as many people as possible as you make your way to the dance floor in the back. Based on the reviews of people getting groped, maybe this is by design...\r\n\r\nAs a note, it took so long for someone to take me and my friend's second (and final) drink order that we could've bought our own beer making kit and ingredients, figure out how the hell to use it and brew our own beer before getting served! Granted, this was on a Sunday during Labor Day weekend and it was really crowded, but still...", "author": "Art D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-31", "description": "It was once a destination when it first opened but now ... just another bar with a DJ...\n\nI think that killed SKYLARK....It was cute when it was just a bar with music and you went for a beer that turned into 5 pints and a burrito from La Cumbre.", "author": "Teddy d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Skylark is awesome. I stopped by for a couple drinks with friends and I totally left with my phone! The Asian bartender is super nice and makes the best drinks.", "author": "B M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-10", "description": "This place is pretty scary.\n\nI only came here once last year, and it was with some out-of-town friends who were basically petitioning for a place to dance over all else. Every bar around 16th street was packed, so it was Skylark or bust. Oddly enough, I managed to enjoy myself on the dance floor for all of maybe five songs, despite the rampant marijuana fumes that were infiltrating the place...but once some dudes starting coming in with the hard sell, I had to say check ya later. \n\nTwo stars for being an actual meant-for-dancing venue in the mission. Never again, though.", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-04", "description": "Thank you ghetto ass guys in the back of Skylark who crowd around the dance floor, you have taught me much about picking up the ladies. Like the fine art of grabbing a woman's hand as she walks out of the dance floor dehydrated to get a drink of water. Pulling her into your web of sweaty, ball stank game. Singing her a sweet serenade of \"baby\"'s and \"wassup\"s.\n\n I have much to learn. Or maybe this bar is too east bay for me.", "author": "F B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-08-31", "description": "Look, I know I'm not the target audience for this bar (target audience? Jesus Christ on a stick I need to get out of marketing) but this place is like if two frat boys had a child then blasted bad hip-hop and served watered-down drinks from within that child.\r\n\r\nOkay, that similie may have derailed a little bit, but still! This place sucks like whoa.\r\n\r\nPerfect if you like date rape, blasting your lats, audtioning for MTV's The Real World, or the part in Bambi when Bambi's mom got shot.", "author": "Jake S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "Still one of the great spots in SF.\n\nMy old review still stands, now more than ever.\n\nSkylark isn't for the yuppies...peace!", "author": "Samurai J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-03", "description": "One word to describe this place: G-H-E-T-T-O\n\nI'm not a high class person by any means, but this place is full of ghetto-ass people.  Example: my friend and I were on the dance floor minding our own business when this chick who was trying to get by bumped into my friend.  My friend didn't really care, but this chick had to nerve to tell her to watch where she was going and starts trying to pick a fight with her!  I told her to calm down and they she starts yelling at me about how she's gonna kick my ass!  I just started laughing at her, turned around, and continued dancing.\n\nHowever, I will say that the bartenders were friendly and made good drinks.  But I would stay away from Skylark unless you're in the mood for a fight!", "author": "Jolene W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-26", "description": "Skylark is a total knockoff of the Holy Cow scene!  There should be only one \"Holy Cow\" bar in San Francisco, if you think you'd like another - Skylark is the place for you.\n\nDon't waste an evening, by visiting the Skylark.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-03", "description": "This place is pretty cool.  We went tonight (a Tuesday) and the DJ was ok.  There was only one bartender so service was a bit slow during a few points in the night.  Overall it was pretty good.\n\nThe setting is dark and red.  The DJ is setup in the back of the bar, and the seats near the DJ are really loud.  The seats near the bar are much better for hanging out with friends and talking.  Regardless, it was loud in there.\n\nDrinks were good.  I drank beer, but one of the ladies in our group had a couple Ruby Skylarks that she really enjoyed.  I tasted one and it had a strong grapefruit flavor.  Not bad.\n\nWe will go back.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-26", "description": "The scene: Sticky floors, dimly lit, sparse dance floor.\n\nThe crowd: Guys in the uniform (blazers one size too big, jeans two sizes too big and shirts three sizes too big) and girls upping their hoochy ante with attires that have an inverse relationship to he frigid outside temperature.\n\nThe music: Bad hip-hop. Bringing back Montel's Return Of The Mack was a nice trip down early 90's memory lane, but the rest sucked.\n\nThe vibe: Angry. One guy was already too drunk (it's 10pm people), and you could tell every sip of booze combined with every note of hip-hop was getting this overly testosteroned crowd ready to thrown down.\n\nWe left after 15min, which was 14 too many.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-10", "description": "Okay, the first two or three time I came to Skylark it was up and poppin, the music was cool, the crowd was nice, and the drinks were on par.\n\nNow I come here and see how it has pretty much gone downhill.  The place can be disrupted by Sureno's (blue rag gangsters if you don't know who they are) either inside or hanging outside.  The crowd is still pretty much the same as are the drinks, but the DJ's just don't seem as good anymore.\n\nIn fact, the last time I went there, the DJ had a horrible time blending the tracks together and it just made the music annoying.\n\nI eventually left early and walked over to Blondies (stay tuned for another review shortly on the above mentioned business)\n\nSorry, the Skylark is a mere shell of what it used to be...", "author": "Mike V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-24", "description": "It's hard for me to be too critical of this spot.  I mean, expectations should never be too high if someone calls out \"Skylark\".  On one hand you've got no cover, no dress code, a decent amount of seating, and a good chance of listening to a DJ spinning some above average hip-hop.  \n\nOn the other hand, those aforementioned things tend to attract a \"diverse\" crowd and it starts getting pretty grimy around 12.  I know that sounds kinda bitch-ass.  I just wish hip-hop and grimy wouldn't go hand-in-hand.  I mean, you would think that hip-hop would be a little more grown & sexy by now, you know?  Read the reviews, women love dancing to hip-hop.  Can't we get a Jay-Z \"Excuse Me Miss\" video-type spot in the city? Sorry, I digress...\n\nAnyway, my suggestion: Go early and bounce early.", "author": "Tommy O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-01", "description": "The Mission is so comical to me at times. Everybody wants to like it, because we live in a pretty snobby and trendy city that dictates if you don't like the Mission, then you're sorta an outcast. Well, the Mission has its draws, and certainly its drawbacks.\n\nSkylark, though, is cool. Totally cool. I will say this, however... last time I was here, a massive fight broke out, and bouncers were flying EVERYWHERE to calm everyone down. No worries, our drinks were safe. But no matter - here's a chill spot, in the Mission, often with a good DJ, that knows how to make a drink. And it's PERFECT for a party of 3, 4 or 5.\n\nI'll be back here, soon, but it was still super weird to have to shield not only myself but those I was with from the huge fight last time. Oh well, it makes for a fun story...", "author": "Drew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "DJ all night keeps the dancing vibe constant. Get ready to sweat.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-18", "description": "This place scares the living hell out of me. Is thier liqour license under review yet? They let girls in there that don't look older than the 13 yr old I nanny for. What What?? I am afraid just looking into that place. I have been there to dance once. I couldn't even get a drink it was so packed. And then proceeded to get molested by three randoms on the dance floor.  Nice. \nThis place is like the definition of meat market! Gross.\nIt gets one star b/c it allows me lots of cannon fodder to make fun as I walk to the bar that grownups hang out in.", "author": "shannon t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-17", "description": "The bar tenders are unfriendly and innattentive, drinks were sloppy, the people who made this bar a stop in the mission have moved on.\nThis place has gone down hill.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-04", "description": "my very first time was on a thursday\nI remember I didn't eat a lot that day\nthe DJ announced that they were \nserving Hukilau at the end of the bar.\nI was confused but I couldn't resist\nrunning over there to check it out.  \nGod damn, they had a tray of chicken\nkatsu and spam masubi for everyone\nin the venue.  I was the only one eating\nit for a while - I guess the others didn't\nhear the announcement - thank god. \nI was scarfing down the chicken but \nmostly the spam masubi - double fisted.\n\nI also go here on wednesdays.  they \nplay really good music.  RnB, soul, hip\nhop.  But the problem is the venue itself\nit's not made for a lot of people.  It can\nget really really crowded.  The dance floor\nis equivalent to the Paint area in a BBall\ncourt.  Not sure what that is?  Watch the\nNBA Playoffs on ESPN or ABC.   The painted\narea is just like the dance floor - no bull *censored*\nWhat I like is the dirty dog cart just right outside.\nolaay!", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-07", "description": "I would say this place is alright. There are plenty of better bars/clubs in the mission. I somehow have ended up here a few times now. I don't think I will be back but who knows.", "author": "Anthony C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Dropped in around 7pm on a Friday night with a friend just looking for a chill spot to have a reasonably priced drink in the Mission. Skylark fit the bill - not too crowded, strong drinks, happy hour goes until 9. Bartender was nice. Even got to catch some of the Giants game on one of the two TVs. Will definitely come back!", "author": "Sean C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-13", "description": "Door guy refused my very legal ID on a Monday night. Not sure who's hiring or training these guys but what a drag", "author": "Margaret S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-25", "description": "2.5 Stars (cuz its free and has good music)\n\nI've been on a Friday night.\n\nCrowd is mixed for guys, but girls are mostly asian or white.\n\nThe Good:\n1) Its Free.\n2) Music (hip-hop) is pretty good.\n3) No dress code.\n4) Kung-Fu or B-boy videos on the wall above the bar\n\nThe Bad:\n1) Dance floor is small\n2) Can get real crowded\n3) Way more guys than girls\n4) Its a place that \"off and on\" so have a back up plan \n\nGo there if you want a \"no frills\" place that is free, has good music and no dress code.", "author": "One Black Mans POV.. .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-22", "description": "Since my last review I've been coming here pretty often. It's my go to place when I wanna hear some hip hop and get a good drink. I ordered a double bourbon on the rocks the last time. Lets just say my night ended in an argument with my gf and me blacking out. I think that was like a quadruple they poured me. lol They always have this shot of patron and corona deal you can't beat and the DJ's are pretty dope. Gets pretty busy on a Weds night but have loved coming here for years now.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "We got here on the earlier side so we avoided the crowd at the entrance. We were able to find a booth that seated all 7 of us, which we hogged all night since our purpose that evening was to chill and chat.  As the night grew on the place got more packed, the music came on, seats filled up, and some dancing was going on.  \n\nOverall, good place to take it easy for the night.  Loved the pear cider they served!", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-30", "description": "Oooh.. music good. \n\nToo many people, bad. VERY BAD. \n\nFirst.. it's hard to even walk in the door. Second... no one can hear you ask them to move. \n\nThey're just people clogging up the trafficking aisles. Crazy.. couldn't move. I was suffocating. I'm being over dramatic but that's how I lived it. \n\nYeah, horrible experience. I was with awesome people... but dude, it really sucks when you have to basically strip to get the bartender to notice you. I didn't do that, but I assume that would catch someone's attention. \n\nPeople are shoving everywhere.. it's HOT...it's just bodies, so many bodies, it's gross.", "author": "Eugenia Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-04", "description": "This place is dope. Drinks are made right and aren't to expensive. Definitely not your typical upscale club vibe, which to me is dope. If you're into dress up, Ruby Skye type of shit than this definitely isn't the place for you (but fuck paying 30 bucks to get into the club anyways right?)\n\nHaven't been out for a Wednesday yet, but the reggae nights on Mondays are dope. Best part is they're 420 friendly!! \n\nHad to take a star away because they take awhile with the drinks because they're understaffed.", "author": "Tommy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-19", "description": "I've been to this place once and I will never ever go back. It is a shame, since there is no cover and I don't mind a little hip-hop to get my groove on. But, snap, this place is skeeze heaven.\n\nThe layout is narrow. I didn't realize I was claustrophobic until I tried to exit the place. The bar was crowded with the Bridge & Tunnel trying to get cheap cocktails and the back \"dance floor\" was crowded with people doing some bump 'n' grind. Dudes stare at girls in that way where you know that they are not thinking, \"I wonder if she has a great personality.\" I would liken it to meat market where all the meat has gone bad but that's more like the Holy Cow. Here, it's just ghetto.", "author": "Jackie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-28", "description": "Skylark has never disappointed me.  When it looks empty inside, I just go somewhere else.  I dOn't grab a drink when it looks dead and then complain about how it's dead inside.  See?  I use my nOOdle.\n\nThe 3 times I've been there (a Thursday, Friday and Sunday), the atmosphere was more chill than the other usually crazed neighboring bars and they were spinning some good beats, some hip hop, which you rarely hear in bars in the Mission or, you know, in San Francisco.  I love me some hip hop.  Truly.  \n\nI took my Dad here a few months ago when he was here on a business trip.  He is youthful and spritely and a generally cool dude.  He was drinking a rum and coke with my sister, a co-worker and myself and bobbin his 60 year old head to the music.  He likes hip hop, too.  Then he says to me in Chinese, \"Daughter, I like this place.  It has a good feeling.  Don't tell your mother I was at a pub.\"  For that cherished memory, Skylark gets 5 stars.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-15", "description": "This review is strictly for Mondays here at the Skylark - for their Dancehall/Reggae party.\n\nIf you are a white hippie who enjoys clouds of herb mixed with nag champa that will impair your breathing and your judgment - then go. There's plenty of space around the dj booth and the back for you to wabble back and forth in an interpretive way.\n\nIf you are a white person who likes to pretend you're black, then go.  This is the music of ja people.\n\nIf you are a sceney, ironic hipster looking for a place to scour and point and laugh at white people who think they're black or people who think they can dance but can't really, then go. there's a line of tables facing the bar and the dj booth- perfect for you to do your deed.\n\nSeriously though, this was a fun night. The drinks were slightly over-priced, but the overall tone of the evening was relaxed and fun, which is a nice break from the normal uppity vibe in there.  check it out :)", "author": "Amber K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-02", "description": "I can see why some folks would trip initially over Skylark's unglamorous feel. There aren't any fancy signs, the decor is minimum, and the dress is casual at best. \n\nFolks here are chill though...and the jams make you wanna dance. Stuff like De La Soul and A Tribe Called Quest mixed with current songs entices you to feel the vibe and eventually gravitate towards the back to shake your money maker. \n\nI had good company that evening in addition to the NO COVER. Good tunes and meeting laid-back people makes it a fun evening!", "author": "Chuck N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-23", "description": "Like so many other reviews, my friend also had her phone stolen out of her purse! Too bad this is such a problem here because the music and atmosphere were fun, and the bartenders were really friendly. Management needs to get a grip on the security of this place, it is ridiculous that there has been so much theft there!", "author": "Annah D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-04", "description": "I've only been on Wednesdays when they spin hip hop, R&B, soul, funk, & old school.  Any combination of those and I'm in (espeically if Herb Diggs is around).  \nI love that everybody's dancing all the way up to the front door & nobody cares.", "author": "Jen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-23", "description": "I cannot even count how many drug deals I watched happen right outside this door, and not pot deals.\n\nI can get a drink anywhere (I'm 21!)  I don't need to see meth and crack deals happening while enjoying my vodka drink.", "author": "Tom Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-10-17", "description": "Don't go drinking in the Mission. It is the weakest, lamest thing that you can do.\n\nI have not set foot in Skylark since they first opened about ten years ago, but I can smell the date-rape smell that comes out of that place from blocks away. On weekends, from the vantage of the window of the (excellent) Panchitas restaurant I have observed the following:\n\n11:00 PM: 19 and 20 year old girls with open-backed tops spill out of Skylark onto the sidewalk, smoking Marlboro lights. They are already staggering, babbling drunk.\n\n12:00 AM: Thuggy dudes who are too young to go into the club start massing out on the sidewalk. At this point, the sidewalk is so crowded that it is no longer useable as a sidewalk, it might as well be part of the club. In order to safely pass, you must walk out into the street.\n\n12:30 AM: The first of the fist-fights and projectile-vomitings begin.\n\n1:00 AM: The general area of the club can no longer contain the clubbers. They spill out in all directions and become a liability for other businesses on the block, like Panchitas and the corner liquor store. Things go downhill from here.\n\nI'm all about a good freak-show, but this is just a dumbass-show.\n\nPlease don't drink in the Mission. Stay in your own neighborhood and find a bar there. Please?", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-06", "description": "This is a fun place to go hang out to after dinner in the Mission, but before going out to whatever bar / party you're *really* going to that night.  No cover, no dress-code, no crowds, good seating.  My favorite is that the napkins have trivia on them.  Fun!\n\nAs a warning, it *is* sketchy and I will only go now if there's a large group of us and the guys outnumber the girls.", "author": "kiki d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-21", "description": "There are some places, like R Bar, where I really don't mind being crammed into a small room like a sardine with a bunch of strangers.  The generally fun vibe tends to make up for any level of annoyance I might have at the crowd level. \n\nThen there are places like Skylark.  I'm not sure what the actual capacity is, but on most nights that I've been there (the last time was a few years ago), I'm pretty sure there were some major fire code violations going on.  There's a tiny dance floor in the back where house retreads are in constant rotation (shades of Hi-Fi in the Marina).  The crowd seems to be made up of people who showed up at 16th at Valencia on a Saturday night not knowing much about the Mission, looked down the street and saw a bar with a cool sign, and decided to check it out.  This isn't the worst place in the world to hang out, but if you happen to be in this part of the Mission,  you could do better by trying Casanova, Dalva, Delirium or even Pink... all within a block of Skylark.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-17", "description": "Pro: Cool front booths that allow you to chat\nCons: Horrible mixed drinks. Come on bartenders when you order a 7 & 7 the drink should not be clear (brown liquor + clear soda=brown drink). The music was a toss up of top 40 and random R&B. The crowd got progressively worse as the night went on and it is impossible to use the bathroom. \nAll in all not a place I would go again.", "author": "Courtney R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-02", "description": "This place depends on the crowd I am sure because it was so ghetto. My girls and I walked in, turned around and walked out. It was really horrible and totally crappy. This was Halloween weekend, WHAT?!", "author": "Natasha M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-05", "description": "THE place to be on Wednesday nights after 12am. It has the best DJs in the mission spinning lots of old school classics along with Bay Area beats, without mashups (The DJs here are really creative in their song selection and the ways that they mix their songs. They don't just cut from song to song which is what I'm finding a lot of lounge DJs do these days). Drink specials including $3 Heinnies. And the crowd on Mixtape Wednesdays is also very local which I dig. Added bonus: when the place closes up shop at 2am, the ghetto hot dog cart selling bacon wrapped hot dogs with jalepenos is waiting for you outside!\n\nDuring the weekends, this place is still pretty cracking, but the crowd and the atmosphere are the best on Wednesdays!", "author": "Rod M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-24", "description": "Where do I start with this place?  I suppose I'll start with the obvious: it sucks. Majorly.  In my unattainable quest to try every bar in the Mission, I stopped in here with a friend on the way home from a little houseparty.\n\nWhat should have tipped us off was that the bouncer, upon checking our ID's, said \"Why are you here?  If I didn't work here I would never come here.\"  But I have a tendency to ignore red flags so we proceded.\n\nThe bartender took about 5 million hours to get to us (and it wasn't like it was busy) only to act like she was annoyed with us (which I always love), pour us the weakest drinks EVER (awesome) and promptly walk away after taking our 5-spot for the well drinks.\n\nIt was a very ethnically-diverse, East Bay-ish type crowd (and I'm from Fremont so I can hang, but really?) grinding to their fav hyphy jams.  Stole a little booth that was not cleaned (on par with the entire disgusting place, in need of a busser like WHATTT).\n\nI could see how some people could dig the crowd/music, which is why I gave it 2 stars.  But this place belongs downtown or in the Tenderloin, not among the likes of the sweet haunts of the Mission.", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-28", "description": "Good crowd in here. It is like a fusion of the Marina and the Mission....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "This bar doesn't have a very strict dress code (all I've seen them been strict on are hats with logos on it).  There isn't any dress code and they play pretty good hip hop/mainstream music.  There is one long bar that usually only has 2 bartenders, but regardless you don't have to wait too long for a drink.  The neighborhood is a bit ghetto and sometimes the people inside are as well.  There is a dance floor all the way in the back, meaning it can get a bit sweaty back there =\\.  But if I ever want to go out somewhere to dance and don't want the hassle of lines, dress code, or cover -- then this is where I go.", "author": "Pia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "This place isn't bad... loved the music they played (which was old skool mixed with the new that night... Wednesday, I think) .. although the fact that I could practically turn my head and saw almost everyone I knew from my childhood disturbed me. I guess this is where everyone's been hiding out? \n\nI didn't have much to drink because I was fresh off of a \"let's barhop across the city\" trip, but the only drink that I did manage to have was a rum and coke that cost me a pretty penny and was mostly coke. That's just not cool. \n\nIt gets four stars for the atmosphere and music... three for watering down my drink. Suckage.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-27", "description": "If you come here then you've probably reached a new low in life. I mean, the music is always on point - this review is not about the music, mainly about one's overall experience there. I come here with no expectations of finding a new bird, it's just not going to happen. If you're cool with a sausage fest of grimy ass dudes then this is where you need to be. Sleaze balls galore -_- the women who come here are equally as trashy/tacky. There was once a legit crackhead in there tearing up the dance floor. How the fuck did a crackhead get in?? Do they even have an i.d? Money?? So this place is straight gutter and they have the audacity to have a dress code and charge at the door?! I CAN'T! It's like, excuse me? Do you see me? I'm too pretty to even be here, let alone pay for shit. I am only here to sweat my bangs out and tilt my head back when my favorite song comes on. If you looooooove reggae/dancehall (like I do) come to Mixtape (every Wednesday) and you will be too busy having the time of your life to notice the garbage crowd. Drinks are okay and decently priced. Bathrooms are gross for the most part and there is always a line. Dance floor is kind of small and it gets packed once everyone arrives (usually at midnight). There is a giant  fan by the DJ booth that is fun to dance in front of ^_^ it's like you're in a music video. Also, don't come here with any valuables. It will get stolen. It's happened to me and my friends pretty much every time we go. Even more of a reason to never show my pretty face there but some days I just can't resist. No other place in the city spins reggae and dancehall like they do here.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-04", "description": "What can I say? When I think of Skylark, I think of all the nights I got drunk and got to dance my ass off. I think of summertime and the cool, laidback atmosphere. Skylark is my bootycall for the night. When all else fails, I go to Skylark and he welcomes me with open arms and a drink. Geeez. We could make babies this way. HAHA.\n\nI love the no cover charge. I like the bouncers. They're friendly and actual human beings not fake ass cops. And they really protect you when it comes down to it. Just like the time so dude cursed me out for \"cockblocking\" yess they comforted me when I was going on a rampage. \n\nThe drinks are yuumy. Nothing real special. But they satisfy me. I've been here mostly hiphop nights and also reggae nights which I don't mind. The bartender is a sweetie. there's usually 2 and they're cool. \n\nMy fave thing about this bar is the crowd. Hence, the mission district. it's diverse and my friends and I always seem to find someone cool to talk too or sit down with. \n\nJust do me one favor and never change =)", "author": "Sarina I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-14", "description": "Came here on a Friday recently since it was the closest bar to Pancho Villa and our full bellies couldn't handle walking much further. \n\nBasically, I was left with no real impression. The place was practically empty even at midnight. Luckily this meant the bartender was attentive, the drinks were pretty stiff, and it wasn't too loud to carry on a conversation. But other than that, I have nothing to say - positive or negative. Which is not a good thing. I spent over 2 hours here and barely remember the fact that I was there (and no, that had nothing to do with my alcohol consumption). I didn't even remember the name of the bar, it left that little of an impression. Needless to say, I doubt I'll return. And even if I go back to Pancho Villa, I'll use the boring-ness of this bar as incentive to walk a little further and burn off the calories from my delicious burrito.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-21", "description": "Today is Saturday, right?\n\nI went here around 9pm with a couple of friends, and we were the only people in the bar. I thought that was kind of odd, since I'm pretty sure it's Saturday, but no matter. That meant we got a booth by the window, and didn't have to wait for our drinks. Plus, my margarita was tasty, and extra extra salty. Just the way I like it.\n\nI kind of dug the mermaid theme, too, but I don't know what that has to do with skies or larks.", "author": "Vanessa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-25", "description": "This place may not be the nicest, classiest, or cleanest place, but it holds a special place in my heart. I've come here for 8 years now and just love the fact that there is no cover or dress code.  Good hip-hop, nice lil (crowded) dance floor, and the fact I'm cool with the staff all help contribute to my fondness for this place.  It has gotten a little ghetto over the years, but I still like it.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-03", "description": "I have a special place for Skylark when considering my favorite places in SF. It was the first place that I went dancing when I moved from San Diego, and it was so liberating to go dancing without paying a cover, without needing to wear heels and dress like a stripper (although a few have stumbled in since this first visit), but being honored with  tracks from my people like Talib Kweli, Mos Def, Biggie, Tribe, Q-Tip, Musiq! and 90s R&B like 112, Lucy Pearl, Groove Theory (whose feeling me?)\n\nOk, now the reality is, after a few more visits, I understand the vibe a little more. This is how it works... My kind of music (the good stuff) comes on earlier in the night (10-ish), which means you may be the first person on the dancefloor (I'm down). At around 11:45, the crazy stumblers who don't appreciate the good stuff arrive and start requesting Top 40 music (I'll admit, I can dance to some of it), and distract me from my rhythm by waving their hands and shoulders foolishly. This is then mixed in with some questionable looking \"hood\" characters, and while I don't like hating on people who are having a good time, there's just not enough room for me and them....  but my que to leave is when the white (and sometimes brown) people start singing along and say the N word--- it just won't ever be right.\n\n4 stars for 10- 11:45 crowd and music, and always good bartenders.", "author": "Kirsti P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "Skylark is great bar with great music and cheap drinks but the reason I'm going to make this one of my regular bar stops is the amazing staff.  I left my bag (and laptop) there on a week night and couldn't believe the lengths they went to track me down and it get back to me.  Sweet.  I don't know any other bar that would've done that.  Thanks Skylark and I'll see you guys soon!", "author": "Jared K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-08", "description": "This place is ghetto.  The crowd is mixed.  Getting a drink was impossible last night.  There were 2 bartenders and 1 barback for the whole night!  You had to stand around waving your $$ to try and catch the bartender's attention.  Drinks are pretty cheap  ($7)  However, my drinks were super weak though!\n\nThey have trivia questions on their napkins.  That was entertaining.\n\nDancing was almost impossible.  On top of being a tiny dance floor, people kept coming in/out...which created a lot of nudging, pushing, moving... My friends and I gave up trying to dance after 2 minutes.  \n\nThere was no cover.  Yay.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "Not the typical Mission hipster bar. But with the right crowd you can have a good time. Pete is a great bartender, I dunno how they stay so friendly considering most of the assholes in here don't tip very well.", "author": "Adrian C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-07", "description": "After a long and frustrating day at work, I was determined to find a bar that I could sit, enjoy a drink, and do some reading.  I realized that every fucking bar in the mission around 7PM is so dark that you can't read a magazine if you had 10X magnifying eye glasses on.  As I walked home in defeat, I passed by the Skylark and peaked in, and to my surprise there was nobody there, and they had red lights everywhere!  I CAN SEE!  I asked the bartender for a PBR with a lemon (that's my drink).  He replied, \"A PBR with a lemon is like trying to heal a broken leg with a band aid\".  I laughed and told him not to knock my drink before having one.  I swear, it's the most refreshing thing ever.\n\nI sat down, did some writing to some Belle and Sebastian in the background and told myself this couldn't be the same place during the night, and it's not.\n\nI got reminiscent about the good ole days in Seattle and started to miss all of my want to be hipster friends riding their bikes on Capitol Hill.  Then I knocked some sense into myself and left.  FRIGGIN HIPSTERS! :)", "author": "Justin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-03", "description": "Rules to live by if thinking about going to the Skylark-\n- go for happy hour, it's nice, kinda loungey\n-go on a weekday, the weekends are kinda crowded, but that's the mission\n-go for a private party, they accommodate large groups and won't have attitude about it, even if it is the weekend\n-drinks are kinda cheap, they aren't $6, but they also aren't $12\n-check out the early entertainment, random guys singing frank sinatra- with the right buzz, this can make your night!\n-watch out for the peeps outside- way shady and keep a good grip on your purse!", "author": "Valarie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-20", "description": "I come here when I get bored at delirium.\n\nThen I get bored here.  And wasted.  Because shady guys who follow you aroudn the city start buying and your friend drinks and cab fare.  Thank god you're brilliant enough to sober up and get kicked out of the End Up.\n\nSo you're not stupid enough to take them home.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-09", "description": "People, come on! Skylark happy hour is GREAT! Trivia napkins! Nice bartenders!\nGet there early and the loud music and dancing won't be happening.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-23", "description": "Honestly, it's pretty ghetto here, but why did I used to come here every week?  The Dj's on the Weekends are usually good, you can usually find a bit older crowd (25-30) and the truth of the matter is this place is pretty much a singles/hook up bar.  If you are a single girl or guy looking for someone to meet, you can almost guaranteed find someone here.  If you want to go party with your girlfriend/boyfriend...you may want to choose another spot.  Oh yeah...this place is absolutely dead on all the other days of the week.\n\nThe bartenders are all great here as well, quick even when it is crowded up the bum and friendly.", "author": "Medwin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-15", "description": "For better or for worse, Skylark has become the Boones (aka Triangle Lounge) of old.  On most nights the crowd is local and therefore chilled and there just to have a good time.  And on most nights, the dance floor, with its sparse lighting and overpowering strobe lights are the perfect storm for the beer goggle patrol to come out.  Plus, its male and female bathrooms are next to the dance floor, which the patrons are notorious for leaving open.  There's been occasions where I don't know if I'm still on the dance floor or in the urinal.\n\nThat's why I gave this place 4 stars!", "author": "Don B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Dirty hip hop and cheap ass well drinks on Thursdays. Yay!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-15", "description": "Music isn't bad, but the bartenders try to rip you off! Ordered a drink from this female Filipino bartender with tattoos on both arms, charged 21 for the same drinks she charged someone 19, gave her 40 and she gave 11 back! When I tried to ask her she purposely avoided my friends and I. Don't go.", "author": "Louis V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-19", "description": "I really like that this bar plays the type of music i like to listen to....mostly hip-hop, and new pop-hop.  I love to get down with my friends and this is a decent spot to do it.  It is usually pretty loud, and for the most part people are dancing in the back.\nHOWEVER there are a few negatives about the spot.\n1. The dancing goes down near the back where there is litterally NO air cirrculation, it's hotter than a witches titty in there.\n2. At least three crack heads will try to get some money from you but this is no surprise within the area.\n3.The usual crowd of rowdy boys are seriously annoying, and tend to get a little too close.\nI do kinda like coming here dispite the negatives.", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-09", "description": "I used to love going to Skylark ever since I got into Skylark for only $3 on NYE '06, but now the crowd has changed and it is no longer my default club. Two years ago, there were a lot of hip-hop heads there who didn't mind being in a crowded area as long as the latest music was playing. But the last few times I've been there, I've had to deal with prissy girls in their fancy skirts and heels who just take up space on the dance floor. If you wanna just stand around and not get bumped into, go somewhere else! Oh and I swear the DJ plays the same tired CD he must've bumped in like 2001. \n\nPS: For those of you who have complained about the thugs who linger outside, be nice. Those are my neighbors! Seriously, one of them lives like 2 floors below me, HA!", "author": "Iris V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-14", "description": "everyone who keeps calling this place ghetto--as an insult--must be unaware they CHOSE to go into a reggae DIVE BAR in the MISSION. please go back to ruby skye so there's more room for non-ignorant, relaxed people who enjoy real hip hop and smoking joints in bars.\n\nnothin but love for u skylark and lovely patrons, until we meet again....", "author": "Jenna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "Best bar in the city if you're a fan of hip-hop and the mission scene.  Everytime I hit up Skylark I have a good time... but you gotta be up for it.\n\nThe weekend schedule usually goes something like this:\n\n9-10:30p\nloungin' beats, mellow scene, easy to get a drink at the bar\n\n10:30-12:30a \nold school hits that make you wanna dance and drink more, diverse crowd, dance floor gets packed, 20 minute wait for a drink\n\n12:30-2a\ndirrty booty-shakin' beats finish out the night, crowd turns to 80% male, street thugs start rolling in, ass-grabbing commences, dance floor withers down to guys looking for some action and girls too drunk to know the difference, 10 minute wait for a drink\n\n2a (outside on the sidewalk)\nsketchy people waiting outside observing the drunken loitering on the sidewalk, homeless people asking for spare change, a hug, or a handshake... my advice: get out and go home\n\njust ignore all the drama and you'll have a good time here.", "author": "Brandon C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-25", "description": "I would give Skylark a 3 star rating, but we encountered a pretty dicey scene there-- borderline dangerous.\n\nIf you've read any of my other reviews, I'm not a fan of the Mission. It's gross to me. I tried to overrule my friends on this one, but I lost.\n\nAnyway, we were a little \"outnumbered\" in this place if you know what I mean. Everyone was either civil or friendly, but we kinda stood out, if you catch my drift. I can't say I felt uncomfortable there though.\n\nWithin like 20 minutes of getting our Fat Tires, some sort of melee broke out on the dance floor, which incidentally was rocking out to a great old school tune (\"Return of the Mack\" by Mark Morrison). It was hard to see what sparked it, but I think some drunk guy threw a beer bottle at the DJ booth or something. Security was on it pretty quickly and escorted this nutsac as well as a couple others out the door by force.\n\nNaturally they had to go right by us at the bar and all these hoodlums were throwing beer bottles at this MF, which then broke around our feet. At least it wasn't some sort of racial gang warfare, I think it was just an idiot sparking other idiots to misbehave.\n\nHilarious quote from one of the employees as he swept up the broken glass. \"It's just the weekend man. This is what happens.\"\n\nNice.\n\nAfter that whole thing settled down, the bar chilled out again, and they played \"Juicy\" and \"Hypnotize\". It's cool that bars realize how old their clientele are and play songs we liked as kids. \n\nDefinitely some riff raff in this joint, but it's not all bad. Props for the trough urinal. Reminds me of Candlestick. Tough to make your way through the simulated sex on the dance floor to get there though.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "Great dark bar with pretty good cocktails. Like just about everywhere else in town, they have pretty good Happy Hour specials. Seems like they have some good DJ's as well, though they could maybe moderate the sound a little better. Went in for happy hour, but as the evening wore on, in came the \"Woooo!\" Girls with a bachelorette party. Couldn't leave quick enough.", "author": "Jeff R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-16", "description": "I feel bad for every one that has had a bad exerience at the Skylark or has something bad to say about this place. From my stand point, it's the best bar in the mission. Honestly!\n\nLets look at the positives:\n-Weed is A-Okay \n-Drinks come cheap (if you tip)\n-No cover charge\n-No dress code\n\nTips for a good time:\n-Come early\n-Mondays and Tuesdays are always the chillest\n-if you become friends with the bartenders you can even be the DJ for the night ;-)\n-leave early", "author": "Tedi O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-12", "description": "I appreciate skylark.\nNo lines, no cover, no pretenses. Just alcohol and music.\nThe dance floor is tiny and there is only one bathroom, but I still come back.\n\nLogistics:\nCrowd: Mainly minorities (no, I won't say \"ghetto\" because of this) of all colors with a few yuppies mixed in.\nMusic: Hip-Hop, hyphy\nDrinks: Strong and $8", "author": "Josie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-05", "description": "so skylark is usually not a place i would go to on my own. HOWEVER, i only come here on thursdays bc my friend works door and drinks are $3. and when Masaye aka the most gorgeous bartender ever, is pouring, i enjoy my drink just a tad more bc they're strong. plus pupusas are right next door and if i wanted to go dancing, delirium actually has funk/punk /ska music playing on thursdays. line for the girl's bathroom is always long and the bouncer always eyes me funny. sorry brah.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-29", "description": "Terrible first time experience,  me and a group of friends went to this club about 2 weeks ago. As soon as we arrived I noticed the bartenders (Michelle and Monica) downing shots of alcohol with customers while plenty customers were waiting to order a drink. Nothing out of the norm, however they should remember that they are at work and should know there limits. Long story short one of the girls in my party got cursed out by Monica (if that was her real name) because she didn't know how to make a drink that was requested and they ended up giving my debit card to another person because they were too drunk. Management definitely needs to step in, the bouncers said they had been hearing complaints all night.  Other than that the Dj played a good set and the crowd there was fun. However when your debit card is given to the wrong person on a Saturday night it ruins the rest of your weekend.  Really inconvenient and the bartenders didn't really seem like they cared, they were very nonchalant about it  saying \"you can just call into cancel\" ...  Thanks I know that, but now what am I gonna do about money 1 in the morning on a Sunday.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-28", "description": "I am hungover...I vaguely remember this place but I do know I liked it!  It's red and has a comfy booth and space to dance.  The cutest bartender ever...Erwin or Edwin(???) who gave me strong Stoli soda's w/ lime.\n\nMy head is pounding and by body is aching....\n\nhelp\n\nme.\n\nwater....\n\nwater....\n\nthud!  (sound of me falling before getting to the water cooler)", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-11", "description": "3 stars for being skylark ... good music, reasonably priced strongly made drinks, I like the feel in here - chill, come as you are, and a fairly diverse group of people.  An extra star for the additional entertainment - guys tryin to fight for dumb ass reasons (relax people, they're not ghetto, they're harmless), bacon wrapped hot dogs sold out of their food carts, and the guy that always takes his shirt off tryin to show off his body so he can get a piece.  I'm sure he does with the type of girls that come through but I doubt any of them ever call him back after.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "This review is for WEDNESDAY NIGHTS ONLY!\n\nDude.\n$3 Heineken\n$6 Mojito\n\nI get drunk & she gets drunk.  Yes, I went there with my girl and, no, she was not groped (by anyone else but me).  There was about a 60/40 ratio of guys to girls, nice enough, sheeeet for a Wednesday!  In my single days that was golden.  The crowd was super chill (25+) compared to what I've seen on the weekends.\n\nMusic:  Early in the night they were playing Old School.  I'm not talking NWA & Run DMC, I'm talking Frankie Beverly & Maze, Stevie Wonder, James Brown, Jackson5, etc.  Then they broke into the MosDef, Talib, The Roots, a little reggae and a bunch of 90s cool stuff I used put on mixtapes.\n\nBut seriously, the 5th star was earned by my favorite drink special.  Are you ready?  $9 for a shot of Patron & a bottle of Corona.  Isn't that disgusting?", "author": "Segue P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "Skylark is my spot! Lol. Let me explain the reasons:\n1. When my best friend and I first ventured in here after getting a burrito next door, ya it looked a little sketch but seemed like good music. So as we approach the door, anxious to see what's waiting inside, the bouncer gives us a few words of wisdom: \" watch your bags ladies. You'll be fine but just be careful, don't set them down anywhere. Just wanted to let you know. Have a good night\" fuckin classic. Lol\n2. The music is amazing. Hip hop, r&b and oldies with some reggae and top 40 mixed in. Best music I've heard in the city hands down.\n3. The ambiance. It's not that bad lol. It's not the W but it's fun. Red decor, tables and booths line the walkway, which is Perfect for people watching. \n4. Best people watching in the city. Where else can you find homeless men, men with grills and dreads rapping Mac dre, men in business suits from la, and women in spandex and booty shorts. Lol ok I'm making it sound worse than it is. But they all try to hit on u and it's hilarious. \n5. Did u see their new sign?? Lol fab. Love it\n\nIn summary, if you want to have a good time, relax, throw on whatever, and have good music and pretty good drinks, and laugh at people, you'll have a great time. \n\nOo and no cover and rarely a line lol. Love it.", "author": "Naomi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-11", "description": "I have been here a couple of times and they usually have pretty decent music playing. I've heard mostly hip hop and some ska/reggae. I will list pros and cons, to which you may give your own ratings.\n\nPros:\n\nGreat drink specials\nDecent music\nDance area\nClose to 16th street Bart\nEasily accessible by bus\nClose by other bars if you wish to check out the mission scene\nClose by some pretty good restaurants in case you get hungry\n\nCons:\n\nBartenders may be as drunk/loaded or more so than you are\nVery small tables, so you must hoard a few if you have a group of more than 4\nTwo unisex bathrooms\nTwo bartenders on a Friday night\nLimited selection of beer on tap -- I love beer on tap, so the bigger the selection the better for me :)\n\nI think the crowd is pretty mellow, so you get a variety of people in there. Overall, its a great place to at least get your night started with the drink specials.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-07", "description": "One of the reasons I even use Yelp is so I can try some of the places and see how my rating matches up to everyone else's opinion.\n\nIn this case it does..  this place is pretty average.\n\nWell, let's look at the facts.  We have a bar on 16th, that alone should be worth something right?  The bar serves drinks, right? yes, I think that might be already two stars or something...\n\nUnfortunately, there isn't much else going for it.  The layout is decent but I'm not crazy about it.  I agree the crowd looked a little shady but I'm not a slender female so I wasn't worried.  The beer selection was decent, but nothing too stellar.  I blame the screen above the bar, it gives people who probably shouldn't be at bars alone too much of a reason to hang around.  This seems like a good happy hour bar as the weekday crowd seems pretty laid back, but otherwise I think this place ranks pretty low on places I would be determined to come to on a weekend.  Actually, if you're going to hold a gun to my head about where I want to drink in the Mission and we're on 16th, I will always go to the nearby Delirium or Kilowatt or even walk over to Guerrero for the 500 Club or ... (incoherent recommendation while I spill beer on myself)", "author": "Steven R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-03", "description": "I wondered into Skylark one evening on my trek back from Candystore Collective to BART. I was the only patron at 8:00 on a Thursday. I ordered a vodka based specialty cocktail and settled in to view a Disney cartoon with the bartender. I drank two cocktails before other patrons arrived. Everyone seemed so low key. It's almost hard to imagine the Skylark as a happening hot spot. Apparently, their Peaches parties are off the chain. They even serve peach Bellini's!  I left long before the festivities began.  I could see this place for at least an old school style happy hour.  It's a dark cave though.  I imagine funny things hang around dark caves.", "author": "Camille K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-04", "description": "This is my spot on wednesday nights. mixtape wednesdays has become pretty crackin. its usually a hit or miss in terms of the crowd, but the drink specials are cool beans. 9 bucks for a shot of patron and a corona. yeahhh, see ya monday! the music is dope as well, which always has me cumming back.", "author": "Alvin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-16", "description": "This place is my guilty pleasure.\n\nThat's all I've got for y'all on this place.  Go there, don't expect it to be anything and it will be everything.  \n\nNothing says \"San Francisco\" like not being able to smoke a cigarette in a bar, but being drenched by waves of marijuana smoke.\n\nDrugs are indeed rampant - but hey, it's nice to have a one-stop shop, right?  You can get wasted, then high, then shake your tail-feather, then go next door and get your grub on, then repeat or go home.\n\nYay for Sky Lark.", "author": "Brandie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-10", "description": "The music is pretty good here I think. They were spinning lots of throwbacks and some newer hip hop as well. Lots of people were there, and a decent energy from the crowd. It's pretty cool if you're already in the area, but I don't know if it'd be a destination spot for me.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-20", "description": "One of the more yuppie friendly bars in the Mission. Attractive space with comfortable seating, a small dance floor, and decent DJs. Drinks aren't pricey, beers for $4? Not bad.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-18", "description": "Do not order a martini here.\n\n(Skylark, if you're listening, a better gin selection would be great!)", "author": "Sahra H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-18", "description": "been coming here for the past 3+ years. and is a sorta of a default when I'm not trying to do anything big. It can get a bit crowded and since the dance floor is in the back with no ventilation it gets really stuffy. they always play good music. sometimes you do get some sketchy people but hey that comes with the neighborhood.\n\nDrink prices are good compared to other places. I actually went there last night. and is the 1st time i got crappy service. that would be the reason for the 3 stars The female bartender was making lousy drinks, skipping people and then has the nerve to cop an attitude when i pointed that out to her. I guess they hired her for her rack and not the bar tending skills", "author": "Alfredo N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-07", "description": "I usually only go to Sky Lark if my friends drag me, but at least there's not normally a cover and  have music & a dance floor if you want to shake your ass - and the selection of women isn't half bad either. Personally, I think the drink prices are a little steep and I usually pregame a t Kilowatt before making my way in here. \n\nThey play bizarre shit on the TV above the bar so if you're not feeling the crowd and just want to chill out & have a drink... I suppose you've got something to watch.... right?", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-03", "description": "Went here for a girl friend's bday on a Friday night. She really hyped this place up so I was really expecting a good crowd and a nice bar/lounge to hang out in.\n\nNever expect a diamond from a cubic zarconia.\n\nThis place is sooooooooo damn small! Dance floor.... WHAT DANCE FLOOR? You mean the one where everyone is just standing around on? That's not a dance floor, that's JUST A FLOOR.\n\nFugly and SUPER GHETTO guys! Even with VODKA GOOGLES on I couldn't spot a cutie in the crowd. But of course, I don't really see any guys worth looking at in any SF/Bay Area club. \n\nNeed a drink? Go to the bar across the street and come back. You'll get a drink faster that way rather than waiting for the damn bartender to notice you. There was only like 2 bartenders for the whole bar on a Friday night!\n\nNeed to get out? Be prepared to push, shove and kick some major @ss. This place is sooo small that you have no other choice but to kick your way out of the waves of smelly gross people.\n\nI spent most of my time outside smoking cigs.", "author": "Britney C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-16", "description": "no. 1: i am SERIOUSLY disturbed when people (esp. ppl who aren't of color) describe someplace as \"ghetto.\" Is that your codeword for black??? why can't u just say black??? is ghetto synonymous with black??? what do you mean by \"ghetto\"? someone explain, and maybe i won't be soo freakin offended. \n\nno.2: when yelpers call something \"ghetto\", after I get annoyed, I realize it's 99.99999% likely that I will enjoy that venue, or at least the music. and I did. the highlight of skylark is the DJ who can make smooth transition and plays hands down good hip hop, r&b and reggae faves. songs you love to sing too. so shout out to that awesome pilipina (i think) Dj that played last thursday night. \n\nno.3: drinks are decently priced and they accept debit cards so u don't  need to worry about spending your emergency cab money on drinks\n\nno.4: the crowd was \"diverse\" (as much as it can get in the mission) and I like that there were mixes of people of color and the awkward looking white guy in a green michigan tshirt dancing by himself -  everyone can have fun.  I can bring a multicultural group of friends and no one should feel out of place. big PLUS.... i guess some folks can't stand really \"ghetto\" scenes. ARGGGGGGH.....", "author": "Antoinnae C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "I like The Skylark. Cool and hip looking place.  Friendly and kickback crowd. Very diverse crowd here for being in the Mission.  It can get pretty crowded though, but you can always step out for some fresh air.  Cool music, another place that plays lots of ol skool 90's hip hop (big plus for me).  And most important...friendly women who actually give me the time of day.\n\nGood place to go if you're not into the crowded craziness of a nightclub.  No cover charge either.  Good luck though finding parking, if you decide to drive your car here.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-09", "description": "Im not too big on Hyphy no more, but this is the most hipsterish hyphy in the area!! I love it and hate it!! The bartenders are hella dope, know their drinks, and will jump over the bar to slap you if you deserve one! Drink prices are decent, some of the drinks are overpriced while others are pretty cheap! Music will get you going dumb!!!\n\nThe bar itself is nice, I love the dark reds and painted ceilings.. I would go there again mainly because my friends love coming here.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-27", "description": "Great place, great bartenders, dancing, shows, dj's. Cool stuff all and all, bathrooms suck really bad though.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "The spot on Wednesday Nights.  Great music, pretty cool and diverse crowds.  No dress code, sometimes a $5 cover...It's a little grimy, but thats what makes it what it is.  The Mission is always a great spot to barhop different scenes, and really get a chance to experience one of the great atmospheres in San Francisco.  Go outside get a hot dog on the grill with some bacon on that. Skylark is one of the destinations you need to end up if you're a hip hop or reggae head.  Sometimes, you'll even be able to light up a bleeze. OH, and the big deal, Wednesday Nights = $9 for a shot of patron and a corona... fully equipped with limes.. holla at it!", "author": "Antonio C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-31", "description": "Not as fun as it used to be. They play a lot more hiphop now and the crowd has shifted accordingly.  If you aint feelin it, move on.  Lots of other drinking joints around the corner on Valencia \r\n\r\nThumbs UP:  Week nights are better.  DJs still mix it up good.  Sometimes they show soft core porn on the walls \r\nThumbs DOWN:  Past its prime.  Weekends are made for the bridge and tunnel crowd.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-15", "description": "THURSDAY NIGHTS ONLY:\n\nI LOVE THURSDAY NIGHTS HERE!!! i was a regular all summer long till school came back into my life! then the going out every week hype stopped! i try to get in there on thursday now when i can! \n\nMusic: TYCOON STATUS ENT.!!!!!!! Dj Doc and Dj Nyce spinning it all night long! as they say \"From the Bay to L.A\". for reals tho they know what they're doing! old school, new school, bay area, etc they really do play it all!! seriously have me and my girls on the dance floor till the lights come up!\n\nScene: its dark, kinda dingy, metallic glittery sofas, located on 16th an Valencia, i mean it really is a BAR! the crowd is a mix! hipsters, hip-hop heads, hyphy kids, and the regulars!! if you go enough like some of us do you'll start to see this place/dj's kinda have their own following you start to see and run into the same people you met there! \n\nBartenders/Alcohol!!!: drink specials all night long! easy to get a drink at the bar! they know me cause im there so much (idk if thats good or bad) they usually hook up the drinks for me! its usually like a buy 1 get the second one for free! lol or they give me a discount on my tab! so take my advice be like me be friend the bartenders!!!!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-05", "description": "Damn you, Skylark!! Why couldn't you be bigger?  I mean, you got your vibe right, the folks are chill, and the music here is definitely bumpin'!! But, come here on a packed night and it's almost a struggle to even, remotely, enjoy yourself.  \n\nMy advice : Come here early, post up at the bar, get your drank on, & attack the dance floor before the crowd comes.", "author": "gEe C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-27", "description": "Be prepared to dance by yourself.  The quality of men available are less then steller.  But, the music is throwback R & B which was hella cool.  The scene is a little sketch but a girlfriend and I held our own.  Plus there is Panco Villa down the street to grab a snack.  I'd go back if I wanted to get back on touch w/ my ghetto Stockton roots.  \n\nVEggie Friendly: Yes", "author": "ashley l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "I like this bar alot when in general...\nIt can be grimey no doubt but it's a dope bar.\nThey normally have some pretty good DJs and \nthe drinks aren't that bad either\nOverall not bad\nHowever don't be shocked if it's not for you at the same time...", "author": "Rich P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-01", "description": "I do many things that I would not recommend to others.  Some of them are as innocuous as wearing too much gold jewelry, or watching the Hills every single Monday.  Some of them are completely unmentionable and not fit for print.  Somewhere in between the former and the latter is giving my number to a 21 year old hipster at Skylark.  Months ago.  He still calls, despite the fact that I have not answered for, well, months.  Oh, and he gave my number to his friend.  COOL.\n\nWhile I don't always think you can judge a venue by the people that frequent it, in this case, I would have to say that you can.  Frequenting Skylark, like giving your number to a 21 year old, is not something you can do without a dose of shame and regret.  You will ask yourself, \"Why did I go even have to go that route?  How has it benefited me in any way?\"\n\nEnough of that.  Skylark is small, dark, crowded, and the dance floor smells like pee.  Also, full of hipster douches.  I know, I know, I could be describing almost any bar in the Mission!  Isn't that weird how that works???", "author": "Jessi C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-23", "description": "Come on folks, it's a Mission district bar. Good beer selection, and the wine by the glass is better than most high end restaurants, interesting/colorful characters.. and the DJ's kick ass. \nWhat more do you want from a neighborhood bar?", "author": "don l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-24", "description": "I walked into a Mission bar and got teleported to Oakland.\nPros: affordable drinks. Familiar hip-hop. Happy crowd. NO COVER CHARGE.\nCons: feels unexpectedly like Oakland. Don't get me wrong--I like Oakland when I'm there, but my expectations were not set for that type of experience.", "author": "Pete L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "The crowd is less homogeneous than other bars in the Mission, and although I appreciate a bar where I can hear the Smiths, this place plays strictly hip hop. Quality hip hop, too. It's not particularly my scene, but that's what I like about it.", "author": "Alex V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "Went here on a Monday. There was a decent amount of people here there. Dj played good reggae and dance music. Crowd was half hipster and half 'yay area' kids (aka somewhat ghetto). Nice bartenders, nice doormen, no cover, no dress code AND they were playing Scooby Doo on the overhead (definitely a plus). Fun times for a Monday night, I must say.", "author": "S. M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-07-27", "description": "If you like smoking pot on the dance floor with sketchy mission men, this place is for you.", "author": "Vanessa Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-30", "description": "Too much smoke with stoners smoking way more weed than they can handle, evident in their eyes, and place is very small and crowded like sardins.", "author": "Tom T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-24", "description": "Last night I attempted to come here for my friends going away and hip hop night. The door man tried to tell me the ID was not mine when it was obviously my picture and the people that saw him do it stopped me to look at my ID and agreed it was mine. Took me 5 hours in the DMV to get this ID and 3 months in the mail because its the new California design, it has a bear that shows when you shine a light on it, its my ID. I was born female and appear masculine so I am used to being harassed about that and as I got eye contact with this guy in line I knew he was going to mess with me about it. I get there and this door guy, that looks like every guy that harassed me while living in Northern Florida, looks at my ID, smirks then says he's going to have to ask me questions because he doesnt think its me. He references how my weight is different and then told me he's not letting me in because I cant state the address on my ID but i stated everything else. Yea, well Ive moved 4 times in the past year , excuse me if I forgot one of those addresses. A friend of mine showed him my ID and told him it is me and he then stated something about my gender being female on there and how I had facial hair in my picture, which was barely stubble. I can grow facial hair, tons of female born people can grow facial hair, get over it. The picture is not that much different and i put it as my main picture to prove a point.  You are in San Francisco and there are a ton of gender variant appearing people here, get over it, you discriminating against me isnt going to change me. You can act like youre justified but everyone of my friends who came out to talk to me knew this wasnt really about my ID but about the door guys bias against my masculinity. In the end, although i am disappointed that people like this doorman exist and that we cant all just be positive and accepting of others regardless of how they identify but by the judge of their character... I am ok to have not come into your bar that night because on a side note, it smelled strongly of sewage the last time I went there last Thursday night and the beer is too expensive.", "author": "Dean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-08-31", "description": "I don't wear overly tight mini skirts.  I don't let my boobs pop out of my tank tops. And I don't scam on skeezy guys dealing drugs on the dance floor.  Therefore I don't really fit in with 90% of the \"women\"  (if you are under aged are you a woman or are you still a child?!) I saw hanging out in this joint. And good golly this damn place was so hot and the drinks were pretty weak. No no never again for me.", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-25", "description": "I met some people here and they only picked it for the location, none of us had been there before. There's something about this bar that I just don't like but can't quite put my finger on it, it's just kind of creepy.  The torn up seat cushions and cheep ammonia smell didn't help. The beer was kind of skunky. The only reason I'm giving them three starts is because their happy hour lasts till 9.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-04", "description": "Skylark is LOUD, packed with guys and did I mention LOUD?  No thanks.", "author": "phil h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-07", "description": "After hitting Hobsons and feeling the need to get down this place definitely filled the void for some music. The drinks were made just right but how can you really fck up a jager bomb? The over head screens showing cartoons at times and porno at other times made for a great conversation. The dance floor was small but people packed it and just like John Legend says we just don''t care. The crowd is chill and gives off the dive bar lounge kind of feel. I will definitely hit up this venue especially when they have their hip hop nights going on.", "author": "Justin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-09-08", "description": "Lame as fuck - the guys just stand around and stare, it's too loud, gets super crowded, and the music blows.  The only good thing is that they were having specials on Patron.  My inner alcoholic thanks you.", "author": "Max B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-01", "description": "not memorable.. drinks are very weak... if i cant tell there is alcohol in a diet coke drink that is bad!  The music was pretty cool... 90s hip hop.  The crowd was pretty weird... douche bags, ghetto kids, preppies, a few cool people sprinkled in but.. not impressed.. I saw 2 altercations.... I only came here cause everywherelse was too crowded!", "author": "blair k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-10", "description": "Skylark is one of my fav spots. No cover charge EVER. Drink prices are koo. They play rap some r&b oh & Reggea :-). The place is small, kinda wish it was bigger. You dont have to dress to impress. Oh and b4 i forget....smokin Mary Jane's flowers is allowed ;-). Mondays are definately crackin. Not sure bout other days. Saturdays every spot in frisko is. Koo spot.", "author": "Miguel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-26", "description": "So I end up coming here a lot every time I am at the Mission. I'm sad that they don't really make good Tom Collins, nor do some of the bartenders know how to make them at all. =/ I'm sorry but I need my old man drink! But their special Ruby Skylark drink is quite tasty. And they even have pear cider! Great for weaklings like myself. I'm happy for that that at least. And most of the time I have been here, I have enjoyed the music. I do not like Skylark on Saturdays, but I guess I really don't like any of Mission bars on Saturdays, because they're always super packed, sweaty, and sometimes you'll smell miss mary jane (which actually isn't bad, but you know they won't share). On a recent Saturday, there was only like one bartender for a long period of time? What the hell? However, I did go on a Tuesday, on a slow night I liked it a lot. Bartender was super friendly and I was really feeling the music. And I could pee. No bathroom line! Sweet. If you're looking for something chill on a weekday, come here... but if you want to getttt crazy come on Saturdays.", "author": "April D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-18", "description": "Dun doit for me.  Normally, I hear music and I just want to move.  But this dance floor never calls my name.  At Skylark, It's never this shorty's birthday.  I never shake ma ass or show anyone what i'm workin wit.  And I never, never fell like anyone there has a sexy back.  But maybe it's because I can never contemplate fitting me and my big moves on that unappealing dance floor.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-20", "description": "I like to shake my ass, but my ass doesn't like to shake at Skylark.  Too loud, too crowded, and the music is boring.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-28", "description": "Been here once for the night life. It was crowded, it was musty, felt dirty, but it was free. Free alone saves it from getting only one star.", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-04", "description": "Will never go here again!  The bartender is an asshole!  The place accepts cash and credit card, but this guy yells at me for using my credit card and tells me to go to the ATM.  If you only want cash then say cash only or even cash preferred.  But since neither was the case, I'll use my credit card if I want to!\n\nHere's what happened.. When I first got to the bar, I bought a round of drinks with my credit card.  I wasn't planning on buying more drinks, so I did not start a tab.  Later in the evening, when it was close to last call, I bought another round of drinks.  I gave the bartender my credit card to pay.  He looks at it, and says, \"Didn't I run your credit card already?\"  I said yes but I didn't think I was going to buy more drinks.  He proceeds to yell at me saying, \"I asked you earlier if you wanted to start a tab and you closed it.  Do you know what a pain in the ass it is to close a credit card.  Now do you want to leave it open this time?  Because if you're going to close it out, there's an ATM machine right there.  So are you going to leave it open or go to the ATM machine because it's a fucking pain in the ass to close it and I'm not going to run your credit card again!\"\n\nI was so taken aback by getting yelled at that I just said fine, leave it open.  I didn't want to cause a scene, although everyone around me had already heard and thought it was ridiculous.  I was extremely mad, embarrassed, and surprised at the actions of the bartender.  \n\nI did not catch his name, but he was the taller Caucasian guy of the three bartenders there that night.  He was wearing a brown shirt and had short brown hair.  \n\nSo, if you do go here, don't order drinks from this bartender.", "author": "m e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "Quite a small dance floor- always got the tunes jammin'!  some call it ghetto, but whatever, I can always know it is a guaranteed good time!  Only a small single ass bathrooms, so that is for sure not a plus, but the drinks make up for it... Drink on! and pee later!  LOL!", "author": "A. C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-04-18", "description": "Great music to dance to...love the DJ. VERY scary boys...but sometimes you'll find one that's just hanging out in the corner wanting to share his joint with you.", "author": "Tanger T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-04", "description": "LOL.... read all the reviews to this place and then you'll understand right as you walk in. Yes, all the girls get groped and cannot dance by themselves. Luckily, I had some guy friends with me. But these creepy on the prowl dudes do not let up. Even if you reject them 5 times, they do not understand NO I DON'T WANT TO DANCE WITH YOUR SORRY ASS. Be careful though, it's not worth getting in a fight for. Though some loser guy got beat up after the club let out...", "author": "Beth W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-11-12", "description": "Blech.  A narrow bar with a meager attempt at a dance floor in the back to mediocre music.  The worst part, as my friend described it, was the smell: a combination of incense and wet shoes.  Ick.", "author": "Corey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-07", "description": "if you want to add some excitement to your night you should definitely stop by. As I was enjoying a delicious bacon wrapped hot dog, ready to go back inside, a small fight started brewing. The fight quickly turned into a melee and spilled into the middle of 16th. Minutes later four SFPD cars were on the scene and the bar suddenly closed. I guess I missed the stabbing from the previous week...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-14", "description": "Ummm yeah. When you think of the mission you think hipster right(not that I like that). This place is sooooo ghetto. The clientele is full of ghetto people getting beyond nasty on the dance floor. Walking to the bath room through the dance floor I felt like I needed a NC-17 warning. No decorum. I'm not a prude but shit get a room. Sitting down and drinking w/ my friends wasn't bad.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-17", "description": "Friendly staff. Great on off-nights. Strong cocktails. Expect a crowd on weekends. No tude, either way. A neighbor bar.", "author": "Josie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-10-18", "description": "This is where Marina chicks come to slum.  Skip it.  I will say that Steve is a cool dude.", "author": "Thadd L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-13", "description": "Decent divebar... drinks were good, bartender was chill, large crowd going on a Saturday night. The dance floor was pretty packed, but decently under control. Decent tunes, and a mix of sketch and non-sketch people. Oh, and I don't think they charged cover, so that was nice.", "author": "Alissa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-20", "description": "Gnarly gnarly gnarly. My diminutive stocky jewish friend Harry likes it here. This is in spite of the fact that he witnessed a shooting here and blood squirted on him. Damn, that is so hip hop. I'll give it two stars instead of one.", "author": "Nicholas E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-01", "description": "I chose Halloween night to check out this hot spot and there was a long line out the door.  Walked past the front and you can smell the musky funk.  So do I venture in?  Of course.  Bouncers are nice Samoan dudes.  There wasn't a cover nor dress code.  It was a Reggae Monday night.   Headed to the bar, and they had 2 -3 bartenders.  Now this is a proper bartender.  They know each person who came first and last and went in order.  No homie, you waving your $20 ain't gonna get their attention.  1st they're not strippers and 2nd, you'd probably tip them the same anyways.  Asked for two double Jamisons with coke.  It was $18, so hmm, I guess that's about right.  Booths surrounded the walls.  Head to the back and its the dance floor and truly what I call a sauna.  My friends and I could only last 30 minutes at a time before sweating a butt load and having to head to the front door to get some oxygen.  We did this cycle 3x that night.  Now, I'm an OK fan of reggae, but they do it right here.  The DJ booth is small, but they had MCs taking turns and adding funk to the sound.  It pretty much brought the house down.  I would totally go again, but man, I looked like I took a shower when I finally left.  Hair and clothes were all wet. . . Ewwww.  They really need to work on ventilating back there.  Then I'll really be a big fan.  Thanks!", "author": "Janice F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-02-09", "description": "A good place to chill out not including weekends. Try and snag the front booth before it gets too crowded. Their Tuesday night house-breaks party is worth dropping by.", "author": "Nish N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-17", "description": "Wow -- I liked this place a lot more than ya'll.  Maybe it's cuz my first car was a Skylark and it made me kinda nostalgic.  Or I wished that the mermaids on the ceiling would come sit with us on the sparkly silver vinyl benches (which would've been soooo cool in my car -- both the benches and the mermaids...).  I found the service to be quite friendly, and was happy they had Fat Tire on tap.  It did get loud later on when folks started dancing, but you'd expect that on a Saturday night.  Nobody molested me, but I was there with a burly pal of mine, which may have been just the preventive ticket.  (He's single, FYI, ladies...)", "author": "Andi T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-11", "description": "I stopped by this place for a drink on early a Friday night.  It wasn't too crowded yet and the drinks didn't take long to order but somehow my beer  didn't taste very good and I just left most of it standing there as we left.  The one cool thing about this place that night was a guy singing these old school songs, like the theme to \"Married with Children\" which I enjoyed hearing for the first time in years.  His voice was awesome so it was fun to hang out for a bit and listen to him.   Maybe I'll update this review if I ever stop by this place again though I honestly don't see much reason to, I've been to much better bars and have a feeling there are better places in SF to check out next time I'm in town.", "author": "Herman S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-03-02", "description": "I was a fan of Skylark when I first moved into the city, but the more I go there the more I realize that it's more ghetto than ghetto fabulous. The drinks are pretty hit or miss a lot of the time and the crowd ranges from mildly annoying to downright scary at times. It used to be a fun place to hang out for dancing or just for drinks, but it's not on the top of my list these days...", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-28", "description": "Skylark is an old standby - you can count on it for a good, crazy time, either drinking at the bar or dancing in the back.  The crowd is fun, diverse and laid back, and they play a great mix of new and old school hip-hop.  I did get my purse stolen here once, but hey, what did I expect leaving it at the table?  And... it's true that you might run into a few molesters, but they usually can be fended off with an elbow jab or a disapproving look.  I'll have to dissent from the rest - I love this place!", "author": "Elizabeth P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-25", "description": "Skylark offers the finest selection of blinging grills, pushy girls, and grabby hands. I love the music - great for booty shakin'. The dance floor, however, makes me a little claustrophobic and usually is sweaty, crowded, and would be a bad place to be during a fire or earthquake. Yeah, if you are breathing and have a vagina, you WILL be molested.", "author": "Jessa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-10", "description": "This bar is pretty butt. Anyway, looks pretty harmless from the front, but sounds like it's pretty like groping in the back dance area. Anyway, we were in there and out of there pretty quickly.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-14", "description": "players need not apply\nbecause this place is already fully staffed.", "author": "Barney B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-05", "description": "This place gets really crowded on weekends and for some reason the crowd is never that friendly. I like the music they play but it's not worth dealing with the crowds.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-17", "description": "It was super crowded and not the best music. It took forever and a half to get a drink and I later found out they charged my credit card twice! BOO!", "author": "Gladys C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-04", "description": "Always packed and the music is great-- old school hip hop for hours.  I usually end up here at some point if I'm in the Mission.", "author": "Rayna A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-25", "description": "this place should be called DATERAPE. The guys who frequent this spot, with their wannabe gucci creep me out. Every dude there is foaming at the mouth with the \"i want to fuck you \" look. it gets way too cramped,the dj space/\"dancefloor\" is small as hell. grossssss", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-15", "description": "I stumbled in here a while back with some friends.\n\nIt's kinda ghetto. The scene was interesting, a very diverse group. To be honest, there were a lot of people here that were pretty sketchy. Ladies, I wouldn't go here to meet a man. For such a small, narrow space, it was WAY too crowded.\n\nThe music was mostly hip-hop and was pretty good.\n\nI didn't want a drink but a friend of mine did and had a lot of trouble getting it. The crowd was just crazy the night we went.\n\nI don't know about this one...there are so many other bars in the Mission to hang out in that don't smell, aren't as crowded as this place, or as ghetto.\n\nSkip it.", "author": "Nicole R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-05-11", "description": "Slim Shady Saturdays with more normal people outside bumming change, cigs and crack on the corner. The consensus has never been so spot on. Weekends at Skylark are no fun at all. Everytime I hear someone, usually from out of town, call and say \"hey meet me at this bar on sixteenth, hold on, wait a second, oh it's called Skylark,\" I say, \"have a nice night buddy!\" On the plus side, weeknights can be sweet with a good dj.", "author": "Phil M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-03-14", "description": "Pretty good music, but in attempts to dance, be prepared to be hovered over with the hoverers going for grope.  Go with friends, dance with friends, but don't expect to meet a new hottie!  Oh and skip the restroom.", "author": "Natalie E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-04-20", "description": "Used to be a cool space for music and dancing.  Now it's turned into another Blondies.  Totally ghetto with the compliments of grabby thugs.  Great bartenders on Friday night, fun music, (ladies) just steer clear of the dance floor, and you'll be allright.", "author": "Teresa H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-19", "description": "I've been here exactly twice in my life. The first time was in September 2005 and the last time was a couple of nights ago. The one thing I do remember from both visits is dancing. Both times they had popular hip-hop music to dance to, but this last time the dance floor was far emptier. Since I didn't actually drink there, it's hard for me to rate the quality of beverages or bartending. But I enjoyed the music and the fact that there was no cover.", "author": "Donna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-19", "description": "Dancing to \"I Got 5 On It\" has never been more fun!! Perfect place for a late night in the Mission! Little ghetto, cool house music, and mixed crowd.", "author": "Virginia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-27", "description": "I love me some Skylark. Or Skeezy as a few acquaintances like to call this joint.  It's the spot I like to kick it at on Wednesdays, mostly because they play hip hop and because cover charge is $5.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-03", "description": "skylark was EH.\nim not gonna lie, i had HELLA fun here. but i think it was because of my friends.\nDO NOT DANCE BY THE MENS BATHROOM. that shit is RAAAAAANK!!!!!!!!!\n\nit gets super crowded on the dance floor but there is a fan and its itty bitty, but theres a fan. whenever my friends went to get drinks they came back hella fast so im assuming the bartenders were quick.\n\nthe crowd was really good though. everyone was friendly dancing with everyone else. all the jams were good. nothing bad to say.\n\nexcept be careful of the bums that hang out outside. one picked up a shoe from the ground and tried to give it to me....", "author": "A. V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "This is where I end up if nothing else in frisco is crackin and i dont feel like spending any money. Me and my friends will roll through here and bring a bottle in and get a cup with some ice and pour our bacardi in and chill. The music is always good and the crowd is coo, theres a variety. The skylark does not let me down ever. Extra points because the homeless crowd is interesting too. I swear this guy had the best sidewalk sale ever. Me and my friend were posted outside and this guy had this mary poppins like bag and kept bringing item after item out. I swear he had some really cute shit, with tags! So he was entertaining for about 15 minutes, then went back in and danced some more and bounced, i can always count on skylark as a last option for mild entertainment.", "author": "Lorain C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-19", "description": "no cover when i went around 11:30pm. I was wearing a white shirt, guy said its not allowed, told me to take it off and just hold it because I had another shirt underneath.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-19", "description": "expensive drinks & rude staff. ugly crowd (guys wouldn't take no for an answer & lots of petty theft). would not recommend if you want to continue to have fun. the two stars are ONLY because the DJs were on point.", "author": "Christlyn R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-25", "description": "What happened to thursdays in San Francisco?! After leaving empty medjool we stopped here late night on a thursday and it was pretty empty too. Sat comfortably and sucked down some cocktails but the crowd left much to be desired. Nothing really special about this place but I would probably give it another chance if I were in the area.", "author": "Jane K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "By no means am I an expert on bars, but the Skylark has a good vibe to it, if you're looking to dance or chill to some good hip hop or reggae.  The service is cordial and the patrons are cool.  The vibe is almost always welcoming.", "author": "M R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-15", "description": "the skylark is a great bar, one of my favorites.  but then again, that was 2 years ago.  i went back not too long ago and realized that i didn't like this place all that much anymore.\n\nskylark is the first bar i went to in sf, and was with hong/gene/babbs/jimmy/george/etc...\n\n\"here's jimmy's mom! our house, in the middle of the street\" -babbs.\n\nkaren and i went here once, she danced on the bar but hit her head on the hanging lights. the bartender gave her a free shot =)", "author": "Ameer N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-27", "description": "i like that dat bay shit and they play it here............no dress code, no charge, can't beat that................the bathroom is hella far though and gotta walk through the crowd to get there.", "author": "BENADICK F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "I've only gone for Pagode with Grupo da Sete on Sunday evenings, but it's always a great time. Good band, fun crowd (lots of drunk Brazilians), high energy and I think it's free for women before 7:30 (?) It's not expensive, though (?$7?) for a good live band in an intimate atmosphere. The bartender seems to always be the same guy on Sunday nights and he's very friendly and pours 'em strong.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-26", "description": "it was packed on a friday night, there was no cover charge, and the bartenders were awesome. \n\nthis place is definitely a meatmarket, so if you didnt come to hook up bring a bunch of your friends.", "author": "Miz C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "Skylarks not bad, but not great. They have a really long bar but only two people working, so it is not easy getting drinks. They have three door men, I don't know why? The tables are tiny so it is hard to get a good sized group sitting around to drink. The dance floor is small and some how it makes me feel like I am back in middle school. Boys are standing on one side and girls on the other... kinda. It's like the guys are waiting for a chicka to make eye contact with. Who knows, But it creeps me out. The only really good thing about this bar is the danceable hip hop music and the dark lighting so I can avoid  the creepy middle school boys awaiting a chance to make eye contact with me. haha", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "This is just a good little hangout, I always have a good time here.  No dress code, no cover, nice bartenders.  Wednesday nights are the best, good music and no crowds.", "author": "Nanette D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "A lil out of place for the mission, but I think that's why I kinda like it ... Old school to new school hip hop, just my kind of spot! The only minus was fightin the sweatshop to get to the bathroom (sometimes I don't do well with crowds) but other than that, drinks were good (always a +) and the vibe was cool -good for people watching (especially the wood be macks & pimps)-nice!", "author": "Mack M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-05", "description": "great meet-up spot, can get crowded quickly on weekends. best nights to go were Wed or Thurs.", "author": "Joe O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-03-26", "description": "Decent decor, semi cool bartenders, and not much else to write home about. The crowd was kind of eh.... I can't say I\"d make this a regular spot of mine, but might drop by here for the occasional drink. This seems like a good place to start the nite.", "author": "Srinivas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-08", "description": "Okay, I don't always like this place, but I gotta say that Steve is one of the best bartenders in town.  He rocks!!!", "author": "kerry l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-09-30", "description": "honestly, i like the skylark.  you get there early, or on a weekday, and its pretty empty.  the bartenders are nice and they have a decent scothc selection.  the djs can be pretty decent too.\n\nthen, at about 11pm, the place fills up with a mob of straight guys looking to get laid.  and not subtlely either.\n\nso i'd say get there early or not at all", "author": "Steve S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-23", "description": "Come here on a Saturday night if you like hip-hop, hyphy and an \"authentic\" San Francisco crowd. Don't come here if you want to impress an Orange County princess.", "author": "William L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-19", "description": "So it maybe crowded, sweaty and ghetto but some energy brings you back to this spot over and over again. All you yelpers gave it a 1 or 2 but have you asked yourself why you keep going back? It's like a bad habit...Good music if you are in the mood for some old school hip-hop with the occasional top 40's R&B. Alright, alright I met my honey here so it's got special memories for me...either way you gotta check it out just once.", "author": "Kavita S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-27", "description": "Heard & saw a guy get shot across the street from this place. End of story. Ok, \"good drinks,\" but probably better drinks to be found in the city, esp. the mission, or the mish, for all you marina poeple in the mission.", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-28", "description": "Came here last year on a weekday and it was struggling more than Ben Affleck's career.  Me and my ex pretty much comprised the dance floor.  What a difference 300 some odd days makes.  Now, it's got that sweat condensation sheen on the walls from all the gyrating bodies.  It's a task to get to the bathroom in the back of the club; you'd have to be some type of Asian Moses to part the brown sea that is the dance floor.  Other pluses include fast drink service and a hoppin' vibe.  It's nice to hear \"classic\" Hip Hop, considering the choices out there now.  \"I-N-D-E-P-E-N-D-E-N-T do you kno wat that mean mane?\"  I do, it means you suck and I'm surprised you can spell at the 6th grade level, mane.", "author": "Sam N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-01", "description": "aside from the crowd bein a little suburban trashy (more black pants than trucker hats), i don't really know why this place gets such a bad rap.\n\ngood hip hop, no cover, every night.\n\nif it were in the marina, it would be 'amazin'", "author": "Seiji C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "Wednesday night:  Pretty cool spot however it gets really crowded.  They play good music but the dancefloor is stuffy and filled with eh-looking people.  You will catch me either at the bar or outside (if i'm ever there).  Complete sausage fest, which is just how I like it but the guys there are pretty scared aka no game so most interesting people are the bums hangin out outside.  Oh and it's Filipino-fest on WED..it's filipino hipsterville!", "author": "ShayShay G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "one of my favorite bars in the mission. the music here is usually on point. when you get there early they start you out with that good ole 90's r&b and hip hop. gets your night started off right. as more people showing up and the ethanol starts to take effect on your brain the music gets a little bit more  up beat. but 11:30 everybody is up and dancing. it can get a little hot in here but you can just make sure to take off your sweater and get funky with it.  it is a little rough around the edges but they keep a good crowd in with their stricyly enforced dress code. i never really felt like there was going to be a fight in there but then again i don't go very often.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-09", "description": "I liked this place. A real small whole in the the wall with good music and a great crowd. My girls and I walked in dressed to impress and were well received by others patrons in the bar. Everyone was happy and dancing all over the place while others choose to sit and mingle amoung their friends and others. The drink were very strong and loaded with good alcohol. Although it did take a while to get a drink but the atmosphere really distracted me while I was waiting for mines. The only downside were the creeps lurking around the outside area of this place it really made it intimidating for me.", "author": "Carolina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-22", "description": "It's not pretentious, and they usually have decent music playing.  It's kind of been hit or miss the last few times, though.  And last time I went, there were really weird people on the dance floor.  Hmmm...", "author": "Briana M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-19", "description": "went here on a wednesday night for mixtape and the DJ's were off the hook!!  if you're just looking for good music, this is definitely the place to be on a wednesday night.\n\nminus 2 stars because the bartender (hot as she was) took waaaaaay too long to make drinks, and the dance \"floor\" was about the size of my bathroom, and conveniently located right in front of the two restrooms:  so if you had to go, you had to wade through the crowd of drunk dancers who are packed in like sardines.  Also, since the dance floor is soooo conveniently located, if someone um... goes number 2 in one of the restrooms, when the open the door the whole crowd can get a whiff.  classy.  so, i'm kind of confused by skylark:  dance floor's too small for it to really be a club, but the music's too loud for it to really be a lounge.. i don't know.  i'd go again, but not if i had to pay a cover charge.", "author": "asia c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-06", "description": "Its beyond explanation, but I continue to be amused and drawn to the crowd at Skylark.   Some say I flirted with the 'ghetto side' of my inner being growing up and maybe I like to see people coming to the Mission to bump and grind. Decent music and relatively quick service before people come pouring in from Blondies.", "author": "Alicia J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-26", "description": "They have a good dancefloor and they are always playing hip hop most conducive to booty shakin'.  Sometimes it's totally empty, and sometimes it's so crowded you can't breathe or move.  I have fun most of the time and always end up returning to get my dance on.", "author": "Sid D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-03-11", "description": "Am I just getting old or is the Mission no longer the hot spot it once was.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-09", "description": "I've only been to Skylark for its reggae night, which happens every Monday. Hailing from a fairly multi-ethnic city like Chicago, I've been surprisingly hard pressed to find reggae bars that weren't brimming with white folks from Jacksonville Florida donning reggae hats with fake dreads sewn into them, you know, the one's who mistakenly quote Bob Marley, have to give you some hackneyed bro embrace every five minutes and deliriously scream \"Yeahhhh!\" when a particular mood strikes them. Makes the hair on the back of my neck stand on end. Nonetheless I was pleasantly surprised by the authenticity of the reggae the DJ's spun at Skylark. It was roots mon, no UB40 here. The crowd was mixed, grinding hips and by all outward apperances fairly fucking hot. Apart from the strong though average priced drinks there are other elements of Caribbean authencity to enjoy. Though the dancefloor wouldn't allow a jitterbug to cut a rug it's perfect for cozying up to that cutie you saw earlier by the bar. SO buy another drink, give the DJ your request (they're approachable) and skank the night away bredren.", "author": "Charles S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-23", "description": "So I write and write about Skylark. This is my third typed up review I've done. Its so difficult to have a solid opinion about this place so I thought I would lay this one out straight and to the point: \n\nPROS \n\nBest music in the city - tired of KMEL, 949, Beyonce, Usher, and the \"Autotune\" revolution of \"Hip Hop\" music? Come to Skylark. Listen to old school / new school Bay Area music, old school Hip Hop jams, 2pac, Snoop, BIG, etc etc. Real quality Hip Hop, NOT POP. They also have reggae nights which are tight as hell too. \n\nGood crowd: Most people are out to dance, party, have a good time. Read carefully: just because this place displays diversity does not give your pale stale corny white ass the excuse to call it ghetto. Some don't like Buffalo Exchange, vintage flannel shirts and American apperal so stop being so judgemental. \n\nGood experiences: if you went to the wackest bar in the World but could still tell stories about crazy never-forgotten experiences you would love that wack ass bar. Skylark is in no way a wack ass bar. But when you have cool experiences, it makes the spot worth going to. \n\nCONS \n\nHave had mixed experience with the staff. Theres a bartender there who is not only arrogant to a sin but talks to his friends and gives away free drinks on nights where the place is packed with paying customers. Also once yelled at my friend when we decided to write \"0\" as the credit card tip so that we could tip him fat incash. Needless to say, he wasnt tipped at all after. At the end of the night, I explained to him that he received a \"0\" on the credit recipt because he was about to receive a 50% tip \"CASH\" the way most like it. Then I told him he blew it, and gave him a quarter. He took the quarter and threw it \"at me.\" By \"at me\" I mean 10 feet to my left. He proceeded to try to kick us out of the bar (the lights were already on) and we laughed and slowly walked our way out, while the bouncer laughed with us. This experience doesn't cause me to not come here anymore. It actually makes for a good story everytime I'm there. \n\nI will say the female bartender is very friendly, as is the tall white dude. Never had problems with either of those two, very professional, quick service, friendly. \n\nBouncers have ridiculous dress code rules. But it does help keep the place safe. And really thats what its about these days especially when you have a crazy crowd. And the latino dude that bounces there is tight. He does his job well.  \n\nAlso the drinks tend to lack a serious punch. I like to go somewhere else beforehand where they actually put alcohol in my drink and head here afterwords. \n\n\nSo there you have it... the good and the bad of Skylark. Enjoy it for what it is.\n\nGoes from a three to a four for my experiences.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-06", "description": "I'm really hit or miss with this place. If you go at some weird hour on some random day, it's a pretty cool place to hang out. Grab a table, enjoy some reasonable drinks, listen to some tunes. But if you go there at a more \"normal\" hour, or on a Friday/Saturday night, it's a bit too crowded to enjoy anything.", "author": "Jon N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-09", "description": "Maybe it was because we grabbed a booth, or because there were a bunch of us and we didn't really care about anyone else, or because we were drinkin' and enjoyin' and not really carin' but we ended up having a great time here. Music was fine, typical hip hop stuff, good stiff drinks and a good looking bartender who was always ready to feed us more booze...good times!", "author": "Irene F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-11-14", "description": "Small, good DJ, but gets REALLY crowded on weekends.  It's got a very, very small dance floor between the end of the bar and the bathrooms, and the last time I was here, I was so wasted I stopped waiting in line for the ladies room and simply let myself into the men's room instead.  My friend also threw up AT the table we were sitting at, and supposedly I was skanking in a corner, by myself, to hip-hop music.  Clearly, an all around wonderful place.", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-16", "description": "from my blog:\n\nuncanny, common tendency:\n\nwhy must i have an appetite for lebanese-german mutts? \n\n(fyi: arjay's born in ohio, eduardo's born in brazil--both with lebanese\nmothers and fathers of german descent.)\n\nbtw, i wanted to sleep with arjay after meeting and catching up with him tonight at the BEST.DIVE.ON.EARTH: the one and only SKYLARK. \n\n(think: replace the cheap beer with joints at an amherst college SoCo party, with an equally diverse and good-looking crowd who WISHED they were really that cool.)\n\nnew find, new fav; Tunnel Top Bar 2.0.\n\nOH. did i also mention that it felt like a harold and kumar scene at my\nfavorite *joint* everrrrrrrr???\n\n........................and only half a block away. (!!!!!!!!!!!!)", "author": "Geo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-26", "description": "Mojitos! Didn't get to stay there that long...but it looked like a real chill place.", "author": "Anita C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-16", "description": "This place ain't bad.  I go here when I want to go out, drink, and dance a bit without having to dress up.  There's no dress code.... so I like that.  The crowd is alright... not bad.  The line for bathroom is really long though, and kinda gross.  But all in all, not bad.", "author": "suzanne l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-19", "description": "Why does this place only have 3 stars? Everytime I visit home, we always head out to Skylark! I think it's those little coaster napkins with the trivia question that keep me going back. True.. the drinks could stand to be a tad stronger/cheaper, and there could be more (than 1) bathrooms. But the crowd is always friendly and fun. Plus, I spent NYE 2007 here and witnessed a lady pissing on the lamp pole.. how much better does it get?", "author": "Sheena C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-20", "description": "Skylark is an ok bar. The drinks aren't too expensive and the music is usually good. Parking can get hard around here and also the neighborhood isn't the safest but Skylark is full of all types of characters. The bathrooms have great little advertisements on the walls, I was extremely entertained while using it. I can stop in here for a drink to begin the night or end the night but I don't know if I can spend a whole night here. It is what it is.", "author": "D J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-04", "description": "We came by  to check out this bar after dinner at Andalu.  The DJ, Kyle was playing pretty good old school hip hop and rap.  So we hung out here for an hour reminiscencing about the good rap back in the day.  Technically, it was the guys reminicing about the music, I was just listening :)  The crowd was diverse.  With all that said, I'll come back in a heart for a girls night out.", "author": "Jay L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-28", "description": "Kind of random place but it was refreshing to find a place like this. So a few friends were out on a Monday night looking for somewhere to go have a few birthday drinks after dinner and somehow ended up here. We got there around 9:30 or so and there were literally 5 people there (including the bartender), I guess it was reggae night so we decided to stay for a little bit to see how it played out. The bartender was really cool and was very quick to serve us. Somewhere around 10 or 10:30 the place started to fill up with all different types of people (once the reggae music started). I recommend this place for people looking for some good reggae music with interesting people.", "author": "Christina D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-16", "description": "Music is off the hook at this place during the weekends... it's pretty small and can get crowded... Depending on which night you go, you can run into some wierd people as well. But still... great hip hop bumping all night!", "author": "Lucy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "I used to hang out here quite a bit, and before 11 it is empty, and after 11 it is sweaty and crowded. It's got a narrow gauntlet you have to walk down to get to the dance floor.. which means you get pawed out of control. It's one of the few hip hop clubs I know about, I guess, that's why I go there. I have met so many guys here, and most of them were not skeazy, but the skeaze percentage is very high so use your judgement, which can be tough when you're pounding the pabst, which is probably why there are so many guys here.. ah, circular logic!", "author": "Anna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-28", "description": "\"They play a lot more hiphop now and the crowd has shifted accordingly.\" ....so spoken by a previous reviewer.\ntrue that and bring it on!!  skylark is down.  it is my favorite place for kickin it with a small group...low key but always fun. good cheap drinks and you can count on hearing some of those old school hip hop songs that make you go, \"ohhh shit! remember when THIS came out??\"  \n(not going to lie, the first time i went we passed this dirty bum that goes, 'you girls are a long way from the marina, aren't ya?? haha...)", "author": "rachel l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-16", "description": "You can take the girl outta San Jose, but you can't take the San Jose outta the girl!  For those of you who like to get low (low, low, low) like yours truly, this place is hoppin'.  OK, you'll have to mind people groping you as you make your way to the dancefloor.  Just be flattered, and walk tall.  I dig the 'take you back' tracks they mix in with the newer hip hop.", "author": "Lissa J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-27", "description": "It's an alright place to go for a drink, hang out, and dance to some music.  Somehow I ended up here on a Tuesday, and there were a bunch of rowdy college kids who unsuccessfully tried to bust a move on the dance floor.  I think I'm going to avoid coming here on Tuesdays.", "author": "Naomi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "Love this place. The crowd is mixed and the music centers more on good quality hip hop and less of that new crap. If your hungry theres spots all over the place around the area where you can grab something to eat. My favorite at the moment is the taco truck on 16th and Mission ^_^. Oh yeah, to the people saying it's too \"ghetto\", you guys don't have the slightest idea what ghetto is lol, please go back to the marina.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-16", "description": "Definitely a part of theboom-time,  usual suspects Mission scene, Skylark's DJ's are always spinning innovative hip hop and while the drinks are pretty normal, at least you're guaranteed interesting people watching and some comfortable seats at the bar :)\nAlso, not bad for some desi-watching....", "author": "Anjali K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-18", "description": "The Mission is my new favorite area to party and I loved the Skylark.  It is everything I am looking for when I am in the mood to find a one night stand.  Everyone there is hooking up and the drinks are good.  A nice dancing area and booths in the back (although some in near the bathrooms which can suck).  Not pretentious, a good place to just chill.  Also, if you aren't feeling it Blondies is close by.", "author": "Kathleen O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-30", "description": "Went to this spot last night, I'm new to the city and I was very impressed with this bar.  The drinks were stiff as shit and the crowd was very laid back.  I will be frequenting this bar in the near future.", "author": "Eric K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-27", "description": "This bar is so crowded every time I've been.  Still, I usually have a good time here.  They play good music, you can get your grove on.  Interesting crowd too.  Fun place to bar hop to!", "author": "Sarah F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-01", "description": "I have a soft spot in my heart for this bar.  I have no idea why.  I dont think the bartenders are that great, neither is the space.  I think its that I always like the music they are playing and every once in a while you want to be in a very crowded VERY dark place trying to dance.", "author": "b s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-09", "description": "Ok. This bar has been inoffensive, given me the alcohol I wanted, and has sometimes been less crowded than the other 16th st locations.  I don't know that I have any good experiences to relate, other than I got seats.  But I haven't had a bad experience yet.", "author": "Heidi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-12", "description": "This is my favorite neighborhood bar. I have a great time every time I come here! The DJ's are always spinning something danceable and there is actually a dance floor. The bartenders are real professionals.\n\nLove this place!", "author": "Crystal G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-22", "description": "Great place to dance to hip-hop music, although the dance floor can be cramped at peak hours.  What's great is that it's FREE to get in because it's a bar, but don't expect much in the way of atmosphere.", "author": "John c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-09", "description": "This place is cool.  We ended up here at 1am on a Monday and still had hella fun!  There was a live DJ who was playing reggae music.  The dance floor was small and I felt like I was hotboxing (I could smell the weed coming off of some people) but that was fine by me- it all goes with the reggae theme right?!  :)  Oh and lastly NO COVER CHARGE!!!!  We didn't even spend a dollar here.  yeahhhhh!", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-24", "description": "i danced with black chicks and they showed me how to pop, drop and lock it.", "author": "Jamie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-01", "description": "Yeah its a lil grimy and yeah the paint is peeling of the roof over the dance floor but this is definitely on the top of my list when it comes to great places to dance (but if your'e one of those people that go to clubs to stand around and be wierd instead of ummm DANCE...then this isnt the place for you)...great music and GREAT DRINKS. There is never a cover...there's lots of seating...its gets way crowded on Wednesday and Saturdays but it feels like a house party and I LOVE IT!! Trust me..I can party with the most pretentious and the most grimy but this is neither... its totally a gem of the Mission...DJay tactics spins every 3rd Saturday and he is by far on of my favorite DJays in the city...always plays those good classic hits and ends it with something grown and sexy that makes you wanna go home and get down and dirty with your man...I love it and for all you boogie pretentious people giving it bad reviews keep doing it...that way it will stay cool..calm...and FUN with that great house party feel...I bet the people giving it 1-2 stars think 15 dollar drinks are the norm too.", "author": "Kokoa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-26", "description": "A previous poster stated \"If you're breathing and have a vagina, you WILL be molested\". I don't know what it is about this place but that vibe is contagious because whenever I'm there...I look for anything that is breathing and has a vagina. Maybe it's the hip hop. Maybe it's the UFC fighter that's buying you shots for no reason. Maybe it's the maryjane floating in the air. Maybe I am just a dog? But this place is indeed a meat market. And I don't mind. What would you prefer: an awkward non-agressive indy boy staring at you from afar or somebody that just walks up to you and tells you what he wants? Well I don't prefer either of those two...I'm not gay...I think....not that there's anything wrong with that...I mean...if that's what you're into. So I like this place. It's the only place that I can think of when out of town friends ask for a bar that plays hip hop. Can anybody else think of one? They play all the old skool classics and even some hyphy shit. The bartenders are great and I think the vibe is...what it is. You know what you're getting. What...did you expect to go to a hip hop bar and not get molested? It's part of hip hop culture to be upfront and forward about your game. It's not subtle. So...it is what it is...and I don't mind it. Come here...it's aight!", "author": "Steve H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-17", "description": "this review if for hip hop/oldschool Wednesdays\n-diggin the music (herb diggs was spinning that night) \n-it was pretty empty at 11pm but got packed by 12am\n-it seems like there are a lot of regulars on wednesdays that stay within their circle of friends & some random one-offs that sit at the bar and stare like they want to talk to you but seem to shy to\n-the bathroom is all the way in the back behind the small dance floor  \n-cool mixed crowd, not pretentious, no dress code, you can where your sneakers, hats, and skull design or Ed Hardy hooded sweatshirt zip-ups (ha ha)\n-never knew this place existed right around the corner of one of my fav tapas restaurants (Ramblas)\n-right next door to Pancho Villa \n-it does get a little sketchy as you walk closer to Mission St, stay upwards towards Guerrero, and you'll be cool (I used to live in the Mission so I'm not as freaked out as some other girls would be that are not familiar with this neighborhood)\n-parking sucks as usual (do not park in the middle lane on Valencia like some folks do, you will get a ticket", "author": "Michelle E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-05-01", "description": "no room to move, too noisy to chat. bumping n grinding too close for comfort. perhaps a less crowded place is not preferable?", "author": "Hae-Jin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-16", "description": "Came here on a Thursday and LOVED it! No cover and GOOD music. They actually played non-commercial hip-hop which was refreshing. Loved the laid back vibe. Bartender was nice and didn't take no more than 2 minutes to get my drink. Bouncer in the front was chill too.", "author": "Ro F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-09", "description": "So if you go here make sure you are wearing neutral colors i.e. pink and orange maybe...no joke...I saw a guy get the shit kicked out of him while my friends and I sat in the booth by the window. The guy was getting kicked in the head...that shit was crazy...but even crazier homeboy got up like nothing happened and went on about his \"bidness\"...True to form I believe in 2nd chances and went back another time with a group of friends that are a bit more open-minded. It was a saturday night and they had an in house DJ...he had VINYL so I was expecting to hear sumtin sumtin...no the VINYL was all for show that dude was wiggity wiggity whack as f**k. But we danced...and the guys...look I love urban gentlemen...really I dont mind a fellow with some street creds BUT when we are dancing and your ridiculous HIGH is affecting my sobriety then we finna have issues boo...yeah not sooo much...so yeah its really a 2 and a half but I will be kinda nice...u need to revamp your spot people.", "author": "Yolanda O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "i do love the vibe at skylark. i've been here on a saturday AND wednesday night. and wednesday was pretty crackin!! the crowd was super chill, no ghetto-ness present. just a bunch of folks just dancing and drinking. all love here. the bartenders are nice. the doormen are cool. no cover. slight dresscode for the boys. most definitely not for 21 yo beginners. parking is kind of hard. and it is near the mission. so please come in groups. oh yeah the djays on wednesdays are cool.", "author": "Maureen M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-18", "description": "about the worst bar I've ever been too...nasty bathrooms, scummy people, horrible music, weak and expensive drinks...I saw the well alcohol they were using and it was VERY lowshelf...they musta went to the basement to get that swill....AND maybe the worst bartenders in the city on top of all that...stay far away, very far away....I could go on and on with amazing stories of rude bartending and the like but you get the point.", "author": "Adrian H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-22", "description": "not too shabby and I like things that are reggae related .. what can I say", "author": "Jill W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-03", "description": "$4 jager-bombs. hip-hop on blast (hip-hop hooray!) . mixed crowd (diversity is a good thing folks)", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-16", "description": "the female bartender that comes to amber bar is hot. :)", "author": "Pickle R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-19", "description": "So this place kinda shocked me. While I was expecting to have a great time, I had a totally different great time than I was anticipating. I thought - oh...this bar is kinda funny. I should get a lot of good laughs and funny stories from this bar. BUT I DIDN'T!! I was shocked. The bartender was this early 30's number with a weave, who (sorry!) looked like a total bitch...and she actually was REALLY nice, very friendly, and I felt like the bitch for thinking she was gonna be the bitch. But she was great...I forgot her name though. The service was fairly quick, as long as you weren't obnoxious - which I appreciate. If you're a tool flashing your wad of rubber banded bills at the bar or if you're yelling \"sweetie! over here!\" to the bartender, then you're ignored. I also expected things to be over priced, and they weren't! $40 for 3 shots of shelf, 3 beers and 2 mixed drinks with shelf. That's super decent! The music was cool. It was a cool mix of people - ranging from people who clearly left work late and needed somewhere to kick off thier night to girls that left work early to hit up forever 21 to get the latest jewel toned shirt she could yank down long enough to \"make\" a dress to people (like me and my friends) that were just tired of sitting in the dark confines of The Attic. So yeah, I recommend it. I've heard from friends and a couple folks that night that the DJ on Wednesday night is amazing. Makes crossing the bridge worth while on a Friday night.", "author": "Chia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-12", "description": "This place is just what it appears to be.  It's sort of divey and unremarkable, but sometimes that's just what you want.  The crowd on a Saturday night seemed to include a lot of slick-haired guys and scantily-clad girls.  There's music and a dance floor that gets increasingly sticky as the night progresses, but there are also plenty of tables if you just want to relax.", "author": "S P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-11", "description": "Kind of an average bar with loud music and dark lights.  Nothing too special.", "author": "Saikat C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-05", "description": "I like this place.  It's a dope little hip hop spot in the Mission.  It's hella small and can get packed on a Saturday night.  The bartenders were okay, there was a dumb guy that bartended there that we always made fun of.  They play pretty good music.  The dancefloor is crowded and HOT.  and every single time I go there, there's this nasty hispanic guy grabbing girls' asses and vaginas.  I know it's the same guy every time.  be careful!", "author": "Charlene R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-07", "description": "drinks are decently priced here, good vibe, friendly crowd.  the music was okay, but not memorable.  great and convenient location though!", "author": "Robyn F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-14", "description": "Three Stars for the bar specials and No Dress code. Juan and Juan is a must (shot of patron& Corona) for $11 i was on these all nite. The spot is a lil ghetto but its the mission!! The only negative was that on thursdays they dont play hip hop, mainly rock  and some reggae. Once your drunk the music is the  last thing on your mind.", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "i like this place.  i like that it is a bar but that it also has a dance floor. not too many in the city like that.  i'm not really a \"club\" person but after a few cocktails i suddenly get the urge to dance. i also like the fact that its pretty much only hip hop music, cuz i hate techno. and i always have a good time here.  why not five stars? the lone bathroom. and the bathroom line that starts to get in my way on the dance floor.", "author": "Ms. M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-12", "description": "the place is filled with jerks.  people steal your shit if you leave it around. they stole my jacket on a wednesday.. who does that??/       the guy at the door will gladly take my 5 dollars to get me in there... but acts like he doesnt speak english when i tell him someone stole my jacket.  \n\nif anyone sees anyone in a dark blue lettermen jacket with MY NAME on it... LALO MORALES... please have them return it to me. laloadrianmorales@gmail.com", "author": "lalo m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "just went here last weekend (Saturday) for a quick start to the night.  the music was on point, it was mostly all hip hop.  props to the DJ for the beats", "author": "Richard L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-20", "description": "This ia always a stop when I am in the Mission, but just a STOP.  It can get real crowded.  I didn't like how the bouncers reacted to a drunk idiot who pushed my friend.  A guy puching a girl doesn't get kicked out here.  After that I told myself I am never going back if that's how they run their business,  but I found myself there again.  It's okay, not a fav, but usually good music, especially Mondays w/ reggae, but fri and sat nights sometimes draw a less desirable crowd.", "author": "E G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-06", "description": "I love this place. Great music (Kyle the DJ), great bartenders, awesome crowd. It used to be that it could get violent sometimes but most of that MS13 crowd is gone now since they ripped beat the crap out of some dude and started a brawl a while back. Now its cool and hip hop hyphe.", "author": "P C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-28", "description": "honestly i don't know why I keep coming back here...there's nothing special about it and is almost always mostly to completely empty when I've been.  but it's sort of dark and inviting in a grimy way..a good place to get your first drink on the way out to some other bars in the mission area.", "author": "jozilla w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "mixtape muthafuckin wednesday!!!!!!! if you haven't been yet check it out. drink specials, great dj's. my favorite night of the week. now on to the bartenders. prolly some of the best bartenders around. they know how to handle the busy sometimes shithead crowd. go in tip big and have some fun!", "author": "Ausewaldoe J."}
