{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "Tony knows what he's doing! I came here for a workday lunch and it was one of the best slices I've had in the Bay. I had the tomato and cheese pie for $5.50. It was massive, with a good crust (not as crisp as I'd like, but you can't have it all), a generous helping of fresh mozzarella, rich tangy tomato sauce, and fresh chiffonaded basil. Even though this looked like a rather plain pie, it was saucy and gooey and everything you want in a slice. The crust, though it could have been crispier, did have a great bready flavor. I drizzled some of Tony's red pepper olive oil over the top, which added a nice touch. \n\nThe regular cheese slice looked good, but extremely greasy and cheesy-- I wasn't ready for that stomach bomb, and I'd only recommend it to those ready for an extreme cheese experience. But I can wholeheartedly vouch for the  tomato and cheese pie. Great lunch with fast service and a reasonable price point.", "author": "Bhiravi R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-10", "description": "Located near AT&T park is Slice House. \n\nTried the :\nSicilian-  I'd pass on this next time. Just not very tasty all members of our group agreed.\n\nWiseguy- Housemade Italian Sausage & Calabrese Link Sausage, Tomato Sauce, Ricotta, Hot Pepper Oil, Pepperoni, Mozzarella, Green Onion. The definite winner compared to the Sicilian at least.\n\nService was friendly, they have a flat screen on the first floor would be nice if they also had flat screens on the second floor of the venue for sports fans. \n\nAll in all a nice venue for a pizza near the ballpark.\n\n\nIf you like my reviews, consider \"following\" my profile for reviews all across the SF Bay Area . Why \"follow\" someone?  It causes the person you follow's reviews to tier to top when you pull up a business. I find this very handy when researching venues. \n\nRod's Review grading scale explained. Essentially I personally base it on the likelihood of a return visit and I try to be stingy with 5 star reviews since they should be \"special\" in my eyes. Price/Value also play a role obviously but there are $ and $$$$ littered across my grading scale. \n\n5 stars - \"I'll go out of my way\" (approx 6 % of my reviews)  4 stars- \"If I was in the area I'd go here and would recommend\", (approx 38% of my reviews)  3 stars \"Maybe if was nearby\", (approx 37% of my reviews) 2 stars -\"Would likely not return, Only if you want to go\", (approx 16% of my reviews)  1 star -\"No thanks, even if I was hungry\", (approx. 3 % of my reviews)", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Best pizza near AT&T hands down.  The mozzarella cheese is of highest quality, and the other ingredients wow, great quality, super busy before and after games, expensive (but the quality), pizza lovers dream, and location.\n\nHighest quality ingredients, great location, clean , a little expensive, super busy at times,  but what do you expect , people love the pizza! Will definitely be grabbing another slice next time I'm at AT&T!", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "It was a pleasant surprise to run into the Slice House a block away from AT&T Park. The slices are so delicious because it's done by the King of Bay Area Pizza Tony. \nInside the slice house was spacious and very comfortable. I had the Sicilian and it was good.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Best by the slice pizza place in the Bay Area. I've only tried the cheese and pepperoni pizza and the cheese slice is the clear winner. $5ish per slice and it is huge. This is the closest to authentic New York pizza I've had outside of New York. Come here if you want the most deliciously amazing thin slice cheap pizza!", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Sweet Grandma!!! More like sweet Jesus this pizza is so good. I thoroughly enjoy each time I go to slice house because their pizza is delicious. I honestly can't speak for every kind of pizza, I've only had their sweet grandma and a few others. Let me just rave about their sweet grandma because it's a personal favorite-- It's very tasty with the right amount of toppings and flavor. I personally crave this and there's no where else to go for it other than slice house (which also has a location at the market on Van Ness). Thank you for fulfilling my cravings! Sweet grandma you are much appreciated!", "author": "Anne A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "This was the lunch spot for me and my coworkers.\n\nPizza was our little treat whenever we got stressed out with work. Single slices were huge! There was always grease pooling in my pepperoni slices but I didn't mind. Pizza has grease, get over it and dab a napkin on it.\n\nGood place for pizza if you're near AT&T Park", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-15", "description": "Slice House is a decent stop to grab a nice slice of pizza or two to enjoy!\n\nThe restaurant is what one might expect from a pizza establishment, with some sort of sports game playing in the TV. They also serve salads, pastas, sandwiches, and other items other than pizza. \n\nI came here with two coworkers on an early Thursday afternoon to grab some lunch. I got a slice of their tomato pie and pepperoni pizzas. The slices go for ~$6 each and are very large. They give a separate to-go box for every slice you order. I found the pizza too be fairly average with nothing bad about it and nothing extraordinary either. It's just some good ol' classic pizza that one can't go wrong with.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "I am a pizza  lover! Lover!!!! Coming here just melted my inner food goblins heart! I ordered the Grandma, fresh Moz, basil, tomato on thick crust! I could have gone for a second! I will be back as soon to try each and everything they have to offer! It's located right next to the ball park so it can also be great before or after games!", "author": "Julianne O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "The combo special for $10, including a salad, slice and soda is a great deal in the City!", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "Nice little pizza place up the street from AT&T park here in San Francisco. I got 2 slices of pizza. The pepperoni slice was very greasy but good. I liked my second slice better which was a cheese with basil. That was alot less greasy then the pepperoni. \n  A whole pizza is probably better because it's made after you order it while the slices are heated again in the oven.", "author": "Heath R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "This is a nice intimate place to go to for some pizza slices & pasta when you're in the city and catching a game or concert at AT&T Park.\n\nThey do have Happy Hour from Monday to Friday from 3pm-6pm, but not when there's a Giants home game. They do have a Yelp check-in, which is a free soda when you check-in. They also have a Loyalty Card, which you will get a free slice on your 10th visit there. \n\nI really do like their food and their portions & prices are decent.  The only problem is that their food availabilities are a hit & miss. Sometime they may or may not have the slices that you want, and sometimes they may not be making the pasta that you want. Also, they only make pasta in the evenings; but there was another time when I arrived at 9pm, but they said that they stopped making pasta for the day, even though they don't even closed until 10pm. \n\nI like them, but the availability of their food is not always reliable. You won't know what you'll be able to get until you get there.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Happened to be in the area for the giants game this afternoon, kids were hungry so we stopped for pizza . For it being noon the Line wasn't bad at all. The man running the register is a real nice guy believe his name is Sean , he was knocking orders out and serving drinks. Helped the kids pick a slice after answering a million questions about all the different toppings. \nThe kids and i were amazed how big the slices were . \nI'm my opinion it has to be the best pizza in the city . Can't wait till my next visit .", "author": "Nick C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "Don't come here during game time (or probably ever.)\n\nHere on a Tuesday night to support the neighborhood. Place was full because the game was going nearby. \n\nThe line to take the money was 3 minutes. Then waited 25 minutes for a slice of pizza, would have been longer if I didn't ask for it cold to take home. \n\nI told the guy (looks like the manager), \"it's been 20 minutes man\", his response was \"do you see how many people are here? You should have known this when you walked in.\" Apparently it's okay to wait that long for pizza and tell your customers off. \n\nIf I hadn't paid already I'd be out much earlier and do the hot dog carts across the street.", "author": "Eusden S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The nieces were hangry after walking around AT&T Park. Stopped in for a slice since it is only a couple blocks up. \n\nKids got cheese slices and we got the slice of the day. The slices are huge and delicious! Way better than I expected. \n\nService was fast and the pizza came out piping hot. Highly recommend this place if you're in the area and want a quick bite.", "author": "Jeanette H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-13", "description": "I was walking in SOMA and there were a couple of folks who passed me carrying pizza boxes which smelled great. Turns out they were coming from Slice. Really good pizza and less busy than Sajj. Try it!", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-16", "description": "Nothing crazy special but solid pizza that beats out a lot of pretty meh SoMA pizza joints. There's a lot of pretty sub-par pizza places here in SF that charge market rate. It's pretty easy to get a greasy slice of disappointment here (looking at you Extreme Pizza). Slices run $5-6 which is pretty okay in my book considering they're huge. I forget what it's called (the grandma?) but the one that's tomato sauce, mozzarella and basil is one of my favs. I recommend eating it at soon as you get it because once the cheese cools it's nowhere near as good. \n\nTip: don't try to order on grubhub/yelp or any other pick up service here. Not only does there not appear to be a separate line to pick up, but last time I tried they didn't have my order. I got charged for it, but the cashier just said, \"yeah I don't see anything on here. We must not have accepted it.\" Pretty sure they did. I was charged for it anyway... Regardless, ordering ahead won't save you any time since you'll have to wait in line anyway.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Pizza and pasta on point!!! I've been to slice house twice and the pasta, omg, has been consistently delicious. The pasta itself tastes freshly home made and mixed with the a perfect amount of sauce. It's thick pasta, not the typical ones you'd make at home. Add some meat (highly recommend the chorizo) and there you have a perfect bowl of pasta! \n\nI also loved the Margherita pizza. Slices are huge! So one slice is enough for a meal. If you end up with someone leftover, rather than heating it in the oven, put the slice on a pan over low heat - and you will have a thin, crunchy slice of leftover pizza! Yum yum!", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-08", "description": "Came here for a quick bite with my friends prior to the Lady Gaga concert right across the street at AT&T park. We were in a rush since we saw the long lines to get in across the street, so instead of eating in we opted for takeout. \n\nTo make things faster, we all ordered by the slice from their display case as the pizza was already pre-made. I ordered a slice of the Sicilian ($6). My friends and I stood around waiting for our orders, and everyone got their order fairly quickly....except me. I looked at the time stamps of my pictures and I waited around 15 minutes for my to-go order. It was honestly a bit ridiculous, especially since the slice was already pre-made in the stand. My friends all ordered one right after another, so we were all really confused why my slice alone was taking so long.\n\nAfter a while we went up to one of the servers and asked him about my order, and when he checked in with the rest of the folks behind the counter, it seemed like they had forgotten my order. What a bummer!\n\nBecause we waited so long for my pizza, we ended up stuffing our faces outside on a bench and didn't really have time to slowly savor the food =/ I remember it being all right but nothing particularly memorable.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "The one true pizza.\nI LOVE this place.  The pizza is SO good. I'm from New York so I'd like to say that I've had my fair share of pizza, but this place takes the cake (pie?). \nThe sauce is good, the ratio is good, the crust is amazing.  They also serve alcohol. What more can you ask for?\nI recommend the Wise Guy. The ricotta on it acts as the perfect foil for all the strong meaty tastes. Yum!\nA specialty pie will run you ~24 but it's definitely enough for a filling dinner for two.\nOverall, I 100% recommend this place and go whenever I'm in the area. \n\nP.S. If you're the cashier I had that weird \"how do you sell your wine? By the cup?\" conversation and then served me wine in a cup, I'm sorry!! I had a massive brain fart and my boyfriend won't stop making fun of me now. :P", "author": "Amy X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Got tickets to go see a Giants game, so pizza was going to be in my plans.  Saw this fine eatery on yelp and the pictures did it Justice! My kid and I ordered the Sicilian, the Tomato Basil  and the Monster Meat slices with a side of Meatballs.  SOOOO Good!  Man, I am not kidding.  The sauce on the meatballs and the pizza was terrific and the cheese was top quality as it melted so generously.  Yes, there was a line.  Yes there were only stools in the upstairs loft.  But when I was eating, I forgot about all these little setbacks.  The food totally overcame any small negatives!  Great job slices!", "author": "Javier L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-21", "description": "I made the mistake of trying to come here again on Friday night because I had a friend visiting from out of town that really wanted pizza.  I showed up before 9 pm on Friday night, and again the place was closed.  I have no idea when this place is open.  I made the mistake of assuming that because the Giants were playing a home night game, that it would be open at least until 9pm on Friday night.  But nope, I was wrong again. \n\nThe reality is that the pizza here is great but management is mediocre at best, and the service and inconsistent hours reflect that.  This place has the feel, and I can tell from interacting with the staff for years now, that going out at night is more important than having an open store to serve customers.  It's not a big deal at all, but I still won't come back to this location again.  I wish Tony would step in a bring some respectability back to his name.", "author": "Chimichanga C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "First visit here \n\nReview: pizza is good but wayyyyyyyyy to greasy my pizza was soaked in grease so much I couldn't even finish it! Pizza slices are huge cute ambience \n\nCustomer service: ? \n\nConclusion: I won't visit this location again but maybe another location might be better! I really want to like this place the pizzas look so good and have good flavor but please lay off the grease your gonna kill somebody", "author": "Sac M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Took these guys a minute to hit their stride here on Second Street but they have settled in and are now a great addition to the neighborhood.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-25", "description": "We happened upon Slice House by happenstance after one of those Sunday rooftop events at the nearby Hotel VIA.  We got hungry and started walking around looking for anything that was open. That area closes early on Sundays, but they were still serving and we loved it!  They did run out of their Bourbon wings and another type of pizza dough that night so we just ordered some meatballs and a pizza to share. \nThey serve some nice beers on draft.  \nWe sat upstairs and watched whatever baseball game was on that night. Was an awesome pizza experience and I highly recommend you try them!\nYou also get a free soda upon check in!  Or at least I did btw.", "author": "Aureliano C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "After complaining and refusing to eat pizza in San Francisco for months (because its not as good as NY) I finally decided to give it a try and I was not disappointed. I ordered take out from Slice House 3 weeks ago and have been hooked ever since. \n\nI ordered 1 slice of Peperoni and Sausage- which was AMAZING. they actually season the meat before cooking it. It's amazing what a little bit of season can do to a pizza. \n\nI also got 1 slice of plain cheese which I wasnt crazy about, since it was a little bland. But probably perfect for children with less exotic taste buds.\n\nIn addition to the pizza I got meat balls which were super tasty. the only thing that could have made the meatballs better was if they added a small scoop of ricotta cheese to the top. Nonetheless they were super fresh and perfectly seasoned/cooked.\n\nEver since then, my boyfriend has gotten take out twice. He is totally hooked.", "author": "Tati C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "We came with a group of 30 people. Sean was awesome with getting us taken care of on the 2nd floor. The wait staff was great as well! Highly recommend the slice house, the pizza was amazing!", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Great place to grab a slice and beer!  Staff is knowledgeable and the food is well prepared and top notch ingredients.  Walked in after a Giants game and it was empty ( i know bad season! ) but the crew was patient and on spot.  The fried chicken slice was a hit but the deep dish did not impress...\nFantastic beer selection", "author": "Aaron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Maybe you're starving on the way to the Giants game?  \n\nWell no matter.  Now you don't have to wait until you get to the actual ballpark.  You can hit the Slice House on 2nd Street first.\n\nIt's kinda perfect.\n\nSince Tony now has 8 restaurants (maybe more...another one could have opened up while I'm writing this for chrisakes) in SF alone, not forgetting that he's inside AT&T Park now, & not to mention the one at Graton Casino, or the one in Las Vegas...he is clearly doing something very right.  \n\nAnd I certainly tasted that today.  I went for the \"slice of the day,\" & it was fantastic.  Italian sausage, bacon, green onion, & 3 cheeses...on a Holy Craft Beer crust.  One of the best slices that I've had...\n\n...since the last time I had a slice at another Tony's Slice House (in north beach).\n\nThis particular location has more seating than NB, but it also has more of a beer pub kind of feel.  I've only come in for this quick lunch, but the vibe is very eat & go.  Not a venue for lingering.\n\nYou've got a Giants game to get to anyway, right?\n\nA supreme slice.\n\n4 & 1/2 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Love that you can get just a slice of pizza and the options are amazing!! The crust was super soft yet crunchy all at the same time and super flavorful!! Love that when you order a piece they then put it in their oven and warm it up so its ooey gooey!! Great spot for a quick bite before or after a baseball game; or take a slice in with you!!", "author": "Marie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-07", "description": "Mama mia! Delizioso! One of my fave pizza places in the city, it's solid! I have a weakness for Sicilian pizza, and not many places in the city have it, let alone make it well! My favorite slice to date is the Sicilian. For a slice, it's about $6, but it's a hefty piece!\n\nIf you don't like the thickness of the Sicilian crust, you can opt for one of their regular triangle slices, which are just as good! The best regular pizza I had from them had pepperoni, sausage, ricotta (YUM), and green onion, it was the slice of the day!\n\nAs for other options, I've tried the meatballs, which are okay. And I love their beer they have on tap!\n\nThey have pretty good happy hour specials on slices and beer, but they don't count during Giants games, which is usually the only reason I'm in that area.", "author": "Eva C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "I think outside of New York, San Francisco​ has mastered the ​pizza game.  The lunch deal with a slice plus salad and a drink is a pretty good deal, and this pizza is fantastic. Big, fresh slices with a nice crispy crust and great toppings. They've got a wide variety ranging from regular cheese to Sicilian​ slices. I went with a standard pepperoni and was not disappointed.", "author": "Ralph B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-02", "description": "Yum. Delicious pizza by the slice. Easy to pick up and walk home with and we occasionally order a whole pie or eat there. Love the crust love the pepperoni. Big slices just like you get in NYC. Just wish they were open 7 days a week but I get it in this neighborhood most places cater to the lunch crowd/9-5ers. But for those of us who live in this neighborhood we are just happy to have another spot with something good to eat. Ask for a punch card!", "author": "Michaela M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "If you read my reviews you know that, as a Brooklynite, I am pizza-obsessed. Since I first stumbled across Arinell's in the mission over 20 years ago, I've sought out new slice joints that can help satisfy my noon-time fix for the world's most perfect food.\n\nSo, when my best friend told me they opened up at NY slice-style joint across the street from this apartment by the ballpark, I was intrigued.  Finally, last week we got the opportunity to check it out on our way to the Lady Gaga concert at PacBell.\n\nIt was about 5:30PM and the line was out the door and down the street - a good sign and a bad sign since we needed to get to the concert (didn't want the girls to miss anything..). What happened next was pretty amazing to me.\n\nFirst, the line just zipped along, even though the place was packed and pies were flying around like frisbees on silver platters. Within about 10 minutes it was our turn to order - and since this was my first visit I opted for the standard of all pizzas - pepperoni (note: in NYC proper, most true pizza lovers would say a cheese slice is the standard, but we have lived in CA for quite some time now so basic toppings are acceptable). We also ordered a salad and drinks.\n\nWell, the fast-serve style of order-at-the-counter-and-we'll-deliver-to-your-table really works in a place like this. We hardly got settled when bada-bam the salad shows up followed by bada-bing the pizza arrives, steaming and with that really inviting pizza aroma... mmmm. taste buds waiting...\n\nIt was REALLY good. Better than a lot of more expensive pies I've had in SF and elsewhere... including Brooklyn. In fact, one of our girls (who had eaten before we left for the concert and swore she wasn't hungry) took one look at that pie and grabbed a slice to scarf down.  The large pie was enough for the six of use, a slice each plus salad and drink, and we were out of there way before Gaga set foot on stage.\n\nAll in all, I can't wait to get back there - and now I understand they have a place inside the ballpark! Ready for my next slice at the Giants game tomorrow!", "author": "Mike K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Big and delicious slices. I usually get one pepperoni and one of something else... a tomato pie slice (like plain cheese but a bit fancier) or a daily special (love it when they have chicken parm slices!) to mix it up. There's a small but good selection of beers on tap. Hard to avoid the temptation when out for lunch.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Fantastic pizza. I have ordered whole pies and picked up a slice and both ways were highly satisfying. Tony uses smaller more abundant pepperoni that curl up and pop with greasy spicy deliciousness. A slice will run ya just shy of $6 but they are BIG and definitely much closer to two slices than one. A whole pizza is fairly priced for the quality and the crust occupies that perfect place in between a Neapolitan and thick crust where it's doughy and firm but still a little crisp. \n\nThe grandma's thick cut slice is also delicious with fresh mozzarella, basil, and tomato, like a super hearty margarita a top of fluffy full flavored focaccia bread with a slight olive oil slick. It's also worth noting they serve one of the best Caesar salads I've have with a thick robust fishy dressing and whole anchovies on top. Wonderful.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "My wife and I live next door and we seem to stop by Slice House about 1x per week.  Amazing pizza.  I usually get the Sicilian and a slice of the day (whatever it is).  plus they sometimes do this pizza with a chicken parm thing on top that is amazing.  \n\nthey also serve beers, which is nice.", "author": "Eric P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "The pizza here is ok. Like that they have options. Regular slices, Sicilian slices, gluten free options and other Italian food options. Location is right by the ballpark so a nice option for reasonable priced eats during game day . It is convenient that you can stop by here to just order slices or an entire pizza. As far as the pizza, it's average for me. I preferred their regular slice/thin crust style over the Sicilian style. The regular slice was large but for like $5 it better be. The Sicilian was also a large slice but a little too doughy for my preference. Didn't get to try the other menu items but the meatballs and some of the pasta dishes looked good. Would I go out of my way to get pizza here? No, but if you want a reasonably priced slice with fast service near the ballpark this is the place", "author": "Peter P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "Pizza is fine if a bit greasy and overpriced, kinda like an upscale dominos. My one star is for their pathetic, shameless excuse of a salad that I just got. I was grabbing a slice for dinner and wanted some sort of side to go with it. There's nothing really on the menu in terms of small side options so I figured, oh well, I'll just get this pretty expensive Caesar salad and eat the leftovers tomorrow. Look at my attached photo of this \"salad\". You can say, o but it's a pizza place why would you order a salad. And to that I say fuck off, sometimes I want some greens on the side with my grease bread yknow.\n\nOn the upside, however, I now know the perfect place to get an $8 plastic container of neatly arranged iceberg lettuce leaves with a pile of sad questionable anchovies thrown on top.", "author": "Alina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "I was genuinely surprised at how delicious this pizza was! I came for lunch with my colleagues and boss and wasn't too sure about it. I mean, we eat lots of pizza at the office and it's easy to mess up pizza. \n\nWe came inside and there's benches, stairs and the counter. They have a special of the day along with salads, pasta salads, and your traditional style of pizza.\n\nI'm a bore and always get pepperoni but it was delicious. The red sauce wasn't bitter or sweet. The crust had a soft bite and fluff (not a fan of thin crusts). You order at the counter and they drop it in the oven and bring it to you.\n\nIt's Located a few blocks from ATT park, it's a cool joint to check out before a game. I would definitely go there again.", "author": "Sierra R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "Cool place, tasty pizza (~$5 per slice) and we were able to grab a seat by the window. Fast and friendly service.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-28", "description": "Came here for a bite to eat before a Giants game. \n\nThe pizza slices are big and delicious!! They offer wine, beer, wings and more than just pizza. We sat upstairs and enjoyed chatting, eating, and watching the pre-game show on the televisions around the restaurant.\n\nI will be back!", "author": "Carina M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "My friend and I came here for a quick pizza and beer before going to the giants game. We chose this place because it wasn't as crowded as the other restaurants on the same street. It was busy but not too busy, and we were able to find a seat upstairs without any wait. They had a great combo deal, $8.99 for a slice and beer. The pizza wasn't anything special but it was a great stop before a game!", "author": "Dale D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "My go to spot for a meal before a Giants game. They have good tasting pizza and combos for one person or a large party on game day. It can get crowded but there's two-story seating. The upstairs can get a bit warm when the place is packed otherwise fun spot and quick walk to AT&T Park.", "author": "Mina T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-23", "description": "Best pizza around hands down!\n\nWalked in middle of the day and was greeted by the manager Sean who was super friendly! We had a great chat about the food and SF Giants. Now I know that Slice House has a great pizza/beer deal on game days - hint hint. \n\nYou owe it to yourself to stop by and enjoy some of the great food and atmosphere at least once!", "author": "Adrien S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Awesome fluffy dough. But the pan pizza is vastly different. Would have preferred all the pizza piping hot out of the oven. And had to have them reheat the last couple slices of the pie. But that's not an issue. Phenomenal taste!", "author": "Clifford T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "My new favorite place to eat right by AT&T Park, Slice House offers large pizza slices for a reasonable price.  There are always 4-6 different pies available for slices, from regular cheese & pepperoni to thick squares of Sicilian and their ever-changing slice of the day.  And if you feel you need to have some \"healthy\" food with your pizza, add a salad with the slices.  Our normal order before a game are 2 slices (one each for my wife & myself) and a salad to share.  Each slice is good enough for one person.\n\nI recommend coming here an hour before game time, so you can sit and relax.  There are 2 TVs that are always tuned in to sports stations.  But if you are in a hurry, get your slices to go and walk them into the game.  The Giants have a very fan-friendly policy that allows guests to take in food from the outside (just no alcohol or drinks in metal or glass containers).  Food here will be a lot cheaper (and tastier) than what you can get inside the stadium.\n\nThe staff is also very friendly and helpful.  The food runners move fast to get plates to tables quickly.", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "When talking pizza, the single cheese slice is the \"Gold Standard\".  The 100 yards dash of the pizza business.  The Slice House is a 9.3 on the pizza sale of 1-10. \n(figure skating rating, 10's don't happen).\n\nTony Gemignani is a 12-time World Pizza Champion.  Pizza pies at the \"Slice House\" are made from quality \"00\" flour and cooked to golden perfection.  \n\nAfter talking shop in the \"Slice House\" after eating there multiple times they were even generous enough to offer me some restaurant quality \"00\" four to and make pizza at home. \n\nBut, if you want a quality slice you need to stop by the Slice House as my oven isn't hot enough to bake a quality pie.", "author": "Travis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Um. Wow. Perhaps the best slice of pizza I've ever had in my 24 years of existence. This place gets busy, especially on game day, but they get their orders out pretty quick. I was pleasantly surprised at how delicious every ingredient was; from the dough, to the sauce and all the toppings.. forget about buying food at the game, the slices here are huge and will keep you fully satisfied throughout the entirety of the game!", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Amazing meatball sub. Love that they use garlic bread for the roll. Comes out quick and hot. \n\nPretty bust for lunch and during game days, but really easy to get a table for dinner on a weeknight, as much as I've seen. \n\nEveryone that I've taken there has raved about the pizza, but I've only gotten the meatball sub, so can only comment on that.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-14", "description": "I went in a while back...There were five of us in line to get in at 11:00am, when they're supposed to open. It was 11:18am when I decided to leave; the other people that were in line with me had already left. Too bad they don't adhere to their posted hours. They missed out on business, and those of us with an already short lunch break wasted our time in line for a place that opened whenever they felt like it.", "author": "Yelper F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "My go to pizza spot!  Slice House offer giant slices of pizza or whole pies.  A massive slice of pepperoni pizza will cost you $5.25- perfect for a quick lunch. The Cal Italia whole pie is an award winning pizza- which you must also try.  I absolutely love their Caesar Salad as it comes with fresh parmesan & anchovies.  Their huge meatballs are a steal at 3 for $5.  This spot usually gets crowded when there's a Giants game going on.  \n\nTony Gemignani sure knows how to show the world his amazing talent for making Bomb A$$ Pizza!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Everything you love about Tony's - most importantly the delicious pizza pies, but without the crowds and nary a wait. A total score for SoMa!\n\nYou need to check out the daily specials. Once it was a sausage and kale pie and the other was a chorizo, cauliflower, and kale - both standout slices. Of course you have everyday dependables like a slice of cheese or Grandma pan pizza slice. Happy hour Monday-Friday from 3-5:30pm where full slices are an amazing $4 deal and half slices just $2. An amazing time to try everything including meatballs and chicken wings. Another lesser know fact is that you can get a combo deal at lunch where a slice, which I forgot to mention are really huge, is paired with a salad for under $10. Such a steal! And the mixed greens salad is something I can happily have for lunch sans anything else. Lovely combination of sweet, sour, and savory with the olives, gorgonzola, walnuts, red onion and balsamic redaction. It's an entree sized salad too. \n\nThe best part is you can easily score a seat here compared to other locations. Folks are friendly and deliver your heated slices to you once you order at the counter. I'll happily grab a couple of slices here before heading to AT&T Park.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Some of the best pizza I have ever eaten! Worth the price as it is a huge slice and one is enough to keep you full. You can also get 15% cash back on Groupon.", "author": "Charmaine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Slice House offers a great HH deal on Giants home game nights - only $8.99 for a slice + draft beer!  I came on a Monday night and to my relief it wasn't too packed.  The slices are humongous and regularly $5-6 each.  Yes it's greasy, but admit it, it's tasty and the perfect food to wash down with a cold beer.  It's not Tony's Pizza Napoletana, but it's good and way cheaper!", "author": "Beatrice W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-14", "description": "Chronicle Books was giving out 20% coupons to Slice House during their 80% sale, so I decided to try Slice House. I am trying to not eat too much pizza, so I got the artichoke pasta. It was good and came with slightly dried tomatoes and a cheese I couldn't put a name on. I also got a Boylan ginger ale. With the 20% off, total came to $10. The restaurant has a nice interior and atmosphere with pop rock playing on the speakers.\n\n*Review 1100", "author": "Denise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Had the Sicilian slice and it really filled me up. Super delicious, and on the greasy side. I went in for lunch the next day and tried to order a pasta, but they said they don't do pasta during lunch. :(\n\nSo I got another Sicilian. Lol.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-07", "description": "Just good pizza! Flavorful, great service, clean. See you next time we catch the Giants game!", "author": "Sherri L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-01", "description": "I'm really disappointed. Two evenings in a row we tried to go here and both nights they just decided to close early. Last night, (Wednesday) we got there at 6:30pm and they were closed and tonight (Thursday)  we got there at 7:50pm and they were closed. Tonight there was a note on the door that said they were closed at \"discretion of management\".  None of these closings are consistent with their hours on Yelp or on Google (which by the way, the hours are different on both sites).", "author": "P D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Slice house is great!! Love Tony's pizza so having his pizza closer to me when I don't want to go all the way to SF is awesome.", "author": "Bob R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-14", "description": "Simple and good. Not crazy on flavor. 3.5 I'd say. I came here with a friend of mine that had visited the area and we chose something close by to where he was staying. The girl at the front was really friendly which is always nice, and the workers extremely helpful.\n\nHe had gotten 3 slices of pizza, and an order of wings. I picked up a panik and grandmas slice. The prices were a little higher than used to but for slice places around the city it seemed like it was on par for the most part. The panik didn't wow me to be honest, but the chicken on it had a good flavor and good consistency. Typically if a place uses chicken I worry it turns out a weeeeeeee bit dry but theirs was fine. I like the crust for the grandma the best out of what I ate though I wish I could've added some other toppings to it. Like roasted garlic, basil, or sauteed wild mushrooms would've brought the flavor a step up. But that's just personal preference. I had one of the wings also, it had some sort of bitter flavor at the end that took away from the taste. Not sure what that was from, could've been some type of korean bbq sauce that was used or it was hoisin based. \n\nI'm pretty sure I'd get grandma's again if I came by although I'm not sure I would spend the price point to customize it entirely. We'll see how it goes though if I'm in the area again.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Perfect place to grab a slice of pizza and beer before a Giants game. The location is walking distance from the stadium. They have plenty of seats, but, if there is no room, pizza is portable so you can just take it with you on your walk back. :)", "author": "Nichole M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Chill lunch spot with really gooooood pizza with hearty-sized slices.     \n\nI enjoy the loft area for a little less door traffic from the main entry. \n\nTasty!", "author": "Shawnee J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "My boss and I have our dinner here. The pasta was a good size serving enough for 2 people. It was delicious and tasty.", "author": "Emilia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "My favorite spot to grab a slice of pizza. So good! Wish they delivered. \n\nAlso a great place to eat before or after hitting up the ballpark for a Giants game.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-19", "description": "Was craving pizza on my last day in the City and didn't want to travel too far from the hotel. Hit up yelp and ended up here.  I've seen some reviews say the pizza was undercooked, but that was not my experience. We ordered a full pie, half pepperoni and half cheese and olives.  I'm not an olive person but the olives they use here are green, so if that matters to you then take note.  Aside from that, the place was clean and the pizza was great! I will definitely be back if I'm in the area again.", "author": "Lacey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "This location has 80% of the wonder of Tony's Pizza Napoletana (in North Beach) but without the dreaded wait time. You really can't go wrong here! The service is great at this location too.\n\nGluten free notes: They offer the gluten free whole pizzas here too (no slices). Not as extensive of a menu for choice, but they have all the basics!", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "Walking back from a Giants game and the smell of a delicious slice of pizza from someone walking by brought us in. Pretty cool you can still get it by the slice. It was around $5 for a decent sized slice of cheese. The sauce was delicious and the dough crispy and tasty. It only took a minute to heat it up and we were on our way.", "author": "Francine B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Absolutely awesome pizza place. If you want chill atmosphere & excellent pizza look no further. I'd recommend trying slices as they are huge. The beer selection is solid too and the staff is helpful.\n\nTip: 3 individual slices are the same price as artisan pizza. So if you want something simple, like cheese or pepperoni it's less expensive to get slices... you will get the same amount of pizza.", "author": "Anatoly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "The best pizza in San Francisco. Yummy to both my 8 year old son and to his mama and papa.", "author": "Jonathan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "These guys have a pretty good pizza and beer deal located a few blocks from the AT&T Park. They sure do get a lot of business during baseball games. We heard about the $8.99 pizza and beer deal so we decided to drop by here after the game. Instead of the individual option, we opted for two medium/large pepperoni sized pizzas and two pitchers of beer to be shared among 7 people. The pizza came out in less than 10 minutes and it was so good, especially when you've been drinking and hungry all day. The slices were pretty tiny, so I'm thinking the individual pizza slice with beer would have been a better option. Total came out to around $9.30/person. The selection of beers are not your watered down domestic kinds, I don't know the exact names of the beers but they definitely weren't your typical blue moon, shocktop, bud light, etc type of beers. In the future I would stick to the slice deal since the slice looks huge. The restaurant filled up quickly after we arrived. \n\nI would definitely tell everybody who are going to the Giants game about this place. Such a great deal in comparison to the steep prices at the park!", "author": "Rita K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Great tomato basil pizza. I am from India so this was the best pizza I have ever had in my life. Might not hold true for others :)", "author": "Akshit J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Their website and yelp says they close at 8 PM so we went at 7:20 on a Saturday. The door was locked and nobody opened it even though there were customers and staff inside. Plus no one answered the phone!", "author": "Sweta P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Best pizza I ever ate!! Staff is nice. Going here every week to do something good for myself.", "author": "Leonard J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Every pizza I've tried was good, but my favorites are: the Sicilian since it's pan-style and with pepperoni and sausage; the Wiseguy since it has green onion and hot pepper oil; the Popeye since spinach and Ricotta worked well together.\n\nThe interior remained basically the same since it changed from Ironside. Still cozy with bench seatings or tables for two and more. They have a good selection of beers on tap too!\n\nLocated near AT&T Park, easy to find, decent parking with meters or try some of the nearby alleys for one hour parking. One of the best places for lunch, and likely dinner.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "The pizza was awesome! The staff was so nice even when my kids had changed their minds for drinks! We were out of towners and would definitely come back.", "author": "George P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-20", "description": "This is my go-to neighborhood pizzeria... Not because it's my favorite, but because it's close to my office and pretty much the only (pizza) game in town for a quick-fix meal.\n\nI typically go for the pizza by the slice and a beer.\n\nThe Beer\nThe selection of beers is pretty big... But... I suppose if you're a fan of the typical stuff that you'd find in any grocery store then you'll do fine. Overall, the selection isn't worth writing home about. \n\nThey do have about 4 on tap with the rest in cans and bottles. So if you're looking for beer, there are far better venues in the area.\n\nToday, I opted for a pint of the Zen Sudwerk - One of the better options available. ~$8\n\nThe Pizza\nThe pizza is your garden variety, over-the-top spicy, soggy, greasy, kinda chewy thin crust that requires a fork and knife.\n\nToday's daily special (pepperoni and sausage) was $6 per slice.\n\nAfter tax, $15.23.\n\nIt's certainly not the best, nor the worst. YMMV.", "author": "Caine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "Got the tomato basil slice, and it was AMAZING. Usually, when I get a pizza, it's always lacking in sauce, and if I ask for extra sauce on the side...they give it to me cold (I'm serious...I never get why). But here, they add extra sauce on top (nice and warm, thank you), so problem solved. And guess what guys, the sauce is frekin' delicious. The only thing that concerned me was consistency. Came back another day, and the pizza dough tasted a bit off. Perhaps I was comparing it to the perfect experience before, or it was simply an off-day for them. Whatever it may be, I still ate my slice and left happy. Entire pies are a tad expensive, and an individual slice at $6 can feel hefty - but honestly, a slice is all you need. The atmosphere is nice and lively, and the place is tucked away on a quiet corner of 2nd street. Didn't feel unsafe walking there alone at night. A worthy experience!", "author": "Henna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Pizza is fantastic! Best in the Bay Area and walking distance to AT&T Park.\nGrab a slice and a beer after the next Giant's home game. You won't be disappointed", "author": "Frank P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "Like everyone else, there are some restaurants out there that I absolutely adore.  Places that I'd be willing to endure a longer wait for than others (to a certain point, anyways).  However, despite how much that love extends to Tony's Pizza Napoletana, our hunger simply didn't have the patience to wait two and a half hours for a table.  The alternative?  Literally the next best thing, though not the next door location - Tony's Slice House!  \n\nLocated just a few blocks over from the ballpark, Slice House's location is great - clean, plenty of seating (both upstairs and down), and nearby parking (when there isn't a Giants game).  Most importantly though, the food is nearly just as good.  True, the menu isn't nearly as varied, or extensive, as Tony's Pizza Napoletana's, but I doubt there's any pizza restaurant out there that has a menu as awesome and amazing as theirs.\n\n-- ST. GERMAIN WINGS...$10\n(http://www.yelp.com/biz_photos/slice-house-san-francisco-3?select=quITzUH7D29meYuNMPtuhA)\nI was worried they were going to taste like generic buffalo wings, but, thankfully, they were better than that.  The sauce added a bit of spice and sweetness, yet it didn't overpower the wings.  Also, while each one was decently meaty, at $10 for six pieces, the dish is a little pricey for wings that are decent, but not amazing.\n\n-- CAESAR SALAD...$9\n(http://www.yelp.com/biz_photos/slice-house-san-francisco-3?select=0y8QOS8ecPv2fqK9M5RsSw)\nAlternatively, this starter was much more worthwhile.  The lettuce was crisp and fresh, the dressing had just the right tartness, and the anchovies were delicious (and not drenched in oil).  Funny how pizza joints like Amici's and Slice House do Caesar Salads better than some restaurants.\n\n-- SWEETIE PIE - White Pie, Prosciutto, Arugula, Mozzarella, Formage Blanc, Sweety Drops, Parmigiano...$22\n(http://www.yelp.com/biz_photos/slice-house-san-francisco-3?select=LD56rp1mONR3t1u3oYbkZQ)\nThey're so generous with the toppings!  Especially with the prosciutto and arugula, though perhaps a little heavy on the latter for some (I liked it).  I liked how they didn't skimp on the cheese either, and the white sauce was pretty flavorful.  The crust was a little thick, but it was fine, seeing as how it's Tony's/Slice House does really well with all of their pies.\n\n-- THE WISEGUY - Tomato Sauce, House Made Italian Sausage, Calabrese Link Sausage, Ricotta, Hot Pepper Oil, Natural Case Pepperoni, Mozzarella, Green Onion...$22\n(http://www.yelp.com/biz_photos/slice-house-san-francisco-3?select=GjQr6XQcWZBAQLP2PmZqrQ)\nOf the two we had, this was my clear favorite.  I'm not super high on red sauces, but this one was good.  It helped that the pizza was so meaty and I really liked how juicy the sausages were.  I thought the ricotta would be a little too heavy, but it blended well with the rest of the flavors, especially with the hot pepper oil!\n\nAs far as service goes, it was clear the staff was undermanned when we dropped in for dinner (several tables uncleared, lack of clean utensils at stations), but you could tell they were doing their best while maintaining a friendly demeanor.  Beyond that, the only other semi-downer was how the menu doesn't include Tony's famed Margherita pizza.  For that, I guess I'll just have to wait.\n\nFOUR AND A HALF STARS rounded up.  Not quite as good as Tony's Pizza Napoletana, but considering the lack of wait and quality food, it's worth the extra half star.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "I took a large group of high school students here while chaperoning a field trip. The food was fantastic, even by Tony's standards. Obviously you want to order the pizza, but don't miss the meatballs, which are better than my mom's (who does not know how to yelp).\n\nThe manager made planning the meal super easy. He let us pre-order the pizzas so I could avoid the confusion that comes with 18 high school students attempting to agree on what toppings they want. And while we were there, he treated us like family. \n\nI'll be back many many times!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Best pizza I have ever had. Loved the tomato pie and the Pigman. We also had all 3 pastas and they were simply amazing. Highly recommend!!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Had a groupon for Slice House, so decided to try it out this past Saturday.  I wasn't use to this type of pizza (since I prefer a thin crust new york style), but, it was good.  \n\nPros:\n\n1.) Great parking.  Lots of street parking spots and if you go in the evening, street parking will run you approximately, $1.27 (including transaction fee).\n\n2.) Nice layout.  Has the feel of modernized round table, but more so upscale.\n\n3.) BIG portions and tasty food.  We had a Wise Guy (pizza) with garlic bread, meat balls, and pasta salad.  The meat balls were yummy, same with garlic bread, but not a fan of the pasta salad, the gf really liked it though.  As for the pizza, the Wise Guy felt like a mini deep dish pizza and didn't like the extra sauce on top, but the pizza in general was tasty with a lot of meat and was impressed with the crust they used which could withstand all the toppings.  \n\nCons:\n\nNone.\n\nOverall, good food and reasonably priced (total came out to $51).  I definitely want to come back and try their thin crust pizza.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "New kid on the block.\n\nSlice House is the brainchild of Tony Gemignani, a well-known champion pizza maker and pizza thrower. He is also the first and only American to date to win the World Champion Pizza Maker at the World Pizza Cup in Naples, Italy, where he was the first non-Neapolitan to achieve such glory. Since then, he's opened up a lot of popular and successful pizza joints in North Beach and all over San Francisco, Sacramento and Las Vegas. He's also got one joint inside AT&T Park for all you Giants fans. I'm sure Timmy would love that joint after hitting the peace pipe. \n\nAfter attending a meeting at the ballpark, we were walking back to work and we were all getting hungry. We were undecided on where to go at first until we stumbled in front of this place. You can't go wrong with pizza so that three of us all walked in and started perusing the menu. You can get a slice or the whole pie or pan as they describe it ranging from Classic American, Italian, Sicilian and Neapolitan. They also have meatballs, chicken wings, garlic bread, salad, paninis and pasta to choose from. We also each chose a slice (or two) of our own and a plate of meatballs to share with the group. \n\nSeating is self-service so you can choose your own table and make sure to grab the utensils and some water at the station. Our pizzas arrived in a jiff and thank goodness since we were starving. I ordered the Grandma and it was a perfect name as it was like comfort food. These are not thin-sliced pizzas as the dough is fairly thick, but it's very light and fluffy. You can tell the sauce is made from fresh tomatoes and not from a can based on the texture and wonderful flavor. And the ingredients are portioned evenly giving it a good balance from dough to sauce to fillings. The meatballs were delicious and seasoned well. It was moist, meaty and manly. \n\nIt's another good addition to the neighborhood (no surprises here) as it's reasonably priced and they even have a Sunday Brunch special. Take note that their hours of operation tends to change depending on the Giants schedule. \n\nGood quality pizza at a good value. Also good for dine in and take-out.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "My wife's pick!!! I gotta say I was in the mood for a burger but I'm sooo glad she liked the smell of this place.  Staff is super friendly and the pizza....omg... I love it!!!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-07", "description": "The focaccia pizza is really good however this place is really run down the bathrooms just disgusting and I think it could be a lot cleaner In general!!", "author": "Soph C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "The pizza here is to die for. It's delicious, flavorful and made in coal fire ovens. The sauce and dough are well made and neither over power another. They have many different flavors, thin crust, pan crust and many other options on their menu. I Highly recommend this place. You can either dine in their resturant next door or just go in to the slice house for a quick bite. I will definitely be coming back here for a slice next time i visit San Francisco.", "author": "Elizet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "I decided to stop here for some lunch during my break from work.  I paid $5 for a slice of cheese pizza to-go.  Before I delve into how the pizza itself was, let me break down some facts about this place:\n\n* You can either wait in line and get your orders to-go or you can eat-in by sitting at one of their tables.  (They have seating both upstairs and downstairs.).  Regardless, you need to first get in line, place your order and pay.\n* Don't think that it's just a place that serves only pizza, based upon its name.  Their menu is quite extensive with Italian fare -- they have pasta, antipasti, salads, focaccina (panini sandwiches), garlic bread, meatballs, Italian desserts (i.e. tiramisu, spumoni, etc) and more.\n* Furthermore, in addition to traditional pizzas (i.e. cheese and pepperoni), they make pan pies, speciality pizzas with a number of fancy ingredients and artisan pizzas too.\n* Drink wise, they have coffee, soda and water.\n\nPros:\n\n+ Despite the line, transactions were quick and I was in and out in ten minutes.\n+ Aside from ordering a slice of cheese, I also wanted garlic bread.  However, the cashier informed me that due to the power outage from the previous day, they had been unable to bake any in time for the lunch rush.  She was very apologetic about it and I understood as my office building nearby experienced the same power outage.\n+ Despite the price, you definitely get your money's worth.  The slices here are HUGE.  And they've been very tasty too.\n\nCons:\n\n- The only negative was that the slice I ordered was swimming in grease.  Yes, I know that pizza is known for being greasy.  But I had to pretty much blot the pizza with several paper towels to remove the excess grease.  I don't have a problem with greasy food, but I tend to get an upset stomach whenever I eat something that's overly greasy.\n\nOverall, I'm impressed.  I'm sure I'll be back soon.\n\n4 stars", "author": "Michael F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "Some of the best pizzas I've ever eaten in my life have been here. Beautiful crust, beautiful sauce, and beautiful toppings. Beautiful tiramisu, too.\n\nThat being said, the reason I'm not giving this place more than three stars is because the last few times I've come in, my pizzas have been undercooked. Like, between the sauce and the bottom of the crust is a layer of half-cooked, slimy dough that I can scrape off with a fork.\n\nThis kills the structural integrity of the crust and makes the pizza taste worse. And considering that a slightly overcooked pizza usually tastes better than a slightly undercooked one, this says to me that the place is becoming more concerned with quickly pushing out pies than it is with delivering a consistently excellent product.\n\nA disappointing and fatal rookie mistake in an otherwise masterfully executed pizzeria.\n\nFront-of-house staff here has always been mildly unfriendly, but this place used to be so good you wouldn't even care. Used to be.", "author": "Oliver K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "There should be a San Francisco law introduced that requires amazingly tasty pizza slice joints to stay open an hour past bar closing on Thursday-Saturday.  The pizza here is a great, about the closest to a NY slice I've had.  But it's just not the same popping in sober during lunch or before a baseball game.  This food would taste even better as the last stop between a night out and my bed.\n\nCheese Slice: Having lived in Manhattan for 6.5 years, I really miss those casual and quick slices.  No toppings, no folding, just a firm bottom crust (that doesn't flop down) and parmesan cheese, red pepper fakes, oregano and garlic salt on top.  Most pizza by the slice is pretty bad in San Francisco.  Besides Tony's, Arinell is the only tolerable one out there.  At Slice House, it's almost like being back in NYC.  The crust is a little fluffier and they're a little more generous with cheese, but the sauce is spot on and the bottom of the crust is nice and firm from the oven reheating.  No garlic salt in sight unfortunately.  They pre-sprinkle on the parmesan cheese and oregano, which could be an issue for some, but is fine by me.\n\nGrandma Slice: Golden Boy is a tad better for Sicilian-style square slices.  But this was tasty.  Loved the fresh mozzarella and ample portion of sauce.  Tasty,  but probably better to save your limited stomach space for more NY-style slices.\n \nMeatballs: These are pretty awesome.  Order a Cheese Slice and a side of 3 Meatballs and you have a hearty meal for $10 (...a rarity in SF).  There is so much nice red sauce in the bowl that your pizza crust can become a bread stick with tons of sauce leftover for your meatballs.  The meatballs themselves taste meaty (i.e. not much filler) and firm, but not too firm.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-18", "description": "Pigman - 3/5\nWise guys - 3/5\nKilling Zoe - 2/5\nCal italia - 5/5\n\nOverall, \"as good as it gets.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-12", "description": "Sunday afternoon 4:30pm, empty restaurant, the staff of Slice House decided to play Metallica at more than 80 decibel over the speakers, i am not kidding! I came to relax, but it ended up waiting at the most uncomfortable restaurant i have ever visited. Thank you for the headache!", "author": "Mirko W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-16", "description": "I want to give it more starts but the oil literally got my stomach tumbling. Will try again when it's not take out and will update if it's better next time. Some times the oil takes away from flavor and I did not reheat pizza after receiving it. Cute place.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "I'd been craving pizza all week. Decided to finally make the journey to Slice house to satisfy my craving. On Friday, July 17th after 2pm, I walked the 2+ miles roundtrip for some pizza!\n\n*Pepperoni ($5.25)\n*Tomato pie with cheese & basil ($5.50)\n\nThis totally hit the spot! Both slices had the wonderful chew I love about Tony's pizza. The pepperoni fulfilled the carnivore in me with it's delicious meaty flavor. I adore cheese and basil, so that slice provided a great contrast to the pepperoni slice. I was in heaven! Plus, these slices are fairly large, so I had half of both for lunch and the remaining halves for dinner.\n\nThank you Tony's for fulfilling my pizza craving. I just wish you were closer to my office!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Not only is this the best pizza I've ever had in California, it's the best pizza I've had in quite a while anywhere.\n\nSlice House had some bomb specialty pizzas available by the slice. The Grandma slice was killer and reminded me of the slices I'd get by my college in NY, only better. The slices were big and hearty, and the sauce on them was zesty and flavored wonderfully. One of the weak spots I've found in California pizza in general is that the sauce often tastes just of tomato paste. Luckily, this was not the case here!\n\nI was lucky to stop by here when I did, because there wasn't much of a crowd. With how good it was, I bet it could get pretty packed, especially after a Giants game lets out.\n\nStop by, grab a beer and a couple different slices off the rack. You will NOT be sorry!", "author": "Michael R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "One of my favorite pizza shops in the city. Amazing slices... Love the pepperoni and cheese slices! and their meatballs are fantastic too. Prices are reasonable and service is fast.", "author": "Shirin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "The owner Sean reached out an explained what happened. I'm inclined to believe them since we never had a problem with them before, but several with Caviar. He sent over a gift card to make amends which is pretty much the best way this could have been handled so 5 stars for great customer service and great pizza. This is one of my favorite pizza places in the city (my work's favorite too) so I'm happy we can continue to order from here, though it definitely won't be through Caviar!", "author": "Kajal G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-09", "description": "2 registers on the counter, only one of them open with a line out the door. 30 minutes is just too long to wait for a to-go slice of pizza.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-02", "description": "Stopped in here for a couple slices with my husband and was amazed! The pizza here is so delicious. The rust is so crispy and perfect! I used to live in nyc so I know about pizza and this place has really goooood pizza! Can't wait to go back for more!", "author": "Rachelle K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-30", "description": "Ordered wings and a side of meatballs.  The 6 people I was with got their food, and 10 more mins went by.   Flagged the server down and he said he would check on it quickly.  10 more minutes go by and nothing.  Went up to the counter to ask, then they tell me the fryer went down and the wings weren't coming.  I asked about the meatballs and they said, oh yeah that's ready - would you want that now?  Said yes obviously.  Asked what they were going to do about the wings if they were going to get me a refund and they said someone was going to come by.\n\n10 more minutes went by again no one came to me - asked them again about the status and they responded to me like I was inconveniencing THEM.  Manager finally came by 10 MORE minutes.  At this point I was upset but kindly asked for them to refund both the wings and the meatballs, which he said, \"ok\".  He comes back and he only refunds me for the wings.  \n\nBasically, they took my money, were never going to tell me that I was never getting my food - not even the 2nd thing I ordered and treated me like I was irritating them when asking them about it.\n\nNever again.  Bye.", "author": "R A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "Pizza.. meh. \n\nPeople say it's better than real New York slices? Not even close. \n\nPrices are so expensive, but I guess the portions are huge. But pizza doesn't need to be that huge. \n\nFrench fries ARE DELICIOUS. Super crispy, awesome flavor, and big portion. \n\nThe ambiance is nice, especially if you're here to watch sports with a full house. \n\nAlso, the tall guy at the register was kind of douchy. He either misheard or it was my friend's mistake but a french fry order was missed. Either way, he had an attitude when I asked about when the second order of fries were coming out. And he wasn't very helpful when we had questions about the pizza and the menu. \n\nWould only meet friends here if they suggested, otherwise I won't be back.", "author": "Priti K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Tasty pizza with nice crunchy whole wheat crust; I'm a fan of the pepperoni, grandma's (or anything that has the semi-sweet teardrop tomatoes!), or whatever special gourmet pizza they come up with. Ingredients seem fresh and slices are generous in size - essentially getting two normal slices, which explains the higher pricing as well. Open relatively late and popular hangout during local games (Giants, Warriors) with lots of TVs to watch. Upstairs is quieter and nice - usually pretty empty during the day. Can also order ahead and pick-up (whole pie or warmed-up slices). Expanded menu with salads, pasta, and wings are good, as well. Overall, a nice, reliable pizza restaurant to have in the neighborhood.", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-07", "description": "Been wanting to try this place but unfortunately they ran out of pizza for the day. Guy working there wasn't very empathetic and kept calling me \"bro\". Guess I'll never try their pizza since I won't be going back.", "author": "Nelson W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Oh man, I just walked by the breakroom at work and passed a box of cold pizza.  No way I could resist it...so i snuck a slice.  Omg, even cold, this pizza is so good!!!  I can't imagine how it tastes toasted or on site.  \n\nI'll be ordering them for future events at work!  Crispy/chewy crust, nice, light, fresh toppings.  \n\nTotal worth the cheat day!", "author": "Vi Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Awesome place to go for a slice of pizza before/after the Giants game- and a must try for any pizza lover! I finally got to check out Tony Gemignani's pizza, and I wasn't disappointed. We came in as a gigantic group a quarter past noon on a Wednesday before the Giants afternoon game, and they weren't super busy at the time, although there was a fair amount of people coming in and out during our order. Since I was expensing the meal, we had a 20+ person order and the staff was fantastic and really accommodating. We were able to order and get our food in 20 minutes or so, which is impressive. I was sad that the variety they have available for purchase by slice is very limited (only Cheese, Pepperoni, and Tomato Pie w/Cheese & Basil for the traditional crust, and the Silician and Grandma on the focaccia bread). I tried:\n\n-Cheese Slice ($5, http://www.yelp.com/user_local_photos?select=-RcFX1StRVh2qHxiX4EWRQ&userid=76vIFZcC7owykCBjMfGVXg): This was a very solid cheese pizza, and I loved that the crust on the middle part of the pizza wasn't soggy and just collapsed when you picked up the slice. The cheese had just the right amount of grease on it, which gave it flavor but didn't make it too oily. Recommended!\n-Tomato Pie w/Cheese & Basil ($5.50): Also very solid, although I always wish there was more fresh mozzarella on this type of pizza. However, I liked the sweetness of the tomato sauce. Recommended.\n\nI will definitely have to come back and try some of their combination pizzas, such as the Cal Italia, which won the Gold Medal on the Food Network Pizza Champions Challenge, and the Pigman, since it sounds delicious. They also have a decent (although small) selection of beers on tap, but they also have a variety of bottled beer as well. Parking in this area on game day and during the weekends can be difficult, but there is some street parking available.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "Ordered a medium Popeye pizza.\nIt had good flavor to it and great taste with good selection of beers. Would definitely go back here.", "author": "Sailaja B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "Went back for another try after Tony's management reached out. Slice of the day was great, they put the Barca game on the big screen upstairs for us, and the service was with a smile from each member.\n\nVery glad I don't work next door any more, I'd be huge. 5 stars next time I go back and confirm my first visit was just a fluke.", "author": "K M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-08", "description": "Many people in the city compare this place to Tony's in North Beach. While Tony's offers great pizza, slice house is a great option for a quick bite before a game. The options are fairly pricy. I went with the Cal Italia which featured prosciutto and multiple cheeses. The dough is probably the best part of the pizza, especially when fresh. Both doughy and crunchy, the toppings never fell off and provided great stability to the pie. \n\nMy only concern with slice house is the price of a full pie. A large pepperoni pizza was nearly $40. The cal Italia I ordered only had 6 slices for about $22. While I do think that it is fairly affordable, the price is fairly steep.", "author": "Joel Christian A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Is pizza wunderkind Tony Gemignani in danger of overexposure? Yeah probably but it's not like he's sold out and become a Food Network whore like Guy Fieri whose most current culinary connection is the excessive amount of carbs he can stuff in his ample mouth. Like many in our fair city, I became a fan when he opened his first San Francisco place, Tony's Pizza Napoletana, back in 2009. That's when my friend Maggie organized a birthday fête for me, and we tried a number of different pies including my eventual favorite, the Cal Italia with four Italian cheeses, prosciutto, a Croatian sweet fig preserve and a liberal drizzle of a balsamic reduction. Fantastico and then Jamie W. and I recently tried Tony's other North Beach Capo's for the first time.\n\nFantastico seconda parte. And then we found out Tony was taking over the former Ironside space on 2nd which thrilled us since he's now in our 'hood. This may be his third San Francisco operation, but he has since expanded his pizza empire from here to Vegas. Fantastico terza parte? Jamie and I decided to give it a try this past Friday and were surprised to find it nearly empty at about 6PM since there's plenty of beer on tap (photo: http://bit.ly/1byJErQ). I got here a bit earlier than Jamie, so you'll probably never guess what pizza I ordered for the two of us. The Cal Italia, of course (photo: http://bit.ly/1PQiKek). The ingredients were the same, but the crust was different. He bills it as \"Ancient Grain Pizza\" which represents a blend of Tony's double-zero flour, spelt, semolina, sprouted grain & whole wheat.\n\nThe result was probably healthier than the original but not quite as satisfying because of the chewier texture. You would think that would be enough for two mean with healthy appetites, but we were mindful of the name of the place, Slice House. With that in mind, I ordered a $6 square of the Sweet Grandma's Pizza, a Sicilian-style creation of which they make a limited number daily. It's really more a thick foccacia-like loaf with a sauce made of sweet, vine-ripened tomatoes ladled on top with mozzarella, garlic, oregano and pecorino (photo: http://bit.ly/1JwYGNf). While I appreciated the freshness of the ingredients, the breadiness overwhelmed me somewhat, so much so that for the first time, I could not finish a slice of Tony's pizza.\n\nJamie liked his $5.25 slice of the Pepperoni, and the slice was frankly enough for two with an abundance of meat (photo: http://bit.ly/1GCBVXt). My one complaint was the amount of grease that accumulated on the cheese probably because it spent some time saturating in the display case. Even with the focus on pizza, there were plenty of other items on the menu - salads, a couple of pasta specialties, paninis and apparently a meatball sub to die for according to the server who was pushing it hard. I have no doubt that Tony will bring 'em in again although I hope he doesn't go into a franchise zone with his award-winning pizzas. Not worried yet, but I'll be back to monitor it. After all, someone has to make sure of the quality on a regular basis, right?\n\nFOOD - 4 stars...Tony is a pizza artist but some of the North Beach pizzazz seems missing here\nAMBIANCE - 4 stars...good use of the loft-like setting Ironside struggled with\nSERVICE - 3.5 stars...cordial enough\nTOTAL - 4 stars...a slice of Tony's is worth a pound of cure...or somethin' like that, goombah", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-30", "description": "one of my best pizza places in SF. love how chewy the dough is. i recommend the followinng pizzas:\n-cal italia\n-crazy 8\n-wiseguy\n\ni don't recommend their mixed greens salad. it was all mixed greens and had very little of anything else", "author": "Jackie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Really, really, really good pizza. Like really good. REALLY.\n\nWe stopped in to try this place before a Giants game, and I cannot wait to go back! I tried a slice of their regular cheese pie, and it was delicious! Not to mention ginormous! So much cheesy goodness made my heart skip a beat (pun intended)!\n\nSlice House is a casual spot with great food/drink options, reasonable prices, and ample seating making it a new go-to before (or after) a ballgame. \n\n\nTry Slice House! You won't regret it!", "author": "Alexandra F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "This place has some bomb ass pizzas! For a part of 4, we ended up getting two pies- wise guy and killing Zoe. \n\nThe wise guy was meaty and Came with cream cheese which was good and filling! And killin Zoe is not for the faint of heart. I didn't feel much from the ghost pepper infused salami but my friend was DYING! It was so delicious tho. Just really oily so remember to use a napkin to soak up some oils before digging in. \n\nOverall, this place exceeded my expectations and was just really delicious. I would definitely come back again to try the other pizzas they have. \n\nOh also they have weekend brunch!", "author": "April Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "The pizza here is great authentic great cannot complain at all way better than Round Table Paxis  anybody  in fact anybody else they want to say lol", "author": "Mychelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-25", "description": "Pizza is really good. Unfortunately, the service is consistently awful, which makes it hard to come back regularly. I live very close by, so it's a bummer.", "author": "Patrick H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Only ordered a slice of NY style cheese pizza. Nice thin, crust, great flavor, music was bumping and the team was really friendly even though it was a really hot day inside and out.", "author": "Char G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "The best near att ballpark. I love everything about this place. Great slices good deal.", "author": "Antonio V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "Came here a few nights ago with a friend, we came around 7 much before the kitchen closing thinking I could try to get some of the \"homemade\" pasta i'd seen on the menu. Instead, the guy at the front told me that the only thing they were serving was just the pizza on the counter and they weren't going to make any other pies or pasta. What a joke of a restaurant, if you've got a menu with other things on it but can't serve it when you're open then why leave it up on the first place? At one point this place had consistency but has recently turned into an establishment built on lies!", "author": "Ed B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "This is some of the best pizza and it's even better when you're on your way to a Giant's game. $5.50 for a huge slice of pepperoni is primeeeee. Come here once and it'll be a staple for future Giants games to come.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "I'm from New York City and I take my pizza seriously. Yes I was skeptical of the $5+ per slice price tag, but I'm glad my pizza withdrawal drew me to Slice House. \nBig slices of pizza that look, smell, and taste delicious. You can order any of their already prepared slices and you can't go wrong. Personally, I like their pepperoni and their grandma slices. They have other items on their menu such as meatball subs.\nThe pizzas are all rich in flavor and the pie crust has a good combination of chewy and crunchy.  \nStaff are nice and welcoming. Big tvs showing sports and ample seating. \n\nDefinitely give it a try.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-24", "description": "This is classic Italian pizza created with a homemade sauce and thin house crust. I really enjoyed the tomato pizza however it would be great if they had at least one vegan option.", "author": "Melanie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-08", "description": "I just spent $6 for a slice of pizza. Being born and raised in NY I am a bit of a snob. And this was awful. Especially for $6 for a slice. \n\nWhy was it awful? My whole slice smelled like burnt pizza. The weird part is the slice itself wasn't burnt. More like it was cooked in an oven where something else had recently burned. But from the moment I put it near my face, the smell overwhelmed my senses. And the odor in my nose invaded my sense of taste, and burn dominated. \n\nThe only thing that came through was the sauce, which is way too sweet. Which is probably why I could taste it. \n\n$6 for a slice. Well this is San Francisco. But considering a slice of bliss in Manhattan costs half the price, this place is absurd.", "author": "Rich B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Just tried this place out last week because of many good reviews and it's simply AWESOME! Great food. Fun atmosphere. This is pretty close though, will definitely be back.", "author": "Nicolas R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "I am a big pizza lover, so when I saw this 4 star restaurant on yelp I had to check it out. My s/o and I shared the grandma and pepperoni slices. The pepperoni was too bland for me, but the grandma was pretty good. The restaurant is cute, and they have a great selection of beers on tap.", "author": "Lore O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Just experienced the Wise Guy Pizza at Slice House. It was terrific. Very flavorful with the right amount of toppings to compliment the pies crust. I highly recommend this experience.", "author": "Carlos M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Stumbled on the slice house while walking towards AT&T park. Warm and inviting, greeted with a hello from staff. Flat screen TVs showing the basket ball game.. Perfect!! Select variety of pizza slices to choose from, I chose the sausage and spinach. I saw meatballs and pasta on the menu as well. Upstairs available for a small group gathering, beer and wines available too. The pizza and drinks were delicious. Nice little spot and centrally located. Be back again...", "author": "Thelma A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Awesome stop before going to a Giants game! Great deal for a 13\" pizza and a pitcher of beer. The wait wasn't terribly long, we were able to get a table right after we ordered. They had about 6-8 beers on tap and all were good options that weren't Bud light and Budweiser. The pizza was delicious and they have this red pepper olive oil at the tables that tastes sooo much better than just red pepper flakes. Try it out!", "author": "Alex M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "The Grandma pan pizza is so damn good! And the slices here are humongous!! Totally worth it. \n\nExcellent place to stop by for a drink after work, or before a game. \n\nIt's too bad they don't deliver.", "author": "Rie U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "Greasy and delicious pizza with huge slices. Also got the mixed green salad and it was really good. All the staff was friendly, especially the man at the register who told us of the deals going on that day. Already craving it again, definitely recommend :)", "author": "Hannah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "This place ROCKS! Best deal in town and parking is soooo easy - IF THE GIANTS ARE OUT OF TOWN or if it's the off-season. Best kept secret: the pasta dishes are huge servings and very delicious. The pizzas are pretty damn good too. Excellent take out for a quick drive - after rush hour traffic.", "author": "Papa Dadoo B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "The pizza here is amazing! The people that left negative reviews are either crazy or habitual complainers; don't believe a thing they said.\nThe pizza sauce is the best, not too sweet and not too acidic. The Ceasar  salad is the best I've ever had, I order it any time I go. The romaine is always fresh and I love the two different types of anchovies on top and the toast is way better than croutons!\nThe atmosphere is rustic and cool too.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-15", "description": "I really enjoyed my experience here...over the course of a week I had a few different pizzas: Tomato & Basil Pie, Ancient Grains Pizza (Genoa), Square Pan Pizza (Sicilian)\n\nAll these pizzas were fantastic in their own way.  Rather than the toppings being fantastic, which were still great, the dough is what really made these outstanding.  Each one was unique in their own way...flavor and texture were so interesting and something that you really focus on with each bite.  The freshness of the ingredients really comes through.\n\nThis is a great casual spot to visit...you can order for dining in or take-away, but if possible, experience the pizzas as they were meant to be experienced by dining in...you really get the authentic flavor that does seem to disappear a bit when a pre-made pizza is reheated.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-07", "description": "First things first: I have celiac disease but I'm not so sensitive that a little cross contamination will bother me. I understand their gluten free pizzas are cross contaminated. They have a warning on their menu explaining that. Ok.\n\nSo, a month ago, I went there for lunch with some coworkers, thinking I'd try their GF pizza. You can't get it by the slice. Bummer, but understandable. So I ordered a 12\" gluten free pizza, thinking it'd be about enough for 1.5 meals. \"That'll be $32.95,\" said the cashier once he'd rung me up. WTF?! An individual-sized pizza should only be $15-20, even if it's gluten free! I am not paying more than $30 for lunch. I canceled my order and walked out.\n\nThen today a team at my office ordered pizzas from them. One of the people on the team is also gluten free, so he offered to share the GF pizza they'd gotten for him. (The order was: Popeye: White Pie, spinach, garlic, ricotta, mozzarella, and red pepper. 13\" Gluten Free.) I was impressed by how puffy the crust was. Most gluten free pizzas are flat and crispy. As I was eating a slice, I thought, wow, this is incredibly good. The more I ate and the more I looked at the crust the more skeptical I became that it was actually gluten free. So I did a google image search for Slice House gluten free and found a picture of their gluten free pizza. Sure enough, it bore the characteristics of your typical gluten free pizza: flat and crispy. Not anything like this \"gluten free\" pizza we'd been delivered.\n\nAn hour later I started feeling the effects. Guys, this is not a minor gluten exposure. For a celiac, eating an entire slice of REAL pizza is horribly damaging. Fortunately I seem to be spared the more painful effects most celiacs encounter, but still had to cancel my evening plans and hunker down. I'm planning to be under the weather for the next few days and it'll be at least a couple of weeks before I'm back to normal.\n\nHere's the thing: If you're going to offer a gluten free option, you have to be on top of that shit. It's great that they have a disclaimer about cross contamination. But their staff needs to be really attentive to when a GF pizza has been ordered. It's serious. People become debilitated by eating a thing they think is GF when it's actually the MOST gluteny thing out there. (Pizza flour has extra gluten, FYI.)\n\nAlso? Your gluten free option shouldn't cost 3x what the regular option costs. That's just obscene.\n\nIn conclusion, DO NOT go here if you're avoiding gluten. They absolutely fail.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-12", "description": "Very disappointing we love Tony's Pizza but the overall experience was simply horrible. We arrived at 620 and got our pizza at 745. It started with the cashier there was a long line yes but when I got there he had no personality and seemed glue less after I asked about certain sliced pizzas. The ones I chose he indicated that he cannot offer because they ran out of the dough for that type of pizza. This is a Friday night before a Giants game which is down the street. Next I finally ordered a whole pie was given a number and we sat viable to all as waiters kept passing by us. Initially the cashier said that the wait would be 15 to 20 minutes. Once we hit 30 minutes I asked for assistance. At first the waiter came up and said the Pie would be out in five.  four other times I asked for the manager. He eventually came up at 45 minutes to say that the Our meal would be comped but the pie still did not come and he never came up with th credit. We finally was ready to walk out I went to get the credit and then after I got the credit they delivered the pizza to our table but still nice I got the credit the waiter was ready to take our pizza away because we got the credit.  the pizza ended up under cooked and frankly no where near the standards of Tony.\n\nIt was clear that this restaurant has major service issues and management needs to get on it right away.", "author": "Hans H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-24", "description": "Fantastic pizza here. Came for a slice but am drooling for another. They have a pizza slice and beer special for 8.99. Doesn't get much better than that. \nI ordered the slice of the day and it came with perfectly cooked bacon and interesting purple potatoes.\nThe slices were huge and thin, exactly how I like pizza. \nMy wife doesn't really care for pizza much but she enjoyed this place thoroughly. \nWe ate just before the Giants game and it was the perfect place to go for pre-game. It had plenty of big screen T.V.'s and was very close to AT&T. \nWould definitely come here again.", "author": "A M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "Was a little nervous about getting a slice in Cali (My experience at GV Pizza in LA set my expectations low low low for pizza by the slice). But this place delivered. Crispy crust, good sauce-to-cheese ratio, very close to what I'm used to at my old NYC - NJ stomping grounds. \nThe cost per slice is a little high ($5 for a plain is a little high, even for NY standards) but worth it for a quality taste of NY.", "author": "Isaac T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "No other way to \"SLICE\" it (yuk yuk) -- the SLICE HOUSE has saved SF from being tossed into the \"great city, shitty pizza\" pile. I've lived here for 4 years -- and was totally spoiled by NY pizza. I roamed around in search of, frankly, just a decent pie, particularly after my search waned on. BEHOLD! The SLICE HOUSE. Hold on.... $5 a slice? Say what? Well... the slices are as big as my ex boyfriend's head (nickname: BUCKETHEAD). So chill about the price... one slice will fill or stuff you. \n\nEnvironment is totally chill -- a little bit of everyone (although mostly locals, thank you). A couple of big screen TV's have sports of some type. Soccer in Latin America -- but no  Donald -- or Brangelina. Score.\n\nApparently, the owner is a muckety muck in the pizza world-- a grand poobah of fine pizza making. And it shows.\n\nHappy hour Monday-Friday from 3-5:30pm --slices are $4. Wine and drinks are discounted -- but IDK how much.", "author": "Teet S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-07", "description": "Ok so don't come here if you are fluent in Spanish you may just over hear the women who likes talking about how when she calls her husband a ---- and grabs his ---!!! Then she ha ha ha while your trying to eat. My husband and I and my 15 year old are down from Chula Vista for the Stanford Camp and stopped by for a bite before the game and of course we're bilingual but C'mMmonn ....", "author": "Diana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Man at first I was like $5 for once slice of cheese pizza? Just a cheese? C'mon! But once I got the slice...I knew why. Beautiful color, seriously though, the cheese was a beautiful freakin color of \"cooked melty-ness\" and there was all this seasoning. The tomato sauce was soOoOoO good, flavorful and a good amount. 4 stars cause I like pizzas a little thicker and it was so good that I wish it was a little thicker of a slice", "author": "Suria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "SLICE HOUSE is definitely a great place to grab some grub near AT&T Park. However, it is sort of overrated because of Tony owns it. I went after The Giants Run and enjoyed a couple slices and some beer. \n\nI had a slice of the Pepperoni and a slice of the Sicilian. The pepperoni was very good. I liked it because their pepperoni is exceptionally spicy! The pepperoni slice is NY style - big, thin and crispy. The Sicilian was a thicker square slice with meats and fresh mozzarella. I liked the pepperoni better, but the wife liked the Sicilian better. Both were solid. \n\nOnly downfall - really weird and crappy beer selection. Pabst, Hamms, Olympia? Come on...\n\n4.25 stars!", "author": "Joel V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-07", "description": "hmmmm, in my mind, overrated and underwhelming to tony's in north beach. BY FAR. to be fair though, we only got slices, so would be happy to come back to try the actual pizzas. i got the grandma sicilian style, and boi the tomato basil slice. he was really happy with the crust on his slice because it held up really well.. my crust i thought was too dough-y and a bit undercooked, but i havent had much sicilian style pizza to really judge. the wings (6 for $10) were not delicious, so probably will not be having those anytime soon.  overall - good spot in soma for pizza (its a 10 minute walk for me) but...not comparable to NB locale!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "So yummy! Highly recommend! Got a pepperoni slice and it was bomb.com. Place was clean and I was in and out in like 10-15 minutes", "author": "Madi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "Well...great price and location before the game. $9 for a generpus slice and a pint. But the pizza was fair. Although the sauce was suoer tastey...the basil was limited on my cheese and basil slice and the crust was actually tough.  Ambiance was ok for SF...a pizza joint. I expect more in this city.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-04", "description": "Pretty tasty slice but at 5 to 6 bucks a slice a bit pricey.\n\nAlso dont understand why the cheese slice is same price as pepperoni slice?\n\nUsually you get a break on cheese...\n\nbut worth a bite if your hankering for a slice!", "author": "Steven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "Delicious slice pizza with premium pricing. Only the lower level was open and we couldn't find anywhere for our toddler to sit without view of the TV screen. Might stop by again to pick up slices but find somewhere to take it to go.", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "I really like this place because the food is tasty, the staff is super nice, and wait times are low. That trifecta is a rarity in the SOMA area.\n\nI've only tried the pizza offerings. They usually have 3 at least: pepperoni (comes with those tiny ones, and covering the pizza edge-to-edge!), cheese (pretty good), and grandma's (forget the toppings) which I thought was just OK.\n\n1) The pizza slices are LARGE. If you're a two slice person elsewhere, one will be good here. Ask them to cut in half and it'll be easier to fold. This also saves you monies which is a good thing in this city. ;-)\n\n2) The pizza (at least pepperoni) is greasy. You may need to deploy the napkin dab technique.\n\n3) They refill fountain drinks without complaints. Woo.\n\nI'd probably avoid this place on SF Giant's days though. It must get crazy in there.\n\nSuggestion to owner: How about offering up some of the speciality pizzas listed on menu as lunch time slice options?", "author": "Pedrum M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Great food for dinner. This place makes pizza with artisinal grains and home made pastas! Whole pies and or slices can be purchased. Rocking place!", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "What can I say? This is Tony Geminani at his best. I have missed this pizza so much since he closed down his Castro Valley restaurant, Pyzano's.  I love the sauce - there is always enough and it is seasoned well.  But the crust!! Don't even get me started on this....you will not throw the crust away - you just can't.  It's the perfect thinness/thickness but soft and chewy at the same time.  I drive 50 minutes for this stuff...no joke.  I love this pizza so much that Lombardi's in NY was a disappointment to me. I know, right?!!  They will make the standard pizza for you, but urge you to try their custom pizzas.  You can't go wrong.\n\nIt's a great place to watch games - very sports bar-casual-friendly vibe.  Make sure to call ahead to see if there are any schedule changes due to Giant's games - they alter their business hours to coincide/work with the games.", "author": "Caroline K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "This is amazing pizza and they have beer so this place is great. Pricey per slice but it's the best pizza I've had on the west coast", "author": "Cy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-14", "description": "Love the pizza at this place- does not get better than here! But 2 stars because of hygiene. I've come here a ton of times, and when you order a slice or two, the guy who is at the cash register tears off the slices and puts it in the box. He goes from exchanging everyone's cash, credit cards, pen, touching the cash register, to touching the pizza without washing his hands or wearing gloves. I've seen this at least 10 times and it's always the same guy. They need to keep an eye on hygiene standards. Makes me wonder what I am not seeing.", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "This location of Tony's pizza is perfect as it's just down the street from our place.  I've always been a fan of his pizza and this location is no different.  We got the meatballs (huge with lots of sauce), mixed green salad (loved the vinaigrette dressing) and the Crazy 8 pizza.  Everything was really good.  We had a few pieces left over and they were almost better the next day.  The crust on the pizza is so good.\n\nWe'll definitely be back for some more good pizza!", "author": "Blake B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Decent, super greasy pizza. Plenty of places with thinner crust, but this place is quite good. Just not spectacular. I don't know how the Tony's restaurant is, but if it's the same, it's not worth the wait. I like this place, I've been many times and and would go back, but can't say that it's so good that I must go back all the time.", "author": "Alton Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Perfect spot for a late night slice of pizza or dinner in the neighborhood. Reasonably priced per slice and great beer selection. Closest to NYC pizza I've had here in SF!", "author": "Mileen Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "My new favorite pizza place in San Francisco.  Having an office a block away is going to be dangerous.\n\nSimple choices for lunch -- cheese, pepperoni, Sicilian, or grandma pies, by the slice or whole (20\"), or meatball subs, or salads.  SOMA pricing ($5-6/slice), so not cheap, but not out of line with anything else in the area.  So far I've tried several kinds of pizza and the meatballs; all perfect -- the best I've had anywhere.  Absolutely will return.\n\nThe only criticism I have is the line of people out the door waiting for pizza.  Three weeks after it opened, and there's still a line out the door at lunch.  They're not particularly fast for single slice orders, but not slow either, and probably bottlenecked by rate of production.  This is a high class problem to have, though.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "So, my bf found this place after walking down the street and after some research, I realized the owner actually had his original shop in my hometown!\n\nThe day before our half marathon (and our friend's 52.4 mile ultra marathon), we decided to gather for an early dinner. My bf had couple slices of their pepperoni pizza and I had an order of their meatballs. My meatballs were good, juicy, flavorful, and submerged in sauce. My bf's pizza was pretty good, too. Lots of pepperoni and not too greasy. Their slices are quite generous.\n\nWould I return? Maybe -- my bf was a fan, but I don't think this is a kind of pizza I would necessarily crave.", "author": "Leana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Pizza maestro Tony Gemignani continues to build his delicious pizza empire. \n\nNow open on Second Street about a block from AT&T Park where he has two slice counters is Slice House. Offering classic New York, Sicilian, and grandma pies whole or by the slice, Slice House knocks it out of the park.\n\nAs expected all styles of pizza are excellent. The crust is just the right mix of crispy and chewy and, of course, has the perfect char. The New York style is better than Grimaldi's in Brooklyn.  The thicker Sicilian will have you drueling for more. The \"grandma\" style is really just like your nona used to make. Also as tasty are the grinders, pastas, and even gluten-free pizza.\n\nThe restaurant is counter service: you wait in line to order and pay, then take a seat, although finding one at lunch can be a challenge, and your order is brought to you. Be aware: lines can be long at lunch and on game days.\n\nSlice House offers a few wines, but more importantly to accompany the pizza, it offers a good selection of local craft beers. \n\nService is quick and efficient. Soft drinks were refilled even during the lunch hour rush. \n\nSlice House will do more than fulfill your pizza craving. Welcome to the neighborhood, Tony.", "author": "CJ G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Great spot to pick up dinner to-go in SOMA. The pizza cost about $6 a slice but the slices are HUGE - one slice is close to an entire quarter of a large pizza at chains. The garlic bread with cheese is quite nommy, so much that the discomfort you experience from consuming all that butter and oil is worth it. The wings and the artichoke pasta salad were very average, so I would skip that. \n\nThe restaurant is clean and not too crowded during dinner hours. Their ranch is apparently housemade. And, they also have pasta!", "author": "Melody Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-23", "description": "Small place, so go a little early if you plan to dine-in.\n\nLoved the food and service here.  The pizza is excellent (and by pizza I mean their crust, sauce and cheese).\n\nI sampled the tomato pie, the pepperoni, and something called \"Mama's\".\n\nThe winner was the tomato pie, it was awesomely good in every respect.  The pepperoni had the same crust and sauce, but was stacked with way too many slices of pep.  The grease slick was overwhelming.  I ended up tearing off the crust and eating that only.\n\nThe Mama's was a different style, square/pan shaped slices.  The dough was very hard, a little too tough I thought.  The toppings were excellent, especially the sauce.\n\nOne slice is enough for a good sized lunch.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-22", "description": "This review is for their AYCE weekend brunch. \n\nThe only decent things were meatballs, spaghetti aglio e olio, and sausage. There was low turnover so everything else was very dry. The breakfast pizzas were lacking any kind of sauce, and were sitting under heat lamps -- so they were very dry as well. Even the fresh fruit was placed under the heat lamps.\n\nAdditionally, the champagne wasn't chilled enough and the fruit juices weren't chilled at all, so the mimosas were almost room temperature.", "author": "Jesse D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-09", "description": "I'll give my soggy slice of pizza to a homeless person. They'll appreciate a slice o soggy pizza. The crust is so limp and disgusting! I can't even pick it up to eat! What a waste of $5.75 for lunch.", "author": "Debbiedeb W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "Very good but prepare for a triple bypass afterwards.  Saying it's rich is an understatement.\n\nI had a slice of the pepperoni which looked like a caricature.  So many slices of pepperoni that it look the pizza had craters.  They were tasty but there was a greasy puddle that could probably be sopped up by a roll of paper towels or two.  The tomato pie with basil & cheese slice was better, not greasy; just flavorful.\n\nTony, think of those with families that want to have a long life and take it easy on the pepperoni!", "author": "Saminda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Pretty good pizza to grab by the slice in SOMA. We got 2 slices of the day, a pepperoni slice, and a grandma slice. All were very light and flavorful. The service is fast and they were open for the Giants game, which is great since they are right by the field.", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-16", "description": "Don't go here if you have to stick to a schedule...ordered 2 pizzas for pickup and was told 35 minutes over the phone. It took over 70 minutes! Had to cancel order and leave without any food.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "Need a quick slice to warm the soul? The house will handle your cravings. From Sicilian (Square cut, think Golden Boy...) to a thin crust NY slice you won't be disappointed! Came here on day two and was impressed... New SOMA spot for a slice or a meatball fix, previous home to Iron Side. \n\nMy co-worker that is a true N.Y. East coaster says it's easily one of the best slices he's had in city. Had a Sicilian slice (Pepperoni & Sausage) and it's a pillow like focaccia crust with a mild but robust red sauce covered in toppings and was piping hot when I was called to snag it... Also took an order of Meatballs (3 for $5) are well seasoned and I can't wait to get them again next time. Get in here before the lines out the door! DON'T SAY I DIDN'T WARN YOU!", "author": "Josh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "This place has amazing pizza! I went here accidentally at happy hour and got lucky with some awesome gourmet pizza. Here at the giants game now and had another slice and reminded how good this pizza place is.", "author": "Chris H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Cute space, unbelievably kind and thoughtful woman working there today. She made my birthday very special with her generosity. And the sicilian slice was totally delicious.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-17", "description": "We grabbed takeout for a business lunch after we lost our reservation at a dine in spot nearby when our meeting ran long. \n\nThis is clearly a happening spot around lunch time and with a line out the door, it shouldn't have surprised us how long it took for our order to come together but it was still disappointing to wait 20+ minutes for the food - they were doing their best for sure, so just a warning that it's slow at lunch time. \n\nThe pizza was good! I wish the crust was something worthwhile, all of us left our crust in the box. Most frustrating was ordering the quinoa salad, from the salad section, only to find it was quinoa PASTA - not a salad. Especially annoying since they have a separate menu for pasta and this wasn't there - it was in the section for salads. Add insult to injury that the quinoa (pasta) salad was somehow void of flavor all together. It tasted like raw boiled pasta. And with goat cheese being more mild, it needed something else - maybe some tomato, olives, dressing? I'm not sure what but no one in our group had anything good to say about it. . \n\nThe shining moment was the sausage. Mmmm that honey sausage!!! We were told it was made with local honey from the roof of the owner's other restaurant so we got two orders - so glad we did! It was really fantastic. Something to go out of your way for. \n\nOverall it was AOK pizza, lying quinoa pasta salad and amazing honey sausage.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-27", "description": "Overpriced, subpar, greasy pizza. There was a puddle of grease on my plate. Soggy pizza. If you're going to charge 6 bucks for a pepperoni slice it better be good. Beer was $9 as well.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "A great place for lunch if you work in the area.  The pizza is made fresh, sold by the slice or in a pie.  Thick wonderful pieces of pizza joy!   A little pricey, but you can get full for $14.00 with a drink too!\n\nLove it.  Plus they have a big-screen tv blasting sports and an upstairs dining area.  Very hip, loft-like environment.  \n\nOH YA - they also have a stand at AT&T Park.  Go Tony G's Slice House!  :)", "author": "Paul R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "A fantastic pizza place! Their food is fabulous and with the daily special there's a lot to discover for returning visitors.\nThis is also a sports bar where they show soccer (and - I imagine - other sports as well).\nFor me this was a great place to go for a slice during my lunch break.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Oh man I'm going to be as regular here as Norm was at Cheers. Fortunately it's just far enough from where I live that it's an incentive to go for a run, so at least I won't end up looking like Norm.\n\nSolid NY-style pizzeria. They got big foldable triangular slices, proper grandma slices, big thick Sicilian slices - what's not to love? Plus a nice set of beers on draft, and it's not even expensive, and it's open until 10. Seriously an awesome addition to the neighborhood.", "author": "Marco C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Fantastic Pizza!   True NY Style Pizza .  A great lunch place.", "author": "M N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-12", "description": "Can't get the order right! Never going to eat here again. I give them -10. Made me wait 45 mins for the reorder.", "author": "Vidya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Flat out awesome. Was going to the game and found this place, one of the best pep slice of pizza I have ever had. A bit too greasy but such good flavor and texture I didn't  t care", "author": "Brad M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "I really want to like Tony's pizza. I'm a fan of the style, and I like his story, like the different pizza ovens etc. but I've had it twice now, and didn't really like it either time. I was excited to try the slice house near the ballpark last week, but the cheese was burned, and when I picked it up, the thing slumped over like a wet noodle.  It had absolutely no firmness to it. It's a bummer all around.", "author": "dave g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "We are always impressed not only with the taste of the pizza, but the speed in which it is delivered to the table. When you are in line at the store at 6:49, and you still see the first pitch at AT& T Park this place has a good operation.", "author": "Bob W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "This place is very convenient to AT&T Park; was walking around the park before a Giants game and decided to try this place out... $5ish for a slice of cheese is absurd, so I got one of the chicken slices for like $6ish - either way this is very expensive!!!!\n\nI ordered at the counter, got a number, and stood around for about 10 minutes until one of the staff asked if I needed help - they supposedly gave my pizza to another guest... so they had to make a new one and cook it for me!!\n\nIn the end, it was decent pizza but very saucy, still edible and flavourful; chicken was cooked through and cheesy!!!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Pizza was awesome & it wasn't busy either so it was perfect since we had our hungry daughter w/ us. The only thing that I didn't like was the bathroom. There was only one and we had to wait if someone was in there. Didn't like that. But overall, the pizza was good & we'd definitely go back", "author": "Princess S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Slices are HUGE! It's a great place to go for lunch if you work in the area. They always have good slice of the day options. The pizza is pretty good, but you really want to get the garlic bread and meatballs. I'm not sure what they put in them, but they're to die for. The garlic bread is so buttery and has actual garlic cloves on it. The meatballs just melt in your mouth. \n\nThey're pretty quick when you order so you can get out in good time. I'd definitely recommend checking it out!", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-28", "description": "Awful. Terrible pizza. Doughy. Pasta was like ketchup sauce. There should be no difference between what you cook to deliver v. cook to eat in - deliver service was a joke.", "author": "taste e."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "We are a big fan of Tony's original restaurant in North Beach. We frequently take out of town family members to a treat at his pizza restaurant. Had been to the Slice House at ATT&T Park so my wife and I were delighted when Tony's took over an existing restaurant space on 2nd Street. Because...\n\nIt's within walking distance from place. Just dropped in last night on the way home and grabbed a couple of slices. I got for any special with a lot of meat on it. Meatballs....oh yeah!!!\n\nSometimes times with get the large order with extra sauce and turn it into spaghetti and meatballs when we get home. \n\nBe sure to grab a slice before a game. They have more options that in the park and you avoid the higher tariff in the park...", "author": "Aldon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "We called in our order to pick up from Slice House this past weekend, and I couldn't believe a) how empty the restaurant itself was for a Saturday and b) how delicious their pizzas are despite it not being the original Tony's.  I'm a sucker for their margherita pizza, but that always comes with the wait.  Instead, we went with The Wiseguy pizza and Mostaccioli ala Vodka Cream for dinner.  Two very hungry adults took down The Wiseguy pizza, and an overly hungry one person took down the mostaccioli.  All in all, it was gluttony at its finest that night, and I have zero regrets when it comes down to chomped down on half a pizza.  The Wiseguy comes with some spicy sausage, hot pepper oil, and it's topped with little bursts of mozzarella.  About midway through, that mozzarella came in handy when the spicy sausage got to being a little too much for me.  I will definitely be back here, especially since picking up an order was almost a little too easy!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-09", "description": "The food is nice when you can get it. The main problem is they lock their doors more than an hour before their posted closing time. I once brought a group of 10 people to their door at 8:58pm after verifying on yelp they were open till 10pm. Door was locked. I was sad.\n\nA few weeks later I brought a Chicago lady there at 9:15. Doors locked. I was annoyed.\n\nNow tonight I'm at work late thinking man I want some pizza it's 8:45pm. Slice house is open. Is it though? I no longer care. I'm done trying. \n\nI'm trying amicci's on king st. Instead.", "author": "Jonathan P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-05", "description": "The one star is for the service.  I ask cashier for the ready to go pizza right next to her, trying to catch a show, she says, \"no problem\", takes my money, next thing I know I'm waiting 40 minutes for a whole pizza to come out of the oven.  Seriously, don't promise what you can't deliver.  Really jacks up a person's evening, when you're request is simple and time dependent.  \n\nFood -  3 stars.  Good crust w/ good spice pepperoni.  Nothing amazing.", "author": "Mo m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "A great place to sit down and have a beer what Amazing Pizza they have fresh ingredients tomatoes and the crust has a great chew! The aroma when you walk in will take you off in to Pizza Heaven. I recommend the tomato pie with cheese and basil but that's my preference and they have so many great options, I'm sure they have a pizza for you!", "author": "Michael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "The slices we had were great. They had that hard to achieve gooey top with a crispy and chewy crust. Cold beers were a great accompaniment. The slices were also huge....we each ordered 2 pieces and had plenty leftover for lunch the next day. The tomato and mozzarella, pepperoni, and daily pie (kale & sausage ) were our choices and did not disappoint. Maybe slightly more per slice than we'd typically pay for a large pie, but the variety was worth it.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Very large slices.  Thin.  Fresh.  A bit on the expsenive side.  Large place with downstairs and upstairs seating.  Order at the counter and they will bring you your pizza at your table.  Beer and wine.   Large TVs for sports viewing as well.  My new go to now that SBC has closed.", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-28", "description": "OH MY GOD WHY WAS IT SO HOT IN HERE!!!! Seriously...like sweating bullets into my nice slice of pizza kind of hot. The pizza was good, as usual, but my friend and I ate as fast as we could just to get out. It was not enjoyable and they really need to figure out the whole heating issues.", "author": "Hayley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-08", "description": "I'm a fan of Tony's in North Beach, one of the few places I can get a NJ-style tomato pie (like the ones I grew up with on the East Coast). I was excited to try this outpost from Tony, given the location and the fact that you don't have to endure the ridiculous wait times. \n\nI stopped by for lunch today and grabbed a tomato pie slice. It was incredibly greasy. I'm not one who typically shies from grease or dabs the slice with a napkin. But this slice was an oil slick, such that I had to eat it with a knife and fork. The crust was a tad too thick and tasteless. The whole thing had a slightly burned taste; not from a nice char...more like the cheese had been reheated a few too many times or the oil was rancid. Something was just off. This was nowhere near as respectable as what I've had at Tony's and certainly nothing like the real deal on the East Coast.  \n\nTo top it all off, a slice and a Coke set me back $9 before tip (I mean, the Coke alone was a ridiculous $3). Hey, I'm used to inflated food prices in SF and will gladly pay it for good eats. But this was totally a waste of money.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-29", "description": "Meh. Came here with a small group on a Giants game night. Quick line, quick order, then waited OVER AN HOUR for our pizza. It was a very simple order and shouldn't have taken that long. The two tables next to us got their pizza, ate, and left before we had received our order. Every time we asked about the wait there was no response. Finally the very apologetic manager came and said sorry and that he had made the pizza himself, but nothing other than that. No free drinks or dessert or sympathy for the fact that we waited so long we missed the beginning of the game. Pizza was fine. The crust was AMAZING, but toppings and flavors were eh. Probably won't be coming back.", "author": "Kate S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "easy 3-3.5 stars\n\nDrive by this place several times and decided to stop in for lunch - going to try 2 slices : pepperoni and Sicilian. \nLine to order - Long. 15-20 people and it is moving REALLY slow. Order at a counter then you go sit down. \nCommitted myself to try this spot otherwise I would have already left. 20+ min wait to order seems ridiculous. \nSeating - sparkly populated. Tons of open seating. \nOrdered. 5 min wait is what I am told.  Took less than 2. \n\nSicilian : square slice, focaccia bread style pizza, thicker crust.  a little too much bread for me but was still a solid slice.\n\nPepperoni : large traditional slice, prob 6\".  tons of peperoni but a bit heavy on the grease.  Good, but not great. was a bit underwhelmed.\n\n8 beers on tap - ok selection. About half are local. \nDozen beer options in bottles/can. Mostly crap.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "Carb load.\n\nBay To Breakers tradition: Friday before the race we meet for carbs. \n\nLast year: http://www.yelp.com/biz/cotogna-san-francisco?hrid=eT2RgOM2LuhEWZq2l86RkQ\n\nThis year: Pizza slice topped with tomatoes and basil, homemade foccaccia with grilled chicken and avocado and pasta with tomato sauce.\n\nRich flavor and fresh ingredients were consistent across them all. Prices varied from a too expensive $13 sandwich, just right $5 pizza slice and a $9 steal pasta.\n\nReturned for a potent if slightly bland Americano ($3 included sugar free vanilla syrup). Discovered the sweet, spongy cinnamon bread pudding brilliance. $7 and so worth it.\n\nSpace continues the rustic and inviting feel of the old Ironside: http://insidescoopsf.sfgate.com/blog/2015/03/23/ironside-to-close-tony-gemignanis-slice-house-moving-in/\n\nStaff has an earnest, friendly vibe that makes you feel welcome and valued.\n\nBay To Breakers result: One second from a personal best (55:29).\n\nSlice House result: Four stars.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "I usually picky with Pizza but I have been here several times and have never been disappointed. The order process is quick and the staff here has always been great!", "author": "Steve S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-15", "description": "Cashier dude was super rude.  I got the special slice of the day for $7 and it was def not worth $7 plus tax.  Flavors did not impress at all and it tasted dry.  Asked for a side of ranch and they were trying to charge an additional 50 cents, hail to the naw.  The worst part was the cashiers attitude tho.", "author": "Esther L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Dude. This place is delicious. Every single thing I have had here has really been a great meal. There is no need for articulation after so many reviews. Just come here and spend ten bucks on a beautiful slice and a beer and have some good mouth feels.", "author": "Niana D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "I wanted a meatball sub, but alas.... they were out. Had a slice (cheese pizza) instead. Crispy crust. Nice tomato sauce and perfect amount of cheese. So looking forward to trying the other variety of pizza slices.... and getting that meatball sub!", "author": "Darrin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Best slice in town! Giant like the \"Giants\".  Don't even think of going to a baseball game without smuggling in a pie from this awesome place!", "author": "Stuart C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "Quick stop before the Giants game and the pizza was perfect! Although it is a little pricey. 35$ for a pitcher and  a slice of cheese pizza. Definitely will come again when I'm in the city. I love the upstairs seating too", "author": "Chelsea N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-31", "description": "ok. i know my pizza standards are practically unreachable to US pizzerie, but WOW was this pizza (and establishment) especially fucking terrible (which reminds me... a long time ago i went to their location in north beach and they forgot my order.) \n\nanyway...\n\ni walk in. the restaurant is not busy; there is no line. homeboy at the register sees me but doesn't bother to acknowledge my existence at all: we're off to a great start. i say hello to him. i go ahead and order a slice of cheese since it looks like the freshest pizza, only to notice that there is an entirely full plate of cheese underneath, from which he chose my slice (of course). it's whatever. so i wait for my pizza at the counter. once homeboy #2 running orders slides my slice at me with a weak \"here u go,\" i see he has without any prior notice already put parmesan cheese on my pizza. i don't even know why you're supposed to say 'already' when i don't ever actually put parmesan cheese on my cheese pizza. seriously americans... what the fuck is up with putting bad quality cheese that sits out ALL DAY, FOREVER on top of your (cheese) pizza ??? why did he put *A TON* of parmesan on my pizza without asking ????? \n\nwhatever. i deal with it. i put oregano on top and walk out. upon my first thru last bite, i realize... this pizza has no distinguishable pizza flavors. i couldn't taste the tomato, couldn't tell you if it was fresh, canned, seasoned, i have literally no idea because i couldn't taste it. the mozzarella (if one could call it that) was less flavorful than string cheese.... the crust literally could have been a piece of cardboard and i wouldn't have noticed any difference. it kind of tasted like... cardboard with essence of stinkbug.\n\nsave yourself $5.50(+) and trek to arinell's or golden boy if you're really craving a dank slice. it's worth it.", "author": "Yves D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "Much needed addition to the neighborhood. Generous sized slices, thin crisp crust, yummy ingredients, and quick service make this a fav spot.", "author": "tureg u."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "I was salivating over the fresh and uncut cheese pie but when I ordered my $5.00 cheese slice I got some slice that was not from that fresh uncut pizza pie. I was disappointed because it was old and over-cooked. I'll think about going back.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "Oh noooooooooooooooo...\n\nTony, tony, tony (not the band)... what happened?\n\nAs you can see by my other reviews I am a fan of Tony. But this place was not good. I don't want to get into details. I was really disappointed.\n\nService, pizza, price... all poor. Giving two stars because I've only been there once and maybe it was an off day. I hope so Tony, I really do.", "author": "Pink F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Hands down, the best slice of pizza i've had in a good while. Found this little gem thanks to a friend who's walked past this place on several occasions but never stopped. \n\nNice outdoor seating, good for people watching. Inside is a little cramp, and there is one big bench to sit should you be inclined to do so. \n\nWas really craving a pepperoni pizza, but unfortunately they were out, so opted for the sausage, and was not disappointed. My friends each got the meat lovers and picante. All great choices. Definitely a fan, and most certainly coming back.", "author": "Laurens D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "Spoiler Alert - Tony G makes the best pizza in California, and has an uncanny ability to open new restaurants and maintain that quality even if he isn't making the pies. Must help to teach at a pizza school :)\n\nBut if you are on the way to the ballpark, this is a great slice to bring in. I have been there twice, and both are great - his thin crust and thick. I haven't tried the meatballs yet, but if they are anything like his other locations, I am sure they are fantastic as well. \n\nGood thing I don't go to as many games as I used to, or else I would be putting on a decent amount of pizza weight.", "author": "Sam A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-22", "description": "For starters, it was our first time here and we are hella lucky to live one block away from this joint. I started my dinner with a mixed green salad and my wife with a spaghetti with some type of amazing spicy sausage of some sort. I think she meant to order some other pasta but they brought this and it was pretty dam goodie! Then we ordered a pie with cheese and basil;.... Mmmmmmmm. Perfect! Perfect ration of sauce, cheese and basil, but we ordered our pie extra crispy and man!..., let me tell you! It was !!!! Something about the crust is just totally different and super delicious! They say New York pizza is all about the water they use for the crust, but I'm pretty sure that's not the case here, just solid fresh ingredients! We waited about 10-15 for our pizza, so the service for timing was excellent! Thank you Slice House Crew! We'll be back next time with friends and family!!!", "author": "david g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Best meatballs / meatball sub ever - one of my favorite foods which I've tried in many different variations across the world. Amazing flavor, texture, sauce, cheese. The bread is garlic bread which makes it awesome. Service was friendly. BTW pizza is awesome too, especially the chewy cheese they use.", "author": "Sergei B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-08", "description": "Pizza is very good but the service was poor. Waited 45 minutes for a large pepperoni. The manager did cover the pizza once I brought the wait time to his attention. Would come back.", "author": "James L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "This is an easy one...great pizza...if you like pizza, go there and eat the pizzas.  The only downside is if there is a baseball game happening it can be a bit of madhouse but seriously, just go and the pizza, it is bomb!!!  All of them!!", "author": "David P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "This pizza shop has a nice pub ambience to it. Located just a few blocks from where the Giants play, this place can get rather busy during game days.\n\nI came here and grabbed a slice of Sicilian and some German Wings on the side. The pizza slice was pretty big and almost filling, but the wings topped my dinner off nicely. Since I ordered one of the slices off the windowed display, a food runner came and delivered it at my table after they reheated it in an oven. It's not as good as a fresh baked pizza, but for around 5 bucks, it was pretty satisfying.\n\nThe wings were pretty good in terms of flavor and how easily it came off the bone, but it certainly wasn't freshly made. I could tell they reheated them because the thicker pieces were a little colder on the inside. It wasn't ice cold or anything. It just wasn't fresh.\n\nOverall it's a pretty nice place to grab some grub before a game. They have a good variety of beers on tap.", "author": "Trent L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "I LOVE Tony's Pizza Napoletana. Almost every trip we make to the city includes a stop at Tony's by Washington Square. After catching the Giants Vs Orioles game at AT&T park, we thought we would save ourselves some time yet still get our Tony's fix by stopping in at Slice House. We entered the restaurant where there were 3 or 4 tables taken, and no line. The girl at the counter was very unfriendly. My husband and I each ordered a slice of pepperoni, and I also got a slice of the tomato pie. We took our seats, and about 5 minutes later were handed our slices. I guess they reheated them in their oven because the pepperoni was blackened and burnt, and way too greasy. The beautiful white mozzarella cheese on my tomato pie looked like a toasted marshmallow, and was completely hardened (see my picture). Our meal was inedible. Maybe the slices are good when they are fresh out of the oven, but the service and food we received in no way even resembles the delicious food served at Tony's original establishment. Save yourself a major disappointment and just go to the original location.", "author": "Julianne G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "We made it in just in time before the restaurant was about to close after a Cubbies Vs Giants game. The pizza was excellent!! We ordered each a single slice of pizza and it was huge. I would highly recommend this pizza place. This would be an awesome place to just drink beer and eat pizza and enjoy watching sports. Go CUBBIES Go!", "author": "Nicole Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Not a huge variety of slices, but REALLY REALLY delicious thin crust pizza. \n\nI got the tomato pie with cheese and basil. It's a generous slice (I had one for lunch and was full). Crispy crust, thick and creamy sauce, overall a super enjoyable meal. \n\nIf they had a few more toppings options for by the slice, I'd give them a 5, but they just opened, so it's totally reasonable they launch with 3 options. \n\nI'll be back!", "author": "Dimple B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "okay -- I ripped them a new one when they deserved it -- so I now must update my review, as they seem to have solved the problems I talked about in my first review.  \n\nNow, amazing pizza with competent service too.  I ordered a 'custom' pizza -- which I figured would be Not Possible -- but I was cheerfully accommodated.  And the kinks in the service with takeout seem to have been worked out.   \n\nHighly recommend and glad to have these guys in the neighborhood.", "author": "Jaina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Finally tried this place. Now I know why Tony's has won so many awards for best pizza. The thin crust has good texture and crunch when you take a bite. Will be going back often. Slices start at $5. Monday-Friday's on non-game days they have happy hour prices.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "What can a say the reputation for this place stands tall. Fine establishment with awesome slices! Living in Cali is hard for pizza lovers, but I can easily say you'll feel like your in New York with the slices. Try the pepperoni just nicely sauced with a perfect spice to the pepperoni. I HIGHLY RECOMMEND!", "author": "Idin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Love this brunch! Great food, great staff and love that they have the Giants playing on the big screen!", "author": "Kristy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "1 slice of pepperoni pizza = heart attack. But it's that good! Lots of pepperoni, super duper large slice & it's made with zero zero flour which is the best! Long lines during game times but other than that solid place!", "author": "C A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-22", "description": "Someone brought two of these pies to a Warriors party two weeks ago.  I was addicted immediately; best pizza in the city by far.  So good I have been there myself twice in two weeks.  Pretty pricey at over $30 for a pizza, but ok by the slice.  Perfect crust, aged cheese and not skimpy on the toppings.  A new favorite.  Parking sucks.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Best DARN pizza I have ever had. Reminds me of NY pizza except the quality of the ingredients seems to be better here than over there!", "author": "Mel S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "This place has potential because the pizza was actually not bad.  However, came here on a friday night and they were out of everything.  The only pizza they had left was cheese and peperroni.  On top of that, prices are a bit steep.  Really wished this place gave me a better experience but it didn't and here we are....me writing bad yelp reviews when i dont really want to.", "author": "Vince L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "Pizza is fantastic. I wish I didn't have to wait in such a sloooow liiiiiiine. It's pizza slices. Shouldn't you be able to keep a line moving during the lunch hour?  20 min long line is average wait.", "author": "Bumbaklot R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "They seemed to have fixed there service issues.... Thank goodness. \n\nThe pizza is still great for a slice... Gotta try the happy hour.", "author": "Jon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "Got the cal italia pizza for lunch. It supposedly won a gold medal, which is definitely well deserved. Pretty big, I split it with my coworker and we were both stuffed. Wasn't too expensive either, came to about $26. It was delicious, the fig jam was very unique and tasted great mixed with the prosciutto. I would definitely stop by again. It did take awhile for the pizza to be finished though, so if you're in a rush, this might not be a good spot.", "author": "Sean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Dangerously great.  I've always been a big fan of Tony's North Beach location, but I don't make it that way too often.  The new Slice House is just a couple blocks from my office, and, after my first visit, I'm afraid of reverting to my college diet of pizza and... more pizza.\n\nI'm originally from New Jersey and have high standards for NY-style pizza.  Tony's is one of the few in the Bay Area that can legitimately claim to do it right.\n\nMy only criticism is that the slices are a bit pricey, but you can make a full meal out of one of them if you're so inclined, given the size.", "author": "Brian T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "Our first visit here based on a recommendation - very nice pizza place ! They offer slices, small \"2 person\" pies and larger as well, as well as salads and meatball sandwiches. Slices include pepperoni, cheese, Margherita, and specialty choices. Large slices for about $6. Was going to try the pasta but - strangely - the pasta is only available after 3:30 pm !  We think it would be a good lunch option, not sure why the time limit on it. The 13 inch is $24 and offers nine styles. We opted for the Genoa - pesto, mozzarella, sun dried tomatoes, castelvetrano olives, feta and roasted garlic cloves. It was delicious and just the right portions of all toppings, especially the pesto which we loved.  Also had a classic Caesar salad (with anchovies!) and the artichoke pasta salad - both were good sized and excellent taste. The place itself is of nice ambience - wood interior and cozy feeling, with TVs and a second floor seating area as well. Very busy at lunch, mainly take-out service and it was easy to get a table. No table service (except food delivery) so be sure to order at counter before claiming a seat. Overall a nice lunch - but next time a salad and ONE slice would be fine - took two slices of the pizza with us because we just ate too much !!", "author": "Mark K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-29", "description": "Ordered a whole tomato and cheese pie togo.  Came severely overcooked.  Crust was dark brown and so crunchy my teeth hurt. The cheese was dead  This place is only good when the owner is watching the food go out. I was really disappointed and so were my  friends that were visiting from out of town.", "author": "C F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "Relative to the neighboring options, this place is easily a 5 star. Objectively, this is a good solid 4 star pizza joint. Pizza is great, but not life-changing. Salads are solid and priced appropriately. Get the meatballs if you're avoiding the evil carbs... damn good. There's beer on tap... what else do you need to know? Don't waste your time trying on a Giants game day, surely it'll be packed to the gills.", "author": "Trey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "Good pizza but what a cluster fuck. Lost our order. Overall crowded and disorganized but I do have to say the pizza was pretty good", "author": "Sanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Are you kidding me? It does NOT, repeat NOT get any better than this. Fantastic. My only complaint: make the slices smaller lol. Their huge!  Worth the price. I'm hooked.", "author": "M D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "First time there with a groupon and will definitely be back! We came in about 30 minutes before they closed and we got our pizza's super fast!! Cashier (Dillon) went out of his way to  be helpful and friendly, as well as the rest of the staff! Pizza was hot and fresh!! Spot on!!", "author": "Stacy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Pizza at the slice house was amazing. Great atmosphere and really close to the stadium. Would definitely go here again.", "author": "D R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "The Groupon Gods shined on us - rarely can you score a $50 deal for $25 at a place you want to eat at.  Clearly the Slice House is jammed during Giants season and games and is quite other times. The pizza was excellent and it is mainly because of high quality ingredients and killer gravy or red sauce ! The meat balls are also excellent and benefit from that damn crazy good sauce ! Happy hour M-F is a time to return for $2 slices and beer specials ! Go and eat great pizza here ! Tony, this boy from da Bronx is glad youz are here making quality pies !", "author": "alan c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Omg heaven in my mouth!!! The pizza was the best I've ever had in my life and I eat a lot of pizza! Definitely worth the wait! Waited about 25 minutes. The actual restaurant 3 doors down was a 2 hour wait. I'm super happy with the pizza I got! Pepperoni!", "author": "Jez G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "This is the best slice of pizza outside of any of my favorite Neapolitan pizza places or that one Pinsa place.  There's nothing even a close second to this pizza.  Yeah it's a little expensive than id like (at $3 a slice this would be a steal) but at least the slices are a bit bigger.", "author": "Sanket K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-10", "description": "Been here twice and the service was a let down both times. This time was just the last straw. Took an hour to get the pizza and when I kept asking someone about it they kept ignoring me. After 45 min I asked how much longer and then they realized they forgot to put my order in... not a single apology.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-24", "description": "Normal menu / pizza by the slice:\nThere's something about their sauce that I just can't get enough of. Whether it's on a meatball or on a pizza, it's absolutely delicious. I also really like their pizza crust, but then again, I'm a crust lover. You're more likely to find pizza remains whose crusts have vanished on my plate when I leave.\n\nNew brunch buffet:\nMy husband and I stopped by this morning and saw they had their new brunch buffet open. They had a bit of everything - breakfast pizzas, frittata, lasagna, spaghetti, meatballs, and then breakfast favorites like eggs, potatoes, and bacon. In general, it was delicious. Their lasagna was delicious (have I mentioned how much I like their sauce?) and their custard french toast was pretty killer. Actually, it was a bit more like bread pudding made from french toast, which is totally ok with me. All in all, a delicious experience.\n\nOne piece of feedback for Slice House is that their brunch serving sizes are a bit too big. Their breakfast pizza slices and frittata are the size of a normal slice. Considering one of those slices can be basically a meal, it was hard to try everything I wanted to try. I'd love to see them do much smaller portion sizes for a buffet so people can sample smaller bits of more things (without preventing people who want to go all-in from doing so).", "author": "Erin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "The thing I love about their pizza is this: it's good cold. I don't know, the hot pizza is overwhelmingly satisfying but cold? Awesome as well!", "author": "Dominique S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Went here for the first time today, and I already knew their pizza was gonna be good! They have the pizza displayed at the front behind a glass. They look so greasy and they are packed with meat! I'm giving 4 stars because although the pizza was great the customer service was not so much.. Their employees are young but not very friendly or enthusiastic, they could definitely have a better attitude towards their job. I get it, no one likes their jobs but jeeze don't show it that much. Other than that, everything was fine. Definitely would return.", "author": "Diego D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Came here for dinner last night in a group of 12 so we got to try almost everything! Meatballs and wings were great. Mixed green and Caesar salads also great (I personally prefer the crispness of the Caesar, anchovies added great flavor). Bucatini pasta was also great! I've never tried/seen this pasta anywhere else; it's like a mix between spaghetti and udon noodles -- much thicker and more elastic than your average old spaghetti. Sauce was also hearty and had just the right amount of spice. We also tried the grandma and a regular pepperoni/mushroom pizza. Everything was yum! Can't wait to come back!", "author": "Sabrina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-12", "description": "good pizza by the slice.  i had the tomato and basil pie, and my brother had the sicilian.  both of us liked our pizzas, and they were quite filling.  \n\nthe slices here are cheaper and better tasting than the ones in the ballpark, so if you are going to the giants game, come here for pizza!", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Super tasty high quality food in a nice atmosphere at a fair price. And the music is not annoying. I love Slice House.", "author": "Allison V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-22", "description": "Good pizza but slow and without service. It inexplicably takes 20 minutes to get slice of pizza even though it is already made and waiting. Drink refills have to be requested by walking up to the cashier with your glass. Don't bother sitting upstairs as you will be forgotten entirely by the staff.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Way better than your average pizza-by-the-slice place.  Great beer selection as well!", "author": "William B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "The pizza here is great and so is the atmosphere. I'm from Chicago so I have a high bar for pizza, and this place meets it. Multiple big TV for watching sports, and great craft beers and drinks. There are great deals for happy hour and during Giants games, and trivia on Sundays at 5. Overall a great sports bar/pizza place in the city.", "author": "Katharine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Great spot for a casual meal. We kept it simple on the pizza side and just had a tomato pie with mozzarella and basil. The sauce was just sweet enough and the grains in the dough made for an interesting and delicious crust. The surprise standout was the bucatini. I would definitely recommend trying the pasta dishes. Very fresh and surprisingly reasonably priced.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Best pizza I've seen so far in SF.  If you want the fancy pizzas order early.  Also remember you've got to eat pizza hot!  The fact that they have Sicilian pizza is also rockstar!", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "For the longest time Escape From New York pizza has been my favorite in SF but Slice House is a strong rival. Their crust is so tastey - chewy and crunchy with garlic and cornmeal on the bottom. We ordered a full pizza, half pepperoni and half mushroom, basil, sundries tomato. Both were delicious!", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-15", "description": "I love to grab a slice at the Slice House. They have a good variety of pizza to choose from. They also make it super convenient to be able to just get a slice of pizza in lou of a whole pizza. The slices are around 5 bucks so not too bad. The service is quick for a pizza place, and nice employee's as well.", "author": "Ronald B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Came here after I received a coupon for it at Chronicle Books. \n\nHappily happened upon their happy hour, and got a slice of the Grandma w/ a pint of IPA. \n\nLegitimately one of the best slices of pizza I've ever tasted. Fresh, delicious ingredients; really cool specials; very cool aesthetic. \n\nOverall great experience. Definitely coming back.", "author": "Marissa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Good-sized, flavorful slices that pass the \"droop test\" (by not drooping when you fold and pick them up). However, it's not my favorite pizza in SF nor is it the least expensive.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "Fast, delicious and no more driving to North Beach! Win-win!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "I have never written a review before leaving a restaurant, but this has been a truly exceptional experience!  Really cool atmosphere. Greeted by the lovely Maddie, given tastes and histories of their delicious wine selection, super friendly and helpful in pizza description. :) AND THE PIZZA IS AMAZING!! And then there was Hunter. He was incredibly generous and sweet. Needless to say we will be back. With everyone for happy hour and dinner!! Thank you staff for some awesome eats.", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "We have been going to Tony's in North Beach for a few years now and always love it so decided to try his Slice House offering while staying in the area. \n\nThis is still Tony's! Still excellent pizza. We stopped in for a slice at lunchtime and was great to get a slice of Tony's pizza and be able to sit and eat it inside (was raining at the time so this was a double bonus).", "author": "Dave A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Very good pizza. I've only come for lunch since I work nearby. My go to is always a slice of their pepperoni (sometimes 2). It's so cheesy and delectable and everything you could want in a pizza. They usually have a 'daily special' pizza that's worth a try. Last Friday it was purple potato, feta, bacon, and pesto cheese. It was insane, so good. Prices are good, its about $5.50 per slice. I usually get two slices and then waddle back to the office. Also their meatballs are also good and great to share if you're in a small group (3 for $5).", "author": "Elizabeth W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "The best pizza in San Francisco.  Seriously.  I recommend the tomato basil.  Not only is it a hefty size, the ingredients are so fresh and the crust is the perfect balance of crispiness and starchy fluffy middle.  Just avoid going here when there's a Giants home game.", "author": "Tammy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "Delicious  large slices, fresh gourmet ingredients, my office mates are loving it too!", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Tried this place out with a Groupon, and glad we did! The food was phenomenal. The portions are gigantic. The meatballs on the meatball sub are the size of baseballs. The wait time is a bit long, but we think it's worth it. We also really enjoyed the decor: rebuilt wooden tables and wooden walls - a nice look. We loved the upstairs - got to see the kitchen make the pizzas below. Definitely coming back here to try different things on the menu!", "author": "Convict T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "The pizza and salads were first rate. I  would recommend the Slice House highly just based on the yummy factor. We tried 5 different pizzas and a couple of the salads and ALL were excellent. From plain cheese to the Popeye to the Wiseguy each pizza was a stand out depending on what you like.  \nWe had a great experience having a birthday party here. What REALLY stood out was the awesome lead staff. Maddy was so inviting and encouraging when we inquired about making a reservation. The follow-up and professionalism which Danielle provided made moving forward with our party planning a breeze. I  just wish this was my corner pizzeria!", "author": "Ernesto C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Among the best gluten free pizzas you will find in the city. Go for the Wise Guy. Staff is very cool and friendly in ten out of ten visits. Happy to have them in the neighborhood.", "author": "J D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-02", "description": "Save your money unless you have a few beers first to wash down the greasy pepperoni pizza\n\nBest to go to Tony's places in North Beach", "author": "Matthew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-14", "description": "Second straight day that I was given cold pizza. So frustrating. Won't be coming back. (never got cold pizza from the walnut creek location, hence the 5 star review I gave them)", "author": "Brooke F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "Dee-rish-us ( Pizza). Way to go guys. :) Friendly staff, great environment for a game. I work in the area and will definitely come back.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "My favorite is a slice of tomato pie.  Their sauce is tangy and sweet at the same time and they pile on the mozzarella.  I also like the Grandma Sicilian style pizza.  Their crust is chewy and so satisfying.  Love that they sell by the slice and it's an easy place to pick up dinner on the way home from work.  Husband likes the meatball sandwich.  The mixed greens salad is also very satisfying with lots of olives, cheese, and glazed walnuts.", "author": "Nina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-28", "description": "I have eaten many times at the Slice House.  Last night was a major disappointment.   Pizza quality was poor (less cheese and pepperoni).  Was not the same pizza I had a week ago.  Quality down and they raised the price of a slice.   Sad, not sure why meatballs still good.", "author": "Fred H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Great pizza and salads. A great place to stop on your way to a game or if you are visiting AT&T Park. The staff were helpful and friendly. My kids loved the pizza. The slices are huge.", "author": "Marc H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "Friendly and welcoming service. We ordered 3 different slices, meatballs, Caesar salad and wings. We brought a 2 yr old toddler who doesn't eat pizza but tried theirs this time loved it!! They were so nice in offering to cut the gigantic slice into tiny pieces for her. Free refills on sodas too. It's the little things that make an experience enjoyable. The food is delicious and the atmosphere is great.", "author": "kelly y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "Now been here twice, both times for dinner.  I think whole pies are the way to go, either the individual 12\" (which you can easily share if you have a salad) or the enormous regular pizzas.  The slices, I think, don't fare well when reheated.  Portions of everything are huge -- from the salads to the pizzas\n\nHits:\nQuinoa Salad is terrific and (tastes) worthy of a fine dining restaurant -- an unusual choice for a pizza place near the ball park.  Quinoa, citrus slices, goat cheese, currents, frisee, onions artfully displayed in a light citrus vinaigrette.  \nCaesar is tasty but not as exceptional.  \nBoth standard veggie pizzas are good, but the Pesto is better.\nGarlic bread covered with whole cloves of roasted garlic.  Huge portion.  \n\nMiss:\nAncient Grains salad made with quinoa pasta is lacking in flavor versus the other choices.\n\nThe pasta and other items looks good -- will have to try them another time.  .", "author": "Greg K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-31", "description": "After being underwhelmed at pizza rock in Vegas I decided to give tony g another try when I stopped in San Fran this past week. What can I say other then another poor experience. Slice was cold and not spun out properly. Dough was bland and under proofed. Rookie mistakes for such a seasoned operator. Never trying another slice", "author": "Steven A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "The pizza is amazing, but they just started serving brunch and it is our new favorite spot.  You can get everything from eggs and bacon to an amazing slice of lasagna.  The meatballs and marinara are so delicious...it's like brunch with your favorite Italian family.  Throw in bottomless mimosas and sangria...heaven!", "author": "Mike M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-22", "description": "Order 3 slices and a salad togo. Got 2 out of 3 and was told sorry - cashier must of rang it in wrong. I know what I ordered", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "What a great addition to the neighborhood! Got an opportunity to have some delicious pizza today---thank you Julia! They also have fast and tasty breakfast items. Everyone was very friendly. I have been in a few times, had breakfast, pizza, and meatballs. Can't wait for my next visit to try more! A special note to anyone complaining about a long wait for food---- if there is line, and lots of people are placing orders at the same time as you--- what the heck do you expect!? Ithink it hilarious how a lot of the people who eat out around here expect a high quality, delicious product, at fast food speed. Long wait or not, Tony's is worth it!!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Came here for Sunday Brunch. Was nicely surprised. Had the buffet which was excellent. Also pizza is some of the best I've had in the city.", "author": "Randall K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Great service and great food! The Genoa was amazing and they have a great selection of beers on tap. I'll definitely be making this a new go-to for Friday work lunches and baseball pre-games.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "Great addition to the neighborhood! I went here on a Friday game night and got a slice of tomato basil, plain, Sicilian and grandma and a side of meatballs to go. The order was served up quickly.  The plain and Sicilian were my favorite, especially when dipped in the marinara sauce that accompanied the meatballs. The crust at this place is truly delicious. I'm so excited to have a regular pizza spot now and I will be back often.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "Great Pizza, but as a local resident I'm frustrated that it's impossible to tell when exactly they are open.\nThe hours on Yelp are incorrect. It shows up as open on Yelp, we walk there  at noon on Sat, and they say they don't open until 3p on Sat.\nThe hours also change on Game days.\nThere's no information on the storefront either.\nI want to go there and eat on non-game days w/o standing in a long line, and that's not possible right now.", "author": "Ash M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Awesome Pizza!!! The pasta was also amazing. Always eat too much because the food is so good. Our Saturday night   quick go to place instead of the long lines in North Beach.", "author": "Sharon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "Awesome by the slice pizza, make sure you get there before the lunch/dinner rush or you'll be waiting in line for a while.", "author": "Hannah Grace P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-12", "description": "One of my favorite places ever since I moved around the area. My go to pizza was the delicious grandma's pan pizza. I sometimes would order through postmates and realize a few times I got it, it looked and tasted different. I thought possible they got my order wrong, but I just found out recently they changed the recipe. It is still good, but not as amazing as it was before. I am really sad :(, since that was one of the reasons I would come here was for that delicious slice of grandma's pizza. Please change the recipe back!", "author": "Victoria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Super crispy tasty crust & sauce. Loved the Sicillan pizza. The Caesar salad with anchovies were so fresh and delicious. The huge meatballs and chicken wings were also great. Lots of parking and seating during non-game days.", "author": "L L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "I'm a big fan of their North Beach location, and this new spot doesn't disappoint. I got a tomato, cheese, and basil slice for $5.50. It was just about perfect. The crust, which is easily the best part, was crispy and dark on the bottom, but nice and fluffy once you bite into it. The cheese was just the right portion, and the sauce was nice and savory. They sprinkled fresh basil on top before serving so that it didn't dry out in the oven. It was easily one of the best slices of pizza I've had in SF.\n\n$5.50 does at first seem a bit steep for one slice, but given the neighborhood, the quality of ingredients, and the portion size, it's well worth it. My only real complaint was the long line and wait time, which ended up being about 30 minutes for a to-go slice. Given that it was their first or second day open, I'll give them a pass for now.", "author": "Evan O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-06", "description": "Went there before a Billy Joel concert at AT&T. They do not handle large crowds well. Line out the door, no seating. Cafeteria stile. Had to stand by someone table that was almost finished to get a seat. They ran out of forks, asked the buss boy three times for a fork to eat our salad. Pizza when you order a specialty pizza is great takes 20 to 30 mins so don't order this if in a hurry. Pizza by the slice is ordinary. Only cheese and pepperoni available and Luke warm.  Would give it more than two stars if the service was better.  My wife has a gluten allergy. They had gluten free available for extra cost. $25 for a 12\" pizza.  Wow welcome to SF.", "author": "Kerri B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "Love the pizza, but the operation is pretty sad. In the last two months, I have gone in multiple times and three times, they have been \"closing\" anywhere between 1.5hrs to 45 min earlier than their posted time. Happened today with more than 45 minutes to spare, and we were told it was slow because of Mother's Day so they ushered us out. Frustrating, it's the best pizza in SOMA, but so unreliable. Heading to our number two choice, and will probably not go back since we never know if they will be open and operating.", "author": "RochelleRochelle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-01", "description": "This place is awful! The server was extremely rude to multiple customers. The pizza slice selection is non extant. My friend ordered a basic slice of cheese pizza and they presented her with an almost inedible hunk of cardboard. We asked for some ranch dipping sauce to moisten said slice and he denied us this opportunity due to the refrigerator being closed. Don't waste your time, you've been warned.", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-09", "description": "Don't believe the hours posted here and on their web site. Tried to stop here on our way home for a quick bite. We arrived Monday night at 9:20pm. The doors were closed, and they were not interested in serving us. Their posted hours say they're open till 10pm.", "author": "Armen A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-27", "description": "Pizza is decent, but don't bother if there is an event at AT&T Park. Very busy and you will not be able to order beer, or eat in. Good for take out sloces only. That said, the food is OK.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-26", "description": "This pizza is on a whole 'nother level than anything else in the neighborhood.  A simple slice of cheese is a perfect study on the art of making a perfect pizza:  glorious cheese with fine seasoning atop, rich flavorful tomato sauce underneath, held together with a perfect pizza crust, foldable and flaky (eat your crust Jimmy).  Their meatball sandwich is also off the charts....3 delicious meatballs covered in sauce tucked inside ridiculously tasty and flaky bread.  And the Sicilian slice is as if it was sent from heaven.  I can't say enough great things about this place and how it has stepped up the game in the neighborhood.  Well done Tony...I hope you thrive in this location for years and years.", "author": "Mike Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-22", "description": "Being a regular at Tonys in north beach which we absolutely love, we figured we would try the slice house as it's closer to where we live.....BIG MISTAKE!!!.....called up and asked for a cal Italian and a margherita $59 for 2 pizzas..of which the margherita was 20 inches which I didn't realize until I got there...REALLY!!.....paid for the pizzas when we got there and had a beer while we waited, time went by, the server said nothing and no one came over to us, so I looked around after 20 mins or so and there were 2 boxes with pizzas in them under a heat lamp that was turned off so we end up picking them up and taking it to our table to have one slice while finishing our beer. The margherita (tomato pie) was barely warm, stodgy and finished with a lot of that cheap looking cheese that you buy from the grocery store on top. when we got home I opened the cal Italia and it had huge lumps of fig preserve on it and burnt (black) on the bottom, way too much and very very sweet, felt like I was eating dessert. Totally not worth it, not to mention we tried to go a week earlier at 5 pm and they said they were closed when they advertise they are open until 7 pm.", "author": "Graham W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "The pizza was five stars. Those little pepperonis and the tomato and cheese pizza were both fantastic! However, even for soma this place is crazy expensive. A slice of cheese for five dollars, oh man. It's good but not quite that good!", "author": "Ethan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-18", "description": "Probably the worst customer service I've experienced in a very long time. My boyfriend and I came in on a Monday evening, around 7m. We thought we'd grab a quick bite to eat before the Giants game. We ordered and sat upstairs, where there were probably about 3 tables occupied. We waited and drank our beers that we ordered to go along with our pizzas. We noticed everyone around us getting their food except us. We figured they had to make a new batch of pizza for our order, so we didn't think much of it. Then about an hour passed and still no pizza! My boyfriend finally asked the front what was taking so long, and they said they were busy and lost our ticket! They offered to refund us for our pizza, which obviously was expected. Then I came downstairs and asked them what happened. They simply ignored me and gave us our receipt, showing us of our refund. I asked again, what happened?? Again, ignored me. I asked numerous times and they said they were JUST busy...BUT at least I got to down my beer! Really? So we missed part of the Giants game to wait an hour for some pizza we were never even served? I'm never coming to this place again and I will definitely encourage others to do the same if they don't want to waste their time.", "author": "Jane G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-09", "description": "Wack. Wack wack! This may be pizza to San Fran. But I live in New York and this sure as hell ain't pizza. It's so horrible it tastes more like a sweet pie then pizza yuck. Absolutely would never get again. And for $5!!! I would go to the absolute best pizza in New York where the guy stepped off the plane from Naples and pay less then that! Yuck!", "author": "Leya r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "This is awesome that we do not have to go to Washington Square to get Tony's pizza.  The only drawback, according to the dinner menu, is that you cannot get all the specialty pizza's that I  love at Tony's Neopolitina. The reason why I did not give this location Five Stars as I do the original location, is attributed to that on Giants game day their menu becomes very limited.  So  this little fact was not known to me or well publicized.  Not knowing this fact, I walked to Slices for two  whole pizzas as take out. I was only able to choose whole pies from what slices they were serving (pepperoni, cheese, grandma, and Sicilian). So if you want more of a selection  check to see if the Giants are in town.  Even though it was limited the guys made a fresh whole Grandma and Pepperoni pizzas for my take out.  For two whole pizzas expect to shell out over $75.00", "author": "Robert J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "Pizza is great, but the hours of operation are baffling.  There is no way to tell when this place is actually open without calling.  Yelp! posted hours of operation are way off.  Saturday they don't open until 3.  Sunday sometimes they close at 3.  They are also \"subject to game day changes\".", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "just moved into town and looking for a good goto pizza place.  found it here,  great atmosphere and pizza is great!", "author": "Wilson K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-29", "description": "newly opened wtih much hoopla and always a crowd.  went today early for lunch..  slices are double size of standard slices and therefore not overly expensive, but cheese used is very salty and not to my taste.  what was worse was that the slices were served warm but not hot. also had an order of meatballs and plate was hot but mealballs were cold, and had to be sent back to go into the microwave for re-heating..  certainly not world famous in my estimation...", "author": "ira l."}
