{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Amazing service! Came here the other day because I really wanted to try the smash burger and fries, and could not be more impressed.\n\nThis place reminds me of a Chick-fil-a version of McDonald's or some other burger place. I ordered a shake and was really impressed to get not only the shake in a nice glass but also a second glass of all the 'leftover shake' when they were mixing it.\n\nLove the burger, love the food, will definitely be back for the service.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-28", "description": "The line, was super slow. There was a guy just trying to use the coupon on his Smashburger app and something went wrong and the coupon voided? Instead of handling it on the side, the manager? Or whoever the guy was , took forever dealing with it holding up the rest of the line. Next time, consider doing triage on the side. \n\nThe food was alright. Got the burger with the mushrooms. One step above a fast food burger, nothing more. 3/5\n\nSkip on the pickle chips. Really salty and soggy! 1/5", "author": "J P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-21", "description": "Mediocre at best. \n\nI would like to admit, I am sitting here intoxicated and I heard this place was bomb. Since I was in there area, I thought I would give it a go. For a fam of four, we paid a little more than $50 for burger and fries plus a kids meal. Legit, being that I have been drinking cause I just got out of the Rugby world championship, I would say, GO TO IN N OUT, go anywhere!! Jesus, I was so unimpressed and I was so excited to try their food that I think the disappointment hurt more than it should have.", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-17", "description": "The food was good enough and the staff was very friendly and did the best they could however they were immensely under staffed. Everyone around me at the other tables seemed to be bothered and complaining about the turnaround time with the orders. I enjoy smashburger but this location does the chain terribly. Again the workers were great and hustling and bustling just no way they could keep up with the quantity if customers while still providing high quality service. \n\nI'll continue to eat at smashburger but never again at this one.", "author": "Walt W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-28", "description": "They are slow as hell!! Geez. I should've went to McDonald's!! Great burgers but horrible service.", "author": "Jermaine J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-14", "description": "Oh how the mighty have fallen.  I went in today and it was tragic how bad this place is now.  20+ minute wait for food, incorrect order (other tables also experienced this), dirty dishes overflowing on most of the unoccupied tables, and now they will automatically charge you for the \"big\" burger unless you explicitly say you want the smaller / regular portion.", "author": "Meow S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-04", "description": "Buffalo burger should be avoided at all cost. Got a mushroom Swiss last visit and it was amazing. But after this experience not sure I will come back", "author": "Toby D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-26", "description": "I won't be coming back. What you get is too little for what you pay, $7.89 + .67 tax, total $8.56. \n\nPros\n- The space was nice, clean, quiet and has a pleasant atmosphere with the pop music volume set low enough to bear. \n- The chicken burger was flavorful, albeit a little too salty. \n- The staff was friendly and attentive. \n\nCons\n- The burger was sloppily assembled and oily. \n- It was a very small burger, a 4 inch bun and 1/8 inch sliver off a chicken breasts. A perfect serving size for an 8 year old, maybe. It's was really more like a slider. \n- Lighting could be a little brighter - kind of romantic, though, or meditative. \n- AC kept the temperature on the cooler/cold side. \n\nOh well, we live and learn.", "author": "Ed C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-01", "description": "pretty good burgers here nothing super special but the burgers are better than fast food burgers. Definitely better than burgers I make for myself as well. Fries are perfect and there is ample seating. They serve protein style which is nice and bring the food to you. Fan of the classic burger--the patty is well salted.", "author": "Lydia Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "It's a pretty decent place, but they make a lot of mistakes if you do the \"Craft Your Own\" burgers. I have been here a couple of times and each time they were incorrect with my order.\n\nWe were here last night and they got pretty much everything wrong...lol So if you are really picky about your burger, you may want to order something from their preset items.\n\nI do like their food though. They have a variety of proteins to choose from and the prices are pretty reasonable. I especially like their fries. They are like a skinny, crunchier version of McD fries and their Smashfries (tossed in rosemary, garlic &olive oil) are delicious! The only problem is once you start eting them, you can't stop.\n\nBoth beef and turkey burgers are juicy and flavorful. If I'm in the area and nothing fancy my palate, I'd usually go here.", "author": "Alice L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "Tried them for the first time, yummy. I placed an order online in the am and my crispy chicken salad was ready as promised.  Fresh and hot!", "author": "Aj C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-15", "description": "The burgers are fine, but the staff here is the reason for 1 star.    They are consistently rude and slow.    God forbid you have a special request -- they will make sure you know how much effort they are going through to help you.  \n\nThis attitude isn't isolated to just one employee or just one visit.   It comes from the manager at this store.  \n\nDo yourself a favor and visit another Smashburger location", "author": "Kinson S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-23", "description": "First time I got fast food in years... and it was almost exactly like I remember... disappointing.\n\nThe bf and I first got the idea to go here when he saw they had a BOGO deal and neither of us had ever been before. \n\nThey're located upstairs in the top complex so we didn't immediately know where they were as they don't have a street level sign anywhere. \n\nOrdered the Sin City that has a fried egg on top, although I wished it was a soft yolk but I guess I can't expect that here lol. First off, their egg bun is really greasy- so greasy that whenever I'd set the burger down, I'd have to wipe all the excess grease off my hands... every single time. Gross. \n\nI do like that they offer sweet potato fries and salads as healthier options but they kind of mess that up when the fries are sitting in a pool of grease. Couldn't eat the bottom half cuz there was so much grease.\n\nWhatever. It worked fine for the BOGO sale, I can mark it off that I tried it, but I'd never come and pay full price.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "STAFF: friendly helpful and quick (kitchen staff main fat guy RUDE AF)\nFOOD: done sloppy ( I gave me sweet potato fries instead of wedgy fries which was upsetting)\nCOST:$25\nOver all review:  I would not ever eat here again I feel like the assistant manager that was on duty was a little rude along with the stick kitchen staff the main cook I would not recommend this place) I asked for fries not to be salty and the assistant manager goes to the cook like yeah she wants to change it she just came up to me now and wants to change it basically making me feel like I inconvenience but then when I am the customer I am the paying customer. Hey seriously need to get their act together this is the fattest food place get used to the constant changes of menus and orders never again will I step foot in this place", "author": "Lei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "Never been to a Smashburger, so had to try it.  Feels more like an In-N-Out than a Super Duper.  That is it's high quality fast food (e.g. In-N-Out) rather than slightly more refined \"fast casual\" (e.g. Super Duper).  Don't get me wrong, I'm totally loving it as a fast food burger contender.\n\nClassic Smash: I'm a huge fan of the Maillard reaction, so can totally appreciate a burger patty that tries to maximize it.  It's  patty that is literally smashed so it has as much crispy surface areas as possible.  The umami crunchy goodness from the patty dominates the whole burger experience, in a good way.\n\nFried Pickles: These were great.  Not too much batter and not too little.  The pickles were nice and crisp, not limp and soggy.  A nice tartness in each bite to contrast the rich deep fried coating.  A creamy dipping sauce to add another flavor dimension.  The only complaint I'd have is that an order is way too big for one person.  The sodium heavy nature of the pickles makes it hard to get through more than half.  Kinda wish they offered a half-n-half with one of the deep fried potato options as the other half.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-03", "description": "Burger chains are a dime a dozen these days, and in my opinion Smashburger occupies a tenuous spot in the whole spectrum of them. It's a fast-casual place so is ostensibly slightly higher-end than In and Out, but in my opinion does not quite rise up to Five Guys or Super Duper levels of quality and scrumptiousness, even though it has a far larger menu.\n\nI found the food at this location to be OK. The large BBQ bacon and cheddar was fairly priced given its size and quality. Tip: if you're hungry, go with a large instead of a regular. Meanwhile, the onion rings were OK, sort of like diner quality, and indeed the entire experience felt like diner fare dressed up in a standardized venue as opposed to a retro, independent one. Everything came out in a reasonable amount of time.\n\nThe manager on duty when I stopped by was exceptionally outgoing and courteous, checking in on folks to see how their meal was and offering promotional coupons for subsequent visits. Overall, a very decent visit.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "Came here for a quick lunch during my work break, but what I encountered was not quick at all!\n\nFood: The burger was solid. Great quality angus beef, nicely toasted burger buns, an all around awesome burger. The milkshake was super creamy and thick- delicious. Basically drank it down in 30 seconds because it was so good.\n\nService: This place is basically an upscale fast food joint. However, the already limited service was incredibly disappointing. My burger took ages, and only after I was done and waiting around to head back to work did my milkshake finally come. They had to apologize because they forgot to bring it to me. With all the free time I had waiting for my food, I looked behind the counter and all the servers were just hanging out, drinking milkshakes, even though the place was fairly busy and many customers were being ignored. The only one who was working hard was my server, Sean. He was super friendly and apologized several times for my food being late, even though he was basically the only one running around and helping everybody.\n\nOverall, the food was great but the amount of time I had to spend at a fast food joint was just not worth the trouble. I might return for take-out!", "author": "Hannah S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-12", "description": "\"Trung?\" goes the guy at behind the front counter about to take my order..\n\nOMG! LMFAO... despite never really ever being in this area, and pretty much the only time I came to this location, of the guys I met from the San Jose Coleman location works here. He had come down to San Jose for training for a week or so and being a regular, met him and got to know him for a bit. He was just as surprised to see me as I was.\n\nAnyway, besides the obvious service being great and being recognized, the food and experience itself lends to be very pleasing. The fast-casual environment that Smashburger provides complements most people who are looking for a place to sit down and eat while still having something besides the cheaper, low quality fast food options.\n\nPricing is pretty ok, though might be high for some folks. The catch that gets you coming back are the coupons and rewards that you get. After your first time, you're pretty much set for all the following visits. It is why I am pretty much a regular at Smashburger (granted not at this location though). If you're in the area, then sure, check it out.", "author": "Trung N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "The perfect burger and cheaper than McDonalds everything is great and sometimes I get 10$ off best coupons ever just downloaded the app", "author": "Devonnie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "Came here for a quick lunch, since I was in the neighborhood. Got the turkey burger with avocado and swiss, and an order of veggie fries to be healthy. \n\nOverall it was good. Just a bit overpriced for what you got. But if you are in the area, not a bad option for a good, quick bite.", "author": "Sonia A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-06", "description": "My husband and I indulge at smashburger at least once a week! Well, I take that back. We use to be weekly patrons. The workers are super nice especially Jaime. He knows our name and recognizes us. However, there is a Filipino girl that seems to always be groaning. My to-go order was wrong a few times, so my husband suggest to check the burgers before we leave. I always order a burger with BBQ sauce. It even says it on the receipt. I told the girl who took our order that I ordered a burger with BBQ sauce but the cooks forgot to add it. She looked at me like I was being difficult. I even said a side of BBQ will do, they don't have to make me another one. I was very polite about it since we do go there weekly, but she decided to huff and puff and walked a few steps to get me my BBQ sauce on the side.  \n\nThe burgers are good when made correctly. We always get a create your own. But with that kind of attitude I rather take my money and spend it at Togos which is a couple doors away or even McDonalds that's across the street. Customers that is willing to do business with you is actually keeping your ass employed. No customers = No Money = No paycheck. So before you want to throw someone attitude when it's not even their fault, think about if you really need a job. This wouldn't be a big deal, but this happened more than once!", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "Really tasty food. i love that they have brussel sprouts if you don't want to eat fries. \n\nFor the love of god, though. they cannot get an order right. You have to check multiple times on the order, if you are getting it for take out check your order before leaving the store. Typically 2-3 things will be wrong. I told the girl at the register 3 times that I wanted 2 orders of fried pickles, of course when I got home there was only one order on the receipt and in the bag!\n\nThey have two older gentlemen running the food, they are really sweet and nice and on top of it. The people working the register are out to lunch though.", "author": "ellen c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "It's just a very disorganized place. The food is ok, but the service is a circus of failure. To go orders sit on the kitchen counter for forever being seemingly invisible, this confuses the kitchen staff as much as it confuses me. The waitresses will pass by it multiple times, look directly at it, then proceed to sweep the floor and/or unpack some spoons instead of giving it to you. Save yourself some time and just go get it. Ordering is almost as successful of an experience.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "Ordered a \"lettuce wrap\" burger with blue cheese and sautéed mushrooms. \n\nThe \"lettuce wrap\" wasn't really a wrap- it was two pieces of green leaf lettuce and a turkey patty smacked right in between. Everything pretty much fell out and I resorted to eating this thing like a salad.\n\nThe extra $1.39 and $.70 cents I paid for mushrooms and blue cheese was appalling. I couldn't even count this in MyFitnessPal; that's how minimal of a portion size I got for these two add-ons. One would expect a decent serving size of cheese and mushrooms. Instead I got 4 slices of canned mushrooms and 1/8 tsp of cheese.", "author": "Angel F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-07", "description": "Smash burger has me all the way fu**ed up. I essentially wasted a bunch of time before throwing $25 in the toilet. I got a regular sized Club smash burger with sweet potato \"smash fries\". Smash fries are just regular french fries that are tossed in olive oil and Rosemary. Tip: don't order things that are fried and then tossed in oil -_-  I really didn't like the rosemary flavor  & these fries were just dripping in oil, it was REALLY unappetizing. I didn't finish the fries because they were really grossing me out, and the words \"I didn't finish the fries\" has never before been uttered from my mouth so....\n\nThe burger was just OK. The meat was flavorful and crusty, the way you'd dream a smash burger to be. But the couple thin slices of brown avocado hurt my feelings and the greasy fast food style bacon left a lot to be desired. \n\nSo then I ordered another burger  the truffle mushroom chicken was HELLA good. But so tiny guys srsly wtf. This burger was 3 bites, literally less substantial than a McD's cheeseburger. The regular smash fries (don't ask how I know this) were less gross than the sweet potato ones, but EVEN GREASIER and still gross and the portion was less than half the amount served with the sweet p'tates.  So all kinds of fries were left behind, never thought I'd see the day.  So I'm driving home and all the sudden I just feel super green. Good news is that I didn't throw up. Yet. But I'm positive I will before the night is over and that's why I should have just thrown my $25 in the toilet and saved myself some time.  \n\nSo, probably the better idea is to order the large size burger instead of being like me ordering a regular size burger and then realizing it's not enough food. I can't attest to whether a large burger would be enough but this place is super overpriced and it was annoying to me to see things like digital menu screens when they should be saving their money on those frills and offering bigger portions. I came in here at 7 o'clock, peak dinnertime hour, and the place was completely empty. \n\nI also didn't like how I could see the cashier pre-scooping the metal milkshake containers full of ice cream and then putting them back in the freezer to wait for somebody to order one. It takes five seconds to put ice cream in a cup so why would you pre-scoop it and then just let it sit in the freezer to get freezer burn? She was making like six or seven of them & the place was totally empty. I noticed that she was weighing the ice cream, so I imagine that's why she was doing them ahead of time, so that her stingy boss doesn't get mad at her for putting a teaspoon too much ice cream in somebody's milkshake. Smash burger: that's a bad idea, don't do that anymore. \n\nAnother thing: this cashier was handling money and then scooping ice cream with no gloves on and she also had her long curly hair in kind of a wild ponytail and when she would lean over to scoop the ice cream, her ponytail would slide off her shoulder and into the freezer. This is why you shouldn't have people who are trained to be cashiers handling food.\n\nOkbai.", "author": "Emma H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Smashburger is a level higher up than your regular fast food burger chains. It's fancy enough to warrant a higher burger price value at $6-8 tier range. Good location since it's within the Potrero Center so there's a convenient parking lot available. Very clean interior space and it reminds me a bit of a Shake Shack. Definitely check this place out especially when they're offering BOGO promos.\n\nSMASHFRIES\nBasically super thin shoestring fries. Delicious with the herbs dusted on top but extremely oily and greasy. The highlight really is the ketchup because I noticed that it tasted slightly sweeter than the regular Heinz ketchup and then I checked the bottle at the table and saw that their ketchup was made specially for Smashburger. I actually like their secret brand of ketchup more so than regular ketchup. \n\nSPICY JALAPENO BAJA \nBurger presentation is pretty fancy as you get it in a metal tray basket lined with their Smashburger wrapping paper. The burger comes in two halves so you have to do the \"smashing\" of the burger yourself. Beef patty is flavorful and grilled nicely. I wish it had more guacamole on top though. I ordered a big size and was surprised that it came out looking like a regular size burger. It was the perfect size for me though so I'm kinda wondering how small their small might be.\n\nThey have Haagen Daaz ice cream shakes that look pretty good served in a sundae cup. I need to come back and try their shakes one day. And if you're less inclined to have a burger, they also have salads!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "Walked out because the manager was yelling very loudly at kitchen staff. He was extremely rude and unprofessional. He was screaming and belittling staff in front of customers. Sadly this isn't the first time I've seen this happen at a Smashburger.", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-21", "description": "Black bean veggie option, was ehh... their shakes are good though, worth the trip alone. \n\nMy friends who eat meat all said they loved it .", "author": "Rio J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "Burger is fine, but the menu is confusing and the service is poor. I asked what the difference between classic and regular was, and she said, \"Once again, the regular is a five ounce and the large is a six ounce\". \n\nI came here about 2 years ago, and the place has just gone down hill from there. It's more expensive than McDonald's, and food comes out extremely slowly.", "author": "Sheewon B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-16", "description": "Ordered a grilled cheese combo to go. Got home and found a cheese burger with fries all over the place and not 1 fry in its container.\n\n\nLuckily I am not a vegetarian. \n\nTook a LONG time for them to make this too with only 3 other customers waiting.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-23", "description": "This place is amazing! Always have great food!!!! Servers are helpful and courteous. Today's on duty MANAGER IS AN ABSOLUTE A**HOLE!!! Sat on his a** in a booth for 30 minutes shouting orders at the staff, telling people to get off the clock and telling them to work faster. 6 customers in line and still just sat there. Then FINALLY stood up l, still yelling, and began to pick up orders. Upon one guest asking if he could get his to go order that was ready in the window, manager rudely snickered \"well did you pay for it?\" And then finally handed it to him. I've never seen this manager before usually is a nicer one. Won't be back if this is the shift that this restaurant is taken", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "Been to the Smashburger Sacramento and enjoyed my time, experienced this one and unfortunately had a terrible experience. Our food was picked up by an older gentlemen before we were finished. My sister got a cheeseburger and the cheese wasn't melted, the bathroom smells like a homeless man. \nThe best part was that it was picture worthy food, and the fries were fried. #smashburgersf", "author": "Joeline C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "First time trying smash burger, got the pub burger. Good price, very flavorful & cooked to my liking....just really oily. Amazingly impressive customer service!!", "author": "Dav K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Today was my first time eating here, and I must say that the food looks great. I ordered the Jalapeño burger meal with sweet potatoe por and it was really good.  The place was clean, and the staff was friendly courteous.", "author": "Denis R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-25", "description": "Smaaaaaaaash beeeeeegers is the place to b egg fong and chef I'm getting off late I'm gay I think I need to pee", "author": "Oso O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "So I had never been to a smash burger before today! Everything was perfect! The burger was delicious. I had the triple double pub burger for $4, which I think is an amazing deal! Didn't even break $5 after tax. My only complaint was that the burger was too either... oily or just wet somehow. Maybe the from the onions? The customer service was amazing! The manager and the staff seemed to have a good relationship which is always nice to see. The manager also actually helped out! He went to the tables and made sure thing everything was good and he even helped me when I couldn't figure out what to get. 10/10 would recommend!", "author": "Krista C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-28", "description": "This is my first time trying this place.\n\nThe assistant manager is a complete rude a-hole.  The rest of the staff were nice.\n\nThe burger was mediocre at best. McDonalds is better.  The burger was sloppy and wasn't very appealing.  The tater tots were good.\n\nNever will I eat here again.", "author": "Seth T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-18", "description": "Gave my order to another person. Wait another 20 min after a 20 min wait. Smh my whole lunch hour was spent waiting for my burger. Had I not asked about my order i would have waited another 20. Not a happy experience!", "author": "Nessa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "I was given a gift card from one of my colleagues, it was not one of the regular burger spots I have ever tried so I figured why not try it out.\n\nI was able to sample there own original smash burger and the bbq bacon and cheddar burger. The patty was smashed I guess thats why it is named smash burger, I believe this place is a chain, read few of the reviews didn't expect much going in. So let me break down everything, the food, the restaurant, the service.\n\nThe food, 2 burgers, the original smash burger served with smashed 6oz or 8oz patty with red onions, tomatoes, lettuce and slightly toasted bun, add your own condiments, grade B- despite it being oily, the burger was good, good meat to bun ratio, not super heavy almost light burger again minus the dripping oil from the burger. The BBQ Bacon & cheddar burger, if you have had carls jr big western, this is the same exact thing, only difference instead of onion rings here it is lightly battered onion strings, the bbq sauce is prominent on every bite 6oz or 8oz is offered cheddar slice is heavy, even ordering an 8oz barely tasted the meat grade for this burger C, copy cat burger, oily, could not taste the meat even though it was an 8oz. The fries offered are the regular thin cut type fries deep fried and seasoned with salt lightly, the other is the smash fries, garnished with olive oil, diced garlic and rosemary; splurge on the smash fries, the vanilla shake was heavenly, heavy froffy, delicious so bad for diabetics haha if you can sample their shakes\n\nThe location is in the protrero area in the city, odd choice for a burger spot but I guess it works since the next closest location is in Alameda, very clean inside, very polite staff. Parking I believe during work week is a nightmare, only assuming because during a holiday week it was still packed unless you park by petco on the opposite side of parking lot\n\nThis spot for burgers is ok, nothing super fancy, just decent made burgers\n\nFood *** burgers are meh, vanilla shake is must try, the smash fries I recommend over the regular\nPrice $$\nService **** helpful and pleasant staff\nAmbiance **** clean, open, high ceilings, uniformed tables and chairs", "author": "Clarence A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "Sean (the assistant manager) completed a door dash order instead of taking my order. He was passive aggressive, loud and awkward. He also talked to his nice staff this way too. He yelled Linda's name and ordered her around like she was his pet. (Linda is a nice looking old lady who runs the food to the customers) This shouldn't be the case at such an easy to run place like a smash burger. I'm disgusted at the customer service here.", "author": "Mike G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-30", "description": "One of the worst burgers I have ever been served. Both patties burnt into charcoal mini discs. These were the smallest little burger patties I have ever seen.", "author": "INTHECITY S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-31", "description": "First time here. Lady at the cashier was really nice and helpful! Ordered three burgers, two smash fries, one regular fry, and a salted Carmel milk shake. \nShake had the consistency of water or should I say milk. I asked them to make it again only for it to be the same. So I went to the nice lady at the cashier and told her about it and she said she would make it herself. It was better. We waiting so long for our food. We order cheese on our buglers but two came out without it. Food was ok. Not worth the price I paid and I won't be back, ever.", "author": "Brandie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "I can not believe I haven't heard about this gem shower.  It took my 13 year old son to mention a location in Sacramento, to have my first \"Smashing Experience\" (TM).  \n\nThe meat (beef or chicken) explodes with flavor.  Nothing is pyre-made; i me. I.e. a all made to order, do everything is piping hot.\n\nGreat place.  Now, I drive across San Francisco to get my almost daily fix!!!!", "author": "Randall S. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "In the area looking for a place for a takeout lunch, I remember attending a YEE at a Smashburger at the 16th & Potrero shopping center. Though it's a large complex with a large parking lot, this lot was crowded. \n\nThere wasn't a line and I was able to walk right up to the counter and place my order.  Within 10 minutes, my order was ready.  \n\nSin City Burger - haystack onions, Applewood bacon, fried egg, cheese, Smashburger sauce (mayo, mustard and relish blend) on an Egg bun. This was a limited time burger but it is off-menu now.  My favorite Smashburger.\n\nSweet potato fries. \n\nGot my burger and fries.  I was happy.", "author": "Al L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "Visited this place many times, quality wise is very good place. This particular review is about my current visit 04/06. Food was ade to perfection but store was not clean at all. Store management need to pay attention to cleanliness of this place...", "author": "Jagmit S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Very clean and great food. HOWEVER, the assistant manager is rude. That kind of misogyny may be accepted in other cities, but it will not fly in SF. I obviously don't know the whole story, but fighting with your staff directly in front of the customers does not bode well with me. Additionally, shaming my bf for not paying for my meal is unnecessary.", "author": "Savvy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "TLDR: Taste good, don't customize or be prepared to wait. Service was aight.\n\nCame here Sunday afternoon and place was empty. I got the Avocado Club with fried chicken $7 and a Large Smash Fries $4. My order came pretty quickly. Smash fries were goooddd but the extra olive oil made it really greasy. The fried chicken sandwich tasted great. It's like an expensive McChicken to be honest haha.\n\nStory time: My cousin ordered a BBQ Bacon & Cheddar burger but subbed cheddar with pepper jack. Her order took super long (were they buying the cheese?!). When it arrived, there was no bacon or onion. Now, how are you going to give a burger WITH NO BACON? BLASPHEMY. So she went and told them. They took over 20 minutes to remake the burger (why couldn't you just slap 2 pieces of bacon and call it a day? Were they getting that bacon fresh from the pig?!). When it finally returned, everything BUT the pepper jack cheese was on there. By this time, she just gave up and ate. Just terrible.", "author": "Benita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "I visited again and I'm convinced this is the best it gets as far as fast-food dine in experiences go, which makes it worthy of 5 stars - exceptional for the class of establishment it's in. I actually had a beef burger this time, great flavorful taste owning to the extra browning of the smashed meat and fresh ingredients. The ordering process was efficient. The service is astonishingly great. Linda the cashier happily took my order, informed me of the 20th Anniversary special, and brought my food to my seat. She also checked in on other patrons and goes above and beyond.", "author": "Truc N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "I agree getting your order right happens every other time but the freshness and the flavor of the food along with the great personality of the Store Manager Tom makes this my last minute go to. I don't eat meat so I love how they can make any burger style with a black bean patty. Yes lol it came with bacon that I had to take off, but still a good spot.", "author": "Vonny K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-24", "description": "Love the burgers. But probably the most disorganized burger joint ever. \n\nOn several occasions I've waited beyond 20 minutes for a couple burgers. Tonight it's been 25 minutes already and no sign of burgers yet.\n\nKind of absurd. Not a review I'm pleased to have to write. \n\nGet it together please, for your business' sake, if not for your customers' sake.", "author": "Rob G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-30", "description": "\"Can I get a triple double?\"\n\"Sure! ... By the way, there's a 15-20 minute wait right now\"\n\"Did you say 20 minutes??\"\n\"Yes... we just got a big order\"\n\nWtf... who waits for 20 minutes for a single burger?? I could get a burger faster than that at a restaurant and this is supposed to be a **fast** food place...\n\nI don't know what's up with the \"fast\" food joints in this strip mall, but they are decidedly not fast...", "author": "Anton G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-01", "description": "I hate this place but my son likes their burgers.  Way over priced.   They're rude and often get my order wrong but the little Asian lady is nice.  I often receive regular fries although I order smash fries. The older guy who acts like the owner or the manager is rude af.  I wish there was a in n out close by.", "author": "Urban E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-22", "description": "If you've never had the spicy jalapeno Baja with the Chipotle bun from Smashburger then you are definitely missing out. They fill it with lettuce, tomatoes, onions, guacamole, jalapenos and their specialty Smashburger. It is gorgeous to look at and taste even better. The prices at Smashburger are on the extravagant side so beware of that. The burgers here are definitely delicious. They are slightly small and it would be better to get two. See you again soon Smashburger!", "author": "Estela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "I wasn't planning on eating here but I skipped breakfast and was starting to get hangry. After finish up my shopping at Ross, I smell a savory oniony smell as I'm walking back to my motorcycle. I look around to see where the smell is coming from and realize there's a Smashburger. I had heard about this chain from my sister in law, because that's where her three kids always want to go for burgers. I figured I would try it. \n\nI was surprised by how few people were there for 11:30am but it's not exactly a high profile location. The inside was clean. The service at the counter was prompt and friendly. My burger came out fast and they brought it to my table. The 6oz. Colorado Burger was all I ordered, but it was pretty dang tasty. It's a limited time item which is why I tried it. So glad I did. It was a topping-loaded, cheesy meatball of flavor, with a spicy kick. The manager came over to see how my food was and gave me a coupon for a free side with my next order.\n\nI would definitely recommend the Colorado burger. Even though my bill was $8 for just the one 6oz burger, I left satisfied. Although it was my first meal of the day so I fill up easy. If you have a hearty appetite you should go with the 8oz.", "author": "Izzy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "5 stars for Thomas.  Came here on a Friday night around 9pm. They were short staffed. Thomas was manning the whole front end...taking orders, making shakes, delivering the food to the tables and all with a smile on his face. Super nice guy.  Oh and the burgers and fries are good too.  Get the smash fries.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "Pretty good! The place is located right in the Potrero Center (go in the parking lot, not on the street as Google Maps says). Parking was ample on a Saturday and the place is clean. Service is fast and there is plenty of seating. Overall I enjoyed my burger (came in with w B1G1 free offer). The standard prices listed were higher than I usually do for a burger (though with the offer was quite cheap). Manager was friendly and conversant. Overall a solid local burger joint (especially compared with the janky McDonalds across the street).", "author": "Mikey J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-09", "description": "Terrible service.  Website for orders is down. So I call, and they say they won't take a phone order.  Go someplace else, where they give a darn about their customers.", "author": "Bryan H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-13", "description": "Very inconsistent with their service. They always get my order wrong and the portion of fries is terrible. As the cook brought out food he was getting every order wrong. Just waiting for our food, 4 in a row was wrong. Ever since this place opened its been like this. Corporate needs to do something about this place", "author": "Brian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "There's definitely parking available but scattered around the plaza.  Just a warning, the bottom floor smells like pee a bit.\n\nI've ordered online quite a bit from this place and they usually get it wrong somehow...so I've decided to order in person after a few mishaps and they get it right each time I've ordered in person.  The food is usually pretty good compared to other fast food places like Mcdonald's and BK.  I usually order the burgers here and it tastes a bit more upscale. I usually get the big patties and it seems like they smash the meat patties more so it looks bigger. The burgers doesn't taste like dry meat with a wad full of condiments and that feels refreshing compared to the other fast food joints I'm used to eating at.\n\nA bit of a drive with traffic, but definitely worth going to for better fast food.", "author": "Eric T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "I was in the area and pretty hungry so stopped in for a quick bite. The classic turkey burger was much too salty. The fried pickles were also severely over salted and very greasy. I wanted to like this place, but for half the price I can get a tastier meal at Jack in the Box. There was also only one cashier on when I visited at 6pm on a Sunday. Each transaction took about 3 minutes, so with 3 people in front of me I waited almost 10min to order then another 10 to get my food. Behind me was a line of about 6 people. There should have been a second cashier for sure. I won't be back.", "author": "Tanya K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-28", "description": "This place is weak AF and expensive AF the bun they use is super low quality.. I make a better burger", "author": "Gerardo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "I didn't realize it's been six months since I've been here the prices went up but the food is really good. now you have 2 size fries small or large yes of course well might as mk it a Large!  Ahahaha! \nThe service was really good the chicken was done the way i lik it.....\nHot fresh and fast to you and they come ck see how was everything. \nWell be bk sooner then 6 months. LOL! \nIf you give them an email on your birthday you get a free milkshake you don't even have to purchase anything you just want to come and get a dessert or whatever you prefer..", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-13", "description": "I got 2 classic smashburgers, chicken and beef, a regular fried and a regular soda for $22!!!! Very expensive and the burgers are small", "author": "Irfan M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-21", "description": "STAY AWAY FROM HERE!!!! Unless you want to wait for about an hour or a day for your food! They are not organized at all here. Don't know what's going on in the kitchen? While we were waiting for our order amongst with everyone else waiting others were getting other people's orders. This location needs to get it together!! Corporate needs to restructure!!", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "The taste is good I wish they fries was a lil bigger but they good my burger was ok I got the avocado chicken grilled with ranch bacon grilled onions and lettuce i said no tomatoes but they put them on there anyway I asked for it to be cut in half NOPE and got the wrong bun whole wheat but hey guess I needed the whole wheat bun besides that food was good just wish they actually read the online order and not throw anything together", "author": "Johnika J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Moved to the area last year, and was sent a neighborhood flyer regarding their location so thought I'd give it a try. Annnddd I'm really glad I did! I ordered the Spicy Jalapeño Baja burger with a side of Smashfries, Coca Cola, and chocolate milkshake (#dontjudge, this girl can eat lol), and was in a severe food coma after consumption. This little gem is underrated, and super delicious! It also helps that the restaurant is kept very clean and the customer service was excellent.", "author": "Mona M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "Normally I don't rate fast food chains because I pooh-pooh them. Oh wait, here I go... \"Pooh-pooh!\" There, I feel better now. I am, however, willing to take exception for Smashburger because I frankly never heard of them before they decided to take over the old Blockbuster Video space at the Potrero Center where I go to the Safeway anyway. I go to I Luv Sushi & Teriyaki, too, so I'm no food snob, y'see. And besides, Jamie W. misses going to Wendy's when there used to be more of them in the city. So I'll just keep my 'pooh-pooh' to myself in the privacy of my home where I can roll my eyeballs as much as I want.\n\nWe came here one Sunday evening when we needed a burger fix and was surprised how empty it was. There are all sorts of instructions on the wall that you're supposed to follow. But we're guys so... I just went up and kept looking at the overhead menu until I was ready to order as the cashier heaved a series of sighs to hurry me along. I went for the $7.39 Bay Big Smashburger with Truffle Mushrooms and Swiss Cheese along with an order of their Smashfries and a 22-ounce Diet Coke. It added up to a bit short of $13. The burger was a wide, flat patty, rather greasy as the cheese was epoxied to it with the mushrooms melted into the cheese (photo: http://bit.ly/1wT8Mgj).\n\nIt was OK but nothing that would worry In-n-Out in my book. The Smashfries were strangely thin like potato sticks but flimsier and greasier with a bit of seasoning on them (photo: http://bit.ly/1tS487g). I frankly think I would have preferred some White Castle krinkle fries instead because I like the bulk. Jamie did a switcheroo on me and went for a Spicy Baja Jalapeño Smashchicken. Whatevs. So we came back just recently feeling like I should eat a little lighter. Where else should I go but Smashburger? Am I right or what? This time I ordered the $5.99 Baja Cobb Salad with fresh greens, sharp cheddar cheese, crispy Applewood smoked bacon, tomatoes, onions and quite inexplicably, a fried egg.\n\nWithout knowing the egg was coming, I also requested the Grilled Chicken for $2 extra. It was all excessively covered in a spicy chipotle dressing, and the mix of egg and smashed chicken was too much for me (photo: http://bit.ly/1yr1mmb). I hate having the parent-child poultry together if you know what I'm saying. I skipped the Smashfries this time in favor of the $2.99 Veggie Frites, which are green beans and thickly julienned carrots combined together and flash-fried (photo: http://bit.ly/1CPYzYI). Oily, very oily. Nice attempts at some different things you wouldn't expect from a fast-food chain, but it just didn't quite come together for me.\n\nFOOD - 3 stars...the burger isn't bad but kinda greasy and overpriced, the salad's a  better deal but a bit overdressed...they do give you plenty of choices\nAMBIANCE - 3 stars...fairly spacious for a fast-food space and never that crowded when we're there\nSERVICE - 2.5 stars...a weak area but it is a franchise after all\nTOTAL - 3 stars...fast food joint with bigger aspirations but still middling in execution", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Smash is one of my favorite fast food places to get a burger. I love their buns as well as the fact that you can swipe your own card for your purchase. Your order is listed on the screen right in front of you so you can't say you didn't know what you were ordering...maybe you just weren't paying attention. This location closes at 10p but the staff is just as friendly at 9:45p as they are at 1pm. Their burgers have gotten smaller since I first began coming but the price is still the same lol. I also love that they have someone bring your order to you whether you are dining in or having take-out. Tom has been there since I can remember and is always pleasant. Because my friend and I have unique names he may butcher them but we know that he means well.", "author": "Itika D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-09", "description": "Between The Habit, Five Guys, and now Smashburger, trendy burger joints are quickly becoming the norm. \n\nHowever, I'm not a big fan of the ol' Smash. My order took me a good 30 minutes to get, and the burger was all grisly and burnt. Fries were super oily and greasy too.\n\nI probably won't be back.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-31", "description": "Food is delicious, service is poor. They brought my wife her shake but just forgot her burger. The waitress gave her attitude when reminded of it. Uh, San Francisco minimum wage is too high, evidently.", "author": "jones z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "The 4 stars are for the good customer service the employees here give and of course the food too. \n\nI would love to give this place 5 stars, but I have 1 thing and 1 thing only that's keeping me from doing so. The manager here which is the heavier weight Caucasian guy is very rude to his employees. My bf and I come here very often and we've witnessed this guy be rude to his employees in front of all the customers more than twice. He does his managing loudly and rudely. This is probably why they always have new employees. He is not professional at all!! Go in the back office and discuss things STOP EMBARRASSING YOUR EMPLOYEES IN FRONT OF PEOPLE.!! These employees are great and do not deserve to be treated badly.", "author": "Reca A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "With a recommendation from a trusted co-worker, we were off to the Potrero Center in search for a burger. For years I've driven past their location in Novato but never had the opportunity of trying their food until today. Smashburger is a fast-casual eatery, similar to Five Guys or Chipotle. As I walked in, you're instructed to grab a menu as you make your way to the front counter. Even with 5 of 6 customers in front of us, the line moved rapidly giving me just enough time to look over the menu. \n\nThe menu is broken into two main sections: burgers or \"smashburgers\" and chicken sandwiches, appropriately called \"smashchicken\". Whether you're in the mood for beef or poultry, you have plenty to choose from with roughly 7 or so sandwiches to choose from or you can create your own. Additionally fresh salads and a kids menu are also offered. A variety of french fries are offered from traditional to spicy, as well as onion rings, fried pickles, or a side salad. Of course a burger shack isn't complete until shakes and malts are involved.\n\nI settled on ordering the Spicy Jalapeno Baja grilled chicken sandwich. The toppings sounded too goo to pass up: guacamole, pepper jack, lettuce, tomato, onion & chipotle mayo on a spicy chipotle bun. The sandwich was priced at a more than reasonable $7.29, which led me to add a side salad for only $2.99. After placing your order, you're given a number and can seat yourself anywhere.\n\nLess than 10 minutes later, my order was delivered to my table. The tray of food not only looked great but healthy and fresh. I was a little perplexed because the chicken was paper thin, making me think it was an egg, but after looking at it closely, it was the all-white grilled chicken. I took a few bites of the sandwich without altering the taste with any sauce or condiments and it was downright tasty. The baja flavors really worked well and had plenty of heat with the jalapenos and chipotl mayo. I added a bit of yellow mustard and it was a surprisingly tasteful sandwich packing plenty of flavor.\n\nI ordered my side salad with their house vinaigrette which was better than most placed. Sure, the fries my co-worker was enjoying looked better than my rabbit food, but maybe next time. All in all, the side salad was a perfect combo to the otherwise healthy lunch. Once I had finished my meal, I was satisfied; was I stuffed? No. But it was just the right amount. Overall, not only was I impressed with the quality of food Smashburger delivered but also the value in an otherwise pricey city.\n\nAmbiance/Decor: 4/5\nFood: 4/5 \nService: 4/5\nPrice: $\nOverall: 4/5\n\nPros:\n+ Beef or Chicken, your choice smashburger\n+ 7 or so specialty smashburgers \n+ Salads, fries and sides also available\n+ Fast, fresh and tasty food\n+ Reasonably priced ($11 for a chicken smashchicken and side salad)\n+ Fast and friendly service\n+ Local beers available\n+ Ability to order online for pickup\n\nCons:\n- Chicken was a little on the skinny side, beef it up!", "author": "Alexander E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "I usually come here when I have a Buy One Get One Free coupon. That is an amazing deal that can be found online.  Just print it and you're good to go. \n\nWhat I have ordered:\nSpicy Jalapeno Baja - Chipotle mayo, lettuce, tomato, onion, guacamole, fresh jalapenos and pepper jack cheese on a chipotle bun... If you like spicy, this is the burger to order. This is also my favorite burger :)\n\nTruffle Mushroom Swiss - Truffle mayo, sauteed crimini mushrooms, aged swiss on an egg bun... you can barely taste the truffle mayo \n\nSweet Potato Fries - Lightly salted and crispy to its perfection!\n\nYou can also make your own, the options are endless...", "author": "Ellen Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "First time visit here today, ordered a regular classic beef burger, tastes really good! The french fries are too thin though. \nA friend ordered a pepper jack burger but when the burger came, it had nothing but a cheese and the beef, so she asked for an exchange, and waited so long for the second burger and when the burger came, it was still not a pepper jack burger. The kitchen staffs were so careless -____-\n\nGiving 4 stars is because my regular classic tastes really good, haha.", "author": "Kukumalu M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "Nice spot for a burger joint at Potrero Center and with Smash Burger here, this place is definitely worth a visit for a quick lunch.\n\nFrench Fries and Strawberry Milkshake are delicious, it definitely is a good combo.\n\n*French Fries are thinly cut and tossed, plus it's very crispy and delicious\n*Strawberry Milkshake is made hand spun with Haagen Dazs Ice Cream\n\nMy food was brought to me in less than 20 minutes. Most importantly, service is very good and the staff members are friendly. They demonstrated a very professional attitude which is also a good thing. This restaurant facility looks very clean! The salt, pepper, mustard, ketchup and napkins were placed neatly in a rack on each table. It wasn't super busy when I came in earlier and there were seats available so that's always a good thing. Overall, positive first experience here so I'm definitely coming in again.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "This is hands down my favorite burger restaurant anytime I'm craving a burger.  I've visited this location over 20 times and it never lets me down.\n\nThe Sin City burger is my goto burger, it's juicy and delicious, I love the egg buns that it's served with.\n\nGreat service, great people, the manager Tom is a cool dude.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "I was a little skeptical with Smashburger at first. However, I was able to enjoy a few Smashburger gift cards given to me for my birthday. This allowed me to give the place a fair shot at the competition. I've been here several times so I'm going to condense my experiences into one review.\n\nI have tried several of their burgers, notably the Truffle Mayo Smashburger, Classic Smashburger, Avocado Chicken Club (crispy), and the Smashchicken Spicy Jalapeno Baja burger. They advertise a gourmet burger and are higher end compared to most fast food restaurants. They make the chicken super crispy which is a reason why I like it so much. It's probably slightly healthier too but that's debatable... Definitely get Smashfries with that. They are drizzled with olive oil and garlic! The potatoes are sliced super thin (almost like a shoestring). You'll also need to wash that down with something cold. Get a vanilla shake with that and you'll be leaving in a wheel barrow. The shake is delicious with whipped cream on top. Do it. Thank me later.\n\nBless the workers that put up with indecisive people. I was literally next in line but the large group people in front of me spent 10 minutes trying to get an order right. It was the worst experience ever... It also didn't help they all paid separately. The restaurant feels more like a sit down restaurant than it does fast food chain. The service is good too. I have been checked on more than once to make sure everything was good.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "Burger is good - but small. I asked for avocado and was given and 1/8 of one. No peppers... no to go\nCups...  no explanation why my order was brought 10 minutes later than the previous item. Second time visiting and continue to not have a great experience. In and out is still better.", "author": "Rick B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-17", "description": "Ok sort of bad service today.. No line but cashier wasn't there to take my order.. My baby running around.. I had to ask to take my order.. N ask for help for high chair.. N no one get for me !!! Turn around to fill my drink n my number was taken from table..!!! Wow ... Another jus standing by heat lamp waiting for food to come out... Really ???? I come cuz it's easy parking !!! Maybe I will stop coming here ...", "author": "Crisy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-28", "description": "They take a seasoned patty and smash on grill which is where the amen comes from . \n\nGet a double bacon cheese burger large patty grilled Jalapeños .\n\nThere is a short little black haired pretty girl slim frame and petite ... Works nights ... Was very rude even my friend noticed ... Just couldn't of been more annoyed we were there . \n\nLike she was doin us a favor taking our order.... Rolled eyes and said can't you read menu ...\n\nI accidentally put the smallest drip of Vitamin water in water cup and after buying $30.00 worth of food and tipping she rudely stated that was for water only like I did it on purpose...\n\nPlease have her go work somewhere else or get proper customer service training or human decency trainin", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-15", "description": "I was excited to discover that there was a Smashburger in San Francisco. I lived in Denver several years ago, and there was a Smashburger by my office -- I went frequently for lunch and have nothing but fond memories of how high quality and delicious the food was.\n\nMy recent experience at the San Francisco Smashburger proved otherwise; my burger and haystack onions arrived *barely* warm, if even hot at all. It was obvious that it had been sitting under a heat lamp for more than 10 minutes as the oil on the burgers had started to curdle and congeal. The haystack onions were far too salty, and again, were at room temperature. The meal I had there lacked the freshness and flavors that I fondly remember from my Denver days. I ate half the burger and only managed a couple of onion rings before I pushed the entire thing away from me. What a waste of food and money.\n\nTo top it all off, I'm pretty sure that the poor quality of food was a direct result of our less than stellar customer experience. Although the restaurant was empty, and the person working the register was experiencing issues with entering our order. He tried to enter it multiple times, and we were stuck having to give our order over and over again. During that time, however, it appeared that our first order had registered after all, but proceeded to sit under the heat lamp for a good 10-15 minutes until our register had officially gone through. \n\nAdding insult to injury, the ladies bathroom was filthy; one toilet was clogged with poop. \n\nI'm extremely disappointed in my experience. I've been such a big fan of Smashburger for so long, and was one of the chain's largest advocates, telling my friends that it was far superior to other beloved chains like In N Out and Five Guys. Guess I was wrong, because I've never had the terrible meal and experience that I had at Smashburger at either of those places.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Mmmmm I ordered the Truffle Mushroom Swiss and it was soooo delicious! The burger is so juicy/flavorful and the mushrooms were succulently satisfying! \nI ordered a large burger which I finished but couldn't finish my large fries. I also ordered a chocolate shake that cured my sweet tooth and shared a sprite with my daughter to clear my palate. \nIm making this my new burger place!", "author": "EmmettsGuRL C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "I love there mushroom burger.. super yummy. And there patty is very jucy. \n\nClean and good service place.", "author": "sean c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-24", "description": "When I first saw SmashBurger, I thought they were having an identity crisis. The word \"smash\" had me thinking this place was a gym. But \"burger\" clearly implies this place serves food. And to top it off, the font reminds me of GameStop.\n\nAt any place that specializes in burgers, I always order a beef patty burger. (Chicken burgers and salads? No thank you.) So far, I've tried the avocado bacon burger, truffle mushroom swiss burger, and BBQ bacon cheddar burger. All of them were very filling, but very greasy and heavy. The avocado was a skimpy portion, and the truffle-infused mayo was very strong and pungent. The meat patty was cooked medium-well to well-done, but it's unmemorable and not very juicy.\n\nThe sweet potato fries were very fresh and crispy, but lacked flavor. However, I do like the smashfries, which is thin-cut fries tossed with olive oil, garlic, and rosemary. It's very flavorful and delicious. Incorporate herbs into fries and I'm sold!\n\nSmashBurger is a huge step up from McDonald's across the street, but still not worth going across the city for. I do like how you can customize your burgers here. You can choose between a 4oz or a 6oz patty, select different toppings (add a fried egg!) as well as choose your bun: egg bun, wheat bun, or spicy chipotle bun. I highly recommend the egg bun--slightly sweet and very fluffy. The service is very friendly and quick. But as mentioned, it's not worth going across the city to eat here.", "author": "Priscilla W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Such an odd location for a solid burger joint. And yes, it's SOLID. Yummy burgers, clean interior, and best of all...the staff. I swear every single cashier I've encountered here is friendly and genuinely seems to care about your experience. I was there last weekend and thought it was 'business as usual' when I saw a friendly older man, 60+, at the register taking orders, a total straight shooter, friendly but not in a cheesy way, told customers \"you can have your burger any way you like\" and you could tell he meant it. Old school good customer service, I like! Well, turns out he's the General Manager (Tom) so of course I had to pay him a compliment, and it also prompted this review.\n\nBecause of the experiences I've had here, it's tempting to stop by anytime I do my grocery run at the Safeway there. Again, odd location (and wish their fries were fatter,) but definitely check it out when you need a fix. You won't regret it.", "author": "Jen E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "There is far more going on at Smash burger than you might expect. The location for instance is a bit odd, its a strip mall where you find big box retailers like Ross, Office Depot and a Petco. Sort of unsuspecting to find a great jem hidden between these types of businesses. \n\nI had the pleasure of trying everything and I can tell you that everything is delicious. The burgers and sandwiches are all totally different from one another and this alone makes it possible for everyone to find something they are going to like. \n\nFor me personally the Classic burger was one of my favorites. It's got a classic flavor that should make any burger lover take note. The way the cheese melts with the meat is so so gooey. It's got simple and clean flavors of charbroiled goodness that pair with french fries really well, it's a classic!\n\nThey have a Truffle Mushroom Swiss, that's a lot of truffle mixed with the perfectly gooey cheese. It's not overwhelming but it has a lot of flavor.  \nThe Bacon BBQ is my second favorite, it's not over the top but has that simple and clean taste. I think for me the thing it might have been missing to make it my favorite was just a bit more sauce or something to moisten it up.\nThe other burgers and sandwiches are all amazing. They have a regional burger (the bay burger) with fresh local flavors. The chicken club has bacon and chicken, so so good. And they have a vegetarian option, not my favorite but it was great. \n\nHere is the reason they are so good, it's all fresh,mostly local and they smash the burgers on the grill, they call it MEAT CANDY, how can that not be amazing? The burgers are way better than any mainstream chain. I love smashing things.", "author": "Ben M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "I had many opportunities to dine at other Smash Burger restaurants in other cities. But at that time, it never happened. \"I don't know why, so don't ask!\"\n\nBut I am very happy that the franchise has opened the first restaurant in the city's Potrero shopping plaza; a plaza that lack any decent restaurants.\n\nBut the Smash Burger franchise has changed the perception unlike many of the other chained burger restaurants. \n\nFrom the menu (posted on the wall), there are no combo meals and every item is sold separately. I ordered the \"Classic\" Smash Burger with Cheese for $6.99 and a side order of \"Smash Fries for $1.99. As soon I paid my meal (they accept my Visa card), I received a call number and sit my ass in the dining area. \n\nWithin minutes, my meal was handed to me by a well-dressed waiter. That is professional service you will not receive from other burger places. \n\nMy first bite of the famous Smash cheese burger, the burger was tasty and of course greasy. The \"Smash\" fries have thin shredded potatoes with a hint of aromatic herb of rosemary. My meal: http://www.yelp.com/biz_photos/smashburger-san-francisco?userid=HYQoxBC1y1DGPq6pGP09Tw#7mQ8c3STqhwkcE3Cox-vyQ\n\nAs I was enjoying my burger, I was continuing to browse through the menu for a definite future visit. The menu has many kinds of burgers, sides, vegan options including a salad and yes, \"MILKSHAKES!\" \n\nI am so happy that I got the monkey off my back and finally tried Smash Burger. Expect more visits from me.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "Date & Time:  Saturday September 21, 2013 @ 2pm \nDining Companion:  The Husband\nScene:  Baseball Caps & Nike FlyKnits\nMusic:  Hip Hop\nDecor:  Contemporary Burger Joint\nService:  Very Friendly & Efficient\nImbibe:  Haagen-Dazs Oreo Malt\nDevour:  Classic SmashBurger, Baja Burger, SmashFries & Veggie Frites\nTotal:  $23.76", "author": "Genevieve Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-25", "description": "Rude people that work here, can't stand that in customer service. Are you joking me Smashburger with your phone antics? I tried to call to find out more information and the guy on the other line answered, then proceeded to make me feel stupid for trying to get more info on a to go order, to then hang up on me mid-sentence. People go to a crummy chain like Smashburger for repeatable and consistent service, without that, why would you even consider going there over a better, local place? Sorry, won't be coming here again, and honestly, not having good experiences across the entire chain. Is it really that hard to hire competent people who can speak to customers without dragging their knuckles?", "author": "Jake K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Wow I can not believe there is a burger place that appreciates your business! The fresh burgers were out standing! A Haagen Dazs shake was what put it over the top ! Great food great service and great managers keep me coming back!! Did I tell you they have lots of free parking", "author": "Tom T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "You know for a fast-casual burger chain, SmashBurger is pretty darn good. I'm glad I was finally in the neighborhood, having bookmarked this place for over a year, to finally try it out. \n\nEach location apparently has its own burger to reflect the city and thus my original bookmark was for the Bay Burger - arugula, portabella mushrooms, swiss, and truffle mayo between ciabatta. I totally forgot that was on the menu and got the truffle mushroom swiss burger instead. Overall nice flavors - the truffle flavor was really faint so you could taste the juicy burger and earthy mushrooms. I also ordered some Smashfries to go with my burger and if you like crispy shoestring fries, these are totally up your alley accept kicked up a notch with olive oil and herbs. All in, not too shabby for under $10.\n\nService is decent here but I must add that they actually do seem to enjoy being at work with lots of friendly banter between the staff and that totally rubs off on you. The only downside is location. I am seldom in the neighborhood but the next time I am, the Bay Burger will be ordered for sure. Add bacon.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "I love their burgers, it's pretty good for the price! I got the truffle mushroom Swiss burger an it melts in your mouth practically!\n\nOh and get the smash fries too!", "author": "J. Alexander G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "I'm happy with the food and service. Location isn't my favorite, but cobb salad with a side of buffalo sauce with grilled chicken is my go to. Management in the evening is mature and very welcoming. Burgers are good too.", "author": "April M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "This is a great chain of restaurants, the first one I went to was in Emeryville, CA and I had nothing but great things to say about that location. Then I found this one. I usually start with the ambience then the service then the food but today I'll start with the good. \n\nFood; \nI got the Spinach, Cucumber and Goat Cheese big burger with a side of fries and let me say it was one of the best burgers I've had in a long time. I've been to many places but this combination by far is one of the best, companied with the thin fries it's awesome. Like I said on my tip always try a different burger when you come both beef and chicken. You want regret it!\n\nAmbiance the good:\nWell located with plenty of parking. The restaurant is big with plenty of seating and even a waiting table for orders to go. The decor is modern and funky with darker tones that are inviting and soothing at the same time. \n\nAmbiance the bad:\nSo let me tell you I walked in and placed my order and when I went to look for a place to sit I found plenty of tables. The problem was that about 10 empty tables had not been picked up so I had to pick one and clean it my self. I grabbed a napkin and some water to clean the table and put the dirty dishes on the side. 3 other groups had to do the same. \n\nCustomer Service the good:\nThe young woman that took my order smiled and was engaging. I have nothing bad to say about her. They need more people like her in this place to bring it up more. And let me say the back of the house did an awesome job with my food. And they really work I could see them moving and getting things done asap.\n\nCustomer Service the bad:\nThe rest of the front staff was lazy and just acting dumb in a corner. Not smiling crossing their arms as they take customers orders. Not inviting at all. They need to replace a few employees in my opinion or give them additional training on customer service.\n\nFinal thoughts:\nSo the reason I don't give them a 5 was because of the bad service and having dirty tables over 10 dirty empty tables. But I will keep coming because of the food.", "author": "Victorino R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Excellent burger joint! How is it compare to in-out? It is different and good in its own way. You would probably enjoy it. I def will come back when I have an urge for burger! Clean clean and spacious space. The staff are nice and attentive. :)", "author": "IHeartMambo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "The good first aaaaaaah the burger was okaAY? Now the bad hmmmm OVER PRICED place is a DUMP dirty I mean dirty tables I mean ok over sized meat small buns & greasy as all hell! I COULD of asked a blind man that has no sense of smell or taste probably could have made me a better burger! NASTY", "author": "Mauricio S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "I've always been a beef eater and love burgers! But I tried their chicken burgers with the condiments of my choice and realized that it's just as good and probably better than a hamburger! Wow..... The chicken is tender and juicy and the egg buns makes it taste so delicious.  \n\nSo if you're ever in the hood and need to eat something quick and cost less than a McDonald's #1 meal combo, come to this place and you'll be glad you did.", "author": "Lakeen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Smash,\n\nLook. I like you... probably a little too much.\nYou are going to make me fat... well i guess too late for that.\n\nOne thing I must share with the world is something people wouldn't expect. Get the crispy chicken version of whatever burger you want. I don't know if all smashburger locations make it the same, but that piping hot, crispy, juicy chicken is so worth it. Most of the time the chicken is twice the size of the bun. Way better than the beef burgers, not to mention a little bit healthier. \n\nI do have one \"constructive feedback\". Is that ok?\nYour fries are... not great at all. When it's fresh and hot, it's ok, but really you guys need to do something about this. I am an avid fries lover and.. I'm going to say it.. even fries from jack in the box, mcdonalds, burger king and that random mom and pop burger place down the road all have better fries. Make it a little thicker, a little more crispier, a little more salty and I know you could improve.\n\nBut hey, that burger.. wow that makes me forget it all.\n\nAlso love how you can customize your burger by adding and subtracting things. I also appreciate the fizzy water you can from the machines. Yes please.\n\nOh and it's been useful to be able to order online, except you guys have some odd little restrictions on toppings online that is not explained. \n\nAnyways.. that chicken. yum.\n\nSmash!\n\nit's all about kirby.", "author": "Paul L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "Very disappointing in comparison to the first time a year or so ago ... Probably new ownership ... Portions smaller ... Beef quality awful ...french fries like on a ration ... Over price .. Definetly cutting corners ..ruining the good name of smash burger ..this one on 16th st. Is no good", "author": "Charles J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-29", "description": "I've been meaning to try Smashburger ever since I saw they opened in the Potrero Plaza. Today, turned out to be the perfect opportunity since I needed to grab groceries at Safeway. As soon I as walked in I noticed how clean and bright the place was which isn't too surprising considering its still relatively new. \n\nThe menu was clean and easy to follow. I have to agree that it was reminiscent of a McDonald's with a touch more sophistication. One quick glance at the signature burgers and you know it is SF influenced. \n\nI decided to try the \nBay Burger: Baby arugula, sautéed baby portabella mushrooms, aged Swiss, and truffle mayo on a ciabatta bun + Smashfries: tossed with herbs and garlic \n\nBurger-meat itself needed more salt, not as juicy but was still tender \nTruffle mayo overpowered the dish and left a slick oily feeling in your mouth coating your tongue with truffle oil \nRest of the ingredients were fresh but lacked presences, I hardly notice they were there \n\nFries were your typical shoestrings, more texture than substance. The fries had a slight greasy shine to it but didn't taste heavy. The first couple handfuls were flavorful and delicious but half way through they became bland. I would have preferred more seasoning and evenly distributed.\n\nOverall Thoughts\n\nQuality is good but execution on seasoning gives me pause to give anything higher than 3 stars", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "Never been to Smashburger before! Based on this meal, I'll be sure to continue avoiding each and every  location I see, for as long as I live in their proximity. Can you say super salty, mushy bean patty, weird bun, and greasy, dried out, ancient, flavorless fries? Me too! Let's quickly return to searching other Yelp reviews and avoid this ever happening to you!", "author": "Be F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-05", "description": "16.01.13    First Visit\n\nBurger ------------------- 3 1/2\n\n\nLarge capacity.\nThey do not do medium rare.\n\nHave a nice char to the patty.\nBecause it doesn't do medium rare ... my preferred.\nIt was still kinda moist.\n\nUses a paging system ... so the food is delivered to you.\n\nOpen fountain allows you to have refill.\n\nLocated at the old AutoCenter space @ the eastern side of the lot.\nNear Daiso.", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "For a chain burger place, this isn't too bad. Prices are reasonable considering the food is really tasty. This place has a decent dining area, and it is very clean. \n\nThe staff seems pretty friendly. This will be a frequent place for me.", "author": "Taylor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-26", "description": "I have always been a fan of Smashburger after visiting their San Diego location a few years ago and when I found out they were opening a location here in the city I must say I was stoked! I have been to this location several times and honestly it doesn't seem as good as I recall it being in SD.\n\nNot saying it's not a good spot to grab a bite, there are numerous options and the staff is friendly but I can't recall having that \"damn, now that's what I call a burger\" feeling after scarfing down what they put in front of me at this location.\n\nOne thing that separates Smashburger from other typical burger joints is that they create special burger's and chicken sandwiches that are specifically made for the location or area the restaurant is in. For instance in San Diego it was a avocado topped burger with fresh cilantro, pepper jack cheese, sour cream and chipotle mayo with a wedge of lime on a telera roll. Now that was a great burger! \n\nHere at the SF location it's called the Bay burger and its topped with baby arugula, crimini mushrooms, swiss and a truffle mayo on a ciabatta bun. Also good but not sure if it screams Bay Area. Also on the menu that's not at most places are their Rosemary, garlic and Italian olive oil tossed fries aka smashfries. These things can be addictive! \n\nUnfortunately my last visit consisted of a luke warm burger and cold smashfries... Guess it's time to smash on by on my way to another establishment to get my burger on... \n\nI'll be back, just not sure when.", "author": "Josh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "Came here with my girlfriend to grab a early dinner at 5:30pm on 8/17/16. I had the BBQ Bacon Cheddar Big Smash Combo and she had the Avocado Club Big Smash Combo. The combo comes with either choice of fries which is regular or their smash fries(rosemary and garlic oil). Having a combo will be an extra $4.39 and an extra 10¢ for the smash fries. Everything was perfect. Taste was on point. Will come again soon!!", "author": "Nick F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-30", "description": "Went for the first time today & the burgers are pretty good. I loved the grilled onions on my truffle burger. You can really taste the mushrooms...which I like. \n\nI also like their fries. Nice & crispy. Dipped with mayo makes it even better. \n\nBurgers are good...not the best though. But it's a very clean restaurant. I'd go back if I was in the area or in the mood.", "author": "Ralph N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-08", "description": "Was in The New Hyde Park Store 0n 4/7/17.. and almost walked    dirty floor, tables not cleaned... When the order was finally delivered to the table   one order looked sad  and the other was wrong...   a small leaf of lettuce and a paper thin slice of tomao on a cheese burger... I sent mine back  and waited even longer...   what I got was not nothing like the photos....again one small leaf of lettuce the thinnest slice of tomato and pickle...  and it was a bit over smashed..   The important thing tatste...  Over salty....and greesy,,  that the bun was falling apart....It was the first and last time.....was still jungry when I lelf....   and don't ask about getting a water....LOL", "author": "James S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-05", "description": "I love this place! Been here several times and had wonderful service and great food, except for this past weekend. I got my usual burger, but it was on a flat plain bun - not the delicious egg bun it always comes with.. So I asked the server/cashier if I could get it switched to the correct\nBread. She returned and said the manager informed her that it WAS on an egg bun (not true). My friend had ordered a burger on an egg bun and his was completely different look and taste than mine. After a little back and forth with the manager and kitchen staff, I finally got my delicious egg bun- but by this time my burger was lukewarm/cold. The server was great (I think she was new and that's why she didn't know the difference) but she was very nice. The manager, not so much. Quite a hassle when it was an easy solution. Pretty disappointed in th overall experience.", "author": "Jessica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Way past dinner time on Sunday night.  I really wanted a burger.  A really good burger.  But I wanted to try a place I haven't been to yet.  I first thought of Rickybobby.  They're closed on Sundays.  Then I thought of Garaje.  They're closed on Sundays, too (?!).  I've heard about Smashburger, read my trusted Yelp friends' reviews, & since they were actually OPEN, decided they would be my Sunday Supper Burger choice.  \n\nAnd then I saw that they have a private parking lot?!  I was almost friggin beside myself.  Drivers in SF, you know of what I speak.  A truffle burger AND private parking?!  For chrisake.  This is about when I thought I could hear angels faintly singing from up above.\n\nI ordered everything to go.\n\nTruffle mushroom Swiss burger.  Bliss.\nSmash fries: olive oil, rosemary, & garlic.  Even more bliss.  I could not stop eating them in the car on my way home.  I tried.  I just could not.\nHad I ordered an Oreo or a Nutter Butter shake, it would actually have been even more blissful.\nOr the Butterfinger Oreo shake.  Or the PB&J shake...you get the gist.\n\nNow I was certain I could hear angels singing.  An awesome meal.  Exactly what I needed & wanted, & they exceeded my expectations.  They were even nice enough to cut the burger in half for me.  I ate half for dinner, & saved the other half for breakfast the next day.  My bar of measure for burgers, pizza, & Chinese food...is it still delish the next morning for breakfast?\n\nThey SO passed.  They cut the mustard.  LOL\nSorry.\n\nDe-effin-licious.\n\n5 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "I love the food, and the ambiance is nice. What I didn't care for that the employee's see me and talk like I'm not even there, if you're busy LOOK at the customer and say \"Someone will be right with you\".", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "I cannot count how many times my colleagues and I've visited this place. Every week, someone says \"let's go smashing\" and everyone's on board. \n\nThe burger is fresh and yummy, reasonably priced, and comes in big volume. The staffs are polite and friendly. \n\nKeep serving great burgers! We'll be there in a week or two!", "author": "Noriko M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "What a delicious burger!   I built my own and it was the JAM!  It's a world of difference from any fast food burger.  I will be back!", "author": "Raleigh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "Smash Burger smashes it! My first encounter with SB was in Denver last fall. My conference hotel was a block from SB and I ate there four times. My heart skipped a beat when I found the local branch.\n\nAs always the burger was great, the haystack onions perfect and the place clean as a whistle. They serve the burgers open-face with really fresh vegetables on an egg bun. Of course, you can make your own burger with choice of bread and fixings to suit your taste.\n\nI'm in love all over again! Now I have to resist eating there every day.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "This place is cool and pretty hip.\nThe portions are pretty good and I like the atmosphere.\n\nThe shakes and burgers are really good.\nI love the sauces on the burgers ..mmm yum.\n\nI liked the cheese selection and the way the buns taste. \n\nSUper smashing I must say!", "author": "Luke S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-08", "description": "Smashburger be smashin like Nigel Thornberry! I have no idea what that means. Don't even know if it's a good or a bad thing. Oh wells.\n\nCarrying on, Smashburger was just alright. The burger itself was a little boring. As in, the meat had zero flavor. No taste at all. Kind of dry as well. The rest of the burger was pretty fresh though. Veggies were pretty delicious. But nobody eats burgers for the veggies, so Smashburger kind of failed me there.\n\nTheir fries are pretty fantastic though. So good, I could see myself here just for their Smash fries. Thin cut fries seasoned with rosemary? Can't really go wrong there. I thought it was a weird flavor at first, but I found myself just eating more and more and eventually I finished all the fries and I wanted more. Super delicious. Very oily though. Can't see this as being a healthy dish at all.\n\nFinally got to try Smashburger, and I was a little underwhelmed by it. Probably gonna pass on their burgers, but their fries are pretty top notch!", "author": "Sean H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "Delicious. I had to take a bus 20 mins in the wrong direction all because I'm addicted to the bbq bacon grilled chicken sandwich. Good service. Clean restaurant. Great food.", "author": "Crystal J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "I came during the lunch rush this pass week and I must say management has gone under. I been coming to Smashburger for the past two years and I have seen many employees come and go, but for the worst. There was a young African American male who was serving out the food from the Expo window who dreads smell of dead bodies as if he haven't washed his hair in years. He was delivering our food and I was not pleased as customer services begins with hygiene.\n\nNot only did his dreads smell but his manager an older Caucasian male was just sitting in front of the expo window handing food to him and yelling loudly to the cooks in the back. It seemed more like a slave plantation than an actually causal dining restaurant. I see this often that manager hardly works or seems to be apart of the team.\n\nOverall, my colleagues and I are very disappointed in Smashburger's declining environment. We will proudly take our funds to another causal dining restaurant.", "author": "Gabrielle H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "Smashburger gets it right every time. What is not to like? Everything on their menu is so spot on.\n\nThe patty? Big, tasty, juicy, fresh.\nThe bun? Perfectly done, not too fluffy, just right.\nThe salad? Large portion, nicely decorated.\nThe milk shake? Haagen Dazs galore. It can't get any better than this.\n\nMy favorites are the Truffle Mushroom Swiss Burger ($7) with Sweet Potato Fries, slightly salted. When I take vegetarian friends they usually order the salad which comes in a large bowl for reasonable $8. And if I forget everything I learned about nutrition I get one of the Haagen Dazs milk shakes, and I'm in heaven ($5).", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Our go to spot for burgers  ;)\n\nGood burgers, shakes and sweet potatoe fries!", "author": "Nan P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "The workers looks like they absolutely hated their jobs. The burgers itself was pretty good. I order the fries will franks red hot sauce and it was a bit too salty for my preference. My friends ordered a milk shake and they said they were out of straws. \n\nThe place looked terribly managed. This restaurant needs a new manager and new staff.", "author": "Herman L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Came here today for lunch and thought it was one of the best chicken burger I had in awhile.  Glad to find go to a burger joint that serve chicken, not like in n out.  I am not a beef eater, so a chicken option is awesome in my book.  I got the truffle, mushroom, Swiss cheese chicken burger.  It was meshed well and not messy at all.  It was just very tasty.  We split the smash fries which was nice and thin and crispy.  \n\nThe guy at the cashier could be little more friendly.  I go for the experience and not just the food.  Food memorable, but staff not as much.", "author": "James L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-09", "description": "Parking lot that can get full sometimes.  It's in that little outdoor mall on Potrero and 16th.\n\nI like that they open at 10am.  Early lunch options are hard to find.\n\nA guy cleaning the window also ran back and forth running the register and sorting the food after its cooked from the food prep area.  REALLY nice guy.  He's doing it all.  \n\nMade my own burger and also decided to get the onion haystack.\n\nLoved it....but, everything was seasoned well.  I guess the meaning of well really means a lot, or like well done.  Too much.\n\nI liked it but would prefer it was less seasoned.  I'll remember to ask for low or less salt.  \n\nReally good selection and the price was good.  I'll be back again.", "author": "Bing D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "Pretty solid burger chain!\n\nNow as a food snob, I think I'm supposed to hate this place because they won't cook your burger any less than \"medium well to well done.\"  Nonetheless the burgers here have been consistently super juicy, and they even have a magical little bit of \"crust\" on one side.  Which I will henceforth assume is a result of them using their heavily touted \"burger smasher.\"  Which, according to their plentiful burger smasher marketing materials, is shaped like someone made the pentagon out of play dough and then squished it until the 5 corners became rounded.\n\nAnyway, the BBQ Bacon Cheddar smash is excellent as is the \"original smash\" which is basically a cheeseburger.  Their \"smash fries\" are also a winner; they're just regular french fries with enough olive oil and rosemary to make you feel like you're dining in San Francisco.  Oh wait, you are.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-11", "description": "How should i put this. When you're tucked away in a huge plaza in a hidden hole in the wall space where you're competing with jamba juice, safeway petco and vitamin shoppe....yeah you're probably nothing special.\n\nNot to say this is below fast food quality, but to briefly state, SmashBurger is the equivalent to the hype that surrounded T-Pumps\n\nLet me explain-\n\nA) When you walk in,  the options do seem much more appealing than the following:\nMcDonald's, The Habit and The Counter. (+1)\n\nB) for the standard under 10 dollar meal you get from In-And-Out burgers, it will cost you $15.95 here..... Yeah very unimpressed.\n\n$7-$9.79 for the burger alone, regardless of type....uhhh ....huh...\n3-5 Dollars for a Haagen Dazs shake...nice and thick\n3-5 Dollars for overrated \"smash\" Fries.....bleh...nothing special.\n\nLet me just say, those fries are honestly sh*t fries cause its no different from the thin fries you could get from Barney's Gourmet Burgers.\n\nC) When the burger comes out after they \"smash\" your meat as it says on their decor caption, it looks like a bigger version of a Wendy's Burger.\n\nIn review, this is an upgrade from Mcdonalds down the street however, it should not be an every week thing if you are more of a Barney's/Umami burger kind of person. but if you're. Wendy's, Jack in the crack kinda burger bopper. Well heres your heaven.\n\nD)The bacon cheeseburger should not have mustard in it by the way....it kills the bacon flavor.....this aint mcdonalds where nearly every burger got mustard ..\nEven without onions it ended up tasting like a spoiled double quarter pounder with bacon from mcdonalds.....\n\nSomeone's gotta  be a better quality control before they out it on the menu.....\nIts like chinese food, not everything goes good with rice..unless your just a lazy cook..\n\nI hate to give a clean place a shit review so soon, but ...its just a very uninspiring place....doesn't look to different from The habit quite honestly", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "Patties are large and juicy. The first thing you'll notice is the bun is soft but holds up. Ingredients are fresh and don't spill all over the place like Super Duper. Most popular burger seems to be the Classic Smash. Truffle burger is amazing, not much different from the Bay Burger. Veggie burger is a black bean patty and not some frozen disk of unknown veggies. Chicken burgers are a healthy alternative. Don't miss the milkshakes, especially the Oreo shake.\n\nOh and see the photo attached for the SECRET MENU. Only two burgers on it, but if you're a fan of adding a fried egg to a burger, the Sin City is for you!", "author": "Calvin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Tom was great!  He was very personable and cared that I had my burger cooked just the way I like it and offered to do it himself.  Truly unbeatable service!!!", "author": "Diana R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-12", "description": "I came here for the Yelp Elite event a few weeks back, and basically got to try, well, every single one of the items on their menu, so I'm not going to go and rate each individual one. But, overall, everything they have to offer is pretty solid, from their various burgers, to their sides, to their shakes (which are made with Haagen Daz ice cream!). Fantastic, they are not, but solid, they are, falling somewhere in between the fast food world and the fancy burger world, in the same tier as, say, Super Duper.\n\nSome interesting tidbits: they're named what they are because they take fresh meat (ground beef, chicken, etc) and smash it into a super hot griddle, which simultaneously sears, steams, and quickly cooks the meat. Also, while they have set items on their menus, their burgers are actually customizable, for those who like playing with their food. And with the variety of buns, proteins, and ingredients to pick from, there's plenty of combinations to come up with!\n\n***Accessibility Info***\n\nVenue - Spacious venue, with a combination of inaccessible counter height tables, and lower standard height tables and booths.\n\nBathroom - Didn't check them out, but I imagine they're okay.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-03", "description": "My first impress was \"this is going to be delicious\". The menu was simple, yet full of choices... there was honest tea at the fountain and a few select beers... the layout was attractive as well. \n\nI ordered a chicken club with a side of bbq sauce on a wheat bun, side of sweet potato fries. To be honest, I am still trying to figure out what I thought. The chicken was paper thin, there were 3 small slices of avocado, and single strip of lettuce. Wasn't the most elegant or juicy chicken sandwich I ever had. It didn't really fill me, but the flavor sure was delicious. I was a bit disappointed with the portions. \n\nOverall... for the cost, I think there are better places to go. I know that \"artisan\" and unique burger joints are on the up and up, but the most important thing to me is a good portion for the cost. For the $11 I spent, I excepted more than what I got. I would prefer a joint like the habit way over SmashBurger. \n\nOverall... wasn't sold on it.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "Really great black bean burger.  So fresh and tasty.  I usually don't like this kind of place to eat but I was impressed.  I loved how they use reusable metal baskets, have a wide range of sauces, coke zero fountain drinks.   Clean and friendly and easy and loved my healthy lunch.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Hands down my favorite fast food burger. It just dissolves in your mouth.\n\nFriendly staff, clean dining area, all-around a great place.", "author": "Christopher B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "This place is great for a good burger and somewhere to hangout. I love how much you can play with all the food and basically make all the food to your own desire. Tom is full of energy and always quick to a conversation. Overall this place is awesome and I love eating here.", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "I eat here once  a week and always have the cobb salad without chicken, dressing tossed.\nIt is freshly made and always seriously good. Tom the manager is very  much on the floor \nchecking in with all the customers, and picking up the slack with the staff when needed. \nI always go with a friend who also has the same cobb salad and we split a hamburer\nwhich is also good. The cobb salad is comparable to ones that I have paid $15.00+\nRestaurant is always spotlessly clean.", "author": "Peter F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "Mediocre quality, very slow service, messed up on the order even after several reminders not to add goat cheese, and employees arguing openly among each other. Never going back again.", "author": "Al G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "Super disappointed in this place - love their hamburgers but twice - TWICE - forgot the bacon I ordered, and when I reminded them about it, argued they were out of cooked bacon. I guess they didn't want to make more since it was near closing time, but then they should have told me upfront that it wasn't available! They did finally made some but after a lot of back and forth.\n\nThe third strike was last week when we got there at 9:25 (restaurant closes at 10) and after waiting in line for 5 minutes told us they were taking to go orders only because they didn't want people staying late. RUDE! We've been there before and around the same time and make sure we leave right at 10. I will miss the tasty burgers but will not spend time or money in a place with lousy customer service.", "author": "Ginaville V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-13", "description": "i want to say that its not worth it the burgers are 6.99$ and small as well you need to pay extra for fries and drinks so that sucks!! and they put too much condiments it was nasty and soggy the burgers i got a stomach ache for that. the fries are too small and the milkshake aint even good! the worst part its not even delicious!!!", "author": "Daniella E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-04", "description": "First visit, I asked for less salt on my burger. Naturally, they threw in extra salt for the minor request. Second visit, ordered the grilled chicken truffle mushroom burger to go. Back in the office, I took it out of the bag and it was smashed flat. Spoke to a manager who didn't give rat's ass. I will post a pic.", "author": "Jay W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "I decided to try this since I have heard the food was good. I ordered the BBQ and bacon cheddar burger with smash fries and my boyfriend ordered the truffle Swiss with chicken and spicy buffalo fries. The burgers were both great, smash fries were the best, but the buffalo one is super salty so watch out for that! \nHowever, the people who worked there were not the greatest. My friends had ordered two milkshakes and when we asked one of the girls she turned around and told the other two guys that they forgot to make them. Instead of realizing their mistakes they kinda shrugged it off so the girl went to the back to make them. She didn't seem that happy and was looking kinda irritated the whole time but I would be too since she seemed like she was the one doing everything almost.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-08", "description": "Bay Burger - This was much better than I thought it would be...the meat itself was good, but I really enjoyed everything else that helped to make it a better overall burger: truffle mayo, chiabatta roll, arugula.  We also had some truffle fries and milkshakes, which were also above average.\n\nThe burgers arrive as \"regular\" or \"big\"...I'd say the \"big\" wasn't very big, but more of a typical sized burger.  The \"regular\" portion would probably be good for those who have a smaller appetite or intend on eating fries and a milkshake.\n\nI would definitely recommend this place if you happen to be in the area and have a craving for a good burger.", "author": "Ken G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-14", "description": "I am updating my review which used to be at a 1 due to screwed up orders.\n\nThey've gotten mine right lately.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "I got to say I'm surprised that this is a pretty good burger joint with the potential to be great. Although the burgers are a bit salty, it's everything you want in a burger place.\n\nThere seems to be a new trend with burger places that allows you to build your own burger and enjoy fresh ingredients. Although it comes at a higher price tag, it almost guarantees you to have the exact burger you want without any skimping on the trimmings taste. A real bonus is everything made here is cooked to order. Unlike many fast food chains which have them cooked and then place them under a heat lamp to keep em warm. By doing that you take away the texture and natural flavor of the meat patty and replace it with a rubbery feel and leaves it with a Spongy taste to it.\n\nI ordered the BBQ bacon cheeseburger. It's served on a golden brown egg bun with huge cuts of hickory smoked bacon. Combine that with a half pound party and Swiss cheese. I took it a step further by adding an egg on top to complete this massive meal of perfection. Although it was a bit saltier than expected, the burger was excellent. It was juicy, it was runny, it was messy but more importantly it was tasty.\n\nThe fries were average and I was a little disappointed because there was so much emphasis made about these fries and how much better they're supposed to taste. I've heard it placed higher then other chains like in & out and McDonald's. But I will say this the venue is a lot bigger than it looks from the outside and the staff was cordial. The only downside was the loud conversations they were having that everyone in the smash burger could hear. Of you know you're at work and have a. Open kitchen, be aware of what you're talking about because it can sound extremely unprofessional. \n\nBut other than that, I feel as an all around burger place. Smash burger definitely deserves a strong four-star rating.", "author": "Donald W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-25", "description": "I've eaten here about 10 times. The food is pretty good. I would even rate the food 5 stars. Burgers are great, milkshakes are great. HOWEVER, they hire the most rude and careless, inconsiderate employees with the \"I don't give a shit attitude\". They're snappy, ghetto, and roll their eyes, like they're better than you. I would rate the service negative stars if I could. It really ruins the entire experience of this place. Extremely unfortunate.", "author": "Vincent N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "The only burger chain I ever enjoyed was In & out that is until getting to try my first Smashburger at a North Bay elite event.\n\nI am so thankful I dont have to head north to enjoy the perfectly juicy and fresh burgers here anymore!\n\nMy favorites are the classic smash and the bay burger which you can also get on a whole wheat bun and add or take off toppings. The rosemary fries are good (although I wish they offered garlic) but the sweet potato fries are my favorite.  They carry honest tea,  IPA's and my favorite milk shakes made with hagggendaz ice cream! \n\nIn fact, I've convinced the hubbs to have dinner there tonight! *happy dances* :)", "author": "Petra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Great burgers and fries! Lots of choices... Reminds me of a reasonable priced \"The Counter\". The Spicy Baja burger is my favorite! Definitely my favorite reasonably priced burger places... Just wish they were located closer to my home!", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-19", "description": "Nothing special. \n\nThe burgers aren't anything to write home about, so definitely DO NOT make it a destination. Order your burger, you can customize it if you like... Pay extra for fries. I opted for sweet potato fries. They were tasty without ketchup.\n\n1 \"large\" sized bacon cheeseburger w/ smash fries (fries tossed in olive oil and rosemary apparently) and a soda\n1 \"regular\" sized bacon cheeseburger w/ sweet potato fries and a soda\n\n\nThe \"large\" bacon cheeseburger looked almost exactly the same size as my \"regular'. The meat patty only appeared to be \"larger\" by a centimeter or two.\n\ntotal = $23\n\nwas it worth it? \n\n\nnot really.\n\nI want those calories back -_-", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "I have been waiting for a Smashburger in our area for years! After going to them in Arizona and Vegas, I knew it would be a matter of time before a Smashburger of our own. I went last Saturday and really liked the location. Ample parking, lots of seating, and very clean. \n\nI order the caliburger and was not disappointed. The thin show string fries are insanely delicious and the Milkshakes are too die for. The cashier was very friendly and didn't get irritated when it took me a few minutes to figure out what I wanted. Saturday nights seem kinda slow so if you don't like dealing with crowds it's the perfect time to go. The prices were on par with the other locations I've been too which is great considering how much lore everything is in our beloved city. Overall great burger, great value, and great atmosphere.", "author": "Brandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "My first experience with smash burger was a good one.The line was long but the wait was not that bad\nIt moved at a fair pace.I ordered the smash burger with cheese on the egg bun with a vanilla shake& smash fries. The burger was cooked to perfection\nAnd the fires were very good the milk shake as well\nI Wil defiantly eat at the 16th street location again", "author": "Derik S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-14", "description": "The burger patty lacked flavor, as though it wasn't seasoned. The fries hit the table Luke warm. The staff was friendly, but that doesn't make up for mediocre food.\n\nThey weren't terribly busy on our visit and yet it wasn't as clean as I'd like.\n\nGiven the option for awesome burgers in SF I don't feel the need to return.\n\nIf you want an awesome inexpensive burger go to Garaje. If money is no object hit Tap415 at the Westfield - Tempura bacon is the bomb!", "author": "David P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "5 stars  for the burger patty and the crispy chicken patty. Their sweet potatoes fries are great. Wasn't really amazed by the salads, I have tried their salad a few times and I have always found that the salads aren't portioned well. But everyone is here for burger so who cares. The service is fast but okay.", "author": "Sabrina G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "I've been here for lunch many times since it opened. The burgers here are deliciously juicy compared to those from other places.\n\nI still like their classic burger the most. Some of their other burgers such as the mushroom or avocado ones have a slightly drier texture and aren't as appetizing.\n\nService here is extremely good.", "author": "Nathan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-10", "description": "So i went back 2 days after i wrote the initial review to see if it was a fluke and it wasn't. I went there again tonight to give it a final try and its been consistent. I will probably have a heart attack if i go there one more time this week. \n\nDo you remember when in n out first open up and it was always a treat to eat there. I think i found my in n out alternative. Although SmashBurger cost twice it does offer a more premium taste compared and more options.\n\nThis is my new fav burger joint. *Does not mean i think its the best tasting burger in the world! \n\nCheck it out - I highly recommend it!", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-28", "description": "Smashburger is another burger chain. only cooks burger medium or medium well.\n\ndrill: order, pay, food brought to table when ready\n\neats: classic (reg.5.99?)\n-had cheddar cheese, red onions, tomato, lettuce, mayo\n-med. burger had no taste, no burger juice\ntaste better than 5 guys, sonic, MCD. similar to BK, wendy's\n-\"juice\" was either fat or liquid from veggies.\n-everything fresh re: burgers.\n\ncrumbs:\n-good service overall, nice ambience.\nambience 4 stars, burger 3 stars.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "So good! 2nd burger place that I've actually learned to crave. The first being In n' Out, of course.\n\nTry the: \n-truffle mushroom swiss classic. \nso so good, so so juicy. definitely my favorite burger here\n\n-bbq, bacon, and cheddar.\noh my god good. think arby-q, but 100x better. \n\n-classic smash.\nmost comparable to the in and out varities.  good alternative if you can't make the drive out to an in and out\n\nOverall, all of their beef burgers were fantastic, the above were my top 3.\n\n\nSome notes:\n-most of their beef burgers are served on egg buns, which apparently makes a huge difference! I believe their chicken burgers have ciabatta and their vegetarian/ bean burgers come on a wheat bun\n-burgers are literally smashed! they use a special tool to smash and turn their beef balls into patties- keeps all the burger juice in. my mouth is watering thinking about it\n-if you are going for the vege burger, not that it has a spicy kick to it. \n-oreo milkshake is surprisingly better than the salted caramel variety", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "After jumping the gun last week by two days prior to the grand opening day, I made it over for lunch a few days later with hubby and daughter. \n\nThe laminated menus are located to the right of the front entrance.  You can read it to determine what you would like to order prior to the ordering at the counter which is 1/2 way in.  There's also a menu posted above at the order counter.  \n\nI went with the classic smash burger.  Comes with cheese and the special sauce dressing with lettuce, tomato, Bermuda onions, and pickles on an egg bun. You can order either the regular burger or the bigger one.  You can also customize your burger.\n\nThe garnish was ice cold.  I took everything off my burger as I enjoy eating hot food hot and not lukewarm.  The ground beef patty was good.  Beefy.  And the patty looked like one that I would make at home.  Thin patty. \n\nWe got two sides - French fries and sweet potato fries.  Good portion size.  Ketchup and mustard on the table with lots of napkins.  You'll need them as the burger is very juicy. \n\nThey've got bottled beverages and a soda fountain. \n\nThe staff walks around frequently to ask how's everything.  They also suggest you go online to complete a survey.  Then next time you can get fries for free.  \n\nEveryone is very friendly.  Service was quick for food cooked to order.  It's served in a steel wired basket.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-19", "description": "I've had the Smashburger from Sacramento before so I was extremely disappointed when I finally got to try this place out. \n\nFor $7 a burger, I expected a lot more. I got the bacon cheeseburger to share and it was not that great at all. The smell of onions overpowered the entire burger and I had to pick most of it out. The fries were DRENCHED in oil. This was the first time in any fast food place that I got napkins to soak up oil on french fries before I ate them. When i got to half the pile, I ended up individually wiping the oil off each french fry because I really didn't want to eat. But in the end, I never really finished the fries because I felt like my arteries were gonna clot up.\n\nOh yea, I saw the server reach in under his shirt to casually scratch himself not giving a care in the world and showing off the naval. Then he went straight back to work without washing his hands.\n\nUmmmm, I think I'll be skipping Smashburger from now on.", "author": "Harriet W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-22", "description": "My review echos others. I am a smashburger loyalist so this is more about this particular location rather than the food itself. Im originally from San Diego where the local special the san diego burger is amazing. Still I knew there was other food that would suffice.\n\nCashier gave attitude. Later I saw her arguing with the manager in the middle of the restaurant. My food just sat at the heat lamp. I heard the manager say you forgot the fries. which took another 10 minutes. Food comes back luke warm.\n\nThe restaurant had a moldy water smell in the back. There was a table that had a milkshake all over the floor and it was congealed like its been there for a while. Most of the tables had not been bussed even though the place was empty.\n\nManagement or the franchise needs to step their game up. Place was disgusting.\n\nThe food was meh ok. But not the food I loved from San Diego.", "author": "Jon O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Yep, there are better burgers in SF, but this is not a gourmet burger place -  this is more upscale fast food burger with great toppings and a fresh bun.  I had the one with bacon , cheese and frizzled onions (added an egg of course and would have preferred it to be runny, next time I'll be more specific).  it really hit the spot.  If I had it to do over, I would have gone whole hog and gotten the double and  the super thin onion strings or sweet potato fries on the side.\n\nFast service, clean place, fountain soda, nice employees, free parking, a great selection of fried sides and topping choices.  The shakes looked great and \"fat in a cup\" - in a good way.\n\nMcDonalds across the street, Togo's next door, and Boston Market downstairs should be worried.", "author": "Amy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-24", "description": "Dear SmashBurger,\n\nToday, I ruined my diet for you.  Your name has been engraved in my head because of SlickDeals.  It was impossible for me to turn down a coupon for a new chain that opened up close to home. \n\nYour burger became a bigger mess with each bite that I took.  It drove me crazy.  My buns were not toasted, so it became this huge soggy mess.  Plus, your fries were overly salty.  However, your ice cream shake was pretty amazing!\n\nRemember, when something seems too good to be true, it usually is.\n\nRegretfully yours,\nKilled My Diet", "author": "Lynn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "Decent spot for a burger fix if you're in the area... they're juicy and on the saltier side, but definitely fresh. Especially liked the Oreo milkshake. \n\nEasy parking in the lot, not too crowded, and nice seating options inside. Staff was polite.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-01", "description": "I waited 30 minutes for my order while my boyfriend waited until I got it to eat his salad. \n\nBut to complain, I had to get in line behind:\n- a couple who kept getting the wrong order corrected...four times\n- the woman with her salad bowl because they forgot the kitchen\n- some man that was mad about beer or something\n\nNot to mention I could hear loud uncomfortable arguments in the kitchen. This was the hottest of messes - it is a symptom of new franchising? If so this place needs to clean up quick. \n\nI was too entertained to leave. \n\nAnd, if you're wondering they forgot my order.", "author": "Bao N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "My bf heard of this Denver food chain from his coworker, and wanted to try it. We also needed a burger place to eat at before my event at 12. So, Smashburger was one of the only places open believe it or not!\n\nWhen walking in, everything was so clean (brand new). The menus are on flatscreen TVs, similar to McDonalds. I ended up getting the Avacado Club (Fresh avocado, applewood-smoked bacon, lettuce, tomato, ranch dressing and mayo on a multi-grain bun). My bf got the Bay Burger (Baby arugula, sautéed baby portabella mushrooms, aged Swiss, and truffle mayo on a ciabatta bun). Avacado Club was good, but I was disappointed in the lettuce; it was just one thin piece. I did like the multi-grain bun since it was different and made me feel good for eating \"healthy.\"  The Bay Burger was super good though - can't go wrong with that truffle mayo. \n\nFries were alright; really thin shoestring variety. I was hoping for thicker fries. The fries were also pretty greasy...but still good. At first we ordered one to share, but then I ended up wanting to get one for myself since I didn't feel full yet.  Best part, I went up to order the fries. The manager asked, \"Do you want free fries? Fill out the survey on your receipt and you can get them free!\" Awesome. Made my day.\n\nGreat service...good food. Will be returning.", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-22", "description": "I got the black bean smashburger. I guess I was naive, I didn't realize they actually smashed the burger flat. So what I got was actually pretty tasty, but it was all spread out thick falling out the sides and super thin in the middle..inside the bun. It was strange, I had to pick the pieces from the edges and stick them back in because I had lost about 1/2 the burger into the wrapper as I ate it!\n\nthe fries were fine, nothing special. The employees were apathetic. I don't think I'd come back here.", "author": "Venus S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "Had the Bay Burger and Smash fries. Juicy tasting burger and well seasoned fries. Get some sauces on the side for dipping ur fries. Great friendly service too.\n\nI'm not that big a fan of their shakes because they blend with ice.", "author": "Craig I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-14", "description": "This reminds me of a really nice, high quality, well organized and hip McDonald's with San Francisco prices.  It's OK.\n\nI ordered the smash fries and a bacon cheese burger with a soda. The fries are good and I'd have them again. The burger is not juicy. After finishing the burger there was not one drop of water on my tray. The sign of a juicy burger is you have a messy tray when you finish. My tray was clean.   \n\nEverything about my experience was good but for $13 the taste was not worth my time. The employees are very friendly and the restaurant is exceptionally clean. Likelihood of returning 24%.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-26", "description": "I've never taken the time to write a negative review, but I was just treated as rudely as I've ever been at an ordering station. I go here about twice a week-- it's by my gym, it's usually clean, and there are several healthy options.\n\nTonight I walked in at 9:35-- they close at 10pm -- and the woman on the floor rolled her eyes, said \"oh my god,\" and walked to the register, saying \"that's it, I'm quitting!\" The manager, who's usually friendly enough, looked frustrated and walked away when he saw me walk in.\n\n I'm friendly and even tip for fast food. I've worked food service and know it can be very frustrating, but I never treated customers, especially a friendly one, this way. I would have been fired. With 25 minutes till closing, I planned to order to go, but I opted to leave. I won't be going back.", "author": "Brent C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-10", "description": "I think the service here was a bit strange (cashier acted oddly/confused when taking my order), but otherwise a decent burger chain that's close by to me. Great for a quick meal thats relatively inexpensive. Gets a pass for being in SF where you really have no in-n-out or five guys as alternatives.", "author": "Omar M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-19", "description": "It's decent.  Parking sux in Portrero Center, and door dings are a given from the miniature parking spaces. The burgers are pretty good, but very greasy.  I am not a fan of the chicken sandwiches - they use a paper thin chicken breast? and it overcooks and is bland.  The fries we got today were so salty I couldn't finish, and I am a salt lover.  The shakes are excellent. Prices so-so; about $11 for sandwich, fries and a drink.", "author": "Ken P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "First time here and I loved it. First things first. Parking is great. Plenty of parking. Walking into this establishment was pleasant experience. When you walk in you see a all open floor plan, a lot of open seating and various options for seating. You can sit at the \"bar like\" section, or you can sit at the table \"booth like\" seats, they even have a more private seating towards the back. Very very clean and neat. Everything is organized and labeled in bold and bright colors. Ordering your food is easy and the customer service is excellent! My order was cooked to order and brought out to me pretty fast. I must add \"Linda\" one of the servers was so so so sweet and friendly! She was very attentive and such a sweet lady. \"Tom\" the general manager was also very delightful and you could see he was managing and maintaining the whole joint without any issues or Complications. Tom was very attentive to every person walking through the door even with splurges of people coming and going. The food was delicious and FRESH. YOU COUKD TASTE THE FRESHNESS in every bite. I really liked the variety they offered on their menu, not too much but different from other burger joints. They also thanked me for coming in and gave me a free cup with some free coupon flyers to come back again! This place is definitely on one of my new favorite places to go! I'll be bringing everyone I know back to try them out too! Family friendly. Great for meeting up with friends. Cards are accepted but $100.00 bills not so much. For sure for sure you have to try this spot!", "author": "Reina Linda H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-06", "description": "Made online order. I went to pick up, there were many people in line for lunch. I got my order quickly, but after I went back to my work place i found out that they didn't give me my large fries that I paid for and was clearly written on my receipt. I tried to call them to get money back, and all the guy said was that he will take care of me next time. But he can't even hear my name and he brushed me off.  Inaccuracies and careless customer service!", "author": "Dixon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "I've been to this location three times now, and each time the amount of waiting I had to do was unbelievable. It probably took an average of 30 minutes to get a burger -- the line doesn't move very quickly and it takes a while for the burgers to actually get made.\n\nThe burgers are fine, but nothing special enough to call home about. It definitely wasn't worth the wait. I've gotten the Spicy Jalapeño Baja chicken sandwich and the Avocado Club burger twice. The  chicken wasn't very crispy, but the lettuce was really good and had a nice crunch. The Avocado Club was just too soggy to be a good burger -- the bottom bun was always soaked with grease. Probably won't go here again.", "author": "John W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Classic Smashburger rivals the likes of Shake Shack and In N out. Trust me.\n\nTheir crispy chicken sandwich was the juiciest I've ever had.", "author": "Viet P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Had the Bay Burger, Spicy Baja Burger, sweet potato fries and onion rings and they were all very good (onion rings could be less salty). What I really like about this location is that the staff are all very friendly and courteous and you can tell they take great pride in keeping the place very clean and organized, down to the napkins and condiment baskets on each table. Will keep going back for sure!", "author": "cassy f."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-01", "description": "If I could give 0 stars I would.\nThe Host :: Amarion \nThe worst customer service I have ever experienced in my life. I had never been to a smash burger before and I will not be returning. He huffed and puffed when I  asked simple questions like could I have two types of cheese on my burger. He was clearly frustrated and the other two guest I was with were not impressed either. He didn't smile say hello nothing. This message is to Corporate, I will be posting this to my Facebook, Instagram, and Twitter letting all my friends and family know not to come here. I am a restaurant manager and I would never allow an employee to be represent my company as such. There definitely needs to be a better screening process as far as who you hire. Lastly he got all of our orders wrong. I did not ask for a refund I was so upset I just left the food there. I DO NOT RECOMMEND THIS PLACE TO ANYONE.", "author": "Tunechi J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-13", "description": "I like to order their truffle mushroom burger with smash fries. I would prefer crispier fries, my past orders were semi soft. Their patty is juicy and bread is buttery soft.", "author": "Kristen T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-07", "description": "Used the online ordering thru yelp and my food was ready to go when I got there.  So far, awesome experience.  \n\nBut then I get home and the burger has none of the adjustments I requested.  I paid extra for avocado...not there, i checked the box online for no mustard and no pickles...got tons of mustard and pickles, and of course the cheese was wrong too.\n\nCmon guys.  I want my money back.", "author": "Bryan F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-19", "description": "I went here for lunch at the invitation of a friend.\nI had a simple Smashburger Classic and a strawberry milkshake.\nThe burger was good, but not as good as the burgers at Super Duper.\nBut the milkshake was wonderful - thick and creamy.  Their shakes are made with Haagen-Daz ice cream and that makes a big difference.\nThe service was fast and efficient.\nI would return if I was in the neighborhood.", "author": "Philip C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Friendly service, clean and inviting atmosphere. Not to mention a pretty dam good burger and fried pickles pretty good too. The burger was juicy, the bun was fresh, the onions and tomatoes were fresh too. \nI know my burgers and I got the basic Smash burger with cheddar instead of American cheese. Sometimes a basic burger cooked perfectly with good meat and all fresh ingredients is all you need. \nWhat pushed me to 4 stars is that they have fresh jalapeños not pickled. \nIn my opinion any place that uses pickeled jalapeños is just lazy. The fact that they put the extra effort on getting fresh jalapeños, transitions to the extra effort on good meat and fresh toppings. \nAlong with that a perfectly cooked burger that is still DRIPPING TO THE VERY LAST BITE.", "author": "Greg H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-02", "description": "I am not opposed to giving this place a second try. However, my first experience was not very satisfying. \n\nIf I do find myself in a position to return, I will order the \"Big\" burger size (6 oz), rather than the \"regular\" as my 4 oz regular burger was a little too smashed. It was the Bay burger, and tasted ok. They definitely cook the meat through. On the other burgers we ordered, this wasn't an issue. On my overly smashed burger it was sort of a detriment.\n\nService was ok. None of the staff were rude, but there was no pleasure in their attitude. We came during a small lunch rush on a weekday and waited for a good ten minutes. They could use more cooking staff, but don't look like they have enough space for more.\n\nThe fries were decent and crispy. The Smash Fries didn't seem well tossed and had a lot of oil on them. The garlic, oil and seasoning just seemed to stick to the inside of the box.\n\nI'm just not sold on it yet. I do like the specialty burgers in a fast food setting, but I would prefer Five Guys. Five Guys may not have the salads, chicken, cheeses and other great options that Smash Burger has, but they get the burger and service right. These two seem the best to compare.", "author": "Todd W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-13", "description": "Two burgers, two soft drinks and a regular fries comes to $20. A bit pricey for fast-food, but I've had good experiences here in the past.\n\nI ordered a \"big\" burger that was actually a regular. The fries seemed pretty sad, almost wilted. My girlfriend's Windy City burger's pretzel bun didn't have any salt on it and her burger didn't have any pickles on the side, even though we explicitly asked for it to come with them on the side. The burger is supposed to come stacked with shoe-string onions, in reality it came with just a few. Depressingly few.\n\nDisappointed because this place has been decent in the past. Now it's just a mediocre, over-priced alternative to McDonalds.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-04", "description": "On par with McDonalds but 10x more expensive.\n\nI wasn't expecting to be blown away, but did certainly hope for better. I ordered a classic burger which I thought would be a safe choice. After two bites I threw the rest away. Gross.", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-22", "description": "The \"To Go\" salad I bought tonight was, well, repulsive.  Yuck.  \n\nDo not get their Cobb Salad.  I should have read it in more detail, that would have helped.  It's a fried egg, not chopped hard boiled egg.  The onions were over-powering, I was given no dressing (found this out when I got home).  The grilled chicken was plain and in a slab (chopped into bite sized would have helped).  I guess in my mind I though Char-Grilled not just tossed on a hamburger grill. The chicken was very Plain and \"why bother\".\n\nTossed out the whole bowl of yuck.  $7.99 into the trash.\n\nMy friend DID like their burger.  2 starts for that I suppose.", "author": "Karen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "Had the Chicken sandwich with truffle mushroom and swiss. Not a burger but it was a content sandwich to help me drive over the bridge.  The sweet potato fries were good. Even my dog loved it the next day.   \n\nI will have to come back for another tasting to eat a burger, for what they are known for.", "author": "Marck N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "It's alright, not much options for vegans. Even their black bean burger patty has cheeses and butter. Fries and salads for the animal friendlies. For the black bean burger it's overwhelmingly 'beany'. Service is okay considering it isn't dining. Fountain are available for refills.", "author": "Harry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Came here to finish off a great day in the city and Tom made it so much better. Great service and food.", "author": "Alexander B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Smashburger is awesome! From the food to manager, the manager is a gentleman that knows how to keep his customers happy, such a friendly person even in middle of lunch traffic, definitely recommend this place! Burgers, fries, onion rings are great. Haven't had s chance to try milkshakes yet, hopefully next time", "author": "Ben T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "Food is good, but glasses and tables were greasy.  I was using one of their plastic red glasses and the edges had greasy fingerprints.  Additionally the table top was dirty.  \n\nI have eaten here several times, but a dirty eating environment is a huge turnoff.", "author": "Coyote B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "Not bad. The smashed burger is an interesting concept. I ordered the classic burger with goat cheese. I like that you can customize your burger. I also got an oreo milk shake which was heavenly! They bring it out to your table when its ready. Prompt service and pretty good food.", "author": "Cynthia T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-22", "description": "The burgers are ok, nothing special. Can't have your burger cooked to order. The shakes are good. Hall of flame burgers are much better", "author": "anthony j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "I like this place very much. \nConsistently solid food and service.  \nService is very nice and attentive, the stuff people are very happy to be there.. Probably not, but they look like they are. That what I want to see when I go some place. \nI always order Bay Burger $7.39/large ciabatta bun, mushrooms, arugula, truffle mayo. Not the best burger, but very good for the price and fast food place. It's juicy, beefy, mushroomy, truffly. Smash fries are crisp and delicious. All condiments are free. Truffle  mayo is my favorite. \nFood comes out fast. \nClean place and bathroom is clean.", "author": "Natasha S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-03", "description": "best fast food chain burger in my opinion - the potato bun, the meat, the veggies are all fresh and top quality at every location I've been to - so the food is not the problem \n\nthe problem is with this branch - how in the world does it take 35-40 minutes to place an order and get 1 chicken bay burger? not the place to be if you're in a rush or hungry.\n\nmaybe I went during an off day but it wasn't even prime lunch time - 1:30/2pm? wasn't too bad of a line - maybe 7ppl? but somehow it took 15-20min to just place an order then another 20 mins for the order to be ready.... smash and dash? more like smash and die waiting.\n\nthe one plus - it's in a shopping plaza so there's plenty of parking", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "This is the best fast food restaurant I have ever dined at!  I love the burgers, the fries and the salads are amazing.\nI eat at \"Smash\" at least twice a week.  Parking is easy!\n\nCongrats to my friend Tom and his friendly staff.", "author": "Billy Raye V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-24", "description": "This seemed like a cool new place to check out for an early dinner on a Friday night so I took my girlfriend on by. We're in the middle of a move and just needed a quick bite before hitting the road.\n\nThe manager was nice, but SUPER excited that we'd stopped by. She took five minutes to explain the concept, the menu and drinks before we were allowed to place our order. A black bean burger (there is no such thing as a black bean burger, I contend, but we'll talk about that another time), sweet potato fries and I had a bacon cheese. Simple.\n\nLong story short, what I got was a mediocre cheese less burger and a sleepless night. I won't got into detail why sleep evaded me, but I strongly recommend volunteering to sleep on the couch if your sleep partner decides to eat the black bean burger (its not a burger).", "author": "Sam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-06", "description": "These burgers, along with their fries and shakes are just so awesome! They're the best in history and on the entire planet! I really suggest you go here sometimes because it's really a blast! I also really love how they have a limited edition birthday cake shake accoridng to the image on Yelp.com, and that makes me want to go there near or on my birthday one day! I would rate this to be 100 times better than both Mcdonald's and Burger King combined! I know it might be only 7 years old now and pretty young, being founded in 2009, but it still rules! I suggest that on the weekends you try going here for lunch one day on a gorgeous day out!", "author": "Asher D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-02", "description": "Not the best burger I had but I like the portion, the price, and their garlic sweet potato fries are delicious! The line goes out the door so arrive early. Once you order, the food will be brought to you. There is a code to the bathroom so don't embarrass yourself lol. I would not return for the smash burger but will go again to try something else.", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-12", "description": "Really dissatisfied with this joint. The Smash Burger I tried in San Diego (La Jolla) was really good and was expecting the same. The quality of the food and the staff don't even come close. One time I came after work and I had to wait 30min for my order because they were under-staffed. The burgers ended up being charred too! Every other time I ate there I had bad stomach pains for the rest of the day. I've now lost complete faith in Smash Burger and will not be coming back.", "author": "Sergie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "They're good -quite good.  The burgers, the chicken sandwiches ... we especially love the \"vegetable fries\" and the easy to customize menu.  The service, though, can be very very slow ... also, Smashburger has a very convenient pick up counter, but order way ahead and pick up at the time it says, because even if you send the order in right away (even if they have no customers0 it won't come through to the cooking staff until a few minutes before the seemingly randomly assigned time.  So don't do this option if you're in a hurry - better to walk in and order.", "author": "Alexandre P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-20", "description": "At the high end of the fast food business, their burgers are fine but have a lot of bugs to work out in their management process. \n\nThey encourage you to order online, so I did. My order was supposed to be ready at 1 o'clock but it was 15 minutes late. During the time I waited, I saw more than half of the orders that came out of the kitchen go back for rework, making for lots of frustrated and unhappy customers. \n\nThey gave away lots of apologies and coupons for discounts on the next visit. I probably won't be using mine.", "author": "Rick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "After hearing since buzz about this place opening up in the Potrero Center, I finally decided to stop on by. The inside looks very contemporary and well kept. Not to bright inside and really clean.\n\nI went with the burger with the bacon and bbq sauce (can't remember the name) and my girlfriend decided to get the same, but with chicken. We also got an order of Smash Fries because who can resist all those nice seasonings. Food didn't take too long to arrive and we went straight to work on those two burgers.\n\nThe meat itself was really outstanding. I wasn't expecting it to be as flavorful, but I was presently surprised. The bacon added nothing to my burger in my opinion, but the bbq sauce was a nice touch. The chicken counterpart was also nice except the chicken was a bit dry. In their defense, the chicken had to be pounded pretty flat.\n\nThe fries weren't that great. The fry itself was too thin for me and the taste was decent at first, but it wasn't a fry I can enjoy for more than 5 minutes.\n\nOverall, I would definitively come back for another round of burgers, but I think I'll just stick to burgers.", "author": "George Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-26", "description": "I've been to 3 different locations on 4 separate occasions, and the service has been wrong 3 out of 4 times. \n1st time, Mill Valley: I asked for chicken, I got a burger. I still ate it, and it was delicious. \n2nd time, Emeryville: my friends and I went on New Years Day and I guess only 3 people showed up to work that day, so we had wrong orders and orders that took half an hour. Again, food was incredible, so it was hard to be mad. \n3rd time, SF, 15th St. shopping center: spot on. \n4th time, SF again: my cashier was a bit abrupt with me, and gave me grilled chicken instead of the crispy I asked for. I still ate it, and it was delicious. \nI'm worried about the workers. I hope they're being treated well. \nAll in all, the food is SPECTACULAR and worth eating, but upper management needs to make sure their workers are okay.", "author": "Nora M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "the cashier was very friendly, the food was ok, not great but the burger fell apart after the first bite and was much smaller than the picture suggests.  the garlic fries were good.  for fast food, it took a while to prepare.", "author": "Hiki L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "I ordered the spicy jalapeno and avocado burger with jack cheese... it was superb to the erb!!! I wasn't that hungry to begin with but this delightful, layered, hand-held angel was sent from heaven and I couldn't resist but chomp it up in minutes. I definitely will come back and try their side dishes and plethora of burger selections!", "author": "Chantal P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "The burger was good....but those Smashburger fries....oh my! Made with rosemary and other herbs...better, YES BETTER than garlic fries! And I love that they're shoestring fries. I'll go there if only for those!", "author": "Martha H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-14", "description": "Sometimes free isn't really free.  Like when you get a free (as in you paid no money for it) Truffle Mushroom Swiss Burger for lunch, but then you wind up having to \"pay\" for it the next day by going to the gym or worse, starving yourself the next day to make up for the fact that you just unknowingly consumed EIGHT-HUNDRED dang calories for a regular sized burger.  If you include the order of fries, then add another 150-200 calories.\n\nWas the burger good, you ask?  Heck yeah!  Probably the best tasting burger, I've ever eaten, although very unassuming and plain in appearance.  It was so flavorful and aromatic.  You're hit with the garlic first, then you get punched with the cheese and the mushrooms...  Nice and soft, fluffy bread...  And, then, the truffle mayo???  That's the knock-out punch right there.  From that point, you're done.\n\nBut, regardless of the enormous pleasure I received from the aforementioned Truffle Mushroom Swiss burger, I must blame Smashburger for My Fitness Pal being mad at me.  You see, My Fitness Pal and I haven't been friends for very long so we're still working out some trust issues.  Apparently, I can't  prove convincingly enough that it was not my intention to eat over 2/3 of my daily calorie allotment in one meal.  \n\nSo, you'll understand, SmashBurger, if I won't be able to see you for a while?   My Fitness Pal will have a 'hissy'...", "author": "Danielle O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "I know what you're thinking...What's up with the name right? Well, SmashBurger's signature patty is \"smashed\" so that it gets crispy edges on the grill and it's cooked to medium. Because of this, the patties are not super thick and it makes sense once you try it!\n\nMy favorite was the classic Smash Burger on a fluffy egg bun with a side of Smash Fries seasoned with rosemary and garlic. The crispy haystack onions are super tasty too! Honestly, there are so many burger combos to be had -- and that's not even including the \"secret menu\" that includes things like fried pickles and fried eggs for your burger! \n\nAnd they serve beer (typically partnering with local breweries, which is awesome) + Haagen Daz milkshakes. Overall, this is a solid burger joint with fresh ingredients and reasonable prices.\n\nBTW, if you don't notice the signage right away, it's probably because SmashBurger's logo looks remarkably similar to GameStop. It's hiding in plain sight in the shopping plaza!", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-13", "description": "They have the best burgers but they have the worst fries and worst onion rings. The fries they sell are so skinny, I can't even taste the flavor. It completely sucks because I love the burgers they make but so far I have not been able to find any size that I can order to pair with the hamburger. A real shame, only 4 sides are available and only the sweet potatoes are fine.", "author": "Julia G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-10", "description": "Meh.  Tried this place 5 times over the last few months and 3 times things went wrong.\n\nToday, takeout order  of 4 burgers, sides and shakes.  18 minutes elapsed from the time the first burger hit the sack until the last.  So that first burger was cold and stale.  The onion rings were of course soggy because they sat there so long.  The shakes sat out for 10 minutes before they were put in a freezer while we waited for the food, but they were still melted.  One of the shakes wasn't the right flavor, and one of the burgers had incorrect toppings.\n\nOne a previous visit, with 2 burgers, one was lost somehow after being made.  They score half a point because they offered to remake both.\n\nAnd on another previous visit, items were not made to the order.\n\nThe food is pretty good, but considering the time this location has been open, you would think the kitchen would be onto the game.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-14", "description": "First off, I didn't try their burger.\n\nI just stopped by for a snack of fries and a shake, and had the spicy buffalo fries or whatever they're called, and a nutter butter shake. Both were disastrous.\n\nThe fries are shoestring, but are cooked as if normal cut, hence they're overcooked and crispy. If you like them this way great, I don't.\n\nThe shake was watery, not much creaminess, and the nutter butters added precious little flavor. The ground cookie bits were also very soggy, far too soggy for the cookie to have been added fresh, so I wondered whether they're using nutter butter ice cream. I doubt it, so the soggy cookie is not easily explainable, unless nutter butter get much soggier than Oreos very quickly.\n\nIf the goes-withs are this bad, I can only imagine the food, so I won't bother trying it. They go on and on about Certified Angus Beef, but at the end of the day this is just a brand that doesn't tell you anything other than the ranchers are part of a large coalition that uses a common logo to promote their product, much like how BBB or Diamond Certified works.\n\nAnd the music is WAY too loud.\nIt's a cheap joint for a snack, not a discotheque.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "Great burger joint. The burger patties are \"smashed\" and still super juicy. My favorite is anything with truffle on it.\n\nTheir fries and onion rings are also very good as well.\n\nHaven't gone wrong here yet.", "author": "Teese N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-30", "description": "Costs about the same as BurgerMeister or even The Counter but overall value and quality are about 60% as good - more like what might be a good experience at a Carls Junior than a step above the mass market and their pink slime meat.\n\nOn the plus side - a nice facility, clean and with good parking i.e. Potero Center. But hardly second-visit material due to incredibly average burger quality/value. \n\nStaff ~ok, average at best.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "as far as a burger food chain goes, i am a fan of smash burger!\n\ni tried the truffle mayo burger and i was pretty surprised just how truffle-ly it was. its was pretty greasy but i was in the mood for a nice greasy burger :D \n\nthe rosemary garlic fries were good as well, greasy as well but not in a super heavy and gross way\n\nid definitely choose this place over MCD/burger king so ill be back the next time i want a tasty burger without paying $10+ for a \"gourmet\" burger", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "I see the word 'smash' and naughty things come to mind (I know...what else is new, Christy!?). Seems like an appropriate word to associate with these burgers...I eat a smash burger, and I feel so naughty!  Just like the Hulk, I want to SMASH!\n\nIn the world of keeping up with the latest and greatest burger trends, Smash Burger has somehow managed to fill a niche. It's your everyday burger concept...but *SMASH* a bit different.\n\nFor a chain joint, their burgers are darn excellent. I like them much better than Five Guys...but they just can't beat the price-point of In N Out.\n\nLot's of excellent burger combos to try...I'm rather partial to the truffle mushroom swiss myself. You can choose one of their options off the menu, or you can go crazy and create your own with one of their many excellent toppings.\n\nBe sure to try the Smash fries...I love the rosemary and olive oil combo!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "This place is probably one of the best burger places I've been to. So I went in the dead of night around 9, I was waiting for a concert. And I went inside and order by making my own order. What really kind of sucked was the employees. The manager ended up firing a guy right in front of my mother and I. Not sure of the whole story and to be honest I could care less. But personally I thought it was a bit unprofessional to do so in front of a few other customers besides my mother and I. But once we got in the car with our order, we began to demolish every last bite of our burgers. All in all, great burgers, awkward services.", "author": "Sheryl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "This place is yummy! I always have their chicken sandwiches and they don't disappoint. The only issue I have is that the serving size is a bit on the small side and the serving of avocado is tiny.", "author": "Diane M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Smashburger was good but not great. The service was good, the food was good and the place was neat. I didn't expect anything, therefore I got a few different things for my family and myself. The burger was good, the chicken sandwich was good, the fries are good and the salad was good. No frills, just good food which I appreciated. Also, it's great they open at 10am for those of us who have lunch early on certain days!", "author": "Janet P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-04", "description": "I decided to come back, although fearful, I was presently surprised to find that it was under new management. It no longer took 40 minutes to get a burger. No longer did it become busy during the lunch rush. I wasn't ignored by the staff. Tom, the new GM, is a very professional and friendly man who keeps his staff on task and keeps customers happy. Honestly, I think he deserves a raise. He has turned this establishment around. Thank you Tom for giving me another irresistible option come lunch time!", "author": "James H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Tom the general manager is a wonderful man. He was really impressive and insightful about the place. He took our online order and was really sharp. Our burger was piping hot when it came out and the fries were sizzling. I ordered Bbq Bacon Cheeseburger with smashed fries my mom ordered the truffle burger and my dad ordered the big surf burger. Their burger is much better than In n Out and Five Guys. If they went nationwide, I think SmashBurger could give the other two fast food franchises as well as McDonald's and Burger King a run for their money. I wish Tom and the other folks at SmashBurger the best of luck in business. They have a lot of potential of dominating the burger and fries market. Their burger is at the top of my list of best burgers to eat. I am looking forward to having their CEO being featured on CNBC one of these days.", "author": "Danny W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Who doesn't love a good burger?The hubby and I both ordered the Truffle, Portabello mushroom, and swiss burger w/ a side of the smashfries. I think, the fries are tossed in olive oil, garlic, and parsley? We were both delighted with our food. Oh and their ketchup packets are hella cute. I should have took a pic of it, but I was starving...lol.\n\nI personally think the food is over priced. But then again, I think everything is. I usually never go out to eat. We spent 18 dollars for 2 burgers and 2  fries. For $18, I could have bought 9lbs of ground pork @ pacific super, or bought 4lbs of ground turkey for 3 nights worth of dinner. I dunno, call me frugal, call me cheap, call me budget betty...I don't care...lol. We are a family of 7, so my mind is always thinking of a deal. LOL. \n\nThe establishment is nice and bright. We didn't eat in, we ordered everything to go. \n\nAnywhere in SF with FREE parking always gets 2 thumbs up from me\n\nAnyways, if you haven't tried Smashburger, do yourself a favor and go for it! :)", "author": "E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "If you're interested in enjoying a delicious, freshly made burger or salad; this the spot! Business has definitely picked up here.   Not surprised!", "author": "J F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "New burger joint chain has finally made it to San Francisco.  This location is in the 16th and Potrero center.  Modern, clean interior. Known for using 100% angus beef that is cooked on a hot buttered grill to sear in the flavor and juciness.\n\nClassic smash ($5.29) American cheese, SMASH sauce, ketchup, lettuce, tomato, pickles and onion on an egg bun was a company and messy burger.  Good beef flavor and juciness.  Not exactly big, probably should have ordered the bigger one.\n\nCreate your own burger ($5.29) Cheddar cheese, Ciabatta bun had a good quality bun along with the signature moist beef. Another high quality solid burger we would rank far above In-and-Out.\n\nSmashfries ($2.29) Tossed with Rosemary, olive oil and garlic were thinly sliced fries cooked almost artisanal style.  Nice and crispy.\n\nVanilla Shake ($4.49) uses Haagen-Dazs ice cream for a pretty rich, tall shake. Almost as expensive as the burger! This also took a while to make.\n\n\nOverall - Very Good\nFood - Very Good\nDecor - Very Good\nService - Fair\nValue - Very Good", "author": "Ellen H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "If you don't want to spend a little extra on quality and a little bit of \"gourmet,\" then don't come to SmashBurger and complain about the price. Go to In N Out, or even McDonald's across the street. But for those who enjoy eating a hearty, mean, fresh burger then SmashBurger is your place. I like their variety of toppings and different types of burgers you can customize, plus their \"Smash sauce\" which is free.\n\nSmashBurger is always consistent, friendly and clean - and even better, open until 10PM. I always order the classic and it definitely hits the spot. I love their fries as well - it adds a very gourmet touch with the rosemary, olive oil and garlic. The fries are delicious - thin, crispy and piping hot! I'm going to be a little wild next time and add an egg and bacon to my beloved classic burger.", "author": "Jamie Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "Terrible... Missed my order so i have to wait for 35mins just for the order. And the workers were arguing... Definitely first and last.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "It's been a little over two years now (July 2015) and probably over a year since my last visit, and I have to admit it:  I prefer Smash Burger to In N Out.  The fries at the latter don't even compete;  In N Out's fries are a disgrace.  It's the burger.  The meat at Smash Burger is simply the best flavored of any I can think of---better than any of the burgers I've had at some rather posh places (and at posh prices) where I'd prefer not to see burgers, and even some out of state efforts, at chains practicing on a similar level of quality, like Cascade.\n\nEven more annoying than the ridiculous spread of the burger among restaurants (not to mention mac-n-cheese; flank steak; and fish tacos) is the fact that almost all of them, even with purportedly fine quality beef of the most contented bovines, have so little flavor;  the beef itself isn't particularly exciting, and the seasonings seem timid.\n\nHaving found the beef so delicious, it's only reassuring to find the fries are just as good.   I can't say they're the best, but they are very very good, and consistently so.  There have been a couple of places where I went bonkers over the fries on the first visit, only to have the second visit provide what appeared to be twice cooked scraps.\n\nAnd they serve beer and wine.   \n\nIf I happen to go to In N Out more often (which isn't very often at all----say once or twice a year tops, vs once---maybe twice a year to Smash Burger;) it's because I'm more likely to head towards the water, towards Irish Coffees, than I am to head to a part of town that is, let's be honest, butt ugly, and with nothing else to recommend it, once you've taken the trouble to get there.\n\nSo, when I'm in the Legendary Burger Joint, I'm not only denouncing the fries, I'm eating the burger and thinking \"Nice, but not a Smash Burger\".  When I'm out of town, I'll be looking for Smash Burgers.  I'm a loyal person, but when someone else does a better job, you have to reward them, not just hang on to what was...", "author": "Paul T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "3.5+ stars for this place.  I'm glad I was referred to it by my coworkers.  It's a great place to come for burgers for those of us who like variety as to toppings (like being able to choose a bacon burger with BBQ sauce) but at the same time don't want to go to either a fast food place or a \"gourmet\" burgers with serving typically greater than a quarter pound and leaving me feeling overstuffed afterwards.  Some people say the burger may be small for the price, but I think it's the perfect size.\n\nThe rosemary garlic fries are somewhat unique and quite a treat also.", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-07", "description": "The proximity of this place from my gym makes it a perfect lazy-post-workout protein palace.\n\nThe food is surprisingly good! Everything is freshly prepared. My go-to is the Baja Cobb salad with chicken. Their sweet potato fries are pretty dang good, too. You can also order your burger bun-less if you're trying to stay semi-healthy (at a burger place, of course), but aren't in a salad mood.\n\nThe customer service here is really friendly, too. I'm just bummed they don't have fried pickles at this location (probably for the best, considering I come here AFTER my workouts).", "author": "Sabrina V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "The Spicy Baja Burger has a nice kick to it, the Avocado Club burger is nice and fresh, fries are nice and crispy. The burger meat itself is very juicy and delicious. Ordering a burger \"big\" sized is a good value, you get a lot more meat for only a dollar extra. The only thing I would change, the Oreo Shake was a little runny, but still very tasty.\n\nThe staff is very friendly and quick! Overall, it's not going to blow your mind, but is definitely a solid place to get food that will leave you happy. My girlfriend and I will definite be regulars!\n\nOverall price: $23 (not bad for two burgers, fries, soda and a shake in SF)", "author": "Phil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "The staff is very friendly and the food is definitely good quality. I ordered the bbq bacon chicken burger whtg smash fries. They call it smashburger because the meat is smashed on the grill and comes out wider.   Got good chicken as well as beef.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-11", "description": "Food was okay. I would never come back to this location. Restaurant was filthy. Also, employees talking to one another cussing and also play wrestling each other where one of them was screaming. This location needs help on managing and customer service.", "author": "Ammie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "Wow, never had a smash burger until today and it was smashingly tasty! I ordered the truffle burger, big size with grilled onions added at no charge and haystack fried onions. My bf got the bay burger big size. They had a BOGO promo that ends 9/24 so we got 2 burgers and a size of fries for only $10!!! What a steal! Not only was the burger delicious, the customer service was way above and beyond. As soon as we walked in we were greeted with a smile. Cashier recommended the sides. They also bring out your order to your table and in a timely manner. They ask how the food was, they ask if they can refill your drink or if they can get you anything else and they offer to remove the basket as soon as you are done eating so it's not in your way. I've never experienced such high customer service at a burger joint before. The only con I have is when you order the big size for my burger it means the patty is bigger while the bun remains the same size. As a result it was very messy to eat because the patty kept falling out of the bun, but they have forks and knives and plenty of napkins. My bf had a ciabatta bun which is a bigger square bun, I'd highly recommend that bun if you are gonna up your size. Mmm can't wait to try their other selections.", "author": "Vinkin Ken T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Great service and even better food \nI ordered regular bay burger and man did it deliver! The truffle mayo really shined through.  Honestly a little sad that it's gone. Can't wait to go back for lunch. Nice clean location was a plus plus!!", "author": "Raquel F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "I was pleasantly surprised by Smashmouth!  The burgers were juicy and the Smash fries are pretty awesome!  The manager came around to every table and said hello/checked on us which I thought was a really cool thing.  The restaurant seating area is spacious and they have a clean bathroom.   This is a great little lunch or dinner spot when you want a fast good burger option. Hint: Get the bigger burger option.  The regular us just a little undersized for me.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Check your burgers before you leave \nThey may mess up your order", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-29", "description": "I come here often because it's near my job and really love the Cobb salad. One day my card wasn't working and the manager tom recognized me and comped my meal, which I truly appreciated. I will continue to come back, for the service, location and food", "author": "Lorain C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-27", "description": "This was a-fucking-mazing!! I came in hungover as shit, ordered the BBQ bacon burger, and an Oreo milkshake.\n\nService was friendly, food came quick, price is super reasonable.\n\nThe burger was hot and juicy, and I tasted some type of high quality organic grass fed flavor in there, but I'm not sure if it came from the beef or the bacon. I don't know if it was organic, or free range, but it tasted the type of meats that I get when I go to whole foods.\n\nThe burger didn't come with fries, so I was kicking myself for not ordering either their truffle fries or sweet potato fries. Guess I'll have to come back!\n\nThe milkshake was a great milkshake, and they gave me the little metal cup so you pour more.\n\nI'm definitely gonna get fat on this place.", "author": "Phil G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Giving Super Duper a run for their money. Luv the bay option of arugula. Reminds me of chain Shake Shack back east. Took a whole group of burger lovers from work to lunch to raves  -- roomy and not too busy (does need more central location).", "author": "Fred O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "Okay, the truth is I don't eat burgers very often and if I do I go to Burger Meister or Barneys...Gourmet Burger.  However, I was damn hungry and the Potrero Center is my 'hood place\" for many things;  Radio Shack, Petco, Safeway, Starbucks & Peets, Nubi, Office Depot, etc \n\nSo there I was, and as I said, I was hungry...........................\nI'd been noticing it from the outside for weeks so I figured I should check it out. \nI only got a burger so that's all I can write about.  I got pickles on the side and no mayo.  I changed bread to ciabatta and the cheese to swiss.  I ordered the bacon, cheese regular burger with mustard, tomato, raw red onions and lettuce.......$5.99 + tax.  This was not a gourmet burger, but I thought it was damn tasty and I will definitely go back again for my 4 burger limit a year!  Convenient location, clean place, very nice staff, really reasonable prices and a good, good burger made with Angus beef, generous portion of Applewood Bacon and cheese of your choice.", "author": "Patrice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-23", "description": "Really happy to have this additional lunch option near our office! \nFirst day there today and I had the basic burger and fries - will try more exotic options, chicken sandwiches, and salads on future visits.\nThe burger was perfectly serviceable. It's of the wide and thin variety, which means it gets cooked through fully. Fine if you like yours medium/well, but if (like me) you look for a thicker patty cooked to a juicy medium, with pink in the middle, then you'll be disappointed. Fries were fine, a bit on the thin side for me but nice and crispy.\nOverall, a much better alternative to the McDonalds next door, but not quite in the Super Duper league that they're priced for.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-21", "description": "Another burger chain that feels like a burger chain. Sadly, their burgers are totally not worth the cost. My gf and I had the bay chicken sandwich and avocado club smash burger. The burger, while decently seasoned and cooked, didn't make me feel like I was eating a comprehensive dish. All the components felt awkwardly smashed together (see what I did there?). The bay chicken was fine, a little salty, but mostly, it was just too small. There was nothing on there! Only like 5 pieces of arugula and mushroom. So disappointing. For 5 bucks apiece, heartily disappointing.", "author": "Ruobin W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-14", "description": "a solid choice for a burger if you are in the area\n\nthe truffle fries were drenched in way too much truffle oil though", "author": "Long C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-17", "description": "Smashing success.\n\nFor your ears: https://www.youtube.com/watch?v=tETirzcSVlQ\n\nFor your appetite: Outstanding homemade black bean burger on a multigrain bun.\n\nBuild your own for $6 which includes free toppings like grilled onions. Balance out your healthy choice with a little of their mayo and mustard based smash sauce. It's good.\n\nFive stars for Tritonal smashes and Smashburger.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "My first visit...The food was great...prompt and friendly staff and they serve real cold beer! I had the avocado chicken w/ rosemary fries just delicious!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "I first tried Smashburger in Fort Bliss, located in El Paso Texas. I haven't seen many around but all there food is really good. What I really like is there chicken burgers. If your have never heard or gone to this restaurant I would recommend you give them a try. I think you will be pleasantly surprised.", "author": "Luis L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-24", "description": "The NASTIEST vegetarian \"burger\" I've ever had --seriously bad.  I ordered the TRUFFLE MUSHROOM SWISS (of the vegetarian variety).  The \"meat\" was a very dry and crumbled refried beans \"patty\" or the like, smashed between two very dry pieces of bun with a slice of swiss cheese and a few slices of soggy fried mushrooms.  Normally, I DON'T EAT ANY OF THIS type of crappy \"fried to oblivion\" fast food (uh hem, they call it \"fresh\"), but I was participating in an all day meeting and someone volunteered to go out and pickup lunch for the entire group. They also have pretty nasty fries too that were room temperature and covered with deep fried soggy parsley flakes when delivered (worksite is a two minute drive from restaurant).   EVERYTHING WAS soggy and deep fried to oblivion. NASTY.", "author": "Paul In S. F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-20", "description": "No point going here for lunch just yet,\nLine out the door,\n1 person on register moving very slowly,\nInquired about a 2nd register opening up ?\nBlank stare and a maybe tomorrow from the manager,\nPlace looks good !\nIf you see a line at all just walk. \nJb.", "author": "Jeromhia B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-20", "description": "Laquisha was really nice until they had a rush... Very very very unprofessional staff. Laquisha was yelling for help at the other girl to help ring as no one assisted her....then the general manager Mark appeared to assist after several customers walked out... First time here... Very interesting", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-22", "description": "FUCK this place. Thanks for putting one cashier on during lunch. Smart move manager, you fucking dolt.", "author": "J. B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "Okay, so SmashBurger was pretty awesome when I went there-- lots of seating and a pretty awesome menu. I actually didn't order anything, but I had some of my friend's fries-- the smash fries are AWESOME. They have a great taste from the fry itself with a tint of rosemary--not too much and not too little.\nAlso, I tried a bite of the burger, (bacon cheeseburger) and it was GREAT. I wished so badly I wasn't full so that I could order my own burger...\n\nBack in NYC now and I'm tempted to make the trek out to Brooklyn to go to the SmashBurger here!\n\nPS: I heard their shakes are awesome!!!", "author": "Azinda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "This place is kind of like a less greasy version of Super Duper. The fries leave something more to be desired though: they're too thin and so you have to eat a lot of them to get that same level of satisfaction from large steak fries.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-20", "description": "Let me clarify something first.. When I order my food the front end assistant  manager was really nice and the rest of the crew... \"when I ordered my burger.\"The whole place looks absolutely clean and it has tons of place to seat.. That got the the 3 stars..  \nThe burger it self got 0..\n1- They advertise it is  grilled and it isn't not grilled.. I owned  a grill before.. I know what it should looks like and taste.\n2-when I grabbed my burger to eat, the fat was dripping like \"a raining day in San Francisco in January.. \" I'm aware that burger is damn fatty, but I had to use 15 napkins to keep the grease of my hands. All the other fast foods restaurant that I've eaten in the past wasn't grease at all..\n3-I asked for the classic smashed burger to come plain. No maio, no cheese, no special dressing, no bacon. And it still dripping all that oil?\n4-immerse your own consciously awareness \nyourself by eating the\" classic burger\" I don't deliberately your calories worries, but I'd definitely want u to be in touch with healthiness of the burger.. It can be done healthier .. Specially when they promoted it  grilled.. Surface cooking isn't the same as griled.. \n5- I'll give it  one more try..", "author": "Pedro D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "To bad Daniel wouldn't let me place a phone order, would of saved me a lot of time. This is my second time ordering from the 16th street location. Nice staff, just wish I could place a phone order.", "author": "Debbiedeb W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-07", "description": "Don't understand what the big deal is about this place it is an overpriced crappy McDonalds...... That being said came here recently as I work in the area and saw the raving yelp reviews..... Was very disappointed the burger had a weird gamey taste to it and was cooked extra well done the fries and onion strings where the saltiest thing I've ever had.\n\nMy friend and I shared two different burgers, the first was the bay burger which was not the business meat was very dry and the arugula and the mushrooms all had a weird taste to it. The only decent thing I had here was the bacon burger it at least tasted half way decent.  \n\nI gave two stars one for the friendly staff the other for the great Ice Tea LOL........\n\n\n****** Don't be fooled by the raving yelp reviews********", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "A decent burger. A lot to take in on the menu for a first-timer. We had the classic smashburger and a Windy City smashburger and smashfries. Liked the fries a lot, rosemary, olive oil, garlic not too overwhelming. You'll have a good meal here. We compared it to Roam burger and would go to Roam instead, but would definitely have a Smashburger in a pinch.", "author": "Carol E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "I was shopping in the area and coinsidently i ended up in this place. I did not have much time so i took my order to go. By the way space is very big i thing it was a former blockbuster spot.\nInterior was cool, clean and servers were helpful. I tried regular size bay burger with arugula and it was suprisingly tasty. \n\nSo yeah, if you are in the area and need a quick hunger fix definitely you should check it out.", "author": "Lyra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "I read about this chain opening here in SF and as a result, my husband and I have a new favorite burger joint. OMFG, this place is off the chain Super high quality ingredients, decent prices, even the serving dishes which hold whatever free condiment you want that the staff bring to your table are silver. Living here, you almost get used to even casual restaurants being overpriced and precious. Yet, Smashburger is the exception.\n Great burgers on cibatta buns, truffle mayo (oh yes) arugulla, fresh haystack onions, applewood smoked bacon, matchstick fries with rosemary and garlic, shakes made with Haagendass ice cream. Most toppings are complimentary! Even a meatless burger freshly made with black beans for when my veggie best friend comes to town. No gimmicks- most burgers are $6-7 for a very rich satisfying experience.", "author": "Antoinette S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Def a good spot to try again.  The crispy skinny cut fries with the olive oil and rosemary were really good.  The burger was pretty great too and they have a large selection of toppings to choose from.  The only thing is that there was a little miscommunication on the toppings I wanted.  I ended up with more toppings than I asked for.  But I really couldn't complain about that.  It was delicious. You order up at the register then they bring it to your table.  Clean dining room.  Bathrooms pretty decent too.", "author": "Marisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Pretty surprised by how much I love the food here! Just an FYI, they don't do take out phone orders. But anyways! For starters, I walked in like 15 minutes before closing and the person who had taken my order was still very nice to me! Thumbs up for that because if it were me, I would not have been that nice at last minute customers haha. \n\nFor some reason, I thought the burgers would be small with how they're priced. But I was gladly wrong about that!\n\nI ordered the bay burger with extra onions and sweet potato fries! Have to say that it was delish. I love love love truffle anything! Never heard of truffle mayo before until this place and it went so well with my burger. The sweet potato fries were good as well. Nothing out of the ordinary but nothing bad either. Granted I did order for take out so everything probably would have tasted better if I had eaten there but nonetheless, the food was still good :) \n\nOverall, I think this place is great. Food's good. The prices are great. Service seems cool. Ambiance and decor were nice (mostly bay decor, what's not to love!) \n\nDefinitely makes me want to come back and try everything else on the menu.", "author": "Jackie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "I actually really enjoyed this place! My boyfriend and I debated on going here or to Umami Burger and ultimately decided coming here because it was about half the price. It was very inexpensive but had great quality food. I had the Chicken Avacado Club while my boyfriend had the Spicy Baja burger and we both couldnt get enough of them.\nWe totally coming back here soon. Oh, and they have a parking lot which i find to be very helpful in San Francisco.\n\nIf you sign up for their Smash Club online you will recieve some coupons!", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-26", "description": "BEST BURGER I'VE HAD IN A LOOOONG TIME! The Truffle mushroom swiss, yum! Also, great service, thanks Trina and everyone else! \n\nI will be going back again and again.", "author": "erika e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "Good burger.  Service was professional and the place looked clean.  About what you'd expect.", "author": "Scott N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-28", "description": "This place...\n\nWhen we first started coming here maybe 6 months ago, it was quite good for a fast-food place. Great vegetarian options. But, over the last 6 months they genuinely seem like they are trying to fuck up. The man and I often order the Spinach, Cucumber and Goat Cheese salad. I cannot honestly remember the last time that it was correctly made - either they forget the goat cheese, or the pumpkin/sesame seeds, or it's drowning in dressing. The french fries or the \"Veggie Frites\" (deep fried sticks of carrots and green beans) are COVERED in grease, to the point of needing to wipe them off before eating. Their fries are good, but somewhere the process is falling apart - lots of other fast food restaurants seem to understand how to make french fries. I'm really not a picky person, but every time we come here we ask ourselves why we did it AGAIN.\n\nWhen the food is made correctly, it's good - just know you're going to have to ask them to fix whatever you order.", "author": "Patty N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "I've never been here before . I thank you. Burger was great. People were friendly. And the place was clean.", "author": "Darren V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-28", "description": "This place is a good addition to this part of the city. SB fits in well as an upscale chain place, in the context of a mostly corporate strip mall. \n\nI'm not a burger guy per se, but they also have a really good chicken sandwich. Everything is good and fresh. There are a number of ways to customize your sandwich. I tried wife's burger, and while I'm no fan of beef, it did seem to be well put together. The salads are inviting. There are three options for fries, all done properly as well. \n\nThe one fairly small thing I'm not fond of is the lack of a good iced tea. The machine there produces a weak, flavorless tea, like the mix has not been prepared properly. A couple of times I've noted this to the staff, and they say they'll have someone look into it. I just ask for water now after a few tries over a couple of months.", "author": "Roger B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Well the spicy wasn't spicy,  but I heard they do not use frozen food, and was wondering how is it possible.  But yes,  it is possible and one could easily make the difference. Very delicious n soft meat.", "author": "Dev D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-09", "description": "This place isn't half bad. It's better than just about any fast food burger, except In-N-Out. It's definitely better that Five Guys, but then what isn't?\n\nThere is certainly a 'concept' going on here. Look at the CEO and the corporate leads, mostly marketing and branding guys. But the food is fresh, not too expensive, it comes out fast, and they have Cherry Coke on tap.", "author": "Matt J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "Been here a couple of times and service is not on point, they need to step it up and do better. Yesterday was here with my husband and I was  not pleased  with my order fries were extremely grease  and my burger was just slope, ice matching dint have ice and they were slow. Not a happy customer.", "author": "Maria O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "I Love this place!! I had it in Downtown LA by the Staple Center and was so happy when I found it in SF. I wish they would put one closer to my house. Their food is fresh, healthier than normal fast food. Matter of fact, I wouldn't consider this place a typical fast food joint because of the quality and prices. I don't eat MacDonald's and all that other crap, but I will eat a grilled chicken classic Smash from here on a wheat bun. delicious!! Their service is great too. Man....now I'm craving their sweet potato fries and all I did was write this review...lol.", "author": "Jasmin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "23 minutes wait between ordering ( two burgers & fries for $20 ) and being served and then I got cold regular fries instead of the smash fries I ordered. The kitchen crew at this location is not yet up to the demands of their jobs.", "author": "Robert D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "When we walked in, my amazing, gorgeous, and stunning fiance said \"its like chipotel... but burger style...\"    Shes a very picky and healthy eater, so i didn't tell her where we were going till we got there.e.    Ive been here a few times since they opened with some co workers, but never with her, and wanted to go someplace casual and not so expensive.     \n\nThere is a bit of an illusion that this place is very health concision, being it's right next to a vitamin store.    Even though the food is good, and the place is very clean, i didn't think its all that much healthier then any other bacon cheese burger could be.   But the service is fast, the staff is polite and even though the price point is a few bucks more then you'd normally pay for a good burger, you do save on the tip, and they still bring your order to your table.   One big plus was the nice server girl when she brought the food to the table asked if there was anything else we wanted, and she was happy to get us a side of ranch.   Not something you'd expect at a fast food place of this nature.   Pig ups to the staff there.   \n\nThe regular fries are nice, cause they are extra skinny, so that makes then very crunchy.   She had the Baja chicken and bacon with fresh avocado ... it was very tasty.    Of course I ate all her bacon.   I had a very juicy bacon cheeseburger with onion crisps on it.   It was delicious.   the buns are yellow and very yummy!     Despite the bit of excess grease, the bread stayed together very well.   That's always a good thing.    \n\nParking is convenient, but in the worst corner of that mall... so watch out backing out... all those nutty people that go to Ross don't drive so well.     I'll likely go back, cause the place is extra clean, and the staff is very nice, and the food is good.   $24 for 2 people for lunch with 2 burgers, drinks and sides at a decently healthy place for fast food is a very fair deal considering the convenience of the parking.    I would give it 5 stars... but its just a glorified fast food joint.", "author": "Vlad C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-16", "description": "I did the online ordering at the website for a reason....to not have to wait for my food. I ordered two salads and two shakes. My order took 15 minutes longer than it should have taken. Thanks for wasting my time SmashBurger.", "author": "Brooke A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-22", "description": "I love Smashburger especially because of the great experience I've had for their branches in the south bay, but of the two instances i've been at this branch, they've consistently managed to screw up my order: Spinach-Cucumber-Goat Cheese burger. the first was missing the cucumbers and the second(tonight), was missing the goat cheese. I will be visiting this facility a third time, hopefully they won't screw up my simple order!", "author": "Roland T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-13", "description": "About what you'd expect. Edible, sort-of tasty burger (had the mushroom truffle) but you know you're not off to a good start when the cashier says, \"They [cooks] only make it one way: with a little pink or well done.\"\nThe soda machine was busted, the dining hall floors were sticky, most of tables weren't clean (despite the few customers)  and the bathroom appeared to be coated in urine (this last one may be due to its 16th and Potrero location). \nWon't be back.", "author": "D C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "One of my volleyball players recommended this place after one of our games in the city. Since it was close by we all went. I've never been here before but I have to say it was pretty darn good. Had the bacon cheeseburger and regular fries. Better than average burger. Pretty darn close to shake shack in New York. Real ground meat makes a great burger and this is one of those places.  Loved it. So did the volleyball team.", "author": "George S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-16", "description": "Process is great, but burgers are a bit greasy.", "author": "AJ K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-02", "description": "As advertised ...I ordered a smashburger and got a smashed burger", "author": "Carlos G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "Try the Cobb salad with crispy chicken.  Delicious, appropriately priced, quick service.  Everything I could ask for.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-24", "description": "I had the Avocado Chicken Club.! Super delicious chicken sandwich with a lot of flavor.! And the Chocolate Oreo shake was a thumbs up too.! Definitely will go there on my lunch break again.!", "author": "Jackie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-18", "description": "Vegetarian black bean burger contains eggs and cheese. Heard rumor that all sides are cooked in beef fat. Too bad. Good service and food if you're a carnivore.", "author": "Christy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "I went here once before and thought it was ok, but last night we came here for dinner and my sandwich came out with raw chicken (I am 8 months pregnant and I was so starving I didn't notice until I'd already eaten half). It took forever for a remake, and I was so hungry but it still wasn't very good. Obviously it's a health hazard for a pregnant woman to eat here since salmonella and listeria are harmful to an unborn baby, not to mention disgusting to eat raw chicken!!! On our way out I had to hold on to my husband because I nearly slipped (but caught myself thank God) on their greasy floor. The fries and fried pickles were extra greasy and not exciting. I'd say it's on par with McDonalds. Eat at your own risk!", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "Good stuff!  I encourage you to customize your own burger.  First understand all the various ingredients (ask about the local ones) and be creative!  Ask about the Bay Burger!  Try it with the egg bun!", "author": "Paul John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "a little pricey but hey its san Francisco... anyway I get a double blue cheese bacon burger. its a decent burger for lunch I wouldn't come here for dinner I wouldn't be satisfied for having it for my last meal of the day yea I know im weird. the employees are helpful and nice I had no problems with them. the patties were watery (the only way I can explain it haha) and tasteless some people may call it juicy but I call it watery there's a difference. it could of used some salt. the fries are smash mouth haha regular fries or the smash mouth fries are good small and crunchy. I never had a shake there but they look good. I recommend it if u want a burger and in the area it will satisfy your need its not a bad burger I come here once in a while.", "author": "Rigoberto C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-29", "description": "Just had a smooshy but tasty bean burger and side salad. One of the staff eagerly took away my plate as I was eating the last bite. All set? he said with one hand on the plate. Kind of weird, but whatever. Tasty tasty food. I recommend reading the menu online first.", "author": "C S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-05", "description": "Everything was okay, but generally just disappointing.  Laying down $10+ for a burger, you just expect it to be better than Wendy's.  The bun and all of the toppings were first rate, but the burger itself was super spongy, watery, and bland.  It just tasted like a Sysco frozen patty cooked without even salt added.", "author": "Josh Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "This place is great!  The service is terrific, and I like their menu.  You can have a great cheeseburger, or you can fancify it by having one of their truffle mushroom burgers or the jalapenos Baja burger.\n\nGreat food!  Good prices, and the people are terrific.  It's also really clean! (I love that!)", "author": "Douglas S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Best \"fast food\" burger around; handily beats out In and Out with options, Jack in the Box with quality and McDonalds because it isn't. Fries are on par with 4-star restaurant appetizer versions of the same.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "I have been here many times now. I do have to say that their salads are my favorite. Burgers are good as well as the chicken burger. I do prefer the grilled chicken over the fried because you can taste the marinade. I do love sweet potato fries but did find theirs lacking. The smash fries are just okay with to much rosemary for my taste. Their regular fries are wonderful. You can change or substitute as you wish, sometimes at a slight cost. They have a good variety and are very reasonable. \n\nTime wise, it usually takes longer to order than it does to get your food. We usually have our food within 10 minutes or if they are busy 15.", "author": "michelle b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "Really wanted to like this place, but after today I will not return. i ordered a regular burger with chipotle mayo......first strike, rude waitress takes my order as if I annoyed her by asking how ordering works as this is my first time. Strike two.....no mayo to be seen on my burger once it arrives......strike three.....A HAIR ( light brown ) on my sweet potato fries!!!! I showed my mom and she could not believe it and she eats here often. GROSS. Sorry but I personally want my food minus random hair clearly not mine. No manager was in sight to complain to, so i just left my food. What a waste of money and above all time.", "author": "Christina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Love this place! The burgers are great, as are the smash fries, and the milkshakes.  I come here atlesst once a week.  It's that good", "author": "Roman R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-15", "description": "Enjoy delicious, plentiful semi-fast food. It is like fast food because you are literally in a mini-mall parking lot so you feel like you are in the suburbs of San Francisco, the service is fast and the layout is fast food. It is not really fast food because it is not as cheap but also far more tasty. \n\nThey have beer! And great milkshakes! Go there now!", "author": "Ojus P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "a very nice change for the \"healthy lunch\" options that are all over the SF FiDi.  When you are craving a nice juicy greasy burger, this place is solid, and great staff.  Ask for some mushrooms on your sandwich and get ready for a long nap in the office.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Their chicken falls out of the bun it is so big!  Their ingredients have always been fresh when I have been, and their staff is always friendly.  Long lines if you go at lunch during the week, but well worth it.", "author": "Stacey D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-04", "description": "Not a great burger. Not sure why this place is so highly rated. Beef was overcooked, bland, and greasy. Also the patty is way bigger than the bun which makes it slip out and then you just have a big mess. Sweet potato fries were crispy but over salted. Staff was very friendly though. Super duper is much better for a similar price point.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-11", "description": "I had a veggie burger which was very soft and not so good tasting.  My friend had a hamburger which was uncooked and totally pink.  So we could not eat it anymore and decide to leave.  As a curtesy to other customers I go to tell them that the burger was uncooked so that they look at their quality control process. Then they tell me that is their style and if I wanted it cooked all the way I have ask for it when ordering. Seriously!   Will never go back there.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "I wasn't quite craving beef, so I ordered the Baja Chicken Burger.  I was a bit afraid that the chicken might be dry but to my surprise, it was super moist and tender.  The burger had a good kick to it with the jalapenos but wasn't too spicy.  Their smash fries are so addictive, skinny fries with olive oil and rosemary, YUM!  Their oreo shake was good too.  I can't wait to go back and try their other burgers and nutter butter shake.", "author": "Veronica N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "smash it. great food. unique menu compared to regular burger shops.", "author": "Kumar G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "I usually come here for lunch if I'm craving a burger. Last time I was here, I ordered the bacon cheeseburger and it was pretty good. I decided to give the smashfries a try & it was delicious ! The portion of the food they serve is good, considering that it's pretty cheap. The strawberry shake never disappoints me either.", "author": "Sara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "One of the best burger I had from a chain restaurant.\n\nThe meat is as good as at Five Guys but it is juicier so the burger has a bit more taste.\n\nThe bun could be a bit crispier and it would be an excellent burger.\n\nThe fries are thin and crispy which is the complete opposite of Five Guys where they are fat and soggy. I like both type so that's easy but you might not.\n\nIt is not in the best part of the city so don't expect a nice atmosphere and area.\n\nWished they had some TVs also to make it more friendly and make you want to stay longer and come back more often.\n\nIt is very cheap though for such a good quality burger so will definitely go back when in need of a burger since there is no Five Guys in SF.", "author": "K L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-06", "description": "A decent burger place. Nothing out of the ordinary. Just a good place  with good food. Clean and new.  My son loved it though! Will come back.", "author": "Jorydude r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "Always happy with the service.   Fast.  Excellent.   Yummy.  Having the jalapeño burger!", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Good food good service. I'm always in and out. The staff are great people. They have best customer service in the mission", "author": "Alonzo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-20", "description": "It was quite nice. Tried a burger with bacon and avocado.  It was good. Tasty. Not too greasy.  Will not rush back or be opposed to it.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "There's something about this place! These burgers are some of the best I've had, they're not too big in size but they're delicious, the hot fries are good as well, if you love burgers I guarantee you will love this place!", "author": "Carlos F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-02", "description": "I love a good burger, and was excited to read a piece in the Chronicle about this \"gourmet\" burger chain opening in Potrero Center.\n\nI was a little put off by the signage posted at the winding, cafeteria-like line to the ordering counter listing rules for how to order. Their website and ads portrayed them as a gourmet sit-dowm burger joint. But all appearances told me I had entered a cafeteria. \n\nWhen I got to the cashier I ordered their BBQ bacon burger, medium rare.  The cashier paused a moment, then said \"We only serve burgers well done\".  I said \"What?\".  It took a moment to believe that a \"gourmet\" burger joint refused to cook their burger to the customer's preferred temperature.  But, sadly, it IS true.\nI haven't eaten a hamburger cooked past medium since I was 12, and certainly have no intention of doing so now because this fast food chain doesn't care to train it's cooks well enough (or pay them enough) to do so.\nI left.\nThere are plenty of SF places to get a great burger.  Smash Burger is not one of them.\nThe Super Duper burger local minichain serves an excellent organic burger here in SF (also smashed and crusty on a homemade bun), and will gladly have their better trained and paid cooks prepare it to the temperature you request. At a lower price. So save your hard earned money while satisfying your gourmet burger jones there. \nSmashburger is just McDonald's disguised low pay no service product model with more PR attitude designed to fool the consumer.  That might succeed in other markets but I hope it's not good enough to succeed here.  We like to think we have better expectations here, but we have to vote with our dollars if that rejection of corporate chains is to be a deterrent.\nAre you in?", "author": "Gary N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-15", "description": "Normally the service is excellent.  The burgers are very good. However it's apparent there's been a turnover in staff. It literally took 10 minutes for a customer order to be taken. I  was the third person in line to order.  I requested to see the Manger? I was informed she was on break.  The cashier asked me why what's up I responded the level of service ,the time it's taking to place an or  and proceeded to leave as I turned away the young lay wearing a name tag identified as Jay began to laugh as mocking me. I felt it was very insulting, disrespectful and devalued as a customer.  As a business in the retail industry extremely unprofessional and quite ghetto! !! Perhaps Smash Burgers need Smashed the the whole entire crew for their misconduct. Even the cook found this amusing.", "author": "Deborah K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-10", "description": "Don't understand where the ratings are coming from... maybe because it's new and neighborhood people are just excited because they have an alternative to the McDonald across the street.  ..  But I had a momentary lapse in suburgatory and when to a chain burger joint....\nAvocado Club Burger: Fresh avocado, applewood-smoked bacon, lettuce, tomato, ranch dressing and mayo on a multi-grain bun. \nFirst off, putting and mixing in crazy ideas on classic standards is usually an open door for failure; and if  your going to go there, you better be top notch with it and your ingredients.    \nWhile the burger patty itself was pretty good...  The toppings were beyond unacceptable.  The tomato was so unripened it was white, and the avocado was a unsliced quarter of the fruit just plopped on top of the open faced bun.  It was so hard it could not simply be \"smashed\" in and both were tasteless.  \nIf I'm happen to be clear across town while craving a burger again I may give them a another chance to prove themselves but right now I don't get it.  I don't see them surviving outside of strip malls or in the city of some damn good burger joints.", "author": "John W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-27", "description": "Continued proof that nobody in SF actually makes a good hamburger. A very poor experience at SmashBurger. When the coke is the best part of your meal, you know something is seriously wrong. The burger was disappointing, thrown together as if it were made by a third grader, greasy and tasteless. The fries were way over salted and thin, microscopic thin. Then the service, one person taking orders at noon. Instead of taking care of customers and moving them along, she found it more important to flirt with the guy in front of her. Neither would win any beauty contests. Overall a poor experience, would never go back.", "author": "Henry J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-25", "description": "Seriously good tasting burger with an egg bun!! Can't believe the quality in this chains food! This is one of my all time favourites and we drove across the bridge to eat this one tonight!!", "author": "Prima D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-20", "description": "For fast food, very fresh and very good. Glad this place is in my neighborhood and don't want it to go away. The truffle mushroom Swiss is a good burger/chicken option.", "author": "Scott H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-30", "description": "Been here 4 times. First three with mushroom burger and side salad were excellent. Last time bacon cheeseburger I found the food so salty that it was hard to finish. Service is friendly and excellent. Salads are fresh   good budget option for burgers. Much better than usual well advertised chain stores", "author": "Lambchop B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "This place is a winner. Delicious burger and fries at a reasonable price. Sit at the counter and talk to your buddy. I'll be back guys - keep up the good work.", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "My son and I were on our way to Togo's to have lunch between jobs when I saw this eatery. Let me start by saying that I NEVER order a burger when we go out, I typically do not like burgers. \n\nI asked a couple of people in line if they had been there before and it seemed like everyone in front of us was there for the first time. \n\nI ordered a large buter (I was hungry and for $1 more, seemed logical) with grilled onions, chipotle bun, and chipotle sauce. My son ordered a jalepeno burger and we shared an order of smashed fries.  My burger was perfect in every way, I was pleasantly pleased. I didn't care for the fries however. I love garlic fries but this had hints of this and hints of that, not quite enough of anything to make it outstanding. My son pulled all the sliced raw jalepenos out.\n\nThe first time we were asked if everything was ok, I was impressed. The second time we were approached by a different worker, I said \"wow, what service\". ok, enough already, we were there about 1/2 an hour and by the 10th time, I was beyond annoyed. There's good customer service and then there's irritation. This was the part that took a star away.\n\nI got home & did the online survey and conveyed this very annoying point. I went back a second time with my husband and other son and the burger was still good. Consistency is a good thing. This time we didn't once get asked by anyone if everything was ok. Being that it is not a table service place, I actually don't mind. There were enough employees roaming around that I could've waved someone down if I needed something. \n\nI think it was the same employee that took my order at the cash register. He was not too bright but his friendliness made up for it and they got our orders right both times.", "author": "May G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "If you like burgers and fries then this is the place. Not as expensive as the other HOT burger joints and just as impressive. I even heard the secret sauce they use has tears of angel or something like that. I am not sure since it is a \"secret\". Anyways, get the burger with bacon and cheese (or if you are a snob, its called a bacon cheese burger) because you will die. Yes because its good but because its also packed with high saturated fat and salt. Remember that no one lives forever so live with style (and ditch your girly Prius). See you there.", "author": "Edson C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-11", "description": "This is a good, tasty, burger joint. If you haven't figured it out already, the meat patty is \"smashed\" and flattened. I wonder why they do that...it's good nonetheless. I have gotten the cheeseburger and the club burger (I wouldn't recommend that one).  We have tried both the regular and smash fries, I prefer the regular fries because the smash fries are a little too oily for my preference. The best part of the meal is the Hagan Daaz milkshake!!!!! I love Hagan Daaz ice cream and having it in milkshake form is heaven. Can't go wrong with any of the flavors.  I'd come here solely for the milkshakes.", "author": "Kristina N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "The Order:\nSpicy Veggie Black Bean Burger\nSmash Fries\nSoft Drink\n\nThe Total:\n$11.17 Didn't see any option to Tip\n\nThe Food:\nI was expecting to be served up a Boca Black Bean Patty like most restaurants which try to include a Vegetarian option, but this one appeared to be made in house. It was a bit dry and unflavorful, would have preferred a Boca in this case. The teaspoon of guacamole did nothing to satisfy my insatiable appetite for all things guac.\n\nSmash Fries tasted great, though were on the greasy side.\n\nService:\nIncredibly Fast and Incredibly Friendly\n\nWould I go back;\nThe only option for this Pescatarian failed to meet expectations, I make a meaner Black Bean burger at home. May visit if i'm in the area to try out the shakes.", "author": "Derek I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "PB& J shake, sweet potato fries & classic smash!", "author": "Lacey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-24", "description": "The Spicy Baja burger was great!  Regular size with extra jalapenos was just perfect amount of hot, juicy beef, great bun.  The employees are super friendly and made sure I enjoyed my meal.  They also keep the place spotless, cleaning tables and chairs immediately.", "author": "Shawn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "The Bad:\nSome people only eat burgers medium or rare, so just know that at SmashBurger they ONLY cook them well done. \n\nSome people want table service and for the same price as Mcdonalds...this is not a place for table service. \n\nIf you order as I did without reading the menu, you may get a burger without garnish, now I'm sure that is somewhere on the menu, but when a person walks in for the first time and there is no wait and tell them it's your first time, that should be explained. That's because the menu behind the counter is for 2020 vision and not everyone has 2020 or wears glasses or contacts. But from reading another review I see it was mentioned that there are laminated menus just left of the door when you walk in, but who looks there? As you walk in you're looking at the counter and that's where you would go.\n\nThe large burger kind of hangs over the small bun (not a bad for me cuz I don't need a lot of bread).   \n\nSo that is the bad as I see it all wrapped up.\n\n\nThe Good:\nThe burgers ARE juicy, just not medium or rare. They will make the burger to your specifications, but only well done. \n\nThe burger that I had came with truffles, mushrooms and swiss and was highly seasoned which I like (that may be a bad to some people who hate salt). There is a choice of regular or large size, I had the large. \n\nThe SmashFries are seasoned in Rosemary and dipped in an oil, which I forgot which oil, but they are delicious. (If you don't like oil, then you should know not to get these).\n\nThe Excellent:\nThe service was better than I have experienced in most restaurants at any price. The staff was nice and seemed very friendly. I was asked 3 times how everything was and did I need anything else which may have been a little overkill, but understandable for a new place. I'm sure this will not be the case after the top staff completes the training of the locals and move on. By that I means that there probably won't be an over abundance of staff around, if they are going to make a profit.\n\nOverall:\nIf you're looking for the \"dream burger joint\" this ain't it. But it beats Mickey DD's, BK and Jack in the Crack anyday.  It's clean, friendly and tasty.", "author": "Jim L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-30", "description": "The food is good. Tip: Be Very specific about what you want on your burger. If you don't tell them you want lettuce then they won't put it. The service is horrendous. Food sits ready for a while or in my case until you ask for it.", "author": "Khara T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-27", "description": "This place is pretty good! I ordered their Classic Grilled Chicken Burger (with fried egg, of course) and regular fries - both were really good! You can also order online, which was really convenient. I'll definitely make this one of my regular spots for lunch!", "author": "Freckles H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "Pretty good burger, but the buns are a little too mushy for me, the fries are just ok, and the place has had glacial service the few times we've been there.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "I had the chicken and avocado burger and it was really good. Fries are a bit too skinny though, imho.", "author": "Kira G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Burgers don't get any better than this! Juicy and full of flavor.  Yes, they are pricey, but you just can't beat the taste.", "author": "Alyson F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-19", "description": "YUMMY!!!! Tried the bay and truffle chicken burger and OMG the truffle burger is BOMB.COM!! I drool thinking about it.", "author": "Fiona T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "A really good burger. Of course lots of crust, but also seasoned well and that egg bun was fluffy welcoming. I love how you can get a beer as well. Kinda cutty location but worth a visit or three!", "author": "Anthony R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "I had Bacon/Chz Big Smash $7, Fries $2 and 22oz drink $2. Burger looked juicy from the outside, a little dry in the middle. Maybe they smashed it a little too much? The cheese made it taste kind of gooey good and bad, depending if you like it. Fries had a very slight hint of rosemary, hot and fresh but average. Overall not that impressed for $12 out the door.", "author": "Doggy W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-10", "description": "Got take-out this past Sunday. Classic burger and sweet potato fries were so good! The burger was a little heavy on the onion but I just took it out. Will be coming back.", "author": "Graciela C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Wanted to see what all the hype was about this place........wow this place really lived up to all the hype... Ordered the truffle burger.... One of the best burgers that I've had came out hot and tasted really fresh... Ordered the haystack onions a little on the greasy side still very good. The staff here were awesome and very attentive.. What a find will be back really soon", "author": "George E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "Tried Smash again, during their lunch rush.  Again, a solid, tasty burger.  Still only 3 stars as the shake maker wore gloves inconsistently.  Additionally, my partner and I ordered the same burger, the BBQ, Bacon and Chedder Stackhouse.  Inconsistent quality.  His burger had a mound of stackhouse onions, while mine looked as if they'd given me his leftovers.", "author": "Dwayne R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-08", "description": "Pretty good, burger was a little greasy, dudes that work there are attentive and try hard to turn over orders fast, probably will come back we'll see.", "author": "Trevor M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-23", "description": "They were good when they opened up - up the first few months, then the quality went downhill thereafter.  Even the salads, had too many dried leaves, not fresh at all and I know I won't serve that to any guests I have, let alone ask them to pay pricey for it?  Waste of $$$$.  No longer recommended.  BTW, why do they allow dogs inside where people eat?  that's unsanitary.  I asked the Mgr and he said, so long as the dog handler says its a guide dog, its ok.  But the stupid dog was a freaking chiwawa... for crying out loud.  These Mgr is so stupid, the dog outsmarted him obviously.  He can't see straight.  Fire him now.", "author": "Jaime L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "There are few burgers that actually impress me. My favorite gourmet burger is The Counter, seconded by Umami. My favorite fast food-ish burger was 5 guys seconded by in and out but I think this just became my new first. Fresh tasting like In n out but better fries and a bunch of toppings like 5 guys but not as greasy! Great work and the people were nice there!", "author": "Adrian A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-30", "description": "Great burger for the price, not at all greasy, and the best customer service. The staff were constantly waiting on us offering their services", "author": "Max Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Had SmashBurger for the first time and it was great!!! Had the Truffle Mayo, Swiss, Mushroom Chicken sandwich and now I'm addicted!!! Fries and veggies were really good as well...Bella and Danielle were very sweet and professional. I was surprised how clean the restaurant (even the restroom) was which is a HUGE plus in my book!!!! Overall an enjoyable experience and I will definitely go back!!!", "author": "Noree B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-15", "description": "Very clean establishment, friendly service, clean bathrooms. The Burger is the right size for my big appetite and the vanilla shake is made with real Haggen das ice cream. Plenty of parking, great location. . A++", "author": "Robert L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Had the Cobb salad. .. liked the fried egg on it. Didn't try the burgers but I will be back at some point I'm sure. Lots of parking here which is nice.", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-03", "description": "So I ordered for pick up at around 5:30 today. I picked up on time as instructed.  The place was nice and clean. The staff was great, but the food was just not good, the quality of the food is what I would expect at a baseball game. This review lies solely on the chef.", "author": "Captain Muffin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "These are the best burgers for the price ever. The service was good also, it didn't hurt that the girl at the register was really cute too. So, all in all SB you get the 5 star review! Good Work.", "author": "Richard C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "nice friendly spot... pleasantly surprised by the laid back atmosphere, fast service & excellent food.. I immediately liked the place when I walked in and the instructions were #1 grab a menu #2 control your excitement #3 place your order.. being a bit on the vegetarian side i had the Ranch Avocado Black Bean burger with Haystack Onions.. very yummy .. usually veggie burgers are tasteless & disgusting .. but this one had great flavor.. the multi grain bun was warm & toasted.. the toppings were fresh & the avocado slices made it perfect except for occasionally sliding out but the messier the better in my book... :P  & on a side note.. i usually try to eat half & take the other half home when eating out.. but for the first time in a long time i ate the whole thing.. the whole damned thing..  but i regret nothing:)", "author": "Patricia A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Putting this up for fellow Keto-ers.  In addition to several salad options, you can get yourself a very Keto-friendly bunless burger here with leaf lettuce suitable enough to pick the burger up so you don't have to knife & fork it.  You can add a fried egg, bacon, and guacamole or avocado slices (extra charge, but totally worth it).  Psyched to have another Keto option around town.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-15", "description": "More like 3.75 stars, but it's good considering it's a chain.\n\nPlus, their online ordering option makes it convenient for me to get lunch for other people in the office.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Came in with my sisters to just try the place and i must say its a pretty darn cool place . Nice enviornment and clean . The Staff was very friendly . Got our order as about 5 minutes after we sat down . The burgers we had , Beat Mcdonalds . The Price wasnt too bad either . Definitely will be returning !", "author": "Moanna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "I hate to say it but I like this place.  The first time I came here I had a chicken sandwich and it wasn't so great. I wasn't sure what the fuss was all about. The next time I followed up with a burger. Now I see why.   To me at this price level,  it's five guys and smash burger, the edge goes to smash burger. French fries are good although very thin.   The burger was excellent.    Only things missing were more bacon and lower prices.  This place wasn't too crowded.    Everything else was par for the course.", "author": "Bob R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "Really tasty burger.  for being a well done burger, it still is juicy. Fries are a little on the skinny side which is a bummer cause they are so yummy. They also have a \"secret menu\" which my boyfriend loves. Most of the employees are kind as can be with a few looking like they dont care.  I hope this place stays as nice as it currently is.", "author": "Bree C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-28", "description": "for a chain, this place isn't so bad. expect laminated menus and a single dollop of perfectly placed whipped cream sitting atop your milkshakes. the burgers are decent and the smash fries (rosemary and olive oil) are tasty. i wouldn't ever purposely make my way there but if you're hungry and are already in the super suburban shopping center then go ahead and stick with the suburban theme; eat at the chain. nobody will judge you.....i think...", "author": "Regina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-27", "description": "Had lunch there yesterday 9/26 great avocado chicken club.  Loved the atmosphere, servers great.  We had Bella help us she did great.  Thumbs up to cooks.  I work close and have now found the spot.  Recommended to co workers and they were there today.  Welcome to the neighborhood Smash Burger we needed you.  \nWill be back next week", "author": "Shelley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "This place is fast becoming my favorite lunch spot.  The staff are very courteous, friendly and well trained.  Everything is made to order and tastes, quality...definitely a cut above fast food.  It is hard to make an argument to not have lunch here when they ate close by to my office!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-14", "description": "Food is decent but not worth the expensive price. Service was shitty. Cashier looked like she got too lit before coming in and was now coming down and irritable. Service was probably the worst part actually. Won't be coming back.", "author": "Aidan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "My daughter , 4 y.o. granddaughter and I really enjoyed our lunch :-) we shared a classic Burger and garlic fries , I had the peanut butter and chocolate My daughter had the root beer float.... the staff are super friendly and so is the environment.... o yes and its also pocket friendly , lol...", "author": "Christine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Hip happening place for a Great Burger.  Mark the new GM is doing a great job!", "author": "Timothy E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "this is the nastiest damn burger i ever tasted.\nfries are nasty as hell any other fast food in and out who i dont care for burger king, etc beats them by far. didnt do my burger the way i asked. \nnow I know about fries because I love patatoes period .\nI know good french fries,, hash browns etc.\nSHITTY\nSHITTY SHITTY AT SMASH BURGERS.\n\nWHAT IS SUPPOSED TO BE SO SMASH ABOUT IT CAN U TELL ME PLEASEEEE! \nSOMEONE.\n\ndry as hell\ndont look anything like the pictures posted\neverything was just nasty. \nmy first time too.\nwowwwwwwww!\ni didnt think a burger could look and taste so bad, but they out did they self .\nnasty\nnasty\nnasty\nterrible!!!\nnot even 1 star if u ask me\nhonestly tasted like s h i t!!! \nclose this place please??\ndo me a favor \n\nilllllllllll!!!\n\nI told my girl if she ever mention the word smash burgers again, and waste my money  somebody gone get slaped for real.\nThats how nasty the shit is.", "author": "G W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-14", "description": "eww this place isn't too friendly...my fries are cold and the help has their food and drinks in view for me to watch their heavyset bodies eat...very unflattering and unsanitary plus the soda machine is down yet they are restocking the cups and lids...why no one is using them!!", "author": "T. L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-29", "description": "The burger was OK. I like that they use fresh ground beef. The fries were so-so. I might have enjoyed it all better if I didn't have such an awkward interaction with the general manager Tom. First of all, it's weird that they keep the men's room unlocked and the women's room locked. When I asked for the code he asked \"for the mens or womens?\" which I didn't mind because I am fully aware I look like a boy. I answered, \"either one works.\" He responded \"you can't go in the women's if you're a man\" pretty loudly. My first reaction was to laugh and brush it off my shoulder. But when I came back and he handed me my food there was no apology, nothin. I asked why just the womens room was locked, and he explained that he was trying to prevent harrassment of women. I told him I didn't care what he said but someone else probably would have, the way he put attention on me the way he did. Then he got awkward, started cleaning the tables next to me and mumbling to himself how he doesn't judge anybody, and that he was \"blessed\" to mind his business. Then for the rest of my meal he just kinda stood around looking at his cell phone. I feel kinda sorry for him. I mean, this is San Francisco. He really must not get out much.", "author": "AJ C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-10", "description": "First time here and wasn't the greatest experience... Not the friendliest people in there. Fries were old but they replaced them quickly. The burger was ok tho.", "author": "Angel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-15", "description": "I ordered pick up and had arrived a few minutes early. I opted for the mushroom truffle burger, I was really looking forward to a tasty burger but mine came out warm and it was literally smashed like some one sat on my burger, it was pretty pathetic. Sweet potato fries were warm too, would not come back again. Should have paid a few more dollars and stick to what was familiar.", "author": "vu p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "LOVE LOVE LOVE absolutely! My boyfriend and I always love to come here for their Juicy Burgers. I love their Vegetarian Spicy Jalapeño Black Bean Burger! IT is soo spicy with the sauces they combine inside! He always gets their original Smashburger We always get their Smashfries as well it so good with the garlic flavors!! Great for something fast but a little bit upsale from Fast Food, it is a great place to sit for lunch after working and the employees are very nice they ask if you want to refill drinks etc. VERY great place to Eat at!", "author": "Sophia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "After In and Out Burger, probably the best tasting fast food chain in the in San Francisco.  The quality of the staff can be a bit choppy, some are attentive others are lackadaisical.", "author": "Byron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "$8 for a small burger they call large,so price is a bit high,$2 for frys,and $2 for soda\nthe burger they call big was kind of small,\nthe outside of burger was a bit burnt ,and they flatten it out to look wider,you could hardly see the meat it was so thin,the bun and sauce were nice,ordering was fast\nbut servers had trouble finding your number they give you as its hard to read\nthey should make them white,it looks like a small place from the outside door but its big inside,20 minute wait for burger so slow service, meat was burnt on outside\nfriendly enough staff", "author": "cc c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "Great burgers and grilled chicken; fries are out of this world. Staff is friendly. Had the spicy Baja jalapeño grilled chicken. Marinated chicken breast would have been good just by itself but was absolutely delicious with the addition of jalapenos Wauka Moley and a chipotle sauce. My wife had the kids menu burger which was juicy and delicious and came with the best fries I have had since king diner closed several years ago! The next time we went Michelle had the deep-fried breaded chicken breast which was good but not as good as the marinated grilled chicken breast. I had the blue cheese burger which also comes with Frank's red hot sauce on it. Again the burger was juicy and delicious and the toppings really added to the enjoyment. If you can go during their off hours later in the evening for a absolutely fantastic dining experience!  Service was also very quick.", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-05", "description": "I was pleasantly surprised how much I liked this \"chain\" burger place. The bay burger, I guess it's a CA specialty was pretty good. Also the veggie burger patty was quite amazing. Spicy and bean-y. And I didn't fall into a food coma after eating there, which is a good indication. I would be back again.", "author": "CatsPjs Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "this is another dangerous spot after super duper , in n out , its tops cafe , five guys etc ... this one is up there too, the egg bun is ridiculous , meat is juicy  everthing is fresh about the burger, the service and the way the crew was running things is something to look up for, amazingly smooth and quiet service , they sure know what they were doing , the place is so clean and welcoming, we also tried the baja chicken so you can go a little healthier if you want .", "author": "NAEL K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "The spicy jalapeno Baja burger with chipotle sauce was totally hot and awesome! Plus Cholula hot sauce on request. The smash Fries with Rosemary and garlic were excellent. But the haystack onions were hella greasy. We needed several napkins to soak up the excess oil. Good flavor but very oily yet super crispy.", "author": "sky s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "Friendly staff, excellent burgers. Similar to 5  guys, but with many more options. Nice to have this option in the city. Tons of parking.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "Smash was great, I ordered a classic smash with sweet potato fries, and an Oreo shake.  They were all very good, the place was very clean which is very important for me. Service was great and friendly. I don't have anything bad to say about this place besides maybe the parking situation which at times might me chaotic.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "the black bean burger was amazing & the rosemary fries are to die for", "author": "Tiffany T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "Sure, it's certainly not a 5 star restaurant, however, we (my family and I) were pleasantly surprised.  Granted, the place is new, but it's super clean, the staff was very attentive, and the food was surprisingly good (and inexpensive).", "author": "Jeff C."}
