{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Cookie Dough with Pretzels and Chocolate Chips are yum\n\n***New item.. for matcha lovers!!\nMatcha Verbena with Stonemill Matcha\n\n\nboth items in a small came out to $11\n\nWorth a stop if you're in the area and I would say a small could be shared amongst friends who do not have a huge sweet tooth!", "author": "Yeanne L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "Ordered a vegan fudge pop literally 2 minutes ago and it was served to me in a bowl.\n\nDidn't think anything of it until I picked it up by the stick and realized it was all the way melted.\n\nAte what I could salvage without wasting too much before throwing it into the compost.\n\nAsked the person behind the counter if they typically serve it completely melted. He acted surprised and said, \"Oh, it was melted?\"\n\nGot my purchase refunded to me.\n\nThis location is a joke. Go to the Hayes Valley location.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-07", "description": "I generally appreciate small selections as they help speed along my decision-making but the options here were almost too limited especially given that three out of the six flavors had a $1 surcharge. Unlike other ice cream shops, this one is not good for sampling. Some flavors that I wanted to try like watermelon cream were not available because no one ordered them so they were melted. That doesn't sound good. It makes me wonder if they reuse the melted stuff. \n\nI enjoyed the exceptionally smooth texture minus a tiny ice chip of the small Matcha Verbena I had but the flavor was mediocre. I would've liked a stronger matcha flavor. I could taste the verbena only slightly. And the ice cream left an odd sickly sweet aftertaste when finished. The only redeeming feature about this place is the bathroom. If you're in the mood for ice cream and don't need to use the toilet, you can skip this stop and get bigger portions at Salt & Straw up the street.", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "Am I smitten over Smitten Ice Cream?\n\nAll I'm gonna say is it's one of the better use of liquid nitrogen ice cream out there, BUT.....I still prefer Mitchell's, which is the king of ice cream in San Franciso, IMHO. \n\nI'm not hatin' about this place, it's actually a place I've frequented when we are in the area, and it's a good way to satisfy your sweet tooth on a hot day or a typical cold, foggy day in the city. Sure, the process of making their ice cream flash frozen in liquid nitrogen is pretty cool to watch and experience. It's similar to a magician using a puff of smoke to create an illusion.  \n\nHowever, the flavors in their ice cream is lacking compared to what I'm used to. We recently came here during National Ice Cream Day, which was last month on July 15th. We decided to get the coffee flavor with toasted almonds. Even though the sauce was free that day, we opted not to get it since I wanted to taste the flavor. I got the Mountanos Family Organic Coffee flavor and I couldn't get much coffee taste. Actually, the flavor was pretty mild and not too sweet, which I liked, but there was only a hint of coffee flavor. When you advertise coffee, you better deliver. \n\nAgain, we've had other flavors before and they were fine, but my taste buds hasn't developed quite the affinity for it. I also give props to Ruben Sue Fisher for starting her ice cream empire, which has now 4 locations in the city. She literally built this from the ground up. \n\nI'm not quite smitten over Smitten yet, but if I'm in the area and want an ice cream, I'd probably stop by and try their flavor of the day. \n\nI'd rate it a decent 3 1/2 stars.", "author": "John G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "So the menu is very limited which makes choosing a little easier for those of us that are indecisive. But why is there a surcharge for the 3 flavors that rotate? I found that very odd. I've never been to an ice cream shop where some flavors cost more. Having said that I appreciate the matcha Verbana flavor... Though it didn't taste like matcha, but the verbana was something I had never tried in an ice cream and I liked it. They only have small (2 scoops) , regular (3 scoops} and large (??? scoops) listed. But apparently you can order a kid sized one that only has one scoop.. this isn't listed on their menu. My friend didn't know that and let's just say her kids were a bit hyper after the ice cream shop trip. There is one little bench outside if you need to stay out (kid and/or dog).", "author": "Rou M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "Two years ago it felt like everyone and their mother opened up a liquid nitrogen ice cream place but I saw a really nice photo of Smitten's ice cream taken by a friend and I thought alright I gotta do it for the 'Gram too. \n\nI got there at 9 pm and there were still a decent amount of people waiting to order/waiting for their ice cream. I also liked that they seemed to have a rotation of 8 flavours because I get overwhelmed when provided with lots of choices... hence my phobia of menus at Chinese restaurants. \n\nI picked the Mountanos Family Organic Coffee ice cream because I like pretending to be a coffee snob and I was really surprised to hear my name being called literally 30 seconds after I paid (although that sorta makes sense because they probably just had to scoop it into a cup for me...)\n\nI spent a good minute taking the perfect picture and when I finally took my first bite... w o w what a difference from all the other ice cream I've eaten. Not too sweet, super super creamy, but not too heavy. The ice cream was miles above all the other liquid nitrogen places I've tried before (and I tried a lot because my ex insisted on trying all of them). This is the first time I felt ok with spending $5 on a scoop of ice cream. The difference was like driving a 1999 Honda Civic for years before finally upgrading to a Mercedes.\n\nI'll definitely be back again. If perfection had a mouthfeel it would be Smitten's ice cream.", "author": "Calvin Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-01", "description": "I've always been a liquid nitrogen ice cream fan and this is the best I've had in the Bay Area. Creamy and fun flavors. 3ish flavors rotate daily so don't get too attached to a flavor as it may not be back next time! It is fairly expensive if you get a cone and toppings... but I'd say it's worth it.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-26", "description": "This place had an interesting experience but the ice cream itself was underwhelming. This may have been because it was hyped up. I went on a Friday night at 9pm and there was a small line. I ordered the Cookie Dough (pretzel and chocolate chip in it) in a waffle bowl.\n\nThey started spinning the ice cream and making it to order which was cool. The ice cream was overly sweet for me but I also don't have a huge sweet tooth. The sweet and salty seemed too much with the ice cream, cookie dough, pretzel, and chocolate chips. The waffle bowl also seemed like it was sitting around for awhile as it seemed stale. That or it was too thick and didn't have the proper crisp of a waffle cone/bowl.", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-12", "description": "So we knew we wanted ice cream, but this place takes it to another level. They only have a few flavor options, then you can add toppings for extra charge. We decided it would be better to try the sundae and then add the strawberry sauce. We ordered it with chocolate ice cream, even though I prefer vanilla. But when I asked if we could do one of each, I was told they don't do that there, because they make individual batches as they are ordered. OK, that sounds good. So we watched as they mixed and froze and mixed our ice cream. There is a glass window, so we could see the entire process and it was pretty interesting. The ice cream was creamy and delicious. It was not hard serve or anything, so it kind of oozed as it melted, but we enjoyed every bite, and the fresh waffle cone. I would recommend sharing the sundae or cup of ice cream, so you can enjoy the ice cream and not be worried about the price ($12) for a sundae.", "author": "Sandra V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-12", "description": "Pretty good. I snagged the cookies dough and the earl grey. Of the two I liked the cookie dough much much more. Friendly service and the ice cream was made quickly.\n\nThe cookie dough is absolutely amazing. \n\nWho doesn't love Chocolate and Ice Cream? (If you're raising your hand you can stop here ) \nI like making lists what can I say. I have lists for Ramen, Steakhouse/Brazilian , Milk Tea, Egg Tarts, Chicken & Waffles (super random list right). Give my profile a follow if you like them. \n\nRanking explained:  #1 (listed at the top)  is my favorite/ #?  (listed at the bottom) is my least favorite. Check out my latest reviews for my latest up to date Rankings. \n\nRod's San Francisco Chocolate and Ice Cream shop Rankings: \n1 Mr. and Mrs. Miscellaneous\n2 Marco Polo Gelato\n3 Dandelion Chocolate\n4 Chocolate Covered\n5 Smitten Ice Cream\n6 Teuscher Chocolate \n7 The Ice Cream Bar\n8 Coletta Gelato\n9 Cako Creamery\n10 Humphry Slocombe Ice Cream\n11 Bi-Rite Creamery\n12 Miyako Old Fashioned Ice Cream\n13 Mitchells Ice cream\n14 St. Francis Fountain\n15 Christopher Elbow Artisanal Chocolate\n16 The Baked Bear- Custom Ice Cream Sandwiches\n17 Recchiuti Confections \n18 Poco Dolce Chocolates", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Hands down some of the best ice cream I've had in SF. Your order is churned-to-order with their liquid nitrogen machines, which makes for a super creamy cup or cone of ice cream. They usually switch out their flavors (always really original, i.e. cookies & cream with pretzel bites, earl grey tea, etc.) and allow for toppings. It's definitely expensive, but worth it if you're looking for a good atmosphere. Would recommend it as a post-date spot and/or to bring visitors, as it's pretty cool to watch them make the ice cream. Expect the place to be packed, but can guarantee you'll enjoy.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-14", "description": "So liquid nitrogen freezed ice cream is a gimmick, right? I don't think it tastes any different than regular ice cream. But my bf seems to like it a lot. We got vanilla ice cream with strawberry sauce and whipped cream. It was good - the sauce tastes a little artificial to me but the ice cream is good. But $5 for a small scoop. Eek, it's definitely a treat for special occasions.", "author": "Alison W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-21", "description": "A premium ice-cream joint that makes it on the spot.  The ice cream is made via liquid nitrogen right when you order it. As such, they don't offer samples for you (Boo).  There are only a few flavors available (about 6-8).\n\nI got the cookie dough ice-cream ($5 for a single scoop).  It was pretty good; it's got lots of nuts and cookie bits in it.  $5 for a regular scoop and $7 for a double scoop.\n\nTIPS\n-No free samples\n-Only a few flavors available", "author": "Mike T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "The ice cream here has really great consistency and flavor. The best part? You get to watch your ice cream being made in front of your eyes with liquid nitrogen. The bad part? You're unable to sample any of the flavors since they're made to order. I went with the regular cookie dough, which came with 3 lovely large scoops, which was easily shared between 3 people. \n\nFlavors change periodically, so if I lived in SF, I'd definitely be a regular.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "Tried the earl grey ice cream in a cone bowl. Creamy and delicious ice cream! I loved the bergamot flavor. \n\nGreat ice cream means long lines, so expect to wait.\n\nAbsolutely recommend.", "author": "Raisa G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-08", "description": "My wife got a vanilla ice cream in a cone on this rainy day. She thought it was too sweet and the cone wasn't crisp and it was a rather steep $5.25. The poor cashier was totally stumped when she paid with a $20 bill and a quarter and tried to give her $14 in change. When my wife corrected her she had to get out her phone calculator to be sure.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "With so many homemade ice cream shops in SF it was hard to choose. But I am so glad we ended up here! You can't sample the ice cream because it's made to order, which is great but also scary because you don't know if you'll like what you get. I'm usually the person that has to try all the flavors before deciding so I was pretty worried. Thank god my choice did not disappoint!\n\nICE CREAM\nBrown sugar with cinnamon shortbread paired with brown sugar caramel and tcho crispies on top (5 stars): OH HELLO! And where have you been all my life. After the first bite I knew I made the right choice of getting a regular and not a small. If you have a sweet tooth you will love this combo. I would recommend leaving out the tcho crispies though. The rice crispies just didn't taste that fresh. \n\nOh, and get it in their handmade waffle bowl. The flavor on that was amazing too. \n\nDough My Goodness Sundae (4 stars): Sadly this was not as good as my brown sugar heavenly concoction. I just couldn't get much of the cookie dough flavor in the ice cream. Still good, but I'd recommend the choice above! \n\nATMOSPHERE\nFew tables outside that are covered and some inside as well. Big enough where you don't feel cramped inside. \n\nSERVICE\nEveryone was really nice. \n\nFor now I'll just have to dream about you Smitten Ice Cream, until next time!", "author": "Latisha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "The ice cream was alright but I am completely and utterly pissed I wasted 20 damn dollars on two small fuckin small ass ice cream that they failed to tell me was only two. In the mean time while I was ordering I know the lady clearly heard me & she repeated the order back to me. The fact they didn't give me what I ordered and failed to tell me what I was spending my money on. I will not be supporting this company thats how freakin pissed I am. If I could have returned the ice cream I would have. \nSincerely pissed off ex customer", "author": "Theresa H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "Really good ice cream. Smooth texture and wonderful flavors. Both the cookie dough and Chocolate flavors were excellent. The mix-ins on the cookie dough (pretzel pieces and chocolate chips) were also fresh and tasty. \n\nService was pretty quick and price was not too outrageous $5 for an okay serving.\n\nGreat newer location", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "The only reason to check out this place was because of my curiosity to look at the way their ice creams were made but the taste! nahhhh! not that great. The ice-cream is made of organic milk and other fresh ingredients so it is on the healthier side but I have eaten and experienced better ice creams. The price is nominal though. I tried Mint flavored ice-cream, special of the day, but the mint taste was so strong that I could not eat it. When I told about it to the cashier, she agreed to give me a new ice cream at free of cost. I then got their chocolate and vanilla mix which tasted okay. Overall a good place to visit once and experience the cool way they make their ice creams.", "author": "Devan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "I can't give smitten's less then 5 stars the ice cream is smooth and creamy, and the pairing they have are good definitely complaints the ice cream and turns your reg scoop of ice cream into something different yet yummy...Also check out there sundaes as well,you can go wrong with anything you", "author": "jonathan h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Absolutely delicious! One if the best waffle cones I'd ever had- the lemony citrus accent brought out the flavor of the waffle cone. I think the next time, i'll just order the waffle by itself; yes, it was that good!", "author": "Anna D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "We are smitten by their ice cream. Every cup individually made while you wait with the freshest ingredients such as organic milk and cream (delivered from local farms), sugar, 60.5% TCHO chocolate, and locally grown fresh fruits and vegetables. \n\nThe first time I tried it at this location, a beautiful setting with the simple and memorable Smitten Alley next to it. The ice cream was as fresh and delicious as ever, not overloaded with sugar and just has that wholesome flavor. \n\nI had the vanilla with their recommendation of strawberry sauce and the TCHO chips. It was a great combo. Just have to pace myself eating their ice cream. \n\nThe best in the Bay.", "author": "Mehrnaz H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "Nitrogen ice cream is one of the hottest trends in the ice cream market right now. You'd wonder if there's a difference between freshly churned ice cream and ice cream made over night. The texture and quality really does show. One of the differences I noticed was smoother and softer ice cream. Smitten makes 6 flavors a day but they rotate every now and then. You can't mix flavors or have more than one in each order whether it's a small medium or large. That's one downside of nitrogen ice cream. Courtesy of the thanx app I got an offer for a free small. I went with bee sting which really should be called bee kick! The little peppers smack you in the mouth after each bite. The earl grey could be stronger, the flavor was actually subtle for me. It tasted more like vanilla.\n\nSo am I smitten with Smitten? I guess if they get their flavors right.", "author": "Virginia Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "I got the mint chip ice cream with TCHO chocolate sauce and TCHO crispies and I do not regret choosing this order not one bit! The ice cream was nice and creamy and a perfect combination with the chocolate drizzle and toppings. I'm not a fan of super sweet stuff so this flavor was just right for me. I also think it's really cool watching them make the ice cream with the machines. It's a good distraction watching the machine get smokey while waiting for your order. I can see why this place is really popular and I'll definitely be going back in the near future.", "author": "Joanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Smitten used to be my all time favorite place to get ice cream until I became vegan. Their flavors are super fresh, and they make them right there with these super cool machines. Their ice creams are super seasonal and organic. Their ice cream tastes rich, creamy and mouthwatering. The vegan options are currently these ice cream bars called \"vegan bars\" and the two flavors for those are salted caramel and fudge. They're made with coconut milk, but for me, it's not worth paying 4 dollars for a small ice cream bar when I could go to a different place that has better options for me!! Still waiting for them to make vegan ice cream flavors. If you're not vegan or dairy free, I definitely recommend paying the extra money for it!! Good luck", "author": "Arja K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "When science meets sugar and cream.... you get the coolest, smoothest ice cream ever.\n\nAt Smitten, every single scoop is made fresh for your enjoyment. You'll get to experience delicious ice cream AND a cool show, every time. \n\nAvailable in 3-4 unique flavors per day using local, seasonal ingredients.\n\nSignature flavors:\n\nSalted Caramel\nTcho Chocolate\nMint Chip\nCookie Dough\n\nOnly one ice cream flavor available at a time.\nLook for fun toppings and sauces. \nVegan pops available.\nTo go pints and delivery available.", "author": "Mitzi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "OMG is all I can say about their Vietnamese Coffee ice cream with TCHO Chocolate Sauce... Literally tastes like a fresh cup of coffee freshly brewed. And the chocolate sauce is to die for. Together it is simply heaven!!!  Service was good, staff friendly. Not a big place at all with just a few benches to sit on, but oh so worth it.", "author": "Shannon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "I LOVE Smitten ice cream! There is the fun novelty of watching the ice cream getting made right in front of you, and the flavors are unique and delicious. I don't know how frequently they rotate, but if the brown sugar / ginger crumble is available when you visit I would highly recommend it! Waffle cone is always a good addition :)\n\nFriendly staff, clean interior (not much seating inside), and plenty of outside seating to enjoy your cone on a warm sunny day.\n\nI'll be back!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Fresh ingredients and made with liquid nitrogen right in front of you! Unique artisan flavors that change as the season changes, so you'll always be able to try something new! That's what really brings me back, I always like to see what new creations they've got!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Creamy indeed and the ingredients taste high quality. Definitely worth your money and I'll definitely be coming back\n\nTried the cookie dough w chocolate chips and pretzels! It was the perfect balance of sweet and salty!", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "How am I going to do my sugar detox if this is on postmates HOW!?! Devoured this entire bowl moments after we got it. So this is what freshly churned ice cream is all about. My guy is the I don't give so much emotions on things kinda guy and he went sorta nuts for this like \"g-- damn it\" and looked so angry eating it. Thanks smitten :/ \n\nMascarpone & Strawberry + Brown Sugar with Cinnamon Shortbread = H E A V E N", "author": "Erica R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "The cookie dough ice cream was delicious and everything you could ever wish for! Alicia was amazing and very helpful. Made my experience at Smitten very enjoyable! Makes me want to come back again very soon!", "author": "Natalia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Yummy! Came here on my visit to SF as I heard great things about the ice cream and it was definitely worth the stop! They are consistently making the ice cream, so it is as fresh as can be! The ice cream isn't anything crazy or extravagant, but just good flavors that change depending on the days and season!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Love the ice cream here. And since Salt and Straw popped up just a block away, the lines aren't long at all. I highly recommend the cookie dough with pretzels and chocolate chips, although the real star is the waffle cone. It's so perfectly buttery sweet and practically melts in your mouth. It is definitely overpriced - I wish they had a cone option that wasn't a waffle cone (which is $1.50 extra). But if you can get past that, it's worth it for a treat!", "author": "Megan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "I'm not hating on Smitten - as I know they have good reviews, but I felt there was poor service and delivery. I'm usually understanding of businesses that are busy but I really didn't understand why my order was lost. \n\nI ordered a small pecan pie ice cream and my order was taken by one employee and another was making the ice cream. I was prepared to wait since I read that nitrogen based ice cream is made by order, but after seeing orders after mine get served -- I  checked back in with my order, and I was told I didn't pay/wasn't on the \"list\".\n\nI remember tipping and swiping my card and even checked my credit card app that indicated I paid. I was then told by one employee they would get my ice cream right out, so I waited. \n\nThe ice cream orders for people after me continued as I sat waiting for an ice cream order that they had forgotten about. I ended up leaving without ice cream and after checking in one more time, they noted \"Oh I forgot\", by then I was no longer in the mood for my ice cream.. now I'm left with disputing a charge on my credit card. \n\nI get that places that are popular can get busy, I understand miscommunications can happen but having to wait and check with an order multiple times is tiring for a customer- when it really should be a simple/enjoyable experience. \n\nI'm sure the ice cream is great but I didn't feel like my order mattered in the grand scheme of things.", "author": "Joanne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "This is my first time at this location. They got a pretty efficient system going on now. Each nitrogen mixer is flavor specific, and they make a giant batch every so often so you will get your order faster.\n\nThe con about this place is that the ice cream is a tad pricey, however there is a loop hole. Get a pint and its cheaper, share it with a friend!\n\nQuality of ice cream is top notch, very creamy and flavorful.", "author": "Elijah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Really great ice cream! They use a liquid nitrogen technology to mix it up and it tastes superb!", "author": "Chris P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-22", "description": "Though they have somewhat limited flavor options, the ice cream is so good! All the flavors are super smooth and creamy - great on a hot day! The toppings are definitely worth the extra $!", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "If you haven't been to Smitten's, you are definitely missing out on a unique ice cream experience. They make every cup of ice cream fresh for each individual person that orders. I've had the chocolate, salted caramel, and the cookie dough with pretzels and chocolate chips. All three have been great, but I'd say my favorite has been the cookie dough. The sweet and salty flavors mend really well in the ice cream. It's definitely worth trying!", "author": "Radhika G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "I wanted ice cream, mind you on a cold winter day.  That's the best part.  There is about 6 flavors to choose from.  On the day we went, brown sugar ice cream was what I went with.  A single, which is $5, is 2 scoops!  I liked the ice cream but can't say much about the super sweet waffle cone....", "author": "Jannie Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "Smitten is my favorite specialty ice cream in the Bay Area. Both times I've been (once to this location and once at Santana Row), I've gotten the specialty flavor. I've tried the normal flavors from my friends' cups but I think the extra $1 is worth with. When I came to this location, the flavor was Sweet Corn with Berries. It sounds so weird, I know, but it was delicious and seasonal. The wait can be a bit long since it's freshly churned but it's worth it. The ice cream doesn't have as much ice and over-freezing on it as regular ice cream, it isn't as overly cold (but it's still cold, don't worry!), and it's so creamy! Love it.", "author": "Ninette C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "I always forget that Smitten has a location out on California.  I normally trek over to the Hayes Valley location but remembered that this one was here.  \n\nIf you aren't familiar with Smitten, it is such an amazing story.  You've got the owner who is an engineer that decided to use a prototype machine utilizing nitro...on a radio flyer wagon to make ice cream in the Mission.  I mean seriously?  This is what SF is all about.  \n\nThey have unique ice cream flavors with a choice of toppings.  My favorite flavor?  Their cookie dough with pretzels.  Top it with some brown sugar caramel and crispies and you've got yourself an awesome dessert.  Each cup is made individually.  Considering this, they are pretty fast.  \n\nDefinitely one of my favorite spots in SF.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "Heat stroke of luck. \n\n...guided by some unseen automaton on an uncommonly warm Labor Day, I make my way to Smitten;\n\n1. Wait Line - good ice cream places have lines, but its Smitten's clean architectural lines that draw you in...and barely in view, way back, industrial looking stainless steel canisters build intrigue....(see pictures)\n\n2. Quality and friendly service at the counter. - a young, engaging counter person genuinely wants my first time to mean something, and despite my visible anxiety over size options, and the foreign flavors, (bowl or waffle cone, kid, s-m-l, 4 flavors at a given time, pairing sauces); she's kind and helpful, we make a good team.\n\n3. Meaningful Journey - Most ice cream places wear it on their sleeve - \"Hey, I'm a 50's Diner\", or, \"31 Flavors! (minus 29 you would never order)\", or \"Good, but nothing you haven't seen before (Looking at you, B&J - did you die?)\"; but let's face it, on a warm summer day these are all you need....or are they....\n\n4. Enter Stage Right - Smitten Baristas scoop balls of milky goodness  the size of baby peaches from spinning tongs ensconced in a flowing ice fog (stay with me, this isn't imbued hyperbole)... then carefully, as if cradling baby chicks, they move the nitrogen cooled ice cream nuggets  into your bowl or waffle cone; sauces are then squeezed over the top according to order... and from that moment you are \"Smitten\": or \"Smittened\"; or is it Smittereened?\"\n\n4. Taste - my taste buds said this abt Tcho 60.5% Chocolate - .\"OMG!\", \"That's amazing!\", \"Fo Shizzle my Nizzle!\" - in other words it's crazy good; the Cookie Dough with Pretzel and Chocolate Chips and the Classic Vanilla? Ditto C.G.  I took a pint of the Chocolate home (if I had an ice chest in my wine cellar I'd keep it there, if I had a wine cellar.)\n\nYour turn to enjoy the theatrical and patented nitrogen cooled development process and then be amazed at the organic goodness of Smitten's product  - a contrast as dramatic as \"Techies in the Tenderloin\"", "author": "Jason J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "July 9, 2016 Saturday - 8:30 PM time for a treat\n2 Adults and kid\n \nAtmosphere - 5 stars\nFood - 5 stars\nService - 5 stars \n\nBackground - My wife found this place on Yelp to treat my daughter after a long day of playing tourist.\n\nAtmosphere - Very modern retro look.  The machines in the shop have an old vibe to them.  A little cramp as there is not much space to sit and chill with your fresh creation. \n\nFood\n  Treat - I went with a small and it just the right amount of a treat.  The price point is little on the high side.  The reason is that they make it right now.  Batches are going using frozen nitrogen to create the ice cream.  Gotta love science, it is like a science lab going on with all the nitrogen fog going on.  Yeah I am a nerd.  I think I enjoyed watching the process more than the ice cream.  The ice cream was great but nerd in me wanted to watch more and more.  A part time job perhaps, dang it, I live to far away. \n\nService - Great.  They get your name when you pay for your treats with a credit card.  They need to call your name with a last initial.  Yeah I have a very common name, which I know.  But there were two other Paul's in the short line wait for their treats as well.\n\nFuture - Yes and perhaps one of their another location to see if they have more space.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Another fantastic Smitten outpost!  We were near The Fillmore for a concert and with some time to kill after dinner but before the concert, we trekked over to Smitten.\n\nNice clean bright shop (same as the others I've been to).  There was quite a crowd despite the chilly night although I guess most nights are chilly in SF.\n\nSame great ice cream.  We got a passionfruit and lychee ice cream with chocolate covered plantains which was new to us.  Super delicious like most other flavors I've had here.\n\nSmitten's the best!", "author": "Brent T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "I've been wanting to come here for a long time now and I finally have!! The ice cream here definitely lives up to the hype. \n\nMy boyfriend and I had the honey thyme and blueberry lavender, each regular sized order came with 3 handsome scoops, and we finished every bit of it~ We enjoyed honey thyme slightly more as we loved the sweet flavor mixed with hint of thyme. \n\nAgain, honey thyme - Highly recommended!\n\nWill definitely visit again if we come across a Smitten.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "The ice cream is made fresh here, while you wait. It's so delicious & the recommendations for add-ons makes the ice-cream extra yummy!! The price Of course is higher than your typical ice cream shop but it's well worth it!", "author": "Michelle D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-30", "description": "If you can help it, don't get your Smitten cure from the one on California Street. I went there last week, no one acknowledged my presence and there were 3 people behind the counter chattering and chattering and not once did they look at the 3 people waiting to be served. I was there at least 5 minutes just to see if they would ever look over at us and they never did. To add insult to injury and I am paraphrasing since I did not take a photo, there was a jar on the counter with a sign it said something like we served you now tip us. Oh brother!!!", "author": "Clare H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "I feel like everyone has already told you how great this place is, so I'm just gonna recommend some flavors that I love! Oh and also be advised that the entrance is a little cramped but there's plenty of room inside so don't get disheartened when there's a line out the door, it moves quickly and efficiently!\n\n\n** FAVORITES **\nEarl Gray with Caramel and Slivered Almonds - GET IT. So GOOD. There's little hints of I think lavender or something when you bite into it and the tea flavor is very rich! Everything here is pretty rich tbh. \n\nSalted Caramel - My personal favorite, you can really taste that nice hint of salt!\n\nBlood Orange with Pistachio Cookies - You won't be able to taste the pistachio flavor too much, but the cookies add a nice touch to the blood orange somehow? They're blended in and it tastes AMAZING. (side note - I'm totally allergic to pistachio and I still took three bites of my friend's order - it was worth)\n\n\nAnyway you can't really go wrong here, I took off one star because the service here is a little bit more disorganized and unattentive than the other locations some days. They're still fast, just kinda meh customer service.\n\nThe last time I went there was a line out the door and the cashier was casually checking her phone while taking orders - no bueno... but worth for that delicious ice cream~", "author": "Janice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-03", "description": "I have so many ice cream places bookmarked. Unfortunately, I don't get to check them off the list that often because I usually find myself always going back to a certain place.. in the Mission.. next to Dolores.. you know..\n\nbut not today!\n\nThe ice cream itself was good, very creamy. I enjoyed cookie dough a lot better than mint chip, which tastes straight up like mint leaves. Interesting at first but you kinda get used to it..\n\nThey ran out of waffle everything when we went. I wish they told us how long it'll take for it to be ready. We literally saw an employee walk out with a stack of waffle bowls five seconds after we paid. I'm not even exaggerating. \n\nConclusion: not smitten over Smitten. Not worth going out of the way for, but I wouldn't mind trying other flavors if I'm ever in the area.", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "The earl grey flavor is to die for, even if you're not a fan of the tea. Came by on a Saturday afternoon after lunch (no line) and was taken aback by the coolness factor of the ice cream creation process at Smitten. It's a sight to look at, and nothing about the way the ice cream tasted was compromised for the way it was created. Get those toasted almonds on that earl grey double scoop and your body should be ready for the month", "author": "David Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Customer service wasn't very good but the ice cream was great. We got the brown sugar one and it tastes fantastic! Wish the spoons were bigger but we will survive. The spot was clean on the inside and not to crowded. Love the seating and how the menu board looked!", "author": "Marley M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-23", "description": "They don't let you get two flavors and do not l t you have any samples\n\nTerrible customer service", "author": "Hannah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "Living in OC, we have our own versions of ice cream made with liquid nitrogen. My first time was here at Smitten. \n\nFlavors change daily, I had cookie dough with pretzels and chocolate chips. It was delicious and the texture was so creamy with the pretzel and chocolate chips evenly distributed throughout. I'm definitely a fan!", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-22", "description": "I love Smitten ice cream's rich texture. I don't love the price but it wasn't that bad since the two of us shared a regular portion. The only thing is that there are only 3 flavors at a time so if they don't appeal to you, then you're pretty much out of luck. I'm not a huge fan of holiday flavors (don't love cinnamon and candy canes) and \"Chrismukkah\" is what's available at this time of the year. There was another seasonal flavor that was also too Christmasy for me. I wish they would only do one seasonal flavor at a time, even during the holidays. Anyway, I braced myself for the first bite of Chrismukkah was was elated that the cinnamon/nutmeg wasn't that strong. \n\nMy favorite flavor at Smitten is strawberry white balsamic and I would be there all the time if they had it year-round.\n\nThere isn't a lot of great seating in this shop and most people buy their ice cream to go. We were on a first date and grabbed the sole table in the back and people watched while munching on our ice cream. We had the perfect view of everything that was happening.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "I can here for some ice cream and this place was not what I expected. The menu has wired ice cream flavors and too small of a selection of ice cream flavors. I ordered chocolate ice cream. When I got the ice cream. It did not taste like chocolate ice cream. For some reason it tasted like it had caramel in it. Which It didn't. I won't be coming back to this ice cream shop or any of it other locations because the ice cream shop is too fancy for me. I don't like fancy ice cream.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-08", "description": "After all the trendy decor, smoky hype and pretense, the ice cream is meh.   The cone was awful --- soggy and way too sweet.  Mitchell's come to mama.", "author": "Hadas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "I had earl grey ice cream and it really tastes earl grey!!! It was very tasty. I recommend this place.", "author": "Monika B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "Ice cream is above average but the staff are rude. No eye contact and then shouted at when the ice cream was ready. Could be much better.", "author": "nick w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "The tingles on a body part is a good thing, right?  Their mint chocolate chip got me tingling down there....on my tongue!  What did you think I was going to say?  Get your mind out of the gutter!  ;-)\n\nWhat is it about ice cream that no matter how cold it is outside, you'll still indulge in a scoop or two?  I mean, this doesn't apply to frappes or boba, but ice cream is just so special.\n\nWe were approaching Smitten and I saw a parking spot after 9PM last Tuesday.  I've heard great things about Smitten and tried a shop in Burlingame that has the same concept, but never tried Smitten.  It was a hard decision between mint chocolate chip and salted caramel, but I asked hubby, and the cashier and she highly recommended the mint if we like mint, since they use real mint loves when making it.  So we went with the mint, and then, I saw the cookie dough and pretzel one..'doh..next time!  Cool that the cashier mentioned the Smitten guarantee, in which they'll make another ice cream for you if you're not happy with your purchase.  \n\nA small is $5 and looks like on scoop, a regular is $6 but three scoops so we opted for the regular.  We were waiting awhile for our ice cream to be made, but that's the whole deal with the made to order liquid nitrogen ice cream shops.  It wasn't green, so you know for sure they use all natural ingredients.  It was white and super smooth with the chocolate chips in there.  First bites, very minty but refreshing.  After a little bit my tongue started feeling the tingles.  The ice cream held up very well, as we were able to finish it without much melting.  \n\nI still love Bi-Rite the most, but Smitten is a nice but kind of pricey treat every once in awhile.  I'll definitely want to try that cookie dough and pretzel flavor next time.  3.5 rounded up.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Been to the tiny Smitten in Hayes, made it over to this store front the other day. \n\nSmitten makes solid bougie ice cream. Yes, you pay a premium for ice cream (~$5-6), but it's good, made right when you order, and they have some funky flavors. Also, I ended up being given two scoops- I don't know if by mistake or not. I just know the Hayes location normally skimps me, so kudos to the store front.\n\nOrdered the earl grey with chocolate chips- no complaints if you're an earl grey fan. Tried the cookie dough as well- solid again. Took about 3 min wait to get both. Service was pleasant.", "author": "Arezou A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Addicted. Seriously. I love ice cream so I come here a few times per month. I always have my favorite flavor cookie dough with caramel, sprinkles and whipped cream. The ice cream is made from a few natural ingredients and it definitely tastes that way. I would go there right now but it's 11:30pm haha.", "author": "Mitch C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-13", "description": "I've had it before. It was good. \n\nSo we went again. Was it good? We don't know. We were told you can't try any flavors and you have to buy two scoops of the same flavor. \n\nDrama free, we just walked the 380ft to Salt and Straw.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "Simple neighborhood spot - and kids like watching the ice cream being made. Affordable and tasty too!", "author": "Nick S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Their ice cream isn't heavy and over the top which makes it a good ending to a big meal though. \n\nTheir HCHO+Crispies=", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Home of the BEST vanilla ice cream I've ever had. Please take the time to read their mission statement, it will explain pricing and makes their menu items worth every penny! This place is a must if visiting.", "author": "Racquel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "Why do you have to be so damn good?! Pretzel cookie dough ice cream... Wtf! When my wife first introduced me to smittens she said \"get the pretzel cookie dough ice cream\". It sounded nasty as $#! *until I took my first bite, then I went into a zone. I zoned out from the sweet vanilla and cookie dough, then the hint of salt from the pretzel hit. My God, that's some great ice cream. I want some right now. Whoever crafted this flavor is a genius. I can't wait to get back to smittens", "author": "Philip O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "No joke, amazing ice cream and fresh waffle cones. Lone lines, but definitely Worth the wait. We had just had dinner and were not looking for dessert but we walked passed this place and the smell was unbelievable. We got in line not realizing it was an ice cream parlor. It smelled like a bakery. I had strawberry tres Leche ice cream. So good!", "author": "Joe J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-23", "description": "Aargh - what has this world become that people wait 10+ minutes in line to pay $7 for a cone of ice cream?! The ice cream tastes great, no lie, and the location is fun (mind the cooool patio!), but guys, seriously. I don't care if this caters the hipster crowd or anyone who doesn't mind shopping at the equally overpriced Mollie Stone's across the street. Those prices are just ridic.\n\n#end.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "I love Smitten ice cream, see review of Octavia location. The 3-stars is for the California St. location and the fact that every time I turn up they never have any waffle cones. I haven't figured out if it's because they're waffle cone inventory management system is broken or if each time they see me coming they run and hide all their cones. Are these cones imported from China? are they sitting on the dock in Oakland waiting to be transported? no, these cones are made on premise. So if you always run out, can't you just plan to make more? Today was a classic, I was told they were out of cones \"because they're so popular\". Well if you know they're so popular how about you send some one out back to whip up a batch before you run out.  \n\nHave no fear, if you are in the area and are craving an ice cream in a cone, just head up 1 block north where there is a new hand made ice cream place that has waffle cones galore.", "author": "Elzabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Great design, delicious ice cream and a fun and hip staff. We love Smitten.  Because the ice cream is made with liquid nitrogen, it is very creamy. They have seasonal flavors that change and delicious vanilla and TCHO chocolate all the time. Today they have blood orange as they are in season with pistachio cookies mixed in to add crunch. \n\nAll the products are from local creameries and the local chocolate maker TCHO. \nYou can get their ice cream delivered on Postmates as well.", "author": "Nettie A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-14", "description": "I really wanted to be smitten by this place. Walked in here on a leisurely Monday afternoon and it wasn't busy. Friendly service, that is until the staff started making my ice cream. Someone just walked out of the bathroom and for some reason, the staff needed to go and turned the lock of the bathroom door... while making my ice cream! It wasn't like he needed to use the bathroom. He just went to turn the lock and then came back. The worst part is he didn't wash his hands afterwards and continued to finish making my ice cream. This is also when I noticed that none of the stuff was wearing gloves while making ice cream. I wasn't sure if I should just throw the ice cream away or say something. I won't be back for sure.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "watching the ice cream being made is so fun! The place is very cute, and the workers are so friendly and generous!!! One of the workers offered us an extra scoop for having us wait for so long (which we gladly accepted hehe) \nI am confident that all of the flavors must be very good, but I personally recommend trying the chocolate mint flavor. It is nothing like the normal chocolate mint flavor you get in other basic ice cream stores - it is at least ten times more minty!!! Besides that, the ice cream here is soooooo smooth and soft!!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "Unique fresh and tasty ice cream. The only downside for me is the price. A small scoop of ice cream with a cone came out to $7! It's really good but that's too steep for ice cream. The service is friendly and the place is cute. There's several benches and seats to sit at inside.\n\nI'm not a big fan of mint chocolate chip ice cream usually but the one here is amazing! The mint tastes fresh and the texture is very smooth. The waffle cone is one of the best I've ever had I could eat that alone next time.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "Happy they opened one closer. We are lucky to have plenty of choices when it comes to quality ice cream in the city.  My favorites are Bi-Rite, Three Twins, Humphry Slocombe, Swensen's, Mitchell's, and Joes.\n\nCheck out seasonal flavors. Hard to believe the most popular flavor is vanilla when there's so many to choose from.", "author": "Naty D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Yum!!! I believe to think that this Smitten location is the spot to be because one the location of where it is at, is filled with restaurants along the blocks of being located in the Fillmore. It is very unique because of the way it is set up which I have to say is very nice. Plus this attracts people to come with the way they make the ice cream and that is using nitrogen!\n\nThe ice cream that I ordered was cookie dough and that was just AMAZING with a salty and sweet bite of pretzels and some cookie dough chunks. I say that this would be the best one to order, but also the one other thing that is delicious will have to be the TCHO chocolate because you can really tell the difference from using dark and rich chocolate rather than using fake chocolate where you would purchase from the store.\n\nI recommend for people to come and give it a try!", "author": "Brittany L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "5 stars for the ice cream. \n1 star for the cashier with the terrible attitude. \n\nI love the ice cream here - great quality and delicious flavors. Today, unfortunately, the cashier (white girl with sloppy side pony tail) really left a bad impression on me. No greeting, no smile, no thank you, asked \"do you have a name?\" for my order. I witnessed that she was like this to everyone. I hope Smitten gets a more friendly cashier up front!", "author": "Ricky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "One of the most popular ice cream shops in the city, and definitely the most unique way of making ice cream that I've ever seen. \n\nIf you haven't heard of Smitten before, they make their ice cream using a machine that the founder designed to scientifically create a \"perfect ice cream every single time.\" And the real kicker? They make it using liquid nitrogen--so a guaranteed chill ever single time. \n\nThey have four flavors that rotate daily due to there being four machines stocked at a time. That would be one of the downsides--there isn't the expansive selection you find at other ice cream shops in the city. And since they make the ice cream in little batches to order, it's likely that sometimes they won't have samples to try since there's no fresh batch already made yet. \n\nThat being said, the quality of the ice cream is dope and definitely one of the top spots in the city. My favorite I've ever had was the earl grey with chocolate chips. Not too sweet, absolutely creamy, and stuffed in a waffle cup. Divine", "author": "Jay P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-26", "description": "Ice cream made to order with liquid nitrogen so you have to take a risk on the flavors.  There's no sampling.  The girl who took my order was confusing.  I asked how many flavors I can get in one small.  She told me 2 and I ended up getting charged for 2 small because I wanted 2 flavors. The guy in the back told me they don't mix flavors.  \n\nI gave it 4 because the ice cream itself is good and creamy.", "author": "Alice T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-25", "description": "Don't understand the point of this place. Everything is \"made to order\", but it is a mystery to me why this would somehow be an advantage for ice cream. The only noticeable impact on your experience is on your wallet. And the wait time...\n\nMaybe I just had bad luck, but when I went there, all I wanted was a waffle cone with a vanilla and a chocolate scoop. Not possible. The place was out of waffles, which l guess is fine, but l don't understand how this is possible when they make them from scratch, with same ingredients as the waffle bowl, which I was offered as an alternative. I forgot to ask, but this just strikes me as illogical.\n\nApart from this it is not possible to mix flavours. So no chocolate for me. Again, how is this possible when everything is made to order. The benefit should be more options, not less.\n\nFine , I settled for my amputated vanilla ice cream and waffle bowl. It was fine, ice cream is good, but nothing extraordinary. The staff was nice which earns them the second star.\n\nI would still advise trying miyako ice cream down the road instead though. It's cheaper and can't be worse.", "author": "Martin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "This ice cream was pretty good. I think this place was so hyped up that I had such high expectations. I had the Lemon Ginger Snap ice cream. It was tasty but way too sweet for me, and it only had two pieces of cookie which made the fat girl in me so sad. My dad had the Earl Grey and Chocolate Chip ice cream with the Spicy Caramel sauce. His choice was pretty damn good. The earl grey flavor was surprisingly potent, but happily so. The caramel sauce definitely made the ice cream. It wasn't spicy at all, which I totally didn't mind, but I did wish I had ordered it too. I'd come back if I was in the area, but I don't think I'll go out of my way to get here again like I had tonight.", "author": "Adriana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-24", "description": "I really like their ice cream although I'm not as adventurous when it comes to their flavor combinations. Flavors change on a monthly basis so its good to go back often. As if you needed a reason? :) \nMy favorite is the vanilla with strawberry Prosecco sauce. \nThe wait isn't much to order but since it's made to order, it can take a while if there are many patrons at once. Also, can't try the flavors for the same reason :( \nThey have a few seats inside and out but they're close to the park if you want to walk off all that creamy goodness.", "author": "Amana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-27", "description": "I love ice cream. I love ice cream in every season. I love ice cream in a cone or cup, and with or without toppings. I would finish my last meal on earth with two scoops of old fashioned mint chocolate chip. \n\nThis place just bummed me out. In trying to appeal to the tech enthusiasts of this city, they seem to have spent a significant amount of time and money \"differentiating\" with patented, liquid nitrogen fueled, single-serving ice cream machines, and in doing so, stripped away the simple magic of well-made ice cream. \n\nIs nothing sacred anymore? \n\nI came here with my husband this past weekend. It was clear we didn't \"get it\" when we got to the counter. We asked to try one of the more \"out there\" flavors (out of only 4 to choose from). Oh, you can't, because all the ice cream is \"made to order\". They can't do samples. \n\nOkay, so we settled on a scoop of vanilla and a scoop of chocolate each. Oh, you can't choose more than one flavor, because the ice cream is \"made to order\". Okay, fine, so we ordered one bowl of vanilla, and one bowl of chocolate each.\n\nI suppose I could understand the small batch, made to order \"thing\" if it were 1) any fun to watch and 2) resulted in better ice cream. But this failed on both counts. We paid $16 for plain ice creams. You can't really see what's going on behind the counter, it's just a lot of whirring silver machinery churning out very expensive single scoops of ice cream (seriously). The ice cream itself was just okay.\n\nThere are no ingredients to be found anywhere either, so if their whole shtick with the liquid nitrogen approach is to strip out \"ingredients you can't pronounce\" (per their website)...they certainly aren't very transparent about what *is* being added.", "author": "Brittany B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Each serving of ice cream is made to order.  It was pretty cool to watch them make the ice cream...liquid nitrogen!  Yeah, they've got a patent on their system. \n\nLast night's flavors were: Salted Caramel, Cookie Dough Pretzels & Chocolate Chips; Nectarines & Cream; TCHO 60.5% Chocolate, Classic Vanilla  \n\nMy friend and I were both unable to decide between Nectarines & Cream and Salted Caramel.  Glad we got both, and turns out that I loved the Salted Caramel and she loved the Nectarines & Cream.\n\nHe got the Cookie Dough Pretzels & Chocolate, which he loved and I didn't like. \n\nFriend's husbands and two kids got the chocolate, which was very good and definitely chocolate heaven. \n\nSeating = limited.  There's a large bench by the window, and then one/two seaters inside (repurposed wagon), and a two-top table and 4-seater bar stool table in the back, by the ginormous liquid nitrogen tank.\n\nPrices = moderate. $5.00 for a small.  Seems pricey. But it's pretty damn delicious. Two small scoops in a cup. Or pay for the waffle cone or bowl. ($6.00 for regular, and $11.00 for a pint.)\n\nIf you're in a rush, this is not your place.  So if you're planning to go here...plan to wait for the ice cream is made to order.  Worth the wait.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "My friend was taking me home, and I commented on the long lines at Smitten.  She didn't know what that was, so I explained to her the process of how Smitten makes ice cream: ingredients quickly frozen with liquid nitrogen.  It's visually appealing while you wait for it.\n\nShe was intrigued and turned the corner to find a parking spot.  The line wasn't as long when we got there, as turnaround is pretty quick.  I ordered the strawberry white balsamic with TCHO crunchies.\n\nIt's a very interesting flavor.  The strawberry flavor was very light.  I didn't get much of the white balsamic flavor.  The TCHO crunchies were good, and I was given an extra cup since I ordered a small and the crunchies would topple over.\n\nI like the texture of this ice cream.  It's very smooth and creamy, but not airy like gelato.  I think if the flavors were allowed to steep overnight, it would have a much stronger taste to it.  It's a little more on the pricey side, but you're also paying for the ambiance, even if you take it to go.", "author": "Vira P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "I do not hesitate in saying that this is the best ice cream spot in SF. No contest!\n\nWe tried a seasonal flavor, the blood orange with pistachio cookies, and it was heaven!\nThe ice cream is made with liquid nitrogen, and the result is a creamy consistency that is mesmerizing. Little cookie pieces complemented a fruity flavored ice cream that was not overly sweet. \n\nIt costs $5 for a small for 1, $6 for a regular to share for 2, or $11 for a pint all for myself.", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "Happy to find this unique place. Organic ingredients. Fresh made ice cream via liquid nitrogen infusion. Fun concept and tasty results. Try it out!", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "On the fly ice cream making. Way different and cool. Each flavor is a custom order.\nLove the consistency and texture. Smooth and creamy. \nTry the flight, 3 flavors...\nCaramel had the flavor that was closer to a butterscotch, which was yummy.\nCreme Fraiche is smooth and subtle. Perfect drizzle of the pear caramel. \nMint Chip has a herbal flavor more like a basil mint. This is the most different but kudos for uniqueness.\nDelightful place for a after dinner dessert.", "author": "David H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-22", "description": "I just bought an $8 ice cream and they are refusing to let me use the restroom. Some story about their pipes so only employees know how use the bathroom properly. I'll guess I'll go somewhere else to buy ice cream from now on. Most allow patrons to use it.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "This ice cream is a MUST try. Definitely you can feel the difference between their ice cream and other competitors who have conventional ice cream. The staff is welcoming which makes your experience even better!\n\nI wish they add more flavors like espresso :-)", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "Smitten ice cream is the best ice cream; it's just so creamy and fresh. Not too mention seeing them make your ice cream to order and freeze it with liquid nitrogen is a neat experience. The chocolate and seasonal lemon gingersnap and mint chocolate chip are some of the best ice cream flavors I have ever tried. I normally split a regular size with my boyfriend, because it is too much too eat by myself and much more economical that way - this works as long as you want the same flavor! I've also gotten pints from here before, but it's really more fun to eat it there or walk around Fillmore with a waffle cone.", "author": "Lauren A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-02", "description": "I decided to go for something new and unusual and ordered their sweet corn with berries ice cream! First, I was disappointed in the fact that the \"berries\" was a thin sweet sauce put on top of the solely sweet corn ice cream instead of it being incorporated into the ice cream. I had pictured something like cookies and cream where the berries were inside the ice cream. Anyway, it wasn't that.\nThe flavor of the sweet corn was weird and frankly I just didn't enjoy it at all. But I'm giving this place 3 stars instead of 1 or 2 from another time I came here and got peach and it was delicious.", "author": "Mio W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "***No samples\nGot cookie dough chocolate pretzel ice cream.\nLittle pricey ~ $6 for 2 scoops of ice cream. Really delicious but disappointed that they don't give you samples to taste like all other ice cream places. The staffs said they make everything fresh so don't have samples but their pint size ice creams are stored in the fridge.... doesn't even make senses. They should just have a pint for samples in the fridge.", "author": "Gina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Best ice cream I have ever had! My favorite is classic vanilla with chocolate syrup and almonds.", "author": "Gloria M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Line can be long or short depending on time and day.\n\nIce cream is consistently good and I always grab a scoop when I'm in the neighborhood.  I'm also glad they opened this location. \n\nBlue Bottle Coffee is my new favorite flavor.  $5.00 for a small scoop", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Jason Z. Is the best worker here. He made my experience much more enjoyable. If you ever see him here, make sure to tip him. He is so cool.", "author": "Kirby L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "No line!! However, if you want a waffle cone don't come at 10:30 ): it was really cool seeing the ice cream made!! It is so good  the only thing is that there they TINY spoons like plastic sample size) otherwise it was all good and the lady helping us was very nice :)", "author": "Ashley L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "I loved how the ice cream was made here, like a controlled science experiment! It tasted great, nice flavor combinations. Waffle bowl was superb, not too crunchy, not too soft. My vanilla-type father-in-law was a little antsy while ordering but even he found something that he liked. I had the chocolate, caramel and pretzel one, can't remember the correct name, but it was DELISH! We will be back! \n\nOn a bad note, the music they played here was extremely loud and filthy! This could've been due to a rogue employee on duty, but regardless they need to fix it, it was very uncomfortable trying to enjoy ice cream with my in-laws while some hussy is singing about sex. And most of the other people in the shop didn't look like the type to appreciate it either. The manager needs to get ahold of that issue, IMO.", "author": "Heather D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "LOVE their ice cream. You can't go wrong with any of their flavors but the pricing hurts the wallet.", "author": "Karla T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "Delicious!! It's expensive so I wouldn't come here often nor would I ever wait in the giant lines I often see here, but I happened to walk by tonight with zero line so I thought I would give it a try. \n\nThe waffle cone was easily the best one I've ever had! So good you could just eat that by itself!\n\nBut then you top it with blood orange ice cream mixed with pistachio cookies?!! Yum! The ice cream is mixed to the perfect eating temperature. It's soft, but not melted, dense, and oh so yummy. \n\nThe girls working there were also super sweet! Yum times 10!", "author": "Jen B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-21", "description": "I'm positive this is the most San Francisco tech-hipster place I've ever been to. I had a root beer float, cause I wasn't really into the flavor offerings of the day, and it was good, but not $6.50 good. Fill that thing up with ice cream, not just one scoop, if you're charging that much! (Also, classic A&W is fine... I don't need an artisanal root beer...! Side note: very strong sarsasparilla flavor)\n\nThe ice cream is made in small batches all day long. Not sure why... I feel like it would be easier to keep consistency for each flavor if it was made more than one pint at a time...\n\nEveryone working here couldn't have been older than a college graduate. It was very millennial... sorry for the stereotype! But they all looked half-confused and half- bored. There was also a girl you could see in the back eating on her lunch break. Like, don't eat in the kitchen where everyone can see you!\n\nI dunno... worth the hype? Eh, not to me. It definitely fits a trend, though, and fits a clientele.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Loved that they have VEGAN pops! Tried the Salted Caramel and was really good. But the ice cream hands down was BOMB! Just had the Vanilla with strawberry prosecco! Must try this place when in SF!", "author": "R P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Am officially addicted ! Is there icecream rehab I can attend to? Or icecream anonymous ? \n\nBest flavor is the simplest one. Can't mess with simplicity . Order plain vanilla with strawberry sauce ! Trust me you won't regret it", "author": "cristina s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-11", "description": "This is very good ice cream, and the brrr machine does its part to make a darned creamy ice cream.  The customer service is lacking - cashier doesn't smile under any circumstance and the inflexibility on flavor mixing your different scoops is disappointing - even if you order 3 scoops they all have to be the same flavor.   Bottom line, it's good but I think SF offers better options.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Wish I could give them more stars as I hit this place up every week. This is some of the best ice cream in town, if not the country. The place is really cute and a quick pickup spot. They fresh make every single ice cream by customer using their own high tech process. This is some of the richest, most velvety ice cream with really delicious toppings.\n\nRecommend: Salted caramel ice cream with pretzel cookie dough chunks. Amazing!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "I was expecting this to be another overrated SF ice cream hot spot and boy was I pleasantly surprised! the staff is super nice and while there isnt a huge variety of flavors to choose from, they are delicious. I got the cookiedough ice cream with the brown sugar caramel on top. whatever you do, GET THE BROWN SUGAR CARAMEL DRIZZLE. honestly changed me. so good. decent portion too! I was very satisfied.\n\nUPDATE: so I didn't include that my cookie dough ice cream did not have the advertised pretzel pieces in it because at the time, I didn't care much. I mentioned it on instagram and the company said to email them and they would \"make it right\". I have since done so, and gotten zero response after messaging them via 3 different forms of communication. Now I care lol. Kind of frustrating that they encouraged me to take the time to contact them, but they won't do the same now. So if anyone from Smitten is reading this, hellooooo", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-02", "description": "Terrible customer service. The blonde girl was very rude. The ice cream was good but doesn't works this bad mood. And it is not cheap ice cream.", "author": "Vanessa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "The first time I came to Smitten, I absolutely fell in love - I wanted to walk up all the crazy Pac Heights hills for Smitten and sacrifice all of my clean eating. I had the Crème Fraiche with Pear Caramel, the seasonal flavor, and it was totally unlike anything I had ever tried before. The ice cream itself had this wonderful, rich, creamy flavor that wasn't too sweet, so it complemented the amazingly decadent pear caramel very well. Definitely worth the extra fifty cents for the seasonal flavor... And I forgot to mention that since I'm an aesthetic eater (i.e. food must look good AND taste good), the ice cream here definitely didn't disappoint on the appearance front.\n\nMy first experience was so good that I dragged a couple of my friends with me a second time even though we were all stuffed from brunch. I told them that Smitten was too good to miss. Since we had three people, we went for the flight of three so that we could try a multitude of options. We chose the Tcho chocolate, seasonal maple brown sugar pumpkin, and cookie dough (with pretzels and chocolate chips) as our three flavors and were super anxious to try them all. Honestly, we were a little let down. My friends were really excited to see the liquid nitrogen ice cream process, but the ice cream itself tasted just like normal ice cream... nothing special. And for the flight, the servings are smaller than a normal scoop, so it didn't look as aesthetically pleasing either. They were all good ice cream flavors, just nothing as extraordinary as the crème fraiche flavor that I had on my first visit there. I was so sad that my friends weren't able to enjoy the same experience that I had my first time!\n\nOverall, I think you're paying for the experience. Smitten is definitely on the higher side of ice cream in SF... even more expensive than Bi-Rite, Mitchell's, or Humphrey's Slocombe. For $5 you can get a small size ($5.50 for the seasonal flavor), and a flight of three, tiny scoops of ice cream is $9. I can get two large pints of ice cream in a supermarket for that price!! I would say, if you haven't had liquid nitrogen ice cream before, it's definitely worth a try. I would also recommend trying the seasonal flavors because they seem to have the highest probability of WOW-ing you. I probably won't frequent Smitten as much as I initially thought I would after this second, not-as-amazing experience. Don't get me wrong - the ice cream was still good, just not worth $5 for a small scoop!", "author": "Sheila D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-16", "description": "Everyone needs to experience and enjoy the decadent, churned-to-order Smitten ice cream made in a liquid nitrogen machine. The shop offers a limited selection of flavors daily but they use only the freshest, locally sourced ingredients and all flavors are simply delicious. You'll have to wait a bit since each order is made-to-order, but you won't be disappointed as it's fun to watch your ice cream being made and the ice cream itself is rich, creamy and delicious.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Probably THE best ice cream made using liquid nitrogen that I've ever had. The texture of the ice creams are smooth and ultra creamy, and while they have classic flavors, they also have really unique seasonal ones as well. I ordered the creme fraiche with pear caramel and it was delicious! Super refreshing and yummy. It is a seasonal flavor in the fall though, but when autumn comes around, I will definitely order it again.\n\nThe people working here are super sweet too! When I visit the city again, I will be coming back!", "author": "Trisha V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-02", "description": "The worse customers service. We would like to use the restroom and they not allowed after we wait for 10 min. The detail we saw one customer used before.", "author": "Lica R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-01", "description": "If you're in a rush don't come here... literally the SLOWEST employees ever.  I love Smitten but choose a different location because the workers are too busy chatting to make your ice cream!", "author": "Sierra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-10", "description": "Our favorite ice cream spot! Very fresh ice cream you can taste all the ingredients. Totally worth the money. It's super expensive for ice cream, but that's better than having cheap tubs of icecream in your fridge made from ingredients you cant pronounce.. We treat ourselves to a regular in a waffle cone of every new flavor that comes out since it changes every month or so (we also live above Smitten so... theres that... Great after dinner treat!", "author": "Felicia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "I've heard so much about this place, it was kind of disappointing when I got my ice cream! If I could rate just the interior, it'd be a 5. Unfortunately, the ice cream was just okay. I had the mint chip, which actually tasted like mint leaves in a frozen form. I appreciate that they tried to make it different than typical ice cream, but I just really like the artificial, sweet mint flavor.\n\nP.S. There's a really cute corner outside of the shop, to the right. It's only a bench for about two people, but there's lights strung on the top and a mural on the wall. I wish I could've sat there, but it was occupied ):", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-14", "description": "I love all smitten location. Now one near me. Staffs are friendly. Ice Cream is yummy and creamy. \"LEMON GINGER SNAP\", YUM!", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "So there is something about American ice cream that makes it super fluffy and buttery, but well, less cold. I went for a treat and to cheer me up from this gloomy weather (rainy and cold), but the ice cream I got would melt within minutes and after the short walk home, I was left with vanilla sauce. Very yummy vanilla sauce with caramel and toasted almonds, but still. I like my ice cream a bit more solid. And cold. Like brain freeze cold. Who knew that I was going to miss that at some point? Since I experienced the same thing at a bunch of ice cream places, it may be a cultural ice cream difference, so I'm not going to hold that against Smitten Ice Cream. I like that they have a limited selection of flavors, makes the choice easy. But it's also pricey: a small scoop with two toppings was around $8. I was expecting more for that amount of money. I wanted to love Smitten Ice Cream, but was left slightly disappointed.", "author": "Katja S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "I had the salted caramel ice cream in waffle cup. The ice cream is too rich and sweet for my taste. I prefer bi-rite's salted caramel flavor. But the waffle cup tasted great. Probably won't go back again.", "author": "Kelvin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-04", "description": "I'm absolutely smitten. This place is my new favorite ice cream place, and I always try to come here when I visit friends in the city. I've told all my coworkers that they have to try Smitten, at any of their locations. They have the creamiest ice cream I've ever had. Definitely worth the wait every time I come.\n\nTheir Tcho chocolate ice cream is to die for! And the toasted almonds are like crack.\n\nThe people who work here are super friendly. One time, the wait was maybe slightly longer than it usually is, and they gave me a cute little coupon for $2 off my next visit.\n\nI like sitting outside in the little alleyway they have there to enjoy my ice cream with friends. It makes for a lovely day when you come here for a mid-day pick-me-up or even an after-dinner delight.", "author": "Eryn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "So much love is put into the ice cream that you get. You may not get to try their flavors before you commit but ALL of them are just as great. Personally LOVE their Four Barrel Coffee ice cream. Smoothest liquid nitrogen churned ice cream I've had so far and just the right amount of sweetness to satisfy someone with a sweet tooth but not a fan of cloyingly sweet ice creams. The TCHO chocolate ice cream with salty caramel is also really good balance of sweet and salty for with rich, rich chocolatey flavor! I'm completely smitten.", "author": "Shelly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Liquid Nitrogen Ice Cream. Pricey, but delicious and extremely creamy. Definitely worth it for the ice cream and the experience. \n\nThey don't let you taste flavors since it's all made to order but said they will replace it if you don't like it. Small and no seating inside but there's a parklet right outside. For just $1 more you can get 3 scoops vs 2.", "author": "Alison B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "The hype here is real folks - Smitten Ice Cream is some of the best around (dare I say comparable to bi-rite creamery?), and if you can afford it (the hype regarding the price is also very real), you absolutely need to come here and try all of the things. \n\nStar 1: How were the service and atmosphere?\n\nThe location is wonderful, the concept is brilliant, and the patio arrangement plays into the whole bit. If there's a downside here it's that you can't get samples, but know that's because they literally make your ice cream to order - right there in front of you! Fantastic concept. Star Granted. \n\nStar 2: How were the portions relative to the cost?\n\nAlas, if you think it's too good to be true it probably is, and if there's a single downside to Smitten Ice Cream (and it is without question the only downside), it's the price, which is already well documented within these reviews. A small scoop of ice cream here at Smitten Ice Cream is $7.00. Seven dollars as in, a dollar or so short of a Chipotle burrito, double the price of a standard HALF GALLON of Blue Bell at the grocery store, and enough to get you roughly two and a half million calories at Taco Bell. Plain and simple - it's too much. Yes, I get that this is seriously wonderful ice cream, and I get that it's made in front of you, but $7.00 is simply too much for what you get. No Star Granted. \n\nStars 3 and 4: How was the food?\n\nUnf. The consistency is gelato without being gelato, and the flavor is pretty much unlike anything I've had elsewhere with respect to the density and the consistency. My salted caramel tasted as though I was actually eating spoonfuls of caramel, and that's in no way a bad thing. My cousin's mocha was equally good, and everyone else in my party was raving about their flavors. I don't know how they do it, but this is seriously some of the best ice cream you can get. Dual Stars Granted. \n\nStar 5: Would you eat here every day if you could?\n\nIf I could afford it? Yes - it's better than Blue Bell, and that's not something you hear often from someone who has spent any significant amount of time in Texas. Star Granted.", "author": "Paul V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "Really good ice cream and really friendly people! I ordered a small salted caramel ice cream with chocolate sauce (extra $.75/topping) and it was delicious. The small definitely felt sufficient to me. I kept eating and eating and was surprised that I still had more! I only wish they had more flavors to choose from.", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "The ice cream is a little pricey however it is very worth it. Not only do you get to watch your ice cream being made, which is pretty cool, when you eat it, it is well worth the wait. Delicious. I wish they had one in Brentwood, hint hint :)", "author": "Trish B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "LOVE THIS PLACE!!! Definitely a must every time I visit SF! The cookie dough with some caramel drizzle is where it's at!! My sis made me walk up a big hill as I ate my ice cream LOL! I'm somewhat a foodie with an emphasis on ice cream and this place is definitely on point!! \n\nWould definitely recommend!", "author": "Mel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "I enjoyed the Tcho (dark) chocolate ice cream. Very good flavor and texture, and reasonably priced. The service was prompt and courteous. Seating is somewhat minimal.", "author": "Jethro B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-18", "description": "I've heard such good things about Smitten and was really excited to finally be able to try it. I wasn't sure what flavor to get so I asked the cashier which one was her favorite and she said fresh mint chip, so I decided to give it a try. I also added the chocolate covered crispies topping. Mint chip is one of my favorite ice cream flavors so I had high expectations.\n\nI was eager to take a bite when my ice cream finally arrived and the second I ate it, I wanted to spit it out. At first, it tasted like very fresh mint leaves (which potentially could've been a good thing), but soon after, it just tasted like I had eaten a spoonful of toothpaste.. I tried to take a few more bites but I just couldn't stomach it any more.\n\nSadly, I'm quite disappointed.. The best part of my first time at Smitten was watching the ice cream get made with the liquid nitrogen. If I'm ever in the area again, I'll probably give it one more try with a different flavor but until then, I don't see what the hype is about at all.", "author": "Melody Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-26", "description": "Smitten has delicious ice cream and awesome sundaes. They do alcohol inspired flavors also. The whiskey chip was my favorite. Even though they are getting big and expanding they still do a great job of keeping it as a local place and homely. Definitely check it out!!", "author": "Makenzi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "This ice cream is the best in the city. I want to divorce my wife and marry smitten. The end.", "author": "Matt P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-05", "description": "Service was super rude.\n\nCashier girl was lifeless and rude. Told me that all the pre-packed ice cream were all packed that very day (7/3) and I told her the labels did not agree with her and even picked up one labelled 7/1 which was the latest one to purchase. The others were 6/28, 6/30. She did not deign to say anything and just rang me up. As I was paying, the ice cream maker splashed me and she actually smiled. I guess she thought it was funny. No apologies as I was wiping my arms and face.\n\nMy friend who recommended me to this place asked if she could get the rewards from my purchase. She blankly said too late. Then another friend of ours made a purchase and so she asked if she can put that purchase into her rewards. Nope, had to be same credit card. WTF! What kind of reward program is this? Bi-rite just stamped cards like anything and they do it RITE.\n\nDefinitely NOT smitten, more like frost-bitten.", "author": "July N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "Update - just tried it again and it still sucks.  It has barely any flavor and there were pieces of ice in my ice cream.  \n\nThis is the third time I've had Smitten and I still think it's only ok.  Take cost into account and I give it 2 stars.  This most recent trip I got regular vanilla bean ice cream in a cone which set me back over $6-7???   The ice cream didn't taste bad, it just wasn't great - I could barely taste the vanilla flavor and the temperature it's served at was too cold (which sounds ridiculous but it's not haha).  I've tried other flavors as well and all were either way too sugary and/or lacked intense flavor.  Also I don't get this making it to order stuff - it seems like it's a BS gimmick cause it doesn't result in tastier ice cream, just more expensive ice cream.", "author": "Olivia T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "Tasteless, tiny portions and completely overpriced. We ordered a root beer float, and we're handed one small scoop of ice cream and a bottle of root beer. Really?", "author": "Nancy R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "I came here with my family during the Fillmore Jazz Festival. I had the Brown Sugar with Cinnamon Shortbread which was delicious. I wasn't sure about it but when I had a bite of it. OMG! I was surprised how delicious it tasted. It was the brown sugar flavor but not overpowering but tasty, and something totally different. If you ever go to Smitten, give it a try. I will also try other flavors. I wish I had Smitten Ice Cream in my area. I will remember this place and will be back when I'm in S.F. Cheers!", "author": "Daphne J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "One of my favorite ice cream spots in the city! The atmosphere is fun and the staff is always friendly. Watching the ice cream being mixed is always a neat experience too. I can't wait for the strawberries and mascarpone flavor to be back over the summer - by far my favorite flavor to date!", "author": "Catherine W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "Tried smitten for the first time today, and it was delicious! I had the earl grey with a waffle cone. The ice cream had great flavor, and the cone was nice and fresh and crispy! Of course, this ice cream is a little on the pricey side, but if you can afford a few extra bucks, you're in for an amazing treat!", "author": "Rachel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "Yeah, I wouldn't know what the ice cream tastes like here, since they like to forget your order but somehow give your friend, and everyone else in the establishment, theirs.   Once I addressed this with the cashier that \"everyone in here has gotten their order, including my friend\" I am told that there is some issue with their iPads.   Not \"oh sorry, let us try to make this for you, not, oh sorry that we screwed up, just \"here we will refund you.\"  Needless to say, they have not refunded/credited the amount for the ice cream I never received, they never even offered to try and make it right.\n\nRegardless of if the ice cream is good or not, I wouldn't take my business here again.  There are plenty of other places in the neighborhood to go to to get a \"sugar\" fix that actually appreciate your business.", "author": "J B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "Came here after watching a movie at kabuki theatre. It was a bit after 10 pm on a sat night and there was a short line of about 8 ppl waiting at smitten. The line moved quickly. We ordered two smalls, mint chocolate chip and salted caramel, both in waffle cones. The total was around $13. Portions were pretty big but pricey for 2 mini scoops of ice cream. \n\nBeing able to watch the ice cream ingredients being frozen with liquid nitrogen was pretty neat. \n\nWe got our ice cream in about 5 min. It seems like each flavor is made at a different station and made to order, which seems pretty inefficient once the line gets longer. The mint chocolate chip was light and refreshing but not very flavorful. On the other hand, the salted caramel was very flavorful and a bit too sweet. My fav is still scoop in Palo Alto. The waffle cones here were a bit on the thicker side and did not taste as fresh as the ones at scoop. The overall ambiance was very cute and there was even a smitten alley for additional outdoor space to enjoy your treat.", "author": "Yin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-24", "description": "Love smitten. So glad they opened another location, around a bunch of other shops and restaurants. We've tried salted caramel, TCHO chocolate (did % change over time?), or cookie dough when they had it. I liked that they had seasonal flavors, but TCHO chocolate was by far my favorite. Like the liquid nitrogen texture enhanced the chocolate flavor. After some spicy caramel was added, it tasted like dream. Would definitely end up there again.", "author": "Jaclyn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-13", "description": "We recently tried Smitten for the first time and we really enjoyed it.  We decided to go back and if it wasn't for this issue, we would have been repeat customers but we will not be going back.  \n\nUpdate: I had actually written this on Wednesday and I had received an email back that day.  He said that he will notify finance.  It's now Friday and still nothing.  At this point, it's just bad business.\n\nWe made an online pickup order last Saturday at the Pac Heights location.  The online system did not email me a receipt, nothing in the spam folder, so luckily I had taken a screenshot of the order info.  When we arrived for the pickup, they did not have any knowledge of our order so they brought over their district manager.  From the conversation they were having, we were not the first with this issue.  The district manager told us that they can't give us the ice cream and we have to pay for it.  I said that my debit card was already charged, not pending.  He said that we don't have your money so I can't just give you the ice cream.  Just pay for it and if the charge is still on your statement in a few days, just call me and I will credit you back.  He gave me his biz card and we did what he asked.\n\nIn case he thought that we made an order to the wrong store, I also mentioned that when you do an online order, pickup is available for the Pac Heights location only.  It's clearly on the website but he said you can make an online pickup order at all locations.  He clearly knows what he's talking about.\n \nOn Monday, I checked my statement and I'm still double charged so I sent him an email with all the info on my online order.  Crickets.... \nTuesday, I left him a voicemail requesting a callback.  Crickets... \nIt's now Wednesday and I just sent him a follow up email.\n \nAll this hassle for $11.  Why not just give us the ice cream in the first place and say that if the charge does not go through, please enjoy and it's on us.  This has left a very bad taste and we will spend our money elsewhere.", "author": "danny m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "Everyone is right. This place has super creamy ice-cream. Since everything is made to order, you won't be able to try any flavors -- you need to be ready to either get every single thing on their menu, or be decisive on the flavor you want.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "I love Smitten Ice Cream! I came here on a Friday night with a friend to try some of their ice cream. I've seen many pictures of their ice cream on Instagram and had to try it myself. They had very interesting flavors on their menu like a mojito flavor and a creme fraiche with pear caramel. We both had the mojito with strawberry sauce which came out to be $5-6 each (extra $1 for the additional sauce). The mojito with strawberry sauce was delicious. Their ice cream is made with liquid nitrogen right in front of you. It's kind of interesting to see how their ice cream is made. The staff were also really upbeat and friendly which made the entire experience more enticing. The place got packed on a Friday night at around 10PM. It almost felt like you were at  a well lit bar. I would definitely come back to try more flavors!", "author": "Jennifer Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "What else can I say but I'm smitten for Smitten. Using liquid nitrogen to make really smooth ice cream was genius. They also use really good ingredients to make some really good ice cream with some different flavor combinations (though not Humphry Sloecome different). This location is also really nicely decorated and has a nice outdoor, dog friendly (it's not very large, so probably small dog friendly) patio. It's fun to read about the design of the ice cream machine, ingredients, and the history of Smitten. The original machine was carried on a wagon and the wagon theme is shown throughout the location. The ice cream is really super smooth and tasty. You're paying for the uniqueness, so it's not cheap. $5 for two small scoops or $6 for three is a bit pricey, but given its uniqueness and quality it's worth it. I'll go every once in a while and I'll probably take people from out of town here to see it. I'll also probably take them to Humphry Sloecome to try their really unique flavors.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "BEST ICE CREAM EVER. Came in here after eating lunch at Roam's and got the brown sugar flavored ice cream with cinnamon shortbread. It was so good!!! It had the perfect texture and was creamy and delicious just for my liking. It's on the pricier side but it's worth every penny. Definitely recommend this place", "author": "Cee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "This is now my favorite go-to ice cream place!! Although I wish they had a bigger variety of flavors to choose from and samples, I think it's cool how they make their ice cream on the spot. Not just that but I love the area, and it's really nice how they have an outdoor seating!! The texture of the ice cream is what really drawn me in.. \n\nDEFINITE FIVE STARS!!!!", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "Our bnb was walking distance to Smitten and came here to cool out. I ordered the earl grey ice cream with tcho chocolate chips. Wow, so creamy and yummy! Definitely would order this again!", "author": "Mika D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Yum. Stopped here after eating at Pizzeria Delfina next door (totally delicious). My husband and I shared the regular size (3 scoops) in a waffle bowl. We had the cookie dough ice cream with brown sugar caramel and TCHOs which are like little crispy chocolate pieces. It was so good. The gentlemen working the counter was great, patient while we looked over the menu, and eager to provide suggestions. He also totally knew all the lyrics to Bad Mama Jama which made it highly entertaining for me. We will definitely come back next time we're in the area.", "author": "Allison G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "I love Smitten ice cream, especially their Earl grey. During my last visit yesterday afternoon, however, their service was very lacking. The cashier, a young white woman with a ponytail, greeted us very rudely and not once did she smile or say thank you. After we finished paying she just walked away, which I guess was a signal that our transaction was complete. When they had my order they only announce it by calling out my name. Unfortunately, someone else also had my name and he took my ice cream by mistake since no one was calling out what is being given out. This happened twice and by that point I just wanted what I paid for. A better system is desperately needed. I'm not sure what had happened at the ice cream shop to make the workers so unhappy and service deteriorated so much but the only smiling face I saw that day was from a young Asian girl. This isn't the Smitten I remember.", "author": "Binh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "I'm not sure if it was the nitrogen, the ingredients, or what - the creme fraiche with pear caramel (seasonal flavor) was delicious! So creamy and decadent. Although I couldn't really taste the pear flavor and my boyfriend couldn't stop singing the creme fraiche song from South Park, I would definitely get it again and can't wait to try other flavors. The only thing that would be nice is if you could get multiple flavors with the regular size.", "author": "Hoai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "Earl grey is delicious! But if I'm going to spend nearly $6 for a small ice cream with 1 topping, the staff could at least be polite. They always look really unhappy when I come here.", "author": "Christa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Not crazy about the waffle cone as I like waffle cones to taste more like brown sugar or molasses; other than that, the ice cream is surprisingly creamy and flavorful!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-26", "description": "Pretty good ice cream but is not that great. They make their ice cream with nitrogen. The cones here are the key! Fun ice cream place if you are looking for something to do.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "I've just had a sandwich full of Sriracha, it was hot, and there was no line.\n\nI ordered a small Chocolate Chip Cookie with Brown Sugar Caramel sauce (\"frozen\"), sat in the back by the liquid nitrogen, and read the Twitters.\n\nThe window was open and there was a cold-ish breeze, I didn't mind.\n\nI finished my ice cream, put my phone away, and left ice-cream-sated.\n\nI gave Smitten Four Stars.", "author": "James G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "Finally got a chance to try the Earl Grey Mint Chip and omg I have found my favorite ice cream at Smitten. Though it is usually there for a short limited time, it's amazing!! Can't wait to return and have more :) customer service remains nice as well :)", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "Cookie dough ice cream. You must try this!! One of the best ice cream flavors I've had in the city. Been to Joe's ice cream, Ghirardelli, Swensens, Over the Moon, Cold Stone, and Mitchell's but there is seriously nothing that can beat fresh made to order ice cream. The texture and flavors are unreal! \nYeah, it may be a bit pricey but it's definitely something to try at least once for the experience of seeing the ice cream being made in front of you. Everyone working there is super friendly which makes it even better.\nFlavors that I've tried \n-Vanilla: can't go wrong with a classic, but taken up a notch with it being made from scratch \n-TCHO chocolate: if you're a chocolate lover you have to go with this one. Very creamy\n-Salted caramel: they made the perfect balance of sweet caramel ice cream with not an overwhelming amount of salt \n-Fresh Mint Chip: now this one isn't your regular mint flavor ice cream you get in the ice cream aisle at target. This legit tastes like you bit into a mint leaf!! It's pretty intense. Not my cup of tea but could be yours. \n-Maple Brown Sugar Pumpkin (seasonal): definitely should try it when it's back on the menu it tastes like pumpkin pie in ice cream form!", "author": "Camille B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "best ice cream ever! \ni loved the waffle bowl! \ni hate ice cream in general but this one was really good! \ni tried the vanilla , and the other one called earl grey ! it was awesome!!!!!! taste like black tea! lol, but it was delicious  don't forget to get the waffle bowl", "author": "Dina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "GREAT ON THE SPOT MADE ICE CREAM.  If you looking for Rocky Road and Bubble Gum, this is not the place.  If you are looking for a well made ice-cream with limited toppings then try this place out, you will not be disappointed.", "author": "Greg W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Well I'm smitten. Having grown up in Ohio, I've found it can be hard to find good ice cream in California, the land of fro-yo. Smitten has done it, boys!\n\nAfter a rave recommendation from an SF friend a month or two ago, self control was out the window after unintentionally stumbling upon it on a Fillmore Street wander. I had the lemon ginger snap with the suggested toppings, caramel (brown sugar caramel, maybe?) and toasted almonds - delicious! Very fresh and not overly filling like Coldstone or eating too much Ben & Jerrys. \n\nStop by if you see it. It's a little expensive - $5 for one scoop plus a dollar or two more if you want toppings - but worth it if you didn't just eat a heavy meal or something. Thumbs up, Smitten!", "author": "Scarlett C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-13", "description": "Gem of an ice cream spot! Fun to grab ice cream with a date. They make each ice cream to order using liquid nitrogen so it's dessert and a show that you get. \n\nStaff was very knowledgeable and answered all my questions about the flavors and process.\n\nI will definitely treat myself to their cookie dough ice cream again.", "author": "Holly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "I like this Smitten outlet better than their original Hayes Valley one. It's got a lot more indoor and outdoor sitting space and seems to have more flavors/toppings/sauces on the menu!\nBeing right next to Fillmore Street which is full of my favorite restaurants in the city (such as Delfina and Dosa), it makes for a great post-dinner dessert place.\nI usually go for one of the more decadent flavors such as Cookie Dough or Salted Caramel, but everyone recommends getting the Mint whenever it is available!", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-02", "description": "I like the concept. Liquid Nitrogen to freeze your ice cream on the spot. Sounds like a \"cool\" thing. Smitten's is a local favorite, so why the low rating? Maybe it's me but everything just tasted too sweet. But it's an ice cream place, you say, so it's supposed to be sweet. I think some of the flavors are lost when things are too sweet, which then becomes a distraction. Also, the place ran out of the waffle cones. That was a bummer as well. I guess in my mind, this place is a one and done, and I can't see giving anyplace 3 stars on a place I wouldn't go back to, but there isn't a way to give 2.5 stars. Smitten's isn't going anywhere and tons of you will go and love it, but I won't be one of them. The staff is great but this place is just not for me.", "author": "James N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "I usually never order cookie dough ice cream but the cookie dough ice cream here tastes soooooooooooooo awesomely good!", "author": "Alice X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "Ice cream is fantastic! They make each batch to order and you can watch them make it while you wait! I had the Dough My Goodness and it was awesome. The whip cream was not overly sweet which complimented the dish perfectly. For anyone curious about the strawberry prosecco sauce, my girlfriend said it was \"to die for\".", "author": "Lee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "We where in Japantown for dinner when we decided to give this place a try. I am very glad we did!!! This place was delicious! I ordered the hot stuff glad I did. The ice cream is made fresh for every order and you can see the process happening right in front of you. This place was a bit crowded but was fast. The ice cream is a very smooth and rich taste. I am very glad we found this place and decided to make the walk there. This a definite place to visit if you love ice cream", "author": "J G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "This is my favorite ice cream in San Francisco, maybe my favorite anywhere. \n\nIt's made on the moment, 100% fresh. Their creme fraiche flavor a few months was to die for. I still pine for it.", "author": "C. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "So delicious! I got the cookie dough ice cream with pretzels and chocolate chips, topped with brown sugar caramel sauce. They make your ice cream when you order using liquid nitrogen machines. Not only do you get a wonderful treat during your visit but also an interesting display to watch which is helpful during the wait. The staff was friendly and the shop is very cute. There are a few small benches inside and outside as well as a few chairs in the front.", "author": "Charlotte A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "At first, I thought nothing could beat the original Smitten on Octavia and boy was I wrong.\n\nSimply put here is what this location has over the other original one:\n1. More flavors. This location has 6 flavors versus 4 flavors at the original location\n2. Quality.  Both locations have great quality, but this one is slightly better since it was less icy.  The original location sometimes has tiny bits of ice in the ice cream where as this one was super smooth with no ice bits!\n3. Parking.  Parking is so much easier to find here.  Still street parking, but 100x easier than trying to find parking at the original one.\n\nNote: Smitten Ice Cream is liquid nitrogen ice cream so expect slightly higher price and limited selection compared to Bi-Rite, Humphrey Slocombe, and Mitchell's. My favorite flavor at Smitten's is their salted caramel!\n\nAlso, if you've tried Creamistry back in SoCal, Smitten blows Creamistry out of the water hands down in everything from price to quality and taste.\n\nI will keep on coming back when I'm in the city.", "author": "Nicole K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-17", "description": "Loved this place! Such a cute little ice cream tent. Fun to watch the nitrogen machines making the ice cream and I don't know if it's because of the fancy method but the ice cream definitely was creamy! There were so many unique flavors and sauce combos we had trouble ordering. The best was the cookie dough pretzel / chocolate chip flavor. I was also pleasantly surprised that they didn't mark up the ice cream a crazy amount. Would definitely come back if I was in SF in the area!", "author": "Alyssa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "Fell in love with this place the first time my friend took me. TCHO dark choc ice cream is so good, creamy and luscious. So is the earl grey.", "author": "Siddhartha G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-01", "description": "Highly overrated. Ordered Tcho chocolate on waffle cone - underwhelmed. One of the least memorable ice creams I've ever eaten. Even the waffle cone was blah - had a strange (honey?) flavor that clashed with the chocolate. This is the 2nd time I've given Smitten a try, & I am decidedly un-smitten. Gimmicky, expensive, not worth it.", "author": "J. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Smitten totally gets it! I was worried at first when I saw the nitrogen machines. Sometimes a showy ice cream making process means mediocre ice cream... well, not here! My salted caramel ice cream was insane! Totally flavorful, creamy and salty. And you get two scoops for a small. I love these guys!", "author": "Ari R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "OMG I'm so smitten by Smitten!\n\nSwung by after having late lunch at Pizzeria Delfina next door... oh you didn't know? According to my Lyft line co-passenger, weekend calories don't count. \n\nAmbiance/Decor: No line to speak of?! I mean ... it was raining when I stopped by, but knowing how popular this place is, this actually threw me off a tad. \n\nFood: I tried the cookie dough flavor which had traces of pretzel in it. I seriously can't believe how good this ice cream was. I've tried Bi-Rite, Humphrey Slocombe, Mitchells... this tops all of them. The creaminess and perfect marriage of sweet and salty flavor was absolutely divine. I also love how they make your ice cream to order. How dope is that?!\n\nService: Super sweet girls working the front counter and machines. As a first timer, I was a little confused by the whole set up and the lady working the cash register suggested with zero hesitation whatsoever that I try the cookie dough pretzel flavor. It didn't sound all that appealing, but I'm so glad I listened!\n\nOverall: Absolutely recommend! I am DEFINITELY going back. Pricey but worth it for the occasional splurge.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Kind of like going back in time, and then jumping forward into the future! The setting is old-timey and cool with neat stuff everywhere. The ice cream is made to order using an ingenious liquid nitrogen process. Probably some of the best ice cream I have ever had. Would highly recommend.", "author": "Latham W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "Pretty darn good. Tried the Cinnamon Shortbread, strawberry, mascarpone and peach and vanilla bean.  Very tasty.  If you like rich and creamy ice cream this is the place for you.  Their flavors aren't as dramatic and different as many of the boutique ice cream places such as Salt and Straw or Humphrey Slocumb but what they do have is done well.", "author": "Debbie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Such good ice cream. So smooth and creamy, it seemed like there was no air in it at all - but still fluffy and not dense, if that makes sense. The chocolate sundae (I forget the name on the menu) in a waffle bowl was A+++", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Best place to go for fresh ice cream! You literally see them make it right in front of you. Perfect for hot or cold day. I went on a rainy day and it was still pretty busy! The classic vanilla is soo delicious and the mint flavored ice cream is super strong. Be aware it pretty minty! I would definitely come back for more", "author": "Danika P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "I had liquid nitrogen ice cream years ago and haven't since so coming to Smitten was a wonderful trip down memory lane. However,  Smitten took things to the next level. The salted caramel ice cream is absolutely delicious. You can taste the quality of the ingredients in the clarity of the flavor. My TCHO chocolate drizzle was heavenly, and I just had to get pretzel chocolate chip cookie dough on the side. Ideally it would've been mixed into the ice cream but that's another story. It probably took me over five minutes to decide what I wanted, but employees that day were super patient and helpful! Watching our ice cream being made was so fun, the shop has a cute outdoor seating area (be advised it's tiny) and I can't wait to go back.", "author": "Araba A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "I am really glad Smitten has expanded! They did a great job with this location, it is really big and has a cute patio attached to it. They also have room to sell shirts and cooler bags here. It is located right next to Delfina off of Filmore, a perfect location!\n\nEvery server here was very friendly, and why wouldn't you be working in an ice cream shop! I ordered the tcho chocolate in a cone with sprinkles. My friend got cookie dough with caramel sauce. It is a fun experience to watch your ice cream being made from scratch and the wait goes by pretty quickly. The ice cream here is amazing and you can't go wrong with anything you pick! But I would skip on the sprinkles next time.", "author": "Alisha K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "I've been to the Smitten Ice Cream in Hayes Valley and it's amazing. I was thrilled when I saw they were opening a brick-and-mortar in my neighborhood apart from the now constant temptation. \n\nFinally ventured in there today with some friends who were visiting. Needless to say, everything was delicious, fresh, and everything I've come to expect in a ridiculously fancy San Francisco establishment that caters to the extreme foodies we are. You don't get coffee ice cream here, you get Blue Bottle Espresso ice cream. You don't get \"strawberry\" jelly textured sauce, you get \"strawberry prosecco sauce\" made with fresh, local strawberries, and rest assured the Rainbow Sprinkles are all natural- duh. All of this means it's basically healthy and good for you, right?? Probably not but at least it's delicious and you know exactly what you're consuming. \n\nI noticed some people complaining about the price. If you're going to complain about pricing, you should probably just not plan on consuming any food in San Francisco outside of a footlong at Subway. Yes, this city is obnoxiously expensive but I think a scoop here comes out to roughly the same price as your Blue Bottle Iced New Orleans Coffee with Soy Milk...", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Ahh this was so tasty! I got the small 5 ounce TCHO chocolate ice cream scoop and it was delicious. The ice cream is incredibly dense and even though I am nutty pants about ice cream,  I was feeling pretty full halfway through-in a good way of course.\n\nIt's not light and fluffy like gelato, but if you go in looking to satisfy your inner fat kid, the creamy organic freshness will definitely hit the spot.", "author": "Daffodil L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "The creamiest ice cream I've ever had! It's a little pricey -- $11 for a pint -- but worth every penny it you're an ice cream aficionado.", "author": "Tiffany I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "Obviously, you are going to pay a premium because of the ambiance, the creativity, and the literal \"coolness\" factor with its in-your-face liquid nitrogen freezing. But to be honest, the flavor I had tried, mint chocolate chip, was not as good as I had hoped it would be. The mint was too minty and the chocolate was an after thought. at least the waffle cone is worth the add on.", "author": "Chi Shing T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Great made to order ice cream. I thought the flavor selection was interesting and delicious.. The novelty of made on order ice cream is a neat concept.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "Helllllooooooooooo Lovaaaa....I am sooo Smitten! I couldn't just let that one go by, I don't care how many other people may have used that as their opening tag line in their Yelp review. It was a bit much ($5 for some small scoops) however the ice cream itself was delicious. I ordered the cookie dough and it was so good with little pieces of malt heaven. I also had a taste of the creamy vanilla and I will definitely be coming back for that. I LOVED the freezing with liquid nitrogen and how each ice cream scoop is made with love and made fresh. The workers are super happy and excited about their products which makes me excited too. I'm excited to come back and try every single permutation.", "author": "Leena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Came here for a late night dessert run and I must say the inside of this store is super unique and interesting! I got a small salted caramel and it was 5$! The first bite I took was incredible! I can't wait to come back and try their earl grey ice cream!", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Love you.\n\nBit pricy for ice cream but,\n\nI shouldn't be eating you that often anyways", "author": "Whitne Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-04", "description": "Update: Smitten does this thing where they give gift cards to customers who have waited a considerable amount of time for their ice cream. Seems like a great customer service piece... until you haven't received your ice cream yet but the customer who ordered ice cream after you gets their ice cream before you AND a gift card. Then another 5 minutes later you finally get your ice cream but no \"i'm sorry\" gift card. \n\nVery confused about this policy.", "author": "Kat M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "Totally sold, amazing consistency and while limited, awesome favors. My salted caramel ice cream with Cayenne pepper Carmel sauce was a life experience. Please come east!", "author": "Rob B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "absolutely deeeliccciousss ice cream! cant believe i've waited so long to try this spot - though the hayes location was a bit far. we stopped by after dinner at pizzeria delfina, and got one scoop each.. i went for the salted caramel with tcho sauce and my friend the creme fraiche special flavor. OMG. both were presented so nicely, and obviously tasted so creaaaammy and smooth. such a fan!  it's quite expensive - $5.75 for one scoop and one topping, but totes worth it!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Checked this place out on a whim after eating at Fresca. There was a line going out the door, but it moved pretty quick. They do the ice cream in batches so you either get yours right away or are stuck waiting until they are finished with your flavor. \n\nIt's expensive (12.75 for two SMALL scoops of ice cream), but it tastes great! It's expensive hipster food, good for the occasional treat. I still prefer Chocolate Chair.", "author": "E V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "I hadn't been to this neighborhood in a while, so when I saw Smitten I thought: \"Hmm, don't remember THIS being here.\" Turns out, they'd just opened a couple days earlier.\n\nDue to the way they make the ice cream, I was (sort of) only able to purchase one flavor -- so I went with Blue Bottle Coffee. I had it in a waffle cone. The ice cream was unbelievably smooth, and awesomely filled with coffee flavor. Plus. the waffle cone actually added to the flavor of the ice cream... gave it a crunchy, caramel-ly dimension. Definitely recommend eating it in a cone.\n\nI did have a spoonful of my friend's TCHO chocolate, and I liked it. You could taste that it was TCHO (*if you're familiar with TCHO, that is) and like my ice cream, it was very smooth. I'd say that one would be best in a sundae, with other toppings to complement it. \n\nThey had a few other flavors I wanted to try, but (again) due to the small (i.e. individual) batch method of making ice cream, I wasn't really able to do so. That's the one drawback -- you want to try more than one flavor, and you either can't because you can't taste it/can't wait for multiple flavors to be made for you, or you have to wait for each item in a \"tasting flight\" to come out.\n\nIt *is* a fun experience, though. And, all the staff were very friendly. Shop is clean and bright. And, given its proximity to Pizzeria Delfina and Sift, it's like you have a little birthday party on one block. A pricy, sophisticated adult birthday party.", "author": "Tami S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-30", "description": "I tried three of their ice cream flavors - mojito, nectarine and vanilla. Vanilla was the only good one. Nectarine was terrible and a bit too sour. Mojito was too minty and tasted more like a wrigley gum than ice cream.", "author": "Amitesh B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Just came here a couple days ago about an hour before closing. The space is lively, bright, and has a lovely outdoor seating area that must be amazing during the day. Since I came at night, I didn't expect a huge crowd, but I found that there was a line and more and more people came after I did. The service here is truly great: fast and friendly. The best part is that you can actually watch the liquid nitrogen work its magic while you wait. It's an interesting little tidbit that really adds another dimension of fun to this shop.\nI got the cookie dough with pretzels and thoroughly enjoyed it. It was a bit too sweet and didn't have as much of the pretzels as I thought it would, but it was a great option. My boyfriend got the chocolate in a waffle bowl and he said it was great. I think Smitten's chocolate ice cream definitely took the cake. It was slightly bitter from the chocolate but not overly sweet. \nOverall, Smitten is a great place to get ice cream and I will definitely be back for the chocolate!", "author": "Marissa O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "First time at Smitten and the creme fraiche with pear caramal is ridiculously delicious. Caramelized pear ice cream is a flavor I haven't had in years and this hit the spot. Can't say Smitten is my number one in SF but definitely a must when in the area.", "author": "Margaret O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "I came here during an off time - and didn't know anything about it before I went.  It's a cool concept - Made to order with liquid nitrogen - all fresh ingredients - and a cool bootstrap owner story that's worth checking out.  http://smittenicecream.com/story/#slide-346\nThe portions are small and on the pricey side but unique and surprisingly filling.  I do believe this is the cremiest ice cream I ever had.  I'd suggest the Mint Chocolate chip.  They use fresh mint - so it's a strong fresh flavor that has some interesting and surprisingly welcome staying power.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "wow- I didn't know what ice cream was until now. it's so fresh, from the texture, ingredients, and flavor.", "author": "Tiff J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "For the line and price I wouldn't come here that often. Worth a try? Sure if it's convenient but I am more of a Fentons in Oakland or bi-rite in Castro.", "author": "Z C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Visited:\nOn a Sunny October Sunday @ 3pm\n\nThe Wait:\n- 10 minute \n- Menus were easy to read and well organized\n\nBlue Bottle Espresso (4/5):\n- tastes exactly like what you'd expect\n- loved the texture\n- avoid if you dislike coffee\n\nCookie Dough (4/5):\n- fun sized chunks of dough + chocolate. Yum!\n- was melting when I got it\n- pick this if you like sweet chocolate\n\nOther Details:\n- small, neat outdoor area to enjoy the goodies (think small alley space)\n- each flavor has its own station since it is made to order\n- place looks really cool, no pun intended\n\nSmall = 2 mini scoops = $5 \nReg = 3 mini scoops = $6", "author": "David Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "Excellent, smooth ice cream, made to order.\n\nPleasant staff.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "The freshness and flavor live up to the hype. We ordered two sundaes; chocolate and sweet corn w berries. They were bothe so different, but equally delicious. The place was cute, although theres a big draft of wind that rolls through that can distract from ice cream eating.", "author": "Karena H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-03", "description": "I like to leave a cash gratuity but didn't at Smitten California because the guy at the register couldn't say \"hello\" or \"Can I help you?\"---he just stared at me so that was his prompt to give my order. They were out of ice cream cones too so it was not adding up to a good time. I ordered the mint chocolate chip small size.\nThe mint was so overpowering that it left an odd aftertaste for a few hours---not pleasant for $5.00", "author": "Janet P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "This is an interesting concept you order your flavor they take some of this mixture and stir it around a bunch of liquid nitrogen and voilà you have ice cream. They serve four maybe six flavors with a few different toppings and the ice cream is absolutely delicious -very similar to gelato very fine ice crystals smooth and creamy and absolutely delicious we went here twice. And we were only in the area for three days!", "author": "Martine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "I love Smitten. I consider it the best gelato/ice cream you can ever have. Yeah i wrote gelato and ice cream together. I'm Italian and I know how to use the word \"gelato\". And yes, Smitten is one of the most amazing gelato i ever had. Maybe it won't be your no.1 choice, but for sure you'll love it and will be inside your personal top chart. Guaranteed. Ah! And get the waffle cone. Usually the store in California St., SF, has always some of it available. The store in Los Altos, instead, it's always very very short in waffle cones/bowls.", "author": "Marco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Delicious, seasonal ice cream with special toppings that make the flavor just right! They use seasonal fruits and toppings- so for July they had a nectarine, a berry, and I think the traditional vanilla, chocolate, and mint. We got the nectarines and cream with brown sugar and oatmeal cookie crumbles- one scoop with toppings in a waffle cone for about $9. Unfortunately, the way they have the register set up makes it super congested even if only a few people are in the store. They need to move their flavor board so it doesn't collide with people walking up to the register- there isn't a good place to wait and figure out what you want without being in everyone's way.", "author": "Amy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-29", "description": "The good: very yummy ice cream.  I think the way they make it is sort of a gimmick, but my kid loved it.\n\nThe bad:  very chintzy on toppings -- there was a drizzle of caramel.  I want a LOT of caramel.  Still kinks in service -- they served several people before us, who were behind us in line.  A bit pricey, also.  \n\nIt's probably a four star place overall, once they get the kinks out.", "author": "Genevieve B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-15", "description": "Novel (and proprietary) idea, but I'm not too into soft ice cream. The toppings were good, the sauces were stingy and the waffle cones were amazing. Flavors are pretty basic with a few interesting takes. We'll check out the menu when we're nearby but won't be going out of our way.", "author": "Kyle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "The corn ice cream!!  My ultimate fave and also seasonal.  It's been years since I've had it but can remember the taste so distinctively (one of my gfs and l stood in line twice in one visit to take advantage of our favorite seasonal flavor..but that's besides the point lol).  Also we love the waffle cones!  The quality and flavor are definitely worth every single calorie.", "author": "Belle P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-02", "description": "Get there early! What I love about this place is that you never know what flavors are available. There is always a unique and unexpected surprise when you get there. Strawberry and Balsamic, Whiskey Chip, Clementines and cream. They never disappoint, always incredible flavors made to order.", "author": "Kelly P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Only got to go once, since we were vacationing in the area. My hometown has NOTHING like this! Only downside: you can't taste the ice cream before you buy, since they custom make it to order EVERY SINGLE TIME! Pretty novel concept, eh? I foolishly ordered the Bee Sting (I don't do spicy well), i figured with the honeycomb taste, the heat wouldn't be that bad. Boy was I wrong! They told me they will gladly exchange it if u don't like it, but I felt like I ordered it, so it's not their fault. It's a top selling flavor, so for people who enjoy heat, that flavor is obviously a winning combination. Otherwise, everyone else in my family liked their flavors. Friendly staff, and nice displays set up explaining the origin of the business. We would come back!", "author": "Maryanne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Tasty and a fun experience.. Cookie dough with pretzels is my go to. Get it regularly! Not as good as Mitchell's but better then bi-rite for sure", "author": "Jack O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "5 stars for the best icecream I have ever had, velvety smooth and so rich. I didn't mind waiting in a line that went halfway down the block on a chilly Saturday night or the slightly steep price of 5$ for a small cup. The icecream was spectacular and the service was great. They rotate flavors frequently, my friend and I had the fresh mint chip and Tcho chocolate flavor. Both were delicious, there was actual crushed up mint in the fresh mint chip which i enjoyed a bit. I will be going back to try other flavors !", "author": "Vrinda T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Killer vegan Valrhona fudge pops. Will the Brrrista is awesome, totally knows his flavours, and has great pairing recommendations!  He's also known for his scoops.", "author": "Alvin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-13", "description": "A gimmick. Trendy for sure. But gimme a good traditional Ice cream anytime! And where's the sauce?", "author": "jeff s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-02", "description": "Ice cream is delicious, new joint much better than any of the old ones, but music that they play should be forbidden by the law. Techno-pop playlist straight from my sweet sixteen party.", "author": "Marcin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Loved it! They make the ice cream right in the spot with nitrogen. It's pretty cool. I got cookie dough and it was delicious. Service was pretty fast too.", "author": "Julio M A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Pretzel cookie dough was amazing- it takes about 10 min for the liquid nitrogen/stirring but the wait was well worth it.", "author": "Erik P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "OMG...  That says it all.  This is the best ice cream I've had since Lapperts on Maui in 2003.  Husband had the fresh mint and I had cookie dough with brown sugar salted caramel.  Both were amazing.", "author": "Rebecca Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "I love their ice cream here! They use nitrogen liquid so the crystals of the ice cream is smaller and made the ice cream very smooth and creamy. The best part of this place is their toppings such as the spicy caramel. It's one my favorite toppings and I Definitely would recommend. Would come back again!", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "The Ice Cream tastes super good, but I didn't like that I had to wait for 5 minutes, because it is freshly made. I prefer the in n out ice cream stores.", "author": "Anna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Stopped by here after lunch at Pizzeria Delfina. Honestly the best ice cream I've ever had. \n\nTried the strawberry and white balsamic, which was so smooth and flavorful. The chocolate is my favorite here! Can't wait to try the other flavors.", "author": "Davis H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Very nice ice cream. Cookie dough flavor is just the sweetness that I want. Made to order so you cannot have two scoops with one of each flavor. There is only one table inside but many seating places.", "author": "Jiayin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-18", "description": "So I'm really disappointed with my experience here. I ordered 3 small container of ice cream to go. I was told it will take 15 to 20 mins. I come back in well over 20 mins and the employees completely forgot about me. Then the big guy at the register claimed they were almost done. As I sat and waited again, multiple customers came in, ordered, and were served before I was. They really did forget about me, and lied about it after and made me wait more! I sat there for 55mins waiting for 3 small containers of ice cream, you would've thought they were milking the cow themselves in the back alley.", "author": "Hamza M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "Ehh. I thought this place was overhyped and not that great. Yeah it's cool that it's made with liquid nitrogen and all of that, but the quality itself is not anything to rave about. It is very creamy but that is about it. Nine of us came here on a Sunday evening after eating next door at Pizzeria Delfina and there were four options to choose from. I opted for the Nectarines/Peaches and Cream (I forget which one it was) with the recommended topping on top which was the pie crust bites. I ordered the smallest size and it was plenty for me, but it didn't taste good at all. It tasted like cream cheese. My sister and aunt ordered the same thing as I did while my dad, brother, and two cousins got vanilla. The vanilla tasted much better than the flavor we ordered. I would much rather go to Bi-Rite or the Ice Cream Bar instead of this place. It wasn't worth the wait in line and frankly, it wasn't worth the price.", "author": "Zoe Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "Truly smitten by the creamy and fresh ice cream. Do try their salted caramel flavour.", "author": "Niloy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Nice little ice cream shop. Good variety of flavors. I really liked the cookiedough ice cream with pretzel and chocolate chips. Ice cream is creamy and smooth,  happy i happened to be in the area and could try this ice cream shop. The neighborhood itself is a little skimpy, so i don't know when i'll be back.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "If you've only been to the Octavia location then you are missing out on some of the additional flavors they have at the california street location. I had the blood orange flavored ice cream with pistachio nuts and I am definitely going back just for that. Its not too sweet and the nut pieces add a delectable crunch to it. One of the best ice creams I have ever tasted!!", "author": "Satya G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "As an ice cream fanatic, this place was terrific! I got a Sundae and it definitely hit the spot. It's a fun alternative to the usual spots (Mitchell's, Bi Rite,etc.) and just as good.  However, the flavor list is quite small and the place gets very crowded. If you are looking for unusual flavors, this is not the place.", "author": "Molly B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-24", "description": "Came here with my daughter and what a terrible experience we had. Waited at least 15 minutes for our ice cream. Mentioned it to the employee and no apologizes at all. What is worst is that I had forgotten my sunglasses and returned back into the store to find out that the owner and employee where laughing at my situation. Very unprofessional will not be coming back.", "author": "Lindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Absolutely delicious.  It was extremely fresh and the fact that it's made to order gave it even more of a delightful experience. Totally recommend this place. It's even VEGAN friendly.", "author": "Andrea A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "Very good ice cream, chocolate and salted Carmel were my favorite. The mint wasn't very sweet and the cookie dough was good but not super good. Very creamy. It's also super expensive but they make it in front of you.", "author": "Rebecca A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "They just opened and it's a pretty good upgrade from their little stop in Hayes Valley. There are a few kinks in the system, but they're working through it. The employees at the front counter are friendly & super sweet. Some others kind of are a bit morose but can't win 'em all. :)\n\nTHIS IS MY FAVORITE ICE CREAM. My gawwwwwd- the texture. This is *ice cream* at its finest. This is NOT gelato. This is NOT yogurt. This is NOT italian ice. You cannot compare it to other stuff because it's in its own world. It's creamy as all hell and it's pretty rich/thick. I'm a big fan! It's worth a try. Not everyone likes it (lame.) but if you're into some serious ice cream and have a palate for flavor this is the jam. Nectarines & Cream is so good. The flavor is just saturated through every bite. I'm a big fan of ice creams and make my own at home, and the texture is just too good to pass.\n\nMy friend is dairy free and she goes bananas for the vegan pops!!", "author": "Reanne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "Without a doubt, the best ice cream I have ever had!!!! I live 80+ miles away and will probably drive it just to have ice cream soon!!", "author": "Bob J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "This place was great! Not a whole lot of selection (but the flavors they did have were delicious) and a little slow (but that's because they make all the ice cream fresh with liquid nitrogen). The whipped cream was soooo good and may have ruined other whipped cream for me.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "In the highly competitive ice cream market, gimmick seems to go miles. In this case I was fearful that the gimmick of live mixing of fresh liquid ingredients along with liquid nitrogen was going to overshadow the quality and taste however to my surprise, I was wrong. The flavor/taste, consistency and quality of my salted caramel with cookie dough topping was truly A+. It's well worth the wait.", "author": "Jonny M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "I love Smitten and now I love it even more that it is closer to my work. This could be a dangerous combination. I could barely wait to write my review on this place. 5 stars for sure.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-12", "description": "This is a boutique ice-cream place, you can order the flavor and watch the ice cream being made, for kids it was exciting, thrilling and fun! The place is very trendy looking, and the workers are so friendly!!", "author": "Iqbal N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-17", "description": "First trip here - probably our last.  The ice cream is good, but they completely forgot about our order and served well over a dozen people before us.  Don't need to wait 20+ minutes for ice cream after we've ordered it", "author": "Cameron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "An absolutely adorable ice cream shop that perfectly blends the feeling of all natural, fresh ingredients and science to create their exotic concoctions.  I've never been a big fan of mint chocolate chip ice cream- the green color seemed fake and the chocolate was never that good.  But the mint ice cream here tasted like fresh herbs from the garden and the TCHO chocolate chips and chocolate sauce complemented it perfectly.  Add liquid nitrogen and it's fun to watch being made and to eat!", "author": "Jacqueline Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-08", "description": "$5 for a small scoop of ice cream. Yeah it's creamy but it's not like it's extraordinary.  Plus the fact that they only have six favors to choose from is not extensive.  I hate the fact that the regular size gives you three small scoops and they won't let you mix flavors.  Next ice cream shop please.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Excellent flavor and creativity. Strawberry white balsamic! They also have guarantee that you'll like it or you can get a different flavor.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Creamiest ice cream on the planet. Fresh, organic ingredients and small batches make this liquid nitrogen ice cream shop a destination to indulge in daily. Try the brown sugar caramel and seasonal nectarines and cream flavor. Amazing. Smitten will be the reason the liquid nitrogen ice cream fad lasts.", "author": "Katie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "Probably the best ice cream available in SF. Go big and order one of their sundaes. Epic!", "author": "1 D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "About the wait: The line was out the door, which prompted some in my group to encourage us to go elsewhere. But I've been curious to try this new ice cream shop for awhile, so I wasn't going to budge. The line wasn't too bad- less than 10 minutes in line, plus a 10 minute wait, on par with Loving Cup on a busy night. \n\nAbout the service: Benadict was super patient as we all placed our orders. Seems like the employees were all busy, but happy to work there.\n\nAbout the place: It is fairly small, but you can find a place to wait and have your ice cream inside. Otherwise, it's location at Fillmore and California allows you to go for a nice stroll with your dessert.\n\nAbout the ice cream: The wait here was so worth it! The flavors were amazing, the waffle cones were the best I've ever had. No dessert guilt here- they use fresh ingredients and I didn't feel gross afterward, like, \"Blah- why did I just eat that?!\" In fact, I've already picked out what I want to order next time. They change the flavors regularly, based on what is in season, so I think I'll be back very, very soon as all of the choices tonight sounded amazing. Great job, Smitten - you have a new loyal customer!", "author": "J K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Not a huge fan of vanilla ice cream but it was so yummy! They did run out of the cookie dough which was a bummer, but it was still good. The best part is that it's organic! Will definitely be back!", "author": "Oksana E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Wonderful little ice cream shop.  Their blood orange ice cream is simply the best - it was a limited time flavor when I tried it, so hope they keep it around for others to try!", "author": "Josh Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "Recently opened at this location. On opening night, got blue bottle espresso ice cream with TCHO chocolate on top. Super rich and creamy. Highly recommend!", "author": "Sarah V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Overall, I'm a big fan of Smitten. \n\nDelicious. The whole nitrogen thing makes a really smooth ice cream. You can tell it is made with fresh ingredients. And the cones are fantastic. It's not cheap, but in comparison to other places in SF, it's not overpriced either.\n\nSmitten also has  fun vibe going on and is very clean. The one in Pacific Heights has a nice little outdoor area, as well.\n\nToday when I went, they were definitely having some service issues and they ended up messing up my order a few times. You could tell they were sincerely sorry and I appreciated how the staff went out of their way to correct everything. However, when my friends and I walked into the little outdoor patio area to eat our ice cream, a woman was painting a side of it and rudely told us that she \"needed to work...\" and that we needed to get out of the way. After waiting 30 minutes for ice cream, I was a little mad about being shooed out.", "author": "Lynn A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-07", "description": "Really disappointing!!  I walked him this afternoon really excited for some delicious ice cream.  Sadly, thanks to shockingly bad customer service I just walked out a frustrated customer.  At five dollars for a small serving you think they would try to show some \"appreciation\" for their customers.  It probably took 10 min. for my ice cream - and not because they were making it or there was anyone in front of me.  Two of the \"baristas \", as they call them, were happily chatting with each other.  The guy at the counter was spending more time chatting up a girl he found attractive than taking people's orders.  A couple of us stood there for 5 min. - with not one bit of activity relating to making our ice cream, no nitrogen being injected into the mixers, no mixers spinning, no one pouring anything in the mixers.  They were all too busy not doing their jobs to make some ice cream.  Bring on the robot ice cream makers!!", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "I happened across this ice cream spot on a recent trip to SF. The foodie snob that I am, I needed to check it out. Ice cream is made right in front of you with ingredients that you can pronounce. It's the craft beer of ice cream! So delicious and creamy and not too sweet. Check it out!", "author": "Robin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "A ridiculous, expensive gimmick with too many \"rules.\"  First, my ice cream came out of large mixing container that had been made some time ago.  They don't \"make\" your actual ice cream while you are waiting.  Second, you can't have toppings on a cone.  Why?  You wait at least 10 minutes for the inefficient staff to scoop your ice cream.  Our server was trying to use a flimsy plastic cup to hold a waffle cone while he tried to add a second scoop.  Ever heard of cone holders?  Smitten people, try checking out a Baskin Robbins.  The ice cream... OK but not worth the wait or the price.", "author": "Bill S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "So I hate chocolate ice cream but the the girl working the register recommended it and I decided to follow her advice. The ice cream, service and overall experience was A-1.", "author": "That Dad Life -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-27", "description": "The ice cream here is SOOO delicious! Pricey, but worth it :). Yum!!!", "author": "Steph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "liquid nitrogen cold temperature = the smoothest, richest ice cream ever.  simply, the best chocolate ice cream in my life, and I doubt I will run into something better.  try it, you'll probably agree with me.", "author": "Akir M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-17", "description": "One off my check list. The ice cream texture is very smooth. I really like the Strawberry white balsamic flavor. Overall experience is good, but I thought it's a bit  too creamy for me, and the waffle cone is too buttery.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-29", "description": "Ice cream was aight, but bit so hard into a pistachio shell I practically cracked my tooth in half.  1 star for not covering the basics.", "author": "Click C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "YUM! Get the mint choc chip. So unbelievably good and actually tastes like real mint. Only downside is that they change their flavors constantly and came here the other day craving it and they weren't serving this flavor. Also, for the people complaining about the price - yes it's expensive for an ice cream cone but you're paying for a fresh batch of literally made to order ice cream. If you're looking for a deal then go buy a cheapo pint across the street at Mollie Stones. This place lives up to the hype.", "author": "Alexis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Fantastic.   I am not typically \"Smitten\" with gimmicks, however very good.   The mint is very authentic and fresh.  Wait staff very nice.", "author": "K C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "Ridiculously overpriced, takes a really long time, and you don't get much for your money. The chocolate and salted caramel are good. The strawberry white balsamic tastes like tangy frozen yogurt and I did not like it. The mint chip tastes like water that has a fresh mint leaf in it and has some how been made into ice cream - very watered down mint flavor and can't really taste the chocolate chips either. The waffle cones are good. Except for the chocolate and salted caramel, I wouldn't really call the texture creamy. More like airy. Overall, not my favorite ice cream but it's the only ice cream in this hood.", "author": "Holly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "AMAZING choices and the freshness is very nice! Expect to wait in line for a period of time, but when you get it, it's worth it!", "author": "E S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Great ice cream, very creamy and  smooth. It was very cool to watch them make it with the liquid nitrogen. We had the cookie dough and the tcho chocolate, both were awesome. Overall good device and just a cool place!", "author": "Annie P."}
