{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Walking into Spec's is like time-traveling back into the days of the Beat Generation. Come here to drink a pint of beer, browse the antique photographs, and converse with 1 or 2 regulars who most certainly can tell you a tale of old San Francisco.", "author": "Cody W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "This was the second bar on a night of wandering. It was recommended by a bartender from the first bar. She described it as \"a cool weird spot\", so curiously we wanted to check it out. The place is filed with various quirky decor, dimly lit and offered a mixed crowd. One of the bartenders had a nice heavy hand when making the drinks. Cool different place to check out.", "author": "Claudiana C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "We were introduced to this place on a guided tour. It was a fun atmosphere with a ton of interesting stuff to see and me and my group of friends  were enjoying ourselves until the owner of the bar decided to tell us essentially we were being too loud and that no one else was able to enjoy their time. I would never go back just because of her, she was beyond rude and unwelcoming. Not to mention we ran into her at another bar where she continued her rudeness, and attempted to have us removed from there. So I have to say overall it was a horrible experience! If I could give no stars I would.", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "No! Walk away as you stand there thinking that this might be an interesting experience. It's not! Save your money and your time.", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Specs is a quintessential San Francisco bar and a must-visit on any traveler's itinerary.  It's conveniently located across the street from City Lights Books... In the Beat Generation neighborhood in North Beach.\n\nThis is a place that you can visit with your friends and not be distracted by televisions, sports or overly loud music.\n\n The decor is wonderfully San Francisco rustic - lots of memorabilia and curiosities to entertain the eye.  Check out the supposed whale bone behind the bar.\n\nIt's an easy, comfortable place to go to by yourself, and strike up a conversation with some of the regulars, young and old.  \n\nThe bartenders are welcoming, responsive and generally easy to talk to.  During our visit, bartender Tony immediately engaged is with a smile, a well mixed cocktail delivered with the latest if his jokes.", "author": "Patty S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-29", "description": "It feels like you are waking back into time when you walk into Specs. It is really old and you can marvel at all the memorabilia on the walls.  It feels like you're walking into a haunted house when going to the bathrooms.  I've often seen women take a wrong turn into the guys room due to lack of signage.  I enjoy the $4 draft beer which is available all the time. See you soon Specs.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-31", "description": "This was a cool place to hang out.  Located in North beach, very accessible and surrounded by many other bars and restaurants. The space inside is nice and was pretty busy on a late Wednesday night too and that says something! We just got drinks here and it was a fun time. The interior is very interesting giving it a nice dive bar feel. Some of my friends think it's one of the most fun bars in the city! They had a good selection of drinks and the bathrooms were not terrible so that was a plus. \n\nWill hang out here again and recommend it to all !", "author": "Shivani B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "I've only been here once and I was very disappointed.\n\nIt looks quite cool and the decoration is all weird and fun. It's the kind of bar I would usually love, but the drinks were terrible. The gin & tonics were awful. \n\nSo, unfortunately I have to give it three stars, and that's just because the place looks cool.", "author": "Marta F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-03", "description": "I came in there for the first time and was laughing with my colleagues and got asked \"be quiet you're being too loud\" followed up by a rude man asking me if I'm leaving. They also handed me a card that said \"the gentlemen prefers to sulk in silence\" on my way out. Horrible etiquette and not the way to treat paying customers. If 0 stars were an option it would be the choice. Posting the picture of the card in addition to this.", "author": "Nick D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-03", "description": "A group of friends suggested me to go here as it's a hidden traditional gem bar, in the middle of a fairly touristic neighborhood.. and they were right!\n\nThe bar is really cool, with unique decorations. You can get lots in looking at all the ephemera on walls and ceiling! \n\nThe night I was there a guy was sharing watercolor and making art, inviting guests to join and help him - and it was so much fun. \n\nBeers are cheap. A great bar to hang!", "author": "Martina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "Just moved to the area and was looking for Guinness on tap.  Wandered into the bar and was ignored for 10 minutes.  Other people came in after and were served.  Finally a gentleman who was on break served me - no apologies and little acknowledgment - just a scowl.   Pardon me for being new to the neighborhood.  Likely won't be back. Not a friendly place.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-02", "description": "3.5 stars\n\nWell drinks come in a small ass glass that's gone in about five sips and at $7 what is up with that? \n\nCredit card minimum is also $20 so that's a bummer but they do pitchers for beers\n\nSeating is good towards the back for larger groups \n\nHidden spot off the beaten path despite it's close proximity to Devil's Acre \n\nOverall Thoughts\n\nI really wanted to like Specs with all its charm but the price point makes it hard to be a go-to spot", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Yo, this is like a crazy blast from the past type of place... the music, the decorations, the people... I drank some beers and ate cheese and crackers. I would go back again. Cheers, friends.", "author": "Lewis G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Anyone who gave this place less than five stars is out of their mind; decently priced draft beers and so many interesting characters. This dive bar is the epitome of non-gentrified SF. Read about the history of this place is you need further convincing.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "The SF everyone says is dying, dead and gone lives on forever at Specs.", "author": "Sally R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "Congratulations to Spec's on its legacy businesses status and the new 10-year lease. I strongly believe North Beach would be missing something special without you. \n\nWhile by no means my regular watering hole, I appreciate that it's such a neighborhood stalwart that you can stop by no matter how long between visits, and still feel lost in time - like nothing has changed. No nonsense, straight forward, classic bar with the occasional tune on the old piano in the back, Spec's makes a great spot for a low key post-work happy hour. Check out the tchotchkes. The nostalgic charm of the place is a bonus. Also love the humor and attitude of their sandwich boards.\n\nSpec's new lease keeps the spirit of the Beat poet movement alive along with Vesuvio and City Lights Bookstore that give North Beach much charm. Cheers to 10 more years!", "author": "Jon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "White Russians, crazy crap all over the walls, plastic bins of Ritz crackers and partial blocks of cheese, cash only.\n\nThat about sums Specs' up. \nThat and it's just perfect. \n\nOn a Saturday night my party of 7 was able to snag a large round table, several plastic bins of Ritz and cheese, and round of white Russians in mere minutes of walking in. It's dark interior is offset with what is clearly some very colorful history at this local dive. A total win and the first of many visits for this gal.", "author": "Candice G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I've been a patron at specs for 20 years it's my favorite bar along with the Saloon over on grant Avenue in North Beach.  Always an interesting crowd and pretty much absent of pretension, great bar staff.", "author": "Bruce Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-10", "description": "Note:  for first timers - cash only (ATM inside)\nI met a friend here that I hadn't seen in 35 years, and I was so pleased he picked this spot.  Hate to call it a dive, but let's say, rustic San Francisco.  Fun, fun place to throw back a pint or six or be a hipsters and go with a $3 Hamm's.  Either way, you won't be disappointed.  Actual comment from another friend of mine from San Francisco \"OMG - Spec's - I went there YEARS ago - so much fun!\"  Well, it was apparently fun then, and it's definitely fun now.", "author": "Patrick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Cool place to get a drink. Love the decor and the laid back atmosphere. Would def come back.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "Dark, divey, gritty, musty, & cluttered.  \n\nThat's just all a part of its particular brand of charm.  \n\nIf you want hipster, this isn't your joint.\n\nIf you want old school, then it is.\n\nLoaded w history, culture, & artists, Specs' is an institution, both the bar & the man!\n\nI met Specs (Simmons) back in the 90's, & 2 things were constant...\nhis looming presence, & his love for the ladies.\n\nToday, he doesn't get around as much as he used to, but his love for the ladies is still going strong.\n\nConveniently located right next to Tosca, & right across the street from City Lights Books, a stop here is a must for any local, artist, neighborhood newbie, or tourist.\n\nIn other words, \nanyone.\n\n4 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-15", "description": "My boyfriend, a friend, and I visited on a Tuesday evening and were able to grab a table and quickly order drinks. The bartender was friendly and the prices were unbeatable. (He also had a heavy pour!) This is my kind of bar, all the way: no frills, cheap drinks, good people.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "Specs' is a local legend. Stocked with every conceivable oddity, this museum of eternal ephemera is brimming with lovable grumps and local legends. The cheese plate usually sucks - so consider yourself warned. Unless you love stale saltines and wax-on gouda. Hey, I'm not here to judge. \nUsed to live just up the hill from this place and worked right across the street at City Lights, so this was on my evening itinerary quite often. \n\nSpecs' is a quirky character of a bar. Enjoy the weird appeal and do try to learn something from the odd exhibit of artifacts. There's actually a lot of interesting SF history in there.", "author": "Carole B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Stumbled upon this hidden corner bar, just what we were looking for. Easy going, eclectic ambiance and great people watching.", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "This place is incredible. Amazing vibes and really great people. Rich with history. Kind and friendly bartender. It's a must go! A well kept secret. Only for the best of people :)", "author": "Hannah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Cheap drinks, colorful patrons, salty bartenders, and plenty of cheese & crackers for the table. These are just some of the reasons why Specs' remains of of my favorite (cash-only) dive bars in North Beach.\n\nI used to frequent this bar a lot back when I lived in the hood 15-years ago. Located across the street from City Lights Bookstore, this watering hole really transports you the SF of yesteryear (if that's a word). I'm pleased to report that 15-years later, Specs is still the same. Nothing (and I mean NOTHING) has changed about this place. The gruff bartenders still give you dirty looks if you take too long to order or request a frou-foru drink. This place is strictly beer and hard booze, folks. If you want a fancy-schmancy Cosmo or Apple-tini, go to Tosca's next door.\n\nMy group of 7 and I squatted at a round table last Saturday night. We nursed a bunch of White Russians and Fernet, while nibbling on blocks of cheese. There's plenty of people-watching to be done at Specs. And by that, I mean there are a number or irregular regulars (everyone from Beatniks to hipsters to borderline hobos). That being said, everyone seems to play nice in the same sandbox.\n\nIf you're looking for an authentic North Beach experience, do yourself a favor and mosey down this little alley way for a pop. You'll be glad you did.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-14", "description": "If you're in the neighborhood and in the mood for a little bar hopping, I'd recommend visiting both Vesuvio and Specs!  Specs is across the street from Vesuvio.  Both are really unique; much different from the other club-like or upscale bars in the area.  Down to earth, gritty and historical.  Just don't ask for a martini here!!  They don't like to make martinis.", "author": "Poppy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "Love this local bar next to Tosca cafe. This was a welcoming change after escaping from the noisy Tosca cafe Friday night. When I walked in, I was overtaken by the quaintness of this cozy bar. this place has so many eclectic items collected from all corners of the world, neatly spread through the walls, in the cabinets, from the ceiling, without cluttering the place.\n\nEven though this place didn't have my usual requirements of good wine/cocktail, I still was happily sitting on the stool, sipping some water, and feeling happy to have been taken to such a cute and low key joint, unbeknownst to the hipsters next door.", "author": "Rebecca C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-03", "description": "Violent?\n\nI have been coming to Specs for years. I had always loved going there as it was a little hidden gem in that tourist ridden area.   The last couple of years, the clientele has changed a bit.   After a long night we ended up there on New Year's. I ran to the ladies room as they were yelling for last call.  While I was in there I could hear two women verbally and physically abusing another woman and could tell it was getting violent and racial.  As I was stepping out a man walked by the ladies room and the women jumped him.  One started hitting him and the other knocked him down the stairs.  I'm not going to lie, I got around it as fast as possible.  I ran and told my husband.  He saw the guy come flying down the stairs and was trying to help him. We tried to tell the bartenders but they were more concerned with kicking everyone out.  We waited outside to see what was happening.  The man who had been attacked was trying to call the police and waiting for her to come out.  The bar managers kept saying they wanted nothing to do with it, even though it happened right in front of them.  The woman in the restroom who had been getting attacked prior to that came out and started telling people what happened as well.  She said that the bartenders were not letting the attacker out as she was \"afraid\" people were waiting for her, and they were trying to let her out the back door.  When people started knocking on the door, the bartenders said that it was not their responsibility that these people were attacked there and they would have to handle it themselves and they let her leave without calling the police.  My husband is a lawyer and quickly grabbed the two people who had been attacked by her and gave him his card.  He does not practice this kind of litigation, but we have friends who do.  He told them because this was happening in the bar during the hours it was open it WAS ABSOLUTELY their responsibility to handle it.  Yesterday we heard from the gentleman who was pushed down the stairs, and he went to the hospital with a concussion.  My husband put him in touch with another lawyer, and apparently he is looking at suing the bar for damages.  There are so many great bars in the area, I'm thinking there are others I can go to where if something like this happens, bar management will get a handle on it. I was shocked at how badly Specs let this escalate.  Not a great way to see 2017 start. We won't be going back.", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "To hell with Rice-a-Roni! Specs is the true San Francisco treat! A historic dive bar with its history hanging on its walls...Consumer Warning: if dive bars aren't your thing, stay away! More info on the man and the bar:  http://m.sfgate.com/bayarea/article/Bar-and-Grail-Since-1968-Specs-Twelve-Adler-2827944.php", "author": "Steve T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Great atmosphere and great service. Good old fashioned bar you can't find anywhere else in San Francisco.", "author": "Josh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "I usually end up here in combo with visiting Vesuvio across the street. Spec's tends to attract a more eclectic crowd that's great for a long, fun conversation. It's darker, divier, and even more crazily decorated.\n\nCheck it out, grab a pint, and do some stranger chatting.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "Very cool and relaxed divey place. Enjoy coming out here but I just wish it wasn't cash only.", "author": "Ingrid O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "I've visited Spec a few times and like the low key vibe. I prefer beer over cocktails and was happy with their selection. They're reasonably priced. I like the fact that the noise level is moderate so you can have a conversation. Definitely older crowd. There's lots of cool curios to check out.", "author": "David F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "A+ dive bar tucked in an small side street just off Columbus. Feels very old school SF. I came here to play board games with some new friends. It was quiet enough that we didn't need to screen and loud enough that I wasn't worried about other people listening in. I wasn't drinking that night, and the barkeep gave me my coffee for free. Will definitely return if I ever have need to be in the weird nether regions of Chinatown/FiDi/North Beach. \n\nThe point is, it was a good bar in a weird spot. Or maybe it was a weird bar in a good spot. Either way. Go.", "author": "Allison S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "A great locals joint! A good look at old San Fran. The wheel of cheese is pretty cool.", "author": "Jill J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "Specs' is San Francisco.\n\nSince 1968  - Specs' (named after the owner Specs Simmons) has seen a vast array of poetic and bohemian characters pass through their doors.\n\nEverywhere you look around Specs' there are stirring pieces of history or creativity which sing of San Francisco's diverse and rich history. And it's real too. Specs' has always been just a quirky and magical haven in the North Beach. It never had to try or court the San Francisco scene. The scene came to it. \n\nThe warmness of Spec's vintage lights  highlight the art that is showcased and which unfolds here. This past weekend - we sat in the back  - and I watched as two remarkable artists became engrossed in the energy of the place and just drew. Right behind them was an old piano - which I heard comes alive on certain nights accompanied with stirring live music - which further awakens this unique space.\n\nOld Folk music crooned throughout the place as I sipped on my hot tea (yes, tea) here. I kept on warming my hands on the hot glass full of soothing lemon - as I glanced around the room full of conversing patrons and beamed.\n\nThere was no top 40 stuff being belted through the space.\n\nNo one was wasted or stumbling to the bar.\n\nThe bartender was lovely and refilled my hot tea water throughout my time here.\n\nNot only does Specs feel beautifully right - but it's just always been right.\n\nTrust.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Hidden gem of a bar in north beach.  \nIt's a locals sort of place and there are stories in these walls.... And on the walls. \nA strange nautical theme of sorts and your odd stuffed armadillo on the wall. \n\nGood stiff drinks here, it's cash only and I don't think there is an atm access... \nYou can get Dutch cheese from the wheel and crackers though...", "author": "Greg F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "This weekend, I totally raided a Santacon party. While I wasn't all dressed as a Santa, I got into a festive mood and dressed up. I hit North Beach up looking to meet up with my friends. My friend Jaime recommended this little pub in an alley and we headed off to Spec's.\n\nWe get there and it's filled with Santas. At the door, I'm given a \"Nice\" sticker. Hehe, I'll take that because even my Naughty is Nice and it's fun to play along. Oh what fun... \n\nIt's Cash only and kinda divey, we were able to find a table in the back and have a little fun before I had to run off to dinner. Fun little place that I will keep in mind to return to again.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Dive Bar, Speakeasy, Social Club, Funky Hangout...whatever...\n\nSpecs' is a great spot tucked away next to overpriced Tosca and across from City Lights.\n\nWarm, friendly, humble, cozy, divey...all words that come to mind when thinking about Specs.\n\nCheck it out as a great start to your tour of North Beach...or a great spot to end it.", "author": "Jim W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "Been going to Spec's for many years but no more.  Had 1 shot and one beer  THIRTEEN DOLLARS AND FIFTY CENTS!!!  Bitchy bartender says they raised the prices 60% \"to keep the place open\".  Too bad Spec is not still alive.  Used to be a fun place but now too expensive and sure don't want to go someplace and have the help argue with the customer.", "author": "R B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-18", "description": "4:30PM.. I guess it's almost 5 o clock if you round up.\nMy friends and I try to find a bar and stumble upon here.\nIt's completely dark.\nI find the bathroom and trip on the way out. I wasn't drunk yet, and the bathroom is extremely clean (note: bar just opened up).\nThe bartender looks like Albert Einstein.\nMy friends and I spent a good hour just looking at all the crap that was everywhere.\nMuseum, indeed.\nGot a shot of Jameson (it's St. Patty's Day after all) and an Anchor Steam beer each.\n14 dollars per person. Cash Only\nNot sure if that's cheap.\nAs a bar: 3 stars. As a random hole in the wall museum that serves alcohol: 5\nRegretted not sitting at the bar, Einstein looked like an interesting person", "author": "Trang B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-13", "description": "This god-forsaken dive bar not only reeks of rotten fish and homeless elderly folks, but it would be generous to say that its patrons are even remotely that clean themselves. Let alone the bartenders and staff. It would be safe to assume that none of them have ever experienced one moment of happiness in their entire lives and god help you if you let them see you smile. If you so much as toast with your friends, laugh out loud at a good joke, or even make an audible noise while sipping your bud light (surprisingly there is more than PBR here) then satin-esk bartender will screech at you like a fucking demonic vulture to cease your drunken revelry. \n\nIf you're into misery and uptight \"hipsters\"- this is the place for you.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "This is my home in San Francisco. I've spent a lot of my trips trying to find a bar with some soul & history. This is the real deal. Staff is great bar is great. This is a one of a kind place you must visit while you are here. There are a lot of new bars opening up that are loosing what was great about the city and this is coming from a guy like me in my early 20's. Love this place you will too.", "author": "Travis W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "In utero my beating heart was so so driving, urging, really. That maddening creciendo has always pounded on, even after the birth cavity; through bicycle-skinned knees, first kisses and last hugs; through, I think, a confused and utterly mesmerizing emotional trip. Clud ump clud ump clud urumpm, with slight irregularity as if to suggest something more is coming. Yes, I know, as we all do, that coming and coming is inevitably death. But, there are moments in life when the beckoning hushes and we truly rest. Mine, it just so happens, has seemed dullest while drinking whiskey, eating cheese, and reading random postcards in the hull of the mighty ship, Specs. The anti-utero, and plain-ol good joint. \n\nI haven't been back in 6 years, but I have written postcards to myself, sitting there six years ago. And to others, sitting there now. No stamps or pen to paper, but long mental reaches through time and space to peaceful sippers, sipping silently, quipping over the hugeness of it all. Or just getting sh$-faced on toddies.", "author": "Mattech S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Great place to get away from hipsters and tvs. Interesting people and atmosphere.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-19", "description": "(from Nov 8 visit)\nPopped in here for a quick break with a friend before heading to dinner. Didn't have a cocktail - just club soda with lime - so I can't say much about the vibe. It was $4 for 2 nonalcoholic drinks, which seems a little high, but hey, it's SF, what are you gonna do?\n\nCash only here.", "author": "Corinne L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "Just don't come here when the feminist bartender is here and you have to hold your tongue (hard to drink and have fun that way). Also, Anchor Steam is $6.\nOtherwise, great place.", "author": "Mag N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "A really super cute place for a quick drink. A quirky dive bar in the city - a great place to bring friends and visitors. Will be back.", "author": "Fi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "I've been coming here for nearly two decades.  Specs has always been a safe haven for locals like me.  Specs has been the spot for several great, memorable night's out with friends and family over the years.\n...but tonight I was asked by the bartendress to \"please quiet down\" as other patrons were complaining that my table was too loud.  She actually shouted at me from behind the bar.  Several hours later, I am still stunned.\nI apologized to said patrons on the way out.  They were nice enough, but WTF?", "author": "Deb Doran D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "I mean, how cool is this old school place??!! \nBelieve it or not, my pops frequented this dive back in the 60s and it was his favorite place. It's got character, but it has probably survived bc it's right off the main st. Edgier local crowd, but that makes it even cooler, right?\nDon't forget the chess boards if you feel the urge. \nPersonally, I stayed after the first beer bc the anchor steam is ridiculously smooth and creamy-- you won't find this east of the Mississippi. \nCash only, novices.", "author": "Aaron S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "40/50-somethings love this place! \n\nSpecs has an older crowd and might not appreciate you and your rowdy group of young men coming in for a birthday - someone who looks like George Costanza asked the birthday boy to tone it tone. His crime: laughing. \n\nAside from this element, drinking inside Specs feels like drinking inside a museum. Which is completely rad. You can really feel the history inside this bar. \n\nThis is a very San Francisco experience, grumpy beatniks included. I know, guys - those young whipper snappers, I tell ya...", "author": "K M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-12", "description": "Terrible attitude from the staff. Told us to be \"more quite\" we weren't making a scene. \n\"Stop banging on the table\"", "author": "Maria D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "A North Beach and SF institution.  Classic old style bar with lots of talking points on the walls, the ceiling and in the bar..  It is not a dive bar, if you think that you probably have never been in a dive bar, but it is a living bar which is warm and fun to have a beer or two in.", "author": "Des D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-01", "description": "Great gem in San Francisco. Wandered nj while waiting for our city guides tour. Has awesome ambiance and a good selection of beer, wine and spirits. \n\nQuintessential San Fran.  I'll be back.", "author": "Rebecca B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "Yes, Yes, Yes. \n\nWhen I went to college, I one day got the idea that I wanted to find my school's treasure trove of artifacts. Surely, like in Indian Jones, they had a basement or attic somewhere on campus filled with pirate doubloons, ancient marble tablets and -- here's hoping -- the arc of the covenant!\n\nI did find the school's trove and it was cool -- filled with mostly shards of classical societies' pottery -- but it was nothing like I'd hoped for.\n\nFast Forward 10 years and I stumble in Spec's Twelve Adler Museum and Cafe. Thank you Spec's for filling the gap. Your walls are a dense rainforest of the archane and obscure: Egyptian sarcophaguses, stuffed mongooses attacking stuffed cobras, and god-knows-what else you have makes you the bastard child of the British Museum, Ripleys' Believe-it-Or-Not. The Museum of Jurassic Technology and a plain-ol' fun bar.\n\nThe night we were there, an artist had taken over the back, presenting hundreds of napkin-artworks. I bought him a beer (he wanted a Foster's in a big can) and a few minutes later he surprised our table wtih a crude sketch of all of us.\n\n++ points fo supposedly being a favorite bar of the Beats.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Creepy Cool! Awesome spot to eat stuff, drink stuff, and soak in that Voodoo spirit.\nA stones throw away from your friendly neighborhood beat spots", "author": "Mo R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "Closed the place out.  The bar tender was super fuckin' sweet and a nice to us, probably because we're so super fuckin' sweet and nice!\nThey have no parking lot.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-06", "description": "This is one of the best bars in San Francisco if you like the dark literary place that has a strange collection of art scattered about its weathered and vaguely nautically themed walls.  \n\nThey talk about the beat poets a lot in North Beach, but maybe the only bar in North Beach that the beats would've pounded some gin in, is Specs.  It's not a large place, but it's so nicely spread out that you feel alone, even when surrounded by people.  A great place to have deep conversations or romantic banter. \n\nThe kind of bar that keeps San Francisco cool.", "author": "daniel f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-25", "description": "Oh Specs how i miss you when you looked a little more dingy on the outside! I totally loved going to have some of the best martinis and cosmos (before they were cool) of my life. And cheap too! So many times have I been there and been so buzzed with glee that i didnt mind if the male friends of the group wanted to partake in the Broadway activities. \n\nHell it was the first bar I took my sister to! I remember that night vividly. The bartender was some old sailor guy with one of those voice boxes. Plus he had a heavy hand. It was kind of rad. Too many fun times.\n\nI must say, as i passed there a little bit ago its kinda bright outside at night now. Its almost like you aren't my dirty little secret! But i still love you specs! See you soon!", "author": "Amanda J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-15", "description": "Great place. Cheap drinks, a bit small. great view of the hood. Not much more to say! total place for locals!", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "A co-worker took a group of us here for after-work drinks. At first this venue appeared to be just another hole-in-the-wall, but after spending some time there, it was clear there was something more to this place. \n\nThe patrons are interesting - like straight out of a storybook interesting. I swear I saw Jack Sprat (who could eat no fat) and his wife. And I may have seen the woman who lives in a shoe and the man who lives in a crooked house. And they are all friends. I seriously looked up a few times and thought I was onto something like perhaps I was in a scene of that show Once Upon A Time. And to add to it, the bar is dark and somewhat dingy but right outside the doorway was a stream of light that hit a beautiful rose tree just right. It was a sight to be seen. The contrast was magical. Perhaps it was Snow White's apple tree.\n\nI was not particuarly interested in going here, but it turned out to be one of my favorite San Francisco memories.", "author": "Angel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "Gin & Tonics since 1968.\n\nSecond of three stops on a vintage North Beach bar crawl.\n\nLocated in an alley. Low ceilings immediately give the space a sense of intimacy and energy. Grab a rickety table. Grab a strong drink. Take in the various ephemera.\n\nGrandma would be impressed. Heavy on the gin. Light on the tonic. Surrounding strangers could easily become friends. Or perhaps that was just the gin.\n\nPretty sure ephemera and drinks will be flowing for years to come.\n\n- - - - - - - - - -\n\nStop one: http://www.yelp.com/biz/tosca-cafe-san-francisco#hrid:PYSOiaiSg9sT9dqMOYzYNA\n\nStop three: http://www.yelp.com/biz/vesuvio-cafe-san-francisco#hrid:AMuBFW_TCXckhN693baqNA", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-16", "description": "This type of bar is one of the reasons why I think I officially like SF more than LA.\n\nCharming, old, cool....\n\nYou still have those places in LA but you really gotta hunt for them. Here you can just stumble into any old place and find a gem.\n\nThis was a gem of a gem... An emerald if you will.\n\nThe beers were fine--$5 for a Stella. But you really go for the atmosphere. The old bricks. The beer stained wood. The antique furniture with old signs collected for a century. Not like new signs made to look old like in a Crackerbarrel or an Applebees in the Midwest...\n\nBathrooms were kind grimy though.", "author": "Bobby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "North Beach has a smattering of viable boozer bars for the career drinker. Lower North Beach proves to hold a few of such places and none more quirky and engaging then Specs. \n\nWalking up Columbus you can miss it peeking out from inside a teeny alleyway. Walk into the bar and you see the narrow wooden wonder of Specs....faded, kitschy posters, photos and signs of all kinds line the walls. \n\nOrder up a 'Cheese Plate' and a beer and just sit back with friends and revel in the amazing weirdness and fabulous oddity of Specs. \n\nP.S. Get a portrait done for $5 if the artist is sitting in the back table.", "author": "Jay H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-13", "description": "Cool, laid back institution. Great little beatnik dive bar in north beach.  Off the beaten path from the tourist spots.  Everyone there was relaxed and enjoying themselves.  The staff was friendly.  Drinks are reasonably priced.", "author": "Greta R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "This is the choice beatnick-atmosphere, hole-in-the-wall-(of an alley) type of bar, that's not dirty and includes a piano. You may find some old timers jamming here, which is becoming increasingly more rare in this world.\n\nGood price... drinks/service are all great.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-27", "description": "This is something out of the ordinary. All the objects coated with dust. Stickers lining the inside of the bar. All sorts of people frequenting this place. Great place to hang out for a drink. Recommended that you check out their bins of postcards all talking about the American Dream. Not sure why that's the theme, but they are very interesting nonetheless. Completely recommended if you're wandering around North Beach.", "author": "N. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-17", "description": "Never empty, but I've never been here when it was too full either. Weird decorations and clientele. Seriously, you'll see some strange characters in here, and you'll probably see a homeless person fall asleep at some point. \n\nA must if you frequent North Beach.\n\nFifth star would be if they cleaned it up just a little and accepted cards (cash only).", "author": "Jason M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-04", "description": "Cute place, sure. But nothing excuses lousy service when there is literally 8 people in your bar at 5pm. The Guinness tasted a bit off and a little light too...maybe the taps need some cleaning?", "author": "A S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-29", "description": "Your first reaction to this place is going to be that it's slightly creepy, and you'd be totally right. It's a little more than slightly creepy, but the bartender's pretty nice, and the drinks aren't too expensive. It's a real dive, though, and the clientele leaves much to be desired. Someone puked on the floor the Friday night I was there. That was pretty hilarious.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-18", "description": "Great local bar. Good draft selection including anchor steam, stella, and Guinness. Dos Equis, Heineken, rainier, Olympia, Budweiser, and Victoria bottles available too. No lock on the women's restroom stall! Great music and so many items on the walls to look at. It never gets old. I particularly like the sign about a \"convenient regulation size alleyway for the settling of physical contests\".", "author": "Joy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Love the atmosphere and I've had really friendly service from the bar tender. Will definitely come back here for an after hour drawing session!", "author": "Breena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "This bar has the best vibe for tarot readings. They also have the best bar snack basket in North Beach, not to mention super cheap cans of Olympia and \"Vitamin R\". Spec's rules.", "author": "Kelly O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "This place is tucked away in a corner right across the street from City Lights bookstore and Vesuvio bar. Chill dark bar with lots cool looking items on the walls. They have a small but decent selection of beers on tap and some cheap rainier in a can if you don't want to spend alot. My brother ordered an irish coffee which was surprisingly good. I had an anchor steam and a fernet. The bartender is very friendly and knowledgeable about all kinds of things, especially music and knows exactly when to ask if your ready for another drink without being pushy or making you have to flag him down. Great place to have a fernet, some cheese from the wheel, and just kick back while chatting with some locals.", "author": "Robin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "A great dive tucked away in the world's shortest alley in North Beach. There's usually some odd thing happening just outside the door. Someone might be playing the piano inside. Lots of old things, and that includes the clientele. ; ) It's a place typically shunned by douchey frat types and the douchey women they chase. Sweet! You can get cheese and crackers if you're feeling peckish.\n\nCash only.", "author": "Diana O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "The best of the bars in San Francisco. Cheap drinks, basket of cheese and crackers, old beat poets drinking with you, folk music and the boxes of postcard. Humble and real.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "Wonderful divey bar. Lots of wood and artifacts. Not touristy. Not as inexpensive as it should be but it is so centrally located and you pay for the atmosphere.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-26", "description": "Great location, very cool objects and paintings but.....$6 for a pint with 2 inches of foam and no happy hour is not my kinda dive. Tourist trap even for locals.", "author": "B. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-23", "description": "I don't know how to feel about this place.\n\nOn the one hand, it's in North Beach. And in that pocket of North Beach where bars are everywhere.\n\nOn the other hand, the strangest people tend to show up and there's a large crab hanging on the wall.\n\nIt's not a pretentious place. And a friend of mine once got into a quasi-lightsaber battle with a street vendor right outside the door, while his girlfriend was a mere foot away getting hit on by someone who looked like a cross between Amy Winehouse and Danny DeVito. Hmmm... considering that, yeah, this place is pretty cool.", "author": "J. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-13", "description": "This is a dive bar that charges $14 for two drinks.  This makes me think it's a perfect museum of a dive bar. One that doesn't exist anymore.  And people want a real dive bar so badly that they'll pay $14 for two drinks in order to pretend they are in one.\n\nIf you want to pretend you are in a dive bar, this place is absolutely cool.  I honestly loved it.", "author": "NoCal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "A hidden gem in San Francisco's North Beach close to a corner of Broadway & Columbus.\n\nSpec's rocks an old school look with an old school vibe.  It's where I like to go to change things up from the all too familiar North Beach crowd.  Spec's is rather small and cramp, especially when busy, but I'd rather be here than some stuck up scene in North Beach.  The prices for their libations are considerably less than other places in the area also.\n\nSomeone is usually playing the piano here at night.  I don't know if he works there or not but he does accept tips.  I usually shoot him a few if I like the tunes he plays.  Unfortunately, he doesn't know the classic jazz tune \"All Of Me\"...I love that piece.", "author": "Jules S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "This bar is really, really cool.  It's tucked away in a little North Beach alley and is very dark and cozy, all of which make it perfect for a daytime drink!\n\nAdd to that its eclectic decor, which includes lots of bizarre antiques, and you have the impression of entered a really cool, secret place right out of a movie.  \n\nThe only downside is that, like any and all North Beach bars, in the evenings and weekends, this place gets pretty crowded, which does kill the spooky off the beaten path vibe.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-31", "description": "The history of the place is definitely cool, it was huge during the beatnik movement, but the drinks are ridiculously over priced. I much prefer vesuvio across the street, just as much history but better bar.", "author": "Grace P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "Specs' is a freaking money spot. It's kinda hidden in the corner of an alley, but if you find it, you will enjoy it for sure. It's definitely a dive bar with a pretty chill atmosphere, but the bartenders and selection of beer definitely make it different than your average San Fran hole in the wall bar. \n\nOh yeah...if you want, the bartender will give you cheese and crackers. And by cheese, I don't mean that garbage Kraft singles stuff, I'm talking good sharp cheddar with saltine crackers. Which is slamming, especially with a nice cold beer. If you're looking to just get some brews and kick it in an old school pub, Specs' is your spot. Boom...with cheese and saltine crackers on top!", "author": "Aaron N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "Love this place. Reminds me of some of your finer Alaskan establishments minus the sawdust but with the same male/female ratio (ladies- the odds are good, but the goods are odd). \nIf you're taking your cool/old school-loving friends and family members on a tour of SF, this is a must stop. Gives you instant SF tour guide street cred.", "author": "Johanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "Clearly one of the only appropriate relics left in this city. This is a very local bar, but always open to outsiders and tourists. I'm pretty sure that the majority of the negative reviews on this place were written by douche bags.", "author": "J. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "My first impressions: a hangout for North Beach locals and aging hippies, lots of \"stuff\" plastered on the walls must be some sort of historical shit, popular considering it's a Sunday night\n\nI was here for one night to have a couple of beers with friends, enjoy good conversation and to view some short films.  That's right.  I went to Specs to watch a movie.\n\nMy friend Gregg M seems to be a regular customer here.  He starred in the twelve minute flick titled \"Jake and Ronne\" which maybe not so coincidentally was filmed in its entirety at Specs.  The film was directed by another friend, Mark N, who doesn't seem to be a regular here.  Anyway, good stuff.  In part because the bar patrons were lively and made a lot of noise while cheering on familiar shots or cameos by the bartender made this a very enjoyable evening.\n\nThey have Sierra Nevada on tap so I was happy.  Cool bartenders and loud music played softly so one can actually enjoy good conversation without shouting.\n\nTwo of my first impressions turned out to be right.  The crowd is a good mix of friendly North Beach locals and modern day hippies, and maybe because of film night this was a very popular place on a Sunday evening.\n\nThe stuff on the wall wasn't very historical unless you consider how old they are.  Vintage signs and famous quotes mostly with an assortment of knick-knacks here and there.  There's some really hilarious graffiti in the restroom too.  Ah, local charm.", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "I pretty much love everything about this bar and try to come here whenever I am in the neighborhood. I always get a dirty vodka martini.$5, best deal in the city!!\n\nThe cheese and crackers is also amazing. The slice you off a chunk from a giant cheese wheel and the bar and give you a sleeve of saltines. Love that. \n\nFun characters here as well, %50 percent of the time I come here there is at least one person with a bird on their shoulder! haha. \n\nRemember, cash only.", "author": "Claire b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-01", "description": "Stay classy, guys. I couldn't actually order a drink because I had to drive shortly after arriving, but I liked the ambiance and the \"old timer\" feeling of the place. The piano player added a great touch, and the all-wooden bar made me feel like I was in some sort of British pub. Good, large tables for groups, and manageable noise levels.\n\nAlso, there's this really cool artist guy who sort of sits along the side of the place near the bar and makes creations while you watch.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "How can a local saloon merit a five-star rating despite the following facts? :  The place hasn't changed its interior decoration in thirty years. It's often overrun with the seventy-something equivalent of Williamsburg hipsters in aging, salty, faux-communists and self-consciously declared 'artist' types. Even if you've been going here for thirty years you're still likely to be looked upon as a clueless newcomer subtracting from the joint's authenticity. If you have been going here for a while you're likely to sit next to some thirty year-old blowhard who discovered the place three weeks ago and is waxing philosophic to the young, uneasy-looking cheeserettes next to him on the bar's 'history', Specs' merchant marine connection, and the phallic whale bone on the wall (all things you could easily pick up in one drunken visit.)\n\nBecause none of this matters. To both its absolute credit and demise, Specs never changes and as long as the man himself is making the rounds in North Beach and signing the rent checks this will remain a fact. He's loyal to his bartenders and they to him, coming back to the place after extended hiatuses. They make a mean Irish coffee (only having boosted the price a buck recently) using the same archaic blender to gently stir the cream since 1971. When they bumped the draft taps up from only Bud to Anchor and eventually a few more it remained the central topic of conversation regarding how the place had 'changed' for about fifteen years. It provides an excellent counter to Vesuvio across the street and general refuge from the touristy onslaught. It's also a great counter to the Tosca vibe next door and a drunken respite from Sean Penn-seekers and less-homey 'don't put your feet up on the furniture' admonishments. \n\nSpecs is what it is, and that it's remained so for almost forty-five years is one of those inspiring facts that one can only cling to with apprehension. The man himself is a salty pleasure, neither kissing up to patrons nor dismissing them, and over the years seems to have taken his real pleasure from mixing it up with both regulars and newcomers (none more than attractive young females) who are generally delighted to discover that he owns the place. But anyone who's been around the joint for a while has to wonder what will become of things post The Man? It doesn't seem possible that the next generation could maintain as he has for this long and one hopes there's a solid succession plan in place complete with detailed instruction book. Of the three (Vesuvios, Specs and Tosca) if you had to pick one whose removal or upheaval would permanently alter an important link to North Beach's past, it would be this place. Make all the Beat arguments and celebrity-refuge points you want, Specs *is* North Beach.", "author": "R M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "Great place to stop in and grab a beer. Nice bartender, who most importantly knows the difference between good Guinness and great Guinness.", "author": "Glenn M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "Cool little neighborhood bar with a lot of history. Good beers on tap - lights, darks ambers etc..\nIt seemed like there were a lot of locals there just trying to have a good time. It wasn't like they typical bar where everyone is trying hard to hook up with someone.", "author": "Rich P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "This is some old sckool San Francisco for sure. Keep the place clean, the regulars will be grateful.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-06", "description": "Specs has character...Specs has history....Specs has SOUL.  The fact that it's North Beach location subjects it to a horde of tourists on the weekends might detract from this somewhat, but doesn't diminish it completely.\r\n\r\nWhat you see inside is a more than just a snapshot from a single period or culture.  Browsing the walls and ceilings exposes one to a broad swath of San Francisco history that changes it's gist and period with every movement of the eye.  There's stuff from the 70's that boomers can relate to.  There are relics from the 60's that ex-hippies can appreciate.  There's city-specific history from World War II that your parents might have fond memories of.  Check out the old artifacts from the Sutro baths, and you'll see things that might even give your grandparents the warm-and-fuzzies.\r\n\r\nEven though a similar collection of artifacts could no doubt be amassed, it's haphazard assembly and mishmash arrangement weave a bizarre quilt of history whose evolution over a period of 40 or more years can't be faked.  Everywhere you look, there are pictures, papers, scribblings....some framed, some not. Some are tacked to the walls at the corners, displaying a gradual yellowing that only age can bring about and a soft curvature that's only created by decades of gentle gravitational pull.  It seems that more recent placements of items have had respect for what was existed there before, creating a delightful asymmetry that bears more witness to history than it does decorative talent.\r\n\r\nIf you're around during the weekend, pop by mid-afternoon when a smattering of the old guard locals will chat politics for hours on end.  The after-work crowd can be pretty interesting too.  Late mornings and early afternoons are hit-and-miss....sometimes it's open, sometimes it's not. Weekend nights usually draw a crowd....the tourists come in, the music goes up, and it doesn't take long for the regulars to head for the door.  Regardless, pop by to get an eye full of history...stick around for awhile if you can squeeze your way into a conversation with a group of the regulars.  But have a plan B if the tourists are about. The decor is worth a visit, but it's nothing that'll keep you entertained all night...", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "A true piece of San Francisco. A nice break from the over the top atmosphere of North Beach. Eclectic doesn't even begin to describe the decor - nautical I've heard? If I were you, I would order beer here. Plunk down a few bucks, and you can get a plate of cheese and crackers - informal munchies. As stated in other reviews, cash only - I think I still owe them a buck actually.\n\nOh yeah, look out for friendly folks dubbed \"FOS\" - friends of Specs. They help the bartenders clean tables. Gotta love it.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-02", "description": "What a fun little dive bar.  I was only in SF for a day and a local brought me to Specs for a after work beer, it definitely had a lot of character and I was happy to experience an off the beaten path establishment.  I can't speak much to the quality of drinks or service, but I would love to return here if I'm ever in town again and see if it lives up to all these great reviews!", "author": "Caroline B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-04", "description": "Quiet place for an after work drink. Nice people, great bartenders, Made NYTimes list of top ten bars in SF, although they said it was full of weirdos. I can assure you, I am there almost every day and I've never noticed any weirdos.\n\nAfter about seven or eight it fills up with creepy young people and becomes a 'dive bar'.", "author": "Fled F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Eccentric dive bar hidden away in North Beach. Walked past all the time and never knew this was here. Best part is the huge chunk of cheese and saltine crackers you can get as a snack.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-30", "description": "This is the epitome of a bar for me. There's no t.v. and the music playing is definitely not top 40. A curious mixture of div, irish pub and museum, Specs feels like home. Sunday afternoons have made Specs into \"Church\" for us--- the hunk of fontina cheese and crackers our wafers, a Brandy Alexander the wine, and the greatest preachers, I mean, bartenders I've had the pleasure of serving me. I went away for a few weeks and went in to order my drink and they knew me immediately, just from a drink.\nBest. Place. Ever.", "author": "Vee B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Laura is awesome!  Great drinks, cool vibe but bring cash!  They don't take credit cards.", "author": "Yvette Marlene P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-28", "description": "If you love dive bars and nautical paraphernalia  (and really, who doesn't?) than you are going to LOVE Specs'. It's the hidden gem of North Beach and the place I escape to on the weekends when my regular bar, Vesuvio, is chocked full of the Bridge and Tunnel crowd. \n\nThe wine is awful (about a half step up from drinking turpentine) but the bartenders and the charm of the space more than make up for it. Be warned that Specs' is cash only.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "I don't know if i came at the wrong time or on the wrong night but i just wasn't feelin' Adler's Museum Cafe. It was somewhat empty and a bit musky feeling. I almost walked into a man with a Dumbledore beard and i felt he resembled a pirate with a peg leg. I'm sure the nautical vibe is to blame a bit but we only stopped in for a while before we continued our bar hopping.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-29", "description": "I dig this place. Its funky, its somewhat of a dive, and not many people know about it. It reeks with nostalgia, with walls covered in old photo & weird collectors items and because of its odd location, mostly locals know about it. Its not fancy by a long shot. But its cool, off the beaten path, and the drinks are cheap & strong.", "author": "Jen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-26", "description": "Unusual pictures and items from all over the world posted on the walls and hanging from the ceiling, definitely will get conversation going. Intimate casual atmosphere. Good cheap drinks, friendly bartender. Good bar for people watching, mixed crowd. This place has a lot of character and old San Francisco charm. Across from Vesuvios Café, another bar that will take you back in time to a different San Francisco.", "author": "Ron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "Old school bar, old school service, old school tunes. Tick, tick and tick, as those boxes go. Don't come here expecting frills, but do come with an open mind and you won't leave disappointed. A veritable blast from the past. Two thumbs up!", "author": "T K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-09", "description": "Screw the stuff on the walls.\nI have never noticed anyone in here looking \"touristy\".\nPerhaps there are tourists, but thankfully they are not American ones.\n\nThis is a bar.\nJust a bar.\n\nAnd that is a rare thing to find in a bar these days.\nIt's comfortable, but thankfully not too comfortable.\n\nThere is no pretense.  There is no line.\nWhen I go, there is always plenty of seating.\nIt's not too loud.  There is no TV.\nAnd after a few, the cheese guillotine really hits the spot.\n\nAll good things.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-07", "description": "For some reason, I love a bar with history....history literally plastered on every open space on the walls is even better! Not that my boyfriend and I lack any conversation, but this place lends to our topics! It's wall to every crack in the wall stuff that really is super amazingly interesting! \n\nBesides being a place with a ton of history, the bartender and patrons are actually very accommodating and friendly. They notice when you take a seat and clean up very quickly after each patron. \n\nMy boyfriend and I enjoyed a drink and looked a some stuff on the walls leaving some to come back later and discover. Had a wonderful time here and can't make the rounds again!", "author": "Karen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-22", "description": "Any place with a spectacle-clad old irish bartender is alright with me! I have a great time at specs each time I go, I don't know too many people who've even heard of it so if I want to chill and have a few drinks with friends in a really low-key setting I go here. No music, no frills just a lot of cool signs on the walls and old school flare. My favorite are the baskets of postcards from all over the world, they don't put them out when it's busy so you have to ask. The best are the ones from a gentleman searching for the \"american dream\" and there is one from nearly every state!\n\"I thought i'd find it on the Jersey shore. I was wrong.\"", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-09", "description": "Random good times, that is what you'll get from having a night at Specs. This is probably one of my favorite dive bars ever. But it doesn't seem right to call it a dive. Maybe because of all stuff on the walls and the fact that it feels like an old joint my Grandfather would love either way it's brilliant.\n\nIt's not pretentious, it's easy going and a place for locals or those just trying to get away from that shiteous club scene. You'll definitely find a diverse crowd and probably start chatting up with people that have been frequenting this place \"since before you were a thought in your daddy's eyes\" that man was too sweet, and there was NO way I was going home with him, but still sweet. This is a bar where I feel comfortable coming with a big group of friends or a place where I just want to have a few drinks on my own and kick back and enjoy the atmosphere.\n\nBig Pros: CHEAP DRINKS and good conversations", "author": "Morgan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "Stiff drinks, along with the peculiarities of it's name, the dim lighting and worn wood interiors, this bar is indeed a museum. I could drink and explore this place with a magnifying glass for years and never get bored. Friendly bartenders and an eclectic group of patrons, easily one of the most interesting bars in San Francisco.", "author": "Clarke W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "Cool dive bar good for groups.  Some drunk newbs were playing chess in the corner.  I thought they were going to start a bar fight over a game of chess.  Damn wannabe n3rds.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "Had a lot of awesome nights here, it would take way too long to write about the incredibly interesting adventures I had but definitely some of the best nights of my life started here. Whenever I'm in San Francisco I go back and see the same people. Bar tenders have always been nice.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-08", "description": "Aw... Specs is the first bar I patroned in San Francisco. I was an eager, young transfer student when I moved to San Francisco State. Random computer pairing roomed me with three AWESOME roommates and a floor full of neighbors who were all a few years older than me. I would listen to them talk about the fun bars and clubs they went to the night before and I remembered how much I wanted flex my newfound freedom and join in on the drunken good times. They would invite me, of course, but it really sucked to have to say, \"I can't go... I'm still 20...\" Only parties for me. Sad face. \n\nThen one night, someone said the magical words, \"We're going to Specs - they might not check.\" I couldn't have gone to a better first bar. I loved everything about it, from the decor to the people to the atmosphere. The drinks aren't super fancy (I think the first thing someone stuck in my had after I sat down was a SoCo and Coke) and that's the way it should be. It's a great place to chillax because, honestly, noone gives a crap. Specs is just a place you go to enjoy some drinks, enjoy some convo, and enjoy some friends.", "author": "Queenie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "So... we can never remember the name or the exact location of this place, but surely enough we end up stumbling down Columbus near the end of a long night, looking for this spot.  Perfect place for a night cap (or few) after dinner.   I don't remember the beer selection being very large, but I can always find something I'm happy to drink.  Tables in the back are great for small groups.", "author": "Heidi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-14", "description": "I'm sitting at the bar, it's fourth of July and I've watched the glowing fireworks through the SF fog. Specs is as random as it can get. Hole in the wall history in the heart of north beach. Slice of cheese and a drink please!", "author": "TVAT T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "I feel another numbered review coming on! Here are two reasons why I like Specs'. (I thought it was Spec's, but you know, I trust Yelp. I also have high apostrohe misuse fear, which is why I mention it.)\n\n1. They have a big cheese wheel. Yes, a big wheel of nice cheese, and what goes better with cheese than beer? They have beer, too.\n\n2. I purchased cheese with crackers and two beers for $15. Is that a deal, or what?\n\nI also happen to like Specs'  because I met my specialfriendlifepartnerboyfriendbuddy there a couple of years ago after a Christmas party. Well, it was a work Christmas party. Close by. So I shouldn't maybe give that one to Specs', but I'm going to anyway. But no number.", "author": "Leata H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "Do not pass up a chance to go here. Have a shot, watch people doing their thing. This is as good as it gets.\n\nAlso: Would be a great place for hatching a conspiracy. Just sayin'.", "author": "Mark S. I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "It really is like a museum in here. And it's cozy. And it's divey. And they have Anchor Steam on tap (4 glasses = 1 pitcher, fyi). And I like it.", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-30", "description": "Wild salmon don't do drugs.  Specs' is a cool little place to hang out at, especially as a non-local seeking non-touristy places to visit.  The crowd was friendly and plenty of beers were on tap to choose from.  The bartender had a delightfully surly sense of humor; the legendary cheese plate was the only thing missing from my personal experience.", "author": "Scott V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "This funky bar is always interesting. strange older people, beatnick types, musicians. Awsome place covered in history and wildness. \n\nStay away if you are looking for a young scene or a real crazy night. Its just awsome to dig the scene and hang out with friends. The opposite of nearby Kell's.\n\nCombine with Vesuvios and The Saloon for a historical and zany bar crawl.", "author": "James B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-17", "description": "We must've stumbled into this bar during the drunken homeless hour (12:00 AM on a Thursday). I love a good dive bar and based upon previous Yelp reviews this one was supposed to be quite the \"gem\".  I think we caught it on a bad night as there were two drunks (man & woman) who were either homeless or from a shelter. Yes the bar had plenty of potential but I think we'd of been better off checking it out earlier in the evening. Most people ignored the drunks even when they would stumble upon them and bombard their conversations. The regulars or perhaps City dwellers were used of this occurrence and simply ignored them as much as possible. The bartenders were nice and definitely quick with the drinks but lacked crowd control pertaining to the two drunks. I hate knocking the place because it definitely could've been a cool place had those drunks not ruined the comfort level for the two of us from out of town.", "author": "Sonny H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-04", "description": "LOVED IT!! for the following reasons:\n\n1- theres so much stuff on the walls and in cases i could spend days there!! the bartender, while a little weird, would point out cool things and explain about others. i feel like you would have to work there for a long time to see it all. AWESOME!!\n\n2- they have games. if you are a bar and have darts/ games. i love you. why people [ my bf] wont play [with me] i dunno, but i love it. ill play and i dont care who's laughing. \n\n3- the drinks were good and strong. the bartender wouldnt make us a car bomb. and after i asked, wouldnt even sell me a beer and a shot. i guess i understand why, not wanting a belligerent crowd and youngsters. i just prefer to get the alcohol in me as fast as possible bc i tend to babysit my drinks.\n\n4- there were some characters outside!! omg!! this is def a must if you are in north beach!!!", "author": "Delaney P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-05", "description": "Some older guy that appeared to be running the placed was not too kind and told 20 of us to leave on a weeknight.  Apparently you can't just overwhelm the place when locals are there and want it quiet.  1 star for not letting us patronize.", "author": "Simon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "Welcome to Specs.  Second stop on my traditional walkabout in North Beach/T-Hill.   Cheers Specs Simmons!  Trippy weird place in half an alley across from the first stop, Vesuvio and third stop and alleymate,  the Tosca Cafe.  This is my favorite of the three.  Must visit even if you don't stay for the cheese plate, beer and people watching.  Some old guy stole my drink!  8th or 9th time in there over the last 4 years and I swear the place looks EXACTY the same.  Be forewarned, do not order a stupid foo foo drink here.", "author": "Paul J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "Oh Specs.  I've had some fun there.  Many people have.  The place is well traveled.\nAnd often filled with odd and colorful people.\nI remember back when they didn't have tap beers.  Oh, the 90's.\nHungry?  Get a slice of cheese from that massive block with a handful of saltines.\nSure, the place will be full of loud drunk people.\nAnd crazy people will be hanging around outside the place where people are smoking.\nJoin 'em.\nLive a little.", "author": "Kev M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-31", "description": "This place has a uniqueness to it that is very hard to describe. It's got's a very diverse crowd of customers, a very odd feel to it. The decor is in a category of it's own. Very out there. I'm not really sure how else to describe it but quaint. Definitely worth checking out. You'll meet some interesting people!", "author": "Michael N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-10", "description": "Best bar in North Beach. \nThis place has cheese and beer! Like sharp cheese. \nThe decorum looks like some mariner's version of Buco di Beppo like a cross between a souvenir shop and an Elks lodge. There is always someone there that looks like they've been going there since the gold rush. \nBut what its got is no specific scene and that makes it magical. \nAnd after your done drinking and conversing its not far to go find some warm easy meat. *wink wink nudge nudge*", "author": "Rocker D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-12", "description": "Best place in North Beach to feel like you're not in North Beach. Drinks are small and overpriced, but the ambiance is worth it. If you're loud, obnoxious, and otherwise North Beach-y (i.e. the type of asshat who pounds on your table and screams for more jagabombs jagabombs jagabombs), don't bother. There are countless bars and clubs in NB that just LOVE to pack themselves to the popped collar with Marina, and B&T DBs just like you, so please leave Specs' to those of us wanting to have a beverage and a civilized conversation at an off the beaten path watering hole.\n\nMinus one star for the aforementioned social dingleberries, and another for the short pours and tall prices.", "author": "Samir O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "I'm not usually a fan of \"dive bars\", but Specs is an exception.  A very cool atmosphere.  Not a place to party, but a great place for a small gathering to have a few beers.  The crowd is always cool, friendly, and diverse.\nIt is one of those hidden San Francisco gems, and everyone should have a chance to experience.", "author": "B J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-11", "description": "MISSED CONNECTIONS\n\nReply to: AZNdbzFAN@asianavenue.com\nDate: 2007-11-11, 10:24AM PST\n\nPossibly South American artsy girl on 11/3 - m4w - 25\n\nYou saw me looking at you... My friend asked you for a light... We both like your shoes... Overuse of ellipses... \n\nOne must review Spec's in relation to its surroundings. This is North Beach, the Vegas of SF. In one short walkthrough, I can easily collect about five strip club cards, and talk to at least two strippers (gosh, they sure seemed smart). Spec's is a cozy writers' bar with $4 beers on tap, good looking people and plenty of space. While it may not be my first choice for a hangout in the city, it certainly shines within this district. But alas, while I write, I am not a writer, and thus I find myself at ends with impressing such types.\n\nI will bee back tonight okay... If you see an Asian guy nursing a cosmo thats me... come say high and mention CL... we can begin a normal converstation from there...", "author": "Keane L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-02", "description": "This place used to be known for it's wildlife, I.e. roaches, but it seems like they've got control of the insect population.\n\nI'd rather be here than Vesuvio but neither would be my first choice.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-20", "description": "Ok. I'm 5'8, Curvy, Athletic and well...Substantial.  So, I'm comfortable patronizing Specs on any late night.  You can have a stiff drink alone at one of the round tables -or- enjoy congenial conversation with the bar keep and the regulars.  I love variety!  \n\nBut, you cannot find yourself behind the Alley of Mr. Bings across the way because your ass will get mugged!  Unless you are me (here's where I praise myself in the third person).  \n\nNadja lives a dark dangerous life where hard drinking and objectifying men  play a large part.  Here is her story:\n\n\"After a late drink at Spec's I found myself surrounded by at least a dozen surly, hungry-eyed potential attackers.  \n\nClever banter ensued.  Bravado met bravada.  Ultimately they knew my chic taupe macrame' hand bag (homage to 70's vintage) was not goin' down without a fight.  \n\nI take my Wing Chun stance and make Michelle Yeoh proud.  With all the cockiness of Bruce in \"Game of Death\" I instigate a little \"Play\".  I toy with my prey then bring about the final unforgiving blows.  Alerting my would-be attackers, in a Black Mamba way that they are free to go...but, their limbs are mine!\"\n\nSpec's is great!  Take caution in the surrounding areas. \nYou can't all be Kung-Fu masters like me!", "author": "R M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-27", "description": "Pretty cool wax museum... They serve beer to the figures and on weeknights the homeless tell jokes outside in the alley-like ambience.  \nIf your alley-hoppin' and need a place that doesn't care if you take your drink outside so you can smoke out with Foot Stompin' Fred before wandering on... this is your place for the night.", "author": "Kenny R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-17", "description": "Specs!!  I know thee well.  I first heard about this bar via Adam Adler RIP. He was the gayest(good) guy at Abraham Lincoln HS. I don't think he is any relation to the street name.  I remember how excited he was to know there was a bar and street named after him.  This was in 1982.\n\nSince 1968, Specs Twelve Adler Museum Cafe -- Specs to you -- has thrived as a North Beach holy spot\n\nIt was a sad day in Specs' history when the door connecting the bar to the upstairs strip club was closed off, corking the stream of scantily clad women who ventured down. The bartender, patrons and owner of the North Beach saloon dealt with the convulsive change in a traditional way: They had a drink.\n\nThe bar, which is formally called Specs Twelve Adler Museum Cafe and was opened in 1968 in an alley off Columbus Avenue in San Francisco, has been home to a menagerie of misfits, from strippers and poets to longshoremen and merchant marines. A sign reading, \"Please mind your head'' hangs above the bar next to the genitalia of a walrus. A photo of Ronald Reagan stretching his legs includes the homemade caption, \"One of these days these boots are gonna walk all over you.\"\n\nThe bar is a slice of a bawdier San Francisco, a foil for the modern day Internet cafe, a dimly lit place that inspires conversation, debate and impromptu poetry readings. \n\nI remeber the Handwriting Lady. I remember passing out after drinking Kama-Kazi's on a school night.  Kathy Gray now a cop threw up in Clown Alley's Bathroom.  Some dude paid for a cab/taxi ride from North Beach to my house...  That is a $40.00 cab ride folks.\n\nI still drop in to Specs when I am down that way. I love it when I run into the owner. He is such a character.\n\nThis space has a deeper history...in the 40's it was a secret/underground Gay and Lesbian Bar.  \n\nGod I love this town. I always leave my heart in San Francisco.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-09", "description": "Having a bunch of sorta historical looking junk all over the walls does not a museum make. Museums have their historical looking junk laid out in a coherent way, and they have information about the junk and guided tours and they sell memberships and you're not allowed to touch anything. And I've never seen a museum with restrooms as bizarre and foul smelling as these. \n\nBut none of the other museums I've been to recently have such capable bartenders and reasonably priced drinks and odd but refreshingly down to earth patrons. Spec's is not at all like other north beach bars; There's no neon, no dance music blasting, no gelled hair inside. It's tucked away in a little alley off of Columbus with a tiny sign. You won't find it if you're not looking for it. \n\nThis place may very well have inspired Billy Joel to write 'Pianoman' (there was a live piano player last time I was there!) At least a third of the regulars could have been Davy who's still in the Navy and there were a fair number more who evidently never had time for a wife. They're all generally friendly though.\n\nStop in here if you're tired of crowds and noise and stuck on Columbus. Spec's is there for you.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-20", "description": "It's dark, musty, and there's an old piano that harkens back to a jazzy era. Ancient postcards sit at the bar, ready to be pawed through. The regular patrons fit the scene, with a Cafe Trieste/City Lights ancient beatnik vibe. There's pride and history in this North Beach dive, and I totally dig it.\n\nAnd I'm not trying to be a square, man, but when the younger generational folk come into the bar for a drink, there's some elitism occurring here. On a random weekday night I came in with some friends and we sat at a table, sharing stories and enjoying each other's company. That is until we were sent a message by the bartender. We were told to keep it down, and our voices at their best, \"indoor volume,\" (imagine you're in a library). And as my friends and I continued to converse at our table, constantly shushing each other and casting furtive glances around the fully-occupied bar, we realized it just wasn't worth our time, so we split.\n\nAlso another word to the young folk, take caution when approaching and departing, because outside the entrance of bar lurks a bit of ragamuffin riff-raff. No seriously, my sister was randomly clocked my a homeless guy here once.\n\nI respect that Spec's has it's own protocol's, but cool it big daddy.", "author": "Sonya Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-16", "description": "I've been in there twice, and both times the bartender has been cranky.  Our group was 15+ and bought a lot of beer.  She said to quiet down because, \"there are a lot of old people with hangovers in here\", and then asked us to leave.  We were the bulk of her business that night and she was really rude to a large group of customers throwing money her way.  If you're an old timer staggering and slurring, it's the perfect place for you to take a nap.\n\nUPDATE! Just wanted to share a personal email I received yesterday from Vern F. upon reviewing Specs:\n\n\"Ever think that perhaps it was you and your party who were \"rude\", and not the bartender who was simply doing her job by trying to keep the atmosphere the way Specs himself wants it to be?\n\nNo, of course you wouldn't think that, because clearly you're nothing more than Daddy's little princess who thinks that spending money entitles a person to act like a complete and utter dipshit, with no repercussions whatsoever.\n\nStick to the Marina bars where they put up with your type of nonsense, and leave Specs to those of us who know how to behave in a fucking bar.\"\n\nYour pal,\nVern", "author": "Katie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-18", "description": "This place looks like someone  went on a $50000 shopping spree at Paxton Gate,  and threw all of it on the walls. I know that's not what happened, this place came first, but still, I like the idea of someone doing that. I also love how it's shoe horned in to a little alleyway. \n\nHere is how it could turn into a 5 star establishment: Racer 5 on tap.\n\nThis review sucks, read Adrienne G's and Andy F's for more fun.", "author": "neil c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-16", "description": "The bartenders at Spec's are assholes. The primary clientele could be described as \"interesting\" if you're looking in the door, but if you actually go in and hang out with them, you'll find out it's more like going to a bar full of the very same crazy homeless people you cross the street to avoid when you're downtown.\n\nI remember not minding Spec's the first time I went in there. The decorations are cool and, as I said, the patrons aren't immediately alienating. Also, we just went in there and drank.\n\nThe next time I went, it was for a friend's moving-away celebration. We sat in the back, it was fucking noisy, and the bartender mistook us for some other people. Then several of us started messing around with this little rubber flogger thing that we'd picked up earlier in the day, just, like, hitting each other with it. Nothing sexual, just goofing around. We were told by the bartender that it wasn't \"that kind of bar\" and had to stop.\n\nThen a little later one of us started singing an old sea shanty. He was also told that it wasn't \"that kind of bar\" and when I asked the bartender why they had a piano if they weren't the kind of bar where you could make music, he responded with, \"Sorry, house rules.\"\n\nI've never been back. If you want the kind of bar where you're supposed to sit silently next to some stinky toothless old fucker mumbling into his dirty beer glass, drowning your sorrows over also being a smelly geriatric transient, then my rating for you would be 5 stars instead of one.", "author": "Lynae Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-10", "description": "I used to go to Spec's with my fake ID in the early 90s. Since then, it has always held a place in my heart. There are many stories and storytellers there. Like the man who used to bring his pet bunny into the bar and if you bought him a beer,  you could hold the bunny.\n\nand did you know that on Sundays from noon to 4, they host a life drawing class? costs money, but good for you artists.\n\nand the cheesewheel. how can anyone not like this place? its gets crowded on weekends, but for some reason, i can tolerate it, which is rare for me.\n\nthe other day i was there with my friend Kevin. within minutes we were helping tourists out with their map. i think it just brings out the best in people. \n\ndon't go to Tosca. go to Spec's. then again, don't go, because I want Spec's all to myself.", "author": "Olivia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-21", "description": "Bring some cash or smile at your friends with cash so they buy you drinks because Specs is cash only. \nThat being said, it's well worth it. Nice brownish gold color, hole in the wall pretty much literally, piano in back, guy who drifts in to play and let me tell you thank God is or at least the night I was there no comparison to crappy Billy Joel. There was a little barrel house and some stride going on. \nNets on the wall, things to read. I was staring at Jack London all night. \nSome other pics. \nCrawled over here after a day at Kennedy's, House of Nan King, Vesuvio across the street and ended up here at the suggestion of a friend. Thanks friend.\nCrowd was cool and kept to themselves, unless you felt like mingling. Not a pick up joint. \nNice stiff drinky and good beers. Interested in hitting it back up for the cheese.", "author": "malibulala B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "There was a piano player rocking the solid oldies covers and some jazz tunes in the back.  I was drinking a Reinier at a table of 6.  On a Friday/Saturday night, this place is a great place to round up some friends and drink cheaply.  If you don't like the decorations, you're concentrating on the wrong qualities of this place.\n\nThere are crazy locals, obnoxious and out-dated decor screwed to the wall, and a sweet alley for smoking.  If you're wearing heels and a fur coat, you might want to go to some of the bourgeoier spots north beach has to offer.", "author": "L J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "I have nothing to add, except:\n- got kicked out of Specs for playing the piano\n- because it attracts tourists, I end up meeting random people, like the dutch death guild\n- the bartenders are surly (and if I dealt with as many tourists, I would be surly too)\n- watch out for the bathroom stairs!!", "author": "Anna B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "If you think this is a dive bar, you haven't been around very much. A dive bar is the Forestville Club, and I'm not going to mention any North Beach dives.  This is NOT a dive, though Specs would probably enjoy having it described that way. The bartenders are great, Specs is irresistible to women of all ages. The drinks are reasonalby priced and it's a place where a woman can feel comfortable going alone. The bartenders keep an eye on things and will intervene if they see a woman is being hassled. The walls are completely covered with art, funny little signs, news articles and photos. It's the best.", "author": "Marilyn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "Have you ever wondered what the world looked like from inside an aquarium?  Sit near the front window of Spec's and you can experience that sensation.  Not only does the plate glass cast an eerie blue glow on the outside courtyard, but many of the characters here might very well be water-dwelling.   The bar's nautical motif is something out of bohemian nightmare.  Glancing up you will see a corpse's head wedged in between the skeletons of two giant shark jaws while John Coltrane jams quietly in the background.  \n\nApparently, owner of the bar got his nickname from the spectacles he sported back in the day.  Sometimes I feel like I need spectacles to see past the odd-ball facades of the bar patrons.  Upon further examination (eavesdropping), I've discovered that the conservative investment bankers at the table next to me dress in drag on the weekends.  The senile bums at the bar are actually political activists in heated debate about the contributions of Ralph Nader and the evils of the Neo-con movement.  The gentleman keeled over his drink is praying, not snoozing. \n\nThe suffix \"-arium\" is Latin for \"a place for relating to.\"  Put on your specs, have a couple of cheap Anchor Steams and take a swim with the fish.", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-27", "description": "The good news: if you want to act like a complete idiot, drink other people's drinks, and physically assault other people's personal property (including expensive guitars) with no repercussions whatsoever, this is the place for you.  There are no consequences for bad behavior here.  It is as permissive a place in San Francisco as you can get nowadays.  Don't worry, you'll never be 86'd or ejected from Spec's.\n\nThe bad news: if you've ever stepped away for only a few seconds then turn around to see someone drinking your full pint of beer, imagine this scenario.  You ask the person politely, \"Is that my beer?\" to which the person responds to you in indecipherable drunken mumbling.  Then before you even get a chance to notify the bartender, the drunk woman finishes your beer and all the bar patrons descend on you and lecture you like you're the asshole picking on a poor thirsty person who is entitled to drink your drink and any other drink she sees.\n\nIf that kind of behavior is rewarded at Spec's on a consistent basis, thanks but no thanks.\n\n+1 star for the one female bartender there who is friendly and polite", "author": "Justin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Best dive bar in North Beach. When I first got to San Francisco it was full of bikers, suits, old eccentrics, and a few young ins. It is totally fun to people watch. It has so much stuff on the walls, it is worth taking people from out of town.", "author": "Nicholas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "i don't know how do you rate a bar that you only go to for one beer?\n\nit was a fine place, decor made me feel like i was in the Saharan Desert in a British outpost there. \n\nit was crowded on a Wed night", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-17", "description": "I'd shout GO HERE again but I already used it for my Mars Bar paean. This is a bar for people who love bars. And by that I mean real bars, the kind with some dirt under their fingernails, not the boring recyclable sports bars or the trendy bars that get forgotten as soon as drinks made with huckleberry lose favor.\n\nThis bar has history: you can tell by (a) the accumulated crap from all seven seas, (b) the nature of the crap, (c) the dust that the crap has accumulated, and (d) the mix of folks sitting and alternately drinking and spilling their beer. Two guys next to us the last time we were there were old sailors who'd haunted the place 30 years ago, when it was either a merchant sailor's bar or a dyke bar. It's got a complicated history -- you can let your imagination run wild in here.\n\nPlus it's tucked on this little alleyway around the corner from where all the titty bars used to be, back before they became \"Gentlemen's Clubs\", when this was a sailor's town, and you just know people fought, puked, got their wallet and their false teeth stolen while passed out in the gutter -- basically had an eventful night out.\n\nDon't worry - it's not like that now. But stop in and have a couple of beers, and you'll feel like it could be.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-10", "description": "If you want to go to a bar where you have to be quiet and aren't allowed to have any fun....go here. This place sucks balls.\n\nSo me and a few friends stroll into this hole, granted we were a little drunk but by no means were we loud at all. We sit down. Our buddy gets us some drinks at the bar and brings it to us. So we go ahead and chug our drinks and the bartender comes to our table, grabs our empty glasses and kicks us out. Why? Because apparently we didn't behave. We didn't disrupt anybody's good time. We weren't loud and obnoxious. I asked her why we were getting kicked out and no response. She just said to leave. So we didn't cause any kind of ruckus. We got up and left. \n\nIf I could give this place negative stars I would.", "author": "David C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-01", "description": "Not sure why or how we ended up at this little bar in the back of a nowhere alley. \n\nFrom now on, when I do decide to brave the NorthBeach crowds, I will make an effort to go here. \n\nDark and creepy and cheap and wonderful\n\nI almost had to break my 3 month \"no punching\" streak. People need to learn how to stare politely and NOT bump into me so they can't \"accidentally\" touch my ass. Sure I just happened to be wearing what can only be described as an 80's hooker outfit... but that's no excuse.", "author": "Towanda S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-02", "description": "Spec's is fairly divey but the clientele is mixed with office drones like myself looking to forget our day and older guys who look like they've been drinking long enough to forget several years. I've never been there on a weekend night, so I have not seen it overrun with tourists. The bartenders are fun. The prices are pretty reasonable.\n\nThis place is so close to my work, and yet only a few of my co-workers even know it's there. That is actually what gives it the 4th star.", "author": "Allyson V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-14", "description": "One of the most congenial pubs in the city, Spec's makes me feel welcome from the moment I cross the threshold. Accumulated tchotchkes cover every inch of the walls and ceilng, almost as if your pack-rat grandpa's attic exploded inside, and the low yellow lighting makes the whole space feel like a historical scene preserved in amber. Unlike Vesuvio across the street, this isn't a tourist destination -- hence it actually hums with a true beatnik vibe. I haven't seen any of the old-timers here break into cosmic verse, but I can easily imagine the literary ghosts of poetic North Beach hiding in the corners. And speaking of old-timers, Spec's is definitely a hangout for the wizened and wise. No bellowing young fratboys here, just a clutch of pensive older folks who like to share lagers and laffs over a worn wooden table.", "author": "John G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-02", "description": "Read across the street at City Lights until it's appropriate drinking time. \n\nHead to Spec's no later than 6ish and you'll be treated to cheese at happy hour.\n\nOld style SF, comfortable atmosphere, all the usual North Beach characters and stiff drinks. You won't need anything else.", "author": "katy h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-25", "description": "Specs is a pretty cool bar to just chill in. When I went there it got kinda crowded, but the place is pretty small. Also some middle-aged guys were playing Magic cards behind us and had all their role playing game figures out. I dunno. \n\nAnyway.... the decor is great, filled to the brim with a maritime theme. I even saw a bumper sticker for Tybee Island, GA, a place I used to frequent when I was in college. \n\nAlso, they have a wheel of cheese they cut for you and crackers.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-26", "description": "Yeah, this place's name just rolls right off the tongue, doesn't it?\n\nSpec's is hidden away across the street from Vesuvio in North Beach, and it's one fine little bar for sure. First thing I noticed was the sheer volume of (for lack of a better word) crap on the walls. Fun stuff to look at when you're waiting for another drink (which, by the way, is a refreshingly short wait). There's a ton of authentic flags hanging from the ceiling, too, so all this totally adds to the quirky atmosphere.\n\nDrinks are good and strong, bartenders are very attentive, and it has a really laid-back ambience. Well, until the trashed friend you're with falls over and breaks one of the tables. Then it's not so laid-back. And then, apparently, you get kicked out. Oh well, no matter, as I said Vesuvio's a cigarette drag away!", "author": "Drew S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Spec's is cool. Never dull. Always something to look at.\nI like that it's off the beaten path so you aren't trampled when you step out for a smoke or something, though bums run a muck. \nCash only which can be a drag but there are atms to boot in the area. \nThere's also the Tamale man, a Spec's regular, usually in a bowling or Hawaiian shirt and glasses and a hat, super friendly, and if hot tamales are your thang, it's always better to drink with a full tummy than an empty one. \nI love the art and kitchiness of everything about Spec's. From the New Guinea \"calendar\" by the booths in the corner to the \"ovaries\" sign for the Ladie's room. \n\nAnd remember:\nYou can't spell SPECTACULAR without Spec's!", "author": "Mary Ella D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "What do you get when you cross a sleezy nautical museum, a beat poet landmark and a wheel of cheese? Specs! One of my favorite low-key places in the city to get a simple drink from a good looking bartender. I have a feeling this place hasn't changed in 50 years and I'm kind of ok with that.", "author": "Jeska D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-10", "description": "Truly one of the most novel and interesting bars I've been to in the city. And when I say bars, I mean \"bars\"! This is a no-frills kind of joint but it contains some of the most interesting eye-candy I've seen since moving here last year. Maps, flags, newspaper articles...everything San Fransisco and then some. The beer is cold, the bartenders cool and the old-school cheese cutter behind the bar is fantastic.\n\nWhen you want to just enjoy a beer with a friend or group of friends and don't need all the hassles of being in a \"trendy\" spot, this is one great place to enjoy yourself. A definite \"must-see\" for those friends who come out for a visit to SF!", "author": "Gabriel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-07", "description": "I love this kicked back, tucked away, friendly and cozy bar. \n\nnot exceptional drinks--but very decent - just an all-around great place and great tenders, too. Make it a night with Tosca's, Vesuvio's, Specs and you better get something to eat or you'll be sorry (La Gondola? Bocadilloes, or my favorite: start out at L'Osteria and then get unwound on the bar triangle)\n\nperfectly situated on my walk from work down near the pier to downtown to catch a bus...a great North beach dive locale. (you shouldn't be driving after this)", "author": "Liza B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-19", "description": "Pretty cool unique place- based on the reviews, I was expecting a terrible place with a bunch of washed up elderly malcontents. Since it was St. Patricks Day, they knew probably to stay the hell away. After all St Pats along with a few other holidays are amateur drinking days. Place was packed, as much like us, others discovered every place in NB was completely packed. They had Guiness, and good bartenders. No TV, but that didn't come as a surprise....", "author": "Jim B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "There are very few bars in the North Beach area that you can go into where there aren't lurkers in every corner waiting for some poor girl to get drunk so they can pounce on her. Very few gold chains and unbuttoned shirts here. \n\n This place is a nice hideaway from that kind of crowd. It's nestled in an alleyway so most tourists aren't going to catch it.  The bar has a really mellow vibe to it and the decor, while kitschy, isn't overbearing. It's got a nice balance of quirky yet relevant. They also mean business with their drinks here. One of the only bars where I have to ask for less alcohol in my drink!", "author": "Jade L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-08", "description": "First time here after strolling about looking for a new place to try.  Have always wonder about this place.  Tucked away with interesting characters out front smoking...it's always the whiff of grass that catch my attention.  I often wonder if that's the designated legal location - why else will anyone be doing in such blatant public?  \n\nIt is somewhat of a neighborhood dive bar that's semi clean with some bench seatings along one wall and some other round tables near the back.  I don't get the museum part but I did enjoy checking out the articles, pics and whatnots on the wall and ceiling.  There are board games such as Battleship and Sorry, chess, a few books and other reading materials available for your enjoyment.  There is a beat up looking upright piano in the back near the bathroom.  Walking toward the bathroom - you'll see a very small sign \"Sit down\" with a left arrow and \"Stand up\" with a straight arrow.  The door to the stall in the \"sit down\" does not lock but it has toilet paper covers, which is a nice and surprising find.\n\nThe place is dimly lit but your eyes will adjust.  It is definitely a good place to people watch - quite a diverse group of interesting people.  The bar was full when we got there so we ordered our beer (Widmer Hef - $5 each) and took a seat across from it.  Didn't see the cheese someone mentioned and didn't know they have it until someone ordered cheese and crackers...", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-15", "description": "I don't know how it took me 7 years to come here, but this place is c-o-o-l cool. Perfect to place to sit down with friends and catch up. My buddy some how ordered cheese from the bartendress and it hit the spot. \n\nI'll be back soon ... very soon.", "author": "Allen X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-13", "description": "Weird, freaky and mysterious, yet irresistibly intriguing for newcomers. Warm, welcoming and emblematic about everything I love about SF for those who frequent it.\n\nEqually acceptable to be quietly reading a book at the bar -- under the reading lamp if you get there first -- as it is to be playing domino, raucously shouting and laughing with seven friends at one of the tables. \n\nPiano out back that gets a professional to sit down and play even late at night.\n\nEccentric gentlemen selling artwork and photos inside and out. \n\nCheap, strong dirty martinis, plenty of whiskys, Anchor on tap and Oly in can. \n\nA whale's penis hangs above the bar, while the bar's correspondence -- from correspondents flung all over the world -- sits on top of it. \n\nNothing else like it in the anywhere, in this world or the next. \n\nLong live Specs.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-21", "description": "Spec's is a San Francisco institution.  What other dive bar in the city can you walk into and feel like you're entered a local history museum only to take a deep breath and recognize the tell tale smell of a well used bar.  All the wood in this place must be fully marinated with beer from the years of usage.  It doesn't matter what walk of life you come from, once you walk in the door you're home.  I'd dare say that its the Cheers of San Francisco... you wanna go where people know, people are all the same, you wanna be where you can see, our troubles are all the same.  \n\nOne a side note: I've heard the old wive's tale that there was once a secret back door into the strip bar that is now the Hustler club.  Who knows if that is legit, but it doesn't matter.  I will always love Spec's for what it represents: the illustrious history of San Francisco's alcohol and subversive loving population.", "author": "Ms. M. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-12", "description": "Monday Night 12:00.\n\nFinally make it to Specs from Pearl's, were we find the other half of our group who were up to no good.  Sit down for some more drinks and I see a basket of cheese and crackers pass me by.  Another brilliant snack!  As we frequent this bar i have already ooo'd and aah'd over its beauty and enjoy conversation with my friends and all the neighborhood locals.  No specs sighting tonight.  Finally end our night at 2:00, so sad but it is Monday.  Can't wait for next week.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-11", "description": "What a cool little bar ! I didnt even know it was there until a friend suggest we meet here last week. Its cool. \nI met a random old man at the bar who decided to share his life story with us. \nThe service was quick and all drinks we served with a smile. \nAnd whats with the cheese????????? \nhe he \nI like it !", "author": "Amy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-07", "description": "It would make more sense to give Specs 1 star if it would keep the assholes at the kind of bars they deserve. I don't know what you're looking for expecting to find anything else at Specs than a good goddamn local bar. \n\nIf you want woman, go hit up the strip clubs up the street. Amazing customer service? Pay for it at the Ritz hotel bar on Nob Hill. You want novelty, I recommend Visuvios across the street.\n\nIf you're looking for character in a spot awash in history, this is it. I love this bar and the most of the people tending to the bar. My only complaint is that people that couldn't have a good time with a manual (Where is the party?) on their search for the unknown ruin the experience on weekends and leave confused reviews.", "author": "David V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "I was only in specs one time for about 15 minutes and I only had a Corona so I can't really say much about the place...the atmosphere is quite interesting, Tiki meets old dive bar, and the restrooms are clean and nice. But the main reason I am writing this review is for my boyfriend who believes that world should know this one piece of info...\n\nSPECS MAKES THE WORLDS BEST IRISH COFFEE\n\nNow, my Boyfriend is Irish, and his standby day time drink is Irish coffee...and he is VERY, VERY picky. He took one sip of Specs Irish coffee and told me I needed to write a yelp review on the place because it was the very best Irish coffee he's had in his entire life.\n\nSo there you have it...if you like Irish Coffee, go to Specs! OH, BTW...they will not make an Irish Car Bomb at this place...I only know because I witnessed a patron attempting to get the bartender to make one....she refused.", "author": "Summer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-05", "description": "Okay, I may be rating this lower because it's not really my type of scene - I prefer newer amenities, and not to be a bitch, but ya know what I mean?  It's like $12 drinks anywhere and I'm not sure what sets this place apart.\n\nIt was neat though, in a vintage sort of way - like passing a thrift store and thinking, \"Oh, that is so cool - I bet that dress was hot, in the 50s\"  but it's not like you can bring back an era - nor do I agree with montage dressing.\n\nAnyhow, this place had it coolness and a chill scene filled with a little granolas a little eclectic and some gay - gotta give it props for diversity.  \nMargaritas were nice, but like five sips small.\n\nNot a bad place by any means, but I won't be returning unless I'm with a group and we need to make consensus on where to venture to next.\n\nThe ambiance was like a funny little oddly shaped place, brimming with artifacts.  I'm deeming it Grandpa's Attic", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-25", "description": "Probably my favorite historical bar in the city. Dingy, dirty and antiquated, this place is a total time machine. I'd be shocked if anything's been touched (much less cleaned) here in the last 40 years. The bartenders here are curt, but get it right, and even though it can change on a dime, the crowd here always seems to be cool.\n\nAn all time classic.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-17", "description": "This is a classic North Beach bar. The cool museum-like artifacts that adorn the walls remind me of Tommy's Joynt on Van Ness. There's nothing like this bar. It's very authentic. I got to meet Specs at his birthday party. There was so much food and I kept ordering dirty Shirley's. I had a great time, but it's not a very young crowd. There's a lot of strange older men who hang out there. It's quiet and charming. Be good to Specs' and pray that a guy like Specs never leaves the world. I think it's the kind of place that writers are to hang out at.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-13", "description": "A lot has changed in San Francisco, but thankfully, change comes slow to Specs.\n\nI was first lured into Specs' in 1991 on my birthday by a haggard bar fly my friends and I met down the street at the SF Brewing Company. When she found out it was my birthday, she exclaimed in a gavelly voice: \"Oh, you have to have a drink at Specs! I'll bring you...it'll be okay.\"\n\nWe only found out later why it might not be okay.\n\nAnyway, we followed our bar fly friend over to Specs...which was actually down a short alley. The door was almost hidden in the back corner. When we walked in, a group of four men at the bar turned to stare us down.\n\n\"It's okay boys, they're with me.\"\n\nOur friend seemed to have some sway in Specs and they all went back to their drink.\n\nMeanwhile, our eyes had to soak up all the fantastic treasure hanging from the walls. Old WWII posters warning Americans about loose lips. A skull lodged in a hole in the wall. An actual letter in a bottle with all its history of correspondence. Maps. Gear. You name it.\n\nAnd then we had our fortunes read and drowned ourselves in cheap beer, counting the cockroaches scurrying across the floor toward the flooded bathroom. Classic!\n\nThese days, like the rest of SF, Specs is much more well-heeled. But it's still got a little edge and all the maritime treasures are still on display.", "author": "Ryan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-27", "description": "Ah, Specs.  This was one of my dad's haunts, back in the day.  \n\nThe predominantly male crowd are either young, bespeckled guys who use the word 'fella', as in: \n\n\"I knew this fella named Tom.\"  \n\nHaving you believe that they talk like Holden Caulfield all the time.  The kind who fancy themselves intellectuals, who think that because they have/still do, work/ed at City Lights , and they drink at Vesuvio's, and Specs, and the Saloon, and they get their coffee at Cafe Trieste that somehow all that makes them beatnik.   \n\nThe majority, however, are sad old guys who drink too much.  Guys my dad's age who still think they can pick up on you, and impress you with stories of way back when.  And how cool it was to trip on acid with Alan Ginsburg, or some shit.  \n\nApparently Spec's is also host to nude model drawing classes on Sunday mornings.  Gross.\n\nTwo stars for historical significance, both in establishment and in patronage.", "author": "Emily X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-26", "description": "Just had a happy hour with friends earlier today, and we decided to meet at Spec's.  I had never been there before, so I had no idea what to expect.  The bar was tucked away in a little corner, and if you were looking for a palce with a big \"SPECS\" sign, you'd probably miss it.\n\nThe inside is decorated with all kinds of weird stuff... a true \"museum\" of old items, including random street signs, old hats, ivory smoke pieces, etc.  We couldn't figure out if there was any theme... just as long as the item was old and cool-looking.\n\nThe crowd was a really random mix of old \"earthy\"-looking folks and younger people getting a drink after work.  Not necessarily the type of place I usually go to, but it was chill and a good place to hang out.  There was plenty of room, and the bar was easily accessible.  However, since NCAA tourney games were going on and there were no TVs, we decided to migrate shortly after arriving.  All-in-all, an ok spot.\n\nS uch a random assortment of old things inside.\nP lenty of table space and room to mix & mingle.\nE very type of person is welcome here.\nC an be a bit hard to find, unless you know what you're looking for.\nS imple and chill.  A decent place to get a drink.", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-02", "description": "Most interesting bar I've come across in San Fran.  They give you a big hunk of delicious cheese when you come in.  Lots of crazy and historic things on the walls and ceiling. Definitely a place to check out.", "author": "Darren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "Oh the brain cells I have destroyed in this bar! I remember like yesterday my first time there in 1995.....\nBack......Back........Back.......\n*bouncing in like a young scoolgirl* \nMe: \"May I have a Coors Light and a shot of Yager?!\"\nMark, The bartender : \"We don't serve that here!!!!!\"\nMe: * fluffing my hair* , \" Gee! Why Not?\"\nMark: *fluffing his hair*, \"Well, Young Lady, it's because WE are a union bar , and union bars DON'T sell Coors Light!\"\nMe: \"Oh!....But whyfore no Yager?\"\nMark: \"Because we have to clean our own bathrooms, Young Miss!\"\nMe:*brightning* ,\"Well, that makes perfect sense! I will have a Bud and a shot of Tequila!\"\nAnd that was the start of a BEAUTIFUL love story.... With both Specs and maybe just a teeny bit with Mark......!", "author": "Lara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-17", "description": "NICE cross section of pizza stained shirt fronts, aging conspiracy theorists and cute, drunk unattended girls being treated with care. I liked this place. God knows I would have liked anything after searching for parking on a Saturday night, but it was a treat to end up here. It almost had a wee Cheers feel, as in, there are some interesting regulars who actually enjoy newbies.\n\nThe drinks are STRONG and that is always the best recommendation for a bar. Maybe it's because they have been practicing since 1968. The place is owned by locals and it shows in the menagerie of art and commentary that this place can hang its hat on. I have included some other URLs with info ~ \n\nMake it your last stop on a tour of North Beach so you can get some sanity after weaving your way through all the bachelor parties and bridge and tunnelers tweaking on the full nudes. It is a welcome respite.\n\nwww.bestofsanfrancisco.net/specs.htm\nwww.sfgate.com/cgi-bin/article.cgi?f=/c/a/2004/01/26/BAG2C4HM0A1.DTL&type=travelbayarea", "author": "Miel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-15", "description": "Smelly, dark, and hip.  Come here to write the great-American novel or take a wiff of the B.O. which makes this place unique and a legend of North Beach.  On Wednesdays, their is a mtg of some writers (not sure who), but for one-dollar, you can pick up their weekly-zine.  SF poet laureate makes this his home.\n\nCash only.", "author": "Olis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "Hidden gem. Love the atmosphere. One of my favorites in North Beach.", "author": "Anny P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-11", "description": "Spec's is a pleasant little dive bar tucked away in a mini alleyway off Columbus in the North Beach. They have a lot of old dusty artifacts and photos decorating the walls.\n\nI enjoyed grabbing a drink and chilling at the back listening to the bluesy piano player finishing up his set before closing.  Not a bad way to end the night.", "author": "Sam T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-23", "description": "3 stars because it's unique and more adult for the area but no happy hour? 5 bucks an undersized pint?  Come on.  Nearly all the competitors in nb are half this price at happy hour at least.\nCash only to me is just bogus in this day and age. Pay the couple percentage points Mr. Owner your prices are steep enough.\nAlso no tv's so if you wanna watch a game forget it.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "Awesome atmosphere. Fantastic Sidecars. Specs reminded me of what it's like to indulge in a well-crafted classic cocktail.", "author": "Katie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-25", "description": "Love Spec's...it's one of my favorite SF bars.  I love taking out-of-town guests here as it has that feeling of old school SF.  Whenever I'm here I always feel like I'm the only person who knows about the place even though I know it's hardly a secret.\r\n\r\nIt's always confusing setting up a meetup there...some people call it Spec's, others the Adler Museum and still others \"that place in the corner in North Beach\". You'll figure it out though.\r\n\r\nSimple place with a nice feel to it unless your date likes to always order chocolate martinis like mine does.  I would stick to beer and simple concoctions of harder juice at this place.\r\n\r\nThe bric-a-brac hanging on the walls makes for good conversation once you get done talking about how confused you all were in finding the place.\r\n\r\nI've never had a problem with the Irish bartender but I can see how people would.  One time he berated a bachelor party that was getting noisy (\"PIPE DOWN!\") and another time a group of guys smoking pot outside the bar.  He told us that he doesn't have a problem with pot but \"He doesn't like the pipes!!\"  I found all of this funny (when was the last time you heard someone ask someone else to pipe down?) but if you get treated rudely yourself it's certainly off-putting.\r\n\r\nYou'll tend to meet a ton of local characters here.  Once I was drinking whiskey with a guy who was 93 and had a ton of crazy old school San Francisco stories.  Keep an eye out for Specs himself (you'll know him when you see him); he routinely hands out business cards and is quite a dapper fellow so keep your eyes on your lady!", "author": "Steve B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-16", "description": "as a grumpy bitter drunk, I love a place I can go an be grumpy with a rich history of grumpy people.", "author": "John X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "A quiet, tucked away bar with tons of style and no pomp.  Good drinks, good staff and a great location (where they aren't constantly blasting music).  This place is a wonderland of bric-a-brac (earning its wings as a museum) and even has an old dictionary for use.", "author": "Thomas G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "Great place with a nice divey, local feel.  With a decent selection of beers, even Olympia, and full bar, it is a good place to get a couple drinks and look around at all the stuff cluttering the walls, I was quite impressed to see a very old IWW banner.", "author": "Orin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-22", "description": "Have always loved this dive.  It's local.  It's not so hip.  It's retro.  And the secret is coming in after work, and leaving before 8pm.  The bartender from Germany is awesome.  Nothing like serving drinks, Gouda and no smile.  Love her.\n\nAfter 8, totally different crowd.  More of the tunnel crowd w/ their oh so naive nieces and nephews from the Midwest.  Can you say \" I think we're not in Kansas anymore, toto.\"\n\nRegardless, great rocking place.  Very subtle and hidden (sort-of).  Who knows you might find that Mr. or Ms. Right or maybe just Mr. or Ms. Right Now.", "author": "Rod '."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-09", "description": "Did you ever wish you were Herman Melville just off the boat, and ready to rid yourself the raincoat and boots and wax poetic about the white whale or the mutiny you seemed to have avoided?\n\nWell spec's is your place.\n\nMy personal favorite thing about this bar is that they serve gouda and saltines! (at least i think it's gouda, the circular whitish cheese wrapped in that waxy red coating???). There are grumbling foagy regulars that talk a lot of shit, and many seem to get kicked out. A lot of rogue traffic seem to pop in to start trouble....just like in a Melville novel.\n\nThe decor sports lots of martime regalia, and i love the lighting, this place is a good one to take your dad, especially if they like to drink.", "author": "wayne s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "Do not come here. I don't want too many people finding out about this place. I only accidentally hit the five star rollover. Nothign to see, move along!", "author": "Darren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Nice location, interesting clientele and decor. Decent beer selection - fourth star is because they have Olympia!\n\nWarning: there is always a homeless person sleeping in here.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-01", "description": "Probably one of my favorite neighborhood bars.  Everyone I've taken here loves the old European feel to this place.  I've yet to be disappointed whenever I come here looking for a relaxed evening in a bar filled with character.  At any given point there might be a couple of people at the piano playing an impromptu jam session or an odd character or two lurking in the corner with a story to tell if you're feeling chatty.  \n\nThe bartenders here are as full of character as the bar itself and who doesn't like a place that serves up wedges of cheese...heaven!", "author": "T V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-21", "description": "Star Number 1:  Cool bar in a touristy area tucked away from all the tourists\nStar Number 2:  Cocktails are well priced and taste decent\nStar Number 3:  Lots of stuff to look at when you've run out of money and aren't quite ready to leave and face the outside world\nStar Number 4:  It's a divey bar with \"character\" and lots of characters\nStar Number 5:  The big honking wheel of cheese.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-14", "description": "This was the third stop for a Friday happy hour with my co-workers and due to the fact that we had been drinking since 4:30 without dinner (and got here at 8:30), I have to admit that I don't think I really got a good feel for Spec's.\n\nI had a great time and it was a nice little dive, but I really can't give many details. Maybe it deserves 5 stars or maybe 3, but until I can go back in a more sober state, I'll have to give it 4 for now! But I'm sure I'll definitely be going back soon!", "author": "Elaine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "This is a classic in San Francisco!  I always have an interesting conversation with a complete stranger. The place exudes history!", "author": "Jeff F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-09", "description": "My favorite bar in SF. \n\nOrder the cheese and cracker plate, and watch the bartender cut a wedge of Edam off the round behind the bar. its a truly unique contraption. yes, a guillotine. like someone else already said. \n\nif you are looking for decent conversation, and some true history in a North Beach establishment, check out Specs.", "author": "david j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-04", "description": "A semi-secret North Beach gem soaked in locals, tourists, and weekend invaders; a genuine slice of San Francisco history. Its not hard to imagine the company of leather-handed sailors, one-eyed pirates, and beer-slinging wenches with all the museum relics from the Barbary Coast  or the presence of Jack and Alan at the end of the bar.\n\nBuy a book at City Lights, order an Irish Coffee and a block of cheese from the gypsy, and settle down at a salty stool for a Sunday afternoon read. When you need a break from the book, thumb through one of the baskets of postcards from decades past. Specs is authentic San Francisco at its best.", "author": "Eric .."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-10", "description": "If Vesuvio is eclectic, then Specs is downright peculiar. Strange art on the walls, stranger clientele.\n\nI love that the entance is not just off the street. To get in you have to intend to be here, or you must be curious. I like curious people.  \n\nI've had some strange times here, from handing hankies to girlfriends crying their eyes out over the perfidy of men, to happy silly times with easy rounds of beer.\n\nThe interior has a lot of wood which creates a very warm ambiance. Again, not a place to get a fancy frou-frou over-thought, over-priced paean to mixology. This is a charming place to drink with people you want to have good conversation with.", "author": "Claudius R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-21", "description": "A guy and I met here for a first date, and I definitely had trouble finding this bar, which was down a random alley near Broadway and Columbus.  Finally locating it, I was amazed by the decor.  I never in a million years expected this kind of dive bar in the middle of North Beach.  Junk is EVERYWHERE, which makes for great conversation and really gives the place character.  Whiskey shots ensued with the bartender and every time I've been to this bar since it's a tradition for me to have at least one shot of Jameson during my stay.  \n\nOne of the most random experiences I've had here occurred when a man in a full 19th century fancy suit quietly strolled in and sat next to me.  The bartender took one look at him, pulled out a huge wheel of cheese and within minutes had a platter for him- I kid you not.  Later on, the man went out to buy sushi for the bartenders and himself, leaving the cheese as a \"gift\" to my friend and me.  That's what I love about this place- the comfortable familiarity with random characters and how down to earth everyone is.\n\nOn a side note, the dive aspect of this bar results in terrible bathrooms.  Oh well, it comes with the territory.  Give this place a try for sure- you won't be disappointed and it's a great reprieve from overpriced North Beach bars!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "you wanna know what's nice about specs? people are happy here. HAPPY. \n\ni know weird, right? but think about it, who ever really looks happy when they're out anymore? if they aren't obsessed with how their outfit looks or trying to get laid they're pissed off they can't get a drink fast enough. \n\nnot so at specs. the crowd here feels very neighbor-y. people are wearing dirty jeans and tee shirts. they're wearing their comfy boots and jackets. they like it in here. they're drinking beer mostly and actually conversing with each other instead of pretending to be at ease when really their eyes are darting around the room like crazy cause they really, really need to get laid. \n\nif you skip the beer and opt for a cocktail you can rest assured it won't be weak. this is another place you shouldn't bother wearing any good shoes to, the floors are dirty and they like them that way.", "author": "rachel p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-18", "description": "When I looked this place up to review it, I wasn't sure if this was the right place until I read the reviews and looked at the pics.  But yes it is the same place.  \n\nSo it's a Museum Cafe I think, but to me it looked like a bar with a lot of probably historical stuff on the walls and decor.  I probably should have noticed it all more and maybe even tried to look at the stuff, but in reality, it was midnight and thought I was the driver for the  night, I just wanted to sit down with a sprite or something!  \n\nDrinks here are cheap, service is fast, everyone in here is happy and smiling.  Everyone in there was sitting at little tables having a really good time drinking and hanging out with friends.  Differs from the typical North beach scene, as it's casual, and you can hear what the other person is saying.  I guess because it's a museum, everything in here is older and more vintagey looking also.  Not a dive bar per se, but just a vintagey place I guess for lack of better words.  For awhile there was even live piano music which was nice in-between the great conversations.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-24", "description": "I dropped into Spec's for a birthday party, for this guy I didn't know, exactly, but he invited me so I showed up. That was last month.\n\nI've come back like four times. You can't get me out of this bar! But why is everyone calling it a dive? It's no dive; it's a sea shanty with walls.\n\nI guess I'd blown a substantial chunk of my paycheck when the bartender said, \"Four dollars, dear -- I'm buying your drink.\" What I'm saying is, you can cultivate your 'regular' status in two seconds flat.\n\nI've already watched several couples on dates here. What a good idea! This is my new favorite bar.", "author": "Jenn X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-06", "description": "Definitely a hidden gem. Will be returning next time I'm in North Beach.", "author": "Ravenna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "My favorite bar in North Beach. Douche free. Amazing  bartenders. Interesting regulars.", "author": "Vanessa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-30", "description": "Love the atmosphere here. Great dive and I love that it's a bit hidden from the rest of the North Beach shananagins. All bars should be required to have random crap on the walls. Makes the people I'm with all that more interesting.\n\nGot in a little argument with the bartender about the difference between a snake bite and a black velvet and thought he was being a dick, but we ended up agreeing to disagree and had a good chat about it actually. I guess I'll never know the proper name for that drink...\n\nI'll be going back", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-16", "description": "I'll wager that Specs is the one true dive bar in North Beach. It's like this little oasis of authenticity in a desert of tourism. I say this as a frequent , unabashed tourist of the area ... I'm the guy who comes through town on business once or twice a month and wanders up here from Union Square in search of books, booze and Beats.  Totally insufferable, and completely unapologetic.  If it means anything, I am on a constant quest to dine and drink where the locals do, preferring to eschew my own kind and find out where the quality of service and goods are both high enough to impress the residents. \n\nAnyhow, Specs -- all credit to my buddy Adam (now a full-time resident of the city) for turning me onto this place.  We once held up a couple of barstools here for most of a Monday holiday after crawling our way down the street from the Rogue Public House, City Lights and Cafe Trieste. We rolled in around 4:30 p.m.  4 hours and 4 or 5 whiskeys later, we realized we'd passed one of the better evenings of our acquaintance just sitting there, shooting the shit with the regulars, reading our books and sipping some of Ireland's finest (if you're keeping score at home, that means Jameson's). The bartender brought us some delicious cheese and Saltines and introduced us to her daughter, who'd just wandered in to show mom her new tattoo (a Hawaiian dancer with her mother's name wriggling on the belly). \n\nThe clientle is a good mix of crusty regulars doing their livers no favors, familiar writerly types who occasionally stop to post a recent poem on the bulletin board and younger patrons like me and Adam, taking the bait on all manner of conversational fishing lines.\n\nWe got into an animated discussion with one older regular over the meaning of the word \"Huckleberry,\" trying to discern its definiton from contextual clues in both Henry Mancini's \"Moon River,\" (\"my huckleberry friend\") and the movie Tombstone (\"I'm your huckleberry\"). I sought advice from Dictionary.com via my trio, and then Wikipedia -- but our partner in the back-and-forth was having none of it (\"All that Internet stuff is complete crap!\"). After disappearing from the bar for a good half-hour or more, he re-appeared at the bar spouting the definition at top volume, having gone across the street to City Lights bookstore to look it up in a slang dictionary.  \n\nThat's Specs. If you're looking for a shot, rube, keep walking.", "author": "Sean F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-27", "description": "I caught this place out of the corner of my eye when trying to flee Apartment 24 as quickly as possible. Wait a second.....cafe/bar and MUSEUM!!! \n\nI could sit here for hours looking at all that kitschy shit on the walls. Bartenders are awfully nice and they have legit drunks at the bar, all in all a great dive bar for me.", "author": "Kara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-08", "description": "When I want to sit down and drink with friends in North Beach I come here. \n\nIt's my favorite Bar bar. Do yourself a favor and have them slice some cheese for you. I believe it's fontina. They serve it with saltines and I wouldn't have it any other way.", "author": "Angela K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-30", "description": "Great old school SF place. Good mix crowd.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-05", "description": "The bartenders were great, the crowd was fun and the vibe was old time North Beach dive bar.  What really made it special was the guy who sat down and played the piano and shouted the blues like Booker T. Lawry in a New Orleans whorehouse.  Totally cool until somebody started requesting boring duelling piano bar type fare.\nFor the dude who told everyone that it was great to hear some James Brown when the guy played What'd I Say - well, I'm just glad you were digging it!\nCheck it out.", "author": "Steve G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-30", "description": "Cozy little bar across the road from Vesuvio's with way more character. The drinks are cheap, they serve beers in pitchers, and it is easy to get a table if you come early.\n\n$14 pitchers of Sierra is pretty awesome. Place is decked out with crap everywhere, but its a nice homely style of crap. Flags on the roof, and random signs are everywhere.\n\nOnly one gripe, make space on the bar for people ordering drinks. The barfly's never leave, and your always reaching over them to get a drink. It's not an uncommon issue here, make it easy to order drinks and I will do so.", "author": "Joseph T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "Been going here since 16 years old, this place is just awesome in every way. Defines what a bar with character is. My only advice is to avoid weekends because of crowds and the type of people they bring. Weekdays are much better. Additionally, they make a great martini though my usual is usually Jameson over with a beerback... \nI was happy the day they added beers to the tap (forever it was Bud only)", "author": "Brian Aaron J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-21", "description": "We tried to sing Christmas carols here and were told to leave by the female bartender on Sunday.  Bah hum bug Adler, guess you don't want 12 people to buy drinks.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "best bar in north beach- hands down. Great crowd - great bartenders-great drinks. \n\nThis goes for people who are more into the dive bar feel - meeting some strange people perhaps - story telling- looking at crazy shit on the walls.", "author": "Kelley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-10", "description": "Dive bar with flair (think Office Space) contributed by stevedores and shipmates the world round. This bar's character feels genuine.", "author": "Anton A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-21", "description": "Museums and alcohol...... SFMOMA, De young and Exploratorium could learn a lot from this place.\n\nAn experience worth experiencing.\nA place to sit worth sitting.\nA drink worth drinking.\nA listen worth listening.", "author": "Po L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-24", "description": "Is this place formally a San Francisco historical landmark?  It should be.  Check out the history of the place on the wall, it goes back a hundred years to early Chinese workers.  The bartenders are stupendous, from the men's room you get a view underneath the sidewalk above, the drinks are reasonable, and they have a giant wheel of fontina cheese.  It's where I meet friends when I need an honest bar and even more honest conversation, and where I take out-of-towners to show them a little local culture.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-07", "description": "This place is great.\nCluttered, quirky and low key old school neighborhood bar with a good mix of regulars, eccentrics and some touristy types (who don't seem to stay all that long, probably looking for someting a bit more north beachy)\nPrices are ok as is the service, neither are the reason most come in.\nAlways have a good time, though never had the time of my life.\nGreat for a drink and a conversation.\nOne of those \"gotta try it at least once\" places.", "author": "Sam R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-10", "description": "I had a wonderul party here for my birthday.  \nI even had Victor's pizza deliver a few pizzas here for the party goers.\nAll i can say is come here on a NON WEEKEND night and even if it is a weekend stay to see the old drunk men.  \nThey only do simple classic drinks, dont ask for a Cosmo here.\nOne of the best nights of my life was spent here retelling a beautiful story about my father, and as the old men bought me shots,  as they sang with me, laughed with me, and as my girlfriends sat around and chatted up a storm i began to rethink the idea of hanging out in North Beach at night.  \n\nSipping on a nice glass of whiskey, and watching the elder folk next to me getting yelled at by the young bartender, or sitting at the bar with a friend going through the old postcards whatever it be, Specs is a classic  San Francisco watering hole that has yet to be poisined by the modern day beat hipsters that walk the streets of the mission.  \nBUT!!!! on the weekends I'd stay away...thats when the dark side of the Marina comes out.", "author": "Tina d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "Oh man!\nMy favorite bar in North Beach.\nThis is where all the locals tend to hang out.\nI've made many friends here.\nI love the staff and the piano player.\nDon't let the crowds on the weekends scare you away from this bar.", "author": "Jess L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "refer to review also dated today for colosseo restaurant.\n\ngo to specs.", "author": "Mr G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-18", "description": "Quite possibly the best that old San Francisco has to offer. Don't go here looking for singles or that designer booze hitting the shelves these days. Specs is my old local bar where there is an eclectic mix of evreything and everyone. Sean and Dancer are gone but the bar is still one of my favorite hang outs. Check your attitude at the door and belly up to the bar for a drink. During the week is best when they have the postcard bins out. Read about the travels of the Spec faithful. \n\nI even found a postcard I sent from 5 years ago. Some things never change, I'm grateful Specs hasn't changed! Enjoy!", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-31", "description": "I, over the past several weeks, have said to my very supportive group of yelp friends \"I really think my 500th review needs to be about a bar, but one that means something to me. You know, one that is special, one that houses a lot of memories and has been there throughout my many years in San Francisco. What do you think?\", \n\nI expected a barrage of ideas. I thought these people were actually paying attention. I thought our times together were special and my stories were entertaining. I have given them a lot of love, and time, since meeting them. I am sure I gave them a pretty good glimpse into my life before yelp. \n\nInstead I was met with a whole lot of blank stares, a lot of unintelligible mumbling, the excuse \"You have already written reviews of all of the places we have been\" and the idea that I have no more bars left to write about. In short, I discovered that my friends have the attention span of a fifth of vodka. \n\nWell, bitches, sober up for just a minute! I have a whole lot of bar review left in this pickled brain, despite my best efforts to forget the last 6 months of my life and quite possibly other bits and pieces prior. You will not again forget that there are thousands of bars in this city, and that I have been to most of them. You will remember that there are plenty of places we have been together that I have yet to review.\n\nSpecs is the bar I have chosen to help me try to jog your memory and show you the way. If you have not been here with me you will go. I will tell you stories of other bars I haven't yet reviewed. I will get you drunk and reference your behavior in future bar reviews. You will learn to pay attention. Or you will get drunk and forget. \n\nOkay, now that we are clear, and without further ado, here is my 500th review;\n\nI have been to Specs at least as many times as I have sat down to my computer to write a review. I still don't know what the hell is hanging all over the walls. I am pretty sure they hang it all up to make you dizzy so you will throw up and they can subsequently throw you out (crowd control). Good thing I am a professional and would never get sick staring at a bunch of photos of convicts in their underwear getting ready to be eaten by a large stuffed fish. It is good that I am not a sensitive gal who would drunk cry over sad stories in small type. It is also good that they serve cheese, cut off a huge wheel in the middle of the bar. It is good that the people who drink here are patient enough to wait in the hallway while people do things in the restrooms. It is good that they have a bartender named Dancer, who is not actually a reindeer, because it would be hard to pour a strong G&T with hooves. It is good that they cleaned up the front and added urns of flowers and lights so that you don't trip on a homeless person on your way out. It is good that people are friendly, since the tables in the back are large and often shared by 10 people. It is good that there is still a place in North Beach that is not full of complete assholes trying to fight each other or grope you, depending on their mood. \n\nIt is good that my friends remember our times here...............\n\nwait, ummm....anyhow, just go to Specs. And try to remember why it is so good.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "On a weekend trip to San Francisco, my Husband and I stumbled upon this absolutely amazing little bar! The people were absolutely the nicest, even got a short history lesson of the building of San Francisco. The bartender was the sweetest...!! We felt like we knew her forever....!!! The memorabilia on the wall is fantastic...!!!", "author": "Wendy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-24", "description": "Odd mix of folks in this small bar. It might be refreshing at times, but also can get a little depressing. It also looks as though people take the opportunity to play all sorts of games here, from role playing to chess. So, if that's your bag, you might want to frequent this bar more often...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-17", "description": "It's Heinold's First and Last Chances twin sister.   Jack London would be proud.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-13", "description": "This bar, the patrons, the decor -- all of it made me want to kill myself.  Definitely a last stop kind of place.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "They serve cheese and crackers!  They let you order in pizza!  They pour Guinness properly (pour a bit, let it settle, pour a bit more, let it settle, top it off, serve)!  I freakin' love Spec's ... I just wish it was a bit bigger.  Oh, and the outdoor seating is a bench by the door!", "author": "William A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-07", "description": "It's supposedly divey but it's way too bright. You're not supposed to see who you're going to have awful drunken sex with when you're in a \"dive\" bar like this. Second, they have a Carlsberg sign on the outside but don't actually offer it. Don't be such a tease, Spec's!", "author": "Maria D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-26", "description": "Please don't come here. You'll ruin it for the rest of us.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-26", "description": "spec's has a million reviews and if you live in SF, i'm sure you already know spec's or been there etc.\n\nlets me say that i just don't get to spec's as much as i like.\n\nit's one of the best bars in san francisco hands down.\n\nit's one of the places in san francisco that makes me feel so lucky to live here.\n\nspec's is \"san francisco\" down to its very core.\n\nplus, the best fight i have ever saw happened in front of spec's.\n\nits wasn't bloody or drunk girls or midgets.\n\nit was two homeless poets arguing over bukowski and then started to throw books at each other from their respectful milk crates full of books.\n\nonly in north beach, only at spec's.", "author": "erik H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "Cool/bizarre SF place.  One of a kind with an eclectic clientele.  the rating is for the overall experience.  I don't know why, I just love this place...", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-08", "description": "This is a favorite of mine, although I'm rarely there due to it's location, anyways this is one of the few old time bars left in the city, it could be classified as a dive, but I think it's just old and original, and the best thing about it the place is they keep a wheel of cheese on the bar, so instead of getting peanuts or popcorn, you get cheese and crackers, and since the way to my heart is through cheese, I love this place.", "author": "JIll H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-07", "description": "i'd return again, but maybe not on a quiet weeknight between christmas and new years.  appeared to be a true san fran dive tucked conspicuously across the street from citylights books and attended by writers, their families, travelers and regulars.  small but respectable beer selection.  gotta love a place where the decor and fixtures though not necessarily authentic artifacts when first installed are through age and dust becoming historical markers now.  come for the cozy, inebriated and open-minded chatter.", "author": "Jen J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-06", "description": "There is a point in one's life, maybe after they've read and reread On the Road obsessively, or maybe after they've discovered how meaningful life is after a mushroom sunrise on Mount Tam, when the Twelve Adler museum seems more magical. But on an average night, after you've long tired of the modern day Columbus/Broadway nightmare, the nostalgia is not quite enough to sustain enthusiasm for surly service and average beverages.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-20", "description": "I was behind a gentleman who asked for a round of Irish Car Bombs. \nNow, most bars I've been to lately don't do these drinks for one reason or another, so I didn't think much of it. The bartendress said, \"I don't do those.\" Then he asked for the makings of a car bomb, just separate. She obliged for some reason.\nThe gentleman sat next to me and he and his party proceeded to drop the tumbler full of Baily's into their Guiness, splashing a little and complaining about how if she'd just given them shot glasses, there would be no mess. \nTwo minutes later, she storms over with a rag in hand and reprimands them for doing the carbombs. \"On good faith I gave those to you, and now look at what you did. It's disgusting, its gross. It's a mess I have to clean up.\" The whole party sat there wide eyed like 5th graders being yelled at. The man stammered an apology and she responded with something like \"YEAH, WELL.\"  After she left the guy wondered aloud, \"Well..why did she give us the makings for a car bomb then..?\"\nGood point. And sure, they were jerks for making a mess. But they paid to make a mess and to drink their drinks in an unhumiliated fashion.\nIf this is how customers are treated, I'm not entirely sure I want to return to this bar. Which is a shame because it's nicely lit, there's a piano in the back, there are neat old dusty things on the walls..I'm pretty much afraid to return lest I incur her wrath by spilling my beer somewhere.", "author": "Addyline L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-11", "description": "if this bar were a person, it would be some retired career bureaucrat who rents a dvd of \"the last waltz\" to remember the good old days when he saw The Band play.  places like chevy's, bennigan's, etc. stick a bunch of cheesy crap on their walls, too; the cheesy crap on spec's walls is just dirtier.\ni like dirty bars, and i like poorly lit bars, and i like bars that aren't completely populated with addle-brained scenesters and other douchebags, so this place is ok.  six dollars for a tiny little jameson and soda brimming with ice isn't too cool, though.", "author": "Mynameisdavid M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-10", "description": "Cooky little joint indeed. Bad news first, the beer selection kinda sucks and I saw some roaches. Now for the good stuff: The bar was really cool on the inside. The bar is decorated with all kinds of funny bumper stickers and other items. Your drinks are served by people who obviously care about your satisfaction. The space is dark and comfy.", "author": "Eric G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-20", "description": "When I walk around North Beach, I always end up either here or Vesuvio, located right across Colombus St. after all...  I like the atmosphere with yellow lamps which adds retro kinda feeling to my sight.  \n\nBut am I the only one that feels there are too many rednecks here sometimes?", "author": "T T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-09", "description": "Recommended to me by a former San Franciscan and one of the coolest bars I think I've ever been to. It's dark, it's simple and a little hard to find for an out-of-towner (it's kind of in it's own little nook), but it just has that comfortable feel. This would be my first stop in the event I end up in San Francisco again in the future.", "author": "Art Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-01-12", "description": "Specs does not like loud happy people. A few weeks ago I walked in with about 10 of my closest friends and as soon as we were loud and disrupitive they 86ed us.  They obviously don't cater to groups of people that like to talk.  If you're alone and want a bar and don't want to cause trouble it might be ok.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-09-30", "description": "A pretend dive-bar that has long rested on it's reputation (like Vesuvios). The head bar-person is obnoxious and not even in a friendly curmudgeon kind of way!  He is just rude and devoid of wit. 'Highlights' include a bad (flat) beer choice and moldy cheese.I guess this place is OK if you're a yuppie and you want to get insulted, but otherwise avoid like the plague!\nA fake-dive for those too damned scared to drink in the 'Loin.", "author": "Matt E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-11", "description": "Poor Specs.  I guess North Beach didn't always suck.  It used to be a fun place, so Specs settled in there.  Little did it know that one day its home would be overrun with douchebags and baguettes.  But it was too late to move.  Specs just has to sit there and take it.  Mind you, it mainly has respite from those types during the week, but they ruin Specs weekends without fail.  Some come to Specs during the week to make it feel better about itself, and let it know that it's not Specs fault that it sucks two days a week.  It's just a victim of geography, but cool kids still love it just the same.  They just can't be around it when Specs is being taken advantage of by people who don't deserve to drink.", "author": "Coco D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-10", "description": "What's not to like about a great bar with Jamesons rocks (my drink here for some reason) (and at 15 Romolo) (different drinks for different bars), and cheese at the bar.  As in, a great wheel o' cheese.  When I first moved to SF lo these many years ago, I'd go out every Wednesday night (um, I still do), and this (and the Noc Noc) were standard stops.  They are as great as ever.  Old school is good school, as I'm fond of saying.  At least, my old school.  (Then again, I'm in need of rules to impose certainty on an uncertain world.  Like certain bars are great bars.  There's right, and there's wrong.  Rules like that.)", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-01-18", "description": "The address is officially 12 William Saroyan Place- type that in, and you'll find the right map (otherwise you'll end up in Visitacion Valley!).  Adler is what the street/alley used to be called years ago, and apparently it's still valid as an alternate address.  It's a good place for simple drinks, but as my friend put it, 'it's not the place to get a pink grasshopper.'", "author": "Rego S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-13", "description": "I went here after my boyfriend's work Christmas party, with about ten coworkers. We were already drunk and Specs was very welcoming, excepting only for when one member of our group insisted on howling. It's divey like everyone says, which is a welcome thing in the craziness that is North Beach. I enjoyed it, but beyond that, nothing special...", "author": "Cyrelle D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-31", "description": "I'm rating last night's experience, not the bar. Love this place, been going for 15 years. Last night I brought a big group in, where we drank for 3 hours and tipped well. Guess we were being a little too loud, because without warning 3 hours in, the surly female barkeep we'd been tipping so well threw a handful of ice at us. Pretty funny yes, but also pretty damn uncalled for. I went over and talked to her, she admitted it, didn't apologize. I told her it would have been cool just to tell us to keep it down rather than throw ice, but she disagreed. We left. Definitely put a bad taste in my mouth on this place, which is a bummer, because I've loved drinking there over the years. Not a good way to treat your customers, specs.", "author": "Ben F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-06", "description": "Weird but entertaining dive bar on Columbus Ave. My favorite item of the \"museum,\" hands down, is the epic battle between the python and the mongoose--stuffed, dried, and frozen in time within a Plexiglas-guarded case. There is a bunch of other crap too but that's got to be the coolest item of random in there. Bar serves beer, drinks, and caters mostly to old men with long beards.", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-22", "description": "Sure, they haven't dusted or mopped in 10 years, but that's what gives this place its charm.  Bartenders are no-nonsense, and the crowd runs from former beat poets to young locals to girls just getting off work from Centerfold's.  In other words, it's a perfect cross-section of San Francisco.", "author": "Geoff K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-06", "description": "Like Vesuvios but more real.  I like to think of it as the real beat hang out.", "author": "Alexis M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-19", "description": "dig the joynt. its always been a favorite slide by later kinda place esp. with the types who're always bashin' no. beach. if you can get the seats to the right as you walk in, you get the benefit of an expansive view of the myriad of kooks at the bar and the freaks moving in and out for a butt. the bartenders are well worn old hands, look beyond their years and seem to emanate that 'what I've seen, you wouldn't believe' vibe. you just want to ask them a question and get em rolling. \n\nits a good place for bud on tap, just feels like you'd be overdoing it otherwise.", "author": "tommy p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "One of the best bars around. They have a limited selection and the bar staff doesn't seem to give a shit. But there's something about the atmosphere that keeps bringing me back...could be just the booze talking. There's often some drunk foreigner who will chat you up, the crazy old Asian dude looking for 'sexy sexy' and a hobo waiting outside to sell you some art. Good times!", "author": "Colleen B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-12", "description": "Dive bar that tries to hide from the beaten path. Great place to hit when you've already drank too much.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-06-18", "description": "Not a great bar, but pretty cool inside. Think divey with a bit of old-timey and just a hair of voodoo. Very weird place. Still, having said that if I'm in the area I'll always stop in for a drink.", "author": "michael c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-04", "description": "This bar is the definition of \"mixed bag.\" Always a random crowd,  I have had ice thrown at me by the bartender, and a pizza bought for my friends and I from a firefighter. Cheap pitchers.", "author": "Sara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-10", "description": "A friend and I were convinced into going here while at the superior bar Vesuvio across the street by two strange Italian men. A homeless man interjected as we read the blurb about the bar outside before entering (that declared it \"the place to go to write poetry or a great novel\"). A trip to the bathroom introduced us to a disheveled woman rinsing a bouquet of roses while waiting in line for the toilet. The people who were here were characters, all right, as the bartender appeared drunk and haggard as he overreacted at our knocking an empty glass over (though not breaking it). The drinks were in small, toy-sized glasses and it was comical to watch grown men drink cosmopolitans. The people in attendance were interesting, but more in appearance than conversation. Perhaps a novel would not be the best thing to write here, as this joint yields better material for a stand-up routine.", "author": "Kristin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "Awesome sailor's bar.  Ok, so there's not many sailors here any more, but you can come in and pretend you are one.  Worth coming just for the awesome stuff on the walls.  It attracts tourists, but it's not really that touristy, it's just damn authentic.  What more can I say?  A must-stop for lovers of old-fashioned bars.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-07", "description": "This bar is from a different era, and that's why I like it. It's part gold-rush, part beatnik, part world war two, part speakeasy and it feels like you are inside a twisted wood cabin. I think it may derive from the lantern lighting. Hidden behind Tosca's, across the street from Vesuvio's, it makes one feel like it is your own secret bar.", "author": "Netty L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "I like that Specs is hidden from view, thus escaping the crowded, loud atmosphere of North Beach on a busy night. I also like it's unique collection of artifacts, posters and pictures. I like that you can order cheese and a big ole basket of saltines for $4.  I'm not sold on the price:size ratio of the mixed drinks. I know North Beach serves up notoriously small cocktails, but c'mon.. Specs has a different vibe and a different clientele, they should subvert the dominant paradigm!  Small, casino-sized cocktails with tons of ice cost at least $6 a pop before tip.  I also noticed that there was only one bartender working on a busy Saturday night. This made for slightly slower service.", "author": "Jenni D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-15", "description": "Why do I love Spec's? First, they have a gigantic wheel of cheese on the bar that they cut with some huge medieval knife. Two, it's a museum you can drink in. Third, they have the best Irish Coffee I've ever had, or, at least, the most serious Irish Coffee I've ever had. This is the kind of place where you can sit and drink and feel completely comfortable and content.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-18", "description": "I used to live right Specs and it was a perennial favorite for an old school bar experience- less sexual posing and more honest drinking.  Biggest cheapest martinis in San Francisco.  Yes it has some tourist elements but it is just weird enough to be truly funky.  Don't take any high maintenance friends there unless you're both looking for a place to smoke indoors.  The cheese looks odd but is really good.", "author": "Margaret F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-09", "description": "This is a stellar locals bar in North Beach tucked in a little side nook off the street, Spec's is a great place to have a beer and hang out for a night. You gotta love those wood bars that have the same kind of random item decoration you'd see in a Chili's or TGIF's. Now keep in mind, it's places like Spec's that did this all years and years before those craptastic chains got going. Random signage? check. Historic artifacts? check. Beer? check. What's not to love. Have dinner in North Beach and stop in for drinks, you'll thank me.", "author": "Andy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-24", "description": "One of my favorite hidden bars.  The vibe is tranquil but warm and alive.  Perfect place to relax in the fast paced city.  Enjoy an Irish Coffee when it is cold and catch up with an old friend.", "author": "Shiho F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "Great place to hang out with other bitter single friends on Valentines Day. There was hardly anyone there and the drink were super cheap. Good if you wanna go grab some beers and actually be able to hear what your friends say.", "author": "Erin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "Specs is kind of tucked away in a corner and can easily be missed, but if you do spot it you should step in.  It is a great place to start the night.  It has a relaxed atmosphere and plenty of room to sit around a table and chat with friends.  There are plenty other bars located nearby to check out once you are finished here.", "author": "Carly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "coolest bar in north beach.... and i really dont care much for north beach. Bit of a hidden spot off the main drag from the rest of the north beach fan fare. Diverse crowd, chill vibe, very cool decor and ambiance.", "author": "Kelle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "Just a good old bar but a solid one to spend time over a drink and conversation without all of the bad attitude and snooty bull you encounter over at Vesuvio's.  These guys win every time.", "author": "MJ M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-08-19", "description": "Very cool, old school kind of dive. Seems very mobby, and we've definitely seen some guys wearing spats and packing heat while sipping on our cocktails. Watch what you say in there!", "author": "Mariangela S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-20", "description": "I can't explain it. Why or how I end up at this place when I'm in SF and end up having a fantastic time???!!! It's totally a dive, completely random and completely hidden off on a side street. I simply can't explain it. If you like a place to avoid all the chaos of North Beach head here to have a cocktail. Cocktails are very reasonable and strong.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-25", "description": "My boyfriend's favorite bar. I like that it's kind of out of the way. People formed a makeshift band outside and were playing an accordion, a guitar, a drumset(?) and a banjo. That was pretty rad. The clientele kept to themselves and weren't there to be loud idiots on a stag night. I got to chat with an old biker dude who had some awesome SF stories. The bartender got us drinks, even gave my friend a triple when he ordered a single. She wasn't sitting around chatting us up, but she was busy & I don't need bartenders to pretend I'm their best friend anyway. I liked the atmosphere, excited to go again!", "author": "Ljótur H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "Part of the Beatnik trifecta of Tosca and Vesuvio, The Adler Museum is a strange little nook tucked into an 'alley' that is really just a cyst that has grown out of the sidewalk on the east side of Columbus.  Filled with various ephemera such as old signs, pictures, and dioramas, Adler's is almost like a museum that serves stiff drinks.  The music isn't bad either, and the bar is nice, and inexpensive.  Three drinks (a vodka tonic, a screwdriver, and a Trumper Pils) came out to $15, which is pretty good in my book, even if Adler is a touch divey.  Also cool to see Lo Pan, or a guy that looked just like him, kicking it in the bar with a guy wearing an ascot.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-07", "description": "Jeez, why do i like this place so much?  Is it  because it smells, terrible like an old bar should? Is it because of all the bizarre and sublime  bric-a-brac on the walls?  Is it because it's the only North Beach watering hole that isn't crowded during Friday happy hours?  Is it the fontina cheese and saltines available for purchase and consumption? Or is it just because they provide cold beer in pitcher form after a hard day at the cube?  I gotta crush on you SPECS and it ain't puppy love.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-25", "description": "Favorite bar in North Beach / Chinatown area (note: not Nob Hill) to get away from the North Beach / Chinatown area. No nonsense. Get some beers from the groggy bartender and huddle around a wooden table.", "author": "matt c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-09", "description": "Played UNO there last night...met some totally sweet people. Got yelled at by the bartender, but made the bond with my new pals totally stronger. Ate the cheese and crackers again - totally delish.", "author": "Katy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-03", "description": "I totally dig Spec's. They serve Chartreuse here, one of two bars in the city that I know of. Since I'm fond of Chartreuse, and not fond of trashy, overpriced, touristy bars, Spec's is the bar for me. It's comfy, dark, and they know how to pour a Guinness. The Fontaine cheese is great, the ambiance is mellow, unpretentious and friendly. Hands down, my favorite bar in the city. The decor alone is worth the trip!", "author": "elizabeth d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-02", "description": "Argh Matey. . . .that's what I think when I walk in.  Feel like I'm back in the Moby Dick era with sailors smoking their pipes, playing cards and talking with foreign accents.  Okay, so I have an imagination, but that's the Pisces in me that I can't help.  Hidden in a semi-alley, where its quiet, not routy, loud or over complicated.  Just an old school bar with old wooden floors, trinkets all over the place, full bar and a bunch of old timers that you can tell, are regulars there.  I'm sure they have great stories to tell, but some, you can tell by their facial expressions.  They're saying, don't talk to me, don't smile at me. . . I'm just here to drink alone, period.  Definitely intriguing to me.  I love to analyze those type of loners and create a story in my head on why they are such a grouch.  They have board games there too and prices are decent.  Definitely a hidden gem to scope out if you're within North Beach and Chinatown.", "author": "Janice F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "I have been 86'd from this place before after drinking too many shots of Bushmill's, then went straight over to the Bow Bow and had a total blast.  What a dive!!  If you hate this place then you are a dork.  For real.  Negatrons will never change, so stay far far away if you don't like real people and real atmosphere, and real shark teeth.  Whatever happened to the lady that reads palms?  I miss her.", "author": "Barbra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-06", "description": "Apparently San Francisco natives were created here. Admittedly, the parents of my friends got laid here years ago. Why stop now? I say this little, heritage north beach bar should carry on the tradition. With the cheap drinks galore, perfect setting (surrounded by our uber-classy Broadway strip clubs), and of course the San Fran crowd, you have the perfect elixir for some new-baby-makin evenings. Get busy folks!", "author": "Rada I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-26", "description": "Spec's, I will never forget you. If you ever get the chance to talk to Sean, ask his about the 70s. Some of the best stories you will ever hear about San Francisco.", "author": "courtney t."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "i like specs a lot, and it is one of my favorite bars to go to enjoy a few drinks and to carry out an (hopefully) enjoyable conversation. as i have mentioned before, i don't typically go out to bars in an effort to meet new people, but rather like to spend time with a few close friends. this bar is very conducive to that. and if you DO have the urge to talk to strangers, this is also a great place to meet more than one interesting character. the crowd is generally older, but i could care less.\n\nif you find a lull in conversation you can let your eyes case the joint and take in the miscellaneous memorabilia covering the walls. it's also fun to read the changing messages written on the outside chalkboard display. \n\nalso: the bartenders are all terribly nice.\n\ni wouldn't mind living in north beach, and if i did, i could see specs becoming my regularly visited week-night bar. it's perfect for a mellow evening soaked in whiskey and chit-chat.", "author": "Kayla K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-07", "description": "I definately reccommend this little place. It's got a really good vibe, hidden from the immediate street. The inside is decorated with a ton of stuff, and is lit to suggest that at some point the hobbits stopped here for a drink on the way to mordor. Also appropriate for the people up front playing magic: the gathering. All nerdy-ness aside, this is a great place for groups as there's several tables as well as the bar. We went on a Monday night, and it was fairly empty, but I hear from some friends of mine that it's a great place for a Friday or Saturday night. Cheers!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-19", "description": "Specs is a fun little bar hidden right of the main Columbus St. drag - all the locals I bring here always say \"wow - I didn't even know this place existed\". Even at their busiest its never really \"too busy\". You can usually grab a table and a drink without too much trouble. This plus the fact they have CHEESE (alas, not free though), plus all the awesome and/or crazy stuff they have all over the walls makes it the perfect spot to hang out and recuperate before hitting the craziness that is North Beach again.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "I could have sat in that booth all night.  There is just a nice feel to this bar that made it hard to leave.  It makes you feel like you are in someplace special -- where things used to and still happen.  Very Romantic San Francisco ideals I guess.  One more reason to think about moving to North Beach someday.", "author": "Johanna w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-19", "description": "Another North Beach Classic, this place is charming.  One of the last places to actually display a sense of the Barbary Coast.  Appropriately located across from City Lights and Vesuvio, and next to Jazz at Pearls and Hustler's back door, Spec's is a throw back bordering on Nostalgic, like fisherman, bums and beatniks used to party here as kids in the mission think they party now.  Laid back, but not a drunkards bar, though it looks like they may have been there decades ago.  They have cheese and crackers for you, interesting reading selection, and the requisite scary bathrooms for every bar  in north beach.  Again, it just adds to the charm.", "author": "Christian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-09", "description": "For that one perfect night when we got the round table right next to the honky tonk piano and drank Manhattans (or were they Old Fashioneds?).", "author": "Saskia v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-19", "description": "Spec's is a great dive that has been around FOREVER! It's sorta hidden in a little nook next to Jazz at Pearl's. Sean, the Scottish guy behind the bar, has a million great stories to tell, and he makes a MEAN Old Fashion! During the week, they set out baskets of old postcards sent from sailors, etc. during WWII \"looking for the American Dream.\" Get a basket of cheese and crackers and try the Hefeweizen!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "beer. i like it. and they have great selections. case closed!\n\n(oh yeah - the history and the pictures and the bar stools and the kooky captions of weird items on the wall also make it pretty entertaining too. i feel like i'm going through a time warp when i step into this place.)", "author": "Jenz y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "I've lived in the area as well as worked basically around the corner from here for over 5 years  and visited last week for the first time. Had a girl date with the SF BFF and suggested we just walk from work. I asked if she ever went to specs ad shed never heard of it. So we wandered over. Um, outside patio is cute, then you walk inside and its a smelly dive with old adventurer type stuff on the walls (we compared topossibly what indiana jones would put on the wall, but not so amazing). We sat down and both being winos asked if they had a wine llist and immediately were embarassed that we did. No wine list one red or one white - ok two reds it is. then my buddy asked if they might have any food or snackies - cheese and crackers was her reply. Again we just confirmed our being out of place and new to the joint. But she brought us some snackies and we were good for the night. there was a random mix in the bar had we of stayed for a few hours I'm sure we would have made some new friends as there's not pretension in the air at all. But we left after our glass-o-red, but i did leave thinking that I've gotta bring my dad back here, he'd love it and wander around looking at all the treasures and signage around the bar", "author": "Audrey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-18", "description": "Yeah, live within walking distance of North Beach area and rarely go there, but one night we ended up at Specs and it was a pleasant surprise.\n\nWould go back and bring friends.", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-02", "description": "what i like about this bar is they pour a stiff drink. we had $6 vodka tonics too small for my liking but the bartender we had poured the glass nearly full with vodka then a heavy splash of tonic. when we go over to north beach we will usually stop in here for a drink or two. i like the way it feels inside. good mix of people. maybe i would feel different if i had to deal with the bartender with attitude. never met or been there when he was.  tourists and locals go here which i like. i don't have a problem with tourists as some do. not sure why one would have problems with that. i get to talk up our city and hear about them and where they come from. then move on.", "author": "roger b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-07", "description": "One of my favorite bars in the city.  The beer selection isn't fantastic but it's good enough, and the atmosphere is as good as it gets.  It's a dark hovel filled with bizarre crap and eccentric locals.  If you're into dark, charismatic watering holes, this is the spot.", "author": "Barry Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-01", "description": "Ah...good ol' Specs.\n\nEvery memory i have of this place is a fond one...(and for the ones i don't have, i thank the bartender).  Certainly not the hot spot for the hipster set, but thus is the basis of it's appeal.  Specs is the consummate 'neighbourhood watering hole'--where everyone seems to know everybody else (in a completely unpretentious way), most of the crowd are aging North Beach denizens, gossiping and swapping armchair radical politics and conspiracy theories...like a doughnut shop that sells booze.  Frequently you'll find the resident pianoman playing ragtime in the back, and there's usually a jam session composed of patrons, neighbours and the occasional bindlestiff nursing a Steelie out front.  Perhaps it's the quirky decor (the '12 Adler Museum' itself) that gives the crowd something to aspire to.  Strange maritime artifacts, masks, stolen signs, a quasi-Egyptian sarcophagus with moving eyes and spectacles cover the walls, and draw the gaze of many a drunkenly lazy eye.  My favourite:  the sign above the bar notifying patrons, \"We reserve the right to serve refuse to anyone.\"\n\nAnother of Specs' finer qualities is that steady business from neighbourhood regulars removes any need to tolerate bullshit from the bridge-and-tunnel fratboys/meatheads that make North Beach a rather miserable place on Friday/Saturday nights.  On more than one occasion have i been in Specs and seen loud, overweight twenty-somethings in \"Frisco\" hats walk in smelling like the strip club they just left, only to be tossed out in no uncertain terms by the bartender.  \"Spring break's over, asshat, better go back to Concord.\"\n\nA word about Specs himself, the bar's owner and namesake.  He bought the bar in 1968 (it apparently used to be a lesbian speakeasy), and he's been among the most adored neighbourhood personalities ever since.  Known for his generosity and quick-witted deadpan, Specs also hosts an annual celebration in honor of the man who saved his life.  Practically the whole neighbourhood shows up, and lots of people bring food to share.  The result is an impressive spread, and everyone's first drink is free.\n\nDefinitely the place to rub elbows with the locals...definitely NOT a tourist place...", "author": "J. Brandon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "OK, sure, I'm there as a tourist alright? Though it's not as though I'm exactly new to the place. First discovered Spec's when I stumbled down the stairs from the Garden of Eden above looking for the john. Figured it was some sort of den of iniquity at the time (this was about the early 70's, my how time flies) and didn't really put it together as \"Spec's\" until a friend \"Art\" took us there in '79 and introduced us to Gary Snyder (who was mildly underwhelming btw). Anyhow, tho not a native of The City, I make it a point to check -up on the esteemed establishment every few years when I return to The City as a tourist. So come the last day of February I'm showing my sweetie the sights and 12 Adler is on the list. We pull up a couple stools at the bar, you meet a better crowd that way, and the first thing I notice is how clean the place is, someone has actually spiffed the place up. Same funky stuff on the walls, just now it's not covered in smoke-crusted dust. Strike up a chat with the local guy next to us and he introduces us to Lucy who's tending bar (manager maybe). Lucy is one sweet lady, friendly, welcoming; who later in the evening actually buys us a drink to celebrate my companion's first trip to The City as a real grownup. Now, how nice is that? During the course of the evening a gentleman started playing the piano in the back, looked to be a customer, and laid down some sweet licks, old show tunes just smooth as silk. Anyhow the vibe is easy-going, funky, warm, friendly; just a nice, relaxing place to hang. And Lucy is real class. I'd give it 5 stars, but I don't want you to think I'm 'just a tourist'. Maybe not quite the place to carry on and flout your hubris, perhaps you can find that on down the street.", "author": "gary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "specs won my heart the first time i stepped through the doors and was overwhelmed by the sea-faring ephemera on the walls and ceiling. one of my favorite things is going for a walk up telegraph hill, winding down through north beach and then capping off the daytime stroll with an early evening drink at specs, perfection!", "author": "rachael s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-22", "description": "It's good to still have a place like Spec's around.  A barroom that lives up to the very definition: \"a room or establishment whose main feature is a bar for the sale of liquor\".  But along with this simple purpose, Spec's provides an atmosphere where the people and conversations flow as simply as the drinks and once you enter, whatever your station may be outside, you're just like everyone else on the inside - a barroom patron, there for a good drink and some honest conversation.", "author": "greg d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-18", "description": "Just for the record, it is spelled Specs', not Spec's. I think Specs is great. To me it is a welcome oasis of relative calm and genuine SF flavor in a swirling ocean of douchebaggery that is presently North Beach. I dig the lighting, the furnishings, the museum, and everything else about the joint except for the occasional clients who really don't appreciate Specs' like summa you oblivious types. First, off, for those of you who complain that the bartender asked you to quiet down because he/she did not appreciate your rendition of 'We Will Rock You,' ease up - house rules. There are plenty of bars where you can do that (Marina Sports Bar comes to mind). Also, this is a professional drinkingman's bar, not a place to order douchey frat drinks. Stick to beer, whiskey, and simple mixed drinks. Irish car bombs are for douches and probably don't go over that well with the Irish bartenders. I know a lot of you like places to be super loud so you feel that you are important, but Specs' really isn't the place to see and be seen. It is the eye of the hurricane; it is a place where you can take a book and even write a bit if you want to. There are plenty of establishments where you can bray like a donkey and \"get stupid,\" (Blondies comes to mind), go there. Leave Specs alone and let us who enjoy it the way it is, continue to enjoy it.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-10", "description": "This was stop # 4 or the birthday pub crawl for one of my friend's, but it was actually the only stop that I made. It is located off of Columbus in a tiny alley. Look it up before you go. Didn't know what to expect and was pleasantly surprised. On this night, there were a few people playing guitar outside the front door. When you go inside, it is dimly lit and there's a lot of random stuff on the walls. Most notably, a lot of old time nude women photos. There's too much random stuff to mention, you just have to see it for yourself. There's a piano in the back with a piano man playing tunes. My friend did get him to play happy birthday for her. Another nice thing about this place is that you don't get the feeling that you should order a certain drink or look a certain way to be here. You can just show up and hang out. I'm sure there's a lot of places like this, but, it was more apparent here. Anyway, minus 1 star for cash only. I", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-15", "description": "The best bar experience I have ever had was at Spec's. and I have been to a lot of bars. I have been going to Spec's for about five years now, and about a year ago I was in there with my boyfriend and while we were sitting at a table drinking a little man was busily spinning colorful, metal, toy tops on his table. He must have had about twenty of them. Then he started scrawling in his sketchbook. Meanwhile the hunched, well dressed, man with a beak, whose name I always forget, came and began to play ragtime music on the piano. Then a drag queen in a blue flapper's dress with a torn shawl began singing Edith Piaf to the piano player's music. She fanned herself with a lace fan that had spines missing from it. She looked like Katherine Hepburn after 40 years of heroine use. Then the little artist man got up and delivered a picture of my boyfriend and I that he had scrawled. About this time the drag queen stopped singing, and started arguing with the bartender. The piano man kept playing Edith Piaf. The bartender finally came, grabbed the belligerent drag queen by the arm, and they started to struggle with each other. Then out of the darkness from behind the piano a tall, beautiful black woman steps out and finishes the Edith Piaf song while the bartender pulled the drag queen out of the bar. It almost made me want to quit drinking because I knew I would never have such a lovely bar experience as that. I have had some that rivaled it, but not in the same genre. In short I would recommend this bar to magical people, and hope that yuppies, ignoramuses, and ultra-hipsters stay away. It's nice to go somewhere where there are old people in love, and drunks throwing their lives away.", "author": "Lindsey H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-08", "description": "Nice place to hang out and socialize. What more could you want?", "author": "Dustin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-15", "description": "this place is fab.  ill never forget this one time the when the bartender broke up a fight i was having with my boyfriend....classic...AWESOME local bar.  warm, cozy and social.", "author": "Laura J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-04", "description": "The Best! Simply the best...I've spent many a day at this locale. It's a great place to drink in North Beach, it's where all of the locals wet their whistle. Dive Bar Heaven!!!!!", "author": "Conspiracy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Spec's is my favorite bar. Most reviewers have covered all the bases so I will not go into great detail. Just know that this bar has unparalled atmosphere. The crowd is often an interesting mix of seasoned drunks, young hipsters, and the occasional, annoying tourist. GREAT BAR.", "author": "jason m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-14", "description": "Ah, another S.F. institution. You can meet anyone from sex workers to old drunks to the Russian mafia to tourists in this bar. The bartenders are generally pretty cool too. Not a bad pint of Guinness. Drinks are strong and cheap. Overall this bar has a lot of character, and none of the pretension in an area increasingly invaded by the \"Who is your daddy, and what does he do\" crowd. Crazy characters hang out in front too, sometimes selling art. I had one dude refer to me and my left-leaning, if not socialist, friends as \"sadists\". I'm not sure what prompted that, as my memory was a bit foggy due to the Whiskey and Anchor Steam, but I found that humorous. Also watch out for the old black guy with the dildo (not that he's dangerous, just frickin' hilarious).", "author": "Jeremy J."}
