{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "One of my new favorite restaurants in Chinatown! I tried it for the first time a month ago when my mom suggested it, and we had no expectations, so we were pleasantly surprised!\n\nSpicy Numbing Beef Tendon ($7.95) - oh my goodness, SO delicious. Perfect texture of the tendons, great flavor, nice big pieces and awesome portion. Will order this every time I come here from now on.\nGuiling Rice Noodle Soup ($9.95) - also SO delicious. I really didn't expect much from this but the broth was really flavorful, a little spicy and a little sour. The consistency of the rice noodles was great and I enjoyed this very much. \nTempting Hot Pot - Combination, Chinese Herb Flavor (forgot the price) - this was good too! Didn't blow me away like the other two did, but still tasty and had a good amount of ingredients in it. Came on a burner that stayed strong throughout the meal. \n\nService was whatever, but I have low expectations for Chinatown. Interior is clean and decor is nice. There is a great hot sauce on all the tables so don't forget about that. Definitely excited to come back again to try some other dishes (but still order the beef tendon)!", "author": "Nicole M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-11", "description": "I'm going to try to keep my personal opinions out of this, here we go! \nIf you like spices and alot of flavor going on in your mouth come to spicy king!\nI shared the Fried rice and duck boiling pot with my mom (could probably comfortably feed a 3rd person) so the portions were great/family size. \n I'm Mexican so I'm used to the typical Mexican heat, spices, and chilies. Duck Boiling Pot-There was lots of unfamiliar spice and heat-different then what I know which was great and all but the duck meat was cooked on the bone, with the fat still on. Which personally isn't the way I like my meat prepared. It was a bummer because you really had to work around the bone and fat, and after working through it there was hardly any meat to my pieces (unless my mom got to them before me ;)) So just imagine the scene you're doing the spicy pant with your tongue trying to gnaw your way to some meat LOL \nFried rice was some of the best I've ever had (a little on the salty side) just how I like it-super flavorful \nThe service lacked a bit of.. refinement the waittresses stood near our table the whole time we were there and didn't seem to do it for any beneficial reason, just mainly as a space to chitchat.  \n\nI'd definitely be back! Although I'd be less adventurous and stick to the usuals Beef broccoli, chow mein, fried rice", "author": "Deanna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-25", "description": "I marked down stars based on the service.\n\nFood recommendations: house cold noodles, numbing noodles, and house fried rice.\n \nService rant: I've been here a couple of times now and the service has been alright until recently. I came here with my boyfriend a few days ago since this is our to go spot whenever we are in Chinatown and when we were done eating our food and asked for the check. Instead of putting the check down and letting me look at the bill to get out my card to pay, the waitress simply just held it out and said to me it's going to be $25.00. I wasn't given time to go over and look at my bill, only a quick glance. After that when I got my card back to sign, another waitress came and was rushing to get back the check that I signed. I wasn't even done signing yet and she kept rushing us and saying how she really needed this bill and quickly took it. Overall it was really rude. Keep in mind that restaurant wasn't even packed at the time I went..\n\nFood: Besides the service, the food is pretty good here. My go to orders are usually the numbing noodles and their house fried rice but I recently tried their house cold noodles and it was so good!\n\nNumbing noodles- if you are a fan of spicy, you would like this. Like the name, you get a little numbing feeling on your tongue from the chili and spice. It's covered in this chili oil and overall it's really good. \nCold noodles- Even though I usually get the numbing noodles I think I like these noodles more. You also get a lot so it's worth the price and it's also delicious.\nHouse fried rice- this is probably my favorite fried rice I've had in a restaurant. It tastes better than most fried rice I've had in the Chinese restaurants I've been to. \nExplosive chicken- It was okay. It was kind of like popcorn chicken/ chicken nuggets but a little spicier. A little saltier than most chicken nuggets/fried chicken.\nKung pao chicken- need to eat this was rice otherwise it's too salty to eat because the sauce is flavorful. \nCucumber side dish- it was sour and I personally did not enjoy it.\nOverall I recommend the food but the service is sometimes off.", "author": "Kochamon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "It is a 3.5-star review. The food quality for my visit could only 3 stars. The spicy lamb chops are very salty and oily. Also, the majority of them are fat instead of a combination of lean meat and fat. At least 60% are fat, not meat. Maybe some people prefer this style lamb chops, I am not the big fun of fat. I am so upset with the food quality.\n\nThe waiter could realize 4/5 stars. Everyone is friendly and professional. I reported that my lamb chops are too salty. The waiter helped request re-processing quickly. Unfortunately, it is still kind of salty and too oily.", "author": "Xuan Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "Despite the service or lack of service, I'm still a fan. I was here with my dining partner 2015. Coming back for another visit and was craving spice, we landed here again. We came for lunch, upon arrival it was crowded. all front tables we taken. We were shown to the back tables that were private. Just then I had the feeling we were going to be the forgotten children,,, and I was RIGHT!\n\nAfter we were seated it took a bit to get our menus which then they took our drink order right away. Our beers we ordered came, and at that point I made the server stay to take our food order which was the Pork Belly in Spicy Garlic Sauce appetizer and the Spicy Garlic Flavored Prawns. The dishes seem to take forever as 2 tables next to use with a party of 6 that sat after us were getting their dishes. Finally we got our 2 dishes and I have to say they were excellent. Perfect heat, the right amount of garlic and the quantity of each dish was good. Our server never came to check on us, ask us how our food was or even to see if we wanted another beer. Then the wait for the server to come back with the check which I then had to get up and ask for it not to mention I had to go back to the cash register wait for someone to process the check.\n\nAtmosphere: typical Chinatown Chinese restaurant. Service: very OK to poor. Food: Very Very Good. I will try other places though next visit.", "author": "Melody K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-01", "description": "Their spicy fish fillet was really good but their much advertised Chongqing Hot and Numbing Noodle was too plain without much taste. As a result, I'm giving them 3 out of 5", "author": "Jackson H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Be prepared with the crazy spicy dishes here, they don't mess around with the chilies that they put in the dishes. \n\nWe came here on a Friday night, and the place was oddly empty. We heard that usually this place tends to get crowded during dinners. \n\nOur Taiwanese friends ordered the food for us, he ordered 6 dishes for the 4 of us and surprisingly we finished them all! All I remembered about the orders were spicy chicken, mixed meat hotpot, lamb skewers, veggies, noodle and fish. We also got the plum juice to help counter the spiciness (worked a little). All of the dishes were delicious!", "author": "Nathania Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-11", "description": "This is the best Sichuan restaurant known to man... well at least in San Francisco. Plus there is this bitchin Harley Davidson inside the entrance. Why? Because the owner loves his motorcycle, that's why. And maybe, in some small way, having a motorcycle with a one foot wide contact patch makes the spicy food even better. Come in and try it and you'll see what I mean. And take some nice selfies with you and the motorcycle. \n\nYou're welcome!", "author": "Lancer K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I was visiting friends in SF and we decided to come here. We got a large fish boil and all the small dishes to add in like you would hot pot. We also got Chicken with Explosive Chili Pepper and it was so good! The spicy was numbing, very authentic, and flavorful. It was sweat inducing, but totally worth every bite. We shared with four people and it was more than enough food for everyone.", "author": "Rona S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-05", "description": "Surprised to get a seat quickly. Friendly staff. Clean and nicely decorated facility. I only had one dish, but I liked it. It could gave been hotter, but it wasn't bad. The price was excellent. $10 for a bowl of noodles I couldn't finish was perfect. Though, there could have been a bit more beef. Go and enjoy!", "author": "Ian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-13", "description": "4 stars because I didn't try everything on the menu and other people's foods was looking pretty goods.\n\n\nI came here looking for that dope, numbing, hot oil.\nAlso have been looking for dope dandan mian. \nNo luck tonight and no luck in SF so far. \nLet me know if you have recs for a legit, dry dandan mian.\n\nSpiciness scale: (descending spice) \n1. Chongqing hot oil noodles\n2. Wonton hot oil \n3. Dandan mian\n\nI wouldn't recommend the last two.", "author": "Olivia P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-23", "description": "There was no wait on a Wednesday , around 1:30pm for lunch so my son and I came in. Having been to China a couple of times made us remember how good food is served fresh and quick! Here, Service is quick, the waitresses are very friendly.  It's the nearest to an authentic Szechuan cuisine!  A must try restaurant in Chinatown !", "author": "Nieves O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "Most of their dishes are delicious and pretty authentic. Their twice cooked pork is okay but for some reason they put a lot of tofu in it. Not a big fan of that here. The pork intestines with picked mustard (or really prepared any other way) hits the spot every time. I also like that their spice levels are pretty high.", "author": "Arka G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "So good!!! Took care of us right away with a reservation and waitress was super sweet! \nThe place is also decorative & very welcoming!! Loved it!!!", "author": "Emalie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "I kept hearing about \"the good Szechuan restaurant at Waverly Place\".\nso I came here and ordered two among other things that Szechuan cooking are famous for.\nI ordered \"Dan Dan Noodle\" and \"Fish Fillet in Flaming Chili Oil\".\nyou agree with me? if you know Szechuan Cuisine, you know that those two are some of the dishes that the region are known for beside kung pao chicken, mapo tofu, beef cumin, lamb cumin, dried beef in chili oil, explosive chicken in chili peppers, etc etc ..\nyou know what I mean.\nfirst of all, not enough Szechuan Peppercorn only dried Chili Peppers floating around the dish (fish fillet in flaming chili oil) and it's not spicy nor numbing at all, it's more like just garnish.\nso I ordered the Dan Dan Mien (Noodle), it's the same. \nI couldn't taste the Authenticity of the Szechuanese ingredients in the bowl.\nthere was no depth at all.\n\nand then, ..\nI heard the chef spoke to each other in Cantonese.\nI know because I sat at the bar and it face directly to the kitchen, and my parents are Cantonese.", "author": "Rudy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-02", "description": "The food is really yummy. But the service is off the top bad. The restaurant has a bunch of empty seats, but the waitresses cannot get people seated for like 20minutes. Don't know what's going on.", "author": "LinQian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "Spicy food, soothing tea and beautiful ambiance! Love this gem place with minimal wait time!", "author": "Sonali C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-07", "description": "I've always wanted to come here because I love spicy food. However, after eating here once, I will never come back. There are better restaurants in Chinatown for a lot cheaper than what this place charges. I feel like it's a very gimmicky place, boasting that they have top chefs. \n\nThe dishes we got were expensive and disappointing for the price. At around $15 a plate, you expect quality and dishes that are shrouded with cheap veggies or meat with mostly fat. \n\nWe got the following\n-Lotus roots with garlic: This was good but def not worth the money\n-Green onion pancake: Greasy, meh.\n-Noodle soup: Bland\n-Salt and pepper ribs: these were terrible, literally no meat at all, it was all fat that we had to trim, in the end you are left with a quarter size piece of meat. Disappointing.\n\nSave your money. Go somewhere else. Service isn't that great either. Water refills and getting something as simple as a bill takes forever.", "author": "Kelly L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Amazing food, traditional and great service. We got the mandarin dinner for 3, and now i can't wait to co back. The sweet and sour pork was the best and the chow mein was chart topping!", "author": "Zach T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-29", "description": "This authentic style restaurant is located in Chinatown. It has a great ambience and judging by the crowd it seems to be doing really well. \n\nWe had to wait for 10 mins and were seated promptly. The staff is very efficient and expects you to be quick with your order. The tables turn around quick. They serve hot tea on the house ( which I love with my meal). \n\nWe tried chicken stir fry, vegetables of the day and white rice. The food was good and the spice was on the higher side. The flavours were good and it's slightly greasy , not too much tho. The portions are good for sharing.  \n\nI recommend this place if you are craving Asian flavours and some spice.", "author": "Shivani B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Beef tendon here is amazing. Don't pass this place up. If you've never had it you must try it. Perfect blend of spicy and savory. I come here every time I'm in San Francisco because the beef tendon is one of my all-time favorite foods!", "author": "Pete W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Pretty authentic Szechuan restaurant with quick service. \n\nCombination flaming pot: 5/5 love this dish! It has lots of ingredients: lotus root, intestine, shrimp, fish, corn and etc. Spicy and flavorful. It went well with rice.\nPork intestine with Szechuan pickled mustard: 5/5 I preferred pickled mustard marinated intestine over stirred fried because it's less oily. The intestine was soft, silky and flavorful. \nDry sautéed string greens: 4/5 pretty standard and rich in flavor \nSpicy eel with flaming chili oil: 2/5 too oily and salty without much eel meat.", "author": "Cynthia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-02", "description": "I didn't give it 5 Stars only because I didn't try the rest of the food my boyfriend did like the sweet and sour chicken but as for me the hot and sour soup was the best one I've ever had. I couldn't stop eating it and I even went back during my short trip to San Francisco.", "author": "Valerie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "It was a very cold night, and it was perfect for spicy food. We were staying in Union Square and knew that Chinatown would be the perfect place to get spicy food. Found the place through yelp, and because it was President's Day, some of the ones with \"higher ratings\" were closed so we decided to take a chance on this one.\n\nWe arrived around 6:30 pm to a half empty restaurant, and as soon as we were seated, a waitlist started to form immediately! We got lucky before hitting rush hour. \n\nWe ordered the cucumber salad to start, my husband had the spicy beef noodle soup and I had the Tan tan noodles. The cucumber salad was tangy and savory, a very nice start to the meal (and a nice cooling contrast to the spicy noodle dishes we ordered) \n\nI was almost disappointed when I saw the glob of noodles arrive, it looked like it was hauled out of starchy noodle water and looked stuck together. It took a while to mix my tan tan noodles together, but as soon as all the spices and oil got mixed in between, the noodles clung to the spices and minced pork.  My husband, who has just recently developed a liking to Asian cuisine, thoroughly enjoyed his beef noodle soup and claimed it was better than our local beef noodle soup spot in LA. The dishes were spicy but not too spicy, the Sichuan peppercorns add a very interesting spice depth to the dish that makes it very enjoyable.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "Super long wait for the food. We waited more than 30 mins for two of the cold dish appetizer, which should be prepared and ready to serve long time ago. Our baby was crying because he was starving. They took more the an hour to serve the lo mein noodles because they only have one chef working in the kitchen during weekend. I guess they should hire more cooks then. \n\nHorrible customer service. They automatically charged for 18% tip when we only have 4 adults and one baby, and they put down 6 guests on the ticket in order to charge tip. One of the waitress is super rude to us when we ask for a plastic spoon for our baby. \n\nWouldn't recommend, at least I'm not going back.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-26", "description": "My partne and I went here for lunch, actually we were walking through Chinatown and one of the employees handed us a menu and escorted us to the door. I loved it. The Cross Bridge Rice noodles were delicious as were the veggie spring rolls. Definitely something to  check out when you are in the bay area.\n\nMy only complaint was the heat from the kitchen really affects the dining experience.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "One of the first place I got to know the Sichuan peppercorn. The chicken with chilli's, Dan Dan noodles, ma po tofu, were all game changing-ly delicious for an Oregonian like me!", "author": "Thomas R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "My Chinese New Year tradition is to celebrate in China Town, SF, and that usually starts with a dinner before everything kicks off. My boyfriend and I showed up first this year, before any friends, so we had a romantic dinner together, at a table we shared with two strangers. It was actually really fun. We have an upcoming trip to China/Thailand so we really got excited as we celebrated over delicious bowls of steaming food, including:\n\nLarge hot and sour soup $10.95\nCashew chicken $9.95\nPork fried rice $9.95\nPot stickers (6) $6.95\nTsing Tao $4.50\n2 x large sake $8.50 (each)\nto-go box and bag $0.70\n\nService was fantastic and it really started off a great night and a wonderful Lunar New Year celebration. What a wild party it was!! (Note: we found this restaurant on our phones and it appeared as Uncle's Cafe on Google.)", "author": "Amy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-01", "description": "I came here on a weekday evening with a friend and we were seated on the very inside of the restaurant, near what is presumably the private area. I sort of knew what I wanted prior to coming in, but I wanted to look at the menu one last time, before ordering. I narrowed it down between the Cross Bridge Rice Noodle and the Hot and Sour Noodle Soup with Port Intestines, both dishes that I have never had before. I eventually went with the hot and sour noodle soup because it was three dollars cheaper than the cross bridge rice noodle. After deciding on our respective dishes, it took a while for the waiter to come take our order since it was very crowded and there was limited staff to field all the orders. \n\nAfter our dishes arrived, I went ahead and sample the broth. I felt a jolt of sourness running through me and was surprised at the level of sourness this dish had. A bit stunned, I then moved on to the pork intestines. The pork intestines were pretty quite soft and chewy. There was also a generous helping of peanuts and the bamboo shoots as seen in the picture, and I personally have no opinion on them since every spoonful I'm constantly reminded of the sourness of the soup. Glass noodles would not have been my first choice of noodles if I had to pick, but I don't think I can fault the store on that front since I chose the dish. \n\nToward the end of the meal, I was having significant buyer's remorse and felt that I should have ponied up the extra three dollars for the cross bridge rice noodle instead. It got to the point where I couldn't finish the broth, which I am normally able to do. I know I said this before, but I severely underestimated the sourness of this dish, as it overpowered everything else in the dish. One takeaway from this would be that I don't really have that high of a tolerance for sourness, and have to think about more about ordering sour dishes going forward. Anyways, I had to make an effort again to flag down the waitress for our check and we were on our way out back into the cold night. If I were to come back, it would be for the cross bridge rice noodle since that's the only thing on the menu that seems interesting to me.", "author": "Nelson X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "If you like hot and spicy this is the place to go. If you have people in your party than doesnt like spicy there some stuff on menu that are not spicy. Like the Fish and ginger sauce, yumminess is what i call it.", "author": "Ron D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "Spicy beef noodle soup is a must try if you go to SF.   I get the spicy beef noodle soup every time I go to SF and it never disappoints", "author": "Bjorn H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "I went with my friends to have dinner there recently. We were seated after about 10 minutes of waiting. When we sat down and decided what to order we waited another half hour until someone decided to take our order, keep in mind the place was practically empty. We were not asked for drinks and out plates were placed on a stack at the end of the table with the cups on top of them. We waited patiently and ate. When done we waited almost 45 minutes before even getting our bill. We didn't get any quality service and when the bill came they tried including an 18% tip into our total. We also noticed when other people walked in after us their tables were neatly set up then they were seated. I don't know if it was just us, but my friend group and I don't think we'll be going back. The food was alright and could feed more people than all of us.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "The service was terrible. We walked out after being snubbed by the hostess and then waiting for several minutes after being seated without service. At one point the server even brought dishes, but put them on the table without acknowledging anyone at the table or even saying hello before disappearing again. 5 minutes later we gave up and left.", "author": "Lacey C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "It is said to be closed at 10:30. They no longer accept people at 9:45. Why not call in advance? No. they never pick up phone.", "author": "ZY Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "Service 2/5\nFlavor 3/5\nSpiciness 3/5\nValue 3/5\nMenu 5/5\nAmbiance 4/5\n\nRequested spicy but it just wasn't there. Flavors were good, but not great. Clean bathrooms.", "author": "Turkey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "I love Schezuan food! This place is pretty good! There are a lot of choices in the city but this is up there for me. We ordered the explosive chicken which I thought was amazing. The pork in garlic sauce was average. There are lots more to try and the menu has plenty of pics to make it easy to order.", "author": "Vinayak P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Finding something to eat in Chinatown was a challenge because we wanted to eat everything. After talking to a few locals, we decided on a Szechuan type meal. We stumbled upon Spicy King and immediately were drawn to the variety of 'new' Chinese food. \n\nWe ordered about 10 different dishes and each one was amazing. If you try this place, please order the Lo Mein noodles, you will not be disappointed. \n\nOh, and their spicy sauce is TO DIE FOR!", "author": "Jackie V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Z and Y was too damn busy so we couldn't get our spicy boiled fish fix satisfied. Luckily Spicy King was open for another hour and they came through something fierce! Also green beans ruled.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "I love this place. Usually order from Uber eats here. Great authentic variety. Love the authentic taste", "author": "Ender M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-02", "description": "The food quality not bad, but the rice cooked really bad. I have no idea why they want us pay $ for the rice.", "author": "Xiaoxiao L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-02", "description": "I loved going to this Spicy King for my lunch while it started opening in Chinatown about 2 yrs or 3 yrs ago. After several months,after they rise the prices little bit I also noticed quality and quantity of their dishes dropped dramatically.  For example,I loved one of their noodles that got nice spicy soup and very good bargain deal for 7.99. Later not just they asked 2 dollars more but delivered a terrible noodle that came with pure hot water instead spicy soup. They simply mixed some hot water with their noodles.  That made the noodles tasted terrible bad . They also screwed my another favorite which is beef noodle. It got some delicious big beef meat that was big as 2/3 size of my hand and then later for the same price,a same beef noodle,what I found were some small piece of beef as small as my finger and also very few pieces. For another of my favorite dishes, I was asking to pay 2 dollar more and got only half of what I used to get before.\nI stopped going to this Spicy King after they couldn't keep up what they were good at till I visited them again 2 months ago. And they fcked it again. Another overpriced noodle simply mixed tasteless hot water with little meats.  I am done with this Spicy King for rest of my life. Indeed,it keeps expanding to get new restaurants opening in Bay Area but they totally provide shitty bad dishes now.", "author": "Ji Jin Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-01", "description": "I'm giving this five stars on food and four stars on service. The food? Amazingly spicy, absolutely sweat-inducing, and just overall exactly what we showed up for. I can't tell you the names of the dishes off the top of my head, unfortunately, since my family ordered in Chinese, but rest assured the numerous dishes we had were delicious. Service was decent. Our waitress was a little curt (to be fair, there were many people, so this is understandable). We made a mistake with the bill at the end and she was rather condescending when trying to explain our mistake. \n\ntl;dr: Food's really great and despite our waitress, I would come back again if I craved more spiciness.", "author": "Kel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "Can only speak to the take-out. I got the mixed dry pot take-out and it was a complete mush. The meat (couldn't tell which kind) was cut into ginormous chunks and did not taste fresh. I ended up tossing most of it. For an entree that came to ~25 bucks (and no rice) this was a major disappointment", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "Great food and good service; however, charging customers $.30 per container ($ 0.10 per bag) really bothers me. (This applies to both dine-in and to-go)", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Great! Great! Great! We met friends from out of town, asked Yelp for help - this place had good reviews so we went. Total win. Well, pretty much all good - skip the short ribs - loved the other 6 dishes!", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "Pretty solid food if you are into spicy oily Sichuan food The service was good enough for a chinese restaurant.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-12", "description": "not real szechuan cuisine\ntoo sweet but not spicy\n\nplus，both of us who ate there suffer from stomache the next day", "author": "以欢"}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "This place is definitely worth the wait if you come here during busy times. I've been here at lunch and there's usually not a wait. The service is quick but the food can take a while to cook. I love the mapo tofu here but everything I've had at Spicy King is great. If you don't like spicy food, go elsewhere.", "author": "Annita K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "Good Chinese Kitchen! So spicy food, great experience! the waitress brought a dish that was not ordered, and there was an insignificant dispute, in the consequence they removed this dish from the account", "author": "Rinat B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Note that we asked for reduced salt on everything, but everything was still delicious. Garish decor that is somehow endearing.\n\n\n---- APPETISERS ----\n\n葱油饼: 4.5 stars\nAs good as any you'll find in this city.\n\nCucumber salad: 4 stars\n$7 but a pretty big portion and well seasoned, yummy.\n\n红油抄手 Chili Oil Dumplings: 3.5 stars\nI've had better.\n\n\n---- VEGETABLES ----\n\nBeech Mushrooms 茶树菇: 5 stars\nUnique and flavourful. Full of umami! I've never had anything like it. Cooked with pork belly and onions. Slightly salty but forgiven.\n\nString Beans:\n\n\n---- MEAT AND NOODLES ----\n\n麻辣牛肉面 Spicy Beef Noodles: 4.5 stars\n\n担担面 Dan Dan Noodles: 4 stars\nOne of the better ones in the city.\n\n孜然牛 Cumin Beef: 4.5 stars\nI love cumin. Beef is tender.\n\n麻婆豆腐: 2 stars\nNothing special.\n\n辣子鸡: 5 stars\nBe warned there are two versions of this deep-fried chicken dish. The first version has lots of bones in it and is overcooked and costs much more (apparently a delicacy with 黄鸡 and the locals like to eat the bones). The second has only meat with no bones, crispy shell, tender meat, tasty, and is apparently cheaper.", "author": "Letitia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "This place was really good , especially the mala chicken.", "author": "Hwang Hah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "Came here with friends to try out Szechuan food. I've had szechuan before so this isn't really a new thing to me. \n\nNothing really stood out for me in terms of food. Maybe we got the safer dishes? \nService was blah. I guess not non-Chinese people friendly. \n\nI need to come here with people who's willing to try more legit stuff.", "author": "Claire J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "Good spot for Szechuan. Tried the dry fried string beans and they were excellent. Blistered on the outside, good amount of building spice, and salty. For vegetarians- there is a fair amount of choice (eggplant, tofu, noodles). \n\nMy boyfriend tried the Pig Feet and they looked spicy AF but he enjoyed them!", "author": "Samantha K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-13", "description": "Horrible service, horrible customer service. Took 10 minutes before they even noticed us to be seated we were told to hold on twice. We got sat and they gave us ONE menu for three people. And some service is so bad of course I took another 10 minutes for us to ask for two additional menus. We were ready to order and it took 10 more minutes to wave down a waitress eventually my friend went to the cashier and said we were ready to order, they came 5 min later. Food was not good, you can find way better elsewhere, overpriced. They never came and asked how our food was or just check in. Tried to get a refill for tea and of course they aren't attentive. At this point we're already fed up and just wanted to leave and pay the bill. I've worked in the service industry and understand how much waitresses get paid but there needs to be actual work done to earn the tips. Thus, since we did more work waiving down to get served I decided not to tip. The waitress had the guts to chase after us into the rain and say that the boss says we NEED to tip. I am not sure if they thought we were tourist and trying to rip us off or what cause I was born and raised in the US and it is not against the law not to tip. At this point we were already beyond fed up so I tipped and left. Will never return, not recommended. Please spend your money elsewhere.\n\nUpdate: just saw another review where they automatically charge you a \"service fee of 15%\" on your bill. Now I probably tipped 30% at this point. I think it needs to be clearly labeled somewhere or told to us if there is already a service fee in the meal usually only groups of 6 or more have an automatic tip in my 24 years of life. Either way never returning.", "author": "Alison C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Tan Tan noodles are a must! Service was great. We were seated right away and food came out with in 5 minutes. Food was hot and fresh and very tasteful!", "author": "Kristina O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "This place was great. Lots of locals, delicious preparation, very fast service. Waitress was very helpful in making selections. We're satisfied!", "author": "Bob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "Pretty solid Sichuan food. We got the green beans and fish hot pot. The dishes weren't as spicy as I expected, which is probably a good thing. Definitely get some beer or sake to go with it.", "author": "Kevin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-21", "description": "This is my favorite restaurant in Chinatown. It's authentic so expect the efficiency without frills. Come here every visit to San Francisco. If you love Schezuan and can handle a little spice, this is the place for you. Just look for the big Harley by the bar upon entering. Favorites are the explosive chicken, chicken fried rice, and jalapeño flavored century eggs. Mmmm.", "author": "Leanna L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "Disappointed.  I think this place has the potential to be awesome.  Ordered two noodle soaps and the spare ribs appetizer.  The spare rib actually was tasty but it came out room temp.  I cant tet over that it has been searing around all day and they served it without warming it up.  The noodles were unremarkable.  Overall, it was a blah experience. Wouldn't return nor recommend.  Hopefully they make the necessary changes and give dinner a better experience.", "author": "Duke L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "Definitely coming back with a few more people so I can try some of the larger dishes. \n\nFlavor was good. Reminded me of my days in China. The spice level is definitely toned down compared to the mainland. Good nonetheless\n\nI'm a sucker for the cucumbers. Lightly flavored but tasty\nLamb skewers meaty but included some fat to balance\n3 cup chicken was on the sweeter side\nHunan dry noodles had a nice light kick to it\nJalapeño preserved eggs is a fun dish to try. \n\nWill update the next time I visit. \n\nSeating is pretty limited. So prepare for a wait.", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-19", "description": "Awful service I have ever seen before. Honestly, food not bad, but not good, too oily. But service is like a trash, bullshit. Will not come again. The waitress deserve to be a waitress forever. Disgusted waitress ever. Why you guys think you deserve a tips from me? Trash!", "author": "Yonnie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Get the noodles with peas and meat sauce. The sauce is fan-TA-stic. $9.95.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "It was okay food... spring roll soggy, Mongolian beef greasy. Sweet and sour soup ... okay", "author": "Jette Erick U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-22", "description": "I ordered the Kung pow chicken.  The food was OK but felt it lacking in enough vegetables and was swimming in sauce.  \n\nI also found it be expensive for what was provided.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "We ordered takeout on Chinese New Year. It was very busy and we ordered the pancakes, bbq lamb skewers, couples beef, sweet and sour pork, chicken fried rice, salt and pepper shrimp, and tan tan noodles. Once we received the food, we hurried back to eat at the hotel and found out that didn't receive the tan tan noodles or the salt and pepper pork. Other than that, all of the food was tasty and the wait wasn't very long.", "author": "A. W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "Not impressed. \n\nStopped in here while detouring through china town. It was able to accommodate our large group so why not?\n\nThe tea was ok\nSpring rolls were awesome. \nRice was, eh. \n\nWe ordered a few different things and nothing really stood out as better than the other. \n\nSpicy? Eh, it was only if I caught something with more peppers. \n\nI have read that Chinese food in San Francisco isn't that great anyway and after having some, I would agree. \n\nDon't expect to be blown away.", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Great vegetarian food! Drove all the way from San Jose to China Town for their spicy numbing noodles  and their shredded potatoes.", "author": "Amrita S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-26", "description": "Ordered Couple's Delight (not very flavorful compared to the other Sichuan Restaurants), Garlic Cucumber (no sesame oil, but lots of vinegar), Sweet and Sour Short Ribs (not sour at all, super sweet), Spicy Chili (not bad, but not super good either). Not worth the 30 min wait! Although it's owned by the same owner of Chongqing Xiaomian, the same dishes here taste a lot worse than Chongqing Xiaomian. Will not return.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "Boy did I had a hankering for Szechuan...yeah yeah, I know, what's new?!...so I looked to yelp! for guidance while in SF. It's true that I almost always avoid places with less a than 4 star rating unless of course there isn't anything else around my hotel but after reading a couple of the reviews it seemed to me this spot was of 4 star caliber (perhaps more), at least as far as the food was concerned. So I took a chance, what can I say, I like living dangerously.\n   After seeing many a drool worthy pictures of the dan dan noodles, I was fixated. I rolled up solo and was quickly sat at the bar. The biggest challenge was looking through the extensive menu to find what I already knew I was going to order. I ordered and after what seemed like almost no time at all came a gigantic bowl of heaven. My first thought was... \"How in the world am I going to finish all of this!?\" I would later find myself scraping the bottom of the bowl for any remaining morsels to keep the taste in my mouth. Point is...holy moly was the broth tasty, the meat succulent, perfectly balanced numbing spice with the freshness of the cabbage hiding under all those noodles. GAAAHHHHHH was it good and the price was extremely reasonable.\n   So all I can wonder is...\"why only 3.5 stars?\" when this was sooo dang delectable. Sure, the service is straight to the point. The no fuss kind you get from the best Asian restaurants in my opinion. You just have to let them know when you need the check or more water etc. This bothers some folks, but to me...no big deal because servers were constantly present, buzzing around taking orders and delivery food and most importantly the food spoke for itself. Next time I'm in town coming back will be a no brainer. Don't make the mistake I almost made and give this place a try.", "author": "Cory W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "I have never been to a place where the waitress came back to my table after paying to tell me my tip wasn't enough.\nHowever, that is exactly what happened to me at Spicy King! \nThis, even after we found a hair in the food. She came back and asked for 5 more dollars! \nThey better enjoy that extra 5 dollars because it is the last penny Spicy King will ever get from me! \nAwful!", "author": "Allie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-17", "description": "We were looking for a place, and daughter isn't a spicy food fan, but it was late. They seated us quickly, and had attentive service.  I had the Hunan pork, m'lady had the garlic eggplant, and lass had the salt & pepper shrimp. All were done nicely. A tad oily perhaps, but tasty and filling.  Definitely a good experience.", "author": "Clark Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "I love a nice spicy lunch to help energize me for the rest of the workday; works better than coffee!  Though I really like Z&Y for Szechuan, their popularity makes getting a table difficult sometimes.  Spicy King is a little off the tourist path which means seating is easier; also it feels like some of the dishes might even be spicier.  A good way to get your chili fix.\n\nChicken w/ Explosive Chili Pepper: Despite all the chilis, it's not that hot if you don't eat the dried chilis (which don't have a good texture anyway, since they're dried).  The chicken chunks are pretty large, like a bite or two per piece.  And they seem more generous with chicken portion than at other Szechuan places.  Lots of perfumey Szechuan pepper taste (which are from the little peppercorns, not the long dried chilis).  A little fried chicken overload for one person, but great to share.\n\nChongqing Hot Numbing Spicy Noodles w/ Peas & Meat Sauce: Thin crinkly noodles, like ramen, in an oily chili sauce.  It wasn't quite numbing, but it was appreciably hot.  The bland cabbage pieces were a nice palate cleanser between bites.  I wasn't really feeling the peas since they seemed like the canned kind (or maybe frozen), but definitely not fresh out of the pod.  The minced meat was nice, but a small portion.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-17", "description": "Ordinary food. Pricey as well. You would find similar food at any other restaurant out there.  Service is also poor", "author": "S D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "Another popular trend in Chinese cuisine besides hot pots is spicy food, specially Southwest Chinese regional style.  Szechuan is the most famous along with Guizhou.  Szechuan's capitol is Chengdu, most famous for its panda reserves.  \nThe recent trend that started a couple years back is numbing hot, a sensation that leaves a tingling sensation on your tongue and renders all flavors to be neutral (neither salty or sweet).  This is not my cup of tea and, for me, if you can't taste it, what's the point?!\nThe restaurant is known for their hot pots which is difficult for lunch, given most people are on a schedule workwise.  After studying their individual serving dishes, I decided to try their Tan Tan noodles (https://www.yelp.com/user_local_photos?select=YzdsvLPG1YjkobZ7k0n8PQ&userid=saJuyv784apZzH--psHZ3Q) for $7.95.  \nEating this in my office, it was a bit difficult to mix the ingredients as most of the meat and sauce were on the bottom.  After eating my way down about 1/3rd of the way, I was able to better mix those with the cabbage.  The flavors weren't overly spicy but still had good enough heat.  The cabbage added a crunch to the noodle bounce and the minced meat pieces.\nYes, I would have this again.\nMy friend and I stopped for hot pot but there was an interruption so I'll withhold comment until I actually enjoy this here.\nThe chef apparently worked for the popular Z&Y on Jackson Street for some time before branching on his own. The original spot was the former location of Pot Sticker about half a block away on the other side of the street.  I've tried his other restaurant on Geary Blvd last year, coincidentally during the Warriors' finals' run.\nFor Chinatown old timers, most will remember this spot of the famed Uncle's Restaurant, where many of the political negotiations back in the day happened in the community.  This was a popular breakfast place for local business owners and family association officers for discussing situations and solving problems (ala Sun Wah Kue, Mary's, Jackson Café, etc.).\nThe ambiance is a bit dark in there with a few large tables and mostly two or four seat tables.  Checkout the \"ride\" in the front of the restaurant, which doesn't make much sense to me.\nBut I guess that's the thing about Chinatown... many things don't quite make sense here.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "We ordered noodles and a live whole fish. The food was pretty good - a little too oily and salty for my taste though. Also, prices run pretty steep.", "author": "Jane H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "They recycle their chili oil and chili, I know that because I ordered a frog pot and I had 2 piece of chicken bone at the end, so nasty can't believe it", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "We stumbled into this restaurant totally by accident. Loved it! Food is very spicy, but very delicious. The Lamb Skewer was super spicy! Ruined by taste buds.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "I love spicy food and this place did not disappoint.  I can't wait to go back again.  I went with someone from Chengdu and it got his stamp of approval as well.\n\nThey have a dish that consists of just jalapeños in some vinegary sauce which was probably the tastiest thing I had, although it wasn't particularly spicy.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "This is a great Sichuan restaurant in SF and 5 stars are based on the food, not on service. I'm from china and love spicy food and this place hits the spot. Yes it's less spicy that what you would find in Sichuan but the numbing spicy is authentic. \n\nYou should not listen to those who gave shitty reviews based on cleanliness and service. If that's what you are looking for, definitely go elsewhere. If you want good authentic food, get some chongqing numbing noodles, couples delight, fish in chili oil or a flaming pot. It saddens me that people made the trek to this place and orders things like egg rolls or chow mein, and then gets disappointed with the \"Chinese\" food they got. Come with the expectation Sichuan spicy means numbing spicy. just because it's not the spicy you are used to doesn't mean you should rate it low and recommend others to go elsewhere.", "author": "Molly H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-09", "description": "4/5/15: Just a quick look at reviews tells me many people misunderstand what this restaurant serves: authentic Chinese Szechuan (Sichuan) food.  Here's a quote from a 1 star review:\n\n\"However, be warn with both of these dishes the food is sitting in a pool of chili oil.  The chili oil is how they make everything spicy. It's so greasy. Yuck.\"\n\nObviously the reviewer has no idea what true Szechuan food is since the \"pool of chili oil\" is the hallmark of such cooking.  Many of the dishes mention a \"numbing oil\" referring to the fact that if done properly your mouth should feel somewhat numbed (to let you tolerate much hotter foods) as a result of the special pepper corns they use, yes, in a pool of oil.  Anyway, just wanted to point that out.\n\nThat said, I've had my fair share, including some really awesome ones in Monterey Park, and unfortunately this place isn't among the best, and is actually sub par...\n\n1. Couple's Delight $7.95: This is the MUST HAVE for any Szechuan meal--the typical 2 or 3 foods (out of sliced beef, pig ear, and tripe) combined for an appetizer, hopefully with ton of numbness dished in.  In this case, they did the famous dish right.  Everything was super flavorful and rich.  8/10.\n\n2. Chongqing Hot Numbing Spicy Noodle $7.95:  My girl was SUPER HAPPY to see this on the menu.  Even immigrating from China she has never had this dish and was looking forward to duplicating it.  Unfortunately, what they server was NOT IT.  Also, not hot or numbing at all.  -2/10.   Yes you read that right: NEGATIVE TWO / 10 for making a joke out of a famous dish.  -----2/10\n\n3. Boiling Live Fish w/ Numbing Chili Oil $28.95: Sigh..... so, my girl and her friend immediately said this was not \"live.\"  We even asked the waitress who confirmed they did use a live fish.  I dunno, maybe it was killed in the morning and they called it \"live.\"  Personally, I thought the fish was okay, but was more disappointed that it was cheapass tilapia, the cheapest live fish you can get at Ranch 99!  For nearly $30, totally not even close to worth that chunk of change.  Taste-wise, again, I thought it was okay, but out of the humongoid pot, I think 2/3rds of it was chilli peppers and inedible filler.  Very little actual fish.  This is one of the most expensive items on their menu, so I warn you--DO NOT GET THIS.  2/10.\n\n4. House Special Lamb Ribs $13.95: I LOVE ribs.  American.  Chinese.  Whatever.  And I've had ribs at other Szechuan places and I always love them.  But this one.... some pieces were okay, but most of the ribs were not intact, with half their meat ripped off.  The ones that were still one piece were good.  The rest was just lying in the dish.  Also, some of the lone pieces were super chewy and were barely swallowable.  Note, this is the cumin-flavored variation, not the bbq type.  2/10.\n\n5. Chicken w/ Explosive Chili Pepper $13.95:  I thought this one was decent.  Pretty tender chicken to me with good pepper taste.  But the girls disagreed.  Anyway, for me, 5/10.\n\nThis restaurant just isn't as good as their average competitor.  Go elsewhere.\n\n#chinese #szechuan #sichuan", "author": "Dean C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Take the road less traveled...by tourists...and find yourself here.\n\nI wasn't sure that they would speak English, and my abilities in any dialect of Chinese are minimal.  It wasn't a problem, and no Chinese was necessary.\n\nIt wasn't really busy when I arrived, but the waitress came over to greet me.  She looked about the dining room, grabbed a towel and a menu, and seated me after cleaning a table for two.  I only needed one chair, despite my big mouth.\n\nGiven that they specialize in Sichuan food, I wanted to find something interesting.  I was friends with a Chinese family who owned a restaurant in Ohio, and they approximated Sichuan cuisine, but I've never had the food made with the real recipes.\n\nI ordered the Hand-shredded cabbage, which was meant to be spicy.  I talked to waitress about it, and I mentioned tofu.  She showed me Mapo Tofu, which is a Shanghai-nese (I've been reminded by someone that it is Sichuan.  I don't know but I've had people from Shanghai claim it, also.) recipe that I really like but I was there for Sichuan food.  She suggested that I might like the Preserved Egg and Tofu appetizer.  I had asked for iced tea, as she had brought hot tea.  They didn't have any.  She also asked if I wanted steamed white rice.\n\nWhen I returned from the restroom, she had brought ice water.  It wasn't long after that when she brought the appetizer, and fairly quickly, the main course arrived, along with steamed white rice.\n\nSince I wasn't sure how anything but the rice should taste, I was pleased with all of it.  The appetizer was cold and the level of spice was mild.  The level of spice of the cabbage was a bit higher and there were many red peppers that had been cooked with the cabbage as well.  Is this typical?  I don't know.\n\nI remember being told that Sichuan recipes were extremely spicy, and they had some tongue-numbing recipes, with the word \"numbing\" in the description.\n\nI felt more secure as other Asians entered the restaurant.  I've been to a number of places where the tourists outweigh the local people, and it always gives me the feeling that the food isn't good enough.  I believe this place is good enough.", "author": "Nobuyuki S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "Explosive Chicken with Chili period!  A little spicy yes but that is what I crave while in SF Chinatown.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-05", "description": "Great decor. The 3 mix vegetables was very good! The spicy chicken was ok. We decided to try the Pork Belly. It was served at room temperature. We took one bite. We didn't like it one bit!! I've only sent 3 things back to a kitchen in my life and Spicy King charged us!! It's both rude and disrespectful to charge a dissatisfied customer. I won't ever come back to this place. I really thought San Fran would have good Chinese food but I've come to the conclusion there's good and bad food everywhere.", "author": "Jerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "incredible food, I am surprised the star rating for was restaurant was lower than I expected, it is much much better than all the other sze chuan food I have tried in sf, the food quality is superb and the price is pretty cheap, I recommend their hot chili oil fish fillet", "author": "Momo P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-22", "description": "My man friend and I stopped in this evening for a bite to eat after work. In all honesty, I had a tummy ache but told myself to buck up and shut up. So we got a bunch of things to share, my favorite thing to do on a date. I think you learn a thing or two about someone by the things they order when ordering for two. Fortunately we both like a lot of the same foods, so it worked out.\n\nWe got the Potstickers, Green Onion Pancakes, Chinese Broccoli with Oyster Sauce, and the Princess Chicken. Everything was very tasty: the chicken was super good, spicy, hot, crispy, slightly sweet, green onion pancake was thinner than I usually have it which was a good thing. Potstickers were lightly fried and juicy, and the Chinese Broc was perfectly cooked. \n\nI gave three stars because this place was not really my scene. It was clean and fine, but I am personally more into the dirty little hole in the wall Chinese places. It felt very Americanized and chain-y, there were tons of white people eating there, never a good sign to me at a Chinese spot in Chinatown. But regardless, I had a pretty nice time chatting, nibbling, and sipping a Sapporo.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "This place is probably a little too spicy for kids, but if you want to take your chances, you can always order something that is not spicy. I like chop sticks, and the table service starts off with only chop sticks; you can always ask for forks and spoons. Other than that, the food was splendid!!", "author": "Renee G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-30", "description": "This is a very small, but extremely busy place for authentic Szechuan food. There was a waiting list for people to go in for lunch on a Friday afternoon. They take down your name on a notebook and you wait for them to call you. It was a little frustrating as with all the people waiting in line to get seated, some people were done eating and just hanging out...which...SURE it's their right, but it's kinda annoying. We were seated at the same table as two other people across from us, already eating. It was kinda awkward at first, but hey, everyone just wants to eat. \n\nWe ordered chicken with explosive chili pepper, these pickled cucumber salad, and I think some noodle soup. It was all VERY SPICY, and yet so delicious. Just be aware that they don't joke around when it comes to spicy. In retrospect, I should have ordered a side of rice to help balance out the spiciness. Overall, very good, very packed and busy during peak hours so be prepared to wait, and deal with limited personal space. You can't tell a whole lot from the outside, but it's very nice interior inside, and big portions of food.", "author": "Lola H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "One of my go-to places for amazing, spicy szechuan food.  I haven't tried anything I  haven't liked,  but then again I usually order the same dishes over and over again because they area so good! The spicy noodles are my fav :)", "author": "Megan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "Very tasty. Note: Large portions so we wasted some food. 3 dishes are fine for 4 people depending on your appetite.", "author": "Art O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-28", "description": "Good, but not actually that spicy. Which is disappointing given their name. I got their mapo tofu at the spiciest level and found it to be tasty but nowhere near the heat level I would expect or am looking for. Their house noodle dish is very good, great for the price and has the proper numbing kick that I am looking for.", "author": "Kane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Good taste，original service（in fact，not good enough）. Good service should include of reminding customers when they       apparently order too much to eat up，or offer half choice，so to avoid food wasting！\nWhen check，no printed bill，we pay cash，forget to pay by credit！", "author": "Qin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Authentic Sichuan restaurant that showcases hau jiao or the famous Sichuan numbing pepper-- an awesome feat considering that 99% of Szechuan restaurants in the USA lack this vital spice. Dishes we tried were the fish with chili oil, bean jello with chili and dry string beans. Best to go with a bigger group to try more items. Definitely focus on the \"folk\" menu and steer well clear of the \"white folks\" Mandarin items. \nMy only complaint is this place uses WAY TOO MUCH SALT. Shame on the chefs for that.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-03", "description": "Went here like many others do after an unsuccessful attempt at Z&Y. Came here and the service is crap, absolute garbage. Had to get up and get their attention to order and pay. And they would never come refill water/tea which sucks when you are eating spicy food. \n\nThe food was pretty decent. There was a spicy cold noodles dish that I really enjoyed and they gave a lot of the Fuqi feipian, but something seemed off there. I feel like they were missing certain meat parts of the dish. I always just a szechuan place by it's shui zhu yu, and this just had an average one. However, they did give a lot of rice...so yay?", "author": "Victor D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "The worst service I have ever experienced. Our server had the manners of a rock I will never eat there again.", "author": "Alex V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "The food was really good but not all that spicy. Had the twice cooked pork and chicken with exploding peppers. Both were really good. The service was good too. If I worked nearby it would definitely be in the lunch rotation.", "author": "Brian R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-28", "description": "I really wanted to like this restaurant because their menu is actually pretty legit (not much Americanized general tso like dishes) but I had a horrible experience here.   I lived in China for years and speak mandarin so i'm thinking i'm an ok judge.\n\nSi ji dou- So salty that I couldn't even eat it- and this coming from someone who loves salt.  \nmushroom dry pot- ok.  Pretty good actually.  \nliang fen- disappointing.  The noodle tasted like it had sat around for a long time.\nkou shui ji (spit chicken)- Along with the dry pot one of the better dishes.\ncold cucumber- so so.\n\nWhile the food was meh the service was awful.  The waitresses working frequently ignored us and carried a \"i hate you and our jobs' expression on their faces the entire night  We sat at a pretty large round table and they didn't even bother to put the rice bowls and dishes in front of where we sat-- forcing us to lean over the table and set them where we get them.   And again- I was speaking to them in Chinese.   \n\nOn the plus side- beer is only $4 a bottle.\n\nI will never be going back.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Amazing food (very spicy if you choose), great people, reasonable prices. Recommend to everyone.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "What a treat. Never had the cuisine before. Always you beef and broccoli variety kind of Chinese food. Clients from Schezhuan area brought me here and ordered everything. It was numbing not hot. So you can still enjoy the flavor.   Excellent food. Will be back. \n\nOrdered big fish. Cukes. Noodles.", "author": "germaine n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "3.5 stars. First don't make a reservation through Yelp because even if they offer it they don't have the computer to see who has reservations or not. This place is way better than Chong Qing Xiao Mian. The service here is even better and the waitress actually understand a decent amount of English. The place is clean and it wasn't too busy during lunch time. \n\nI got the tan tan noodles so I can compare it to Chong Qing, and the flavor here is way better, but noodles were too soggy for my liking. \n\nMy coworker said mapo tofu is a must. Even if there's no meat in it you will really like it. Hm.............I ordered it with a side of white rice. It was really good. The flavors and the heat was a perfect balance. I wish there was meat in it though, but I found out I can ask to add it for additional charge. \n\nThe pot stickers came in a cute basket. It was crispy and had good flavor. \n\nI need to come here with more people to try other things. I think everything on their menu is spicy (that's why it's called Spicy King), but it's not unbearable.", "author": "Karen H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-03", "description": "forced 15% service charge, didn't even serve water. gave us a super heavy pot and let us serve ourselves\n\n\nnot so authentic either. the sprawn wasn't crispy. instine was difficult to chew. \n\ni wouldn't recommend this place", "author": "Evelyn M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-04", "description": "The bf was craving spicy fish soup. We stumbled upon Spicy King and thought we would give it a try.\n\nThe apps were pretty good (cucumber salad + five spice beef). \n\nThe mains silky tofu fish fillet soup was a 3 out of 5. My bf's craving was curbed but not the best and not our favorite. The tan tan noodles were very tasty and spicier then the soup.\n\nThe service was in the needs improvement category. Ie they served the soup with no spoons or bowls... We had to ask for the rice we ordered... Nothing extra friendly about this spot.\n\nOh and they charge $0.30 for a to go box!\n\nIf you want something decently spice and don't care about service this is perhaps worth a visit otherwise not.", "author": "Stephanie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Best Szechuan food in SF Chinatown!\nRecommend silky tofu fillet and chongqing xiaomian noodle!", "author": "Crystal L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-13", "description": "Really happy that we have another alternative for good spicy Chinese food other than Z&Y. Really good food but very spicy...just the way we like it. Service is not the best but it's about what we expect of an authentic busy Chinese restaurant.", "author": "Cindy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "My husband and I wanted to grab a little snack and we both love hot and sour soup so we stopped in Spicy King. By far the BEST hot and sour soup we've ever had!!! We also had Kung Pao chicken that was very good as well! Highly recommend!", "author": "Lisa O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "this place was really subpar, the food was okay. the chicken with explosive chili's just had way too many chili's. i've been to other places with the same dish where they gave us a reasonable amount, but this place really tried to make the dish look bigger and get away with giving less chicken by going overboard on the chili's. the chicken fried rice was okay, nothing special, kind of bland. tasted like the frozen one you can get at costco to be honest, but it wasn't bad. the eggplant dish was pretty good, again nothing special. the chicken in the chicken dish itself was really good, the chili's just ruined it. the complimentary tea was really good, similar to the same tea they give you at most places, but as a big tea fan i really enjoyed it.\nthe service deserved zero stars honestly. our waitress tried to walk away every time. she didn't give us the tea until we specifically asked for it, and the food took forever to get there. in addition, these three dogs kept running everywhere and barking really loudly. who knows if they were in the kitchen or something while the food was being made. that was really concerning.\nall in all, the taste of the food was okay to somewhat good, but the service was just terrible.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-10", "description": "This is a complex review, but here goes. I'm giving this a 4 star but I want to give it 3 1/2. \n\nWhy?\n\nBeing an American, I have come to expect my Chinese food to be a certain way. This food may have been to close to what actual Chinese food is like and I have yet to acquire an appreciation for it. I had the spicy chicken. \n    My spicy chicken was SUPER spicy. But what turned me off is that it was dry (no sauce) and for the price did not come with rice or noodles $13.95. Rice was $5.   Now don't get me wrong. It tasted great. I had to order a side of sweet and sour sauce to tone down the spicy flavor.   We also had Mongolian chicken. Also very good flavor $9.95. \n\nCome before 5pm. This seems to be a popular place. The waitress was swamped with all the tables until the other hep came in. \n\nOverall it was tasty. Just not what I'm used to eating.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "Stopped by for takeout.  Crowded. Portions are huge. Got garlic eggplant. Enough for two. Well balanced with flavor and spice.  There was a wait, but expected, given that they were full.  Will definitely go again when in town to explore more of the menu.", "author": "Steven E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-13", "description": "OMGGGGG GUYS THIS PLACE IS THE BOMB\n\nEven if you don't speak Chinese, you could get by since the servers we had that day spoke English really well, but that doesn't make this place less legit. It is DELICIOUS.\n\nYou in for some spicy Si Chuan food? Then get, it, girl, and get your stomach ready.\n\nThings we got: ma po tofu, a combination clay pot, garlic eggplant (duh), and black bean spicy beef. Also the noodles. And, at the request of my boyfriend, even though I kept giving him skeptical \"are you sure\" looks and comments, preserved eggs with jalapenos.\n\nThe ma po tofu didn't come with the ground pork that I expected, but it actually worked out well because it means the vegetarian in the room got to eat it. And even without the pork it was full of flavor, and the tofu was that perfect firm but but not too firm.\n\nThe combination clay pot was full of red peppers, and was like a little \"find your treasure\" kind of situation. Spam, beef, shrimp, fish, lotus roots, bamboo shoots, mushrooms--it was all thrown in there, and you just had to dig past the pepper corn and chiles to get your favorite parts. A lazier person would've been over it. I was showing off my chopstick skills and in full Mama Bear mode, so I was into it.\n\nBlack bean spicy beef was solid. The noodles were SO GOOD. The chewiness of ramen, and the spicy broth that made me think of Korean ramen.\n\nEven the preserved eggs with jalapeno were good, floating in a spicy chile oil, the creaminess of the preserved egg help cutting into the spiciness.\n\nThe one thing that I'll say is that you have to order rice separately, which makes me a little sad face, because I think rice should come with food, but they have hot pot, so it makes sense that it doesn't come with the entrees.\n\nThe wait was LONG, but the food was def worth it. I am for sure coming back to eat more.", "author": "Rosy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "Oh my gosh the food here was SO good!! Get the dry noodles and eggplant with garlic sauce (best I've ever had) for sure. The whole fish, beef hot pot and bbq squid were also super delightful. The chili chicken was strongly flavored with szechuan peppers, so unless that's your jam, beware. \n\nWe came with a big group on a Sunday night, and some of us (the couples in the group) actually had to share plates because they had run out. I've never had to do that before! But we had a good time. I'd definitely come here again for food with some close friends, but if you're planning to have a nice dinner with some unfamiliar people then I would caution you to go elsewhere.", "author": "Sarah Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Solid lunch. Reasonable. Clean, good service and a huge menu.  I only wish I would have had more friends with so we could have tried multiple dishes in one sitting \n\nLoved the hot and spicy soup and G loved his dish with pork and beef in a spicy broth.  \n\nWill be back again and again.  I want to try all the unique hot items they offer.", "author": "Samanta V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Delicious fried rice! Menu has LOTS of choices, some for the very adventurous. Relatively quick service, price reasonable.", "author": "Victoria H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "Terrible service, called ahead to order take out. Upon arriving was made to wait half an hour for the dish, and then told no more rice that I ordered ahead. This could have been told to me way earlier and I could go somewhere else.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "This is the one of the best spicy Chinese restaurants I've tried in USA so far. We tried House Cold Noodle, which was big enough for two people and it tasted not very spicy and a little bit sweet, but it is delicious. We also had Spicy Kidney and Chong Qi Mao Xue Wang, it's also good (the main tastes of them were numbing and appetizing instead of very spicy) All in all, I am very satisfied with the food. The service was just ok.", "author": "Xueming G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "Every single thing we've eaten here is the best Chinese food we've had in San Francisco. Tan tan noodles are the best noodle soup, better than any ramen noodles you can find. So much flavor. They're portions are big and everything is just great.", "author": "I S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-04", "description": "This would have been a 3-4 Star review if not for the roach... We were in San Fran for a few days in Nov and had dinner here. Menu had a wide selection, food was pretty good, decor was cool, and we had a huge round table in one of the like booth nooks which was also cool. The tea is in these heavy cast iron kettles, also neat. BUT when we were pretty much done eating, I saw a roach fall from the hanging light fixture onto the table. We're all afraid of bugs and were trying not to make a scene while trying to get a waitress's attention and keep an eye on the roach. I think they initially thought we were trying to skip out on the bill or something cuz they couldn't find the roach at first. Anyway, we didn't want to hang around there so we waited for our check towards the front of the restaurant. I think they ended up applying a 15-20% discount which, in hindsight, was probably not enough but we just wanted to get out of there. We tried not to think about what could have been in our food.", "author": "Irie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Get the pork belly! SO. GOOD.\n\nThere seems to always be a wait here and the staff is constantly busy/lacking.  But the food is awesome.  I love all the noodles too.  \n\nPro tip: don't wear white.", "author": "Joyce C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "THIS PLACE WILL MAKE YOU SICK. NO JOKE.\n\nVERY unclean and the owners/employees seem not to care about it. You can find way better authentic food in chinatown without having to sacrifice your health and money. Please don't waste your time here! Walk around the corner and find 3 or 4 choices that are much better. Enjoy SF!!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "I went here on Friday for dinner and it was just aweful. We got the chicken, duck soup, pork, and chow mein. Both the pork dish and chow mein were super salty. The chow mein had a ton of soy sauce in it. \n\nThe chicken and duck soup were good. They were really spicy. However, be warn with both of these dishes the food is sitting in a pool of chili oil.  The chili oil is how they make everything spicy. It's so greasy. Yuck. \n\nThey also charge $0.30 for each small to go box. The horrible food plus the costly to go boxes made it easy to waste all that good and leave it behind. Not returning back to this again.", "author": "Rose Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "It only took one bite (of ANY dish) at Spicy King to make it my new favorite restaurant. No joke! Don't let the spice in the air intimidate you, but rather pull you in as a preview of what's to come. My go to dishes, garlic eggplant, mapo tofu, and the greens! This place is authentic as it gets when it comes to Szechuan food and cannot think of a better place in the area. I recommend this place for any and every occasion. Suitable for everyone, even vegetarians!", "author": "Talia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "Went to this restaurant for lunch. Even though the food was nothing to brag about ,but the service was good, so decided to go again for dinner tonite. The two waitresses that were serving tonite were the  most unfriendly and rude servers .Would never go back there again. If the tip was not added to the bill, I would have left without tipping them.", "author": "Sarwat R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "ahhhh - not sure if it's because my tastes have changed, but i think the spice has become so much milder than before! crazy. meeps! i want to try some of the other new hunan houses in chinatown..", "author": "Christina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-25", "description": "Customer service is so bad!!!\n45 min wait last night!! They kept speaking Chinese to me even though I already said so many times I can't understand Chinese! \nI ordered 5 items for 2 people - 4 out of 5 came out to be cold dishes on a night that's already really cold. I asked the waitress if those were good and she just said yes. Can only eat the tan tan noodle - and pack the rest home because they were too cold to eat!!!\nI paid $3 for tips because they Never come when we wanted to order more items, and I feel unsatisfied with the food- another waitress came and ask for more tips because $3 wasn't enough?!? She got into an argument with me and keep saying if food is good I should give more tips... wtf", "author": "Vi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Spicy King to the rescue!  We had a group of 10 for my friend's birthday lunch and they were able to accommodate us at one big circular table.  And let me tell you, the things they brought to that table were absolutely fantastic.  I had lamb w/ peppers, people loved their Peking Duck, the potstickers were ridiculously good, and the list goes on.  I had been there before and loved it, and so did this whole group.  Definitely a great China Town find", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "I've been here about five times and I've only had their noodles. I've had their tan tan noodles, spicy noodles, beef noodle soup, and noodles with eggplant. I'd give them all 5 stars and they are not as spicy as you would think!", "author": "Jessica Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "If you like spicy food AND Chinese food then this is the place.\n\nFood was amazing (all of it) and reasonably priced.  Try the spicy eggplant because it's AMAZiNG!!\n\nService is well........not great but given the ladies barely speak English I can live with it", "author": "Robert K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "Best Asian food experience ever. The beef tendon is delicious as an appetizer and the portions of everything on the menu are huge! Be prepared to eat when you come to this place. This is hands down the best in China Town. If you don't eat here you will be sorry. I tried a few other places in the area and was sadly disappointed. This place delivers!", "author": "Franklin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "It's a wonderful place for people who like spicy stuff. We got the sour and spicy noodles. It wasn't that good, cuz it's a lil too sour for me. Also, we got 一品水煮鱼. Thts something I'll definitely try again next time. 麻辣牛肉面(spicy beef noodles) was awesome. I like it. That's a place I'll recommend to my friends and family. :)", "author": "Lucy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "Five star solid. You won't find this place peddling menus on the corner of Grant Ave luring tourists in for \"authentic Chinese cuisine\". They obviously don't need to. Do your self a favor and walk slightly up the hill to Waverly Place for some darn good Sichuan cuisine.\n\nAs the name suggests, the standard offerings here definitely have a kick and I'm sure that they could punish you more if requested. I was here with my kids and a friend visiting from out of town, so I kept the selections a bit tame but everything we ordered was great and we all left full and happy. I'd love to come back here with someone who would help me explore some more of this huge five page menu.\n\nThe spicy sauteed green beans were the group favorite and were every bit as good as I remembered from my travels to Shanghai. The salt and pepper shrimp were unexpectedly good, perfectly cooked, lightly breaded, and a great compliment to the other more spicy entrees. I was jealous of the other tables who were sampling huge noodle bowls, hot pots, and other interesting delicacies. Next time...\n\nI haven't explored much of the cuisine in SF Chinatown, so don't actually know how this compares, but for this kid, it was a hit.", "author": "Shawn W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Been to this place so many times and it never disappoints me!! Food usually comes pretty fast as well. Definitely recommend.", "author": "Shirley X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-26", "description": "Don't know what to say. The food is delicious and decently priced. The service is 100% crap. My husband and I were here for over 2 hours mostly just sitting and waiting. They also didn't get our order correct.", "author": "Amberly L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-29", "description": "We pre-yelped this place before going since we knew we were going to be staying in the area. I used to live in Chinatown and I really wish I had known about this place at the time!\n\nIt was a Wednesday night and the place was totally crowded. We ended up sharing our table with another couple because we were so hungry and the places smelled so great we didn't want to have to wait any longer. \n\nWe ordered the spring rolls as an appetizer. They came out crispy and fresh. That was a great way to start off the food experience.  \n\nNext came the princess chicken. I don't know what flavors they used but the combination was sweet and spicy and drenched in sauce yet the chicken was still crisp. This was definitely my favorite dish of the night.\n\nAfter the chicken came out we realized that we had ordered some steamed rice and actually had to ask them to bring it out. I'm guessing they forgot too. That kinda sucked.\n\nLastly came the orange beef. That was pretty amazing too. It wasn't very tough to eat and came with tiny shavings of orange peel cooked into the sauce. That was a refreshing and delightful touch.\n\nSo, I really debated if I was going to give this place 3 or 4 stars. The wait staff was absolutely horrible! They never asked us how the food was. Never asked us if we wanted another beer or if we wanted more water. It was a shame. At the end of our meal we were still being ignored and we had to resort to putting out hands in the air like we were in elementary school just to get them to pay attention to us. This place really deserves 3 stars just based on that but the food was just so damn good!", "author": "Andy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "First 2times, everything was so tasty. This time, hot and sour soup was so blend and it was simply bad. Egg plant dish was not the same. The chef forgot to put aged egg, but the very unfriendly waitress insisted they are under the green peppers and turned out, there was no aged eggs on the plate. I was disappointed to find out that the food quality is not consistent at this restaurant.", "author": "Yasuko T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "My wife and I might be anomalous, but we really love the simple Chinese dishes we ate all the time when we met, began dating, and got engaged in China. We were pumped about authentic Chinese food in Chinatown, and happier still when we found the menu here, and felt our suspicions confirmed by the mostly Chinese clientele.\nThe restaurant is not very large, but they do offer to seat small parties together at larger tables. We took this option, but it meant staring at and smelling the amazing foods our table-mates had ordered before we had even placed an order! We went simple: \"fish flavored\" egg plant, hand torn spicy cabbage, and spicy broth tofu. When the cabbage finally came out we devoured it almost instantly! It was the exact Sichuan style dish we were craving! Sadly, the subsequent dishes were not as satisfying. The tofu seemed to have cracked black pepper, which we found odd, but the eggplant was inedible due to the skin, which we can only surmise was burned.\nThe service was also very slow. I think they were under-staffed, but the tables that emptied stayed dirty a long time before anyone from the developing crowd at the door could've seated.\nIf you're looking for fancier dishes, this place seemed to do the trick for whole fish and hotpot, but for more modest fare I think you'd be better off looking elsewhere.", "author": "Charles G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-09", "description": "Yum yum! This place had great atmosphere.\nThere was a bit of a wait, but if you are willing to share a table and make new friends you'll get seated faster. \nThe prices are reasonable. I will totally come back and eat here on my next return to San Francisco.", "author": "Rachael Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-20", "description": "I was originally attracted by the chongqing noodle but as soon as they brought it up it just looks really unappetizing to me. The spicyness and numbness is not as close as the authentic and the veggie they use doesn't seems to be washed properly. \nI will not come here again...", "author": "Sanli T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-04", "description": "Without much in the way of tasty Sichuan options in the city, my go to has been Z&Y up until now, because, well, they're not bad, and they're close to work. My friends suggested this place a few weeks ago though, so I figured I'd give it a shot. Coming in right at 7pm, the place was already somewhat packed, but even so, I managed to beat a big rush of customers that came soon after I did.\n\nWe ordered a few of the usual Sichuanese appetizers: cucumbers, pork ears, and so on, but we actually decided to hot pot it up as our main that night. All in all, everything was just okay. The appetizers were on par with Z&Y's (though the cucumber dish was not what we expected), and while the hot pot was okay, it had a particular medicinal/herbal aftertaste that I wasn't too fond of.\n\n***Accessibility Info***\n\nVenue - The restaurant is a little on the smaller side, and it seemed to me like some of the tables were arranged closely enough that they wouldn't be accessible. The ones closest the door don't pose any problems, however.\n\nBathroom - Didn't check them out, so no comment.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "The absolute best Chinese food I have ever eaten. \n\nYou must stop here and experience the food and the people. This place alone made the walk through Chinatown worthwhile.", "author": "Terry M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-16", "description": "Not a bad place if you are craving Szechuan style food. The restaurant is located in the heart of SF Chinatown. It's a small-medium size restaurant, and I can see this place getting packed easily. Luckily, our party of 3 was seated immediately (probably because we were there on a Monday night). \n\nI would recommend getting the mapo tofu and the fish fillet boiled in chili oil. I felt the taste of the food was more geared towards an Americanized audience. \n\nNo particular reason why I only ranked it a 3-star... It didn't disappoint, but also did not wow.", "author": "Sherry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Ordered the Tan Tan Noodles and was not disappointed. Great flavor and wonderfully spicy. I would eat here again in a heartbeat. Service was not a problem. \n\nIf you like tasty, hot food, then this is the place.", "author": "James R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-10", "description": "The Szechuan dish is not authentic at all, it is run and cook by all Cantonese folks . we had spicy lamb, the lamb meet was cheap hot pot slice lamb meat, we also had hot spicy fish tufu, the sauce is quit gluey. This is one of the worse Szechuan food, definitely do not recommend .", "author": "R Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "Ran into this place after some yelping and their Noodles is really good! Definitely coming back to try the other things on the menu!", "author": "Anna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-02", "description": "I liked this place so much that I brought my family here. But this time，I am pretty disappointed. They lose their genuinety. Dandan noodle is no way close to what it ought to be. It becomes ramen like noodle in soup. Seriously??? So sad that it turns from a great sichuanese Resturant to an ordinary one.", "author": "April W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "I ate here a couple weeks ago and got the panpan noodles. It was soooooo delicious. I've been looking for restraunts across the United States that serve pan pan noodles and have not found any place. I will have to make a special trip into Chinatown when i am in the area next time to feed my craving. The hot tea was very good also.", "author": "McKinley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "Very nice for lunch - great location we got here right when it opened and 20 minutes later people were filling in..... Fantastic hot n sour soup \nGreat spring rolls\nBeef and onions are yummy\nGreat San Francisco experience \nOnion pancake - Best I have had in a long time\nService is good", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "stopped in this afternoon and got the Ma Po Tofu. I was really disappointed that it wasnt very spicy at all. The service was efficient and the place was clean.Total was $14.54 for mapo doufu and 1 cup of steamed rice, no drink", "author": "Just S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-25", "description": "Waited for more than one hour ! Definitely understaffed, needed to wait for someone to get our orders, needed to wait to pay. Food here is not as good as we expected, and is over priced for the food and service that we got. Would not recommend others to come here if they crave for spicy food (especially during winter) don't get attracted by their fancy menu and food photos !", "author": "Chun L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-14", "description": "The food was good, probably not as spicy as authentic Sichuanese food, but we liked it. I'd give a better rating but, as many others have already said, the service is horrible. We had to wait in line for 30 minutes, then they made us seat in a round table with other four people that weren't with us for another 20 minutes, then finally (despite refusing our request at first when we saw a couple of people leaving) they gave us a table just for the two of us, where we waited for another 20 minutes until somebody finally showed up to take our order (with a not so friendly attitude). Meanwhile the waitresses were just roaming around the restaurant, gathering dirty plates very slowly and trying to ignore all the customers. It's a shame because the food is good and this place could be much better if only they improved the service.", "author": "Sonia G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-10", "description": "Delicious szechuan place in SF china town. \n\nI usually get the spicy fish with tofu - basically it's fish and tofu and some vegetables drowned in chilli oil - along with the cucumber salad to cool things down.", "author": "A H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Found this place on accident a year ago. Went back again just to find this place. Did not disappoint. Second time here-LOVE. Food is amazing!!!", "author": "Carma H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "Came here for lunch and ordered the chili boiled beef on the lunch menu.  Complimentary hot and sour soup was pretty good.\n\nBeef was nicely flavors and tender.  Only complaint is that it's very much toned down for the non Sichuan (non s.w Chinese) population, so the food is mild.\n\nThey screwed up my order... gave me fish instead of beef which they exchanged but somewhat reluctantly.  Service is subpar so don't expect much on that front.", "author": "Paul K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-28", "description": "Server told my boyfriend & I to sit at the end of the bar right next to the kitchen door where the workers go in & out, because supposedly there were no \"small tables\" even though there were plenty of small tables (seat of 4) in the back. \n\nThen when we were about to sit down, a couple who was sitting at a table just paid & left. So, we asked the server if we can sit at the table instead because the end of the bar was too cramped & if we sat there, we would be blocking the entrance to the kitchen for the workers. The server then said \"no the other couple who came in after you is going to sit there\". Yes, the couple AFTER US. \n\nSo, my boyfriend & I decided to get up & leave soon after because we are not going to take that kind of crappy service & we'll gladly spend our money elsewhere.", "author": "Yummy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Best Sichuan food I had ever had. My Chinese friends tell me its authentic Sichuan. We have been back a couple of times. Can't wait to go again.", "author": "A. A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Came on a Friday at 7pm, we beat the rush and didn't have to wait. Like a lot of other reviewers noted, this place is comparable to Z&Y, and I think the service is much better. Plus not as many ppl know about this place yet so not much wait. \n\nHad the following dishes:\n\nsautéed green beans - a tad too salty for me\n\nGarlic Eggplant - I asked them not to make it sweet and this was a win \n\nSpicy fried chicken - really tasty, comparable to Z&Y\n\nShredded pork Hunan style - delicious wish it had more meat tho \n\nGreen onion pancake - thin crispy greasy deliciousness", "author": "Jenn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "It is one of the most popular Chinese restaurants. The environment is nice and the waiters are so kind. There are lots of Sichuan dishes. We ordered frog flaming pot and fried lotus. They are all delicious and not that spicy like China. You should go there and have a taste.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "This is one of my Favorite place for dinner in the city.  Great food, great service and even have karaoke in the vip room upstairs. How can u ask for more?", "author": "Henry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "A good alternative to the long lines at Z and Y", "author": "David T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-28", "description": "The cold noodle is super good, every time I come here I must order this. And this place is a good place for a big group. If my friends don't have any idea for dinner, I would recommend this place for hanging out.", "author": "Hung Ying L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "First time at this restaurant for Chinese new years.  I'd say this place is pretty good but a bit pricy with some dishes being almost 20 dollars.  Though everything is red, the food is not as spicy as szechuan food from China.  Flavors are good though.\n\nCaution, combination hotpot had a lot of innards, pigs blood, lotus roots so if you don't like that stuff don't order it!", "author": "connie h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-01", "description": "Once we walked in nobody seated us and we were trying to find our way. Nonetheless most of the bigger tables were available, they really wanted to sit us (party of two) on the tiniest table in the restaurant. This would be okay, if we didn't have to wait for the previous guests to pay and clear the table. And finally they seated us before cleaning the table. \n\nThe service throughout our dinner was just okay, we had to wait for a while to place our order and get the check at the end. \n\nIn regards of the food: I would call authentic. It's spicy as the name of the restaurant tells. Each dish comes with steamed rice and you need this to extinguish the fire :-)\n\nBe aware that there are nearly no non-spicy dishes. \n\nSummarizing: an authentic place with a Chinese-efficient service.", "author": "Martin Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-01", "description": "We ate at this restaurant for lunch today. There were 5 of us.  The food overall was so-so, with dishes like Tan Tan noodles being a little in the bland side and with little spice at all. \n\nThe service was terrible.  We waited almost 20 minutes before they came and took the drink order and another 5 before they took the food order.  They brought us out 3 orders of rice when we only ordered one, but they charged us for all three.  And they didn't bring the drink order until being reminded twice, and it finally showed up when two of us were already finished with our meals. Then we waited 15 minutes to get the bill and finally gave up and paid at the front. \n\nIt was not an enjoyable meal and the service didn't help so I could not re come d this restaurant.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "Food is too spicy for my palate but the flavors were great.  We ordered the garlic pork belly ( which is served cold, the server let us know which was much appreciated) and the tan tan noodles which was ground pork and veggies noodle soup. Located in the heart of Chinatown.", "author": "Rose R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Awesome spicy Sichuan food. The duck soup wasn't my favorite but every pork dish was amazing. Wish the Sapporos were 16 oz cans", "author": "Sean R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "Walking through Chinatown, a few of the people I was traveling with became hungry and wanted some good food. A woman approached us and gave us menus to Spicy King. We were apprehensive at first because most places that do street advertisement like so usually turn out being fast food Chinese that you can find anywhere. When we stepped into the place we were surprised by how nice it was! It's small and sort of cramped, but the decor is beautiful. There is a neat looking tiki bar, a fish pond and other little odds and ends that added to the atmosphere. \n\nI wasn't very hungry so I just sipped on tea and ordered pot stickers which were very good! Probably the best I've ever had. The other two people I was dining with ordered a sort of deal for two (for I think around $20-25) in which they received soup, two entrees and rice. It was so much food. Everything looked amazing! \n\nService was a bit slow, but the servers were very friendly. I guess slower service must be a common thing on the more laid back West Coast - something us East Coasters should learn from.", "author": "Aj S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-20", "description": "Mediocre service, slow and unfriendly. My chicken dish consisted of about 20 pct chicken to 80pct chopped, dried red chiles. Chicken was good, but not much of it. Spring rolls were excellent.", "author": "Susan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "OMG the 小锅米线 is so amazing!! Definitely the taste of my hometown Yunnan. However the \"小锅\" is huge though, almost the same size with my face~~ LOL", "author": "Ruo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "I've been here twice, but I'm already pretty much in love with this restaurant. I've never been to China, but out of all of the Szechuan places I've been to across the country, this place has got to be one of, if not, the best. Although this place is tucked away in Chinatown, the have a large space that's great for fairly big groups (~7 or 8 people).\nService here is not that great, if you're expecting someone to come in and check on you often or being able to flag down a waitress quickly, but I think it's perfectly fine. The staff here does hit the major points: takes orders well, delivers food fairly fast (even when they're crowded), and brings the check at the end of the meal.\nThe real winner of this place truly is the food. Service aside, this place deserves 5 stars for the taste of their dishes. I love the explosive chili chicken and mapo tofu. It's such a hearty, comforting meal with a bit of a kick. I'm a huge fan of spicy food, so I don't feel the heat, but if you struggle to consume Tabasco, this place may not be for you.\nIf you ever find yourself in Chinatown, seriously check this place out!", "author": "Marissa O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "If you order hot expect hot. No refills city water be ready with plan B or survive the heat. I can't fuss about spicy when the menu is clearly marked.  The restaurant does well at balancing spicy with flavor. As long as you accept the warnings you won't be disappointed.", "author": "David L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-25", "description": "We ordered 3 dishes. The first one changed its presentation and flavor, again. As a Sichuan native, I don't expect authentic food but somewhat closer taste will do. \n\nThe second one was clearly wrong. We ordered a stir fry beef dish. But this one came in a soupy pot. We called our waitress, a shorter Chinese girl. She looked at the menu with the picture, and told us \"we don't do the dish in this picture any more\". Excuse me? This is called false advertisement. When we asked for the manager, she said \"the boss is not here\" and walked away. \n\nIn 15 minutes, we checked with that waitress again, not knowing what she was doing with our mixed up order. She repeated her defense \"the boss is not here\", and walked away again. \n\nAnd after that, our 3rd dish never arrived, never......\n\nNeedless to say, we won't be back, ever......", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-18", "description": "Have been here many times with different group of people. Food is simply amazing, however service has always been on the lower side. This place is always busy and seeing two waitresses running around makes you feel sorry for them. They keep on forgetting my order -sometimes drinks sometimes rice- takes them forever. I still love this place n keep on going back. If only they could focus on service!!", "author": "N B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "All was good. Had spicy fish, green beans, intestine, lamb. Everything was flavorful but I think the lamb was likely the highlight of the lunch. Others preferred the intestine, though. You just have to try as much as you can and make your own mind up. Flavors are on point, that is the main thing. If you see something you usually like, try it!", "author": "Mark K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-23", "description": "We went for lunch. They have huge menus with tacky photos of two chefs on the cover wearing numerous medals (medals from what, who knows) around their necks, and beautiful tasty looking photos of all the dishes. But there is fine print that says something like our dishes may look different from the photos. Ordered a bowl of dan dan noodles and a bowl of chongqing noodles. The chongqing noodles had a tad more of the numbing spiciness, and included a few tiny strips of lettuce-like vegetable. The dan dan noodles came in a different style of bowl, and had a teensy tiny bit of sweetness in the broth, but other than that the two were virtually the same. There were only maybe 3 tiny crumbs of ground meat in the dan dan noodles. Where's the meat?\n\nJust because there's that disclaimer on the menu, it doesn't mean it's okay to leave out one of the three usual components of the dish. The noodles were tasty...but...they were plain noodles and sauce. For $18. Which doesn't sound like a lot, but they were just plain noodles, and that's 30% to 50% more than the average lunches in Chinatown, lunches that include actual ingredients like meat and vegetables.\n\nService/decor - I would have thought they had only been open a couple months, and were just ironing things out. Didn't realize till looking at Yelp now that they've been open 2 years. Service was totally disorganized. It wasn't that busy and people walked back and forth inefficiently and it wasn't always clear who worked there. The decor is gimmicky. Little bowls have scalloped rims which looks kind of cool, i guess, but there's a reason why no other places use bowls like this. It's not very conducive to the Chinese way of shoveling rice into your mouth, or sipping soup directly from the bow. They sat us at the \"bar\" which ended up being very uncomfortable. I felt like a toddler without my booster chair because the counter was at bar height but they used regular height chairs there. Eh.", "author": "Mai-Sie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "The food here is very good. Some of the best Sichuan food I have had in the US. The place was very busy and understaffed. Had to wait about 30 minutes for a table for 2 on a Saturday night. The waitstaff was hustling hard, but there simply wasn't sufficient manpower to serve the tables and clean/bus the empty tables by the 2 or 3 waitstaff. Once seated, the drinks were brought and eventually the food came. The food was very good. Highly recommend this place. Just be patient and you'll be glad you waited.", "author": "Kbob K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Great place to try. Authentic Chinese food. If you're looking for typical American Chinese food this is not the place but I would suggest you try it. Clean and professional, bathroom is clean and nice. the food comes out hot! It was a quick service, the place seems pretty full but our food was out quickly. Attentiveness is low. Out of water and haven't came back but other than that it's been a great experience.", "author": "Anna G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "Greasy and open late. What more could you ask for!!?? Pretty tasty dishes.  They were fast as hell!  I enjoyed it.  Give 'em a try!", "author": "Wouldn't You L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-22", "description": "The atmosphere is nice, however we did not get the fried rice that was ordered as well as water. The food we did receive was not the greatest either. The food is also far overpriced.", "author": "Taylor T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-20", "description": "The service is terrible! My girlfriend's jacket doesn't want to eat any food but we found some oil on it when we left! The waitress just did a simple clean up but no apologies, so disappointed with their service. \n\nBe prepared for a long time for your food after you are seated. \n\n上菜慢服务差！重庆小面估计是没有煮熟，特别难吃。", "author": "Fred L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "I lived in Chengdu for 2 years, and since I've been back, I have been looking for authentic Sichuan food. I found it here! It was a great place for me to introduce my favorite Sichuan to dishes to family and friends here in the USA. \n\nI was so happy to see 凉面，担担面，以及热干面！\n\n我在四川住了两年。自从我寄来美国以后，我一直找地道的川菜。这里我就找到了！为我是一个在美国很好的给家人和朋友介绍一下川菜的饭馆。看到了凉面，担担面，和热干面,我就开心啦！", "author": "Andrew O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "Phenomenal food! Every single dish was far above average, including some of the best I've ever tried. Language barrier was an issue, but well worth it for the quality", "author": "Brennan R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-28", "description": "Truly awful. Waited an hour in the restaurant for my take-away order. Saw plenty of people walk in after us and get their meals while we continued waiting. Unfortunately paid and tipped at the start, otherwise I would have simply walked away. We asked for our money back after 40 minutes but was told it was almost ready then waited another 20 minutes. Their excuse was that there was only one chef working that day, but clearly they were prioritising other people. After an hour, the food was greasy. Could not recommend less. Worst experience we had in San Francisco.", "author": "Alic J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-04", "description": "food : 3 stars. We ordered boiling fish and pot chicken. Even i have ask for less salty, the chicken is still very very salty.\n\n\nService: 1 stars. We are Asian. we requested ice water. But  the waitress brought was temperature water. No ice. No lemon. The customers next to us are white people. The servicer brought them ice water with lemon.\nThe store was lack of servicer. There were only two waitresses. Therefore, the service was very slow. \nAlso, we waited for one hour to get our two dishes ready. \nWhen the waiter brought the tea, the hot water was sprayed to my leg! He was not intentional. But he was not professional at all. He filled the tea pot too full.", "author": "Fangfang O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-27", "description": "I should say something after visiting there with high expectation. I ordered the guilin rice noodle which is my hometown popular food. I want to say this food is not good. If you come here,  it had better not order this food.", "author": "Lizi X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-19", "description": "I dislike giving places a 1 star review, please but hear me out.\n\nMy girlfriend and I was in the mood for exploring Chinatown. We always go to ABC Cafe or Washington Cafe. A stroll down Waverly Place was our route of exploration. Either of us have eaten here, so what the heck, lets go out of our comfort zone. \n\nThe menu on windows looked enticing. As we walked in, there was a lady with a clipboard asking us to put our name down. The joint was packed and full of patrons. It looked clean and well maintained (I don't know if it is due new ownership or has alway been like this.) After waiting 20 minutes (and looking through the menu with very small type) or so, the two party of two people ahead of us was seated. They were seat next to each other in a rather small joint tables. \n\nThere were 2 girls behind us and we let them go ahead of us because we wanted to be seated at a table for 2 (not sharing a small table with other patrons.) They sat at a  big round table to be shared with other patrons. After another 15 minutes, their table was not yet cleared or any attention given to them.\n\nWe waited patiently and saw a table of 2 leaving so we can have their's. This is when my patience started to wane. The lady with the clipboard is also a street hustler who is on the street passing out menus to tourist and people walking by.\n\nShe obviously did not care about us because she serviced a party of 9 people to sit before talking to us. That is when we said enough and walked out.\n\nInclusion, we waited almost 50 minutes (willing to share a reasonably sized table with other patrons.) None of the employees seemed to care about service. The two waitresses looked extremely unhappy while working. \n\nWe walked down the street to Utopia Cafe.", "author": "Tony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Spicy King is one of the best Chinese restaurants in the Bay Area! Their food are not only taste great, but also look awesome!!! Check it out and you won't be disappointed.", "author": "Gary T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "Just had the sesame chicken with rice but even that was delicious and exceptionally cooked! Enjoyed people watching and talking to a few locals who thought the restaurant was very authentic. Great dinner experience in Chinatown.", "author": "Ashlie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Had the mandarin dinner for 2.   Very tasty included spring roll, hot and sour spicy soup.  Mongolian beef and cashew chicken.  All very good. Definitely would recommend.", "author": "Elena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Better than many mainland China restaurant. A little bit expensive but worth the price.", "author": "Yin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "I was surprised by how authentic the flavors were here. We came on a rainy day so fortunately there was no wait. My friend and I shared the enoki mushroom salad, she had the gong bao chicken and I had the eggplant in garlic sauce. All the flavors were delicious and authentic. Run, don't walk to try the eggplant, seriously.", "author": "Crystal Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-21", "description": "Some of the dishes here are okay while some are just awful.  For being spicy king we didn't find their spicy menu to be remotely hot.  Some of the menu tasted prett bland.\n\nFor being in chinatown I think you can find way better food.\nTo their benefit their service was prompt and the decor inside was really nice.\nHowever, I judge a place by the food, not by the service or decor and the food doesn't cut it here especially when there are plenty of better places just a few steps away.", "author": "Daryl D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-12", "description": "We were wandering around Chinatown during the parade and found this place. Bottom line: The food was good, the service was terrible. Had to search for the waiter to order (we were in a cubby) and ordered a simple dinner for two. Asked for water, the waiter brought us a carafe with NO glasses. Flagged him down and asked for glasses, he said they only had paper cups (?) then he brought glasses. After 45 minutes with no service (we were talking) searched for the waiter again.... Apparently he had FORGOTTEN to place our order. Had to get the manager to get the order placed. Thought they might comp us or give us something extra for this snafu, but nothing (even charged for the takeout boxes). It was early in the evening and not yet full so there were no excuses for this bad service. I hesitated to make this review, but apparently poor service is standard here.", "author": "Josie E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-19", "description": "This is an authentic Chinese restaurant.  Since it was highly rated we stopped in.  First thing to note is that if you're looking for this place, there's no sign for \"Spicy King\" outside it.  I think it was like Uncle something...\n\nAnyway... I ordered their lamb dish and and I can't remember what my husband ordered.  We're Caucasian and have never eaten at an authentic Chinese restaurant so we probably should have gone with something familiar like beef and broccoli.  (Yes we've had chinese-american food a million times, but definitely different from the real deal, which is why we stopped here...)  Anyway, the waitress made a big deal of telling us the food was spicy, specially my husband dish because its had \"spicy\" in the title.  Both dishes were fine.  My husband and I actually traded our dishes because we each liked each other's better.  I didn't think either dishes were \"spicy\" at all.  I know some white people can't hold even a dash a pepper, but that's really the only spice they added to our dishes.  Not sure if they toned it down for us even though we said we were fine with spice... oh well..\n\nThe pot stickers were amazing.  And I really liked that they served tea instead of water here, but our main dishes were just kinda barely tolerable.  They just didn't taste that good.  Oh well...", "author": "Cassandra A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-10", "description": "My friend and I had finished eating our meal and we were figuring out the bill. I saw something out of the corner of my eye and I remember thinking \"is that what I think is is?\" It was. A RAT ran under my friend's chair and then ran back out again. I instantly jumped out of my chair and out the door. That was the first time I've ever seen a rat inside a restaurant - it totally turned my stomach and freaked me out. I will NEVER be going back.", "author": "Joanna L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-12", "description": "This was a great, local restaurant off the beaten path.  My wife and I were looking for a good Chinese restaurant for lunch and was handed a menu at one of the street corners on Geary Ave.  We looked at it, reviewed yelp and decided to take the risk.  The lady passing out the menus walked us one block to the inside of the restaurant, which was very impressive.  The place was very busy... We were immediately greeted, seated, provided menus and tea/water was already coming.  We ordered traditional items; Spring Rolls, Kung Pao Chicken, Mongolian Beef, Steamed Rice.... And, was given the opportunity to increase or decrease the spicy.  The food was delicious!!!  Very authentic!!!  Amazing!!!  Definitely would go back again.  We had a choice to sit with another couple (mom/daughter), which happened to be locals.  They order 3 dishes, and said it was the best place around.", "author": "J. E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-10", "description": "If you love Spicy Foods, this is the place. Everything has chilis in it. The only thing is, the wait time can be long. Most people who had dinner here, very relaxing and enjoying their time, so the wait for the table could be long. And this place is not that big.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-07", "description": "When I lived closer to this placed I used to go all the time. Food is food and see if was pretty good too. For some reason now I don't like spicy food so I don't go to places like this as often. My boyfriend loves spicy food so we come here from time to time. He always orders the lamb and I like the tofu stuff they have but always ask for it to be less spicy. It's a good place to come with the family. I will be back again", "author": "Peishan H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-24", "description": "The restaurant was clean and the food was good but the waiter was really rude. \n\nThere was only 3 of us and they automatically charged us tip. They didn't even deserve the more than 20% tip that they put down. But we went ahead and paid it anyways. We paid in cash and just let them keep the change; however, as we got up to leave they rudely stopped us and told us we haven't paid any tip. To which, we had to point out that they had already charged us on our bill.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "I spent a month in Chengdu and let me tell you this is the closest to the spicyness I experienced over there. The fish in hot oil was great, the eggplant was flavorful and the numbing tendon was a delight. It was a little on the expensive side for one person but it was a treat since I'm the only one in the family that likes it hot!!", "author": "Tony A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-27", "description": "Not much good to say here. Spicy pork was decent. Crazy hot chicken was crazy hot....good but way too many chiles. Mixed vegetables were DOA drowned in a SWEET sauce. Service okay. Would not return.", "author": "Cliff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "I'm searching for a restaurant serve spicy food for a long time. This is definitely a good place for ppl crazy about spicy food. However, I hope the food can be more spicy. The price is good too.", "author": "Sicong Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-24", "description": "The sweet and sour soup with pork intestines looks amazing. The taste and portion was all there. Yet, the color and water volume was not quite right. I'm used to more of a thicker brown sugar water-base than the separated, clear liquid. Maybe it can use a little less bean sprouts too. I feel like it tries to be pho and soup at the same time. You definitely get both in volume, but I would use less water and emphasize the clear golden noodles.", "author": "Edward G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "I'm a big fan of spicy Chinese food and this is the best one I've been to so far in comparison to Z & Y and Hunan (I've only been to 3 spicy Chinese restaurants in San Francisco so far). I may be an outlier though since I ate really really spicy food ever since I was a child. \n\nI don't remeber the english name of the dishes right now. I ordered 辣子鸡 (spicy chicken), 水煮鱼 (spicy boiled fish), and this other spicy beef dish that  had a fancy decorative wooden cage-like thing. All of the dishes were really good except slightly too oily but I guess that's kinda expected in these type of dishes.", "author": "XiaoChuan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-21", "description": "This one is a good sit and wait restaurant. As we sat down eyes roll in and out. Wait to order but body sway pass left to right....30min went by.. no sign of any communications between the server... so we bail out. it seem that they only focus on Chinese customers. .. they exchange more words than to us.", "author": "Taijii T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-29", "description": "Poor service. Really bad and rude attitude. Only two or three waiters. NOBODY HELPS US ORDER. I'll never recommend this place. BAD EXPERIENCE IN SF.", "author": "Haocheng H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Took the recommendation from the guy who gave me a foot message. I'm definitely not an expert on truly real Chinese food but he is and I really liked the spicy beef noodle soup. I did whimp out and got it only a little spicy and was very glad I did, as my taste buds are only a little fried and I didn't have sweat running off the top of my head. I will definitely come back the next time I'm in town. Another review mentioned it being hard to get a table and that is probably true, I was by myself and got a single seat at the counter right away. The place was packed at 8 pm on Saturday night, just after the big Chinese new year parade in Chinatown, most of the customers seemed local.", "author": "Howard C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-26", "description": "Second time I've been here and the food is top notch. My mouth is on fire but I've got a smile on my face. If they have pig ear in definitely get it! But everything on the menu from the mundane to the exotic is absolutely delicious. The staff are great and the kitchen is FAST! Get there early to beat the crowd and don't steal the motorcycle in the lobby.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-30", "description": "I came here with a group of 5. As first timers, unanimously, we all hated it. We ordered 6 dishes, and every single one of them was extremely salty and oily. I could pour out a bowl of oil from the sauce of these dishes (we literally poured out the oil). I generally like food with flavor, but the food here was so salty, it was basically pouring msg down your throat. On top of that, I generally don't have high expectations for tea at restaurants, but the tea served here was basically water. We were curious so we looked into the tea kettle. To my surprise, there was a teabag, but the tea was tasteless? It makes me wonder if they reuse the teabags over and over again.  \n\nWe weren't impressed with the service either. We came in with a group of 5, and they decided to seat us at a big table meant for a party of 10. In the middle of our meal, they asked us to move because a group of 14 was coming in. Why seat us there in the first place? \n\nAlso, it is pricey. Every dish is $10+. We (and our wallets) would be way happier going around the corner for better, cheaper Chinese food at Capital. Not coming back.", "author": "Darlene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "I got to try this joint on my recent visit to SF and I absolutely loved the food here. I came here with my party of six on a Thursday night and we were seated in 5 mins. \n\nTwo of us ordered the vegetarian dinner option and the rest of the party ordered a shareable pot of the hot and sour soup, prawns flaming pot, sauteed string beans, onion pancake, spicy beef noodles, and rice. \n\nThe noodles were flavorful, spicy, and not at all overcooked accompanied with onion, broccoli, & carrot. The onion pancake was savory and not soggy as I'm used to from other restaurants. The string beans were absolutely delicious here! They had the right amount of bite, sauce, saltiness, and spiciness. The spring rolls that came as part of the veggie option were average, yet good. The hot and sour soup was super yummy and definitely hit the spot as it was quite chilly that night! It was both spicy and tart. The rest of my party enjoyed their spicy beef noodles saying it was a good combination of salty and spicy. The food was so satisfying, we were all done eating after a few bites.\n\nWe were somewhat disappointed with the service here since no one bothered to check up on us for drinks. We had to keep waiving for staff to take notice of us even though we were seated at the biggest table front and center of the restaurant. It wasn't even a busy night. On top of that, we never received the steamed rice we had ordered at the beginning. The waitress later admitted she had forgot & included it in our leftover boxes. Though the service lacked, I can't wait to come back again in the future to try some of their other spicy options!", "author": "Ana V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Amazing if you like spicy food...Mongolian beef is great.  Service isn't going to blow you away but that is on par with most Asian restaurants.", "author": "Steven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "Came to Chinatown looking for authentic food and wow this place Hit the spot. Their dishes were all unlike most traditional Asian dishes, they added a spicy flair to every item. We ordered fire chicken and house rice and chow mein plus a three variety suateed vegetables with eggplant, asparagus, string bean and onion that was delicious and I'm not much of a veggie eater. Service was great as well. I would definitely recommend this restaurant.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "This place serves authentic Sichuan food. Everything was tasty and portion is the right size. They have spicy hot pot, seafood, Chinese skewer and much more.. It used to be a smaller restaurant, now they have expanded with new renovation! Will definitely come again.", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-29", "description": "Bad service attitude...... Ignore us while serving guests who came after us. Choose other Chuan Restaurant in China town.", "author": "Chaoyi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-03", "description": "Fantastic. Spicy and delicious.  I will definitely come back when I am in Chinatown.  Highly recommended!", "author": "claudia g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Guys!  This is the real deal! I have been to China many times, specifically the sichuan province, and this is the most real Chinese food in America I have found! I got the beef noodles (niu rou mian 牛肉面）很好！they also have a great atmosphere and phenomena service! EAT HERE!", "author": "Brandon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-21", "description": "Nasty oil (The oil had an overly strong taste), bland, salty, and down right sucked. The worst part was that I was dying of thirst after my first glass of water and had to wait 15 minutes for the server to even notice me. If I was at any other Schezuan Restaurant, I would be more than likely to give that restaurant a better review. I love this food but...\n\n they gon' fucked it up.", "author": "Raymond Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "This is probably one of the better Sichuan food in the area. It's a bit on the pricey side, but it has a nice interior and decent service. Most of the dishes are well made. Last time I was here I had the:\n\nSpicy beef in hot chili oil - beef was tender and there wasn't much vegetable filling. Good dish.\nCouple's delight (fuqi feipian) - the flavor was good but they mixed it with beansprout? Wtf?\n\nAnother minor disappointment was the lack of spicy wontons (hong you chao shou).\n\nSolid restaurant overall.", "author": "Jake L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-05", "description": "Spicy King is a decent Szechuan spot in Chinatown.  It's nothing too special - frankly their menu is identical to Szechuan Cuisine Uncle Cafe http://www.yelp.com/biz/szechuan-cuisine-uncle-cafe-san-francisco-2 .\n\n\nIt's a good choice for a weekday lunch when you've got a bit of extra time.  The service is none too quick but the hot peppers won't let you down.  Explosive chicken and noodle soups seem to be the highlight of the menu.", "author": "Ivan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "A great new place from the people behind the pot sticker. Hot and spicy Szechwan food cooked authentically and masterfully. \n\nThe preserved egg and jalapeño starter just turned me on to preserved eggs; I'd been cautious, but I'll eat anything that comes out of this kitchen, and I was not disappointed; I'm now going to be eating all the preserved eggs until I can find one prepared as well as this was; probably wont happen anytime soon, as their bitter melon dish has yet to be beaten.", "author": "John X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-13", "description": "Amazing Szechuan food. Authentic and delicious.  Service was lousy but just be prepared for that. The food totally overrules everything else!!!", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-20", "description": "Pretty authentic sichuan food.  The 辣子鸡 is especially good.  Service is not great but this is the type of place that you come for the food and not the service.", "author": "Justin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "My sister took us to this place located in Chinatown. Her friend recommended this restaurant.  Their menu had so many items, and more spicy items than non spicy items. Now being a Korean, I love spicy food, and can handle spicy food. So when the menu said it's spicy, I wondered how spicy it will be. we ordered string beans - a little salty but well seasoned and tasty. Spicy fish and tofu were pretty excellent. Also potstickers were awesome. Not deep fried, it melted in the mouth. Mongolian beef - this wasn't my favorite but the reason is that I am so used to Korean barbecue. This restaurant indeed have authentic Szecheun Cuisine !!!!  I was impressed and pleased !!!  Good pricing.", "author": "Sean Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-09", "description": "There are delicious cuisine and great service here.I like the environment especially.", "author": "Cyrus K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-13", "description": "We ordered tofu, garlic ribs, and steamed rice.  Neither dish was spicy at all, though advertised as spicy.  The ribs were bone and fat.  The only thing that wasn't disappointing was the steamed rice and water.  At least they got that right.", "author": "Jerry G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "This is the place to go if you want to have real spicy Chinese food. I came here once a month while I have a facial appointment.\nI had tried the following dishes: beef pancake, spicy beef tenders, fire blamed kidney, spicy chicken with chili.....all very good.\nWorth a try if you like the real spicy food.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "We came here for a late lunch before the Chinese Newyear parade last weekend.  FYI, this use to be the old Pot Sticker down the street; I was so anxious to try when looking at the old menu at The Pot Sticker at the time & how the two women who own this, were from Z&Y Restaurant (see my review.)  I was not disappointed.  Thjey have a nice small waiting area & music going which goes back & forth from Kenny G to Chinese music.  The service is very friendly & the food top notch.  I started with the pancake with beef; a a thin chewy but not overly so pancake with perfectly seasoned beef wrapped in the form o9f little rolls.  The tan tan noodles are some of the best with well seasoned cabbage & ground pork in a wonderful chili sauce with a subtle one two kick.  The lamb skewers are perfectly marinaded in a robust blend of spices & tender; no sauce needed.  Round it all off with a Ching Dao & you will not be disappointed.  So, for exccellent Szechwan cuisine at reasonable prices in a clean friendly atmosphere, Spicy King cannot be beat.  Keep up the good work guys.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Authentic Sichuan food, very spicy if you are not used to Sichuan cuisine, I would recommend if you fancy something hot!", "author": "Jericho S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "AWESOME FOOD!!! GLAD WE FOUND THE PLACE!! Workers are a little rough and hard to stop (hence the lost star) but really the food is worth it!!!", "author": "Erica H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "I was there with a friend last night. The food was great for sure. But towards the end, I saw a big fat rat climbing down the tree decoration thing. I was terrified. We left soon after. We were sitting at the inner corner of the restaurant. Advice to the management. Do a rat inspection ASAP. It still gives me chills now.", "author": "Emma L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-21", "description": "I'm  not a spicy person however the milder foods were great! I loved the octopus which brought be home, Thank you! waitress were very good and kind, love this place, very clean.", "author": "George K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "By far one of my top ten restaurant's in San Francisco.  The flavor is. This place is so authentic than i swear halfway through my meal im speaking a littlw mandarin. The tan tan noodles hits the spot. Love how almost every dish has plenty of flavor and spices. I eat here at least once a month.", "author": "Kenneth S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-29", "description": "I was dissapointed.  I ordered a well known spicy Sichuan lamb dish, but I was served something else which the staff insisted was what I ordered.  I will not be going back.\n\nApparently they were out of the proper ingredients that night, because what I got had lamb, but that was about the only similarity to what I ordered. It was not spicy, it did not contain cilantro, flower pepper or chilis, and the lamb appeared to be extra thin sliced hot pot meat, instead of the usual good stuff.  It was some dish made of stir fried leeks, bell peppers and Lau Gan Ma sauce. \n\nIt was OK, I ate it, but it was not what I ordered.  It would be one thing if they came out and told me that \"we are out of some ingredients, but I would be happy to make something else with lamb for you\". Instead, when I complained, the staff insisted  was what I ordered. The menu had a picture showing what it should have been! I have ordered this in several other restaurants, and it wasn't even close.  \n\nThis is just disrespectful to their clientele. Apparently we can't tell the difference, so it doesn't matter what they fry up.  \n\nNot cool.", "author": "Ben J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-19", "description": "First things first: \nTHEY ACCEPT CREDIT/DEBIT!\nWe were trying to find a place that was not cash only and this worked out. It was a nice calm interior and the employees were friendly.\nIt would be really interesting to try a \"Master Chef\" dish at some point. One dish had a bird made out of food. \nThe food was tasty and they have some pretty fun looking options, intestines anyone?\nWe stuck with the familiar Chinese-American dishes: Curry Chicken, Sesame Chicken, Orange Beef, and Pot Stickers. \n\nThere is debate about which menu item was best - which is a great sign.\n\nPersonal Favorite: Sesame Chicken.\n\nPro Tip: The little water fountain display has live fish in it. It's shallow enough that you can touch the fish. kind of fun. something to do AFTER eating. \n\nPro Tip2: The dishes are larger than one person can eat, plan on sharing.", "author": "Ronnie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "Easily the best sichuan food in SF.  Decent service as well!", "author": "Mason W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "We were sort of \"escorted\" by a lady on the street to this place and we don't usually do this but we went ahead and had lunch there.  This is an authentic Chinese restaurant. They serve a lot of things western folks don't usually eat.  I have to say that their food is delicious. We ordered things we recognized and the entire place was full. We had to share a large table with two other groups.  We were the only non-Asians here.  That says that they have good fresh food.  We were very glad we came. The service is strained because the place is small, jammed, and a little understaffed for the lunch crowd. However, everyone was kind and very helpful.  I would go there again and I hope with an Asian friend so I can try different dishes next time.", "author": "April E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "This is the worst service I've gotten in a long time. It took 40 minutes to get food when the place was half empty. People who sat down after us got served first. I'll never go back.", "author": "Jade J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "Amazing sauces and flavor! The best Szechuan food I have found in San Francisco. The meat is pretty tough and the service is pretty bad but the food more the makes up for it in my book. Try the brown beech mushroom hot pot, Spicy Numbing beef tendons and sautéed sliced lamb w/pepper!", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "Very yummy food, once you start eating the spicy beef tendon it's hard to stop. They also validate parking, which is great in chinatown. Bring more people so you can try more plates!", "author": "Alex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-03", "description": "Had Pot Stickers & Garlic Spare Ribs no spicy and Ramen Soup. Potstickers were delicious, ribs were delicious too, the soup was ok. Would try it again.", "author": "Cindy I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-28", "description": "The place looked packed but unfortunately their service is horrible. There was no waiter who even wanted to talk to tell us to wait. It was a bad experience since we waited for almost 15 min before we left because no one wanted to talk to us.", "author": "Kiran V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Amazing!! Food was delicious, atmosphere was nice & relaxing, people were friendly. The food is the perfect mix between authentic Chinese food and say, panda country. Some very unique dishes along with  widely known ones. \n\nSlightly pricey but the portions were huge so plan for leftovers! \n\nThe name of the restaurant is completely accurate, it is spicy! So be careful if you can't handle it.    \n\nHighly recommend!", "author": "Amber C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "This place was great! The best customer service. started with a lady out on the street passing out flyers for this restaurant. she walked us to the restaurant and seated us! She was SO nice! The waitress was real nice to. Food came pretty quick. We had the house fried rice. It had nice chuncks of big shrimp, pork and beef. That was delicious. And we had the spicy beef soup! Which was AMAZING! LOVED IT! I love spicy food and soup so I was in heaven! Highly recommend this place when you visit China Town!", "author": "Julie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-22", "description": "Best tasting Sichuan restaurant I had in SF so far. Most of the Chinese restaurant in Chinatown are pretty underwhelming compare to ones in Richmond and Outer Sunset. This one is a a hidden gem in Chinatown if spicy meats are your thing. The the interior in the bar area is nicely done too.  Try the beef dish in a basket. (Pictured, Don't remember the name). It's very tender.", "author": "Charles Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "These guys rock! They made everything extra spicy for us on request. Loved the lamb, string beans, beef kimchi fried rice & spicy dumplings. Will definitely be back!", "author": "Knee High S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-13", "description": "The place used to be great but think the quality of their food came down a lot now. My friends and I used to order hotpot as well as various dishes here, but after trying three times this year, we decided to not come back :/", "author": "Mei T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-01", "description": "Okay, trying this place out because my wife wanted something spicy.  To keep it short and simple, we had the soup noodles.  Mine was a clear broth with not that much spice, but it was supposed to be spicy.  My wife's soup noodle was the numbing kind where it's spicy but it numbs your taste buds.  We also ordered the lamb skewer.  All in all, pretty tasty, but I'm only giving 3 stars instead of 4 or 5 because service could've been better.  They need to either have one more person on the restaurant floor to see if anyone needs anything.  We had to ask for tea!  But I wouldn't mind coming here again; hopefully the service will be better next time, but it's Chinatown so can't expect that much...", "author": "Philip L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "If you like spicy and don't care about terrible service, this is your place. If I didn't come here with friends that are from SF, I would have never discovered my new favorite dish - fish in chili oil. Don't be alarmed by the sheer number of chilies in all of the dishes but don't be an idiot and eat the chili. Lots of dishes for the adventurous foodies.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Five stars for for the quality of food and efficiency of service. Our server was sweet, polite, and attentive despite the chaos of being full on Christmas day. There was a line inside and outside. Well worth the wait. For a group of 3 we ordered the Szechuan Dinner. Fantastic!", "author": "Benjamin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "For serious Chinese Spicy food lovers, I just want to say this is the must-go place. Every dish is very delicious. super super good. I'm a native Chinese and I approved this message... Just one thing need to mention: Chef, you really need hire more waitress. Two waitress to serve over 10 tables is just impossible. There is no service but just endless waiting.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Wow, words cannot describe my experience with the food here. We ordered beef tripe and some other beef dish to go with that.The service was good, attentive but not annoying. 10/10 would go again.", "author": "Quan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-01", "description": "I love Szechuan food. Service is not perfect because they need more servers... but food itself is really good. It's not as spicy as other Szechuan restaurants so it'll be good for people who can't eat spicy food.", "author": "S L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-12", "description": "Waitresses here know nothing about customer service and they are boarderline rude to customers. Will be back when im back in town starving and they are the only place open.", "author": "JESSIE Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "I loved the warm welcome I got when I entered this restaurant.  It was my first time here and I will definetly be back.  My chicken was very spicy but some people say i am a lightweight when it comes to spice.  I like spicy food but i have my limit.  This hit the mark just right.  The waitress was pleasant and helpful.  Parking was difficult but i cant ding the restaurant for that.", "author": "Juan N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-24", "description": "I was super super super sad to be treated like piece of shit just because am a Chinese and also the waitress is Chinese too. I've been using Yelp for 2 years and this is the first time I sign up because every almost 5-star place I went to was pretty good and this one disappointed me. Am actually born in Sichuan and grow up in there, my family come to visit me. And after few days they got tired of \"American food\" so I brought them to this place cuz it had almost 5-starts. But when my family was trying to order , somehow the waitress act like she dose not speak Chinese. So I spoke English to her , then somehow she stared to spoke Chinese to me.. I got little bit upset but I was very friendly until she said:\"can u guys hurry up cuz I gotta go to eat my lunch.\"  \nWe ordered lots food and the table was full, so when she came back with more food, she was just holding the plate until I moved the plate on the table , basically doing her job for her. \nShe never came to ask if the food was ok or anything. When I ask her to pack the left over, she gives me a \"you such a cheap ass\" look that made me kinda angry. \nSo far we been treated like nothing so we only paid her $5 for the tips. But she stopped us and said \" sorry u didn't paid the tips.\" I said I didn't like ur service so I didn't  like to paid the tips. And she laugh out loud and said \" this is America \" ( she looked at my uncle who spoke Chinese to her the first ) \" you gotta paid 20% tips , it's the rule.\" I was mad and about to started a fight or something, my eye was tearing and My face was blushed. But my uncle stopped me and paid the tips to her.\nI came to America because I thought here's a free country but I didn't even have right to decide how much I want to pay the tips. This is ridiculous.", "author": "Xiaopu Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-22", "description": "just want to say-they put the used rice back to the kitchen and then serve it to the next customer. Ok, the spicy chicken took one hojr to cook, cant reture and say we must to pay. I am ok to pay if they have better service. I am done eatting there, no more. And i never recomment the other people to there any more.", "author": "Xiaojun H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-25", "description": "Ordered beef rib and orange chicken. The line is pretty long (30min wait time), but worth the food quality. I liked orange chicken better than the rib. Interior design is beautiful.", "author": "Mj T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-22", "description": "We were waiting quite a while before seated. The service was rude. People who walked in signed in ad we did and they were seated before us. I think this might be friends or family business. The food was very salty. Might I add very poor service. The waitress  took my girlfriend's little boys plate while he was still eating.", "author": "Steve T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Awesome restaurant and delicious food!!  Please take down the paper placemat taped to the wall that says \"no liquor\". TACKY TACKY.", "author": "Gary S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Was introduced to this place by a colleague (who spent his entire life in Chinatown and rated this as one of his favorites).\n\nJust back from there and had duck chin, pig feet and a couple of other dishes, loved them. (Obviously not a place for anyone expecting standard, Americanized Chinese food).\n\n(The people given this place a 1-star ordered dishes like Mongolian Beef or Peking Duck or Chow Mein... why bother to order these in a Sichuanese restaurant?... also, \nwhy does the restaurant offer it in the first place?)\n\nBeen here about half a dozen times, tried most of the dishes and loved everything.\n\nI found the service excellent, probably because I've been there late in the evening when it was not too crowded.\n\nDecor better than the average Chinese restaurant.\n\nA bit pricey but not way overboard.\n\nGiven that almost all the Chinese restaurants in Chinatown are Cantonese this is a welcome change.\n\nTwo negatives about the restaurant:\n\n1) Its name; it used to be known as Uncle's Cafe and now has some incomprehensible sign in front (in Chinese). The Spicy King logo in English is to the side (and typically missed)\n\n2) Service. Sucks in terms of getting seated (complete chaos).\n\n3) A ridiculous-looking motorbike occupies a good portion of the restaurant... WHY????\n\nDespite the negatives, I still give it a 5-star (after about probably 20 visits)", "author": "T S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "best szechuan place in town! the ma po is the absolute BEST. and when you order something spicy, they actually make it spicy! what a concept. i am ALL about burning a hole in my stomach.  of course they do mild too. ;)  it's cozy, reasonably priced, staff's super nice, and the food is always delicious. they often have lines, but that's because it's popular and ridiculously GOOD.", "author": "Kit U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "Really Szechwan cuisine! Very hot but very delicious! I must try many more times!", "author": "Nan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-21", "description": "This is the same restaurant as spicy king.  Restaurant is extremely dirty. Floor seems like it hasn't been vacuumed in months. Staff doesn't speak english. They are friendly but its hard to ask them questions about the entrees. My friend went to the bathroom after the chef came out. He left it uncleaned. I doubt he even washed his hands. If my friend had told me about this before the food came. I would have just left but he told me after we came out of the restaurant. Btw this is the same restaurant as schezuan uncle restaurant. Waiters also seemed biased as if you were asian you would get hot water or tea kettle. But if you are any other you get a lemon water. I would have preferred if they asked me what i wanted. Anyway for the food i would give it one star. For being an authentic Chinese restaurant they definitely need to add more flavor to their food. I have had Chinese and it tastes much better then what these guys offer.", "author": "Jake L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "It was so good!!! Try the Lemon chicken. Crunchy and delicious. \n\nGreat atmosphere. Clean and waiters are well aware of how you are doing. Will bring the whole family back.", "author": "cindy t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "Stumbled upon this place, and decided to give it a try.  The wait was extremely long, about an hour and a half... there isn't really a place to wait. Food was good.  I didn't like the texture of the beef they use, but the food was pretty good.  My favorite was the Beef & Broccoli.  Great Flavor!", "author": "Jack M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "Saw this place while walking around Chinatown. Decided to try it out since I am a fan of Sichuan. I tried the FuQiFeiPian (Beef/stomach slices in spicy oil) as appetizer, a ShuiZhuYu (Fish in hot oil), Noodles in with peas and chilli oil paste, Kidney with pickled chilli and tan tan noodle. I looked around and saw another table having an authentic style whole fish in boiling chilli oil sauce. My main regret is not being able to sample all the dishes in one sitting.\nMy orders tasted fabulous, the fish had the right amount of peppercorn and dried chilli in hot oil, there's no such thing as too much in authentic Sichuan dishes.. The only missing item is fresh sichuan peppercorn but it's banned in California so I can't ding them for this. The timing of servings is bad. They served two items and promptly forgot about the rest for 30 minutes. Come on, this is a casual Chinese restaurant, the proper way to serve is to have every dishes on the table 15 minutes or less after the order. One star off for that. Otherwise, finally, I don't have to deal with anymore Canton-ized Sichuan food in Chinatown! Props for waitresses who are fluent in English, Mandarin and Cantonese! We tried to confuse her by speaking all three together and she handled all without any pauses!", "author": "Vocal T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "Ok Chinese food. I ordered spicy fish filet, the flavor was good but man there was too much salt. After meal I have to drink about 2L of water. The BBQ Lamb skewer was perfect. I also ordered garlic pea sprouts it was salty. Also the waitresses had us sit with strangers then suddenly right before we started eating moved us to sit with another stranger without explanation.", "author": "Lucky L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-05", "description": "Food was good. The service was great! We tried to go to a few other places in China Town that said they were open until 10:00pm, it was 9:30 and they were all closed. We happened upon this place and they were happy to have us!", "author": "Bailey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Service is poor but get the job done had to ask for water 4 times. Food very spicy duh. Very good!", "author": "Larry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "If you love spicy food, this is the best place in Chinatown for savory, actually-spicy sichuan cuisine. I've come here five or six times with friends and family, and every time, we always get the silky tofu with poke fish and spicy sliced lamb. The décor is nice as well, if that is something you care about. The place is clean and well-decorated, and the tea pots are fun and unique. Definitely a place to eat if you have the time and stomach!", "author": "Melissa F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "This place offers really authentic Sichuan cuisine! The services is great and prompt. We had a group of 18 (Chinese)people there for lunch, and we all loved it. It's in the heart of Chinatown.", "author": "Mary L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-31", "description": "I Love their spicy numbing beef tendon and chicken with explosive chili. SPICY KING is one of my favorite sczchuan restaurant", "author": "Layla T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-14", "description": "The worst service ever! We ordered grill fish in the restaurant. We wait for more than an hour for that dish very patiently. There was another group of people came at the same time with us, their dish came very soon and they ordered the same dish! By the time they finish their lunch, our food is still not ready yet! The waitress keep saying it will come soon for an hour! Then we see another group of people came later than us, they got their grilled fish too! It is ridiculous ! They don't seems care about their service at all!! I don't recommend this place at all!", "author": "Yun C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "loved it! Just ran into this restaurant while visiting Chinatown with my parents. Ordered the xiao guo mi xian and it tastes so good! too spicy too =(. i saw a lot authentic sichuan cuisine on the dinner menu too like pao cai, ya xia ba which won't be seen in most of the Sichuan restaurant in the US", "author": "Vivian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "I am a huge fan.  The Szechuan dishes are spicy just as advertised and always taste fresh.   The Ma Po is to die for, although Hot Pot never fails to disappoint either.  The only thing to avoid are the \"Chinese restaurant\" staples like Kung Pao and Hot-Sour Soup -- not bad, but definitely not the reason to come here.  There's usually a crowd, and the servers don't all speak great English but are (usually) friendly.", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "First time to come to a Szechuan restaurant. The taste satisfied me. The appearance of the cookings is attractive.", "author": "Young D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "Fantastic spicy Chinese food.  We had the Mongolian beef and the Salt and Pepper prawns.  The prawns are easily the best we have ever had.  Worth the trip!  The Mongolian beef was spicy and amazing!\n\nQuiet small restaurant with good ambiance.  Service was fast.  They take credit card...\n\nNext time we are in downtown we will eat here again!", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Great presentation, excellent Mongolian Beef, and for my not-spicy palate, the chestnut chicken was the best I've ever had and made the best leftovers!  Will definitely be going back.", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-17", "description": "It was good and the line is long. I like it just because it has a shorter wait time than z & y. In all honesty, they all taste the same. Probably because I have Sichuan food too often.", "author": "Michael Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "Its definitely the best and most typical szchuan food I have ever had at SF. Food is not extremely spicy but just spicy enough to enjoy all the flavors. Highly recommend for who ever looking for real Chinese spicy food!!!", "author": "Natalie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "This place is my favorite restaurant for Sichuan food in the Bay Area. The ingredients are always fresh and the preparation really authentic.", "author": "Liana Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-20", "description": "Nothing good to say. Food was greasy and gross. The service was bad and even the water tasted dirty.", "author": "Julie F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "Soooo terrible customer services! We came around 2:30, when we asked for check our bill, the girl gave our bill back! And we pay in cash! We waited for 15mins, but nobody came to got the change! And one employee just sat next to us had her lunch!", "author": "Kit G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-22", "description": "Good food ... Good atmosphere. Efficient service with a little lack of attention. I had to go in to kitchen to ask for the third time for tea. Got it finally at the end of meal as I was paying the check. But the menu assortment looks like one could come back regularly to enjoy.", "author": "Liam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "The service was outstanding. Virtually no wait time while inside restaurant. Food was great!", "author": "Yusuf S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-29", "description": "They sat me and my friend in the back near the kitchen. And i saw them dump leftover steamed rice from other peoples dishes back into the ricepot and serve it again to other people. I feel so grossed out", "author": "Debbie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "This place was recommended to me by a Chinese co-worker. According to her, the best Szechuan cuisine outside of that Chinese region. I tried it and cannot say enough good things about the food and service. I always make it a point to eat here at least once while in San Francisco. I always get the Shredded Pork and Spicy Garlic.", "author": "Markus B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-30", "description": "For the first time, I came here with my family. I didn't expect much. The food was decent. What surprise me was something else. When I got my check, there was service charge (15 percent) was added to my check. I asked why. The server didn't give me clear answer. The owner refused to give me an answer.Usually, I pay tips well. But, this was something else, I never experience like this, especially in Chinese restaurant. I am not sure this things happened to all customer or not. This was weird.", "author": "In Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "I chanced upon this restaurant during the Fourth of July weekend when a lot of the dim sum places I wanted to visit were all closed. \n\nEverything was superb. The lamb left me speechless.\n\nI ordered more food to go. I can't wait to go back. :D", "author": "MJ C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-21", "description": "We usually go a few doors away for delicious salt pepper wings but decided to give this place a try. Ordered Cumin Lamb, 3-Cup Chicken, and stir fried Chinese Broccoli with ginger & garlic. The Cumin Lamb has potential but was too salty. The meat was sliced a little too thin that thus doesnt have as much flavor. Same for the chicken as it was also very salty. It was cubes of boneless chicken thighs served on a miniature wok. If the chef would cut back the salt, I would have given it 4 stars. To achieve 5 stars, they would have to attain a whole new level of seasoning their food. Won't be back as it's not worth the risk of another overly salted food.", "author": "KL H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-15", "description": "Was in Chinatown with the family and this looked like a nice place to check out. We started off with jasmine tea which was nice, despite being a little bland. \nWe shared a large hot and sour soup (more than enough for 5 people). The soup was pipping hot, spicy (this is Szechuan cuisine), balanced, and had a nice touch of cilantro added - defiantly the highlight of the meal.\nFor the remaining meal we ordered Szechuan beef, green beans, Chinese broccoli, and pork belly. The beef was the weakest part of the meal - although the spiciness level was pretty good, the amount of cornstarch added to the sauce contributed an unappetizing amount of gloupiness. The beans were nice and lightly sauced - nothing special though. The broccoli had a touch of garlic and was surprisingly subtle. The pork belly was the last to arrive - it was 13.99 on the menu and from price alone I would have not guessed it would be an entire pork belly. To be honest, the pork was quite dried out - if you want to be make decent pork belly you need to cook it for a very short time or preferably, for a very long time, which they clearly did not do. The flavor was good though - I manages to reinvigorate the pork by smothering it in the five-spicy sauce. \nThe prices were all pretty fair, and the service was fast, though nothing stood out as particularly good. The food tasted a bit msg heavy - I'd say if you're looking for authentic Chinese in Chinatown go elsewhere, but I did find the meal enjoyable and not too heavy.", "author": "Jeffrey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-24", "description": "Awful. . . \n\nJudge a place by the amount of people inside and this certainly did not work this time.  Waited for about 30 minutes and spent some time looking at the menu and we decided on the Peking Duck and then afterwards some rice and dishes.  But when we got seated no Peking Duck.  So we ordered some absurdly tasteless (unless HOT is a taste!) beef which was mainly made up of whole chillies, then some Mongolian beef which tasted exactly the same as the other beef, I assume they use the same broth as a taster, and then biggest mistake of all was the sesame chicken which was like candied chicken, I mean inedible candy. . .     the spring onion pancake was the only thing that we ate. .  we don't know about the Chinese broccoli because it never made it to the kitchen, and when I cancelled it the waitress said it was just coming, when I said it was too late, she argued with me that it was ready. . .    then I ordered a beer, quaint, bottles only, no glass. . .  the waiter asked if I wanted another and actually picked up my first bottle and gave it to me to finish. . .   this place is a joke and most of the food was left. . . \n\nIn 35 years of eating out I have never ever not left a tip, this was the exception to the rule, they are so bloody rude here and serve the same old tastless hot muck.\n\nWhat a waste of one of two nights in SF --\n\nNever again.\n\nThere must be better places out there.\n\nAVOID AVOID AVOID", "author": "Nick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-25", "description": "Service was horrible. I ordered one dish, but received another. I asked them to change it to what I had ordered, but they refused. Did not come back to give us water and gave us the rice after our food was nearly finished.", "author": "Emilie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "Have been here twice. The first time I was really excited about the food and the authentic Sichuan flavors ... the second time not so impressed. The 2nd time we had a common cold spicy cucumber dish that was not at all prepared how it is supposed to be .. we also ordered La Zi Ji, which had *No bones* and hardly any red peppers ... not at all authentic ..., we may go back to give them another chance.", "author": "James R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "Authentic Szechuan restaurant. Please don't come here and order sweet snd sour pork or fried rice. My favorite dishes here are the single cooked noodle soup, the chicken with explosive peppers, and beef poached with spicy oil and pig intestines (only if you like it). I like my food flaming spicy!!! It is so addictive.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-19", "description": "The food was soso.  For the price and quality, Spicy King cannot be compared to Z & Y; the quality at Z & Y is superior and very attentive staff.  At Spicy King, we were charged $1 for a container to take the leftovers.  Waitress and owner ignored our comments.", "author": "Lcee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-17", "description": "Worst service I have ever experienced. Food was decent but not worth ever coming again.", "author": "Stephaphanie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "so far the best spicy chinese food i have in the bay area. nice interior... feel very comfortable", "author": "Frankie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "Amazing.  Decided to try some Szechuan for a change.  It turned out this restaurant has recently changed ownership and at first impressions is absolutely great.  We weren't sure which hot and spicy dishes were the best, so we played it safe and ordered Lemon Chicken and Salt 'n' Pepper Prawns.  I've never had better lemon chicken and the presentation of the prawns (no annoying tail to bite off, either!) in a wooden structure was interesting.  First time I've tried those and they're a lot better than they sound.  Would highly recommend anything here, but if you're like me you won't order the tripe, etc.  Back to the Szechuan specialties.  The gentleman next to me had spicy chicken.  It was in a basket full of chilies and looked really mouth watering. Another table had something in a pot over an open flame.  Next time I'm going to definitely try to be more daring.  Also, they gave us a free order of egg rolls as the prawns came out a matter of five or ten minutes after the chicken.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "Not going to lie I was totally skeptical about eating in china town, China town doesn't look like the cleanest place after all. We went there for the tourist experience but thought why not it's china town we got to have Chinese food. There was a line so I figured it must be good cause there are so many Chinese places to eat so they have competition and they have people waiting so these people must know it's good. Spicy king lives up to its and it lives up to its name its hot but so tasty. Not a fan of their sesame chicken, though a friend at our table loved it. I had the spicy chicken soup I believe, it was so good had normal Spaghetti noodles which made it very good and different but he taste was unbelievable. The only reason 3 stars was it was the worst service we have ever had the language barrier was pretty difficult. She looked annoyed by everything we asks for and had to repeat everything we said like 3 times", "author": "Bo B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-07", "description": "Food was four star, very authentic. Service was poor; two star.  DriedChicken Sautéed w/ Mushroom was mostly bones. Plenty of wonderful flavors.  Would definitely return.", "author": "David V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "I'm no expert on Chinese cuisine, but having lived between China and the bay area for a decade,  I'd say it's about the most \"authentic\" Chinese food you're going to find in Chinatown. Most other joints cater to tourist tastes: General Tso's chicken, fortune cookies, etc.. To the gentleman from Maine (whitest/least diverse state, not known for its Chinese cuisine) who ordered veggie egg rolls and said \"...if you're looking for authentic Chinese in Chinatown go elsewhere...\",  I say good luck with that.", "author": "brian r."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-02", "description": "Absolutely phenomenal food!!! The best Chinese food I have ever had!!!! The service was great and so is the ambiance.  We absolutely loved everything we ordered.", "author": "M N."}
