{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Fantastic little cafe with a wide variety of coffees and eats. I came here in the afternoon with some friends while visiting SF and needed a quick caffeine fix-up and ordered a Cafe au Lait with soymilk as per advice from my coffee-loving Italian friend. Before ordering, I was allowed to same each different brew and decide which one I wanted in my drink. I had never tasted a soymilk based drink so smooth or clean-tasting in my life. Normally soy makes a pretty obvious substitution for milk, but this time I really enjoyed the slightly nutty flavor that it gave off. The pastries also looked excellent; my friends ordered an almond croissant and a lemon muffin which I nibbled off of. Both were decent. \n\nOverall a great first coffee experience in SF; would easily come back to try different blends of coffee.", "author": "Jerry T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "I stopped by on a whim on a Friday afternoon and it was such a great experience! The staff was friendly and hilarious! They talk to you like old friends and have great senses of humor all around. I ordered a 16 ounce White Chocolate Mocha and it was delicious! Dare I say better than Starbucks  and it was only $4. There were a lot of dogs outside and there were pictures of them everywhere which makes the cafe feel really homey and comfortable", "author": "Libby M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "It's been eleven long years since my first review of Spike's, and I was a gushing li'l Yelper at the time dramatically comparing the service one receives there to the feeling of being kowtowed at a high-end Japanese department store. Itadakimasu! Overstate much, Ed U.? Well, Jamie W. and I were back at Spike's after a long absence just because I was looking to have some hot liquid in my body after a brisk walk over the Swish Alps. It's still the same tiny place on 19th Street, but we take up less room so it didn't seem as claustrophobic on this visit. The service was pleasant enough but didn't seem that outstanding. Maybe I've gotten more crotchety over the years. I can cop to that. Get off my lawn!\n\nHowever, I did like the montage of dog photos which we stared at from the round table next to the front window (photo: http://bit.ly/2EwLqwY). This time, we took advantage of their robust tea selection (photo: http://bit.ly/2F9zMW6) and decided on a steeping $2.50 cup of Rooibos (photo: http://bit.ly/2C2YfNT). Jamie, never a fan of hot liquids, went with the $3 Ginger Peach Iced Tea. They offer all sorts of gummy candies, but we were good and stuck with our teas. We decided to replace our collective sweet tooth with subtle eavesdropping skills as we listened to an awkward blind date at the next table where the more interested guy kept laughing like a hyena at anything the other one said. Ah, I remember those days...\n\nTEA - 4 stars...nice loose-leaf quality\nAMBIANCE - 3.5 stars...tiny space, crowds quickly\nSERVICE - 4 stars...good but remember that I am a curmudgeon\nTOTAL - 4 stars...good to be back, Spike", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "I love Spike's. \n\nA bit old-fashioned, yet definitely worth a trip. They've got a collection of beans displayed in front to choose from. Really enjoyed my \"small\" cup of skinny latte though it was as huge as a basin...very smooth taste.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Great coffee, eclectic flavor selection, high prices, delicious raspberry crumb bars, and decent service. As simple as that.", "author": "Taya A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Love this little coffee shop. Friendly staff, cozy feel, lovely varieties of teas, coffees, and pastries. I'm so impressed every time I go in this place. My tip is: if you like Earl Grey, this is the best I've found in the city.", "author": "Jason P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Really great coffee. Nice vibes. Right next to me work, and not super busy when I go in.", "author": "Gabrielle R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "This place was amazing! We were visiting from out of state and needed a coffee fix. Popped in here because the one down the street called Duboce had an extremely rude staff. Anyway, Spike's was perfect. Great staff and AMAZING coffee!", "author": "Kyla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Delicious hidden coffee shop in the Castro. Grab a cup and pick your brew. Simple as that! The two baristas who were working today were very kind and patient with us and our kiddos! Thank you! The gluten free sweet potato bread was delicious! Try it! Kids also loved the banana bread! They have a few spots to sit inside and a few tables outside. Stay a while or take it to go. (They also have espresso, but the black coffee was pretty delicious)! I think they rotate the blends, so ask for recommendations. They were helpful and gave honest feedback which I always appreciate! And they let me try a few before I settled on one! Can't beat that!", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Up the street from Philz but worth the extra block walk. They really do have THE BEST LATTE just like they said! \n\nPlace is tiny--this is the reason I'm only giving 4 stars. Right when you walk in, there are a few small tables and chairs to the left and to the right is a huge selection of coffee beans for purchase by the pound. There is a decent sized outside patio with tables and seating but on a beautiful sunny day like today, everything was taken up. \n\nAll the way at the back of the shop is where you order. There is one cashier and one barista. Once you place your order, there's hardly any space to even stand to wait for your order without blocking the cream counter and trash cans. However, they work quickly to get you your drink so it's not too bad. You can have any hot drink iced for extra $0.50. \n\nThis has got to be the best decaf iced latte I've had in the city of San Francisco. A lot of places can't get decaf right. Spike's decaf latte was very rich and robust--perfect with whole milk on ice. I'll definitely come by again for another iced latte when I'm in the neighborhood!", "author": "Betty R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Good coffee. Self serve. A real nice place to stop at and take in the moment. The barista was nice and I will definitely stop here when I'm in town again. Great selection.", "author": "Becky G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "visited Spike's coffee on a Friday morning while on vacation in SF, automatically greeted by very kind, laughing faces. The two baristas answered my questions happily and my cup of Fancy House Blend and toasted vegan Pumpkin Bread were AMAZING. One of the baristas even asked if it was okay if my vegan bread went in the same toaster as the other pastries. veg considerate. Can't wait to visit next time i'm in the area. \n\nPS extra love to their whole section of cute dog photos and green encouragement.", "author": "Ryleigh H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Dogs and coffee with a side of sass.\n\nThis is my neighborhood coffee spot. I buy my home coffee here, and come if for a cup on the go weekly. Coffee is good, espresso drinks are yummy, and their pastry selection is pretty lit (they have fresh donuts on Fridays).\n\nSometimes my girlfriend and I come here, get a couple-a-coffees and grab a seat on the front patio while we read the Castro Courier (our neighborhood newspaper).\n\nCome here instead of Philz to support a local business AND to get a legit latte in your belly.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "Wonderful service and employees and delicious drinks! The hippies ice tea is awesome and all of our drinks came super quickly. Great selection of pastries and food.", "author": "Madi L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-24", "description": "Either they forgot to use Soy Milk instead of Cows Milk or the Soy Milk they used had gone bad.", "author": "Kavi S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-02", "description": "English breakfast tea had no taste of tea at all. Coffee beans all appeared roasted to burned. Staff was friendly but kind of clueless. Places that pay for Yelp ads are suspicious and this is a good example of just why. Keep walking....", "author": "Jow H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "This is one of the Castro's best hidden gems, reminiscent of when coffee shops were real community spaces. It is tiny and cozy and there is outdoor seating. No WiFi, as this isn't really a work space.", "author": "SF R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "These guys make my day sooooooo much better, even when it's already a good day! They're super friendly and make very good coffee drinks. Their non-dairy options are also impressively tasty. I love my community and these guys are a major major part of it. We wouldn't be the same without them.", "author": "Cloud G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Loved the feel of this place. I usually do not like Mochas but theirs was delicious. The white mocha was way too sweet, recommend asking for less pumps.", "author": "Kacey K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "There's so much going on at Spike's. Whether you are people-watching from the outdoor patio seating or checking out the shelves of Spike's merchandise indoors, make sure you have a cup of fresh coffee in-hand. You can even purchase a pound or two of coffee beans to take home. (Trust me, this is a good idea.) \n\nThere is not much seating, so coming here with large groups or to get work done is not ideal. However, Spike's is a great place for catching up with a friend or picking up coffee with a to-go cup that has the Spike's dog on it. I never really came to this cafe before, because I was too lazy to walk a little further from my usual cafes, but I'll definitely be back for the friendly service and relaxed vibe. Plus, Spike's is in a quieter and calmer part of the Castro neighborhood, so come check it out!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "The service is really personable and friendly here.   They have a huge variety of coffee beans and teas from around the world and make a damn good latte.  5 stars for service, quality,  and selection.", "author": "Spencer M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-04", "description": "This was my first time at Spike's and I LOVE IT HERE. The staff is super friendly, coffee is delicious (Tanzania Peaberry Roast) and a toasted sweet potato bread - Wow. Very laid back, not pretentious atmosphere - and dogs allowed! I highly recommend Spike's!", "author": "Megan N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "I love going to this place. It is very chill and cozy. People who work there are nice and helpful. The tea and coffee are great. I like that they have outdoor seating even if it's only a couple of tables. The location is nice.", "author": "Yana B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "**Charming coffee shop in the Castro.**\n\nI was waiting to meet some friends for dinner and searched for a coffee shop in the Castro. It's a little off of the \"beaten path\"  of Castro Street on 19th, but thanks to a Yelp search I was able to find it. I used their facilities and you actually have to go back behind the bar to a shared restroom in this back alley area. It was cool.\n\nAMBIANCE\n==========\nIt was small, quaint, intimate, charming, authentic and rustic. Surrounded by wood and little blue cans that hold the multiple different types of coffee. \nIt's also in a super cool neighborhood, only a few blocks away from Mission Delores Park.\n\nBEVERAGE\n==========\nALMOND MILK LATTE\nVery yummy. \nDo not have coconut milk. Bummer. \nRATING: 5/5\n\nPRICE / VALUE\n=======\nIt was 4 bucks, no big deal.\n\nSERVICE\n==========\nGreat service. Very friendly. Very friendly patrons too!\n\nHIGHLY RECOMMEND.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Great neighborhood coffee shop, always friendly staff and customers... yes, friendly customers, most people seem to know each other or at least start up conversations.", "author": "Shanan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "This is THE neighborhood coffee spot.  Like Cheers where everyone knows your name.  Coffees that hit the spot, friendly atmosphere, and the neighborhood dogs stop by frequently!  There's no wifi here , just a bunch of people reading and conversating.", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-15", "description": "This is my am I ran outta coffee so I have to go get some or I wont be able to face the day place\n\nThe coffee is good, and there are typical pastries, etc.  and some small  tables if you want to stay (I dont.)\n\nMost  of the people who work there are friendly, but there are a couple not so great employees (they eye-roll when you tell them the strong caffeinated stuff you want needs to be refilled, ya know the type, but hey maybe they didnt have their coffee yet) and one weekday morning guy is a serious doosh, but....? I need my coffee, so can put up with a lot. \n\nOften there's a line with a bunch of indecisive people who should know better than to get to the front of the line and still not have ANY idea what they want, but probably they are not running late like me....If you just want coffee and have exact change you can bypass the line by helping yourself and slipping the cash up on the counter...", "author": "El B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-10", "description": "Over hyped. Reading the yelp reviews and articles online boosting this coffee shop up, I'm utterly disappointed. \nBesides my bland cappuccino, mocha and donut, they do have a interesting selection of beans and outside patio.\nI like my coffee hot and bold. I also like my donuts to taste like something other than a stale Pillsbury biscuit with chocolate.", "author": "Kaitlyn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "We always stop by before our hike up to Twin Peaks. Comfortable, casual atmosphere great on a Sunday morning.", "author": "Susan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "I have a deep love for this place, with its sweet store throwback decor and the even sweeter coffee wizards. After just one visit I already want to buy the tee shirt and come all the way across town to make it my regular coffee spot. With a great selection of coffees and treats, there is something to please anyone. The chilled atmosphere is just what I've been looking for, honestly I cannot say a bad word, I just hope it never changes!", "author": "Andrea F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "Dirty Chai ($5) - 3.5 STARS:\nSpicy and sweet chai mix with espresso and choice of milk. Interesting and refreshing but definitely not worth $5. While it was decently good, I regret not sticking to my large iced mint mojito!\n\nThey have a variety of pastries and standard coffee-espresso drinks and several small tables for laptop campers.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "As I've mentioned time and again, I am not much of a coffee drinker. I'll have some to be social (at times) or after a satisfying meal or if I'm about to pass out. But I don't crave the bean. I can take it or leave it. So, in order to have an opinion on a coffee shop, (for me) there needs to be more going on than just a so-and-so drip. Luckily (for me), Spike's has plenty of good stuff to go around.\n\nFirst and foremost, the energy here is really positive. I don't know if tptb burn sage, pet puppies, kiss babies, or ban all mentions of the Bieb, but from the second you walk in, you feel comfortable. It doesn't hurt that the employees are courteous. I might be overly sensitive to this last point. I live in a city that prides itself on bad service. I still am nicely surprised to be greeted with a smile. Combine all this with good smells and the endorphins are pumping. Time for coffee.\n\nI ordered a mocha. Again, I am not much of a coffee bean lover but I am mad for the cocoa bean. My mocha was smooth, a bit smoky and very very strong. Usually, I can toss these things back like shots but I needed to sip this. Not only was I able to taste and appreciate the beverage, I was able to quell the shakes from the direct injection of caffeine. So *this* is why people like coffee so much! Lastly, in a city which prides itself on supporting local business, it was nice to spend a little time at Spike's. I don't know much about the Castro (other than documentaries on PBS) but it seemed like this was an intensely local shop, catering to a local crowd and adored by its regulars. Maybe that's where all that good juju came from.", "author": "Johnny T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "I popped in this afternoon after walking by the shop a few times & was in desperate need of Afternoon Tea. The outside seating was quite lovely & I am immediately Drawn to shops that specialize in Teas & after seeing a few people having a pot of tea outside I decided to give this place a go.\n\nWhen I went in requesting a Pot of Tea with a tea cup, Saucer & Spoon, & Ladle the boys were a bit caught off gaurd with eyes wide open, but I finally got what I wanted. \n\nFor such a fabulous selection of Teas they ought to know how to serve it properly, especially if they've got pots of tea on the Menu. There are loads of coffee's to be had but why have coffee when you can have TEA! (well, for me)\n\nAnyway I liked it here & stayed for an hour! I shall be returning for morning tea or afternoon Tea. or perhaps even in-between tea!", "author": "Julian I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "It's a hidden little gem!  I don't know how they do it, being  a small independent cafe that gets squeezed between mega franchise and local celebrities...  The staff are always friendly and helpful.  Both the coffee and tea are high quality at a super reasonable price (when you buy them by weight).  Their House Blend Fancy with syrup is so smooth, the only one in my memory that matches this level of smoothness and gentleness is the one they serve at Bouchon Cafe in Yountville.\n\nGreat little neighborhood cafe.", "author": "Remy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Ordered the drip coffee and even though it wasn't made to order it was very good. They had an interesting selection of pastries but most were wrapped in nylon so I couldn't tell if it was good or not. I got the vegan banana apple bread and it was surprising good. Overall a pleasant experience.", "author": "Ali Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Best coffee this side of town, and the only decent almond milk cappuccino in the City", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "Darjeling iced tea is perfect on a sunny day.  Herbal teas are also amazing, hot or iced. People are friendly.  Small shop with 3 tables outside shaded. \n\n5 stars if they had a restroom.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "Love their coffee! We buy our coffee beans here, Lauren's blend, and try to stop by whenever we can. The baristas however can either be gems or snarky divas. Just yesterday afternoon the two baristas ridiculed me for ordering a medium cappuccino. I get it there is no such thing as medium/large cappuccino but I like a lot of room for hiking back up the hill to Noe otherwise I spill. Just unnecessary to be so rude especially when I'm standing right there. The day before yesterday I got the same order and the baristas were very pleasant. Coffee is always 100% on point but service is 50/50.", "author": "Siri A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Really like this place and forget to go by more often.  I like to try new places but usually leave disappointed so why bother.  Spikes has GREAT service, great coffee and many delicious  goodies should you need them.  Parking is never a problem and usually in/out quick which is perfect since I'm usually running late between jobs.", "author": "Elvis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "Still my favorite place for coffee in the Castro. They make a lovely hand-crafted mocha. Really nice scones too. The mellow \"old San Francisco neighborhood\" feel of this place is a great location to read and/or to meet friends.", "author": "John K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Love love love Spikes. Its obvious the patrons here are mostly locals who know each other, and know the staff working behind the counter. It's a lovely neighborhood coffee shop with a great vibe and a very appreciated lack of pretentiousness. Feels like the old Castro in here. (Or what I would imagine it to be)\n\nAlso, my favorite dirty chai in town! (And I've tried A LOT)", "author": "Lindsey C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "I don't even live in the Castro but Spikes is my daily ritual coffee shop. It captures the delightful charm of this neighborhood with friendly staff and organic, fair trade goods. To me, Spikes is a home away from home, topped off with that darling logo of a bulldog, what's not to love?!", "author": "Lisa H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-11", "description": "Amazing little coffee shop! No wifi, which means people sit and drink coffee and talk to each other. Imagine that! They have great coffee and pastries/bagels and the baristas are always friendly.", "author": "Brittany V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "This is the place to be for all coffee- junkies. The cappuccino is a no brainer. The Spike's has a overwhelming selection of tea as well. Also the staff behind the bar is very friendly.", "author": "Martin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "The ultimate neighborhood spot - stop by in the morning for inexpensive, delicious coffee and meet all the local dogs. Outdoor seating is also great for people watching. The staff is incredibly friendly, the homemade treats (ginger jack and apricot puck, looking at you) are a delicious and a great compliment to the coffee. If you feel like something a little more elaborate, I recommend an everything bagel toasted with chive cream cheese, tomato, salt and pepper. Never disappoints.", "author": "Briton G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "Great recommendations, got the yerba mate tea for my cold with some honey. Hit the spottt", "author": "Edmund L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-14", "description": "Coffee is good.  I wish they had better selection of pastries though.  It also didn't seem very clean when I came in.  There was a lot of dirt on the floor.  And the barista was not very nice.", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "One of those places that still feels like it resides in the old San Francisco. Baristas are personable and funny, and it still has that neighborhood feel to it that makes it feel quaint. Lovely.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "A real coffee place without pretentions, no $5 pour over, no 20 minute wait, no snotty servers. Just real people who care about service, about you. This is the place to go if you want to relax, meet a friend, have a well-made espresso or latte, and remember when coffee places had soul. Really good coffees, real people, and fits like a comfortable shoe.", "author": "Dan-o T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "Super friendly staff. Coffee is great with lots of Beans available to take home. Good nibbles too.", "author": "Stephen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-31", "description": "I rarely leave reviews, but in a city with so many austere, industrial, reclaimed-wood clad, $5 drip coffee serving coffee shops, Spikes is welcome departure from the norm. The staff is always friendly, the coffee always great (they have 3-4 rotating drips at any given time), and the prices very reasonable. Outdoor seating is always great on a nice day, and if you're a dog lover, there are always a few around at all times!", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "I have been stopping at this place once a week and it has been a great experience. It is very fast service which is exactly what I need in the mornings.\n\n\nThis place has an outdoor seating which invites a lot of neighbors with dogs which makes my morning to see all the cutie dogs. \n\nIf you are looking for a good coffee with friendly servers and fast service.. This is your place. I never get a chance to enjoy the outdoor seating yet,but hopefully soon I will. It looks very appealing.", "author": "Irem G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-16", "description": "They made me a great cortado (not on menu) for a reasonable price. Cute atmosphere and nice patio.", "author": "Khalid N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "I'm writing this on behalf of wifey since I don't drink coffee anymore.  Haha.  \n\nGreat customer service...the barista informed us of the special mint whipped cream since it was St. Paddie's Day.  There was a large assortment of beans...\n\nThe drink was made well...I kept hearing her \"yuuuummmmmm\" all the way back to the car with her white chocolate mocha.  Haha. \n\nSolid establishment.  4 stars.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "I love this place! It's so nice to be in a friendly unique cafe, the baristas are great and you can tell the owners care about the neighborhood. Some cafes you feel like your at a Mad Men typing pool everybody's typing away. Spikes is different.", "author": "Peter M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-13", "description": "Whenever I visit San Francisco there's one place I must go to and spend time at. Spike's is it.\n\nWhat can you say about this awesome place that the other Yelpers haven't already said or typed as the case might be.\n\nDoggie Friendly. Awesome baristas. Some of my fondest SF memories were there.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "I was looking around for a new study spot and this place showed up on my radar. The name and the sign drew me in so I went for it.\n\nIt's not hard to get to, but it's a bit of a walk. \n\nThe place itself is quite small but filled with cases of various coffee beans, old school candies and sweets, pastries, and friendly people! Some of the sweets are housemade, some aren't (they get some of their stuff from Mariposa Baking Co., which is cool). I chose to get a dirty chai (double shot) for myself with a red velvet cookie on the side.\n\nMy dirty chai was made really well. I was super happy with it. It went really well with my cookie too despite it being kinda hard. After that, I started working on some online readings.\n\nThis place isn't a bad place to study, but they don't provide free wi-fi so that gets in the way of some assignments. Other than that, I have no real problems. All I had was readings anyway so it wasn't a bad thing to have no wi-fi at the moment. \n\nOverall, cute place! I would love to go back.", "author": "Sofia R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "I visited the Monday afternoon after Pride weekend (and the marriage decision), and was pleasantly surprised to find just a handful of people. In between pouring my coffee and grabbing a pastry, the counter person welcomed me to San Francisco, asked me how my weekend was, and even recommended a couple of queer bars. Cool community vibe without  the pretentious baristas, and really good customer service! There's an impressive selection of fair-trade, organic coffee beans, which they happily grind, weigh, and package for you, but the iced coffee is just okay and the selection of baked goods is small. Still, I would probably return.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-22", "description": "Really no wifi... what year are we in?  I understand if they are trying to do the whole \"community, not being tethered to a electronic device thing\".  But when your cafe is empty and all the other coffee shops in the Castro are packed it makes you wonder what your customers really want.\n\nI will admit it is a cute coffee shop on a quiet street.  But they have the workings to have a line out the door and yet its consistently empty.  Why not just be wifi free after 6pm? or no wifi on the weekends like trendy coffee shops in Seattle do.  Btw the two customers that were sitting down were both on their laptops...so who are you really fooling?", "author": "Alan H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "A bulldog mascot and pumpkin pie lattes! \nWhat's not to love about Spike's? \n\nFor those of you who don't know, I'm a pumpkin aficionado. I love all things pumpkin. I also love bulldogs. I happen to be the proud owner of an awesome English bulldog named Sherlock. \n\nWell, when I walked past Spike's Coffee one cold, windy, SF morning and saw that their mascot was a bulldog, you know I had to stop in for a refreshment. \nSpike's, which is located in the Castro, is a small, awesome little coffee house. I got to Spike's around 8:30am and since it was rather chilly outside there were quite a few people in line to purchase a warm beverage. Once inside I was greeted by a big display case full of donuts, scones, muffins, breakfast bars, cookies and other delicious looking baked goodies. Then I happened to glance up and I saw a big sign above their register that informed me that they were now offering warm pumpkin pie lattes for the fall. That was pretty much all it took. I knew I would be leaving Spike's with a pumpkin pie latte and a tasty sweet treat. \n\nSpike's PP latte was amazing. It had an awesome pumpkin flavor. It was slightly on the creamy side, just like a real PP and was topped with a mountain of sweet whipped cream. I also ordered their crunchy breakfast bar, which contained crunchy oats, mixed nuts and cranberries. I thought this bar was great and it went perfectly with my PP latte. \n\nThe staff at Spike's was super friendly. I noticed that they loved to joke around and chit chat with their regulars. The prices here were the same as any other chain coffee joint. \n\nIf I lived in SF I would definitely be a regular at Spike's. I would also bring Sherlock along with me every time I visited the shop. Who knows, maybe if we came enough I could talk them into putting his picture on their cups and merchandise. That would be awesome.", "author": "Craig R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-29", "description": "Spike's is hands down the best coffee shop in the city. I work in the area and absolutely love starting my day with a cup of House (or Kookiedoodle if I'm feeling fancy) and a cream cheese bagel. Not only is the coffee just perfectly delicious (but not in a condescending way), the bakery items are awesome. Spike's doesn't have wifi, and I love that. This isn't a place to bust out your laptop and click away for hours. This is a place where you can take a moment to slow down before your busy day or read your book or catch up with a friend. \n\nBut honestly where Spike's excels most is their kick ass customer service. The staff is so warm and fun - they always put a smile on everyone's faces. They treat their regulars incredibly well and go out of their way to learn their names, joke with them, ask them about whatever they've been up to, etc. This is what every coffee shop should aspire to. Thanks, guys - you're the best!", "author": "Katelyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-11", "description": "Spike's is often the best part of my day. The gang who works there is friendly and the patrons are mostly regulars. It feels like the \"Cheers\" of coffee houses. Their drip coffee is on the strong side so approach with caution. Whenever I buy a large drip, a couple hours later my employees look at each other and say, \"he must have had a large Spike's today\". \n\nOwner is the friendliest of the bunch and does his best to remember you. Pay with cash and try not to talk on your cell while you're in there.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-18", "description": "The workers here are not very professional. As we approached the coffee shop, one of them was smoking right outside its door and snuffed out his cigarette oh the bottom of his shoe and then went in. We followed him in immediately. He did NOT wash his hands before handling any of his tasks!\n\nThen one of the self-serve coffee pump malfunctioned and sprayed coffee onto my  BF's hands. The workers said nothing at first, then upon my BF's exclamation of being sprayed by hot coffee, one of the two workers offered a patronizing and insincere \"sorry.\" I am sorry, but this is not a local business I would patronize again. I'd rather go to Starbucks as they give you real customer service!", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "Nice little spot with a chill atmosphere and good stuff! Had a simple hot chocolate but it tasted more rich and creamy than what I'm use to! Good service and relatively affordable as well!", "author": "Shaniah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "2 shots of espresso and brewed coffee is a recipe for success! best coffee in San Francisco, if you are in SF you must check Spike's Coffees & Teas  out.", "author": "Paige C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "I had a doctors appt across the street and had a few minutes so I went on a desperate search for my morning coffee fix. I stumble upon Spikes and now need to figure out how to change my route to work to come here more often. The two men behind the counter were kind and unpretentious and this cup of magic is going to get me through the day in the best of ways. Would love to come here on the weekend and sit outside a bit... Imagine the people watching is incredible! ;) Thanks guys!", "author": "Lisa-Maree W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-29", "description": "Absolutely a major part of the Castro \"village\". Has been here forever and been my coffee spot for over a decade, well before all the other coffee shops showed up. Friendly staff really makes this a favorite for regulars & first time visitors. If you haven't been, try it.", "author": "Brent L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "Oh coffee how I love thee....\n\nIn the Twins and needing a new place for caf I stopped here to check check check it out.\n\nI liked the vibe with the signs, jars, and general style that was more like a classic sweet shop (at least to me). The place was small so you dodn't have the usual number of study and read crowd (which is fine by me). \n\nOne dirty chai and a couple of cookies later and I was on my way to a caffeine and sugar rush high. Both were good and hit the spot just right. That and the solid service garnered a nice 4 stars.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "Cute little cafe! Ordered an iced white mocha and bought two red velvet cookies. They weren't amazeballs but still pretty good. Would come back if I was in the neighborhood again.", "author": "Lauren L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "5+ dog friendly\n5+ for the dirty chai\n\nWe found Spike's thanks to a rave review from a local resident. She was walking her pup & we asked where is a good place to enjoy coffee with our pups.\n\nThere are four tables and plenty of seats outside. Anyplace with a dog on the sign, cups and menu board is A-OK in my book. They could serve watery mud and I'd be thrilled to have a place to sit w/ my dog.\n\nI tried their special \"dirty chai\" which is a chai + shot of espresso. It was a terrific afternoon boost.", "author": "Kim W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "I had a tea and an everything bagel with cream cheese.  My friend had a mint mocha and a blueberry bagel.  Everything was delicious.  This cafe is very small and you could tell the regulars were posted up at their tables.  The staff was friendly, and they had a large selection of pastries and drinks.  There are so many cute cafes to try in the city, and this one is a quality place.", "author": "Shelby B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "Beverages:  Good hot tea with a variety of selections.\n\nStaff:  Friendly and efficient.\n\nEnvironment:  Small, but cute and very green.", "author": "Jerico P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "I cannot believe I have not written a review for my home away from home; just two blocks away from my residence here in the City of SF.  I truly believe I made hippie-blend famous.  I'm serious, I was buying this wondrous shit by the kilo.  The person who once worked there developed it, and the past fours years I have become not on ly obsessed but part of making it a cult-following among friends.  i have seen it from it's inception to its premium status today.  See \"wind t\".  that is my bestie.  \n\neven though I have become coffee (almost three months ago) I could never and will never stop going to spikes (even though i miss me a soy latte every now and then).  my routine now is pu-erh (must have tea!!) and daddy's bread (a moist vegan bread made with seasonal fruits and veggies.  the nectarine is divine.  the sweet potato oh so moist).  continuing on, if ever you need the best latte in the city, made with great care and consistency, you will love yourself some Spikes (especially if its Bonnie taking care of you).  Hands-down the best coffee-house in the City of SF.  The staff is amazeballs, you can create your own \"tab\" on an index card, so never will you worry about h ave the few bills to get your daily fix.  \n\nThe only qualms I have is that they need to put a community compost bucket, switch to straws able to be ecologically broken down, and get rid of some of the Lindsay's teas (most are artificially flavored).   Even then, they still get five stars.", "author": "Boho H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "yummy latte and delicious apple turnover!  Staff wasn't over friendly...which is nice.  I like my people to be real~", "author": "Janet L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "Nice coffee place! The staff was super nice the cappuccino really good and the cinnamon roll heavy but delicious!", "author": "Julien S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-22", "description": "Staff is always friendly and helpful, I love getting a Americano and a pastry with my dog and setting out front and the coffee is always hot and fresh", "author": "Kevin l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Love this place! Friendly, cozy, affordable. Their iced teas are especially delicious and refreshing. Love coming here.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "Absolutely amazing neighborhood coffee house. The baristas are friendly and knowledgable. They make my latté perfectly each time I go. It's is kind of a bummer when you find out that all the wifi networks are not theirs and there's no way of you accessing the net. Oh well, enjoy the amazing coffee.", "author": "Jane E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "It's a bit off the radar, but if you're in the neighborhood it's worth a visit. They make great coffee, there's a small outdoor space (dog friendly!), and the baristas are friendly. \n\nI recommend a trip here on a cold, rainy day. It's got a homey feel, and you can watch people outside go about their wet, windy business from the comfort of your window seat. \n\nAnd, crucially, you can get a latte as big as your face. I enjoy a trendy hand-crafted artisan 8-ounce cappuccino as much as the next person, but there's something really fulfilling about a hot drink you need both hands to lift. Next time you need a break from city life come here; drink to your heart's content.", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "I heart the staff and they heart me right back! \n\nGreat local coffee spot. I just wish they could switch sides of the street with the daddy babershop- Spikes has a great outdoor set-up that doesn't catch the sun. Good people watching, great yogurt selection, and duh....AWESOME COFFEE :)", "author": "S B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "I came here on a whim. Parked my car nearby. \n\nThe staff is so nice. They are super friendly. \n\nAND... the coffee... soy latte... AMAZING! \nI need to come back to this local spot. Its such a nice place. The place isn't that big but I like the home feeling it gives. And I esp like sitting outside doing some people watching. :)", "author": "Nathalie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "Crawled into this spot yesterday to escape the rain and was pleasantly surprised by tea selection offered at Spike's.\n\nI decided to go with the Gen Mai Cha and was glad to see that they used the loose leaf variety and hand rolled each individual tea bag. \n\nAlthough there's nothing fancy offered here, I would definitely swing by if you decide to go out on a stroll with your pooch and need a place to hydrate. For $2.50 a cup, you couldn't really ask for more!", "author": "Kevin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Loved this place! They have a huge selection of different coffees from around the world to suit your tastes. Not to mention a cute vibe and small patio to gaze out at the folks strolling Castro.", "author": "Josh T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-14", "description": "Spike's is hands down my favorite coffee shop in the city. The customer service is great, the staff is always warm and fun, and they never give you a condescending attitude like at other coffee shops. The coffees and pastries are yummy, and I love the old candy shop atmosphere. You can hang out and chat with friends or read the paper, and no one ever rushes you. There's also a small outdoor seating area if you don't mind that it's in the shade and almost always chilly. They're environmentally responsible (recycling and compost bins are available) and they encourage you to use a mug if you're staying. But honestly, what I love most about Spike's is that I'm straight woman and they treat me with just as much affection as they do all of the gay male regulars. Spike's will always have my business!", "author": "Marie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Delicious cappuccinos. Neighborhood place with friendly staff and customers.  Tasty coffee beans to go. Try Lauren's blend.", "author": "Meredith G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "We are new to the hood so we are finding our way to a perfect cup of joe and talented barista. I always test the waters with a drip coffee. If it's rich and dark (which this totally was) ill proceed to the fancy stuff.  I'll update when I do. \nPros diverse clientele and goooood coffee.", "author": "J H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "I love the atmosphere inside Spike's. It's intimate, small, and cozy. In addition to the traditional coffee, tea and espresso drinks, they have special seasonal drinks. They also sell coffee by the pound and an assortment of candy. Good place to spend a rainy afternoon, huddled around a table with your bestie and sipping on Spike's brews.", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Excellent cappuccino with soy milk and white chocolate mocca, plus charming service and a lovely location. Yep.", "author": "Heloise E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "Nice neighborhood atmosphere and wide selection of tea and coffee. Like its name suggests sometimes service can be a little bit spiky but, you could consider that part of the charm. They prefer cash even though they have a little logo for square in their window and it'd be nice if they had longer hours.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-26", "description": "Just walking down the street and noticed the energy in front of Spike's Coffee and Tea. Took a chance and had coffee and a blueberry muffin. Many choices of coffee to choose from...Nice and smooth! The service was great and friendly! Customers (regulars) were inviting as well! Highly recommend!", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Cookies and coffee....good afternoon snack.  Cookies are very sweet.  We had the lemon butter and chocolate dipped peanut butter cookies.  Both good, just sweet.  Also had a vanilla latte and iced mocha.  Coffee was excellent.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-25", "description": "Cozy cute San Fran Coffee Shop. Nice staff and very good coffee. Yummy pastries. The cheesecake pumpkin muffin was sooo good. New York crumbled cake mmmh. There're only a few chairs and 2 small tables inside. But also outside seating!", "author": "Katja J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-02", "description": "I go here every day pretty much.  Their iced coffee is great and so's the hot stuff.  If you go after 3pm then the pastries that are left are $1.  The people who work there are friendly and will try to remember your name if you come in all the time.  I think it's a great place to get coffee and hang out for a little while.", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "I love strollin' through the Castro, even if it means just grabbing a cup of coffee because it reminds me of West Hollywood, except without all the flashy-ness. Very impressed with my Spiced Chai Latte w/ Soy from Spike's. The dudes who work here are super nice & friendly too!", "author": "Belle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-29", "description": "Spike's is the neighborhood café with what seems like a loyal customer base and good quality offerings.  It was only a block from my apartment rental, so it was my daily coffee spot, and I grabbed a ham and cheese croissant a couple days also.  they had a good selection of bakery stuff - bagels with many choices of stuff on it, muffins, croissants some stuffed, etc.  They rotated their coffee choices between different beans from all over the world, and had good description labeling of their offerings.  They had the basic menu of coffee drinks, but I didn't partake as I'm a cup of drip coffee, black, kinda guy, but all the offerings I tried were very, very good.  It was a little tight inside, but I'd say cozy for the locals and the kind of place to hang and check emails while getting caffeinated.  The staff was very friendly and attentive and gets top marks.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-14", "description": "I'm a little surprised to see all of the glowing reviews for Spike's given that the coffee is just okay. I've visited Spike's from time to time over the past ten years and have always found it to be an inviting setting. The associates and patrons are relatively friendly and the cafe has sort of a bohemian feel. Definitely a plus for cafe. Spike's also has a huge selection of coffee beans to choose from for use at home or work.\n\nAll that sounds great, right? The downer for me is the actual coffee that they serve by the cup. Most recently, I had a hazelnut coffee that was incredibly weak. Not only that, it had a highly unpleasant acidic taste that just overpowered the hint of hazelnut infused in the cup of joe. The price was also a bit steep for such a week brew of coffee.\n\nI wish I could give Spike's a glowing review, but the are a textbook example of form over function. They just don't have the quality coffee needed for a great cafe.", "author": "John Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "I love Spike's. I'm a fan of the soy lattes. The coffee is good, the pastries are fresh, the baristas are nice and dogs are welcome. Indoor/Outdoor seating too. What more could you want?  It feels so neighborly and friendly. To me, it is infused with the best of the old-school Castro vibe. \n\nI keep hoping they will expand and take the corner spot right on Castro/19th (recent HRC headquarters).  I do like the current space, just think it would be cool if they could serve meals and have more spots to sit and sun.", "author": "stephanie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "The baristas here are super friendly and ready to greet my less-than-put-together-8-am self. They have a good selection of coffees daily depending on your roast preference.  My favorites are definitely Kookiedoodle Fridays.  Another less recognized thing is their selection of loose-leaf teas, which are amazing and are surprisingly cheap. ~$2 for about a quarter of a pound!", "author": "Ben T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "Great staff, very knowledgeable (I didn't know the type of paper filter made a difference in the grind), terrific coffees (natch) and awesome pastries. What else do you need?  Oh the atmosphere!  Do NOT want to leave!", "author": "Stuart W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "This place was really cute/clean. I love the Castro and it is nice to get coffee/tea at a place that isn't Starbucks.\n\nGood stuff.", "author": "Gina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-30", "description": "Good local hangout kind of place that doesn't have that touristy feeling. \n\nI personally prefer smaller ma' and pa' sorts of coffee houses, Starbucks I'm convinced over roasts their beans ( in fairness probably has no other choice due to the volume). \n\nI cant say that's not happening here, but, the coffee and tea were both good, and the neighborhood atmosphere was excellent.", "author": "Steven K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-20", "description": "Dear San Francisco,\n\nThree years have passed since I last wrote \"On Spike's.\"  Lo, the time has moved quickly but the coffee has never dripped more slowly, the lips of Barista/os unlocked more loquaciously, or deliciously have I moved through life depending on the mighty brew 'n quip at my number one House of Crush...SPIKE'S. \n\nLove you more than sucking the last marrow from the oxtail.\nAxe and His Giant Wolfhound Mackie.", "author": "AXE P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "It's rare that I give 5 stars to coffee shops but the staff at Spike's go above and beyond. The coffee is excellent, the range of pastries very tasty and the staff are always welcoming and friendly. I always look forward to going there on my way to work.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "Who knew that Coffee was such a competitive enviroment??  Despite the pressures and growth and billions of dollars to be had, Spike's remains a single location jewel in the coffee world. \n\nThe staff is extremely friendly and fun and a terrific part fo the experience.  In addition to your standard lattes, expressos, half calf no foam non fat experiences, they have teas from all over the world and I bet you'd be hard pressed to find some of these elswehwere.  \n\nA great location with outside seating on a sunny day in SF makes this a weekend must for me!!  Since I've been living on a budget, Coffee gets only $30/month and I'm more than happy to save and spend that during the weekends at Spikes!!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-12", "description": "One of the,better independent coffee places. Coffee tastes fresh and they have a nice selection of beans.", "author": "Ddc C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "I started the five days of my vacation at Spike's. It was a comfortable, friendly way to begin a day. The baristas were friendly, and seemed to know most of the regulars. Awesome place to start a morning!", "author": "Brent B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "I love this place and have been coming here, on and off, for the past 10 years.  Everyone here is so friendly and helpful.  I really enjoy their coffees and muffins (apple cinnamon with cranberry is my fav - kind of tastes like Christmas).  Not one 'type' of people hang out here.  Gay, straight, young or old, you are welcomed and you do feel welcomed.  Spikes reminds me why I enjoy living in a real neighborhood.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-06", "description": "I always look forward to coming to Spikes!  The coffee is very good and they make it excellently.  There are better cups of coffee to be had for sure, but not in the Castro. \n\n But the highlights are always the cute and cuddly staff. And there's always some quirky fun topic of conversation to be had with them.\n\nOf all the places where I loiter in SF, this place feels the most like home.", "author": "john h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-16", "description": "I can contend with rude and uncommunicative baristas but then there was no bakery, and then there were bizarre drink suggestions, and then no wifi, and then no seating, and then why did I bother coming.  The reviewers and websites that promoted Spike's Coffee as a coffee SHOP were wrong, it's a coffee store.  Nothing wrong with being a store, but you can't PR yourself and mislead customers.", "author": "Eric J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-15", "description": "THE neighborhood spot.  Great place to socialize with friends and neighbors while sipping delicious coffee.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "The coffee is great here. Im not a coffee snob, but I like to feel like Im not in some kind of a trendy hipster spot when I just want to wake up and head to work. \nThe vibe is calm, the music isnt blasting and its really affordable. \nThe staff is always friendly and helpful.", "author": "Nene D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "Excellent coffee, good breakfast pastries, friendly atmosphere, attentive service, dog friendly. No wi fi...", "author": "Ayala K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-24", "description": "My favorite cappuccino in the Castro! I love the friendly welcome I get at Spikes whenever I decide to stop in. As a side note, the cookies are delicious.", "author": "Kara D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-25", "description": "Good place for coffee, but not so great for food. Only one item on the menu with meat in it. \n\nThey have GREAT apple cider, and will give you a huge mountain of whip cream on your drink if you ask for it.\n\nPretty dog-friendly (outside only, I think), and nice baristas.", "author": "Christian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "The Castronauts may not have the tastiest food in town (indeed, despite the impressive baked goods selection here, both the ham-n-cheese croissant and apple crisp roll looked better than they tasted), but they can do weekend-morning crosswords & caffeine with the best of them.  If Philz wasn't proof enough, come grab a table in the charmingly cramped Spike's, if you can get one.  Not only are the lattes fantastic, you can also get a pot of dozens of different teas (I tried the Cinnamon Orangerie and was not disappointed).  \n\nAnd yes, the service is in fact \"super friendly\" (thank you Yelp review highlights).  And no, they will not be blasting 80's dance music, if that's what you're worried about.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-18", "description": "If you want free Wi-fi so you can sit all day and take up valuable table space whilst sipping on your cold 99cent blend coffee for 3hrs...Go to Starbucks, hell go to Dolores Park Cafe and stop wasting perfectly good coffee and atmosphere.\n\n Spike's is one of those rare gems in this \"we want it yesterday\" California. The people that work there actually enjoy their job, they enjoy talking to people and take immense pride in what they do. The coffee is great, while not the best in the city (who cares anyway?) you can go in at 6:30 in the morning, be greeted with a huge (albeit tired) smile of one of their many fabulous, friendly, and cute (c'mon you were thinking it too) baristas. Breakfast snacks are good, loose tea selection is unparalled in the neighborhood (Samovar doesn't even come close) NO CELL PHONES? NO PROBLEM, thank goodness there are still people out there how actually like to interact with other people (oh  my god, what a concept?) Come in to Spike's sit, slow down, relax, maybe I don't know strike up a conversation or maybe sit down and read an actual paper? \n\nSpike's is a privately owned neighborhood sole proprietorship which means it is not a chain or franchise, so no bulk buying discounts, no franchise perks, expensive rent in one of the most sought after neighborhoods in SF, all of the overhead and employee retention costs of every other coffee shop in the city (franchise or not).  \n\nYou will pay more here. Simple economics. The difference, you get what you pay for and Spike's is worth every dime.\n\nIf you don't have a minute, don't come. If you hate people and want to be part of an assembly line go to Peets or Starbucks. If you are a coffee snob, go to what ever trendy shop is being touted as the latest and the greatest in SF (seems to change every 2 or 3 years). If you want to enjoy yourself for a short minute, sip on some good joe and maybe mix with some neighborhood folks, go to Spike's.", "author": "dude m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "Very good espresso, friendly knowledgeable baristas.  Great selection of homemade cookies and energy bars.  Wish they had more tables.", "author": "Joyce J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Good coffee and teas. The staff is awesome-always friendly! No wifi but a better place to hang out and read a book than Starbucks or peets. One of my favorite neighborhood hangouts.", "author": "V R C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-06", "description": "ok here goes about SPIKES https://www.facebook.com/spikescoffee1 I got a gift cert which the past few days had a wonderful experience with the peeps there and my friends I went with, Yesterday was on the phone , been on hold for 45 minutes , i was at counter I placed my order and answered the ?s i was ask , The jerk behind the counter,,HITS the counter pointing at something I had no clue what it was.. I was away from counter finished my call and ask.. WHAT was the POINT POINT POINT banging o the counter! his response.. NO CP at counter WE r not Starbucks,,, I look at him an said That is for sure ! That will be my last time there Ron M Stafford an friends that man is so rude and he knew he pissed me off.. DO not ever Bang your hand in anyone's face unless u want a bad response... But thank u to the guy behind the counter that made my latte perfectly ...get ride of the JERK! sad part is that he points that out when i was NOT even being rude but they let DOGS in where they serrve food , which is against the law ... hummm Really !!", "author": "Randy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-05", "description": "My love for Spike's can best be expressed through song: \"What Coffee's Like\" [to the tune of \"When Doves Cry\"]\n\nDig if u will a cafe\nwhere locals congregate and sit\nyour need for caffeine satiated\nCan u my Yelper\nCan u picture this? \n\nDream if u can a patio\nWith tables in threes and twos\nBaristas make incredible lattes\nAnd take time to chat\nChat with me and u\n\nHow can u dare go to Starbucks?\nWhen Spike's leaves them out in the cold? (the cold)\nMaybe u like crappy coffee\nMaybe u just like to wait in line on hold\nMaybe u need to discover\nYou've never been satisfied (been satisfied)\nHead up to Spike's my brother\nSo you can find out\nWhat coffee's like\n\nTell them if your stomach grumbles\nAnd is all rumbly-tumbly inside\nThey've got a bunch of fine-ass pastries\nThey'll toast your bagel\nAnd give your dog a side\n\nHow can u dare go to Starbucks?\nWhen Spike's leaves them out in the cold? (the cold)\nMaybe u like crappy coffee\nMaybe u just like to wait in lines on hold\nMaybe u need to discover\nYou've never been satisfied (been satisfied)\nHead up to Spike's my brother\nSo you can find out\nWhat coffee's like\n\nHow can u dare go to Starbucks?\nWhen Spike's leaves them out in the cold? (the cold)\nMaybe u like crappy coffee\nMaybe u just like to wait in lines on hold\nMaybe u need to discover\nYou've never been satisfied (been satisfied)\nHead up to Spike's my brother\nSo you can find out\nWhat coffee's like\n\nWhat coffee's like\nWhat coffee's like (coffee's like, coffee's like)\nWhat coffee's like (coffee's like, coffee's like)\n\nSpike's, guy (Spike's guy!)\n\nWhat coffee's like \nWhat coffee's like\nWhat coffee's like\n\nWhat coffee's like (coffee's like, coffee's like)\nSoy chai\nYou can be straight, guy\nSpike's, guy\nSpike's, guy\nGo to Spike's, guy", "author": "Greg Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-07", "description": "Stopped in for a quick hot beverage and snack before heading off to an appointment - this place is great!\n\nFriendly service and a wonderful selection of whole bean coffees and pastries.  \n\nThe place is small and, it's a \"Cell Phone Free Zone.\"  A nice touch when you feel like having an nice cup o'joe, pastry and conversation and don't want to talk over some ass hat on his Bluetooth (we like to call those guys Bluetools).", "author": "Christy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "Great place - really friendly team, excellent coffee and relaxing space to stop and day dream.", "author": "Jo D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-23", "description": "Alright- first of all, I need to admit that I used to work here. In fact, I was the first straight woman the current owners had hired. So I may be a *little* prejudiced in my opinions, but where better to get a review than from the horse's mouth? This was the BEST work environment I ever had. The owner makes sure to pitch in like the rest of the staff and there really is a sense of teamwork by everyone.\n\nSo- I love Spike's. I still go down there a lot, and it's the kind of place where I always run into people I know. Why? Because the staff makes a point of remembering its regular customers' names and often their drinks too. Sure, we might have taken an extra minute chatting to the person ahead of you, but this is a neighborhood coffee shop, not a drive-through.\n\nAnd speaking of time, often that extra few seconds are spent making a quality drink. I mean, how often do you get your latte with a heart made in the foam? If you're seriously in a rush, the great thing is that it's perfectly OK to skip the line, grab a cup of one of the many self serve coffees, and drop your cash on the front bar with a nod to the barista. You'll probably hear someone say \"Thank you\" on your way out.\n\nAnd if that wasn't enough, you're sure to get your candy fix from the jars lining the shelves.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-07", "description": "these folks are so great... today is the first day of Passover (can't eat bread!), and I accidentally ordered an everything bagel with egg and cheese. when I realized my mistake and canceled my order, the barista suggested we just put the egg and cheese in a bowl, thereby keeping it kosher for the holiday! it was tasty, and it was a very sweet and accommodating gesture.\n\nI've probably come in here half a dozen times over the years, and the baristas are always in a good mood, and easy to laugh with.", "author": "Denise H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-07", "description": "Dear 'Stro boys n girls-\n\nWHY DO YOU GO TO STARBUCKS WHEN YOU HAVE SPIIIIKE'S???!\n\nThe person who can give me a good reason shall be awarded a million dollars.\n\nIn all seriousness- I recently discovered Spikes by way of the Lesbian Social Network, and immediately began asking myself: \"Self, why haven't you been going to Spikes every day?!!\" Now my own personal answer does seem cosmic, but for GOD'S SAKE Castro dwellers, get into Spikes. They make the best THE BEST espresso drinks in the area. \n\nThank you Spikes, and the Lesbian Social Network. I owe you a great deal of my current happiness.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-30", "description": "No better coffee house in town.  Old world feel with Italian sodas, Arts and Crafts tile cases, and if you're a regular, you can open your own coffee account.  Nothing fancy...just a flash card with your name and deposit amount.  With each visit they re-tally and off you go.  The fantastic baristas know your name and your drink.  I've never been to a coffee house with employees that are as friendly, knowledgeable and funny.\nThis is my morning ritual...oh...and bring your dog cuz Spike's loves the K9.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-12", "description": "Strong coffee and cozy environment! It's also a bit noisy, so this may not be the ideal place to study.  However it's the perfect place for handouts. :)", "author": "Jeffrey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-21", "description": "Spike's is great.  Staff is kind, daddy's breads (vegan!) don't disappoint, and the coffee is yum.  I am always tempted to get a jawbreaker or something from one of their candy jars just because I haven't had a jawbreaker in around twenty years.  The best coffee joint around!!\n\nupdate:  I've started using soy in my coffee and the soy they use here is rather sweet.  if you like a sweeter coffee drink, this is for you.  me, I prefer the unsweetened, all the better to taste the coffee.  mmmmm.", "author": "Lisa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-19", "description": "Spike's committed a cardinal coffee sin when it served me my cappuccino (to stay) in a waxed paper cup.  I like coffee a lot, and while I'm not the largest expert out there, I found that this vessel completely precluded any enjoyment I would have received from a well-made coffee.  This isn't starbucks-  if you're going to be a cafe, please act like a cafe...\n\nI also thought that their pastries looked dry, prices were on the steeper side, and the inside, while nearly empty, carried every sound to its fullest.\n\nThey did have a wide selection of coffee beans though, which could be a good neighborhood resource.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Spike's has amazing coffee and a fancy new paint job. Everyone who works there is super friendly and there's even this one ridiculously good looking girl working there that I like to sit and look at for hours sometimes. There's usually not a wait unless it's really busy, but even if it's busy the wait's never THAT bad. I just started drinking coffee, so maybe I'm not an expert, but I think their coffee is one big cup of awesome!\n\nThere's always a nice friendly dog of some sort outside and the pastries have probably made me gain about 10-20 pounds in the last 4 months, but whatev. \n\nTheir tip jar says that 100 out of 99 people love Spike's. So if you don't like Spike's you should probably check and make sure you're a real person.\n\nEat a ham and cheese croissant. It will change your life.", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-14", "description": "I loved the coffee and the strange oat, granola, honey, cranberry bar that I picked up for breakfast on a whim. A bit pricey. Not a lot of great seating and not very many electrical outlets (and no wi-fi). Better option for take out rather than for sitting in. I met a friend here to have a conversation and we ended up leaving as soon as we were done with our coffee because it just wasn't a great space for chatting. The ladies behind the counter were nice and very efficient.", "author": "Rachael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "Great staff, great coffee.  I always feel like I made the right decision after I get coffee here.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-15", "description": "Best cup of chai around.  I order a bi-chai, half sweet half spicy, and it does the trick.  They have for here cups too, which I really like, because that stuff matters\n\nThe staff rocks! Always nice and they seem to actually take an interest in everyone.\n\nSeating inside and out, usually shadey outside, but whatever. No cell phones which is nice.\n\nI come here every monday night before yoga and hang out with a friend and chat, it's the perfect place for it.  Go there, come here, whatever, you know what I mean.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-13", "description": "LOVE this place. Like, if there was a possible way for a man and a business establishment to form a union of marriage together, I would totally be down if Spike's was....\n\nEveryone mentions the friendly staff, and I completely agree. I am gonna go beyond and give some props to Mike, for always being a cheerful and friendly ray of sunshine. I'm acknowledge at the door with a smile and a hello, when I realize I have no cash and have to pay with my ATM card, I get a, \"No problem honey.\" And they always call me out when I have to sign it, \"Mr. Hunter, if we can get your autograph right here, that'd be great.\" It's a personal and slightly flirty customer service that makes you feel special and leaving with a sense of happiness.\n\nI'm mainly a plain coffee drinker, and do enjoy skipping the line when it's crazy. Sometimes when there's nothing going on, I'll stand in line and check out the decor on the wall.\n\nThis is a great place to just stop, and enjoy the moment of the day by yourself. Bring a newspaper or book and a few hours, and you've got yourself a wonderful and pleasant weekend early morning.", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-24", "description": "Sunday Morning and in a Great mood, decided to go out and get some coffee and had never been to Spike's Coffee, and now I know why.  Went in to get two Lattes and was helped by a young man, everything was good until it was time to pay, I handed him my credit card and he stated do you have cash by chance?.  I said that no one carries cash these days, his replay, my regulars do and it costs us 65 cents every time we process a card and it takes away from our profit.  I was lost for words and said nothing, if that is the case, he was more than welcome to charge me more, I had no problem with that.  I then left, my lattes where not hot and mine tasted horrible. I left them on a trash can and went to Starbucks, not my first choice but way better than spike's.  Thank you spike's for the embarrassment, bad service, and bad coffee, I think you are better off with your regulars than your new customers, you just lost this one. :(", "author": "Charles A B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-25", "description": "The coffee is pretty good. The main reason to go here is the friendly neighborhood atmosphere and the warm welcome of barristas.", "author": "Pant SF T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-02", "description": "Friendly, knowledgeable staff and a nice place at the end of the busy part of Castro Street to sit down in the sun, sip your latte, and watch the lady with the two Labs and a goat walk them by, off the leash.\n\nI'm giving them four because they charge a LOT more per pound (like $3) than anyone else. I mostly think it's worth it though.", "author": "Karsten P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "It was okay, not great, not horrible. I just got a regular coffee and hung out on the patio. Surprisingly it was relatively empty (perhaps it was before it was a Monday afternoon). And it's also a positive that this cafe is located away from the craziness of The Castro so I got to just enjoy the day and my coffee without too much noise.", "author": "Andy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "Good coffee, friendly and fun staff, and always a tribe of lovely doggies with their humans in tow.\nIt is my little neighbourhood destination for coffee and a doggie walk.", "author": "Linda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "Spikes rocks. Friendly service, great coffee - they always have a selection of freshly brewed coffees on hand, and above all a mellow ambience. Its one of those places where the staff make you feel like a regular, even if you aren't. \n\nMy only vaguely non-positive comment is that there's not too much seating - both the indoor and outdoor tables fill up quick. But its worth hovering ... and geez, the coffee tastes just as good standing up!\n\nPerfect for commuters stomping down to MUNI, or weekend wanderers in the Castro. Always some cute dogs out front.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-22", "description": "I love this place. Go there all the time. What's not to like? In your neighborhood; named after a cute dog; lots of cute dogs go there; some cute people go there (an eclectic bunch); some of the cute people who work there always have a sarcastic joke on hand; thankfully lacking in any trace of the corporate culture (this is Castro culture at its best); and the coffee is great!\n\nSo what if, occasionally you give me low fat instead of non-fat... I can live with that - just don't try giving me decaf... I know where you work!", "author": "Kingpin X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-05", "description": "I never get tired of the hot dyke workers in Spikes, so super nice and friendly......and HOT!\n\nMore like a cool lessie hangout than a faggy coffee house.  Rock on Spikes ;)\n\nP'ster", "author": "Pammy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-08", "description": "For coffee, it's ok - a little acidic.  Their wet cappuccinos are spot on - like a sip of Europe.  Great crowd, neighborhoody - a real treasure old-school style. Muscle bears, dogs, coffee, Oh My! Real plus - no WiFi therefore The Herd bypasses the place.  Nice.", "author": "Sam C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "Really cute place, and the coffee is delicious.  I got an iced coffee on a warm day and it was strong and refreshing.  The hot coffee is good too, and if you're hanging out at the cafe the warm mugs are nice to use.  It's cozy inside and the outdoor seating is great on a sunny day.  I actually like that they don't have wi-fi because you can chat without feeling like you're bothering someone typing away on their laptop the next table over.  Spike's has a more friendly, open vibe because of that.", "author": "Hillary K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-03", "description": "I have a really good friend who loves this place, so I've been here often to meet her. You can tell the employees do a good job cultivating a relationship with their patrons, since people always walk in with a smile, dogs seem to know there's always a treat, and neighbors always wave as they go by. My three stars are based solely on the atmosphere and the neighborhood feel.\n\nHowever, I have yet to have a drinkable drink from this place. One time I ordered a Hazelnut soda. Now, this is something I actually drink and like, and it was so bitter I realized the soda was off. The next time I ordered a hot cocoa and it was tepid. Another time I ordered a latte, which was also lukewarm. \n\nMaybe it's just my luck and I should have asked for a re-do on each of these, but really, is it that hard to get these things right the first time?", "author": "Carla B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-02", "description": "Spike's is my favorite neighborhood coffee joint. They make a mean cup of soy latte and the staff is hip and friendly. Also, there is often great artwork on the wall and the tables out front are often full of Castro residents and their dogs :) \n\nThey also serve various treats, bagels, etc and on Friday, they've got fabulous donut treats as well!", "author": "Jeska D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-16", "description": "I live right around the corner from this spot but unfortunately have only had one chance to hop in and I'm very happy I did.  We were greeted warmly when we entered and when I asked for chai I was offered a choice! oh imagine that. very delicious chai - which was nice because alot of places don't make it very well. and to my small amazement found out in conversation that the person helping us was also the owner. that doesn't always happen so it was a nice surprise. I'm also fond of the bulldog theme because I think they are happy, cute, slobbery creatures.\n\ngreat everything bagels and other treats. good coffee.", "author": "michella s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-06", "description": "The best thing about Spikes? The COFFEE, man! This place feels claustrophobic with anything more than 2 people in it, so I have a hard time with people reviewing ambiance in a place this small. It's essentially a coffee counter people, get over it.\n\nThat said, the make great coffee and tea here. Even the snacks are yummy. The staff is always helpful too. Plus it always makes me feel all warm and fuzzy inside knowing I can get a great cup of joe from someplace other than Starbucks.", "author": "Nick R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-14", "description": "One of my fav coffee shop in the city.\n\nPeople are super friendly and pleasant, good latte, and there are always bunch of dog lovers/owners hanging there.  I take my dog for a walk in the morning and stop by Spike's to get my latte - this way, my dog can get some treats there, too while I'm waiting for my coffee.\n\nThey don't hustle up to make your espresso drinks, but you will see/taste why.\n\nAnd their chocolate sherry cake is good but is also hard to get.", "author": "Yoko S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-16", "description": "Wow, who designed the interior of this place? The counter where you sugar and milk your coffee is right next to the self-serve coffee pots AND the order counter. The service is so achingly slow that there are always people waiting to get their drinks and there is no fricking room. Get a clue, people! I felt like I was ordering coffee inside a phone booth. The staff were adorable and charming, but when they're 6 inches from your face I guess they kind of have to be. \nCall me when you remodel. The coffee was pretty darn good.", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "Hands down the best \"short pull, non-fat cappuccino\" in the City.  What more can be said?  Well, OK, I can also say that they have incredibly friendly servers, great candy, and a great selection of coffee beans.  Now, I'm not going to knock the chain coffee stores, but come on, when you can get a \"couture\" custom coffee here, why go elsewhere.  Thanks Spikes . . .", "author": "D H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "Good tea and coffee selection and super yummy bagels.  Great atmosphere with a really cute patio to enjoy the sunshine.", "author": "Marlie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-29", "description": "Discovered Spike's while living in the Bay area and considered it a step above the more generic national chains--great atmosphere, knowledgeable staff, tasty treats, dog-friendly, cellphone free zone, and AMAZING coffees! Since moving to the San Joaquin valley, we order from Spike's almost monthly-having become huge fans of Mysore Nuggets and the 5 Country blend.  The organic Peru is a runner up, but, nothing starts the day like the Mysore Nuggets-superb Indian coffee.  Thank you Spike's for being authentic, inventive and decently priced.  (and great online service, too!)", "author": "Don S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-28", "description": "I always enjoy Spike's. They have a really good variety of tea, which they always let you smell. If you're a tea beginner, they'll even do their best to help find a tea that matches up with your taste. \nThey also have a good selection of coffee and other hot drinks, such as hot chocolate and cider, or Italian sodas if you need something cool. \nThe food is also good and usually gone if you get there too late. The pumpkin pie bars taste just like the pie my mom makes and the bagels are warm and comfy.\nOverall, if you're in the Castro and need a break from life or just in the mood for a light lunch, head to Spike's. They'll give you the R&R and love that you need.", "author": "Jacqi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-27", "description": "Ok it's a neighborhood fav!... Super friendly service, always with a smile...even if they have had the same kinda night!  I love the regulaar and soy latte...Katz bagels....the bomb!  Great pastries & candy.  Downside...not a fan of the drip coffee...Latte & Mocha all the way...", "author": "Patrick G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-22", "description": "You know I was gonna give them 4 stars because they have no wireless... but I've come to love them for something else.  They are a more old-fashioned coffee house.  And I bring my iPhone and can check email and such there.  Mostly I like to wake up by getting out in the morning and hanging out there.  The staff are really nice and they have oatmeal, which is my breakfast of choice.  OH don't forget donuts on Friday and Saturday!  They also sell beans.  They make great lattes.  Cappucinos... well they put all that frothy foam and I'm not so into that.  It's really cozy in here and they have outside seating too.  I love my new neighborhood coffee place.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-10", "description": "I thought the coffee was good here but honestly, the main reason for my dissatisfaction, is that i thought for sure this would be a dog friendly cafe...alas it is not. In fact, they have a little patio with a sign that says no dogs are allowed. Given that there is a dog on the sign of the cafe and there is indeed outdoor seating, I was confused and disappointed that it was not dog friendly.", "author": "Min M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-31", "description": "Ummmhh,\n\nOh my gosh, support your local coffee shop and forget about the Starbucks monopoly!\n\nAwesome SHERRY CAKE, gotta try it!!!!", "author": "H W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-11", "description": "Nearly 5 years later and I'm still getting my morning (and mid-morning, noon, afternoon and evening) caffeine fix at this neighborhood institution.  Going to Spike's is like visiting the parts of your family tree you actually like.  In our time-obsessed society, how sweet it is to know that things slow down and you can enjoy a delicious coffee and conversation the minute you step through those doors...", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-06", "description": "As good as Blue Bottle is, we find ourselves at Spikes every week...they are cool and the coffee is smooth.", "author": "johnny h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "Everyone is super duper nice and friendly.. but not the fake friendly.. like hey its you again how are ya friendly..!!  i always get my boss lattes here and i never had a complaint.. i normally get iced teas n they are super yummy! i had a cinamonroll here a while back and it was very good too... this place is all smiles!!!!!!!!!", "author": "MiLLie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "good neighborhood  coffee place great location and friendly service.", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-23", "description": "So a friend and I came for a pick-me-up before heading to a concert after a rather good-sized dinner, and about a half hour before Spike's closing time. The staff were so kind in letting us take our time to figure out the drinks we wanted. My friend appreciated his medium coffee (I think it was the house roast), and I enjoyed my white mocha. And due to the proximity of our visit to closing time, one staff member even offered us some pastries that might otherwise would have been pitched, a very kind thing indeed (no, they were not bad at all, really). All in all, a cute little place to visit with some great coffee, friendly, generous staff, and a good selection of treats.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "I don't drink coffee any more so I can't comment on that...but I can say the Italian sodas were to die for!  The vibe in this place is just awesome, the friendliest people around.  I had a blast for the 30 minutes I was in here on Saturday!  I am stoked to have a new, local hang....", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-28", "description": "Great staff, who make a mean Americano that STAYS hot. And when I'm in the mood for a hot tea, the Hippy Blend is incredible. All this across the street from my shop. How can I want for more?", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-12", "description": "I love Spikes!  Not just for their Coffee & Tea and much better prices than the large YUPPIE chains, but for the people.  You can find me there almost every morning with the rest of the usuals and I cannot think of a better way to start the day.  Friendly Staff, Good Friends, Good Coffee.", "author": "Rebecca G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-06", "description": "There coffee is great but I always say the customer is right.  I went to pay with my Visa card and they said they take it but prefer if i would pay cash.  They said is keeps the cost down.  As it is, their drinks are the same price as anywhere in the Castro.  If I want to pay with a card that they except then I should be able to and not feel pressured to pay cash when I had little on me.  Now I have to go the the ATM for cash for MUNI.", "author": "Bryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-29", "description": "As a regular at Spikes on school days, I spend a great deal of my coffee intake at Spikes. The staff is spectacular and patient with the hordes of children that stream in before school around the corner. Mike and crew are sooo nice, always great at helping out the local school community and the coffee is excellent. They have great chai and a good selection of tea and yummy pastry type things...", "author": "eve b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-11", "description": "When I moved to the city, I was thrilled to find a coffee place nearby. I'm even MORE thrilled to discover that Spike's is a fantastic place to get coffee nearly any time of day! It's open nice and early in the morning for a coffee-and-bagel on the way to work (omg, their bagels are fantastic) and they have lots of little tables to sit and enjoy a drink in the afternoon. All the staff are very friendly and nice and it's very clear that this is a neighborhood favorite: the staff greets many people by name and are also ready to have a conversation. The store itself is a little small so it can easily look packed, but it always moves quickly. The muffins are yummy, the coffee is tasty, five stars across the board.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-25", "description": "my bff lives two blocks away from spikes. everytime i visit this is the our first stop in the morning: two large DSLs and a croissant.  We usually try and make an afternoon stop for an iced hippie blend tea. I get a pound of hippie blend sent to me once a month because it is just so amay amay i can't live without it.", "author": "Wind T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-24", "description": "Spike's ROCKS! Great coffee, good pastries and a warm atmosphere. Plus it's owned by the cutest coffee shop owner in town.", "author": "Scott R. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-15", "description": "I love this place. I have several reasons for this. They are as follows:the sencha, the yerba matte, the russian caravan, and baby, don't miss, DO NOT MISS- the Pai Mu Tan! I have never had this one anywhere else...does anyone else even have it?   This place has a fantastic tea selection! I'm a bigger tea drinker than I am a coffee drinker these days but I do enjoy the Kenya AA which is a light roast.", "author": "Lucy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-27", "description": "Wonderful neighborhood coffee house with the best prices in town. Very friendly and fun employees who always serve with a smile. A true gem of the Castro.", "author": "Len M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-04", "description": "I like Spike's.  I'm not against corporate coffee, by any means, but I love the atmosphere of Spike's Coffee.  I went in and had a mild coffee that had a subtle cinammon flavor to it.  It reminded me how my mother brewed coffee.  The staff was genuinely friendly, and didn't make me feel like an idiot ,when I got slightly lost, on my way to the bathroom.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-18", "description": "Really good coffee.  Really good service, and you just want to date them all!  ;)", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "a great little neighborhood coffee shop.  Everyone is super friendly and make those cute foamy hearts in my lattes :)", "author": "Nick G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "Super cute baristas and nice coffee. I only wish they had wifi and more seating. But I love that they are so dog friendly.", "author": "Kitten M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-09", "description": "This is by far the best decaf latte in the city.  No doubt.  I am caffeine sensitive but I love the flavor of good and strong flavorful coffee.  This stuff is even delicious iced.  Wow, and really nice baristas too.  Hmmm....cute and nice.", "author": "Thelma Lee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-21", "description": "This may be my new favorite coffee joint, beating out Sundance Coffee and Chat's in my hood (Potrero/Dog Patch).  My soy latte was perfect.  I mean perfect - no reason to add any sweetener or other flavor to it.", "author": "Nate B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "All I get here is regular coffee and a day old pastry. It's always great. Nice place to sit and realx and take the day in. Great staff!", "author": "Burt F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "cute, cozy atmosphere, yummy coffee and delicious treats...  \n\nplus the staff is friendly (they yelled at me once about using my cell phone inside, but i understand).  there are always nice dogs hanging around outside, too, which is a plus.", "author": "Elle B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "Needed some breakie snacks for a work meeting, and they bagged us up fresh bagels and individual cream cheese packs in 1 minute flat.  Would have been nice if they had more bottled juice choices to grab n go, but all in all we got what we wanted super fast and super tasty.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-20", "description": "Good coffee, good service.  And they don't make fun of me when I roll in in the morning in my pajamas with bedhead.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "One of the best looking coffee joints in town.   Great location and the friendliest staff!  I always get the feeling that they are either piecing together little bits of genius or having a really fun party until someone comes in and then they stop to grind some beans or make a latte.  This probably just means they are happy people and I have an overactive imagination.  Either way it's a great spot.  Oh and the coffee is fabulous.  They have beans with a kick and caffeine content is provided. . . try the morning rush. . . . the best legal buzz around.   You can also get creative with your flavored syrups if you're into that.  Banana latte anyone?", "author": "Valerie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-16", "description": "This is the total neighborhood joint.  People go to this place every day and are welcomed by name and dogs are royalty.  They serve a mean soy latte and they make this cute little heart in the foam (awh).  You can also order their coffee by the bean to grind and brew at home.  This is the kind of place that makes me forget I live in a big city.", "author": "Piper B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-13", "description": "A regular coffee stop of mine, Spike's is where it's at!!!  Love the coffee, the space's feel (very chill cafe w/ outdoor area), and the friendly/personable staff.", "author": "kyle w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-26", "description": "They make the best pumpkin pie latte here. It also comes with a side of witty comments from their staff. What is there not to love about Spike's?", "author": "Kristen R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-01", "description": "The very best coffee in the Castro! The people are very cool. Lovely location and the most enjoyable soy lattes. What more do you need? Visit Spikes and tip well.", "author": "Dustin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-10", "description": "Spike's Coffees & Teas is a very enjoyable establishment for me. The service I receive is impressive and courteous. I'm greeted by the staff as are other regulars and new customers. Doggies are allowed to sit out the front door with a fresh bowl of water and await the return of their master(s). Spike's has a great variety of coffee and teas for your consumption. And not to forget a sweet treat or a fantastic Croissant or bakery item, Spike's as the treat. Be sure to promote this business by purchasing a T-shirt and/or a mug with the Spike's logo. Thank you to the team of Spike's and to your leader.", "author": "Donald P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "I'm not a huge coffee drinker, so the best thing about this place is their tea selection. I could literally try a different tea every day of the month. The staff (especially Bonnie!) are very helpful because I'm way too indecisive. I've yet to try their pastries, but it all looks good. \n\nI think its cool that they let local artists display and sell their work.\n\nService: *****\nSelection: *****\nTaste: *****", "author": "Austin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-13", "description": "I love everything about this cafe. It's small and unpretentious (a double shock for being in the Castro.), the coffee and espresso is excellent (one of the top 5 places the city), especially if you prefer a beverage with Soy, and the service is quick and friendly. I think I'd live at this place if it only offered wireless internet access. Please?!", "author": "Michael A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-03", "description": "Enjoyed a chilly Sunday afternoon at Spike's. Excellent coffee, very friendly service, and a spot perfect for people watching. The only downside is no WiFi, but that's just more reason to read the Sunday paper.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "5 stars definitely for the friendly atmosphere. I don't drink coffee anymore, but I had a craving for a soy hot chocolate. Theirs was absolutely delish. And I recommend trying the chocolate chip cookies as well. A richer taste/alternative to Hot Cookie up the street (don't get me wrong, LOVE them as well).", "author": "Alona N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "After a night of drinking, I was looking for some coffee and found this place. The staff was great and seemed to be genuinely happy to be there. The coffee is really good and the place smell wonderful. I have to agree with some of the other posters here to forget Peets and Starbucks and go here for coffee. I am definitely making this my Saturday/Sunday morning coffee place.", "author": "Mark M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-03", "description": "for those in the know, this is the place to go to get your morning on. as i am a do-it-yourself kind of gal, i like that i get to select and pour my own coffee before handing it over the counter to get au-lait-ed. and when it comes back with a foam-swirled heart, i  feel truly adored. the staff is super friendly - with one guy i'ts *almost* a bit much pre-caffeine. but the chics are cool and everyone means well and takes your business seriously. i like that. and one more plus for spike's is that it is doggy friendly- there are at least 3 at all times hanging out in front by the statue of this cafe's namesake.", "author": "julia r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "Spike's has quickly become my favorite neighborhood coffee shop. The staff is super friendly and attentive, and the ambiance of the place is relaxed, personal and very local.  The coffee and pastries hit the spot. I'm a fan of the House Blend. I've not had many of the fancier coffee drinks, but they have them all, as well as some unique creations of their own. This place has tons more personality than any of the chain coffee shops in the Castro. I also like the fact that it has a neighborhood-center kind of feel. It's a place where locals come to chat and hang out with their neighbors. \"These are the people in your neighborhood\" as the old Sesame Street song goes,  Big thumbs up.", "author": "David M."}
