{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Love everyone at this Starbucks! I've been going here for two years now and service is always great. Only the baristas here make my regular just the way I like it. They're all super friendly too!", "author": "Mara Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-26", "description": "Too cool for school!\nLukewarm service. Customer does not seem to be valued. One little, one-at-time restroom for male and female... not cleaned for at least an hour. Give me a break! One positive...phones can be charged there. Hasta La Vista Babies!!!", "author": "Jerry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Can I say more that's a good place to drop in for tours as well business workers in this territory\"", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "One of my least looked Starbucks. I would come here with my gurlfriend, Andrea, in the morning before work and at one time it was almost ok. Crowded, busy.. But that is expected and ok. What is not ok are the number of crazy bums sleeping on tables stinking of rancid bum ass at best with bags of shit everywhere. A health hazzard and a personal hazard since I've been there and some of these people have gone fucking ape shit for no reason... Except for the demons in their heads. I really try to avoid this place but... It's close to my gurlfriends work. I think I need to start carrying when I come here. How did this turn into such a shit hole!!!!!", "author": "Richard B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "Friendly staff and never a long line. Order online with the app - but get there on time. Your drink comes out quick and sits on the counter!", "author": "Steven W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "I just want to say the WHOLE Starbucks team is fast, customer service orientated and go above & beyond to satisfy customers! The staff are pretty jolly :) I like the way everyone works! Can you imagine how fast 40 drinks go? Dude! they have like 7 minutes!", "author": "Maria R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-08", "description": "One of the slowest I've been too. Would not go back unless I was trying to waste time.", "author": "Paul H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "Do I need to say anything?!?\nIv'e been throwing up for 2 days!!\nAvoid this place like the plague!", "author": "Kiim V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-24", "description": "Do not open the 4 hours as it says on ALL THE SITES! Rude and rude staff, ruined my day!", "author": "Jaíne C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-24", "description": "What? Say what? I can't hear you.... forget having a meeting or conversation, reading ain't going to happen here, scrap the work project---- MUSIC SCREAMS.  No relaxing cup of Joe here. Asking help to lower the volume falls on \"deaf\" ears. Obvious as to why they are deaf", "author": "Teet S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Another Starbucks well-situated to all the businesses on the south side of Market and close to the piers.\n\nIn the mornings, when the business people are walking to work, there are two registers running and two or three baristas serving all the food and drinks very efficiently. Each time I am here I am always asked for my name so I always get the correct drink. \n\nThere is almost always an employee cleaning up so this is one of the cleanest Starbucks I have been into. Even the sidewalk in front of the store is spotless.\n\nThis store has a Clover machine and they are serving ten specialty blends at this time.\n\nThere is a good selection of seats with wireless rechargers at many counters. These are the first I've seen in Starbucks.\n\nDefinitely one of the better Starbucks locations in San Francisco.", "author": "John B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-21", "description": "About a month or two ago this location switched from writing the drink order on the cup to using little print out stickers and attaching them.  Ever since then, every single time, my drink has been made wrong.  I'm not sure why they can't read and follow the printed labels correctly, but they can't.  No longer using this location after today.", "author": "Justin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "One of the best Starbucks locations! The staff is friendly, the drinks are always accurate, and the outdoor seating is lovely.", "author": "April H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Always great service here and the outdoor seating is wonderful. Mornings can be a little hectic during the week!", "author": "Melissa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "I love the staff here! Very friendly fast and the place is clean! Kcray ,Alyssa and James are the best baristas I come in almost every morning and my drink is on point!", "author": "Pooh W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "This Starbucks was right by my hotel. Even when busy they are fast, accurate, and friendly.", "author": "J D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "I'm pretty sure I'm talking about the correct location -- the one right across from the greyhound station. I was here just yesterday and decided to give an amazing review.\n\nThis was the perfect place! Convenient location right near where I was interviewing and where the bus station was. I can tell there is awesome customer service here -- a lady employee kept checking on this man and asked him if he was okay and if he was bleeding. I was kinda shocked to see someone go above and beyond. Also as i was picking up my green iced tea, I said to an employee \"i thought i heard my name called\" and he said \"yeah i thought i did too, and he went to the counter to double check for me and handed me the cup\". There are a ton of seats and I was lucky to find a place with charger. Great place to relax with free internet.\n\nDefinitely will be my go-to starbucks place once I'm in the area again. Thank you so much!", "author": "Amy V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Decent location to work. Love the palm tree picture on the wall.  Chairs could use back cushions & tables could be bigger. Basically one person per table if you're working, 2 on one table is difficult.", "author": "Breanna B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-05", "description": "In between barre classes, I decided to try the Starbucks around the corner. Diffident and unexceptional service when I paid for my purchase with my Starbucks gold card but nothing prepared me for the snotty and unprofessional response of this same barista when she accidentally sprayed my MacBook Pro with caramel sauce while making a drink. Typically there would be a plastic guard to protect Starbucks' customers and their belongings from flying drink ingredients. After I visibly recoiled and started to try to get caramel gunk off the back of my Macbook, she offered an insincere \"sorry\" without any attempt to rectify the situation. I asked her if she had a napkin so I could wipe this sticky caramel goo from my computer and she actually pointed across the room to the stand with napkins and told me to walk over to get one. Inattentively sent caramel goo flying onto my Macbook then couldn't even help me get something to wipe off this mess. Truly abysmal and unprofessional service, I won't be back to this Starbucks location!", "author": "Cheryl L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-08", "description": "Decent queue management, bar stools, outlets - what more can you ask from a Starbucks. \n\nMaybe parking? Nice try. We're in the FiDi.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "I was starving so I stopped by for my go to of bagel and cream cheese. They were all cordial and quick about the order, no issues there. It was kind of chaotic in the morning around 11:00 AM with limited seating but I did find a spot at the bar to eat my bagel in peace.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "While waiting for my brother-in-law to get off of work, I camped out with my buddy at Starbucks.  This location is like a sauna and I guess the A/C wasn't working.  It was a hot day to boot so a frappuccino was needed for cooling off.\n\nI ordered the green tea frap which was really tasty, though I didn't realize there was as much caffeine in there as there was.  I'm always a fan of the drinks here so the frap really hit the spot.  I'd definitely get it again.\n\nThis location has lots of tables to work if you've got your lappy with you.  The whole building is surrounded by windows so there's plenty of natural light and people watching opportunities.  This will probably be my go-to Starbucks from now on.\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 8/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "This is a great Starbucks. Great outdoor seating. Very fast. Good one.", "author": "Al H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-28", "description": "I come here daily for my morning coffee and that's it. The snarky Tagalog gossip about customers is REALLY getting old. As a Filipino-American who hears every word,  and every morning-MIND YOU, I am embarrassed and appalled.", "author": "Albie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "This place is crazy in the mornings!! Expect a long line that reaches out to the doorway for sure! \n\n4 stars because the staff is fast and works hard! Definitely gotta have good team chemistry in order to please these people that are trying to get their coffee fix before work!", "author": "Darrell N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "When you're lookin for some coffee, the choice is clear\nYou need to come down to the bux on Spear\nThey're quick with the orders and they do it with style\nHand your coffee over with a thank you and a smile\nThe best employees that I ever seen\nGet my trienta macchiato with triple cream\nTheir facilities are pretty clean\nIf it gets busy they work as a team\n\n5/5 stars", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "I went to this location yesterday to redeem my free drink that they are offering with their current promotion. In the promotion, if you buy a holiday drink by said date you will receive a sticker and when you get 5 stickers, you turn the booklet in and get your FREE GRANDE beverage. \n\nI was in the process of filling my card up, when I went thru the drive thru, when I realized that I had left my booklet in my husbands car. The sweet girl at the window said no worries and she gave me another booklet. She told me that I could combine the booklets for my free drink.\n\nAfter having a less than stress free day, I decided that a shot of free caffeine is just what I needed. I went thru the drive thru and I placed my order. I should note that before I placed my order, I explained to the girl taking my order that I had the sticker booklets. She asked me to pull forward to the window and to give Justin my booklets and then enjoy my drink.\n\nI pulled up to the window and I handed Justin my booklets. He looked at me puzzled and said 'do you want to buy another drink.' I said oh no thanks, its just me and I only need the one coffee. I was confused and thought maybe he thought that I wanted to purchase a coffee and get one free. I explained to him that I wanted to redeem the booklet and he told me that I did not have enough stickers. I said 'isn't the promotion valid if you have 5 stickers?' and he said yes but they needed to be on the same booklet. I told him about my earlier conversation about ending up w/ 2 booklets and described the cashier (what she looked like, the time of day etc) and he just looked at me and said your total is... He would not even get anyone else to help or see what we could do to remedy the situation. I just handed him my card, paid and left. He was not pleasant at anytime during our conversation and was giving me the stink eye, or maybe he had an eye infection, I don't know.\n\nAnyways I called the store to ask them what their policy was on the booklets. I spoke w/ a VERY kind and understanding employee named Matt and he said that he would honor my 2 booklets and was apologetic for the way that I was treated yesterday.\n\nI only took 1 star off my previous review, only because I think they should be clear w/ their employees when they offer promotions so that their is no confusion, and because of the rude way that I was treated. Justin could have just gave me a simple 'I'm sorry ma'am but I cannot accept your booklet because of X, Y and Z.' \n\nA big thanks to Matt for helping me out", "author": "VeeVee N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-05", "description": "I am going out of my way to avoid this Starbucks.  I've ordered twice online in the last week, so I could pick up my order quickly on my way to work.  Both times there was a problem, so my order was not ready.  I ended up waiting.  This service works at other Starbucks.  Why not here?", "author": "Margo H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "Need the extra boost this morning although there's a slight line its worth the wait. Morning coffee run before I knock out a eight hour shift", "author": "Kentara W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "I've been goin here for the past couple of months because I work over here in the mornings and they always give me great service even when I'm having a bad morning with work. I only know some of the guys here and they all work hard. You guys are the BOMB for the ones I know and know me as a regular now.", "author": "Bria L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "This is one of the very few Starbucks locations I've found that serves hot soup, and pretty good too.  Lots of tables and space, but can get pretty busy because it is in FiDi in SOMA.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-17", "description": "my neighborhood sbux! the service is fantastic and accommodating, and there is plenty of seating!  lines get LONG during the week at peak times is my only complaint.. and sometimes they are out of dark roast.. meeps!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Kris and Jameson are the best in the morning. They remember my name, they're polite, they're  quick. They make mornings more bearable.", "author": "pete c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-24", "description": "Not really a big fan, the layout changed\nIt's kinda modern, but kinda strange\nCoffee is typical, nothing new there\nit's the standard caffeine addicts lair\n\nTypical Starbucks, nothing new about it.  They remodeled the past year or so, but I don't like it.  There's a lot of wasted space in the foyer, and the bar is just kind of strange.  I hope that they fix this, but if you see them with the pastry area open, ask them to close it.  I've seen a small bug flying around in there before, but that was just one time.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-15", "description": "The drinks were amazing, that's not why I'm giving 2 stars, I'm giving two stars, because one of the older employees, who was cleaning, was constantly cursing any time somebody had to walk by, at one point he went into the bathroom started coughing and kept saying s**t every time, it was a little strange to say the least, other than that service and food was great, So maybe just make sure that your employees know a little more about etiquette", "author": "Gael G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "My usual 4 shots of espresso over ice in a vent cup.  I love coffee and I love Starbucks, well I actually don't discriminate great coffee.  I love Philz and Blue Bottle too but nothing compares to the coffee shops in Sacramento.  But this will do, the service is friendly and my drink is consistent.  This is all I ask for.  I am not too particular, its SB what do you expect.", "author": "Angela V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-27", "description": "As the limited supply of coffee shops in the area Starbucks is your \"go-to\" Now with an even fewer supply to choose from in the town (three locations) this is your premier location to select.\n\nLet me hightlight the good parts about this. Central location, fairly visibly in the area. High traffic with the select stores in the vicinity. Great, quick, and knowledgable service. \n\nBasically, for a commericial take on coffee you get the name you pay for. McDonalds for fast food burgers. Starbucks for fast coffee, though Starbucks should be held at a higher standard than a fast coffee chain. \n\nMy regular order would be a carmel macchiato, seven pumps of vanilla, upside down, whip cream, and 180. Though I'd since revised it to a more pristine price to a tall coffee, whip cream, and carmel drizzle 180. Still adding the 180 through trial and error to hold that right temperature.\n\nI drove through to order, to my suprise they said they can't do the 180. Which I have never heard of before. Simply a change outside the norm, and its unfeasible for AJ to aquire that order. Maybe broken down to laments terms of extra hot could've I got my 180. Sad to say, I did not get my order in to my liking as well as not receiving my receipt. \n\nTheir customer service could use work, in particular that one shift I dealt with. I would recommend this to others, but with great hesitation. I can only hope for the location to get better and hold a high standard with its employees.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "So here's the dealio... \n\nI don't go to Starbucks all that often. Its usually not an enjoyable experience for me. I have a somewhat complicated order, and I like my coffee very sweet. \n\nMore often than not when I go I have to spend time explaining my order (even though I order very clearly) answering questions like \"do you know how sweet that is?\" Or \"have you ordered this before?\" And then they still don't make it right. Its as though they just can't believe I really do want it like that. \n\nThis time was different. I ordered my drink at the drive through, She read it back to me perfectly, and when I receive my drink it was just right. That's how going to Starbucks should be. Thank you", "author": "Doctor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Excellent baristas. Make the best Starbucks chai latte I've experienced.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-08", "description": "I work in the same building at 201 Spear St., and until now, I have been VERY satisfied with the service and smiles of the baristas. My biggest complaint is with the lack of consistency in the way that the espresso drinks are made. I've had my Cinnamon Dolce served to me three completely different ways (from 2 different baristas) and as a regular (daily) customer, they know how I like my lattes. \nCan we get some refresher training for the baristas, with a focus on consistency, please?!", "author": "Matt S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-21", "description": "This Starbucks was clean and well kept. My drink, a Vanilla Latte was flavorful and consistent.\n\nHowever, one drink I ordered was made the way the barista wanted to make it and not the way I ordered it. His attitude was indifferent, at best.\n\nIf you don't mind a big city mind-set, this place will work in a pinch.", "author": "Jeff B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "Great location. Even though they're located in a fairly busy spot and there's usually a substantial line, the staff here are always friendly and efficient. I like the layout of the place as there's an organized queue, a full size open air fridge with their pre-packaged food offerings and the sugar/creamer station is out of the way too. There's plenty of comfortable seating along with some bar style seating where many customers have their laptops out working away. \nAs a bonus, on more than one occasion, I've seen them offering samples of their baked goods while you wait in line.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-19", "description": "My go-to Starbucks on workdays. The line is usually fairly long, but moves quickly due to the attentive service. I like to change up my order, so I alternate between a few different drinks and food choices; all of which have been very well made. \n\nThe only downside is limited outdoor seating, but that's just a product of the location.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "I go here every morning and they are always super quick and top notch, from the previous reviews below: seems they need a better afternoon shift staff. Their morning people are awesome.", "author": "Alana F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-18", "description": "It's Starbucks people - you know what you're getting here and it's pretty straightforward.\n\nI will say if you are a health nut like me - try their Spinach Feta Wrap.  At 290 calories and something like 16g of protein - this bad boy is perfect after a morning workout or even just to start your day.  It consists of a wheat wrap, egg whites, spinach, sundried tomato spread and feta.  It's super good and I like to treat myself every once in a while.\n\nSkinny vanilla latte's are my jam - but like the majority of other coffee lovers - we know there is better coffee out there.  It just so happens that Starbucks is super close to where I work.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-19", "description": "The good: They give lots of samples.\n\nThe bad: It's busy so they move you along quickly and speak very loudly that can sometimes be jarring.\n\nThe hair tearing: The internet is TERRIBLE. The internet is terrible. Let me say it again, the internet is horribly mind breakingly terrible. I go there for a respite from the office and end up leaving Starbucks more frustrated than I came in because of the lack of wi-fi. It's in and out, in and out. Only time it's ok is late afternoon when there are only a couple people there, and even then it's touch and go.", "author": "Alan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-22", "description": "This is a great location and a block from the water. It is in a busy corner and seems to be always crowded. I like the high ceilings and mural inside. Good place to sit outside and people watch.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "I feel a little silly writing a review for Starbucks because it seems everyone is already very familiar with it.  However I'm writing this review because this Starbucks so \"on it.\"  I live close by and the lines are always very long.  However, the line moves SO fast and efficiently.  When I go to other Starbucks I seem to grow impatient because they are not as quick and efficient as \"my\" Starbucks.  This Starbucks is one of the best!", "author": "Heather M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-22", "description": "Starbucks has improved over the years, and this is a great people watching spot. The cappuccino cart down Spear Street towards the bridge has far superior coffee, however.", "author": "Sahra H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-10", "description": "This place is quick and efficient.  Mostly Asians work here.  Le Boulange pastries (chocolate croissant!)", "author": "Chris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-21", "description": "Awestruck at how hard they work and how fast those lines go! KUDOS for TEAM WORK! All the while keeping a clean store and a Smile on their faces!", "author": "K. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-14", "description": "I sometimes cheat on my Howard & Beale Starbucks with this one - I hope they're not reading this. But if you are...just kidding! \n\nI love the comfy leather couches at this location. They also have a dimly-lit little \"nook\" in the back that is perfect for working or reading the paper. Their bathroom is easily accessible and and semi-clean (I give it a 5/10). This one tends to get more crowded than other locations, even at odd hours.", "author": "Mariela D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "My first time at this location and way impressed. Although the line was long, I got my drink very quickly. Spent the morning working from here and there was plenty of seating and very clean. Also they have a bathroom (which not all city locations have). Will definitely come back to this location", "author": "Becka R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "I love the Starbucks at my work. It's nice to know that all the workers try to remember your name and drink. The workers are super nice and friendly and really try to get through the line. Even when the line is long, I don't mind waiting because I know they are doing the best to move through it as quickly as possible. \n\n I definitely feel at home here, and ever since the remodel, the layout is way more conducive to hanging out in Starbucks as opposed to the get in/get out atmosphere of some other ones.  \n\nSince it's in a \"business area\" it doesn't stay open late, so don't expect to have a late night coffee run with your bff's at this location. However it's great for early mornings (barely any line) and early afternoon latte!\n\nNote: I did have more nice things to say but I'll keep them to myself.", "author": "Phillip D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "Thank you for saving my life!\n\nAfter a walking down the block from Los Compadres in a coughing fit, I was able to relax the flames that must have been shooting from my mouth. Green Tea Frap...my savior.\n\nIt was real busy in here but the all the staff was fast and efficient..at least for today!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "I go to this Starbucks typically on my way to work each day, and sometimes for a mid-day pick me up.  Just at the frequency of that, the employees here have started to actually remember my name!  Though sometimes they're off and think my name is Jeff, but hey that's close enough and at least they try.\n\nAnyway the service is great here.  There are some long lines in the mornings at times, but I can definitely see everyone working hard to get those drinks out.  They screen the lines for folks ordering something to eat, or those ordering regular coffees to get the line moving faster and people where they need to go sooner.", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "This place is really, really crowded. There's a smaller Starbucks right across the street - seriously they're everywhere and not just every block - that is a bit faster, more personal and for SOME reason very empty.\n\nThis place is BIG and serves everyone on that side of the street, but morning rush is pretty bad. Be prepared for a line...", "author": "Jennifer J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-27", "description": "They're open at 4:30.  I start work at 4:30.  I respect them for being there earlier than me and share their pain and being awake at that ungodly hour.\n\nFast, friendly staff (even for the hour!).  La Boulange pastries adds a nice twist to the regular starbucks fair and they always toast it.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-13", "description": "I like this one.  Staff is very speedy and professional, especially when it gets crowded.  Nicely remodeled too.", "author": "Ned L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-11", "description": "Worst Starbucks ever. Expect bare minimum customer service. They will not go above and beyond for you. I just got a parking ticket because of these guys", "author": "josh m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "Fast, friendly and consistent. What more can you ask for from Starbucks.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-17", "description": "I've never seen a slower moving line.  Seriously this place is a display of incompetence.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-14", "description": "You may not want to go here if you are in a hurry, especially with the crew working tonight. Came in ordered an grande Americano and tall mocha and 15 minutes later after the Baristas finished talking about sports my drinks were ready. It appeared one guy was in charge of making the drinks while the other 3 were doing end of shift tasks. Let's think about stopping what your doing, concentrate on getting the drinks completed for the customer and then go about your end of shift duties; especially if multitasking is not part of your routine.", "author": "James L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-08", "description": "I have found the slowest Starbucks ever!!!  I would leave, but I'm stuck in the drive thru. 20 minutes down.", "author": "Jim T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-20", "description": "Normally for chain places like this I would say it is what it is and you get what you get, but for someplace as customizable as Starbucks, its really important that the employees are well versed in policy and procedure. \n\nThere has been many times that I've come to this particular location and ordered and it came out wrong simply because the barista either wasn't well trained, didn't care or wasn't good enough to remember steps and the order they came in and didn't bother to confer with anyone or any other resource before proceeding.\n\nExample: I like to get a venti iced coffee with white mocha sauce instead of classic syrup. Every venti iced drink except the macchiato gets 6 pumps of syrup/sauce unless otherwise stated by the person ordering. So when I say with white mocha instead of classic I expect 6 pumps of white mocha. Two days ago, the girl asked me how many pumps, so I told her. It could have been she just wanted to be sure, which is fine. When I got a refill, nothing was said or asked but for some reason I only got 4 or 5, not sure which but def. sure it wasn't right, because I get it all the time and it wasn't sweet like normal. Today, I got the same thing and the chick messed up in two ways. 1, she put both, AND she put seven pumps, so it was way too sweet. \n\nOnly reason I still come to this location is because its convenient and if they mess up, they will fix it so long as you say something.", "author": "Lucylyn G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "I go right before work every Tuesday and Thursday around 7:30am and they are great! Wait no more than ten minutes.  However it seems to me every other time I go they seem a bit slower. They are always very friendly to me!", "author": "Emma M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "Thumbs up to this Starbucks after there very nice remodel.  I stop here frequently when visiting the post office across the street.  Their remodel must have been in the past 2-4 weeks, and they did a great job!  Anyways, this place is run well, easy to park at (usually), and has everything you would expect from a Starbucks!  My coffee stop in the Rincon area...", "author": "Andy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-15", "description": "Skip this location if you're in a hurry. They have five employees standing around repeatedly asking if you want anything for breakfast and ONE barista making coffee. Very slowly making coffee. I ordered a single espresso and the cashier couldn't be bothered to walk my cup five feet to the barista so mine was put behind two more orders from the next register. I ended up having to leave without my single espresso because it wasn't ready ten minutes later.  Get it together. And no - I DONT WANT ANY BREAKFAST.", "author": "T T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-01", "description": "Just got the worst green tea latte here,  they didn't even stir it. what a disappointment.", "author": "Dawson V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-19", "description": "This Starbucks consistently serves terrible tasting coffee!  Try another location.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-18", "description": "There are the people who go to Starbucks.  And then there are the people who should never go to Starbucks, because those are the people that I get stuck behind, because they have no idea how to order, where to stand, or basically how to be a considerate human being.  \n\nThis place can get PACKED, and for the most part, people know where the line is, where they pick up their drinks, etc.  But then there are the few who stand there with their thumb up their noses, taking up precious oxygen while blocking MY coffee ordering.  These people are the reason why a line forms in the first place, because this Starbucks is pretty effecient.  Like so much that I cry if I go to one in the 'burbs, because those f'ers are SLOW.\n\nWhy are they getting 3 stars?  5 stars for their proximity to my place of employment -1 star for this one staff lady who is a bitchy blimp -1 star because even budgeting on a Starbucks card doesn't help me save money.", "author": "Pam S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-29", "description": "This is an executive cafe. It is very busy and most the people that come here work nearby. I think the staff seems nice and some what relaxed even though the line can get all way to the door. Sometimes they even wear seasonal costumes like reindeer antlers for xmas. BUT you know whats the most important thing to me?? When I order the tea they make sure to use tea tongs!!!!!!!!!!!!!! LOVE They are very clean in that way unlike some gross coffee shops........... ewwwwwwwww!!!", "author": "Hitomi M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-03-16", "description": "Starbucks Cafe White Chocolate Mocha prepared with skimmed milk - about 400 calories.\n\nMcDonald's Double Bacon Cheeseburger - 475 calories.\n\nStarbucks Caramel Cappuccino - about 350 calories.\n\nMcDonald's Bacon & Egg McMuffin - 340 calories.\n\nStarbucks Cafe Mocha prepared with whole milk - about 370 calories.\n\nMcDonald's milkshake - 380 calories.\n\nPete's Coffee House Blend - 40 calories and much tastier.\n\nStarbuck's is a costly, crowded,  McDonald's \"omni present\"  400 pound gorilla. The \"Walmart of coffee\" is just not that good. Pete's is not the best in the world, but certainly a better cup of coffee than Dr. Evil's front company.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-04", "description": "Super busy but they handle it well. Reason for 5 stars is for one employee in particular, she wasn't wearing a name tag so I can't give her a shout out but she is AMAZING.\n\nMy coworker ordered a breakfast wrap and coffee, I ordered my coffee and paid for everything. While we were waiting for our drinks, a different employee informed my coworker that they had run out of the breakfast wraps. He apologized and asked her if she wanted to order a different breakfast sandwich, which she did.\n\nShortly after, the woman who had taken her order came over and asked to borrow my card for a moment (after confirming that I was the one who had paid). I gave it to her, wondering what she needed to change...\n\nShe came back about a minute later, apologized again for not knowing that the breakfast wrap had sold out, and informed me and my coworker that our entire order was on the house.\n\nExcellent customer service, they  handle FiDi-ers VERY well (considering the pure volume, number of complex orders, and short-tempered people who must come in every day). I love this place and won't go to another Starbucks in the area!", "author": "Nicole W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "This is one of two Starbucks I really like. Love the people who work here, its close to home, my drinks are tasty, They are always very pleasant and quick. It is always very clean and it has the feel of a friendly bar especially with the recent (1year now) renovations, and if you knew how particular I am about this, you'll appreciate my observations even more.\n\n Mark, the \"Boss\" leads a great team of people. Don't take my word for it, Check them out yourselves.\n\n\nUPDATE: Ruby and Jess have moved on up in rank, Mark the \"Boss\" has moved on to the greener pastures of La Boulange.", "author": "Tryst A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "Young cashier was very friendly, wish I had gotten her name. In addition, our drink mistakenly went to drive they instead of to us in the dinning room. She found it for us super quick, apologized, and gave us a free drink card. That kind of service will keep me coming to this location :-)", "author": "Erica Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-20", "description": "I've been to every Starbucks within half a mile of this one, and the Spear St. location is top notch--I always go to this one even though I walk RIGHT BY 2 other Starbucks on my route to work.  \n\nEven on days when I walk in and see a huge line, I am out the door in less than 5 minutes.  Sure, I only order an iced coffee with my little customizations, but I have never received my drinks more quickly at any other Starbucks in San Francisco unless I personally knew the employees or there was no line, which is rare at 7:30-8 am in FiDi or SOMA.  Really, don't leave when you see the long line, you'll have your wonderful Starbucks in hand in no time and if you're having a bad morning the employees great attitude and rarelyfoundthesedays polite demeanor will give you a boost.\n \nAnd WHO LOVES HALF AND HALF? Oh, you do??  Well then don't go to the Mission St location 2 blocks away because they are almost always out of it.  Yes, I realize that the Mission St store has 1/2 the square footage of this one, but half and half is amazing and any employee knows that 2% or whole won't cut it for us H&H people (I drink 1% at home so its also something I look forward to in my Starbucks coffee).  THIS location is always fully stocked with precious half and half, both straw sizes, and the employees are Fabulous.   \n\nI don't even mind writing this rave review because I know that no matter how many people show, I'll be at work caffeinated and on time.", "author": "Megan A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-20", "description": "Everyone knows about the product they serve, so let me comment on this location.  It stays busy for most of the day, especially during morning rush hour.  Line does move quickly, so don't be discouraged if the line extends all the way to the entrance.  Sitting area size is much bigger than the one at the corner of Spear and Mission, with a nice quiet small room towards the back of the store.  \r\n\r\nI will never give Starbucks 5 Stars until they start making their WiFi free.\r\n\r\nI find it interesting that many people talk about Starbucks as an evil empire, but I find them tucked in line with a guilty face.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-05-25", "description": "This is in the area where the Financial District has spilled over into the South of Market.  People don't know for sure what to call this neighborhood, but the store is full of professionals.  Everyone is wearing a building badge.  The place is packed, but the line moves quickly.  \r\n\r\nThe number on the door was 100, and this was on the 200 block of Spear Street.  The building is 201 Spear, so I was confused until I saw the official address.  Oh! Suite 100!  \r\n\r\nIt was a sunny day, and people were chatting at tables and chairs out on the sidewalk.  Just inside, four large comfy chairs surrounded a small table.  There were lots of small tables with the usual cafe chairs, and an arm of the room wrapped around the espresso bar, giving an air of semi-privacy.  \r\n\r\nThis looks like a great place to people-watch.  Professionals like to dress up.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-03", "description": "This is the closest starbucks to my work and every morning there is a 10+ person line when I walk up. There is a reason for that. They work fast so I generally don't have to wait very long and the people who work there are very courteous/friendly. I usually get the iced white mocha espresso shot with a pump of vanilla to keep me going for the day. So far the best service for a starbucks in the fidi area that I've seen.", "author": "Norris T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-15", "description": "When it comes to Starbucks, I don't really expect too much... a standard atmosphere and a reliable Grande Nonfat Chai that I can get fairly quickly. This place underwhelms even with that low bar.\n\nI used to come here several times a week since I lived right across the way at Rincon Towers. However, over the course of a couple months, I finally gave up on it altogether and started making the farther walk to the Starbucks on Howard & Beale because this one was so bad. Let's review the transgressions.\n\nFirst, the speed is best defined as glacial... this place has set a new Starbucks record for slowest moving assembly line ever. I usually dropped in around 6AM, and there typically weren't many people and yet it would take them 7-10 minutes on average from the time I ordered to the time I walked out. This was mainly because chatty cathy the barista couldn't seem to realize her job was to make the coffee instead of wandering around aimlessly behind the bar talking to anyone who would listen. The last straw was when I missed my bus to work for the third time because they actually exceeded 10 minutes... at that point, it really was faster to walk the few blocks to Beale and order from someone competent.\n\nSecond, at least once every other week, they would get my order completely wrong and give me something else (usually a plain latte instead of a chai latte). Since I didn't have time to order another drink since it had taken them so long to get me the first one, I would have to suck it up and try to settle for that as my morning drink. Gross. It would be one thing if they just continually misheard me (which they did a lot, see point 3) but when I looked at the cup, it was usually marked correctly and the barista just didn't make the right thing. Really frustrating.\n\nThird, they never got my name right. I actually don't really care if they do but I mention this just for the amusement factor of the variety of different permutations I got... my name is Kara and, of course, I got all the typical mistakes like Carol, Karen, Caroline... but I think the best interpretation of my name was the day I got my cup and she had written \"Shay.\" All I can say to that is... seriously?! \n\nSo yeah, this Starbucks store is a fail. I've since moved and if you want to see a good Starbucks in action, the Polk & Vallejo one is where it's at!", "author": "Kara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-23", "description": "**LUUUUV** the sbux team here. Some of the friendliest staff around. It's like Cheers, where everyone knows your name. From management on down, everyone goes *above and beyond* to make your sbux experience a pleasure. The lines here can run out the door, but they flawlessly work hard to get you on your way as fast as possible. Thx you guys for making my day every day:). xoxo, crazy \"no foam\" girl.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-23", "description": "Yes, it's \"just a Starbucks\" but the people here are amazingly friendly.\n\nI've made some amazing friends here. This is like the \"Cheers\" [television show] of Starbucks for me. I go in, and I am greeted by name [or, with Loree, by the nickname of \"Puck\"]. They know my drinks (I have a few, and strangely enough, they can usually figure out which one I want depending on the weather and my \"mood\" of how I look).\n\nGreat people, fast service (especially in the mornings when it is jam packed!) and totally sweet customer service. Hell, I even go out drinking with Baristas from there from time-to-time (we gotta do it again Cat!).\n\nIf you're in the area, check it out and see what I mean. :)", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "Plenty of places to seat and unwind.  Staff is amazing.  Parking is difficult as in most Starbucks located in downtown.  However, if you want to seat outside there are probably only two tables available.  On a good day, the sun doesn't quite heat up this place - I guess its due to other tall buildings around it blocking the sun.", "author": "Nixon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Nice large store. Lots of tables for everyone (but then again I came on a Sunday and it probably wasn't the fullest). The only thing that was a little annoying when I came here was that the cashier was preoccupied with something and I had to stand at the front of the line for a while before another staff came out from the back and walked past her and telling her that their were customers in line. Other than that, the staff are friendly and I will probably come back if I ever go back to Crunch for a workout.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "I just had the best experience at my neighborhood Starbucks (by work) and they totally deserve this 5.  \n\nI walked in, they asked what drink, I said, Grande Soy Chai with... paused a bit and the woman behind the machine literally finished my sentence... extra hot, extra pumps, no water, no foam.  Yes, yes, yes and yes!  And then she proceeded to make it perfectly and ready for me before I even finished paying.\n\nWhat service.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-15", "description": "Love the renovation they had last year! The line now is finally not standing out the door! This Starbucks has plenty of seating and counter seating... Smart architect!\n\nService is excellent, supper efficient, and even with a hundred customers your mocha frappuccio will be ready in a minute!\n\nI love the ambiance here, WIFI is super fast... And oh! Sausage breakfast sandwich, croissant and bagel cream cheese are DA BOMB!\n\n5 STARTS ALL THE WAY,", "author": "NC B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-23", "description": "This place is crazy busy. There's about 25 people in here. There are 6 workers. 2 making drinks, 2 at the register & the other 2 helping with drink orders. I waited in line for about 8 minutes. I got to the register at 3:23 pm & my drink was ready by 3:29 pm. Not too bad, I was in no hurry. The trash was getting full & the counters where customers can add milk & sugar at was a tad too messy.", "author": "Donna D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-17", "description": "Well, Starbucks is Starbucks is Starbucks.\n\nMy family and I hit their drive-thru window before a road trip, and considering the car was packed with three adults and two rather fussy children, I'd say they're A-OK. Fast and friendly service, and no botched drink orders.", "author": "Sheryl D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-28", "description": "What's better then having a Starbucks in the same building where you work?! If they delivered to your floor, one could dream right?! This Starbucks is a well oiled machine, the staff are on their game, and your never really in line for more then ten minutes in the early afternoon. I bought coffee beans here last Friday and they offered to grind them for me and for the specific way I'd brew my coffee at home. I told them I use a french press and they ground the beans to the perfect consistency. I don't see a reason I wouldn't come back to this coffee house!", "author": "Constance D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "Wow, what happened to this Starbucks?  Unfriendly staff and drop in efficiency.  People that works there needs training.", "author": "K Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "There's always a line in the morning around 8; however, it moves pretty quickly! Not much to say because Starbucks is just like any other Starbucks. I'm in and out of this Starbucks in 10 minutes even when there's a line. Fast and great service!", "author": "Philana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Busiest, but pretty efficient starbucks!!! The staff here are quick, bright, and  there are just so many of them. They don't always bring your drinks out as they're received, so you just need to be a little patient.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "There really is no better way to jumpstart your morning than to get your favorite cup by the wonderful (Spear) Starbucks team! The line might seem long, but the service goes so fast you won't even notice! On top of it all, the team makes sure you get exactly what you want as they know their customers very well--name, order and sometimes the discount you want. ;)", "author": "Ellis T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "The friendly and energized staff Vivian recognized me right away even I had not been there for over a year. They managed to move a long line very quickly.", "author": "Kitty M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "This particular Starbucks is my official office away from my office.  The lines are alway super long but the workers move everything along in an extremely timely manner all while engaging in polite small talk with the patrons, keeping the place clean and orderly.  Super friendly staff, great ambiance, plenty of tables to sit and enjoy your drinks or do your work.", "author": "Stephen V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-24", "description": "Okay, I hate giving Starbucks stars....much prefer to go to the local coffee shop....but when you work in the financial district and need a latte your options are limited. \n\nSo, Starbucks as a company gets 2 stars because at least, whichever branch you visit, you know what your latte will taste like. Only two because, well, its Starbucks and they have put plenty of my favorite local mom and pops out of business. So why the extra star you ask???\n\nWhat brings it up a star is the staff at this Starbucks. I have never seen anyone so happy to work so hard, anywhere. There is always a huge line but by the time I get to the counter my coffee is ready - they know my name and what I drink and that, my friend, is great customer service! 5 stars for the fast friendly staff who get my morning going after a late night.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-26", "description": "This is the greatest Starbucks of all time. \r\n\r\nEven though they have crazy long lines the wait is only 3-4 minutes. And the drink wait is only 5min. That is excellent! I think they are the fastest Starbucks in San Francisco. But that's just my opinion. \r\n\r\nAnd they all make my drink right. I get an Iced Venti Green Tea Lemonade with 3 pumps Classic and 3 pumps melon syrup. They even hand me a straw so I don't have to make an extra trip to the condiment bar I can just go straight out the door.\r\n\r\nGood Job Baristas! Good Job!", "author": "Cat R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-19", "description": "(I have to give the standard disclaimer that, on principle, I believe in boycotting Starbucks in favor supporting of smaller, better, local coffee shops.  However, if you need a quick cuppa while working and have one of those gift cards that corporations love to hand out, you do what you do. )\n\nThis place gets some long lines at times, but they handle it well.  The folks behind the counter are super friendly and make a point to learn your name and your regular drink.  You can usually find a seat, and it's generally clean and well-stocked there.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-15", "description": "I am a starbucks alum to the max.  I have a starbucks card electronically implanted on my cellphone, which I whip out when necessary to impress strangers.  Ok not really, but I do like to use it for a quick latte daily.  I work half the month in San Francisco, and though the hotel I stay at has a starbucks, from time to time I find myself at this Starbucks location because it is two blocks from my office.  Let me take a moment to say how horrible this location it.  I give it one star instead of zero, because apparently Yelp says I have to, and because the cashiers are friendly.  But that folks, is where the magic ends, because the baristas at this location are just horrible.  I often have to go in for multiple drinks for office folks and it is every single time that I go in that 1.  at least one of the drinks I order is made wrong 2.  None of the drinks are mixed appropriately before they are given to me, so my latte is always all milk at the bottom and all coffee at the top, and because it is filled to the brim, it becomes extremely cumbersome to mix it myself once in the glass and 3.  Even though I ALWAYS order four or more drinks, I am NEVER offered a cup holder and every time I ask for one, it takes forever for someone to locate one.  I love starbucks and I have been to an absolutely TON of them daily, but this one, by far the worst one I am forced to frequent.", "author": "Amiee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "This location is like a night club you see all these corporate people dressing up like they're ready to dance the night away with coffee. lol I miss the couches in the back area it was clearly a hidden room where you don't get bothered by all these loud talking people. The new layout is more like a real restaurant and seems a lot busier than the old layout.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "Can't tell you a thing about their coffee because hubby makes it for me every morning.  However, their pastries and sandwiches are fabulous.  Service is very good early in the morning (6 a.m.).  They have the Chronicle too so makes for one-stop shopping in the morning.", "author": "Delaine Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-27", "description": "What I like about this Starbucks location is that there are a lot of seats, desks, and outlets. With this much seating, though, they should probably have more than one bathroom. There always seemed to be someone waiting to go.\n\nAfter deciding to purchase Wi-fi for 2 hours, I find out that the store closes a half hour later at 6PM (on a Sat). Okay, so I don't spend a significant amount of time at Starbucks but closing at 6PM? Seemed odd to me.\n\nSo I was hoping to camp out at the tables outside to keep using the Internet but apparently they bring those inside when they close. I was sitting on a bench outside for a bit until a bum came and sat next to me. He didn't bother me so much, but the smell did. Luckily I was parked across the street. I'm writing this review from my car now - Wi-fi still works!", "author": "Phil C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "They make consistent Lattes and their condiments are always filled up. They know how to move a line very quickly. The only downside is that meters around this Starbucks start early....7am I think.", "author": "jamie j."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-10", "description": "The people writing these reviews must be getting free coffee or something. I have been to this Starbucks in the morning on my way to work and have witnessed some unbelieveable behavior there. Lazy, slow and always wanting to joke around with each other (in the morning) is the norm here. I have never waited less than 10 minutes for a regular cup of coffee. There is a spanish girl who appears to work there whose name starts with the letter \"I\" that should be fired. There is also an incompetent asian woman as the morning manager who doesn't seem to have a clue. I heard her argueing with staff behind the partition and it was very inappropriate. I have seen peopke stand around until it is 7 am before they begin working regardless of the crowd or line. If you are not \"one\" of their crowd\" then prepare yourself for terrible service and to wait a while for a simple cup of coffee. I avoid this place at all costs!", "author": "Michael A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "I'm a big Starbucks fan and often stop by this one since it's so close to my office.  On a few occasions, I've stopped in to knock out some work and it's a good spot for that since there's quite a bit of seating. During peak hours, the baristas seem to do a good job of cranking through orders.  This isn't the case during the early morning hours, however - there's no reason it should take almost ten minutes to get an iced coffee at 5:45 am when there's no one in line and four employees there. My only other gripe would be that the bathroom seems to constantly be out of order. Otherwise, it's a solid spot.", "author": "Tim A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "Thanks for having cupcakes again!  Vanilla makes my day!\n\n(note: this is not specific to this particular store.  I am aware several stores are again carrying cupcakes.  This review does not necessarily reflect the service or beverages)", "author": "Ariana N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-22", "description": "\"Did you leave the premises at any time while drinking your coffee?\" \n\nThat's the question they ask you here when you ask for a coffee refill. No other Starbucks I've been to asks this, and in such a weird accusing tone.  WTF. The first time they asked me this here, I thought it was just a bad mood barista or something. But I've been here 4+ times, and each time when I've went to get a refill for the road they ask \"Did you leave the premises at any time while drinking your coffee?\"  Weird. Now I can understand not giving refills to people saving cups walking around town abusing the system-chain, etc, but when the place is empty, you just bought the coffee from the dude 3 minutes ago, he watched you drink it in the shop, and he still asks this - - just stupid.  Apparently if you step just outside for 30 seconds to the sidewalk to get a newspaper to enjoy with your coffee, you're screwed and risk having security called on you.  Who are these people, the Coffee Nazis?", "author": "Jack H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "While the line appears daunting, the team at this particular Starbucks is fantastic.  They are fast, efficient,  friendly, and energetic.    There are several  Starbucks within minutes of each other, and it is worth it to walk the extra block, to go to this Starbucks.", "author": "tammy o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-07", "description": "It's so convenient because it is only 2 blocks away from where I work.  Just tried their Peppermint mocha today for a pick me up and damn it was good!  Well, service was really fast at this location and most of their staffs are friendly.", "author": "Josie K W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-20", "description": "They just got a new manager here about a month ago and boy has service gone way down hill!!! Longer lines, not enough of the right pastries. It goes to show what one incompetent can do, even at a strong chain. As a result of the mismanagement I now go to the Starbucks over on Mission. The new manager needs a some retraining; your selling coffee it ain't rocket science!", "author": "Eric R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-09", "description": "Yes, I'm not a fan of coffee.. not even tea tickles my liking. But hey, what can I say - these guys strut their routine grandly.", "author": "Carl Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-09", "description": "I love that they know my name and try to guess my order (I like to mix it up and get different things)!  It's not home.  It's not work.  It's my \"third place.\"  Okay, maybe it's my fourth place, after the bar.", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-24", "description": "This particular Starbucks is slightly different than every other Starbucks because of this one doushebag employee that cant mind his own business.  At eight in the morning, when im purchasing a grande, I really dont need to be pestered.  Sorry pal, but you suck. 1 star for the classic sausage.", "author": "Buddy Garrity L."}
