{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "I love coming in here for the awesome customer service Luz always has to offer. She is outstanding, always smiling, and taking customers orders with a smile. I always look forward to coming into the store, so that she can take my order. Her personality is outstanding and her customers service skills surpass anything I have ever experience in retail before. She makes you feel welcome, and when in doubt on what to order, she always has the best recommendations. She is a ray of sunshine. Starbucks needs to hire more people like Ms. Luz. I don't mind walking the extra mile for excellent customer service. By the way, she makes the best lattes ever. High five for awesome employees like her!!!", "author": "Xenia R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-18", "description": "I was seeing a show across the street, but arrived a little early. Since my girlfriend was still 20+ mins out, I decided to stop by this Starbucks to grab some caffeine. I got here on Saturday, May 12th around 1:15pm. The front entry way is rather small, so even when there's a small line, it feels very crowded. There were a few people ahead of me, but I was able to place my order and get my drink in less than 10 mins.\n\nI went with a Grande Iced Black Tea: no sugar ($2.75). It was a warm day, so the tea ended up being refreshing. I was very tired from the night before as I barely got any sleep. This did the job and provided the pick me up I needed. Taste wise, the tea was average. I tend to like strong teas, so this was rather light for me.\n\nThe space is very much a grab and go type of situation. There are no tables or chairs. Just a a ledge along the window where you can stand and put your drink and/or food down. And the ledge is small, so it gets crowded easily. I was hoping to sit down and enjoy my beverage, so I was a little disappointing. I just ended up taking it outside and finished it in front of the theatre.\n\nConvenient if you are seeing a show across the street, but compared to other Starbucks, this one falls very short. Head to another location if you have options.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Best customer service ever! We walked in at 9am and this place was crawling with people! The line was way past the pick up counter and there were about 12 people in front of us.\n\nThe lobby was clean and there were plenty of employees working. We waited about ten minutes in line and it was finally our turn. \n\nWe got the NICEST employee ever. She was so kind to not only me but to my little niece as well. Her great customer service made our day that much better and I'm glad she helped us with our order. Thanks!", "author": "Christa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-22", "description": "At 7:30 AM, I went to this Starbucks for an everything bagel (NOT TOASTED) with cream cheese. I waited 25 minutes, and my order was still not ready. I saw multiple parties after me get their orders, so I asked the employees where my order was. I guess they \"lost\" my un-toasted bagel order, so I just asked for a refund. No apology was given. I wasted a total of 30 minutes for nothing. I would not recommend going here because everyone seems frazzled and incompetent here.", "author": "Angela H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "Probably the worst BUX I've been to . Staff isn't friendly and food takes too long even when they're not busy.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Waited 15 minutes for cold Bantam bagels with no line and  while other workers are cleaning and stocking up.  I rarely come into this Starbuck due to the service, so I decided to give it another try. Thumbs down!!!", "author": "Gloria D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-26", "description": "If the manager in the morning isn't there this place is a disorganized disappointment.  If your app says 3-6 minutes for my order, let me know why it takes 18 minutes. I would not have placed the order. Please don't give me a bewildered look when I seem irritated. Also, don't tell me my order is next, then serve 6 more people.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "My battery is going to die by the time this posts, but I will sacrifice my battery just to earn others. Any Starbucks on market Street is shite! No charging outlets they won't even charge behind counter. F@#$K YOU STARBUCKS!!!. I am no crackhead and I won't set up camp and pee in the corner. I want to stay as short as possible in your dirty poorly managed store. I just want to enjoy a coffee as I wait for phone to charge", "author": "Peter T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-06", "description": "The boyfriend needed some caffeine before we hopped in to watch Hamilton at the Orpheum. In short, it's a small spot, not a place to really hang out, more grab and go to get your caffeine (or non caffeine) pick me up close to the Orpheum theater.\n\nL O C A T I O N\nAs I mentioned, this spot is really close by to the Orpheum theater and there's even a BART exit right in front of it on Market St.\n\nI N T E R I O R\nIt's a fairly small spot and it can get crowded even with only a handful of people as the cashier is basically in front of the door.\n\nS E R V I C E\nFairly straight forward and not too slow as there were only a couple other orders in front of us.\n\nO V E R A L L\nNothing to rave about. Typical of other Starbucks but again very small. Good to grab a drink right before seeing a show.", "author": "Carolen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-27", "description": "One of the worst Starbucks I've ever been to. The people that work there have zero people skills. I witnessed multiple roll their eyes when customers would ask questions. I witnessed Delene (i could be wrong about her name cause it was hard to read her name tag) refuse to hand a mobile order directly to the customer who was standing in front of her. Instead she put the mobile order on the other side of the bar, forcing the customer to walk around. She told her that she had to be on the other side for mobile orders. SOOO ridiculous. The attitude that comes from this place is unreal.", "author": "Kayla F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-16", "description": "Yet ANOTHER horrific experience at the Starbucks on 8th and Market in San Francisco. Second day in a row that I placed an order on the app and waited at the store for 20+ min for my items to never come up. When I asked one of the employees I was rudely told that I could call the 800 number to ask for a refund. When I asked the manager Noah for a refund I was told to stand in line and he would process it when it was my turn (30 minutes after placing my order). I called the 800 number to ask for a refund as instructed by Ms. Attitude and after waiting on hold for 25 minutes the call was answered by someone who wouldn't give me her name. I explained why I was calling and was hung up on.\n\nI have been a loyal customer of this location for 4 years (every work day) and the service is beyond repugnant. I will start making my own coffee since you guys can't seem to do it. And I guess I will contact my credit card company to dispute the charges for the items that I never received and no one is interested in refunding.", "author": "Luke J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-06", "description": "Yeah....not going here in the morning again...\n\nOrdered my Venti smoked butterscotch latte at 7:30....got my order at 7:44. Not sure if this is how long it normally takes in the morning before work but that's a long time for me...", "author": "Gabriel D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-10", "description": "Terrible service and a very unfriendly barista. Would not return here...", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-08", "description": "This Starbucks is nothing spectacular because if you've been to one you've been to them all, but the point I find necessary to highlight is their mobile ordering. Twice now, I've used their in app mobile ordering to be treated poorly by staff. The first time, a homely vagrant woman was GIVEN my drinks without being questioned in spite her appearances and inability to look much like the male name on the order; however, I was required to provide proof of receipt for the drinks without regard to the fact that I knew the name on the order and specifically asked if those where the (specific drink names here) for - - - - . Hmm. Ensuring the right customer got their order didn't seem important initially. In fact, the employee handing my drinks to the homeless woman sent a great message when I was required to provide proof of purchase. This has also been an issue twice now.", "author": "dAvid s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "I ordered my protein smoothie drink while I was in the restaurant next door. It would've been at least ten minutes later when I went inside. I was way disappointed that my drink was NOT ready and I had to wait another 10 min for my drink. The person making my drink was busy chatting with another customer and I stood there waiting and waiting and waiting. Turns out, he didn't know how to make it and they didn't have protein. He kept yelping about not knowing how to make the drink and kept talking to the other person.\n\nI was ready to leave!!! After I got my drink, I told another person that I was charged 50 cents extra for something the store didn't have. He gave me 50 cents back.\n\nI told my friend that I would not be back no matter how desperate I wanted a drink. Not happy.", "author": "Eugenia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "Really cramped -- line out the door after just three or four people.\n\nBaristas seem to have good intentions but work incredibly slow. I saw one who was friendly but took about 5 minutes scrolling through different pricing/menu options on the cash register. C'mon, you can do that when there aren't customers waiting....", "author": "Barack O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "This location is my go-to before going in to the office. I would like to give 4 stars but half the time my mobile order which has been ordered 5-10 minutes in advance is still not ready or has not even been started by the time I get in. I end up having to remind the baristas after waiting an additional 5 minutes (I usually hope that it will get started soon and isn't forgotten). I definitely understand at times if they're short handed/have to service a lot of customers but hope that my mobile orders can be less delayed in the future. I always appreciate when they get my drink right and ready on time, I know it's not an easy job. They're relatively good about starting my order once I've reminded them that I haven't received it yet and sometimes my order is ready on time or I only have to wait a few minutes. 3 stars for inconsistent service/delays/forgotten orders. Will still come here over Peet's though.", "author": "Saachi G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "Dear Yelp,\n\nWhat's up with all the stalker-ing?\n\n\"You've checked in here 31 times! What keeps you coming back?\"\n\nYes, I admit I've been here at least 31 times.\nDon't be so judgmental, you single origin swilling snob.\n\n\"What keeps me coming back?\"\n\nWow, kinda personal don't ya think?\nYou assume we share a certain level of familiarity when you ask such things.\n\nIf you really must know,\nStarbies has reached a whole new level of convenience by allowing me to now order and pay on my phone, so that when I get here, I simply pick up either my Flat White or 2 pump vanilla soy latte and leave those suckas waiting in line behind.\n*Blue Bottle (via Square) once offered something similar but no longer.*\n\nSo there you have it Yelp.\nYou've shamed me into admitting I drink here.\nHappy now?", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-26", "description": "Advice to anyone reading - double check your drink before you leave the store.  They staff there is nice, but a few of them have a \"don't ask me to remake your drink\" attitude.  I mobile ordered a grande drink with extra whip cream and my drink had NO whip cream.  I asked them to add it and the gal rolled her eyes and gave a lot of attitude when handing it back to me.  I just paid $5 for a drink that had clear instructions, my bad for being lame and wanting some extra whip cream.  JEEZ.", "author": "Kay P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-30", "description": "for the last two years, I've visited this Starbucks at least three times a week. The staff there have always been polite and friendly until today.\n\nThis morning, on my way there, I placed a mobile order for a black tea latte with steamed milk, Carmel and cane syrup. What I received was a cup plain hot tea. \n\nWhen I asked the barista Hailie if she could add milk to my tea, she refused to acknowledge me, only responding with \"I don't know what your talking about\" when she eventually did decide to care that there was a problem with my drink, she set it to the side and ignored it for at least five minutes while she made other orders.\n\nI patiently, quietly, waited for her to fix the issue. I didn't even receive a verbal confirmation that she was in fact adding the missing indredients until another equally rude employee came up to me and, in a condescending way, asked \"are you waiting for something?\" as if I'd never ordered anything to begin with. \n\nIn the end, I left without the latte or a refund out of frustration.\n\nWhen I was working as a server in the hospitality industry years ago, I was taught that when there's a problem, you should acknowledge it, apologize sincerely, act immediately and affirm your customer's satisfaction. \n\nI honestly don't know what to do, I don't think I'll ever go back to this Starbucks again because the two staff members this morning clearly couldn't care less about being of service to the guests that visit this establishment.", "author": "Angel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "This place is a hit of miss. I come here some days for coffee either right before work or late mornings. \n\nSometimes the cashiers are so nice and friendly and others like they just woke up. Always has a group of homeless in front and some days a homeless inside. The shop is small, but at least they do refills.", "author": "M C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-31", "description": "This is a pretty typical Starbucks, located just off of Civic Center BART station. It is a bit difficult to see because it is nestled right next to a hotel. Lines tend to be long during breakfast and lunch so I would highly recommend ordering through their mobile app if you're pressed for time. Staff is generally nice, but there are some hits and misses in terms of the drinks depending on who is working when you go in. There isn't really much seating inside so it's definitely not a good place to study or get work done. This Starbucks tends to be somewhat dirty at time, but otherwise, it's just another Starbucks in the city.", "author": "Lakshmi M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-11", "description": "Two stars for Kev.Wayne, the 1st barista in a minute to get my btl right the 1st time! Miguel, however?! -3 stars because he's a pompous ASS...\n\n1ST - homeless woman asks for some water; he stands there & lies that he can't give her any. How do I know this is a lie? Because I've done it for my grandson (yes, I made a purchase but human kindness is the point here). 2ND - I ordered a venti BTL & a bag, for which I was charged .10; Miguel doesn't check for the bag until after I'm rung up, & of course they're out. Why does Miggy catch an attitude when I requested my dime back?! Ummm, did I extend an offer to keep it?! lol \n\nSorry you're not having the best afternoon, but I've done nothing to you...handing me my dime back (since you wanted to be an ASS and charge me, quite unlike most locations), without my asking, is your J-O-B.", "author": "Amoura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-28", "description": "Friendly service at this location and seemingly a little less crowded than others.", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "The service here is fast and amazing. The baristas were greats especially Luz who took our order. She really made our day.", "author": "Daniel S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-25", "description": "I have a coupon where I bought 5 drinks and get a free sandwich. I cannot used it there because of the dumb Filipino supervisor who wear glasses does not know how to process it. She said I have to buy something in order to use the coupon, but the coupon have it in black and white saying it is FREE. I used this coupon in other Starbucks and there was no problem. I mentioned that it is valid in other Starbucks and she just said good bye to me. WTF. \n\nThe supervisor is straight up rude and incompetent for her position. She should be fired.", "author": "Albert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "I frequent this place 2-3 times a week and am always satisfied. Staff is friendly, drinks are quick, and have always had great service (even at 5am when I'm barely awake). Miggy is awesome!!!", "author": "Nicole B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "#4 of 100 reviews challenge 2016\n\nA smaller location with high, narrow table seating facing Market St., with one or two tables in the corner. This location is at the top of a Civic Center Bart stairway so it's pretty busy. There are two entrances and the line gets long so enter thru The Hotel Whitcomb lobby. \n\nI have worked at this location before my business was officially equipped with wifi and paid a lot for a green tea to do so. On my most recent trip here, after finding the closer Sbux to my restaurant didn't give access to their power outlets, my colleague and I came here. I need juice for my laptop bc who knows how long my internet was going to be out. Why that changed, I don't know. But bring it back, please! I'll buy a green tea from you again!", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-07", "description": "Wanting to get some work done at a place with free wifi, I headed to the nearest Starbucks. Unfortunately, I wasn't paying attention and this is one of the more run down Starbucks since it's right next to the Civic Center BART station. Too lazy to go to another one, I decided to give this location a chance. I ordered my favorite drink: Sweetened Passion Tea Lemonade and settled in a bar seat right next to an outlet. My drink was delicious with just the perfect amount of sweetness. I was able to work without any distributions or distractions for 2-3 hours. \n\nI did notice that there were only 2 power outlets available and only seats at the bar against the window or at the small table in the corner. Definitely not a great space to work, but I came at a time that worked for me.", "author": "Melanie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-05", "description": "It's Starbucks folks! I entered the line and was asked if I was ordering food. They didn't give me much time to think so I said no. Others in front of me were asked for their drink order, but not me and I placed my order with the cashier. I only wanted a pike place. They fulfilled my tall pike in a grande cup quickly and I paid with my app. This place was busy and I came in at the right time.  There are a few tables, but I wouldn't sit here because of the busyness. A subway emtrance is right out the door. Great placement.", "author": "Lashanda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-06", "description": "If you want to wait 15-20 minutes for your drink THIS IS THE STARBUCKS FOR YOU!! \nBonus: They will make your drink incorrectly, but since you're now late you have no time for the correction. Woo hoo!!", "author": "Katie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "milan is the greatest barista! she makes my drink perfecr every time and always with a smile! thank you milan", "author": "Laduram V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-26", "description": "One of the worst Starbucks in San Francisco along with having the least intelligent workers at any Starbucks nationwide. They have signage for advertising the smoked butterscotch latte yet they've been sold out of this item for the past 2 weeks. Common sense dictates that you take down the signage so customers don't ask for this item over and over and over again. Again a totally brain dead outfit.", "author": "Nathaniel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "Eh service. Very unclean though. Lots of homeless outside of doors.\n\nKind of rude cashier, refused to give us change unless we bought something. Refused to sell us water or something small. Had to be a menu item.", "author": "Evan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-14", "description": "Terrible service and general uncleanliness. \n\nThey left my friends' drinks on the counter and never called their names. Why? Because they never asked for them. Instead, their general operation seems to be just leaving customer drinks on the counter and then having the customers themselves figure out whose drinks are whose.\n\nDo yourself a favor and find another Starbucks in the city.", "author": "Yanni L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "Last Sunday, Let me start off by saying my best friend had placed a mobile order bc we were in a rush to catch the Bart. It takes us 12 minutes to walk and by the time we arrive, there are no people in line; everyone was waiting for their drinks. My other friend had ordered in line and his drink was placed at the end of the bar. Mind you, there is only ONE employee who is taking the orders and making the drinks while his other coworker was sweeping and talking other one of their other coworkers. Finally they make my friends drink and my best friend has still not received her drink she had placed an order for. She then politely sees the associate and asks \"excuse me?\" and she still continues to talk to her coworker. She calls out one more time and she just stares at her. Explaining the situation, the associate then says, \"oh!\" and checks to see the order she made earlier, she apologizes and says \"we'll get right on that\" before calling to her coworker who was taking the orders and tells him about the drink. Lady then had the nerve to make somebody else's iced coffee before making my best friend's, only because she saw that he was busy with a customer at the registers. Completely rude and wasted our time. There was one just a couple more minutes way on the same street, next time we'll for sure go to that one instead.", "author": "Jennie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-15", "description": "Sucks so bad. They take forever and today they didn't put brown sugar with my oatmeal (how one forgets to do that is beyond me?) and now my breakfast isn't what I wanted. Starbucks is like fast food for coffee, tastes like shit but sometimes convenient when you need something fast. After they took so long AND messed up my order, I'm not going back for a while. So annoying and the girl wasn't even nice at the register. Like come on", "author": "Tori T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "If you must go to this location, make sure Hailey isn't working as the barista. She makes orders wrong, and then throws all types of attitude at you because you won't accept an incorrectly made drink. Take your business down the road to 3 blocks down to Peets where you won't get treated like crap.", "author": "J B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-25", "description": "PSA announcement: for anyone who goes during weekdays around 7am, there is a potentially blind person who comes and cuts the line at where the door starts. Next, he'll constantly touch the person in-front of him with his walking stick, leading me to believe he is pretending to be blind. What is strange is that he wouldn't touch people with the end of the stick, but would move the stick in a manner that it would touch someone's butt or upper thigh.  For the half dozen times I've seen him, he would always line up behind a woman, and the whole experience becomes quite unpleasant for everyone.\n\nTLDR; creepy blind guy comes in around 7am weekdays. If you are standing in-front of him, prepare for a bad time.", "author": "Andrew P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-17", "description": "It's always something with this store... I go to school across the street and for some odd reason it's never clean and their employees look miserable. It's crazy to think that they'll change their attitude or tone of voice when they know you're a fellow partner but it's all the same. Anyways, drinks are the same and I can't complain about that. Highly suggest you do a mobile order prior to going because it gets super busy.", "author": "Katrina P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-06", "description": "We were waiting around for a show to start and had about 45 minutes to kill.  The lady suggested we go to Starbucks just across the street.  We thought, \"What a great idea!\"\n\nWe walked by the Starbucks and saw about three homeless guys begging for change.  Another one smelling of pot.  It was just not very delightful to say the least.\n\nWe went inside and noticed that their food section was not well stocked.  There was someone taking orders and another person making drinks.  They didn't seem to have a lot of staff for the foot traffic that happened here.  \n\nMy husband asked if I wanted anything.  I shook my head, \"NO\".  \n\nThe entire place was packed, not a single table or chair available.  Tons of shady people inside and outside the Starbucks. Didn't feel safe.\n\nNot sure if I would come back here!", "author": "Darina H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-28", "description": "I've been in this Starbucks many times in the past, but somehow earlier this afternoon (4 PM) they were slow and it took them more than 5 minutes to acknowledge me.  They have a rule about providing a complimentary cup of water.  One has to make a purchase before even getting a cup of free water.  The guy in front of me wanted a free cup of water, and the barista was not going to give him a cup of water.  He then later relented and gave the guy a cup of water.  What does the guy do - he spills some of the water on the floor...sheesh.\n\nI went ahead and ordered my venti mocha frappuccino with toffee nut flavoring...it was okay.  However, I doubt I will come back here again for a frappuccino.  Customer service was a meh (2 stars).", "author": "Carol C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-03", "description": "The owners of this establishment have an awfully poor sense of business and obviously don't care at all about customer service. I bought $15 worth of coffee and breakfast and they wanted to charge me .10 for a bag to carry my hot oatmeal.  This sort of mindset is disgusting to me and should embarrass owners of Starbucks and the Starbucks brand in general. I will never return to this location.", "author": "Leslie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-16", "description": "For being one of the only Starbucks in Civic Center I give you props! \n\nYes there is a long line but they run it like a well built machine! Baristas are always cool, happy and make morning more friendly! I have not had to wait long at all here and coffee has always been correct!  It is connected to Hotel Whitcomb so if you are attending anything there make a right out of their lobby! It is hard to work at one of the busiest SB in the city, I've known some of the students that work hard here while balancing college and they have always praised management here so I respect that! \n\nThanks for morning coffee SB Civic Center!!", "author": "Marie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Smaller Starbucks location inside of a Hotel. Still some limited space for laptops but not much. Good place for coffee.... Not so much for working since it is so small but all and all can't complain", "author": "Anthony I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-19", "description": "I usually don't write yelp reviews for chain stores/restaurants, but when i stopped by this Starbucks, a homeless woman casually strolled in front of me and grabbed a drink from the open display. As she tried to bolt, the cashier yelled \"where are you going?!\" before she swore under her breath and dropped the can by the door. \n\nThe cashier's response? \"I usually jump over the counter, but i was distracted.\"\n\nMad props to the baristas and cashiers for dealing with SF's crazy shenanigans on a daily basis. Very friendly customer service.", "author": "Jessie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "I seldom come to this location because the few times I've gone here, they just don't do the drinks well here. Did a quick order via Starbucks app recently and realized it set the wrong location. Ordered a iced green tea latte. The green tea powder was barely mixed and a heaping scoop was just sitting on the ice on top. Got light ice because the whole cup is filled with ice otherwise, but I guess they offset it here by not filling up your cup to the top with your beverage. Shoulda took a shaming photo...\n\nI know we're not going to Starbucks for quality, but come on. If it's not an immediate need and you can afford the time, do yourself a favor and go to the Starbucks on 9th and Howard instead, they're much more likely to get things right there. The apathy here seems to be very competitive.", "author": "david n."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-15", "description": "This Starbucks was very disappointing. There's flies all over the cafe, sitting at the milk bar. I ordered the new chile mocha drink for the fall, and it was very bitter and extremely spiced. My boyfriend ordered the PSL, and it had an overpowering amount of pumpkin. We had to grab packets of sugar and had to add them to our drinks. I wasn't even able to finish my drink. The only saving grace was that the customer service was exemplary. The employees were very kind. Yet the drinks were very poorly made. Very disappointed to see a Starbucks so out of shape, yet being connected to a hotel. Overall, I wish the drinks had been better and the place had been in a better condition.", "author": "Alahna W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-25", "description": "No charging stations!!!! That new offering that makes Starbucks' even more enticing is not offered here. I just wasted a Starbucks trip coming here. Maybe I can sneak into another one withy cup and charge up.\n\nTwo stars instead of 1 because it's after 3pm, and they gave dark roast on tap! And k dong have to do a pour over or compromise and get shitty Pike. \n\nI better stop writing cause  wasting precious power.", "author": "Xenoneon N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-02", "description": "To get your cup of joe, you usually have to go through the \"gauntlet\" for this Starbucks. First, you could encounter the homeless panhandling for spare change before your enter the store.  Once you get into the store, you hope that you don't encounter a long waiting line. Then you hope you don't encounter a strange person that occasionally might be in the store.  Now with your cup of joe in hand, you have to get pass the panhandlers out front. \n\nJust an everyday adventure here for your Starbucks.", "author": "Al L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-11", "description": "Despite how friendly and helpful the employees may seem, this location rarely ever makes my drink well, or right.", "author": "Bethanie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-02", "description": "Poor service , dirty floor, not outlet to charge laptops and asked for a pen they said they Dont have .", "author": "Simon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-11", "description": "This has got to be one of the smallest SB shops yet. The store space is designated to fit only 10-20 customers in here, not very compatible for a group of more than 20 people. Seating shouldn't be too hard because some customers usually order the item (s) they need and go.\n\nSome of the downsides are:\n1) There are no restrooms available\n2) Nearby traffic & parking situation is extremely horrible\n\nThere are entries and exits to Civic Center BART/MUNI Metro Station right outside along with several bus stops. Although I must confess that the baristas who took my order and made my beverage today were friendly. Some people are talking about how they have encountered rude staff at coffee shops, diners or other dining establishments, this is a very practical situation and very true in certain cases.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "I actually joined Yelp to give this review. Worst service. Worst staff. Rude. Gross. Disorganized. Dirty. Reflects the homeless population around it. Go somewhere else. There's a better Starbucks nearby. This one is disgusting.", "author": "Dren H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-25", "description": "One sympathy star, because I'm softhearted and junk.\n\nBut seriously, the worst service I've ever received at a Starbucks.\n\nI walk up, no line and ask, \"Does your Green tea have caffeine?\"\n\n\"Yes.\" The man at the register replies.\n\n\"Awesome I'd like a large Green tea.\"\n\nThinking the conversation was done, I pulled out my card to pay, used to the quick service that is Starbucks.\n\nBut no.\n\n\"What size do you want?\" He asks.\n\nI blink. \"A large.\"\n\nI should have known right then it wouldn't go well. The first cup, after spilling it on himself (thus the one sympathy star) looked funny right before he got the top on.\n\n\"Is that Green tea?\"\n\nHe paused. \"You wanted green tea?\"\n\nBy the time I got my second cup I vowed I would go to the Starbucks near the Chevon station with the hobos from now on. At least then I don't have to feel irritated, sympathetic and cranky all at the same time.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "Normally I cannot tolerate Starchuck's coffee but needed a fix before venturing past the locals today. Found it possible to keep it on the cheap with a sausage breakfast sandwich -- nuked to perfection. For the iced coffee I recommend skipping their liquid sugar and putting in your own.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-06", "description": "As I go to the different Starbuck, I am usually content with their service. However today me and my girlfriend were unsatisfied with both their service and drink quality. She asked for a marble mocha macchiato and got a zebra mocha instead. I got a vanilla bean with Choco drizzle and got ice and chocolate. They didn't even name the drinks so we didn't even know our drinks come out till later. To be fair, they were busy, but like I said, I been to many Starbuck and maintain their a game and this one did not bring the heat. I'll try again sometime later in the future but for now go to the one near Twitter who do a great job if you have a choice", "author": "Robert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "best Starbucks I have ever been to hands down. the staff is immensely friendly and make a point to connect with their customers. whenever I come here they are so upbeat and happy even though their line can get very long. will always be my go to before work. plus they're always playing some bangers. keep up the great job guys!", "author": "Selena M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-23", "description": "Been going to this Starbucks for 2 months now. And it's just crazy how they only put two employees during their busy hours. Not the friendliest staff but I guess it's because of how busy the store gets.", "author": "Mara O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "I'm not usually a coffee junky, but all-nighters paired with early morning classes make me coffee dependent. I come to this Starbucks because it's the closest Starbucks to my school and I was given a Starbucks gift card some time ago, so why not? Although the line sometimes looks crazy long, the employees here are great at getting people in and out. \n\nI'm terrified of being late to class so on days with long lines I just grab a cup of black coffee. When the line isn't as crazy or when I have more time, I get a cappuccino. Every time I've gotten a cappuccino here it's always been on point. It's been hit or miss at other places, including other Starbucks. Great job to the baristas at this location! \n\nI've always found the employees here very nice and attentive. One time a classmate and I came here after class. It wasn't too busy, and we weren't in a hurry so I ordered a cappuccino. My drink came before my classmates. As I'm sipping on my drink (with the cap off because I love cappuccino foam) I was ranting to my classmate about some assignment, saying how much I disliked something or other. The barista looked at me concerned. I was confused at why he was looking at me. My classmate explained that the barista thought I said something was wrong with my drink since I had the cap off. I told him, \"No, no, no. It's perfect. I just love foam!\" He then offered to top my cup off with more foam! Hands down the best experience I've had in any Starbucks.", "author": "Connie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-13", "description": "Came here to grab a quick grande iced caramel macchiato. First, the baristas ignored me (maybe because I was the only one in line) and were busy chatting and joking with each other. Then, when they handed me my coffee, it had caramel all over the outside of the cup which got my hands sticky. Then the cup was so filled to the brim with ice that two sips was all it took to finish the coffee. The worst part is that when I finished the coffee, I noticed they didn't even mix part of the caramel - a huge glob the size of your thumb was stuck to the straw. Not coming back here again.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-19", "description": "It is a typical Starbucks.  There is nothing wrong of this store.  However the homeless people in front and occasionally strange people inside the store make this place a lot less pleasant.\n\nIt is right near the civic center Muni/Bart entrance and close to the corner of some high tech company morning bus stop.  It does have some morning crowd of young high tech people.  If you just come during the day and night, occasionally you might see some strange people you don't want to be near with.\n\nI think that is the same problem for all stores on Market street near 6th/7th/8th street.  It is really the san francisco city government's fault that the government just let so many homeless (or maybe drug) people sleep and hang out in this area.", "author": "Jon W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-28", "description": "I wanted a soy chai... thankfully despite all the bad reviews I got what I wanted without incident....   granted.. it was early evening so there were no crowds.", "author": "Vicky T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-16", "description": "There is something about this Starbucks location that irks me. Maybe it's the fact that it's right in front of one of the Civic Center Bart entrances with the many transients lurking about. Maybe it's the strange, obtrusive layout. Maybe it's the fact that my office used to be located to a much nicer, more efficient Starbucks just a block and a half away.\n\nIf you're headed here, be prepared to run into some unsavory types of people waiting outside, trying to guilt you into giving them money to find their crack habits. Just keep your head down and make your way in.\n\nIf you enter through the main entrance on Market Street, you will most likely encounter the line and have to cut through it. The line wraps around the store because honestly, this place looks like it was built for only handling a max of 6 people in line. However, with all of the businesses around, on too of the hotel it's connected to, this place is always full (I'm thankful for the times I stop by and it's not packed).\n\nI was annoyed last week with the service I was getting. I know I enunciate clearly when I give my order, but it does not help when the girl taking my order asks me what I want and proceeds to flirt with a male coworker, then turns to me again and says, \"Oh, can you repeat that?\" Girl, I did not stutter.\n\nI miss our old go-to Starbucks at Fox Plaza... *sigh*", "author": "Melissa D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-20", "description": "I never go to Starbucks so I don't know the lingo. I tried to order and instead of taking the order, the person working just kept repeating their terminology back to me. This is how the conversation went:\n\nMe: \"Hi, may I please have a large brewed coffee?\"\nWorker: \"Grande.\"\nMe: \"large brewed coffee.\"\nWorker: \"Grande.\"\nMe: \"Sure.\"\n\nWorker: \"What kind of roast?\"\nMe: \"Light\"\nWorker: \"Blonde.\"\nMe: \"What?\"\nWorker: \"Blonde.\"\nMe: \"light roast.\"\nWorker: \"Blonde.\"\nMe: \"Sure.\"\n\nNow I remember why I never go to Starbucks. \n\nI think the intention was to create a language that seems cute and makes customers feel like \"insiders\" or something. But how it actually plays out is that you have some disgruntled worker who just repeats (what seems like) nonsense words to customers to make them feel unnecessarily confused.", "author": "Pillowsblanket S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "This starbucks is conveniently located inside the Hotel Whitcomb which was a very strategic thing to do. I was a guest of the hotel and it was simply awesome to just come downstairs and get my morning cup of joe for breakfast and catch up on work on my computer.\n\nThe whole 3 hours I was there it was pretty busy but still easy to concentrate on what I needed to do. I ordered some coffee and tea and my usual snacks and it was nice to see the staff remaining helpful and smiling through out the whole morning. \n\nThis morning crew was delightful to deal with and very attentive and professional. I love coming to Starbucks where the atmosphere is warm and inviting. It's true that there are a few homeless that come in and take up seats but some actually buy drinks and don't bother anyone and thats alright with me.\n\nIf your in the area or a guest at the hotel I highly recommend this Starbucks because they are friendly and on top of their coffee making concoctions!", "author": "V W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-28", "description": "The employees were nice but the service was ok. My drink was not made right and I asked for it to be redone, still didn't taste good. It is so busy so it is very dirty. They have a lot of people going through the business.", "author": "Lidia A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-15", "description": "mmmm black tea lemonade is the best on a hot summer day ;)", "author": "Jennie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-06", "description": "Whomever the manager that runs this location needs to focus on his employee named \"Luis\" everyone was very nice and give good customer service. But this barista \"Luis\" was so rude he slams stuff behind the counter not smiling and when I asked him is this my London fog but with classic syrup he said it's not London fog of its not with vanilla syrup. I said I know that I've been ordering it since the beginning. I'm a Starbucks member and can testify how many drinks I've ordered. I think that the guy at the register who took my order didn't know what the London fog and gave me English breakfast instead of earl grey but as I was trying to explain that to LUIS he didn't even bother listening and said that's not a London fog. I got that!!! And didn't say thank you and when I came back for my breakfast sandwich and ask him if that's mine his gave me attitude and said I don't know. I said is it turkey sandwich? He looked at it and gave it to me and said I guess look at it! If my google bus is not around the corner from their store I would not go back here! I manage hospitality and this is not the kind of behavior patrons should be treated", "author": "Kei D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "This is the worst Starbucks I have ever been to! When I first went up to the cashier to order my white mocha, the man behind the counter wouldn't even acknowledge me even though I was standing right in front of him. When I finally did say something he acted really annoyed. After ordering I went to a table to wait. A couple minutes later he called me back claiming I forgot to pay. I told him I was pretty sure I did, but then again I had been making a lot of purchases that day so maybe I was confusing it with something else. I handed him my debit card and went back to my table after the transaction was done. \nAfter 10 minutes of waiting and still no coffee (it wasn't even busy), I went back to the counter and asked a woman where my white mocha was. She apologized and told me nobody wrote it on a cup, but then made it immediately. I was willing to let all of this go, but this morning when I looked at my debit card statement, I was right! They did charge me twice! So I paid $7 for a small latte and the worst service of my life. That man needs to be fired!", "author": "Hailey R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-10", "description": "Free WiFi - check\nTables and stools - check\nPastries - check\nHomeless - check\n\nThis place is ok. Just ok. I've had better, and the inconsistency with the drinks is what will keep it at a three star. I've had some spectacular drinks, and then I've had some bitter as hell stuff. Suffice to say there are some drinks that I will not purchase at this particular establishment. I have come to know at least one person who does certain drinks right, but he doesn't work all the various times I may come in.\n\nI've never really stayed long to utilize the WiFi like some people who stay here for hours with their computer/tablet/etc, but it's free which is nice. You just have to agree to the terms and you are through. And I appreciate that they have reorganized the few tables they have, because the small store looked even smaller and was way cramped before. Otherwise it's always, but be prepared for the panhandlers out the door.\n\nBy the way, you can request water for free, and at any size. If they try to say you can only have a tall, they are lying.", "author": "Nzugu K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-27", "description": "Attached to a hotel in the civic center district. Although the Starbucks itself is nice there are a lot of homeless people who come in to ask for money. There are no bathrooms but you can just use the bathrooms in the hotel.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Dear Starbucks in the Civic Center:\n\nIf I wanted a cup of joe after getting off the train, I'd rather come to you.  You're right outside the Civic Center train station, efficient, and accomodating.  Yes, you're a very small starbucks, where you no longer allow customers to hang out around the corner too long with their laptops (safety issues), but you do ask if we want any pastries and room for cream in our coffee.  I would rather walk an extra 2 blocks to get my drink than the one at fox plaza because you're  a trustworthy starbucks.  I envy all the people who work a block away who can come to your location.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-27", "description": "TIP #1: There is no bathroom here. You'll have to sneak into the bathroom in the adjacent hotel. \n\nTIP #2: You probably won't find a seat in this tiny Starbucks. It's usually overrun with tourists who are staying at the hotel or homeless people. \n\nThe baristas seem competent enough--it's just the ambiance of this particular Starbucks that is really, really bad. First you have to to squeeze yourself into a tiny chair and balance your drink on a tiny table and try not to hit anyone else around you. Then, you have to endure the BO of the homeless person next to you. Finally, you start to see the flies and the trash lying around. \n\nOn rainy days, the air gets thick and musty and it's hard to breathe. When an employee has to take out the trash, they have to wheel the giant container out into the cafe, all the while bumping into people...\n\nDefinitely take your drink to go.", "author": "A.L. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "This starbucks is on the corner across from the Orpheum Theater.\n\nBefore a show, this place is PACKED with quite a long line.\n\nThe workers somehow maintain a good attitude in spite of a hectic crowd.\n\nThis and the hotel lobby attached to it are a good place to hang out before a show at the Orpheum, especially if it's cold and windy out and seating hasn't opened yet.", "author": "Chia C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-13", "description": "Meh. Not one of the best Starbucks I've been to. Sorry folks, you're getting one star.\n\nIt's conveniently located on Market near my bank, Chase, but I have yet to go into this Starbucks and not see trash on the floor and counters, a seemingly carnival ride wait of a line, and stuffy, musky environment.\n\nTo make things a bit worse, the drinks are luck of the draw. As a prior Barista/Partner, I have the curse of knowing what drinks should taste like, and let's just say, there have been times when I've gotten drinks that taste nothing like what they should.\n\nPrime example: I ordered an Iced Venti Hazelnut Coffee with Soy. Simple beverage: simple to record, simple to make, takes little time to make. The ice coffee is a different consistency and taste than their brewed coffee... so tell me why I received brewed hot coffee in my plastic iced cup, filled with soy and ice. By the time I got my drink, it was half full of water because of the melted ice, the coffee tasted like crap because it wasn't what I technically ordered, and it was just a bad experience, altogether.\n\nI would have waited for you to make more iced coffee, folks.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "I come to this Starbucks all the time as it's the closest to me. It's a smaller location adjacent to a hotel. The staff who work here have always been very nice and polite, even to the less appealing transient customers who just need a place to sit and rest. There isn't a lot of seating or space, so I just scan my Starbucks card, take my drink, and go.", "author": "Dorothy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "Two words come to mind when I think of this Starbucks location, Ghetto and Smelly.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "I'd say the nicest Starbucks employees I've encountered... ever.  Is that better than bathrooms?  Maybe.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-29", "description": "The manager here is so rude, he is a shame to all Starbucks partners and should reconsider how he talks to customers!", "author": "Noemi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "Got some coffee last week and the service was good. The clerk was very helpful, I wasn't sure what I wanted and she told me in detail what each drink had in it. I was looking for a drink that was low in fat and good for me at the same time. The price was very reasonably. She smiled and thanked me for my order .", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-11", "description": "This place does not care about their customers. Our office just moved into this area, and we were looking for the local Starbucks. We came across this one and some co-workers and I went in. We were waiting for our drinks to be made when I asked somebody for water. They told me that I had to get back in the line to order some. The Starbucks that I usually go to has a self-serve station that offers water. They didn't. So, I went back in line and ordered the water. They put my water cup in line behind everybody else's order. \nMy coworkers and I decided to come back today to order some mid-day delicious beverages. After waiting, they told me they only had enough of what I ordered to make a half-cup of the venti so they filled the rest with something else. I said it was fine.  My coworker unfortunately ordered the same thing I did, which they had ran out of, so she had to order something else. I was expecting them to compensate her for her loss by giving her a ticket for a free drink that Starbucks usually gives out to unhappy customers to redeem next time to make up for the disappointment. They did not. So, I asked them for one. They told us we had to wait for them to call the floor manager to authorize it which was going to take 20 minutes. Being that were  on our break, we did not have time to wait. So we were left unhappy for the 2nd time.\nBottom line: I am letting my whole office know not to come to this Starbucks location again.", "author": "Zainab A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-20", "description": "Lackadaisical staff.  6 people in front of me and waited in line for 15 min.  I go to Portland Starbucks everyday which is much busier and also much faster.  No recommended if your in a rush.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-11", "description": "Got one of the $5 lunch boxes.\n\"Anything else?\"\n\"No thank you\"\n\"How about something to wash that down?\"\n\"No thank you\"\n\n(Thinking: Um, I already said, \"No thank you.\" Nice way to make me feel like a valued customer.)\n\n(1 star for customer relations; 3.5 stars for the lunch box)", "author": "Charles B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-10", "description": "I give this Starbucks only three stars simply because they don't have a restroom inside.  You actually have to go inside the hotel and use the restroom - which is a little weird because there's hotel security eyeing you. lol  The place is small and its gets crowded.  The line for drinks gets pretty long during rush hour.", "author": "Nixon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-09", "description": "I want to start off saying that I always go here and have not had a great experience or a bad one until now. This morning I arrive to get my pick me up of the day, seeing as how I don't get any sleep these days, I wanted an extra shot on top of that. So I stand in line wait my turn and then when I order, first the cashier misinterprets my request, of here is my card and can I also get change for a five, for paying with the five and then the rest on the card. He fixes the mistake and life moves on. Then when I see my drink at the counter it was not what I thought I had ordered. I wanted it cold so I look at the person making drinks and saw I wanted this cold. \nHe responds with a rude roll of the eyes, and a shitty answer of \"well you should have said cold when you ordered it.\" And I respond \"I thought I did sorry.\" I really did not need this kind of attitude from this employee in the morning when I'm trying to start of my day with my best foot forward. I hope that this employee can readjust his attitude, stay home or get a non-customer service job. I asked him also when I got the cold one if it was soy and I got the dirtiest look and another shitty response of \"ya it's soy\" with a side of unprofessional attitude. I did not appreciate it and will be on the hunt for a new coffee shop in the area with a better attitude.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "Mad props to this starbucks. It is one of the busiest in san francisco yet the baristas keep their cool and make amazing drinks as fast as they possibly can. Although there may be a line, at least they are open. All of the other coffee shops in the area are closed at 8am.", "author": "Tim K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-29", "description": "SBUX coffee is obviously consistent across all locations, so this review is for the store.\n\nIt's so eff-ing crowded in the morning that it's impossible to get a simple drink in under 5 minutes. Not a great plan if you gotta catch your train/bus/shuttle in a hurry.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-01", "description": "still hate this location, there's another one a block down market with friendlier staff, more seats, and cleaner floors and surfaces", "author": "Amara B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-12", "description": "This location fails to escape the general seediness of the area.  Needs more light , brighter colors, friendlier staff.", "author": "Joyce J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-23", "description": "Most Starbucks aren't inherently dysfunctional. They're too controlled by corporate to have any sense of self-expression, let alone projected recurring patterns of family psychology among its employees.\n\nNot so the Starbucks near Civic Center BART. Like the erratic, frenetic neighborhood where it's tucked away, this Starbucks is a lesson in chaos and angst. The baristas and cashiers, god bless 'em, are a little like art-school drop-outs from the late 90s. They don't mistreat the customers, but they're so engaged in co-worker drama, they don't even take the customers in at all.\n\nAnd this is way too small for being the only Starbucks in a several-block radius. The line butts into the cream counter, which causes great strain among those with caffeine in hand and those still waiting for their fix.\n\nAnd, of course, I'd rather not support Starbucks, but this is the nearest place to my work for me to get a decent cup. But it's not always a decent cup is the deal ... so I'm in denial that I can't rely on this Starbucks for a consistently good cup of coffee.\n\nOh, the trials of modern life.", "author": "maureen f."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-06", "description": "This is the default meeting spot for me and an old friend of mine. We're always like, \"Tomorrow, 6, coffee at the RAHHMUHDAHHH.\"\r\n\r\nIt's the trashiest of all Starbucks. Inside the Ramada hotel in the Loin. \r\n\r\nOnce I was standing outside with my coffee, and this skinny little strawberry came up to me and was all, \"I have diabetes. I'm really sick. Can you gimme some change?\" \r\n\r\nI got on my diabetes soapbox. I was all, \"ooohh aww awww girl. I ain't giving you no change for being diabetic. I have an orange in my purse. Have at it.\" \r\n\r\nOf course she didn't want it. Oh well. Maybe she was in hyperglycemia or DKA. She was really skinny.", "author": "Jessica I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-30", "description": "Consistent with other Starbucks.  \n\nUnfortunately it is smaller so there is very limiter seating and not much room for the line ever present at Starbucks - it's the smallest one I've been to and I've been to well over 30!!!", "author": "Carolyn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-22", "description": "Tiny location space with long lines. Considering how many Starbucks on nearly every corner, if you want quicker service I would find another location. It has been so busy sometimes that I purposely waited outside while friends went in to fetch caffeinated personality enhancements. When I did go in, the service itself was average at this location due to how busy they always seem. The facility however was untidy and the tables were not quickly cleared for new customers.", "author": "Terry C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-08", "description": "I will never set foot in this location again! I've had \"misunderstandings\" with the staff so many  times already. The first time, one of the barristas wouldnt make my drink extra hot and wet on to argue with me about the requisite temp and all this crap that I honestly dont want to hear about! Make my freaking coffee the way I want it...and if Iwant to burn myself....then so be it! \n\nEverytime you go in here...it's crowded as heck!! OMG, can you not make it any bigger? seriously? Do we all need to be on top of each other? The take ou t the big trash bin outside every hour it seems like. B/c everytime I'm there, someone knocking people over w/ the huge trash bin to take it to the curve? They are super slow as well, I can't ever get out of there in less than 15 minutes. \n\nTo top it off, what did it today was that I asked for my usual Carmel Machiato and the girl making them doesn't know how to make them! I asked for it w/ specificiations, might as well since im paying more than $4 for a cup of coffee, and they always mess up. I walk a few blocks and taste this bitter thing inside of my cup, so I figure they messed up on my order and walk back. When I get back, they're all frazzled as to what to do...and I'm like give me what i paid for. The black chick working the espresso machine doesn't even ask me how I like it, only what I got. When I get my coffee back I get something half full b/c she gave me half a cup of foam! Then I taste it and it's bitter as hell...and so.. I finally figure out that they did get my order correct the first time, it's just that the chick doesn't know how to make blended coffee drinks :( FML. I just spent $4.25 to get the worst tasting cup of whatever crap she blended..\n\nDont go to this location, they dont care about pleasing their customers, and they sure dont know how to make yummy blended coffee that I expect from starbucks.", "author": "Ana F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-17", "description": "I think this Starbucks got rid of its A-team and replaced it with total D listers lately. I come in here almost ever morning right at the morning crunch time (around 8am) and the line is super, super long, but has always moved so, so fast.\n\nIn fact, they were so fast, that I would think of them every time I found myself stuck in a random, suburban starbucks where even though there was no line, it would somehow still take longer to make my latte than it would here at rush hour. \n\nBut alas, no longer. Third stringers - get it together.", "author": "J J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-20", "description": "Dirtiest Starbucks I have ever been in. Also, the cashier was a bit rude.", "author": "Laura L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-14", "description": "I go here because it's on the way to BART in the morning and unfortunately it's too early for any non-chain (AKA better) coffee shop around to be open. It's always full of people from the hotel next door and therefore takes way longer than it should to get a latte. I have on numerous occasions seen the staff be exceptionally rude to patrons from said hotel that do not speak much English. If you are going to work here, shouldn't you understand that comes with the territory? Also, if I wanted a tall(small) latte, I would order it. There is nothing I hate more than a grande(medium) latte that is half foam on top. A little is correct: I shouldn't have to tip my cup back nearly all the way to get my first sip of coffee.\n\nAnd, this is SOMA, not the Tenderloin. It may be close, but trust me, it could be a lot worse if it actually was in there.", "author": "Jennie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-14", "description": "I have no problems with this Starbucks. This is my rating with my experience with them for now.", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-12", "description": "Great and fast staff! This used to be my regular spot but I am hardly now in the area. Always packed in the mornings from the early workers and the tourists from the hotel but the crew keeps the line moving.", "author": "John P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-12", "description": "Usually packed with tourists from the nearby hotels, its still a good place to grab coffee when Blue Bottle in Mint Plaza isn't an option for me. It's Starbucks, so you know what to expect. I've never eaten anything from this one, so no comment there.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-08", "description": "I normally don't yelp about fast food chains, but I really don't understand why this place gets the reviews it does. Sure, it may be a bit smaller then the other Starbucks around San Francisco, but I don't think the quality of seating ambience could challenge the friendly and warm service the associates here exude. Since I'm a student at the nearby Art Institute, i've been coming here almost every morning I'm here for school. The associates here have gotten pretty much used to me- they know me on a first name basis, and generally are ready to go with my order by heart. The register associates are always smiling and ready, and the service is fairly quick. A shame that it's stuck in the horrible area of the civic center. But can you blame them for that? Nope! And I'm glad that they're here. :)", "author": "Kero D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-07", "description": "This is by far the most unorganized Starbucks I have ever been to. The morning staff is irrelevant at their jobs. They had a staff of 6 today (normally it's around 4-5 employees) in the morning and still couldn't manage the line because the staff was sluggish and attempted to make small talk to everybody 24/7. I understand they're just trying to make the customers feel at home, but the staff should have the common sense to know that most customers are trying to get to work in the morning and just want their coffee asap. Furthermore, the staff at the cash registers kept leaving their posts to refill coffee cups or wander aimlessly around looking for who knows what when there are 1 or 2 very capable employees in the background just dozing off at their jobs....and they wonder why the line is always so backed up in the mornings...Management was completely ineffective at managing anything. Seriously, the floor supervisor looked the most confused one of all most of the time. He's got 0 common sense when it comes to managing a small staff....way to go Starbucks management training...guess they just promote anybody to management nowadays. Safe to say, I will be moving my business to the Starbucks down by the Cheveron on Howard St. as they have half the staff but moves the line twice as fast.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-13", "description": "I came here twice during Frapp happy hour in May with my boyfriend. The first time it was alright, we had to wait in a long line and they couldn't seem to figure out what I meant by coconut caramel frappuccino, but I bit my tongue and went on my way. The second time we ordered drinks, they asked for our names for the cups, my boyfriend told them his name and the dude wrote the wrong name which sounded similar. I corrected him and he said. He said \"do I look like I care\" in his gay middle eastern guy accent. (nothing about gay guys or middle eastern guys, he just pissed me off). I was like \"whoa, buddy.\" and I got my smart attitude and said \"what if someone else comes up with that name and you wrote the wrong name\" he says \"your drink is the only drink at the bar honey\" and I kept going like \"I'm just saying, what if you cause a confusion...\" and he said something like \"what if he dies or why don't you just die\" I wanted to slap him because he was being so rude. Lucky for him, my boyfriend kinda calmed me down because he didn't want me to make a scene and I just wanted my damn drink, but I was so pissed off and walked away muttering stuff to my boyfriend, then he keeps telling me it's alright and calm down. At this point am I so angry, my eyes start tearing up. I keep staring back at the dude and keep muttering stuff. The barista overhears me and thinks I'm talking to him. I told him that his cashier was saying stupid shit. then he yells back \"I was just kidding!\" and the barista calls him by his name and tells him \"stop scaring the customers\" I get my drink and storm out of the store. I tried my drink and it didn't even taste right, it just tasted bad from all the emotions I had just gone through. It was a little watered down because the guy didn't even write it properly, he wrote no mocha on the mocha coconut when the only thing I didn't want was chocolate sauce on top. My boyfriend tried to cheer me up by giving me his java chip, but it was too late, I was pissed off and it ruined most of my day until I got back to the bay later that evening. Super long story short, I will not ever return to this Starbucks ever again. Point blank.", "author": "Erika B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-25", "description": "As I've been going to this place now for I can say 3 months plus, I've noticed that if you're a regular they get your order in when they see you in line. That's a plus for me. They also know your order at the register if it's someone who's used to making your latte each morning. The ones that usually make the coffee aren't great at the registers, so that's when you have to check the price they charge you.\n\nThe worse I've noticed is during the summer and the lines can get long. All the tourist end up getting coffee in the morning. Art who runs the shift in the morning is pleasant. He gets my order in right away so I'm not waiting a long time. \n\nThe only bad thing I have to say is that they don't have the stoppers for you to grab and have to request for it. Oh, and it would be nice to learn their names if they had name tags on them. Oh well, you can't have it like Mc Donald's with name tags. \n\nSide note: If you had the Starbucks gift card you can register it online for free 2 hours of Wi-Fi each day. AND if you use your Starbucks card and it's registered you get a little bit of a savings on your HOT beverage each morning.", "author": "Jen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-16", "description": "Im a fairy patient customer i mean maybe it just me but no matter how many times i order first my friends drink always comes before mine. Im stuck in class 4 hours at a time with two breaks so id prefer not to use it getting a drink. My friends are like wheres your drink? Im like either saying its not done yet or its been sitting there for 10 minutes. Then theyll be like well ask for it but I hate being naggy. I mean i think the most ive ever done to be disgruntled was rolled my eyes. Ive had better experiences.", "author": "Galen W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-04", "description": "The barista here, Merwyn, is the best!!! He made my soy white mocha to perfection. It wasn't too hot, but not too cold. Just perfect. It tends to get busy because of the broadway show, Wicked. My group and I from school were doing our project here for hourssssss and got nice service from the Starbucks staff. It is very clean and the garbage is taken out frequently. If you have at&t, you'll get free WiFi, which is great! Come here and look for Merwyn. Only downer, no bathroom inside this Starbucks. Make sure you bring your Starbucks receipt to the hotel next door to use their bathroom. =)", "author": "Abby A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-15", "description": "It's kind of sad commentary about the offerings in the area that this Starbucks is always always packed.  I come here when I need a cup of coffee (slightly) better than Cafico's but don't have time to get myself to Blue Bottle on Linden.", "author": "Leo C."}
