{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "First of all, you got one busy street !You got a lot of people coming in! Yes you got all walks of life,you got the haves and the have-nots! What I saw today was simply a work of art you have the store manager Miranda Johnston deal with some very difficult people in the most professional manner possible. Put it this way you want a person like this to watch your store and to make you feel comfortable without raising suspicion that the other customers and everything ran smoothly! Oh and for the guy that thought he was going to steal something she had an eagle eye on him the whole time doesn't happen but it's nice to know that people are watching out for you!", "author": "J.Darryl G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "Can you give zero stars?  Absolute disgrace.  Shit all over the floor.  Homeless folk sleeping on the benches ... inside.  A line of non-customer indigenous SF druggies waiting for the bathroom.  A garbage bin overflowing with garbage in the ADA compliant disabled lift.  Did I mention how filthy ... and unsanitary?\n\nStarbucks (and San Francisco which tolerate and enable said indigenous behavior) should be ashamed and appalled.  Visitors were aghast when they walked in ... and most walked out.   The espresso tasted like dirt water.  I'll bet my right thumb they don't even clean the machines.  Never fucking again.  Any Starbucks.  Ever.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-09", "description": "This is the unhappiest Starbucks I have seen in a long time.  Crowded, unhappy staff, unhappy patrons.  In the morning the people waiting for mobile orders form a cranky mob.  Today they sweetened my drink (I've never ordered a sweeten drink in my life) - rather than get it remade I left just to escape the miasma of unhappiness that permeates this location.\n\nGo to Peet's across the street are one of the nicer Starbucks in the area if you can.", "author": "A J B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-26", "description": "Drinks are good but they are so SLOW it is not funny. Even did a mobile order and still slow. My husband and I went there twice as it is the only one near our hotel. Both times Slow as molasses.\nAlso limited seating. Also both times most off the tables were dirty. So surprising- in Chicago and other cities the baristas really move - here is pretty inefficient.", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "Easily consistently the most filthy Starbucks I go to. The exterior door hasn't been painted in years. Always food all over the floor. Worn paint everywhere. It's just gross. Sorry.", "author": "Robert E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-27", "description": "Terrible service! \nI was having my afternoon macchiato today at Starbucks when I overheard an employee named Aimee deny a customer the bathroom code because they hadn't purchased anything yet. The customer actually said that she was going to purchase a coffee after she uses the restroom but Aimee still refused. How humiliating!! You gotta go when you gotta go! What a terrible experience! \nRestrooms here are dirty anyway, staff should clean it at least hourly. Specifically, maybe Aimee should clean it hourly to keep it presentable for the customers she decides to give the code to.", "author": "Bianca L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-07", "description": "I hate to complain; that's not true...sometimes I feel justified.\nWent in here today to buy lattes and pastries for my team; would have turned out to be about 11 orders including mine.\nAssuming $8 each. Before I could complete my order I asked the lady if she could break my $100 (that's how I roll) said she couldn't take it, but before I could say it was at least an 75-80 dollar order she blurted out no!  But there's a Wells Fargo 2blocks away..yeah there's also a Starbucks in there and if I had wanted to go there I would have!\nI'm upset I didn't get my latte", "author": "Craig G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "Okay soooooo.....I come here pretty much every day, multiple times throughout the day (as you can see by all my photos) and let me just say.... I MISS THE OLD CREW!  Nothing against the newbies at this location, but something is pretty off a good majority of the time.  \n\nThis morning, there were at least 4-5 employees behind the counter, however, only 1 person was focused on making drinks. I get it, there is 1 oven and a small space to make beverages, BUT it should not take 10+ minutes for a customer to get an iced coffee and a breakfast sandwich.  Most of the time it seems as though the communication between staff is nonexistent.  In at least the last month, I have either had my drink forgotten about or it has been given to another customer who ordered well after me, what happened to calling out the drinks?! Can we keep that consistent please! \n\nI miss Mikee, no clue where he went but if you are out there reading this, PLEASE COME BACK!! Some of the other ladies that work at this location are awesome and super sweet (I don't want to put them on blast =) ), having a crew that knows you and your drinks are hard to come by.  As for the rest....I could do WITHOUT....sorry =/", "author": "Sabrina J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-05", "description": "The slowest and most incompetent baristas I've ever seen. They seem unwilling to serve anyone and act as if the job is beneath them. I had to walk out ( again) after waiting for over 10min. \n\nDo yourself a favor and go to Peet's across the street!", "author": "Vlad O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-11", "description": "I come to this Starbucks every morning and while most of the time it is relatively pleasant this morning was horrific.\n\nNot only was the staff using the wheelchair lift to take out garbage while someone in a wheelchair needed it, the purple-haired woman who took out the trash did NOT wash her hands before going back to serving drinks. Unbelievable. Will not be coming back here ever.", "author": "Rizzo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-17", "description": "Rachel was great but turning the oven off one hour and 15 minutes early is absolutely ridiculous. I was about to buy 8 breakfast sandwiches aka $40+. They were unwilling to help or give reasoning except to blame management because that's the protocol. How much power did that actually save?", "author": "Maddie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-31", "description": "I've been in this place 5 times.  Floor is always unswept even when the place is almost empty.  Service is always slow.  Today the barista yakked nonstop to another customer -- who already had her drink -- while making drinks for me and the person before me.  This woman, the barista, never shut her mouth for one second.  Clearly the personal conversation was far more important to her than actually doing her job.  I will NEVER go into this store again.  Store manager, if you read this review, the barista's name is Shannon and she is a terrible advertisement for Starbucks.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-06", "description": "If you like to guys make money stop closing earlier then yelp ours or update the time :", "author": "Dennis Uluç' T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-25", "description": "Horrible customer service. The girl behind the counter was more concerned with talking to a friend near doing her job. Plus I asked for soy milk (twice). Finally was told I couldn't pour it into my own coffee. They had to do it. Its not f***** gold. Im 47 not a 5 year old.....Avoid this place it is really dirty too probably because the people working there are too fat & lazy to work.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-10", "description": "This Starbucks is horrible. Walked in about 10 am first off the manger lady was very very rude and she looks like a guy so I didn't know how to greet her. Secondly Starbucks one of the biggest coffee company's in the business didn't have change for 100 dollar bill. As I worked in a coffee shop before, a popular coffee shop like Starbucks I'm vanness where there are a lot of working people should have change especially since they have been open since 5-6 am. But the managers were very rude and so was staff acted like they didn't care about my order or that I was a customer.", "author": "Erik W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-15", "description": "This is a very small hole-in-the-wall location. It is a homeless hang out. Today I went in there and the AC was broken and/or turned off which was killer. It's always dirty with stuff all over the floor. However, oddly, I do like the music selection here morethan at other Starbucks.", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-02", "description": "This place is near my office, so I have tried to make this place work but can't.\n\nI usually come for my Chai Latte, which is the only redeeming thing about this place. The service is always a little off and tends to take longer to order than other shops. \n\nIt's a busy Starbucks, so there are the lines and then there are the lingerers. There is usually a lot of confusion going on, I've had people attempt to take my drink for theirs. Is your name Rebekah? I don't think so.\n\nMaybe it's the layout. It's a small awkward space with stairs that go up to the main ordering level. \n\nThe worst part is the sad little bacon breakfast sandwich on bread that is supposed to resemble and taste like ciabatta. It was terrible.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-07", "description": "Ordered a green tea latte, got a plain green tea. Ok no worries, kindly asked for the green tea latte version like I ordered. The barista pissed made a chunky green tea latte unmixed with powder stuck to the cup. \n\nIf you hate your job so much, use Indeed. It's a great way to find something more suitable, maybe with less customer interaction, you know since you're kind of a b****.", "author": "Josh R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "Garbage. Very, very slow. Had to come back twice for mobile pick up to find out they forgot about my order. A good 30 minute window. Working across the street, this happens often here.", "author": "Rudy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "They have horrible customer service and dont know how to greet at all. Its fairly quiet in there though.", "author": "Joel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-08", "description": "This is probably my favorite Starbucks in the area. \n\nSmall, cozy interior with 6 seated areas (with plugs!), 4 bar stools, and an open space for lining up (because there is always a line).\n\nI like coming to work here when I can snag a seat, which isn't as hard as other Sbux locations that are designed to kick you out as soon as you get your double shot vanilla non-fat latte.\n\nDesign is minimal and the bathrooms are clean, just what I expect from a Starbucks.\n\n---\n\nDistinguishing factor: Starbucks with a comfortable interior and plenty of seating given its small size. Beware of the line", "author": "Nick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "My Favorite Starbucks Stop in SF\n\nSITREP\n\nI love hitting this Starbucks when I am San Francisco.  If there is space, I will flip open the laptop and spend an hour catching up on urgent emails and get info from online that I need for the afternoon meetings.\n\nTHE SETUP\n\nThis building in on a hill, and since it is recessed a bit into the hills, the back door accessed on Bush Street is actually at a higher elevation than the front door on Van Ness.  The result is that the main store level - the cashiers, the product-placements, the coffee condiment area, etc. - is at the higher elevation.\n\nDISABLED ACCESS\n\nSo what is really cool & admirable about the configuration of this store is that it makes disabled-access extremely convenient from the Van Ness door because of a wheelchair elevator-lift.  \n\nHOLIDAY BLONDE\n\nI love that they have the holiday brews out and my favorite is the holiday blonde.  I even enjoy this better than the regular Blonde Veranda.  \n\nMUNCHIES\n\nThe Greek Yogurt with honey & granola is definitely a delicious light option.  But I find myself going more for the Hot Panini Turkey Rustico sandwich which is absolutely scrumptious, even more so when heated.\n\nSTAFF\n\nI absolutely love the staff at this store.  They are all extremely professional and pleasant.  The evening shift manager Shana is an absolute doll and one of the nicest people you could ever hope to get coffee from.\n\nTHE LOWDOWN\n\nA great stop on Van Ness, especially if you need to spend an hour catching up on messages.", "author": "Michelangelo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-25", "description": "This Starbucks has gone absolutely worse thru the years. I work down the street and used to frequent this Starbucks and the staff knows me. Since they changed staff, I quit coming here. I go to Starbucks downtown before heading to work and I need one I get it from further down. I've gotten 4x from this store it failed me so freaking bad. They never had green tea latte and I'm always force to get something else but it taste nothing like other stores. You failed me once, I let it go. Failed me 2 times, bad drinks and bad attitude. I'll leave everything up to you to think. I would give a -5 star if could", "author": "Gladys L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-13", "description": "Hey do want non-personal, borderline rude service? Please come to this location.  Lesley, who ran the register today, seems to lack the basic use of the words \"hi\" and \"thank you.\"  \n\nI worked for Starbucks as a manager and would not tolerate this level of service.  Note: you are not being inconvenienced to work at your job especially when customers (3 in a row) has done nothing to warrant this type of behavior.\n\nThe barista on this date at about 4:30p seemed tired and disinterested, but not rude.  I'm really disappointed that the Starbucks experience does not exist at this location.", "author": "Stan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "No line, easy to order. Sis and I split a Venti Java Chip with soy and 2 pumps of peppermint http://www.yelp.com/user_local_photos?userid=CAveDmi9tYg3Gbs9VVnm2Q, tastes like mint chocolate chip! Yummmmm. Not a ton of seating but I only came in for my drink.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "Moved to this neighborhood over a month ago, was glad to know that there was a Starbucks near by. Was hoping to claim this as my new Starbucks. What a huge disappointment. The store seems to be challenged in 2 ways: Service and function.\nThe staff is  moving but lack system and proficiencies. There seems to be constant state of confusion they seem to be unaware of. This could management complacency. \nStore layout and logistics can also be a factor. But after standing in lines many times watching the silliness. I have walked out. This is not my Starbucks.", "author": "Ralph J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-15", "description": "The staff at this particular location are pretty friendly for the exception of one barista. I couldnt get her name but she is an older woman who works there.  I ordered three drinks so i asked her if i may have a drink cadi. She threw the cadi at me and continued to make drinks. She announced my name for the first drink. She didnt announce my name for the second drink but merely called out \"frappuccino\" and another customer quickly grabbed and licked the whipped cream before i could say anything. This happens once in a good while if youve ever been to a starbucks. I brought it to the baristas attention and in a high tone she replied \"well you should have told her(the other customer) something then\". This as you can only imagine got under my skin. She eventually made me another drink after i waited maybe 30 minutes during a pretty slow time in the starbucks. After she made my drink she slammed it on the counter so hard that the top almost came off and the whipped cream came out of the lid. I can promise you i will never go back to this particular location. Honestly save your time and go to peets coffee right across the street.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-31", "description": "ok... went here on Monday morning, getting my Caramel Frap, like I always had been getting that in the morning. First ordered, they take my ordered and ready to go. I waited like almost 15 mins for my drink to get ready and i was almost late for work.\n\nI asked the asian barista,\nMe: \"How long does my Caremel Frap..\"\nAsian barista: \"They're be ready for you.\"\nI paused for a second and think, wow what an rude person.. she had cut me off without me finishing my sentence... Sorry ma'am, you need to be trained. I've been working for costumer services in few years, I know costumers are always right. But you don't have to talk rudely to the costumer who PAID you to do the FREAKING service!!!\n\nI didn't like how I was being treated so I asked for my money back, cause I don't want to get to work late, never come back here again. Your service sucks seriously! Learned to treat costumers nice!", "author": "Rena Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "These people were so incredibly rude. I ordered 2 flat whites with almond milk and when the barista was making the first one I asked her if it was almond milk and she answered \"no, it's soy...\" to which I replied \"oh I ordered them with almond... but it's ok, I'll take one with soy.\" She looked me dead in the face and said \"NO YOU ORDERED SOY.\" \nNow let me pause here...\nEven if I DID order soy, which I assure you I did not because I'm breastfeeding and my son is ALLERGIC to SOY... she shouldn't care! She should've just said no problem and made the next one with almond milk! \nI told her, noooooo, trust me, I know I ordered almond. She tells me NO you didn't.... walks over to the register and comes back to me and tells me I ordered SOY. At this point I'm getting truly annoyed and tell her she should just make my drink and not talk to customers this way. \nI'm standing watching her.... waiting....\nFive minutes later... she has not started my drink. I ask if she is the manager (surprise surprise she is not) so I ask to speak with her manager.\nAt this point I'm heated. I turn on my phone and begin recording.\nThe manager comes over and basically starts backing up the barista. Truly an awful experience. After all that the manager says she will refund my money to which I responded....\nI DO NOT WANT MY MONEY BACK, I just want you people to act NORMAL.\nTruly one of if not THE worst customer service experiences I've ever had.", "author": "Cheri G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "Though not on the Viennese model of coffee houses, you could meet the love of your life sometime in this place for sure.  It is a good place to meet people as the store is centrally located and there is parking in the area and so on.  The coffee is excellent as is the overall nice atmosphere of the place.  Remember also there are plenty of Starbucks and plenty of coffee houses and stores overall and don't overdo it.  Great!", "author": "Thomas H S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-11", "description": "Small corner store Starbucks located at the Bush and Van Ness. You have to climb up a flight of stairs in order to get your coffee, surely I haven't seen that at any other Starbucks. Limited seating.\n\nUsually there's bum waiting outside the store, if you're a regular, make sure to greet friendly.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-21", "description": "This is the slowest Starbucks Ive ever been too! There weren't many customers and the Employees had their backs turned away from All of us for a good five minutes. When the cashier saw us he barely even said hello. We waited another 15 minutes to get our basic drinks made (vanilla latte and coffee frap..). I give it a 2 because the drink tastes great but I also gave it a 2 because the service was awful and the cleanliness wasn't good either.", "author": "Lauren R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "We stopped in while on a mother daughter trip to grab a quick drink. Not only is it a great location in downtown but the staff were super friendly!  Added bonus: my drink was perfect!", "author": "Ashley N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-26", "description": "Most of the times I have been here they have messed up my order. The baristas have been clueless and very slow each time. I've been to many Starbucks in the city and this one is at the bottom of my list.", "author": "Roberta V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-04", "description": "I love Starbucks and have never had anything bad to say about them but this location really stinks. The guy that was working there shouldn't be. He couldn't answer any of the questions about drinks I had and didn't even know anything about the other items sold in the store. Plus they where out of everything. I walked out without coffee. If he was new then he should have not been left alone.", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "Big Kudos to Anna and Marlon at Starbucks on Van Ness and Bush, their consistent smile, professionalism, charm, kindness, attentiveness, and positive attitude is remarkable and a huge happy pick-me-up in all my visits. Thank you!!!!!!!", "author": "Miss T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-18", "description": "This used to be my favorite Starbucks but over the years the service has gone down. I stopped visiting this location almost a year ago but today I decided to give it another chance. Bad idea! Not only does the barista slam down your drinks and throw trays at anyone that asks for one. But they'll burn your food if they forget to make it and you dare to inquire about it. The two stars are for my coffee at least they didn't mess that up.\n\nAnd yes... I wrote to the company as well. I don't have time for nasty attitudes.", "author": "Jo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-11", "description": "5 people behind the counter, not more busy than usual and the wait for a drink is 15+ minutes. Only 2 baristas are actually working while the other 3 are hanging out. They seem overly disorganized and messy. Not sure if I can trust that they are even making the drinks correctly....", "author": "Carmen Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-16", "description": "People that work here are not well trained, sour milk, asshole manager saying customers are liars. WTF! I go get starbucks twice a day", "author": "Hubert P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "From out of town and stopped by this Starbucks today.....Sunday evening (Father's Day). Great service! Ladies working there were fantastic. One item was wrong and quickly remedied the situation and with a smile. Appreciated the ladies' friendliness there.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-24", "description": "They love cleaning, delegating, etc. With their backs to the audience.  Can have five people on and never call ahead in the line, cause only one person is ever making drinks.  Go to another one if you're late.  I should say Starbucks quality in terms of how their labor works seems stressful, like they're always behind \nin paperwork and finances and sandwiches, but coffee and service don't seem to have much to do with it anymore.  This company is nothing like it used to be, it's more like McDonald's with airplane food and slower than ever...every single store.", "author": "Levi H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "We order online and it said it will be ready in 5-8 mins but when we come to pick up they didn't make our drinks yet cause they forgot so we have to wait like 15 mins.3'", "author": "Naomi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-23", "description": "I wanted to like this place so much since it's the closest Starbucks to my home but never had a pleasant experience. The baristas were either rude or ignorant, creating unnecessary drama. For example, you should expect the barista responses to you 'you can have it if it's there' without any glance to the pastry section when you simply ask if they have a chocolate croissant.  \n\nWhat a shame.", "author": "Juwon K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-21", "description": "I don't like this Starbucks. It's a very small space and the staff isn't very friendly. The location would is close to work but dealing with the vagrants who hand around is not my idea of a great walk out the door for some tea. I won't return!", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-05", "description": "Small but cozy Starbucks coffee place at a busy intersection (Van Ness and Bush). The store interior is quite unique, because the store is situated on a hill slope, and so there is a \"second floor\" that you have to go upstairs to when you first walk in, but there is no \"first floor\".\n\nAnyway, the seating is limited, but the internet is definitely nice and strong. The waitstaff are pretty friendly as well, and the music is not bad. Overall a pretty chill place.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "I've been here a few times and time and time again I had the same experience. The staff who work here is rude, with the patrons even ruder. The counter isn't clean, so I wonder how often they clean the containers. \n\nI didn't use the restroom so wonder how dirty that is.", "author": "M C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-03", "description": "This is worst Starbucks that I have seen, the people who work there are unfriendly and unhappy group,  particularly the group that works the second shift . Very Bad", "author": "A H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-07", "description": "Ordered a drink and barista Anna was very rude, if you don't know how to make it then just be polite about it, don't talk behind a costumers back. Besides that it's an awesome spot but her costumer service is poor. So rude", "author": "Nadia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "One of the nicer Starbucks. Outlets at every table and surprisingly warm considering the size.\n\nPretty much the same as the other four Starbucks within a two block radius, only this one is on Franklin and doesn't have as good signage, so it was emptier than the other ones.  Other than that, it's just a normal Starbucks.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-07", "description": "Got a cappuccino and it was nearly all scorching hot milk with no coffee or foam...", "author": "Travis H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "This is the worst place ever. I've gone here three times and every time the coffee has been just rancid and the employees have been rude. I'm never going back.\n\nThe first time: I went because, hey, I felt like Starbucks. Got an Americano. It was terrible. My boyfriend threw his full drink away, which should have been enough to never return.\n\nSecond time I got a drip. It was...fine for a drip coffee...but the place was packed and the workers didn't even care enough to ask people's names. So everyone was trying to find out amongst themselves what exactly was going on and which drink belonged to which person. The barista could not possibly have cared less. She practically rolled her eyes.\n\nToday I went in and got a pumpkin spice latte with no whipped cream. Should've known better. It tasted terrible and it had whipped cream... This time I was the one who got home and immediately tossed it down the drain. And I am not one to throw food or drink out. Plus the obviously lack of giving a crap by the workers was again irritating - why not just ask for people's names with their order??? As usual everyone was trying to figure out which drink belonged to them, and in such a cramped space it can be hard not to get frustrated.", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "I was on the hunt for a plug outlet to charge my phone and decided to give this place a try. Lucky for me, this place had tons of plug outlets conveniently available AND I love frapps, so it was a win-win.\n\nAcross the street is a Peet's. Why are these competitors always physically situated right across from one another??! This place has one bathroom, and it's quite spacious but lacks hooks to hang your bag (if you have one). Cashier wasn't paying attention when I went up to the counter, so the barista helped me instead. Oh well, I get my drink faster.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "What can I say about people that work at Starbucks at this location let me know consider it kind caring make sure that they know exactly what the customer wants explain to them what product is like if you don't like the copy that they gave you you can always tell them and they'll give you another cup they make sure that the customer is always right they make you feel like your family there's always a smile on their face they're warm and they always have something lovely to say the managers are wonderful does supervisors are wonderful and I made sure that I go in just to be happy during the day just by talking to them I feel warm and kind and considerate which usually I'm not but it's changes the way they make", "author": "Rick L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-13", "description": "What you would expect of Starbucks. Can get busy but service is always good and wait is never too long. Not tons of seating, so may not be the best place to post up and lounge. All in all a good experience.", "author": "Scottie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "Young staff is arrogant as hell for a bunch of coffee pourers. Horrible attitude. I walked up to counter and everyone just stared at me, no thank you for overpaying for flavored water, not even a courteous go F yourself! How lame. I'll remember to skip these dump next time.", "author": "Zak B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-19", "description": "A small shop. There is no affection of the staff. cold. Latte is stable and tasty.", "author": "Miwa I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-29", "description": "This Starbucks has gone downhill ever since the new management. Won't be back.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-09", "description": "To the dude with the soda pop pretty boy haircut that had a b*tchfit on Wednesday morning 01/08/14 and yelled at a customer (US Postal Service worker on her break) who ordered a chai tea latte by accident (she thought there was espresso in it):\n\nYeah, I get that you have a new trainee to babysit and it's frustrating. Boo-hoo, suck it up and deal with it. Don't be a d*ck about it and yell at a customer/your coworkers for your bad day. You weren't even the one who had to remake the drink so really, calm yourself. The whole ordeal was totally unnecessary. \n\nAND for the love of lucifer, wash your hands after taking out the trash. Wash your mouth out while you're at it.", "author": "Rosavida C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-25", "description": "Definitely my least favorite Starbucks in the area--do yourself a favor and go to the one in the Wells Fargo on the corner of Van Ness and California.\n\nIt's amazing how company as good as Starbucks can have such terrible people working there.", "author": "Paul C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "This is really just another Starbucks at this point. I feel like most Starbucks are about the same. They are either big or small, crowded or empty. The drinks are about the same. What really makes each Starbucks different is its location, baristas, and the volume. The volume here does not get too loud most of the time. It is really easy to work here and not get disturbed. The Starbucks open up until 9:30 which is pretty great. The music here is good, it's never too loud or too light. It is the perfect place to just have a conversation with your friends, have a coffee date, and work. The baristas here are really nice and friendly. They are willing to take the time to get your order right. They will ask you for information such as whether you want it sweetened or not  (not every barista does this). Overall, this is a place to come to for a coffee date or just to work. But the place is small, just like how a cafe should be so seating is limited and gets filled up quickly.", "author": "Andy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "I am not a regular. In late August and early September 2016, my mom was dying and I came here every morning to get iced tea and a bite for me and my brother after sitting all night with my mom. The staff here was always polite and efficient, never rude. They had no idea what I was going through. But they made mornings a little easier for me. I just want to thank them for that. And don't be sad for my mom. She lived a wonderful 90 years. To those complaining, don't sweat the small stuff. Seriously.", "author": "Suzanne B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Cozy yet well stocked. Plenty of Ac outlets. Seats are many. Plenty of sun. Friendly staff. Busy busy busy place...", "author": "Crista S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-01", "description": "The restroom had no soap. So I go and tell a worker that there's no soap in the restroom and it needs to be replaced. She said they cannot replace it because there's no soap at the store. It's 8:30AM, so hardly doubt they ran out. I went to the manager and she said the same thing, but in a more rude way. Like I'm a toddler, and I need to be told repeatedly the same thing. So I tell her that there's a sign in the restroom saying employees must wash their hands. She says they use the soap in the kitchen. Then I clarify what the sign in the restroom says, \"State Law requires employees wash their hands before leaving the restroom\". Word for word that is what the sign says. So she sees my rebuttal and raises hers \"our employees rinse their hands in the restrooms, then they wash their hands in the kitchen sink with soap\", and then she walks away. That'll be interesting when she turns her back on the Health inspectors when they pay her a visit. \nIf you enjoy poop with your pastry hurry up before the Inspector visit. My coffee tasted weird, so I threw it out after two sips. As a matter of fact, the counter had a slight scent of urine.", "author": "Joe J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "I'm obsessed with this Starbucks, the atmosphere is delightful, the music is always jiggy and the baristas make the beverages really fast. They all seem to work together Efficiently and productively. This is one of the best Starbucks I've ever been too, not to mention there's a 180 degree view of the city while you enjoy your espresso beverage. I recommend everyone coming in for a delicious Flat White!", "author": "Brook H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "My work Starbucks location of choice. They are very fast and \"sometimes you wanna go where everybody knows your naaaame.\"\n\nGreat group of people. Not much seating.", "author": "Tina F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-10", "description": "Very poor customer service. Employee cleaned restroom for 20 minutes while 4 customers waited for the facility. This was during a high traffic rush hour period. Really need to reapproach the needs of the business and the people patronizing.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "This Starbucks is so consistent! I order through the app on my way to work all the time and they never make me wait. On the rare occasion that I do need to walk in and wait in line, it's never an inconvenience as they always get right to work and the wait isn't longer than 3-5 minutes. Granted I work nearby, but they always deliver my coffee with a smile, regardless of the crowd. I love trying their new drinks because it's always something different. Best part is, this morning when I came in to pick up my coffee (along with my boyfriend's frapp), I got a beautifully presented iced macchiato with a smiley face drawn onto the side of my cup from my favorite baristas (S/O to Mikee and Tsereha!) I didn't notice it until I got to work, but it already brightened my morning. Don't underestimate this location just because of the bad reviews they got from previous customers. They work really hard especially in the morning to make sure you're getting your pick-me-ups. Thanks for being so great guys!", "author": "Tricia M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-26", "description": "I do not for the life of me understand how they operate this Starbucks. Mistake #1, I stood in line for 7 mins with only 2 people ahead of me and two cashiers working. I place my order, a Strawberries & Cream Frap. Mistake #2 was I waited 11 mins for that to be ready. Mistake #3 was I expected it be good after spending damn near 20 mins waiting for service. Once she gives it to me I know it wasn't right because it was damn near white. I taste it and it tastes like frozen milk with chucks of ice in it. I take it back and I explain to the lady that it taste like \"Milky Ice water\". I say I think she used too much ice or not enough strawberries and cream. She looks me dead in the face and say, \"well what do you want it to taste like\"? I almost went there with but I know me. Ummm, Ma'am I ordered a \"strawberries & cream\" and that is what I would like it to taste like. She still looks confused and asked me what I would like her to do. So me being me and knowing that this wont end well, I say as nice as possible \"I'll just take a refund\".! Thanks but NO THANKS! Wont ever be back to this location. Not to today satin not to day!", "author": "Erica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "Not to be confused with the other Starbucks two blocks down! This one is located right across Van Ness from a Peets. \n\nJust your standard Starbucks. Very friendly staff and lots of people just hanging out. \n\nI was trying to find the Starbucks down the street and was pleasantly surprised when I came across this gem!", "author": "Charles K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-20", "description": "I like the staff here they are nice and they remember my order almost. I don't like the remodel caus it seems smaller & the seats face the door, as well as block the picture windows. You can't look out onto the street anymore just the counter & the wall. They blocked the wall outlets with the furniture so it's impossible to plug in your phone to charge. I won't be coming back because of that & less seating!", "author": "Alix J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "This Starbucks is an extra little walk from my work shuttle stop, but it is worth it for me from time to time to make that extra effort to come here.  The baristas here are friendly and patient - that makes all the difference!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-21", "description": "I've been to this Starbucks several times, all around 10:30-11 am Monday-Friday, & there wasn't any line & I got my drink fairly quickly. However, there was one time I decided to come here around 9:15 am, and let me tell you, the line was crazy long! I feel like the time I spent waiting in line to order, plus the time it took to get my drink, was probably 30 minutes. There was only one lady making the drinks, so I give her props. I guess it's what you can expect at any Starbucks around that time of morning.\n\nOverall, this Starbucks is A-OK in my books. It's right across from a Peet's, but I prefer the customer service at this Starbucks. They aren't excellent, but they aren't grouches either. Also, I've never had any complaints about my drinks, all decently made.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "It's my first time at this Starbucks (I'm going to a concert with a friend at the Regency Ballroom and we're waiting here till then). We like this place, it gives us a place to get away from the sun (awesome AC) it's peaceful, and the baristas guys are kinda cute", "author": "Kara C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-25", "description": "TIP #1: Expect a slow-moving line. Once you get your drink order in though, it takes just a couple of minutes for your drink to be made. \n\nTIP #2: Limited seating. Not as much of the signature dark-and-cozy Starbucks feel here. \n\nStarbucks confession time--what drink did I order? It's autumn, so I had to get a seasonal drink. Tall one-pump pumpkin spice non-fat latte, no whip. Mmmm. \n\nThe dozen of high school students in front of me in line did not all order Fraps--what a pleasant surprise! But there were a lot of caramel macchiatos. The line of people waiting to order almost snaked out the door. If my drink hadn't been made in a couple of minutes, I would've written this Starbucks off as slow and inefficient.", "author": "A.L. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-01", "description": "Liking this StBux as well since it's an inviting one, and the service was friendly on my visit. Twenty minutes before closing, people were inside chatting away amongst the tables and working on their laptops (i.e., no seat to be found).\n\nEasy to spot, at the corner of Bush St. (a one-way street so decent parking) and Van Ness Ave. The unisex restroom requires a key.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-07", "description": "This location is a GREAT example of how a business in an older building can make itself WHEELCHAIR-ACCESSIBLE by adding a wheelchair-size lift!  Kudos for doing that!!!  Coffee shouldn't just be for able-bodied individuals!\n\nThe staff are really friendly here, our drinks were made perfectly, and there was ample seating, considering that it's a smaller store.  The one down side?  It was REALLY cold!!  The front door was open when we got there, and we asked if we could shut it...the employees said that was fine, so we did.  But we still felt gusts of cold air while we were sitting there, shivering, trying to drink our coffee.  Next time I go here, I'll be sure to wear my parka!!!\n\nAll in all, a nice environment:  nice staff, a space with more character than usual, and a place to park myself with a book or computer!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "Starbucks on Yelp?  Really?  People take the time to review Starbucks?  Well, when in Rome....\n\nThey have coffee here.  It's a little overpriced, but the atmosphere and free wi-fi are supposed to make up for it.\n\nI think that about sums it up.", "author": "Zack B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-30", "description": "Typical Starbucks location.  Upon entry, a stair-case and a wheelchair lift were present, such thoughtful gestures for everyone.  But being across the street from Peet's, this is a tough decision.", "author": "Chi T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-20", "description": "It's a nice day in SF and I'm walking around running errands. I end up stopping by this Starbucks and ordering a green tea lemonade. The barista was so lazy!!!!!! Didn't even shake my drink! I had to shake my own drink over the trash can so I wasn't drinking just syrup! Won't be back here.", "author": "Ranna K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "Spells my name correctly AND gets my drink order correctly. Yay! LOL! :)", "author": "Jean T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "Very rude staff and horribly smelling bathroom, always crowded and very loud there.... Hence no ambiance. next time I'll just be going to peets across the street!!!", "author": "Ben S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-29", "description": "One of the weirder layouts of Starbucks stores I've been to. Entering involves climbing up a short flight of stairs to the small main floor of this Starbucks. There are some tables and chairs to lounge, but not that many. I can't remember but probably no more than 15 max. It didn't matter to me since I just wanted to grab a drink and go. I approached the counter and was greeted nicely and once my order was in, it did take a while.........just for another barista to start making my drink. I didn't wait more than five minutes, but it took a while just to start...and of course the drink is done and passed to me in five seconds. I ordered a mocha frap and I didn't really enjoy it like the other times I've ordered mocha. Will come here when I go to the gym two blocks down if I ever want to drink a frap other than the mocha one.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "I am very disappointed with the way MIKE the person who was helping us behaved with me and my boyfriend. And honestly he gave us a feeling that he was being very racist towards us. I have been for a couple of days and when we went to starbucks I wanted to try something new than my usual pike so when we and my bf were discussing what to take..a few other customers just came then and MIKE immediately goes like..hey guys you have to start making choices now..we got people waiting.. now I am willing to let this go off coz obviously we were taking other people's time..but there is a polite way to say it. So I ordered a Chai tea latte which I didn't like and went back to him asking if he could exchange it or a pike.. he took it and started and doing his thing when I coughed a little because of my throat infection.. immediately he says \"there is no need to choke, we are exchanging this\".. I was honestly shocked and told him I was sick... I noticed that his behavior was completely fine with everyone else 3xcept me and my boyfriend.. it was like he didn't want us there... his voice was loud and condescending when it was us and different for other people... I could be wrong that he was differentiating us but honestly the whole choking comment that he made without knowing the background and treating a customer like that is wrong.. I hope you guys will change", "author": "Prathyusha B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-14", "description": "ZERO stars...if possible.\n\nthe employees/partners are the worst i have ever seen.  the espresso drinks taste like burnt coffee.  they need to learn how to calibrate their shots correctly.  they obviously don't know how to run a business by throwing away all of their iced tea 2 hours before they close.  \n\nenough said.  i can't stand this location...NEVER coming back.", "author": "Jen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-11", "description": "this is the perfect spot sometimes when I need some wifi and a place to get of the street while I wait for a ride home.  there are always plenty of scones and the staff is always really nice and friendly, I'd give them 4.5 stars. Mostly my beef is that this starbucks is a little dingy inside and its always FReeZing! I have to get more coffee just to keep myself warm and typing, no really that's a lie but I do get cold in there; bring your damn sweater and scarf.", "author": "Coco J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-11", "description": "Been to this particular location twice. First time, they got my order wrong, I asked for un-sweetened and they put sweetener in my iced coffee... I came here this past Saturday for another iced coffee, although they got it right this time, it shouldn't have to take 10-15 to make... The barista was hella SLOW, and was turning over drinks what seemed like every 5 minutes... It appears that they have plenty of staff to take care of customers, but nobody seemed to be working... They also need to clean this place up, not looking too good with all that trash/clutter piled up next to the counter.", "author": "Barry H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-01", "description": "This is my go-to San Francisco Starbucks when I am in town for school! It's convenient and the staff is very friendly and accommodating of my pre-caffeine awkwardness. It's a decent space; plenty of seats to choose from.", "author": "Victoria R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-06", "description": "I recently went to another Starbucks downtown on O'Farrell and Cyril Magnin and ordered a couple of spinach wraps. We drove away and a few bites in realized that both the wraps were ice cold in the center. We stopped by at this Starbucks which is a ways down and requested if they could warm them up. The barista informed me that she couldn't do anything about it because we didn't buy them there and because they were already bitten into. Before I walked out, Sarah greeted me with a smile, kindly apologized and offered to get me two brand new wraps. This was exceptional customer service and I just wanted to acknowledge Sarah and thank her for going above and beyond!", "author": "Eric C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "This starbucks is pretty small. The few tables in there were really crowded together. There were a few stools(?) / chairs facing out onto the street. And at 10am, it was crowded.\n\nA few people were regulars, as evidenced by the way the staff knew their orders right away. Service could have been fast -- I think I had the unfortunate position of being right behind someone down on his luck. It took him f-o-r-e-v-e-r to get out as much change as he can for a coffee. They opened up another cashier to serve me while he finally fished out all of his change. But I was served quickly because I wasn't getting a coffee.\n\nStore is right across the street from a Peet's. And apparently, there is another Starbucks a block up. Since this Starbucks location is too close for comfort for me, I like knowing I have options in the area.", "author": "Ruiqiu K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-13", "description": "This is my first mobile review on Yelp and if works I shall repeat. This is a cool Starbucks. Location is very visible so easy to find. It is small but seems to always have room for both those lounging here for a while and casual sitters like myself. None of the Starbucks I visit have got used to my regular order of \"Can I have a Tall Blonde, please.\" They hesitate even if for a microsecond no matter how many times same order was placed. Starbucks whines a lot as a company. They appear in the news when not happy with sales or have to change products and so on. It is a whining  corporation but run efficient stores and seem to be on top of things. They seem to have achieved what was difficult in fine dining to implement the same way every time for every customer. They have great staff here and most location i have been to. It is a nice day. I go to Walgreen's now. Arizona Ice tea is on sale for a week and good time to treat coworkers to the good life for only a few bucks. It is the thought that counts. Yelp sucks by the way. Yelp people know me so I want them to finish this reading this way. SUCK. Lol. The update info for this latest Yelp version does admit it took them a century to add writing reviews to Yelp app. I give 4 or 5 if I feel I have to write so don't be afraid of I. They suck.... Lol", "author": "Cush D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-07", "description": "What's this, Phil H. reviewing a Starbucks? Well yes, this is my local joint and I had to give it up to the hard working staff. \n\nThey know my name, they know my drink, they ask for my commuter mug as soon as they spot me in line. Yes, I'm sure up at Starbucks HQ they are thinking up ways to run local coffee shops into the ground while maniacally stroking hairless cats but they do put out a consistent product that keeps me sufficiently caffeinated throughout my work day. And the staff at this Starbucks helps get it into my veins fast and sends me on my way. Nothing wrong with that...", "author": "phil h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-13", "description": "Pretty convenient area to pick up a drink since it is on a major street that people can find. Usually I would either pray that my Yelp app find a place ASAP as I am driving or use eagle eyes to spot a Starbucks as I randomly  go. Hit or miss you know?\n\nThe service is friendly but pretty slow. I was in line with 2 people in front of me and it took 15 minutes to get my drink! Not a good sign when you go back to your car realizing the meter expired.", "author": "Eric E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Now, before any thinks that this review is about a good starbucks let me stop you right here. I never thought I would review a starbucks above a 3... the coffee is not amazing, the staff seem like they are reading from a script meant to please morons, and those new pastries are nothing special, and certainly not worth the extra cash due to their extra small portions compared to the old stuff.\n\nWhat I want to bring attention to at this starbucks is how \"un-starbucks like\" my latte was. Im used to the bubbled out crap they serve, but to my surprise, the barrista gave me a second to observe his craft, and he put a freaking leaf on my latte??? From a starbucks? Someone with talent?? I couldn't believe it. My friend got a heart, and when we questioned him about it he said \"Hold on a sec, and turned a hot chocolate into a god damn PANDA BEAR FACE. I couldn't believe it. The lattes were creamy, and the espresso didn't taste burnt. \n\nMy hat goes off to Matthew, he is super tall and made me the best starbucks latte I'd ever had. I will never buy another latte from this starbucks, unless its Matthew on the bar.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-22", "description": "This is the slowest Starbucks. There is always a line out the door. Today, they had 3 people behind the counter but only 1 person making drinks! The third one was filling ice and wandering around looking lost. They messed up the order of my drink and gave me attitude when I mentioned people 5 orders back from me where receiving their orders. Avoid this location at all costs!", "author": "e w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-25", "description": "What happened to consistency?\n\nWhen I visit a Starbucks, I'm not expecting a great cup of coffee...just something warm with a bit of caffeine in it. How is it possible to screw up an Americano or drip coffeee? It's just water and coffee beans. I like knowing that I can walk into any Starbucks and get the same quality drink. I think of them like the McDonald's of coffee. If I want a real cup of coffee, I'll go somewhere good like Ritual, Four Barrel, or Blue Bottle.\n\nI am no longer going to this Starbucks location. I've gone several times because of its convenience, and hated my drink each time. Some of the \"baristas\" seem to be incompetent and the service is horrible.\n\nFrom now on, I'm walking across Van Ness to the other Starbucks.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-22", "description": "Not the best...but definitely not the worst.  It can be rather slow...and to beat the rush, you have to get there early.\n\nYet, just like any other Starbucks, the more you go the nicer they are to you.\n\nI must admit my seasonal favorite is the PEPPERMINT MOCHA....yummy....and the barista who makes it here (forgot her name) does a wonderful job...it is mint chocolate goodness....", "author": "Hiromi N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-22", "description": "This review is not for Starbucks coffee, its for the consistently bad service. I never like to single out a particular employee, but I am making an exception. A particular employee at this location always seems to be annoyed, angry and LOUD. I get that it can get busy at times, but I don't think that there is ever a time to yell a customer or a fellow employee. Seriously-its coffee, not life or death. If someone takes more than 30 seconds to order deal with it respectfully! Everyone else who works here is fine-and they all seem to be aware of how her attitude is perceived by customers.", "author": "Lindsey H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-18", "description": "Should avoid this Starbucks unless you need to charge things. Customer service is horrendous compared to other coffee shops around the block. The barista just didn't seem to care much.", "author": "Cheng Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-14", "description": "Nice little Starbucks on the corner of bush and Van ness . Clean, good service and not to crowded before 7a, parking is a challenge", "author": "Steve W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-17", "description": "Very slow, but....that wasn't the problem.  The girl made my drink wrong...all I asked for was a 5 pump, nonfat chai...I got a 3 pump whip cream cup...and when I told her it was wrong..I got the evil eye...and I said that this wasn't my fault, and she said...I never said it was...just rude...will not go to this one again..", "author": "Trisha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-02", "description": "The best part about this Starbucks is that is at the corner of Van Ness and Bush. With big windows that wrap around the shop, you get to see just about everything along with your java.\n\nI've seen bad auto accidents on Van Ness as well as weirdos walking down the street. One time I saw Obama's police escort scream down Bush Street. In 2006 there was a bomb scare in the bathroom. The news made it all the way to CNN. Turned out that it was just an old Flashlight.\n\nIf your caffeine fix isn't enough to start you up, go to the Starbucks at this location and eventually, you will be entertained by some kind of event.\n\nThe drawback of this place is that it very cramped and if you are on your laptop, don't expect much privacy.\n\nOtherwise, it can be entertaining and the staff they tend to hire there are cool.", "author": "Randy F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-05", "description": "I still go to this Starbucks, but always the barista hands the key off to the restroom customer before smearing the residual faecal coliform on your coffee cup.  \n\nPlease patronize this Starbucks if you are interested in liquid bowel movements.\n\nThe staff is friendly, though, and you can get free wifi from the Tully's down the block.", "author": "Floris W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "Located on the corner of a busy street so parking isn't the greatest but the friendly staff makes up for the lack of parking!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-09", "description": "It seems like I went to a different Starbucks from the other Yelpers, but I had a very pleasant experience here.  Maybe it was just the fact that I was able to stand in their air conditioning for 5 minutes and dry the sweat dripping off my face.  \nThe two gay guys working behind the counter seemed VERY happy to be making fru-fru coffee drinks.  In fact, the light frappacino I got was probably the creamiest light frapaccino I've ever had, down to the last sip.  The other guy was even giving me tips to heat up the sandwich I bought, but not for too long; it would be delicious! Happy gay guys always seem to make my day a little brighter (hey, its not called gay for nothing).  \nProbably minus 1 star for the tranny hooker sitting in the corner talking to him/herself.  But I really can't hold that against Starbucks.", "author": "Gracie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "I came in here to escape from the rain.  It was so warm in there that my glasses fogged up and I had to take them off.  The people who work here were really nice and patient.  I would go back here if I were in the neighborhood.", "author": "k h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-04", "description": "Whoever it was that thought it grand to fuse Gingerbread with a latte can pop my cherry.  You know who you are.  Private message me.", "author": "Mc Matty b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-06", "description": "Gotta love the neighborhood Starbucks that consistently comes through with the perfect venti 2 bag Calm Tea. Choose this spot over the other 10000000 starbucks in san francisco and you'll walk out satisfied. I'll go out of my way to stop by the store for the 5-star staff - who put a smile on my face more than any starbucks beverage ever could.  Thanks starbucks superstars  -  I'll see you tomorrow! :)", "author": "Caroline J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-15", "description": "A very small coffee shop. You can't  stretch. Crowded, stuffy! The A/C was out of service when I was there. The Workers talk b.s. among themselves aloud in front of customers ( just students working part-time that don't give a darn I guess). The staff tends to be unprofessional and sarcastic. You ask for a beverage and you don't get what you want. My suggestion, go down the block on California Street were that place is much better.", "author": "Smooth R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-21", "description": "One of my least favorite starbucks in the city. I live really close to this location, however end up walking the couple blocks to California/van Ness, or, when that one is closed, vallejo and polk st because the Bux at 1401 Van Ness is awful. I order a carmel macciato and the barista's put the shots in first....so basically its a vanilla latte because in macciato's the shots go on top. It is really frustrating. Also, they charge you for sweetner in an americano when you could always go and put it in yourself at the condiment bar.  It's ridiculous. I hate this location and avoid it at all costs!", "author": "Sarah I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-25", "description": "This is the WORST Starbucks EVER!!!! The employees here are just rude, they seem overly annoyed that they are working there, and when you order a drink they treat you like you are personally responsible. The service is slow, and I'd say, skip it and go to another one.", "author": "Robby G."}
