{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "The place is sweet and big, but I'm rating because the team is fantastic \nNobody else is in that mood on a Monday morning, grabbing a coffee her this morning made my week start better.", "author": "Marina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "This location has, in recent years, become a cesspool of bums and weirdos during the late hours, whereas it used to be a clean, friendly spot for college students to study when I was in school. It mirrors the shithole this city has become, unfortunately, but Laurel Heights remains relatively nice, so it's kind of strange. I guess people flock here from all over because it's the only 24/7 Starbucks in SF. \n\nThe bathrooms are filthy. On the bright side, I doubt the asinine new public bathroom policy announced the other day will affect this location. The bathrooms are tucked away where it's impossible for baristas to tell if people have purchased something. \n\nSpeaking of the baristas, this so isn't the demographic I'm used to. They are highly unprofessional and rude, and they make the worst drinks around. As an aside, whose job is it to keep the store stocked? Are the employees tasked with reporting what they need on an average night? They have been out of essential ingredients every time I've stopped by lately, including last night. Like, how are you out of coffee base, and what is this repulsive replacement?", "author": "Paulina F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "Closed during regular hours should be bbn open but won't open doors. Lights on people in there", "author": "B H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-23", "description": "Thank you barrista who was NOT paying attention when you made my husband's drink. It was a mobile order with lack of quality control. Upon my husband finishing his venti matcha Frappuccino, he observed a large yellow cap. Thank you for the extra dose of plastic.", "author": "Cristina P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "Open almost 24 hours! Busy during the daytime hours as well as the late night hours!\nI would come here to study and write my essays that I procrastinated on during the day.\n\nSeating can be very limited so sometimes you may have to wait to get a table especially if you are in a group or want to be seated near an outlet. At night you may see some questionable people but I have always had a great experience!\n\nMy college years were spent here with friends in the late hours of the night.", "author": "Nathalie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "As a long time customer of the Laurel Village Starbucks I wanted to express my appreciation to the entire staff who go above and beyond the call of duty and provide excellent customer service. The barista's learn customer's names and favorite drinks, and they are constantly hustling to get that hot or cold drink to each and every customer as fast as possible. They try hard to keep the store clean, even when customers do not clean up after themselves, and when someone is harsh about a drink made different than expected they promptly remake the drink with a smile!  Most important they have a warm welcome for everyone! Thank you Laurel Village Starbucks crew for your professionalism and courtesy, and for making all of our days better!!\nSandie P", "author": "Sandra P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "This Starbucks location is awesome because it's in a clean, safe area, it's open pretty much 24hrs (according to the Starbucks app), and there's a ton of seating & power outlets! \n\nCustomer service is NOT great.. But they do make good drinks, and they carry all the same stuff as the other locations, which makes it a really convenient place to stop in, or hang out at.\n\nI went in a little after midnight & there weren't any seats available, this place stays packed!", "author": "Denise F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "Best Qualities: \n 1. Very big size\n 2. Friendly employees\n 3. Lots of seating including a high top table that can be used as a standing desk.\n 4. Lots of parking\n\nWorst Qualities:\n 1. They BLAST the music. I was actually shouting to my friend when talking to them because it was so loud in there...\n 2. The parking has a 90-minute limit and they DO ticket you...I may have gotten one.. :(", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Ordered no whip cream... got it with the cream... asked to get new one... got the same one some of the whip cream out of it. In addition I was extremely polite.", "author": "Mert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-06", "description": "What a fantastic location and strategic to say the least.\n\nOn a block geared towards baby strollers, their nannies, and a drove of UCSF employees as well as the JCC, this Starbuck's is comfortably locked into a neighborhood where the locals and workforce will keep the profits here rolling.\n\nWhile many place their orders online, I still take advantage of walking in because some days I'm not on a normal schedule and due to my finicky mind, may choose different types of espresso drinks depending on the day.  My favorite is their Caramel Machiato and Breve Lattes done extra hot.  I'm not picky and just order off the menu: full fat and full sugar.  \n\nThe layout of this shop is great and allows for good flow.  You can usually find space at the window counters around the front but I don't doubt that during the day, this place is packed people and their laptops.\n\nService is quick and efficient and served with a smile.  Right off the 1-California muni stop so easy to access.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "This Starbucks is open 24 hours. Very convenient location next to a bus stop. Clean facility. Plenty of tables to sit at with power sockets to charge your phone or laptop. One of the best places to study.", "author": "U V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "I was out in SF on a shopping trip ​and decided to drop by this location. Immediately​ I was surprised​ by the unique layout of the store. The furniture was all very nice and seemed to have a lot of care put into its maintenance. The leather chairs were especially comfortable.\n\nThis time I wanted something new so I asked the cashier for recommendations. Her eyes lit up and she enthusiastically named off her favorite drinks, some of which were custom creations. I ordered one and it was delicious and finely crafted.\n\nThis location doesn't lose a single star, everyone should go here! :D", "author": "Eliza H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "I am sitting here at 2am May 12 and the \"baristas\" are playing profanity-laced rap music on their cell phone speakers, or at least one of them is. Not sure who. But super unprofessional. Wouldn't really care much but the music is melding with the Starbucks-sanctioned music from the speakers and giving me a headache. Just play one or the other please. Or just play the music Starbucks has told you to play. This is not your DJ set. Wtf are these ppl doing? Someone needs to be given a warning. Would never come back.", "author": "Max G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "This may be the worst Starbucks in San Francisco.  It's open 24 hours, it's a haven for homeless people and it's dirty.\n\nIf you want to sit next to a greasy 50 year old homeless man who leers at women and calls one of them a f**king whore and stands up and physically intimidates her while she's seated because she took out her cell phone and he thought she was going to take a photo of him, this is the place for you.  The same man left and came back (with all his gear) three times in the hour I was there late last evening.  One time he got up and stood three feet behind an 11 year old girl who was at the condiment bar, staring a hole in the back of her head with a grin on his face.  Just standing there looking at her.  It was beyond creepy.  \n\nThen he ate potato chips and left crumbs all over the floor, as well as dirty napkins on the table.  In the entire time I was there not one employee cleaned anything.  \n\nFinally he decided to clean out his ears with a paper clip.  This went on for 20 minutes.  He was grinning the whole time.\n\nWhen he verbally attacked the woman she complained to the manager who instead of ejecting the man, said if she'd been assaulted he had to call the police.  So basically, management punted?\n\nThe police came and (I heard the whole thing) politely apologized to the man for the understanding then *suggested* he leave for a while.  He went out and stood in the bus stop.  The woman was still there when I left so I don't know if he came back in, but another woman I talked to said she's a regular and the man is *always* in there and is *always* leering at women.\n\nAnd he's just *one* of the homeless regulars.\n\nPlease note that since the Starbucks incident in Philadelphia, the instructions have come down from on high - anybody may use the bathroom, anybody may sit in Starbucks all day without buying anything, and you practically have to punch someone in the face to be ejected.  Note that this man was not ejected by management even after a customer complained that he had intimidated her and called her a f**king whore.  The manager's solution to this was to come over and tell the man not to communicate with the woman any more then kicked it upstairs to the police.  Didn't even tell him to move and he was sitting right next to her!", "author": "Hannah T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-16", "description": "I like going to this 24 hour Starbucks to study. Some of the baristas here can be really nice, and some can be rude. Sometimes you'll see people napping and being unproductive, like I am now. It's convenient because there is a parking garage at the back where you can park for free! There can be long lines and no empty seats, but it's a pretty good place to stay productive past 9pm, when most cafes are closed!\n\nThere are limited power outlets, so make sure that your laptop, cellphone or other electronics are well charged before you embark on a semi-productive journey.\n\nThe bathrooms are usually semi-clean but most parts of this store have litter or coffee spills. I still keep coming back because of their odd hours!", "author": "Charlene F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-19", "description": "I really like Starbucks, but this Starbucks has the dirtiest bathrooms I've seen at any Starbucks. Not usable.  Wads of TP and filthy.  Looks neglected for days.  \nYuck\n\n\nStaff is pretty nice though.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-26", "description": "Pros:\n-Open 24 hours.\n-A row of tables and cushioned seats with AC power.\n-Standard Starbucks coffee and other fare.\n\nCons:\n-Music is blasted too loud.\n-Late at night the place is full of weirdos. I'm trying to work right now with a girl sitting across wearing headphones and loudly singing/whining R&B while rocking in her chair and snapping her fingers. There are also predator neurotics who roam from customer to customer trying to stir up very loud, weird conversations. Best to keep your noise cancelling headphones on although mine aren't good enough to block out the whining R&B nutcase. Is it too much to ask for a normal late night visit in peace for once?", "author": "Christopher S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-26", "description": "Saturday evening 8~10pm, quite some people here and their internet sucks BALLS. Keeps appearing and disappearing from the list of discoverable networks and when finally connected is so slow you can't even open the Google main page. The second star is for the barista that sat down with me trying to help me connect.", "author": "Alexandra T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "The first time a coworker told me this place was open 24 hours, I thought it was too good to be true! Eventually I found out that this location closes down for a few hours to clean up? Come on!!! A popular coffee shop can't remain open without ever closing down to clean up!\n\nI usually stop by for coffee and leave! Move along.", "author": "Julio B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-25", "description": "I order my coffee from the cashier , Al, who proceeds to emit two sneezes the size of the state of Texas, not even covering his mouth.\n    This is the SECOND time in as many days I have written a less than failing grade with this store. (The first being quite descriptive on Google...)\n  Disgusting,  enough to contact the regional manager. If the guy doesn't have enough sense to cover his mouth when he sneezes, when was the last time you think he may have thought to wash his hands , not to mention change his clothes or brush his teeth ?\n  I expect such disregard for cleanliness in Donald Trump's house , for example,  but not in SF. \n  The mice in this place are prolly in bed with a thermometer atm.", "author": "Vernon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Compare to others this Starbucks is huge!  Lots of sitting room throughout the store. They also have multiple bathroom stalls a plus. \n\nStaff is friendly and efficient.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "They are not only not 24 hours, they changed their late hours however they like it. On New Year's Day, not New Year's Eve. They closed early at 11:30 pm without warning. I was here for coffee at 8 am and not see their manually generated sign on their back door till they are close! They are also not completely open till 5 am. They will say the bathrooms are still being deep cleaned and their facility are always broken regularly so if anyone else says they are 24 hours. It is not true. By the way the hospital emergency room across the street is not 24/7 either unless you are a child or pregnant and have to be admitted with doctor's recommendation so stop saying to people, go across the street.", "author": "Connie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-16", "description": "This place is dirty inside. The floors need to be swept and mopped. The tables and chairs have food crumbs all over them. I don't even want to sit down. The counters need to be wiped down and the condiment station where you get lids and straws needs care. The trash Area there needs to be dumped. Also the women's bathroom is gross. The bathroom trash is all over the floor in both stalls. I mean is anyone in charge of the cleanliness of this place? With a Starbucks being unkept like this there really isn't any point in discussing the service.", "author": "Angela M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Reconfigured! Big improvement. I'm a customer again. Love the iced black tea with pineapple.", "author": "Gina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-20", "description": "Did the store manager change recently? Staff used to be friendly but they know keep talking to each other. I was there this morning and there was a barrista (chubby guy) who was litterally shouting customer names in a way he thought was comical. Embarassing! In the meanwhile, at the cashier, another barrista (chubby young woman) was exchanging \"funny\" comments on customers with a workmate. \n\nTime for a little management shake-up at the store, IMO.", "author": "Emmanuel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "I like this Starbucks because it has a parking lot in the back and the people are not as sketchy. I used to go to the westlake Starbucks to study but it has these sketchy people, one guy shirtless with a knife, some people staring at you trying to ask you weird things. I also like this Starbucks because it's open 24 hours. But the parking lot is great because lots of coffee shops in SF only have street parking and that's hard to find. Wifi is good. Ample seating. Nice and polite people. I also like this Starbucks because there are multiple stalls in the bathroom and the bathroom is very clean, doesn't look like people have been bathing there.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-09", "description": "Come here to see who wanders in at an odd hour. Spoiler alert!!! Lots of interesting people!! One guy with a dog, another with a larger than life plush toy. A lady talking but not making any sense - the worker behind the counter very polite by the way. Lots of young people with laptops.\n\nGood to know:\n*Open 24 hours, I believe.  *Large - especially for SF standards, and very comfortable. *Bar area I like...  can watch the baristas making drinks. *This is a police hang out... *Lots of parking.\n\nIts midnight. I'm here. A decaf Americano and steel cut blueberry oatmeal hit the spot as a midnight snack. I'm at the bar watching two young ladies and one young man hard at work. A group of people speaking a foreign language by the creamer. A lady and guy appear to be on a date behind me. A young lady in fuzzy comical  house shoes on a comfortable chair. She must live next door. I'm here writing this happily with a sense of purpose and will be back.", "author": "Stefan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "A 24 hour Starbucks to do homework at! Pretty busy at night until about 12 midnight or 1, so hard to get a seat before then. Wish there were 24 hour Starbucks in my area or somewhere near me that doesn't require me to cross the bridge and pay toll.", "author": "Elizabeth L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-28", "description": "Consistently the slowest and most unreliable Starbucks I've been to. They often indicate that mobile orders are ready for pickup, but then ignore you once you arrive and try to alert them that your drink order is missing.", "author": "Gregg M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "Filthy, full of creepy homeless people who practically live there. Hot chocolate so sweet and weak,  it tasted like milk with sugar in it, pastry tasted like gummy day old wonder bread with a teaspoon of raspberry jam in the middle. Only $7 for that culinary experience.", "author": "Alexandra D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-16", "description": "Shitty customer service! The guys Miguel always talking to his co-workers and never pays attention to customers plus no greeting!\nMost employees copy paste their couches attitude. Shitty crew.\n\nI wonder why Starbucks company hire employees who will hurt their sales!", "author": "Yousef A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-26", "description": "Came in today and was blown away by the customer service! the barista, I believe his name was Miguel, took my order and was cheerful and attentive. he worked quickly to make my drink as well - and it came out perfectly. I would hire him to be my personal barista if i could. highly recommend.", "author": "Kelsey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Amazing place for Starbucks , open 24/7 anytime in the city they open , good service fast and clean", "author": "Ray M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "Since the last time I was here like 3 years ago,  it seems like this location  has gone downhill.  Dirty bathrooms and homeless sleeping inside on the seats. No thanks. Moving on to the next Starbucks", "author": "Jesslyn H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-19", "description": "The restroom is not coded, which is great.  But it stinks so bad!   Wish they clean it more or mask the smell.", "author": "Drew B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "This is all about costumer service!!!!\nJust ordered a banana cake last friday  morning and after waiting several Minutes and have costumer after me getting their order first.After  all that i have to asking: wait a minute,excuse me sir,can I get my cake please?? And the rude server coming,dropped off my cake on the table,didn't call my name and looked at me with  angry face,very upset  and just gone,Thank you sweet for a horrible service and I'll recommend you to stay home if you are not in a good mood ok!!! I'll give a nice reviews for this place to my friends and family to this Starbucks!!!!", "author": "Cyrillo N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-29", "description": "Just stood in line for 15 minutes for a salad that turned out to be frozen.  Waste of time and money.", "author": "Katherine Isobel U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-26", "description": "So I've been here numerous times and I have had good experiences.\n\nToday was the first time I have been in the bathroom.\nAbsolutely horrendous. Fluids all over the floor. The toilet devoid of any toilet paper. Just an absolute mess.\n\nIf the bathroom and image of the store is not a priority, it makes you wonder what the priorities are. Do they even wash their hands?\n\nBig Smiles  and Starbucks standard coffee. Disturbing Hygiene. \n\nI will not be here again.", "author": "Norman R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-18", "description": "came in tonight around 2:26 am,  and the asian guy working the counter was rude for no conceivable reason. he turned around and saw me at the counter and just looked at me, no hi can i help you, no nothing. he looked less than thrilled with having to work. i ordered alatte, paid, and went to wait. when my drink was ready he pushed it to me over the counter without even looking at me-like he was literally looking the other direction. im still thinking maybe he's  just having a bad night or hates his job.  but i noticed there was no whip and i like whip, so i said in a perfectly polite, friendly voice, \"excuse me, could i get a little whip?\" i wasnt mad, i wasnt annoyed, i judt asked for some whip... and he ::rolled his eyes at me::. i finally had enough and said \"is that ok?\" and he goes \"yah sure\" and adds the whip.\n\ni dont know what his issue was, but his attitude was unneccessary. I'm still deciding if i want to speak to the manager. i dont appreciate being treated like that when i didnt do anything and was polite. who knows what his personal issues are, but theyre reflecting badly on Starbucks.", "author": "Mer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-04", "description": "AFWM couple every where. Straight Asian men here get stink eyes.\n\nThe coffee is ok though. Not the best I've had. Prefer Peets.", "author": "Ma H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-20", "description": "The fact that this location is open 24 hours is wonderful! Great for doing work while I'm staying in the neighborhood. However, I've been here twice in the last two days, and had negative experiences both times. Yesterday I ordered a tall iced tea, and was charged for a grande. I told the cashier that I thought the tall was less expensive (as I was looking at the price on the board, which confirmed my assertion) and she straight up looked me in the face and just said \"no, it's not.\" It took two or three minutes for me to get through to her, until she finally realized that she'd charged me for a grande, despite my already having the tall in hand. I feel like she handled this minor mess up very poorly. The 50 cents is not a huge deal to me, but the attitude was unnecessary, and the lack of accountability once she realized she'd made a mistake was very frustrating. The place was also quite dirty, and looked like it had needed a sweep for several hours. \n\nToday I went back in the early afternoon to order a quick snack and green tea, and while the people working were very nice this time around, they messed up my order and when I was on my walk home I noticed that they'd given me peppermint tea instead of green. Blech. So far not my favorite Starbucks.", "author": "Elise S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Starbucks has just finished remodeling and IT'S AWESOME!  Better tables, more space, tables with COUCHES!   If you want quiet study at the tables on the right.  Outlets, there's some facing the windows, and my favorite are the tables of the left with couches (outlets are under the couches).  They start cleaning the right side at 1am, and the left side around 2am.    \nThe staff here are really friendly even though they're basically pulling all-nighters working and they make an effort to get to know all the regulars.", "author": "Janine M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "Alicia the cashier should get a raise! Despite long lines and a wait with impatient, rude, holiday guests, she still gave service with a smile and even offered to recycle my gift card with no balance. She is the best! \n\nHope her manager or the company sees this and she is recognized. \n\nMerry Christmas Alicia! Keep doing it right :)", "author": "Christine V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-28", "description": "If there was a way I could give a negative number for stars, this Starbucks would have it.  Big issue here is, along with being the only Starbucks in town open 24 hours, this has essentially become a homeless encampment.  Sitting down somewhere and lounge with your drink is impossible since there are bums sleeping everywhere.  Most of them don't even have drinks to begin with, yet enjoy the usual essentials a paying customer would normally enjoy.  Using the bathroom is an adventure too! And the people that work here doesn't care, but then again, why bother sending the homeless off when you're vastly outnumbered and risk being shanked? On top of everything else, the wifi here consistently lags and when it does work, it's slower than molasses.  Whoever owns and manages this Starbucks should be ashamed of themselves.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-23", "description": "I only come to this Starbucks because it is a block away from my doctor's office. But I try to avoid it if I can. Everytime I come here, I order my regular drink (same drink I order at any other Starbucks). But it doesn't matter if I ask them to double (or even triple) the caramel or chocolate in my drink, it still just tastes like milk. I don't even know why I bother with this Starbucks anymore.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "I have been in many Starbucks to order my drink and today when i came in to THIS Starbucks, a red head girl was very mean. I order in Venti cup and she said \"no we cant do that because people pour milk in there\"\n\nHello, i dont need no damn MILK because i need a true COFFEE not a damn MILK. \n\nThis is very unprofessional and lack of knowledge of her - the red hair girl to listen to a customer order. You need to learn more on every each customer taste.", "author": "Kristy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-10", "description": "Awesome team! I asked for an item off the Starbucks Secret Menu (Chunky Monkey Frappe) and Will whipped it up with a smile on his dial. Fantastic study spot, 24hrs, safe neighborhood and friendly, skilled staff :) 9/10, would study here again!", "author": "Gia P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-26", "description": "I do not think the employees are too swift.  Neither are the drinks or food.  Let me explain.  \n\nI watch my weight.  So I asked for a large black tea, unsweetened, and also said \"no sugar.\"  Went home with it.  Poured it over a larger cup of ice, the way I like it, tasted it, and it was sweetened.  Yuch! \n\nA couple of weeks later, this past week, I went back, made it clear again, \"unsweetened, no sugar.\"  This time, I watched the young girl take the black tea,  shake it, good, then turned around and pumped what looked like a clear liquid, syrup, into it, and I said, \" no sugar!\"  She said, with another young girl right there watching and not contradicting her, \"It is syrup, not sugar.\"  I said, \"that is sugar, it is a sweetener!,\" incredulously, the other girl still silent as she tried to argue with me.  She finally threw it out and started over.  \n\nU-N-B-E-L-I-E-V-A-B-L-E!!!\n\nThe guys at Peet's Coffee, also in Laurel Village, got it immediately and were rolling over laughing when I recounted this to them!!!!!  One of them, who is also a prep chef, and had worked at this Starbuck's for a couple of years, described the dumbed down equipment used.  I believe it.  I am an architect who does restaurants.\n\nThe drinks are way watered down, on top of it.  And for someone like me with Celiac disease?  Nothing with gluten in it, I have to go gluten free.\n\nI will pass on Starbuck's always now.\n\nAdded later, and took a star off ----- \nWhen I heard Starbucks's was going to hire 10,000 illegals instead of Vets, I threw my hands up in the air.\n\nThe reason college graduates cannot get a job or one that will pay them enough to pay their college education loans back is because the elitists are using the illegals to drive down prices.  That is the bottom line.  Frankly, it's evil to the core.\n\nSo Starbucks, you just put yourselves on the side of the elitists.  And you are losing masses of us.", "author": "Janet C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-16", "description": "Just wanted to add an update that if you get hungry and don't want to pay $5 for Starbuck's measly non-nutritional breakfast sandwich, head up the sidewalk to Cal-Mart next door open Mon-Sat 7am-8pm & Sun 8:30am-6:30pm and head to their DELI section where they make tasty decent-sized deli sandwiches for $7.  Be careful shopping in their regular grocery section since they ARE more expensive in this upscale neighborhood.\n\nI forgot to add also that you can BE FREE of those long lines for your drink by downloading the starbucks app at www.starbucks.com/coffeehouse/mobile-apps for your mobile device.  You select this branch where you'll pick up your drink and their menu is presented to you on your mobile screen and then you order & pay on the mobile device and then your order goes straight to the barista who will have your order ready by the time you get to starbucks.  I usually pay with my app if I see a LONG line which NEARLY ALWAYS happens here at this popular Starbucks.  The only problem I have with the starbucks app is it takes up so much memory over 150MB.  You can increase your memory by buying a mobile SD memory card for your mobile device to hold your large docs(including music, videos) to make room for the starbucks app, but hey, to avoid waiting in 2 hour lines, it's going to STAY on my smartphone and I'd rather delete the other apps!!", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-19", "description": "So this review is long overdue!  I find it funny how I've been coming here for years since I work at the hospital down the street, how much the staff has changed in the last 6 months or so. I usually come here after a shift around 9 or 10pm sometimes... this is usually a busy time because it's when the SFPD night shift usually starts.  Regardless , every time I come here with co workers or just by myself I think it's the manager ..or supervisor, an older black woman has taken my order and every damn time she does not fail to have the worst and the most sour attitude with me. It's like she has a personal grudge with me. I know I have not done anything to her but wait my turn and order in the most polite way. I have witnessed her treat other customers like shit as well.  I have witnessed her berate a customer because english was not his first language. Smdh...starbucks should be ashamed to have a person like this on their staff!  She is rude, demeaning , and flat out doesn't give a shit how she is treating the customers. I mean we are paying for the drinks and she does work at Starbucks. She's not the owner and she's definitely not better than us. So how about you just do your job! And pretend to be friendly for once !... if you hate the job that much, don't work at Starbucks where you have to interact with people every day. I'm so sick of her attitude and have stopped coming here unfortunately.  I hope they get better staff and remove this rude and careless person, she should not be working in a customer service job....bitch should be working where she doesn't need to interact with anyone. \n\nAnd no, it's not always open 24/7 this same woman has kicked me and my party out around 1am before .", "author": "Coraline J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-07", "description": "This is probably the best Starbucks store you can get in the city. Large store, lounge chairs in the front, communal and single tables in the back. \n\nIf you need to work I suggest to walk towards the back and grab a table over there as this is where the outlets are located.\n\nPatrons are a mix of students, locals, and the occasional weirdo that is part of every San Francisco neighborhood. Parking can be found on California or on one of the neighboring small streets.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-07", "description": "Best Service in one of the busiest shops in Town.\n\nNeed to clean the bathrooms more often; too much funk in there", "author": "Craig B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-10", "description": "This place has gone downhill. \n\nClean the restrooms every 30 minutes. Trash in stalls should never get to the point of a pile on the floor. Find a way to fix the men's toilet for the long-term. Mop/sanitize the floor if an overflowing toilet is leaking enough to run under tables where customers are sitting, especially if multiple customers have reported it.\n\nLock the back door so that it is only an emergency exit in the evenings or get a security guard for the back entrance. When a thief can grab a backpack from a customer and run out through the back door then you don't know how to do security.\n\nKeep coffee bar clean and stocked by checking it every 30 minutes (hopefully not by the same person cleaning the restrooms). \n\nThis is a great location with plenty of customers, but if you cannot keep it clean your customers will go elsewhere or corporate will replace you with staff that can do their jobs.\n\nThe only reason I gave it a whopping two stars is because they are open 24 hours and they have divided sections for quiet study, relaxation, and talkative small groups.", "author": "Jackie J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "OK, its a Starbucks, so five stars is relative, don't expect gourmet food or five star table service.\n\nThat said, this Starbucks is head-and-shoulders above the others.\n\nThere are three registers, so they get you through faster (less waiting for your caffeine fix) and it is very nicely decorated, with a number of comfortable seating areas, so the place has a nice look and feel.\n\nI would not drive across town to visit but if you are nearby and needing a cup of Joe, it is worth stopping by.", "author": "Gary A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-29", "description": "Sorry, mint/chamomile/herbal tea. You get boring after awhile. \n\nSometimes you just gotta live it up. So I got the cafe mocha WITH whipped cream. Fattening, no nutritive value, foamy ... cream. MMM.\n\nOther MMM things about this Starbucks: it's newly remodeled and the flow is more open with lots of seating now than before. Plus, it's OPEN 24 HOURS. Wait, what? yes, you can look it up on the website to verify that or call like I did just now. The barista wasn't amused when I said, \"you're really open 24 hours?!\" and he said  \"yes, we are ...\"   yawn. Oh hunny, looks like someone needs coffee.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Morning Joe. Busy place but they have enough team members to move the line fast; super fast!", "author": "Austin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "Very nice friendly staff and efficient customer service. Thumbs for being a 24 hour coffee shop here in San Francisco. Whether you're in need for a bottle of water, cup of coffee or a place to use the restroom at 12 am? You can count on Starbucks!\n\nStarbucks Coffee have their own brand of Kettle Style Potato Chips?\nBreakfast Sandwiches available at 2:00 pm?  Seriously? Props!\n\nBRIEF REVIEW UPDATE FROM 7/3/2013:\nThis is one of the Starbucks Coffee Shops with breakfast sandwiches available during lunch and midday. If you want to be able to get a bacon or ham breakfast sandwich, come in during breakfast. I came in between 12 pm - 3 pm, and the only breakfast sandwiches available were the sausage ones.\n\nOverall, good selection of food and beverage menu items. Friendly staff and efficient service so I'll definitely be back when I am in the area!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I don't normally rate coffee shops, but heck this is an all hours store that caters to the medical staff at CPMC and all the students nearby.\n\nIt is the community concept that all coffee locations desire.  You'll find people doing business or studying at all hours.  Mix that with pre-natal mommies and others and you have a pretty vibrant location.\n\nDownside is that it is pretty busy and studying while coffee is grinding is probably pretty annoying.  I've had a meeting or two here where people obviously listen in (so we make up stories).  \n\nIts a great location for me and the closest coffee shop to my home, especially when the Peet's down the street closes early.  Always nice to go for a walk with my gal and grab a cup of coffee after dinner on a cold night.", "author": "Erik H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Nice option for a late night coffee/tea and place to journal, work, or catch up with a buddy. Arrived on a saturday night around 10pm and was greeted by a friendly barista. My cousin and I sat for an hour and I left happy that we found this spot. I'll be back.", "author": "Kristy F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-30", "description": "Worst Starbucks I've ever been to. Rude staff, slow, and unprofessional. It's too bad, because it's a great and busy location.", "author": "Gale R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "4 stars for cashier, 2 star for cleanliness since people do not clean up after themselves and staff is super busy with so many customers.  2 stars for the bland seating area of brown. 5 stars for verona coffee. 5 stars for free parking in the back. 5 stars for 24 hours, 5 starss for all them windows.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-22", "description": "I've refrained from writing reviews on the various Starbucks unless a particular store was worthy of a shoutout.  \n\nImagined my surprise today when I entered from the back parking lot.  Hmmm, the tables alongside the wall have been rearranged.  More lighting, more tables and chairs added.\n\nThen I approached the front and I noticed that the coffee line has been reformatted. The communal counter that used to block traffic has been removed and more overall seating area. Remodeled store for the better.\n\nI'm feeling happy with the improved changes.  And most happy when the barista gets my name correct!  What a great way to start my day as I'm headed to the dentist with my latte in hand.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-25", "description": "It's tough being a 24/7 business, tending the draw the homeless crowd in with warmth and bathrooms.\nThe baristas were quick with their service and occasionally did a precusory sweeping around the store.\nIt's a decent place to study with lots of table space but pretty crowded even at 11pm on a Saturday. Outlets are also in short supply. But I can't knock down any place that provides caffeine at any hour of the day so 4 stars it is!", "author": "Tina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Have to update my review, since I have come back, and each time has been better.  Yes, some people are still rude space hogs, treating place like their office/living room.\n\nBut the staff works hard and they're great, and it's a nice option to have nearby.", "author": "Geri C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-03", "description": "I just came from this location and my experience was literally so bad that I have to write this review. It's not a particularly busy Thursday night and only one man was waiting in line in front of me. A red haired woman, who I'm assuming was a manager, started reprimanding an employee right in front of customers and other employees. She was unnecessarily harsh, telling him something along the lines of \"hurry up and leave when you're off because when the customers see you in your uniform and you're not working it irritates them.\" I don't wanna tell you how to do your job but what we probably find irritating, if not extremely inappropriate and uncomfortable, is having to be present while you embarrass this kid in front of us. After apparently dismissing him, she said something under her breath and looked visibly irritated, which kind of made the atmosphere uncomfortable and awkward. After that a customer in front of me had some sort of issue with her order that she was also upset about. The worker at the register next to that situation that was in no way involved decided that he absolutely had to stand there and ear hustle instead of take my order. \n\nALL THIS FOR A DAMN CUP OF PIKE PLACE.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-13", "description": "Restrooms are are always dirty. If you are not a regular customer the staff is not friendly.  Ask for a cold beverage with lite ice and my cup was also filled half way with ice!!! I don't like to send foid vack so I took it and left the store disappointed!", "author": "Yolonda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "I love this Starbucks. It is open 24 hours...and always has someone sleeping (drool seeping out one side of their mouth) with their laptop on...at 5 in the morning.\n\nThe people that work here are amazing: The most friendly, down to earth, and competent people of ANY Starbucks I have been in. Their Doppio espresso starts my world in the right way.\n\nIf I am snoring to loud in the morn...please give a gentle nudge and put my laptop on standby...thanks in advance.", "author": "David G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-05", "description": "BEWARE: OF WIFI FRAUD -large area, very friendly staff, but while I was here today using their WIFI my credit card information was stolen and charges rapidly started accumulating. I did not charge what I ordered. I paid cash. The fraud started somehow while I was using their unsecured internet. IT WILL TAKE DAYS TO UNDO.", "author": "linda l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-09", "description": "I stopped in on my way to apartment hunting. There were two baristas behind the counter, one asian guy with earrings and a slight buzz/mohawk, and another guy with a long ponytail. I only mention their descriptions because these guys were super friendly and awesome. They were attentive to customers who were coming in, they didn't rush anybody. These guys were also chatting with each other while restocking and stuff, and just having a good time. Good vibes when the workers are happy.\n\nI ordered a tea, and asked for a recommendation. I got \"Joy\" tea, which is a mix of black, green, and oolong tea. When I got mine, it was piping hot. It smelled so good though. Good enough, that I bought one for the friend I was about to meet. She loved it :)\n\nThis table I sat at was not cleaned, and there was nobody sitting there. There is a lot of space, and on the side, there were a bunch of small tables that were all taken. I don't go to starbucks often because I don't drink coffee, but I had a good experience here. \n\nI often return to places that have great service, good vibes, and/or great food. I may or may not be back to this particular location, but I will keep it in mind!", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "I recently realized that Starbucks has been a part of my everyday life now for over ten years.\n\nOver 10 years?!\n\nThrough the years, we have gotten to know each other very well, & our relationship has just grown & thrived.  Today, we are as strong as ever.  \n\nSo, I would like to just say a few words...\n\nStarbucks,\nWhen we first met, I didn't like you at all.  I certainly did not think of you as a potential relationship, since I did not care for your seeming disregard for the small business man.  I thought that you were self absorbed & selfish.  I didn't trust you.  So, understandably, I kept you at arms length.\n\nAnd, seriously, your being from Seattle did not help matters any.  I'm a San Francisco snob.  Even worse; a North Beach snob.  We NB'ers drink espresso imported from Italy for chrisake.  Who the (bleep) is \"Starbucks\" from Seattle to show up here & who does he think he is?  What kahunas!  We turned up our noses, & oh...how we laughed.  You were mistaken for merely another interloper; not the first, & surely not the last.\n\nI figured you would continue your feeble attempts to lure me to you, & I would just continue to blow you off, & then you would be on your way back to Seattle.  And you would be completely forgotten.\n\nHow wrong I was.\n\nI can't put my finger on the exact moment you started to breed my interest instead of my contempt; but I do know that once you got me to turn that corner...I never turned back.\n\nProfessionally, you proved your integrity by the way you value your employees, contribute to your communities, & work to sustain & prosper our valuable resources.\n\nPersonally, you impressed me with how you are always there for me whenever I need you.  Day or night.  Even all night sometimes.  And it doesn't matter where I am; because wherever I happen to be, there you are, too.  You're always receptive & accommodating.  You always listen.  You have always happily put up w any requests I have.  When I switched from low-fat to nonfat lattes, then to soy, then back to nonfat, then back to soy again...not once did you so much as bat an eye.  And all those times I couldn't decide if or what I wanted to eat, you were always just as patient as could be.  When I wanted low fat, you gave me low fat.  And when I wanted organic, you gave me organic.  It seems that you just love making me happy!  Seriously, I've annoyed myself on many occasions.  But you?  Never.  What's more, you're always accountable for your mistakes, & you always make up for them.\n\nI can't imagine my life without you.\n\nIt is for these reasons & more that we are still going strong.\n\nThank you times a million.\n\nFaithfully & forever yours,\nV.\nXoxo", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-30", "description": "Went to get my drink and the lady with the red hair (clearly matches her devilish soul) was not helpful whatsoever. My order was clearly to hard for her to comprehend (clearly she lacks knowledge) so she claimed she couldn't do it. Every other Starbucks makes it for me. Kate, Ray and the other African American male deserve 5 stars for their helpful serves but lady with the red hair doesn't even deserve one.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-30", "description": "I'm only giving three stars because of the young African American gentleman at the register, he assisted my friend and I with no problem. Now let's talk about the unnatural disgusting red head who hates her life, job and shows it. My friend goes to Starbucks everyday and orders the exact same thing. The unruly red head was beyond persistent with telling us she could not make the order because we might dump our drink and pour milk into. She then goes on and says it's policy while she's telling her coworkers to not make the drink.  How inappropriate and unprofessional of her to not even attempt to make the drink. Will never be coming her again", "author": "Rasheda S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "I posted a picture on \"add a photo\". There are two trash holes right where you dress your coffee and a canister right beside it for recycle and compost. All four openings were overflowing and left like that for the two hours that I sat in the lobby. Everything else was fine but that right there deserves one star bc I have never seen this before at a starbucks and it is completely unacceptable. Disgusting.", "author": "Tiffany J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-15", "description": "This is the Starbucks I frequent most since I work blocks away. I've always had wonderful service and most of the staff is super friendly.\n\nOut of all the experiences I had, today is the most noteworthy. Where do I begin? No greeting, no sort of feeling ackowledged. When I ordered, the cashier never made eye contact with me. When I made one drink order, she assumed I was done ordering and tried to rush me along. I was trying to order 2. I asked for extra room in the coffee (didn't happen. Had to dump some out myself in the trash...such a waste) and for lite whipped cream on my cocoa (also didn't happen). She ended our interaction with \"thank you, you can move along and get your drink at the other end of the bar\". Cool...I've never been told to \"move along\".\n\nIt would've been nice, considering the holiday season, to be treated like a human being. I understand that it is busy but a second of acknowledgement is just that, A SECOND! And that one second is enough to leave a lasting impression, good or bad.\n\nIf you choose to work in food/drink service it is part of your job to acknowledge the customer. Otherwise, maybe work somewhere else if you don't care for human connection.\n\nI wish I remembered her name. Started with an M or N. Will update when I go back", "author": "Camilla G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "They just revamped this Starbucks and it looks like a European cafe lounge.  Nice ambience with a big lounging area and areas to hook up your computers and work or study away.  I love how there's always a long line here yet the service is always friendly and superb.  I think the people waiting in line gets aggravated sometimes but who can blame them for not having their morning coffee yet.  This is a 24 hour Starbucks so you get an array of students from all over town coming here to study and socialize on their breaks. It's a great place to people watch and just enjoy your lattes.", "author": "Sharon N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "I really liked Cynthia and her service and the handsome, tall, blonde gentleman.", "author": "Tyler A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-06", "description": "A 24 hour Starbucks within walking distance of the hospital your child is staying in seems like it would be a huge bonus.....well not if it's this one. I was so disappointed! \n\nThe location was fairly clean, but that's where the good stuff ends. I was here multiple times at different times of day. The counter sandwiches were never stocked....maybe 1 to 3 sandwiches at any given time in the cold cases. Juices and other cold beverages were sparse as well. The baked goods counter was also very lightly stocked. Each time I ordered my drink, it was made differently, never tasted right and never tasted the same way twice. It's so disappointing!!! \n\nThe kicker is, that out of 12 employees I encountered, only 2 were even close to friendly. The rest acted as if the customers were an annoyance. I'm glad to be home and back to my regular Starbucks location!!!", "author": "Laurie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Liv and amber are the best baristas Iv ever met in my life. They got all 15 of our drinks perfect. Had awesome conversation. We're fast and amazing. I love them", "author": "Angelina P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "I typically go here from 11pm to 4am as I'm a night owl and this is one of the only 24-hour places in the city.  Generally there are two different groups of employees.  One group is awesome.  They're friendly, fast and thoughtful.  The other group is not as great.  Particularly the manager who tends to be grumpy.  For example, when you ask customers to move to the other side of the store so you can mop the floor, that's fine, but why do you have to yell at customers who don't immediately understand you or didn't hear?  I understand that a decent percentage of customers at night are \"characters\" who might be difficult to work with, but it's not acceptable to yell \"excuse me sir but no you don't\" across the room to the grad student (who later I noticed was ESL) who had his headphones in when you originally mentioned it and was about to sit down.\n\nBut hey, it's late night at Starbucks, so what can I expect?\n\nupdate: Went there again and that same manager was rude.  I ordered an iced tea and forgot to say \"black tea\" and she gave me this dirty look and held the silence for a second and then snapped \"I can't make it for you if you don't tell me what kind\".  I would just assume that it was her style of communication, but I notice that she treats the other employees much more nicely.", "author": "Erem Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "Have to say, first off, that the two staff I dealt with came off as friendly and helpful. The place was clean and well-stocked with pastries, etc.\n\nHere's my problem:\n\nI always order a Venti Chai Latte with 7 pumps, no water, no foam, and I specifically ask for WHOLE milk.\n\nThe barista's first attempt tasted thin and barely sweet. So I requested a redo, which was graciously given. He even asked, in a friendly manner, what was wrong with the first attempt for the purpose, I presume, of satisfying his customer. I explained, but it turned out not to be enough. Unfortunately, the second one was only slightly sweeter than the last, but no where near as good as I've had it done by so many other Starbucks baristas.\n\nI decided not to try a third attempt as it would only serve to frustrate both me and the barista.\n\nNow, when this has happened before, maybe 2% of the time, sometimes I'm told that I should ask for eight or nine pumps, or that WHOLE milk diluted the sweetness.\n\nThe other 98% of the time, other Starbucks baristas get it right the first time round (and on occasion, the second time round), with only the same instructions to go on.\n\nIn this case,I had left a pre drink tip of $2. This time round, they only deserved maybe 50¢.\n\nBut it's these little human errors - at any given place - that makes one choose to go to the competition for his next few lattes, in order to wash out the flavour of customer dissatisfaction. Then, one returns for another, hopefully, deliciously made to order latte at good ol' Starbucks.\n\nBut until then...", "author": "A.R. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "I like that they're open 24 hours.\n\nI like that it's always crowded, no matter what hour you walk in.\n\nI don't like that it's always crowded, no matter what hour you walk in... there's never anywhere to sit, unless it's near the restrooms :( \n\nThe staff is nice, too.  I don't think I've ever had to have them remake my beverage.", "author": "Kristin H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "Totally LOVE this Starbucks. I come here whenever I am in Laurel Village to see my Doctor. I always stop by here. Seating is plentiful. The bathrooms are nice. There is an entrance in the back as well as front of course. This Starbucks is also open 23 hours if I'm not mistaken. \n\nI have to say that this is the most expensive starbucks it seems. The staff are sure to charge you for even the slightest pump of syrup or condiment. That totally gets on my tits be other than that Im a fan of this one.", "author": "Julian I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-24", "description": "Horrific experience this morning, walked in an open door at 3:30am to get coffee only to be verbally assaulted by an employee who demanded I leave because they were performing a \"deep cleaning\" I pointed out that their signs, and website indicate they are a \"24 hour Starbucks\", the employee yelled at me that she told her district manager they have to be closed from 11pm to 4am and I had to leave...very hostile, very confusing and false advertising....never ever going to a Starbucks again!!!", "author": "Jo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-17", "description": "First if all the service in this Starbucks has totally gone downhill. I will be making a report to their corporate office. \nI came in tonight and purchased a $6.45 Ham Sandwich as I often come here for coffee or both. One thing is it's too bad their crew always changes. Well after my purchase I had to badly use the bathroom. Had to wait 10 mins. then the employee TYLER cleaning the bathroom told me another 10 mins. I asked him if I could use the men's room since he was done cleaning it. He said no cause the floor was wet. I asked if I could use the ladies room since he hadn't started on it yet, and instead of accommodating me, he said NO cause he will be mopping the floor then it wouldn't be ready for another 10 min. after that. I asked the girl infront and she said just to tell the guy. I explained that I really needed to go. I'm a diabetic and when I have to go, I gave to go. I expressed to the other employee that I had a urinary problem. I had to explain my medical issues so I could use their bathroom. It was humiliating. I have never been subjected to this kind of humiliation in front of other customers ever!!!!!!\nExasperated, that TYLER comes up to me and starts saying things to me about the bathrooms and his cleaning but what reverberated in my head was when he said IF YOU REALLY NEED TO GO, THE HOSPITAL IS NEXT DOOR! \nWHAT KIND OF CUSTOMER SERVICE IS THAT? To INSULT ME EVEN MORE BY TELLING ME TO GO TO THE HOSPITAL???  Would you say that to a pregnant woman? I am a customer. I just bought my overpriced sandwich. REALLY? CORPORATE YOU WILL BE HEARING FROM ME!\nI am not not one of the bums that frequent t this Starbucks , as a matter of fact far from it. The nerve an audacity to mock me of my medical problem! HOW DARE YOU TYLER! I WANT THIS KID FIRED !", "author": "Debbie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-23", "description": "If you want to wait over 20 minutes for your drink while everyone who ordered after you receives theirs, then this is the location for you.  Unhelpful employees who lose your drink, and tell you that you'll have to wait another undisclosed amount of time to get your order because they \"have so many drinks right now.\"", "author": "Christina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-29", "description": "Lines here are almost always (the dozen or so times I've been here) extremely slow. Couple times I've just left because of the unusual wait. I love the atmosphere though.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "You know..the think about coffee is that you need it 24/7. Not just to cure your morning headaches related to a lack of your caffeine fix, but also for those sad scholars trying to make their college tuition mean something. Which is exactly why I love the \"California Starbucks\" which is so conveniently located on California Street and so conveniently open 24/7.\n\nThey just recently renovated the place, so it is much more open and is now featuring even more spaces for you to study, chat, or read a good book. It also has a ton of outlets, which is so necessary seeing that 90% of people sitting here are on their electronic devices (I'm guilty too). \n\nThe bathroom has two stalls, which is beautiful and unheard of in any Starbucks, but Cali Starbucks is special. \n\nThe only downside is that parking is kind of a drag. There is a designated lot, but it's only 90 minute and there isn't much all day parking in the area, just a bunch of 2-hour parking. On top of that, everyone working at CPMC California tries to snag all of the good parking. \n\nWhatever the case, Cali Starbucks has all of the sugar, caffeine, and open hours you need to live your nocturnal life, so I'm definitely glad that it exists.", "author": "Cara O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-28", "description": "5 stars because this Starbucks is open 24 hours and has ample space for working and/or studying. I spent plenty of all-nighters here while I was going to school in California. Wish there were more 24 hour Starbucks, but I get that it's only worthwhile for Starbucks to stay open all day in larger cities with more foot traffic.", "author": "Connie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "THE LAUREL HEIGHTS STARBUCKS HAS REOPENED.\n\nAs expected, there is slightly more room, and about 3 or so more electrical sockets, but it definitely looks clean, sleek, and spiffy now.   There is more light in the back corridor area where the seating expansion occurred, and the bathrooms are now *unlockable* (which is atypical for a Starbucks), and the bathrooms can accommodate multiple people at a time.   No more will people hog the bathroom to themselves for hours doing who-knows-what.    Definitely not friendly to homeless people trying to take a bath at the sink now.  Before the upgrade I also saw a fisherman with a pole and fish bucket leave the bathroom just before I entered, and there were fish scales clogging the sink and fish guts in the trash can.   I doubt any of those creative uses of the bathrooms will occur now.  Thank God.\n\nAlso as expected, the wifi is still painfully slow.  It's AT&T wifi.  No upgrade there.  I clocked the wifi in the uncrowded store, (uncrowded because many don't yet know it has reopened), at 2.23 Mbps down, 2.84 Mbps up.  Once it gets crowded again, expect it to drop to 1 Mbps down and up, or if it has a lot of heavy bandwidth users, 0.5 Mbps down and up.   For scale, streaming *one* HD video won't need much buffering at 2 Mbps.   So close all your web pages if you want to stream a video.   Expect to continue to hear people complain about the wifi being \"dial-up\" speed.\n\nBut for those who must have a late night Starbucks with fast wifi, I noticed the Dublin Starbucks (In the shopping center off of the Hacienda Dr. exit) which is open to 1 am every day was recently upgraded to Google Starbucks wifi.    It is also a very big store with plenty of shopping mall parking.   It might console a few of the aggrieved that the Laurel Heights upgrade doesn't include decent wifi.   The Dublin store is probably the closest Starbucks with both late night hours and fast wifi that you can actually park at for unlimited amounts of time as well.\n\n(And actually, since the Dublin store is larger than the Laurel Heights store AND has Google wifi AND has vastly more parking...I'd rate that Starbucks higher.   But like the Laurel Heights store, it is also tends to get packed with people day and night, ...students and mall goers, but fewer homeless).\n\nNot sure what commenter \"Amir\" was smoking when he reviewed, but Laurel Heights has quite a few homeless camped out there most of the time.   Police are frequently called in to roust them as they try to sleep on the couches in the evening.   There is also a loud schizophrenic who often tries to hang there, but he shouts out scary stuff so the police are usually called in to boot him as well.   But he always returns.   The homeless problem in fact is likely one of the main reasons for the remodel....so the baristas can monitor both entrances and all the seating more easily.   The expansion in seating is, by comparison, minor, and by itself would not make much of a dent in the seating issue.", "author": "Trevor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "The best experiences with the entire Starbucks company by far! Ara was very personable and courteous. In the San Francisco area this personalization of service is really hard to find. More quantity focused than quality. I had questions about the new bagel \"batam\" (stuffed bagel of some sort) she provided comedic reviews and great recommendations. I love my drip coffee very creamy. Like, more cream than coffee and she priced my coffee to fit that little bit of information, which I love. Because, college tuition.... If the manager is reading this. I have never visited you location but because of Ara I will make sure to stop by. She works hard and has a very happy disposition while at work. Her smile alone is infectious. Invest in the right people! With that said give that girl a promotion!", "author": "Quincy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "The guy making my drink today was really friendly and made sure my drink was made how I wanted. The cashier was nice too. \n\nThe place was clean and the service was fast.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-02", "description": "Had some time to kill so we stopped at Starbucks and ordered two hot chocolates.  I told the cashier no whip on both, but he failed to write it on the cups.  When the barista called out our order, I saw there was whip cream in both so I told her that we said \"no whip\".  Instead of her making us new ones, she just casually scooped out the whipped cream in both cups.  Aside from that, my hot cocoa was extremely sweet!  No bueno!", "author": "Candice H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "4 stars because it is 24/7 !! Come on man!! The coffee is good too. 1 star less because sometimes it is packed I mean most of the times which makes sense and there are some frequenters that get annoying, I mean they talk and stuff, not a biggie. I'm visiting anyway, wi fi acts up sometimes, only good signals you get around the corner close to the bathroom, sometimes people make a mess in the bathroom, sometimes people talk loud, I wish it was twice the size it is right now ! :) maybe next time I'm visiting SF ...\n\nUPDATE:\nIt looks like that wi fi covers the whole place now not just that dungeon dark corner next to the bathroom! I'm so happy now. Thanks SB. last weekend they closed around 12:30 am. Maybe they're not 24/7 anymore? Sunday 7/26/2015", "author": "Majid D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-10", "description": "This is regarding the bathroom. I walked in and quickly walked out. It looked like bums had been bathing there for a week. Truly disgusting. Made me question the drink I ordered as well.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-13", "description": "I ordered a small coffee and sandwiches. I stand up and waited for a long time until I finish my sandwiches and I asked where is my small coffee. And the one who make coffee just give me the one at the counter but that is not my name on it. When I open the cup that is not coffee, so I complain and another lady just begin to make one for me. Terrible customer service. Don't go again.", "author": "Yelp W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-15", "description": "Word to the wise:  this is a very busy Starbucks.  If there is a line, it is not out of the realm of possibility that you might wait 30mins for your latte. Definitely preorder if you are in a hurry.", "author": "Nan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "I come to this Starbucks very often whenever I need a place to concentrate and need to work/study long hours - especially during the night. It may be hard to find a spot if you go on busy hours but I never had a problem about that as I usually come around 12-1am. Staff is friendly.", "author": "Ilke A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Dude they should do a 20/20 special on this specific Starbucks! \n\nI've never seen anything like it anywhere.... and it's changed my life!\n\nIt's 24 hours, and every one of those hours this place is packed with people working and studying!\n\nFreaking awesome!!!", "author": "Nolan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "I come here very often when I am doing long walking jaunts around the entire City. These usually last for a good solid half day's time, and the kidneys are fully functioning... where better to stop off than this excelente Starbux, to both refuel and micturate?!\n\na POPULAR joint/location.. open 24/7, almost solidly smack dab in the midle of SF. I'm a big believer in all that is offered here... cannot wait for Monsieur Pascal Rigo to work his wonders with the pastry case, and am very much waiting with baited breath to see what the future holds. \n\nPS can you please start selling croissants that gives Tartine a run for its popularity?", "author": "Jana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Got my usual apple cider from this Starbucks. Same experience, the menu looked different than usual. There's a big parking lot in the back, so don't find metered parking.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "A smooth running machine. The staff are uniformly professional and friendly. There's no place I'd rather wake up to.", "author": "roger m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-13", "description": "All workers are friendly. Except the manager , her name is Wanda , a rude master . I felt very frustrated.She treated one of my friends \"a foreigner with strong accent \"very rudely and with bad attitude.", "author": "Walid T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-12", "description": "I only come here at night when I want to get out of my apartment and do some homework. When I come the service is always the worst out of all Starbucks locations I've ever been too. I might be grumpy too if I were doing graveyard shifts, I don't know. And it's always a miracle if you can find a seat. The place is always packed until well after midnight so good luck.  Starbucks needs to make a few more locations 24 hours so we aren't all fighting over this one and Westlake.", "author": "Nick M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-28", "description": "What's going on with Starbucks?  There's this extremely rude lady named Wanda there. My goodness. How does she still have a job at this place. I read other reviews about how this place is going downhill and that is extremely accurate. I use to come here daily but no more. How do these people get jobs? Who's doing the hiring?  I don't even want to waste more time writing about this place.  Left me with a bitter taste.", "author": "Erick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Open 24 hours a day which is nice. Lots of inside seating for working.  Very spacious.  Offers a good variety of snacks.  Staff was meh. Granted I was there at 2am but overall a good experience.", "author": "Lynsey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Parking convenience is great! Staff is friendly and experienced so the line keeps moving. With volume of customers it can be at times messy but it's literally always packed!", "author": "E H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-06", "description": "Two stars because my mocha cookie crumble came out perfect.\n\nHowever this is to the cashier with grimy dirt under his finger nails and just stared me down until I actually came over from waiting in line to order. He has a ponytail and CLEARLY did not seem to care at all for I repeated my order not twice but three times before he got it right.\n\n1. Call me over nicely and politely if you are ready to take my order. Customer service was clearly not there, I noticed much more because as a retail worker, I know how other workers in customer service act when they are doing a less than up to par job.\n\n2. Your grimy ass nails make me want to throw up. Do you even wash your hands? How do I know my drinks and snacks are not getting contaminated by what's growing (and clearly thriving) under those finger nails. You are pathetic.\n\nAnd what truly set me off, I ordered THREE gift cards for my friends and he took them and threw them on the counter like nothing. Excuse me, I am paying for those and I do not appreciate having what I bought thrown around like that. Had I more time, I would have made a scene and called the manager. \n\nNeedless to say, this man who assisted me at the cashier is an embarrassment to the Starbucks chain. I am disappointed Starbucks hired this man. All other workers I've seen have been welcoming and wholesome except for this man.", "author": "Melissa V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Absolutlely my favourite Starbucks in the city. Store is noticeably larger than most and contains tons of seating and work areas to be productive . Did I mention it was 24 hours?!", "author": "Eddie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-26", "description": "This Starbucks is always so crowded.  There's never anywhere to sit!  \n\nIt is nice that it is open late hours though.", "author": "Alison L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "It was a busy Friday morning at 6:30 AM at one of the busiest Starbucks in the city. The line was to the door. Once I paid the cashier I walked out to my car  just outside, to grab my cell phone. I walked back in and looked for a place to sit; found it and before I could sit down my quad espresso was ready. That's fast!", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "At 11pm, we needed some caffeine fix and heard about the 24 hour Starbucks at Laurel Village.  Since we were in the Richmond District, we made the drive to check out this Starbucks to get our cup of Joe.\n\nStreet parking was not an issue.  This Starbucks was large quite large with many tables and some couch seating.  I guess with this being probably one of rare locations open so late at night, every table was occupied and just about every person had a laptop. \n\nOne good thing was that only one person was in line to order.  We ordered decaf coffee, but the cashier said they didn't have any brewed, but they could make some with their Clover coffee drip. Cool!  We heard about the Clover and that only select locations had it.\nThe coffee was so flavorful.  In the evening, many Starbuck locations will make an Americano for the decaf and it does not taste nearly as good as this Clover drip.\n\nIf in the area and in need of some coffee late at night, this Starbucks will be my \"to go\" location.  Just don't count on getting a seat or some pastries or dessert as the case was completely empty.", "author": "Al L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-22", "description": "These two stars are given because of the appreciation to the store manager.\n\nThe story was my daughter ordered the Very Berry Hibiscus thru my iPhone app. Her order included 2 scoops of the berries. When she got her drink, she found that there were only 2 berries in the cup. Then she told the black lady who made the drink about this. But that lady said it showed 2 berries on the order. My daughter ordered this drink many times in different Starbucks and never got issue. We opened the app and tried to find out if my daughter ordered two berries instead?! But it did show \"scoop\". We tried to show her the phone and she totally ignored us.\nI told her that I wanted to talk to the manager, and she just pointed the guy at the cashier was the one. She kept showing \"Not care\" on her face. What kind of customer service it was!! \n\nLuckily, the store manager understood the issue and made her the replacement.", "author": "Gemini L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-01", "description": "This is the best place for someone who have office / school work to be completed with a feel of coffee. I usually have cafe mocha. It's awesome and I won't even mind spending the entire day here. Why I should not like a place where I can get my things done that too with a coffee ?", "author": "Pratik J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "The cashier looks like he doesn't want to be here no smile whatsoever sheesh don't like your job just quit\n\nBut guy preparing the drink was awesome", "author": "Shakeel T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Props to the hard working folks here, got here on a Sunday St. Valentines Day, packed!  The weather was nice and they are working.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-26", "description": "I thought about giving 3 stars, but decided to give 2, but really, they only deserve 1. \nI have been coming here for many years. Not very frequent but steady as I love to go to books inc. then come here to rest a bit after buying books and visiting banks. \nI agree with other people, the service here had really gone down hill! What's wrong?\nLast week I ordered two latte, and asked for Sth with a handle  to carry it , as I have other things on my hands too and can't use that tray thing they put out.  The guy making the coffee kind of abruptly said \" over there\". Ok, so went to the cashier. I waited until one customer paid and left, I thought because I was obviously here earlier than the next in line and was holding two steaming hot coffee, I should be served first? no! The girl told me to wait bc she wants to serve the other person first. I went to the next cashier when that one was freed up. I paid for the \"bag\", as they called it, but found out they gave me a regular shopping bag! How do I suppose to carry two coffees  in a shopping bag? After some more explanation  and rushing around they did found Sth to hold the two cups. Then I went to get the shopping bag. The girl who refused to serve me asked the girl giving me the bag If I had \" paid for the bag\"? The girl answered \"yes, it's paid\". She's kind of embarrassed to answer that question. What did that girl think? I would steal their 0.10 cents bag? !\nI have to say services every where are going down hill. those young people, they don't care.", "author": "madeline m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-24", "description": "This place is nice but they need wayyy more seating if they want to be a 24 hour place. Almost the whole store is taken up with displays in the front. So my boyfriend and I had to stand around drinking our coffees basically in front of the counter. \n\nPlus the baristas were super rude to us! We paid together and they asked if we wanted our receipt and I said no, why waste the paper right? But then when we wanted refills they loudly said they wouldn't give us refills without the receipt and that was store policy. I don't understand why she didn't tell us this when we she asked if we wanted the receipt. The girl who took our order was nowhere in sight to back us up that we had literally just bought these cups like 15 minutes earlier, and we were shocked at how defensive they were about the policy when they had already explained that it was enforced loosely. We especially didn't understand because they must have seen us literally standing right in front of them as we drank. It was pretty stupid, but we eventually got refills and left. Just really embarrassing to be treated like bums in a very crowded Starbucks.", "author": "Meghan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-25", "description": "Always busy but service is fast and friendly.  Recently remodeled now has a long bench and new configuration that allows more additional capacity.", "author": "Nessa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-11", "description": "I'm not rating this Starbucks for their coffee and it's taste... I'm giving this location 4 stars for its 24 hours feature and the accessibility of parking.\n\nAlso, I've had the fondest memories here with my best friend when we were back in college... didn't know what to do moments so we ended up driving up and just hanging out and having those conversations of \"what if's\" \n\nThere's been a lot of cops around here lately at night... but I guess that's good to keep the peace and quiet inside. Also, the baristas are friendly even if they're working 24 hours!", "author": "Cath M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-12", "description": "Your standard Starbucks that plays jazz in the background and packed with everyone from the kid who just got out of school to the octogenarian reading the newspaper in the corner.\n\nThis place is packed with college students from USF as well all on their laptops (apples more than pc's as expected).\n\nLots of room and table space but it's always so packed that you may not find a chair.\n\nSupposedly open 24 hours but as some people have said this may not be true...but I can't confirm as I've never sat outside watching.", "author": "Julia P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-22", "description": "The service at this Starbucks has gone completely downhill. I work in the neighborhood and I'm there 3 nights a week, getting coffee and sandwiches. Recently there has been a change in personnel, resulting in long lines and risking being late to work. 9/21 was the last straw. Myself and my co worker, both Rns waited over 20 min for our order. The poor barista was obviously new , and in the weeds. The shift manager , a stout redhead, was stocking and laughing with the cashier. I finally asked, could I just cancel my order I'm late to work. The shift manager responded with \"'she's doing her best, we're busy or something to that effect. I then said why aren't you helping her and this unleashed a barrage of back and forth where upon I learned that this is the 3rd busiest Starbucks in Northern Cali, and that she, the shift supervisor her job was to stock pastries for the morning \" or people won't have anything to eat\"... Umm , that's not my problem, and I actually said \" you're handling this very badly\". Did I mention the place was packed? And this interaction was taking place over a counter in front of everyone?I'll spare the details but it's interesting when I look at the other poor reviews, this redhead is mentioned as being rude, and the manager I spoke to this am said she was \" recently promoted\"! And while I'm on this epic rant, I've also had poor interactions with the infamous Wanda! She is rude AF! I mean blatantly. At first I felt bad for her being middle aged working nights at Starbucks but that quickly faded when I was treated badly more than once by her. I work with the public, I know it's difficult and I respect the barista jobs, but I can save 6$ and make my coffee at work in a keurig. Totally done, not going back. I'm sure they won't miss my money because \" we're the third busiest Starbucks in Northern California\".", "author": "Anne Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Love the service and staff calm and friendly!  Keep coming in when we are in town.  Love their food and coffee", "author": "D M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-19", "description": "Can this place get better WIFI?  Come on starbucks add a little data to your internet plan.  \n\nStaff = awesome.  Hours = great.  Seating and outlets = pretty good.  WIFI = 56k dialup\n\n\nIf you are going to accommodate 2x or 3x more people than an average Starbucks then  have the WIFI to match it.  Good luck if you're trying to study or get work done here.  Forget about streaming a song or video!  Just sit there with a state of the art laptop and fire up Notes b/c thats about all your computer is good for..", "author": "Eric V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-26", "description": "I play video games enough to know how to really put someone's wifi to the test (starcraft II) \n\nAnd comparing how they each turned out at the same times, this location has more space, more conveniently placed outlets and strong wifi signals. This is now my go to place...for all night drinks.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-03", "description": "This bucks is huge..open 24 hrs is a plus but its seriously always busy, no matter what time of day!\nCan be hard to find a seat.\nNice ambiance\nThere's a code to use the bathroom.", "author": "Linda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "24 hours.  what's not to like about that?  I hate working alone and its nice to be around other awake people at 4 in the morning.  I wish it was closer to the bay bridge so I wouldn't have to drive though the hilly part of S.F, but oh wells.  \n\nThere is tons of seating here.  Outlets are a bit more sparse but in the later hours of the night it's not much of an issue.  The wifi isn't very strong.  Night staff are very friendly.", "author": "Mason T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-03", "description": "Sit by the handicapped table with your phone out (don't hate, all the other seats were occupied) and a thief will magically materialize, charge through the door, and snatch your iPhone from right under your face and then with magical cheetah-like-speed and strength, sprint down the block into a get-away-car! Eff!! Don't say you weren't warned!!\n\nOn a more + note, the coffee was just fine.", "author": "Raymond Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-27", "description": "As a fellow partner, I found this store very nice.\n\nOf course, like many Starbucks, you may find the obstacle of finding a place to sit, looking at a smudgy pastry case or even possibly, a slight spill on the condiment bar, but you'll find that at any cafe.\n\nHowever, what impressed me was seeing that there was consistently a barista out in the lobby cleaning the condiment bar, tiding and restocking the retail wall.\n\nGreeted by a partner (I believe his name was Gene), my sister and I came in wanting just a couple drinks. After ordering a mocha and my sister grabbing one of the new Evolution juices, I felt that he definitely treated us with a genuine welcome. \n\nOccasionally, the transaction process can be uncomfortable, however, he continually attempted to strike conversation, discover exactly what we wanted in an efficiently and in a timely manner.\n\nHe was definitely one of those partners who I consider as someone who truly embodies the Starbucks mentality, someone who invests in creating inspired moments, which is the very reason why I love going to Starbucks, enjoying their drinks, eating their pastries and even now working for them.\n\nThat's why I wanted to share my appreciation for this particular store.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "Spacious, great friendly staff and Clover brews available.  Win?  Yes.", "author": "Eric F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Open 24h, google wifii, good service specially \"John\".\nOnly bad thing is that sometimes it's too cold. Also it would have been nice with power outlets by the couches", "author": "Amir S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "This place is great for studying if you could find a table. It gets pretty packed. It is a lot nicer since they've renovated. Customer service is great! They give out samples sometimes. There is 90 minute parking in the back. WiFi is weak unless it is in the back near the restrooms.  The only drawback is that there are vagrants and druggies that come through here, some of which use the restroom to clean themselves up. That means the restrooms can be pretty dirty, but this is also due to heavy traffic and many non-homeless people don't clean up after themselves so vagrants aren't entirely to blame.", "author": "N N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-24", "description": "Large place. Drinks seem to be consistent with other Starbucks. Sometimes hard to find a seat. But....WHY IS IT SO COLD ALL THE TIME????", "author": "A. E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "It gets busy busy in here! Lots of students camp out here, fyi. The place is spacious, but packed. Love that there's a parking lot in the back for 2 hours. And plenty of outlets, too.", "author": "Suji C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "When you need to get sh*t done, and you're down to the last few hours in the middle of the night, this particular Starbucks is a good place to go.  Even if you don't really have anything to do, and just want to stay up...for the sake of staying up, this Starbucks is probably the place for you.\n\nOpen 24 hours, they can definitely help you get your caffeine fix to avoid falling asleep in the wee hours of the morning.  Parking is ample, whether it be on the street or in the rear parking lot, so kudos for that.  Just don't bank on always being able to find a seat; they've probably tried to arrange everything so they can maximize the number of chairs and seats, but it can still get tough because of its popularity.\n\nThe baristas are cool, and they've never messed up with any of my drinks.  Great place to just chat with friends or to people watch during the day...and to test your limits on how long you can stay awake continuously.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Absolutely love this location. It's pretty much always open, and you know it's a safe location because there's always cops hanging around outside. There's a good amount of seating and plenty of outlets for studying. Professional staff, you can tell they're used to working fast and dealing with all kinds of customers. And most importantly, my drink was delicious! Great job guys.", "author": "Miranda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "Great location, great 24h service and spacious. Although it can be pretty busy at some times, it is possible to find a place to sit at.\n\nBest to go early in the morning or after 8pm if you want some peace.\n\nOnly con: wifi is really bad/slow.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "As I prior employee I give this Starbucks five because it has the most heart out of all the stores I've been it/worked at. Workers are fast, nice and genuine. They go the extra mile for this store and the team.\nTo those fools who just wander in one night not knowing how this Starbucks works: the floors are mopped EVERY NIGHT so EVERYONE has to change seats, don't be surprised about it, be grateful that there is a place open so late. The people that work that shift have it rough working 8pm-4am. Show some respect before you write a review of the whole store based on your own ignorance.", "author": "Noemi S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "I use to have a friend that use to be a manager here in the late nineties and that was way before they remodeled it.\nI think it is more open and you have more privacy &\nThe walls and floor and surfaces are all smoother now.\nAlot of cops come here: 24-7\nHospital workers: early am\nMiddle a school age :after school 2pm\nCollege age students :cramming late night 11pm- morning\nThey have new smoothies \nThats what i ordered here compared to my normal \nNonfat.    Soy.    Decaf.      Latte.   \nI got the Green one with exta kale and protein \nBut i recommend if u get one \nGet one with fruit so it is more sweet\nMine was fine but i like sweet things \nI just got that one cause k wanted less calories \nIt was super busy as usual when i came here a couple of days ago in the afternoon\nI saw cops.\nMiddle school age kids\nBusiness meetings(mini )\nAnd people on their laptops.\nThe best thing about this one is \n( if they r on their old schedule is)\nThat they are open 24-7!\nAll others close at night and iopen. Back u p at 5 am.thats another reason so many \nHospital -cops- and college kids come here.", "author": "Jennifer G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "I have died and gone to my 24-hour room heaven.  After experiencing the 24-hour room in the library at Davis, I was so happy to find a place to do work that wasn't a room full of crowded desks and fluorescent lights with life-drained students.\n\nWhat I really like about this place is the open window-walls.  It allows a lot of light, easy people watching/distractions, and makes the place feel open.  The service is exceptional - all the baristas are happy to make your drinks, do any accommodations, and let you sit for hours on end.  There is no rush feel that some coffee shops and other starbucks have.  \n\nThis place is definitely made for work.  The way that the tables are placed, tables of different heights, couches, outlets everywhere - they make it so that it will be as comfortable as an experience as you can get while doing work into the wee hours.\n\nThere is also a nice neighborhood outside if you want to get something to eat, walk around, or go grocery shopping next door.  It definitely is in a lively neighborhood.", "author": "My An V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "This location tops the list for customer service. \n\nI used to be a regular here, but now only visit sporadically. On my now sparse visits, I'm still recognized and welcomed as if I were still popping in on the daily. Love that.\n\nThe staff are ALWAYS friendly and personable, even in the wee hours in the morning, when everyone's either still groggy or in a rush to get to work. They're great conversationalists and well, just plain old good people. Gene/Jean, who I assume is the manager, is awesome. He always greets me by name and hooks it up from time to time. \n\nThe drinks are well made - no complaints there. Baristas are more than willing to adjust drinks or fix them if improperly done (which is RARE). I've seen them assist pickier - and sometimes, even rude - patrons, still with smiles on their faces. That's  great work ethic, exceptional, even, and I appreciate that. \n\nThanks to Laurel Heights Starbucks for always being quick, efficient, and most of all, being a great team!", "author": "Nicole I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "Parking in the back?  Thumbs up!\n\nIt's a pretty spacious location, and considering it's open 24 hours, the place is really clean.  Friendly staff too!", "author": "Gina J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-26", "description": "I like how it's big and all.. There's many seats but there's not enough plugs for all those seats .. And the hand driers make SOOOO MUCH NOISE!! .. You could hear that thing across the continent .. Like who thought having handriers was the best idea ?? They don't even dry the tears from my face after hearing them every 3 mins ;(", "author": "Alexis B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Park in back! This is a great bucky's. Lots of parking, lots of WiFi. One side of the place has no electrical outlets which makes it quieter than the other side where people are having a mini-party around a computer and the others are trying to do their homework. Good overpriced coffee, just like anywhere else.", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "It's Starbucks. What else can I say.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "I like this Starbucks. The staff is really nice. It's a great place to do some work for a few hours. Internet is reliable and it doesn't get too loud.", "author": "Midori H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "My go-to Starbucks! Reliable as it is open 24/7, staff is laid back, friendly, and know how to move the line along, they have a Clover, and there is plenty of seating. Unfortunately this location is not secret and many have made this their hang out spot, so seating is hit or miss. Wifi becomes incredibly slow when you can count 10+ laptops in use, because that means 30+ devices could be hogging the bandwidth. Don't get me started... \n\nNevertheless, great location, plenty of street and lot parking, comfy couches, and other factors make this a great place to work or relax.", "author": "Lana L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-16", "description": "I think a human being can get reincarnated before you can even open a page in your browser with this wifi. It's that bad. I'm not joking. Who has this kind of wifi at this age. You will not get my money or any students money for this bad wifi.", "author": "Maya A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-17", "description": "I'll go ahead and give it the full complement of stars despite the fact that it is always packed and can be hard to find a place to sit. The reason for the stars? There are a TON of outlets, almost every single seat is genuinely comfortable, it's clean, the staff is nice, they don't harass you for camping a table 4-8 hours and only buying a single hot tea, and also the people who frequent this Starbucks.\n\nYou get a lot of people obviously working, a lot of students - even those who are really loud and giggly don't bother me as much here as in some other places. You can ask someone to plug in your laptop charger without them glaring at you, and you can feel comfortable leaving your stuff at your seat to save it while you go to the bathroom without feeling afraid someone will run off with it.\n\nOpen 24 hours is SO AMAZING since I live above a bar and am quite sensitive to noise. So when I need to get out of there, I know I can go to a comfortable place with nice people, free internet, and reliable drinks.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Simply the best Starbucks in town. \nI've been going to this Starbucks going on 8 years now. I've seen plenty of staff come and go, and they've all been over the top excellent. I've made some good friends from this place. \nThey always are friendly and are prompt on getting you your drinks on time and exactly how you want. \nIt can get a little busy, but that's just because of the location. The best part - they know how to function calmly when it's over crowded. Lots of places haven't mastered that. \n\nAnother plus for being open 24 hours!", "author": "Carlos R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "The best starbucks I've ever been to. Not only are the drinks great, but the staff is AMAZING (Hi Gene, Nick, and some other guy that I never knew the name to!).This is the only coffee shop I've frequented where several staff know you by your name and always greet you with a smile and say Hi. The staff also seem to work great together; always smiling and they seem like they are having a good (yet busy) time. I work close by so it's a highlight of my work day when I get my drink there after lunch.\n\nI will be moving soon, and one of the first things I thought of when I decided to leave was: I will miss this Starbucks and its staff!! It makes me sad thinking about it. Hope I'll get to visit again when I'm in SF.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "This Starbucks is like a party. I've never seen Starbucks employees having such a fun time while helping a tons of customers.", "author": "Shane R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "In terms of customer service, it really does not get much better than this. I know each and every one of the staff members I've had the pleasure of interacting with has been fun, pleasant, and put a smile on my face. This location is ALWAYS busy with people and they're able to keep the line moving! They know what they're doing and they enjoy what they do!\n\n What prevented me from giving a 5th star is that I find the tables to be messy and in need of being wiped down; with the amount of people coming in and out I can see how that might be overlooked. This isn't going to prevent me from coming back, though. I enjoy doing work here. Thanks Starbucks! Keep doing what you're doing!", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "24 hour Starbucks?! Definition of the BEST Starbucks I've ever been to! However, be aware that you'll have to wait for seats and swoop QUICK. I'm usually pretty polite but if a seat opens up, I usually just take it because who knows when the next one will come up! \n\nIt's a good place to study!", "author": "Connie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Came by for a quick cup of coffee, on a nice cold and rainy morning.  Definitely some interesting characters, which reminded me a lot of Santa Monica... I think the 24 hour opening probably attracts them to this location.  Friendly employees, and surprisingly quick service.  Makes a good combo with Noah's for me... :)", "author": "Steve L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "I was just told the bathrooms were closed after I bought something and confirmed at the counter the bathroom was available. The mens bathroom was backed up and although the manager (at least he acted like the manager) hadn't actually said the women's bathroom wasn't working, he closed it anyway saying his \"pipes were backed up\". It was an emergency and he still didn't allow me to use it despite the alarming look on my face that I was about to pee myself. I was very tempted to dump out my drink, go in the parking lot and refill it with pee then leave it there. But I am a lady after all. The kind folks at Pasta Pomodoro next door saw my panic and let me use the facilities. Now that's customer service.", "author": "Caryn M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Clean bathrooms, friendly service, full baked goods selection even at 4:00am. So thankful for this place. My new pitstop for Uber Shifts.", "author": "Monique M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "It is just a starbucks but having a place that's open 24 hours is amazing.", "author": "Dana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-16", "description": "Having woefully miscalculated my arrival and departure dates, I found myself without a place to stay on a Monday night. I could have begged a friend or spent $20 at a hostel, but instead I spent $20 and the night at what seemed to be the only 24 hour place in the bay area with wifi, seating and outlets. It went okay. \n\nThe bathroom code is 559. There's an outlet on the ceiling, right above the chairs/couches by the window at the barista's right. \n\nThere's a graph of seating availability and internet speeds over time here ( http://i.imgur.com/FLizO.png ). Field notes here ( http://pastebin.com/heEfNc4A )", "author": "Michael F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "Not your average customer friendly Starbucks usually generated by the chain, albeit this location pumps out your beverages like toothpaste, which is remarkable considering the amount of consumer traffic this 24 hour location receives.  This is sole reason I gave them a two star rating.  \nOnce, I got through the few customers waiting beside me I ordered an Iced Hibiscus Tea and I requested it sweetened.  I want to note that today will be my second time requesting this drink and it will be my second time because my girlfriend liked it and wished for it.  The cashier had pleasant cordial personality while this younger gentleman with a shaved head and a ponytail,  who assisted the cashier, on the other hand did not.  I'm guessing he perceived my request as foreign with the lost look he shot at me.  He said something else with manner of a cocky connoisseur.  I just replied \"if you can make the hibiscus tea sweetened then that would be great.\"  My order came out and my girlfriend approved.\nOn a side note, I saw the same guy with a shaved head and ponytail pull out a plastic container clearly marked \"LOST AND FOUND\" from underneath the front counter and went through its contents without justification.  If that's not enough to make you wonder or think twice about leaving your stuff behind, then what happens next will.  This guy reached into a bag from a container I must remind you is clearly marked \"LOST AND FOUND\" and stuffed what appeared to be a wallet INTO HIS POCKET!!!  I hope and pray this is not someone else's belongings and I am giving this shaved head guy the benefit of doubt.  Just something to consider.  Secure your belongings!!!", "author": "Manolo F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-26", "description": "This review is strictly towards \"WANDA\". She was probably the only RUDE barista i've ever encountered at any starbucks. That might sound a little exaggerated, but it's the truth. I fully understand that starbucks is by far one of the few places that has a constant high. BUT as an employee at any hospitality joint you have to always maintain a professional attitude towards customers. (speaking from experience). ANYWAYS, Before I even had a chance to approach the counter while I was in line with my mom she literally yelled, \"NEXT!\" literally, as if we were across the room. So we approached her and she didn't even give us the chance to think as she immediately said, \"What do you want?\" in the sassiest attitude. I asked my mom first and my mom's not sure so she says never mind and as this is happening i see WANDA straight UP roll her eyes at my mom. SO I tell WANDA my order before her eyes roll all the way to the back of her head. She said the price took the cash didn't even repeat the order, nor ask if we wanted a receipt. Just gave the change and said next. I CAN'T EVEN..... Luckily it was Christmas or I would've went off on her. Sass to me fine, but not my mom.", "author": "Pj A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-10", "description": "Open 24/7!! Used to go here to take my breaks between shifts. Easy access to bathrooms in the back.", "author": "Princess Kate R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-21", "description": "Avoid after 5 PM. Jam packed with too many kids 'studying' with expensive MacBook Air laptops and iphones and headphones on for affect, trying to look cool, while buying nothing. Depressingly sad. Never enough seats for real customers, students sitting there for 6,7,8 hours at a stretch each, this place has the atmosphere of a examination hall or the written test section of the DMV. Only other people who use it are cops and taxi drivers because of its 24 hour status. Why the management tolerates these students deterring paying customers really is a poor reflection on Starbucks.", "author": "Elton C. O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-08", "description": "As an update to my previous review. I was sent a generic sorry letter from Starbucks corporate and 2 free drink coupons. Which was nice. But then approx 1 month later I got a message from the new manager, with a personal apology, and an offer of some more drinks if I would come back and try them again. I also got an update that he was no longer employed there. \n\nI have gone back several times and have been very happy with my experiences. I have gotten high quality drinks & service, exactly what I expect from Starbucks. And it's great that they are open 24/7 (except a few hours late Sunday night/Monday morning)  And I'm very impressed with the way things were handled.", "author": "Venus S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-18", "description": "Staff were all super friendly and cheerful even though we walked in two minutes before their weekly four-hour cleanup closing. Barista even laughed politely at some dumb joke I made. \n\nThe place is generally pretty busy (seems to be the only all-night coffee shop around), but it had lots of great seating options and looked very clean, too.", "author": "Crys L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-07", "description": "Employees running their mouths loudly non-stop. Can't hear myself think. Sounds like a high school hallway or MTV Real World in here. Manager needs to have a talk with his staff.", "author": "Hugh M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-14", "description": "Saturday mornings have gotten much worse here the last few months.  The line is always 20+ people long and the staff is very inefficient.  Usually I see just 1 person making the drinks, with cups lined all along the counter back there.  I've been going here for 2 years every Saturday on my morning break from work, but now I'm always late getting back.  Nobody seems to be in charge at this Starbucks and it's pretty chaotic.", "author": "Nic P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "An unusually large interior and the fact that its open continuously make this Starbucks a go-to location. If you're driving there is plenty of parking available - not like the Marina or Cow Hollow - jeebus.", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "As you're probably already aware, this place is open 24/7 and that's the only recommendation it really needs. Do you know how hard it is to find coffee shops that are open 24/7 in San Francisco?? I'm currently slaving away over a startup and as a result I spent 90% of my time taking advantage of free wifi in coffee shops while downing sugary lattes (glamorous, I know). Came here for the first last night, stayed for a few hours. Ordered a caramel macchiato, which is actually the only Starbucks drink I ever get. It was fairly lively at 12 AM Sunday night/Monday morning, which I guess means I'm not the only one in SF who has no real life outside of work. There aren't actually that many outlets, which is kind of annoying, but I managed to make it work. It's fairly spacious. Other than that, I don't know what to say--I mean, it's a Starbucks so you already know pretty much exactly what's like, but it's open all the time which is awesome. I wish it was more conveniently located--I really don't like having to Lyft 10-15 minutes to get to Laurel Heights--but otherwise no complaints.", "author": "Ava H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "Quite frankly, I think that there should be way more 24-hour Starbucks. I absolutely love this one-- I just wish it wasn't so crowded and difficult to get to, if you don't have a car here in the city. \n\nThis place is awesome. The environment, especially in the evenings is great! When the older, retired crowd starts to move-out around 4:30 or so, the college/grad students start to linger in. It feels like a campus college cafe where students are free to socialize, but also eager to get work accomplished. It's fun because you see law students, nursing students, and undergraduate students who are all studying for some type of upcoming exam. For the most part, everyone is really friendly. Even the people who work there are super respectful and outgoing. They enjoy the interactions with their customers and are happy to greet you. (or at least pretend to;) Everything from the mellow music, to the lighting, to the seating arrangements-- there is always something that someone can appreciate. Another bonus, you don't have to worry about the homeless trying to get money from you (I mean, come on, most of us are way worse off than the homeless since we are mounds and mounds in debt) and you don't have to worry about their lingering odors; which is really nice. \n\nOh, and another perk, it's really nice when they come around and give you free samples. Free samples always cheers you up! :)", "author": "Fawn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "Once upon a time was a college student at Berkeley I worked at a coffee shop nearby. It had barely any open hours, and cool clients and I couldn't stand dealing with them.\n\nThis place caters to the ass hats of my neighborhood - laurel heights yupster moms and bratty usf kids. AND it's open 24/7 .\n\nYet the staff has never lost their shit, in fact they are somehow way happier and nicer than their green aprons would leave you guessing. Probably the worst place to work and yet the least disgruntled staff.\n\nBoo on the clients, boo on no chairs ever and boo on the line.\n\nBut hurray to this staff, 24/7 access to ... Well anything in the small town of SF, and it's location.", "author": "Aria J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "Not going to shoot this location 5 because its packed like crazy with kids. If your showing up early no problem but after 9 forget it.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-21", "description": "The wifi is absolutely terrible. You can't even connect to the access point! I'm assuming when you do, it's at a crawling speed. The general manager is totally ignoring this problem, I'm assuming. If you need to get work done, don't come here. Go to Pete's up the block or just use your cell data; as slow as that is, I'm sure it's much better than this poor service.", "author": "Hector O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "Overall a great place to come at night and study. Big Starbucks, but is easily always crowded. Friendly staff. and people don't mind staying all night to do work.\n\nSemi-slow internet per every Starbucks, and a few regulars who either stink or come in here to sleep. -___-", "author": "Shock S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "I will start by saying I am kinda a hard man to please.... I have a weird way I like my tea.\n\nI ordered an Earl Grey on Ice. The person behind the counter gave me a \"Piss off\" look and said we only serve it hot. I decided I would explain in 1st grade terms what I wanted.\n\n1. Grab Vente Cup \n2. Put ice in said cup\n3. Put Hot Earl Grey in said cup filled with ice\n4. BAM... You my dear have just invented an Earl Grey on Ice\n\nNext time please address me as Sir when I enter!", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "They have Clover Coffee!!\n\nIf you don't know, Clover is Starbucks new drip coffee. It is a must-try and available only at select locations.", "author": "Jess C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "I LOVE how this starbucks is 24 hour. A LOT of studying space here. There is also a parking lot in the back which makes everything soo much more convenient! \nUnfortunately.. I have to give this place 4/5 stars. They always seem to be running low on the pastry selection! How can I drink my coffee without a cake to go with it??", "author": "Annie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "This is a really popular spot, especially for students, so if you're coming at night, good luck finding a spot.\n\nThat being said, the coffee's pretty standard for Starbucks, but at least the baristas work fast and efficiently. This Starbucks is huge and is a good space to do some studying if you're lucky enough to find a spot. It gets crazy when school gets out or at night when people are pulling all-nighters.\n\nOtherwise, I recommend this Starbucks over most. Atmosphere is chill and the layout keeps it from feeling cramped.", "author": "Raymond B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-01", "description": "Open 24 hours in a location that very convenient!\n\nThe Positive:   the employees are friendly and will remember what you order pretty quick; you can park in the lot right in front; not too crowded late nights; very convenient location. \n\nThe Negative:  Very hard to find seats. Seems like people never leaves their seats.", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-08", "description": "It's dependable, the location is pretty convenient, and the baristas are always friendly.  Often the music is played unnecessarily loudly, and finding a seat can get pretty tough during rush hour, but overall it's worth the risk of having to wait 5 minutes. \n\nIt's probably best for studying, but can work as a place to catch up with a friend too. Watch out, around 3pm (on weekdays) the place gets a little crazy - schools out! So all the kiddos come in for their fraps. It's sort of cute though... so don't complain.", "author": "Zoey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-01", "description": "I LOVE THIS STARBUCKS. they lie about the 24/7 though. they're closed for an hour or two on sundays in the wee hours of the morning, just saying. i've gone there when it was closed and it was quite heart breaking. \n\ncaramel apple spice, enough said.", "author": "Bianca W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-04", "description": "After sitting down for about 15 minutes, this Starbucks decided to close the section I was sitting in for cleaning. It seemed a little arbitrary and I discussed it with the barista and she didn't care. She also wasn't interested in helping me relocate across the room somewhere. She essentially said it was my problem and I needed to find another seat.\n\nI moved to the only vacant seat on the wall and it was some sort of broken, caved in seat that sat about a foot beneath the other seats. I also got to sit very close to a nice Asian man who was on his laptop beside me.\n\nOahu coffee is mentioned everywhere and they don't have any of it.\n\nThe blonde girl behind the counter was very nice and she's the only reason I didn't give this location 1 star.\n\nI used the men's bathroom and it was totally disgusting. I mentioned it to her that it could use cleaning and she said ok, but didn't clean it.\n\nI cleaned my new table with an alcohol wipe and it was black and disgusting, indicating the tables aren't cleaned well at all. Ick.\n\nAbout an hour later, the girl made me move again! She said I could move back to my old seat, but someone was in it. I think it was pretty obvious that someone was in it, too. Apparently, she had to clean the other side of the room at this point in time.\n\nThey have nothing healthy in their glass display case. Everything is full of sugar, empty calories and carbs. No whole wheat, nothing high in protein and nothing even remotely healthy.", "author": "Jason G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-30", "description": "OK location, but what happened to the 24hr schedule?  OK, I haven't been to this location for awhile and looks like they recently renovated the place, again.  Lots of outlets for power-hungry users and make sure to bring a power-strip to share the wealth, yo.", "author": "Chi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "Bring a jacket if you are coming here to study/read and are going to stay for a few hours, it gets pretty chilly. Lots of room for sitting, and only 24 hour coffee shop in the area is a plus", "author": "Simran K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-15", "description": "Hi, 24 hours! \n\nI came here with a friend to study last night. The place was bigger than most Starbucks with a bunch of places to sit -- from couches to wooden chairs. The place seem to be packed around 12AM but people eventually leave and go home to their cozy beds. However, my friend and I stayed there like a trooper till the sun slowly rose.\n\nI got a white chocolate mocha, which was just the way I liked it. However, I was not asked if I wanted whip cream or not. I'm not being picky, but eh. No big deal. Also, the music was a little too loud. You got people studying and napping here so can't we just... pipe the Nutcracker down just a little? \n\nANYWAYS, I'd still come here again because it's 24 hours though. I am still a long way from graduating, sniffle.", "author": "Karry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "Nice space, and the coffee was served by nice people and tasted good.  But the ATT Wi-Fi has been a disaster the two recent times I was here.\n\nI think we should be able to expect good Wi-Fi at significant Starbucks, but this place is failing on the Wi-Fi front.", "author": "Gregory D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-01", "description": "What sets this Starbucks apart from others is it is open 24 hours and one of the bigger Starbucks in the city.\nDrinks are consistent like most Starbucks so I accept them for what they are.\nAs for the space it is quite nice with plenty of outlets so if you are one of those people who dislike the occupy Starbucks types I would stay away during daytime.\nWashrooms are kept clean generally even though this place sees quite a bit of traffic. \nParking can be an issue as there quite a few businesses in the plaza. It becomes quite easy in the after hours when other businesses are closed. \nCrowd is usually a lot of med students putting in all nighter.\nThis became my go to spot to grab a good my java fix when going on a long trip in the wee hours of the morning. \nStaff is pleasant as well so what is there to complain. \nP.S. On a hot day this place does get quite warm so one is more inclined to stick to the icy drinks too cool down.", "author": "Elvis A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-24", "description": "just got a \"m'lady\" from the cashier ^^\n\nStill a great place to study, people-watch, and meet new people! I talked with an elderly man who shared with me about his time serving the army in Korea. I really like the environment and the people that come here.", "author": "Hana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "I needed a cup of coffee.  It was 11PM.  And the phone navigator sent me to the Starbucks on 19th...right before closing.  Ok.  Where is the more coffee at this time of night?\n\nStarbucks in the Laurel Village center!  That's where!  \n\nThis 24 hour establishment is a ringer for late night coffeeshop needs.  Parking is obviously, very easy because it's the only place in the shopping center open at a late hour.  Validated parking is during the day, FYI.  Don't forget to get your validation stamp!  There's a back door on the lot that funnels you to the front counter and you don't have to walk all the way around in inclement weather.  (Not that it's that far of a walk.  It is on the corner after all.)\n\nBecause I usually feel like a pilgrim in an unholy land just out of my need for coffee and landing in a Starbucks, I never notice anything else other than just getting my coffee and getting out of these places.  However, my partner in crime pointed out this snazzy contraption behind the glass called a Clover coffee maker.  Upon further questioning, the barista tells us its a bit like an inverted french press.  (Apparently, been around a few years.  But really, it's a Stanford-engineered, vacuum, inverted, French press thingy.  $11k a unit.  But who's keeping score?)  I'll try anything other than that cigarette pack flavored swill percolating in the tank for who knows how long!  We got two of these Clover coffees, different flavors.\n\nWatching them perform the elaborate operation to make a single cup was entertaining.  A whole lot of stirring, filtering, vacuuming, etcetera for a single cup.  If you're in a hurry, get your frappé-thing and just go. Turns out, this stuff isn't half bad.  Definitely a smoother, more flavored cup of java.  Not overly bitter.  Really changed my paradigm of Starbucks.  Later, a realization was made that the recommended flavor of one of the cups was the most expensive on the list!  Hey I don't care.  Good job barista!  Doin' your job makin' a sale!\n\nOther store details:  \nIt's clean inside...blah blah blah.  Sell tons of coffee stuff.  I definitely don't like the fact that there's table campers almost everywhere here all the time, making it hard to get a seat or a comfy seat or sofa by a window.  It's a real turn off for me because that clearly means there's not a lot of rotation going on for folks that want to drink coffee and interact with other human beings.  People even fall asleep at tables!  It looks more like a university computer lab in here than a coffeeshop.  You just got to watch like a hawk and strike when you see a seat open up.\n\nWithout a doubt, it's got to be the safest place in town as many of the local law enforcement community stop in on a frequent basis.\n\nOh little Clover machine, how I miss you...", "author": "Marty S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "Great staff at this location -- the place is clean and the service is excellent. It's also open 24 hours. And that's a 5-star Starbucks", "author": "Alex A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "the only 24 hour starbucks in the city im a fan", "author": "Leigh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "Recently renovated, this particular Starbucks location is full of suits and strollers.  Upwardly mobile women in power suits and clicky heels zoom through here to pick up their double shot soy lattes, as Spanish-speaking nannies sit around commiserating with each other about watching someone else's blonde toddlers.  It's definitely a much different neighborhood experience than my usual haunt in the Sunset.\n\nIf you are looking to sit by yourself while reading a newspaper or using your laptop, this is a great location:  there are TONS of seats/banquettes set up specifically for this purpose.  And there's even an area of comfy brown leather couches for socializing over by the window.  \n\nWhat makes this Starbucks location a little bit nicer than average?  Well, for one there's FREE PARKING in a generally-crowded parking lot behind the building.  And this location feels very ROOMY, well-laid-out.  It's clean, efficiently run by friendly staff, and there are no bums lounging around on the furniture spreading bed bugs.  But there is still one lovely detail that makes this Starbucks just a slight cut above most of the rest:\n\nIt's open 24 hours a day.\n\nYes, you read that correctly.  What could be more fabulous than dropping in here at 2 am for a nice, soothing, post-clubbing mocha, or studying all night here for an exam?  Or sitting around kibbutzing with friends until all hours after a nearby Italian dinner at Pasta Pomodoro?\n\nIf only ALL Starbucks were open 24 hours a day!!!!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-11", "description": "I had a low-fat chai tea latte today.  It was great.  A little too hot for my tastes, but hey.  I know there's nobody yelping to see what the big deal is with this whole new Starbucks thing, Just looking to vent a little.\n*I dislike the holiday themed cups.  Makes me feel uncomfortable. IDK why.  Fine- I hate them.  Take them away please, ASAP-", "author": "c d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "Great, friendly staff who serve up all your Starbucks' favorites. The Laurel Village Starbucks location has all that you expect from the chain. The one issue keeping it from 5 stars is that with all the windows and the corner location it can often be quite warm inside the cafe. Like many SF businesses, I don't believe they have air conditioning, but when you're drinking hot toasty beverages it's nice to be in a slightly cooler temperature. Starbucks still has the best hot chocolate so it's worth bearing the heat!", "author": "Ben B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "When a Starbucks location exists within any 2 mile radius of you, it seems hard to find anything noteworthy or unique to say about any one experience. What makes this Starbucks any different from every other one out there? A $12,000 piece of coffee machinery set to send any engineer or coffee geek into a tizzy. \n\nSo in the window, there's this sign that promotes \"Clover.\" Thinking it had something to do with tea, I ignored it for the most part. Then the barista asked if I'd like just a regular cup of the house blend OR (pointing in the direction of this exclusive looking contraption) \"a Clover cup.\" Regardless of the cost, I had to know what the Clover thing entailed, so $2.95 later, I watched on as she pulled the 100% Kona beans out of a plastic container, measured them into a small tin, ground them up fresh to order, dropped them in the top of this Clover brewing system and watched as a stainless steel filter lowered my grind into the brew chamber. Hot water (at exactly 180 degrees) poured into my brew and not before long, I had a fresh cup of crazy good coffee.\n\nI'm just as pretentious as the next Californian when it comes to individualized drip coffee, but Starbucks just took a sleek, geeked-out approach to what a place Blue Bottle does best: serving you freshly ground coffee at the peak of its flavor.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "This place is pretty good for a starbucks in the city... free parking?!?! WHAT? Good amount of seats... but they could probably add a few more if they didn't have those displays in the center taking up all the room. Staff is friendly. Place gets pretty busy though. The only reason I took a star away is because the internet here sucks. Otherwise, a good study spot!", "author": "Johnson S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-30", "description": "The service is really good. Friendly, quick and precise. Like any starbucks the staff cater to your every caffeine related need. The layout is great. They have couches, tons of tables and a decently large space. Only drawback would be at times it can be crowded so waiting for a seat can happen. The vibe overall is cozy. A ton of students and young people come here. Perfect for those in college for studying or social activity. \n\nI live in this place during finals. Speaking of finals, I have work to do!", "author": "Zack E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "Given that everything in this damned town seems to close way too early, I really love the fact that this Starbuck's is open all night. This is the first Starbuck's I've heard of that's open 24 hours, and I love it!\n\nMy only complaint is that, for a 24 hour business, this place suffers from a real dearth of tweakers. Instead, we have yuppies and college students with MacBooks.\n\nLast time I was here, the rich yuppie conversation I overheard made me feel kind of inadequate, 'cause it reminded me how much my own life is not on track. These yuppies? Even when their lives aren't on track, they're still doing better than me.", "author": "Max R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-03", "description": "TWENTY FOUR - SEVEN!\n\nIf I can wake my happy ass out of bed in the morning, I come here before work and grab my usual breakfast sandwich and my grande coffee but there's also numerous times that I have come here with my fellow classmates and crammed before a big test. It's pretty quiet here; considering it's always packed but finding a table for a study group can be near impossible. \n\nOverall, cool Starbucks and feeds my caffeine addiction at any hour of the day!", "author": "Albert L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-24", "description": "This Starbucks rocks! Study study study! or socialing with friends.  24hours, Key-Access clean restrooms, friendly staff and super easy parking.  Can't complain to any of that so this place is getting 5 stars.\n\nWow someone fell asleep and sounds like an underwater orchestra in here!", "author": "Victor V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "This is my go-to Starbucks when I'm at/near school. \n\nBaristas are really nice for the most part. \n\nLines can get super long quick. So hopefully you catch it when the line isn't too long. \n\nI feel like the tables get filled up quick. If you're trying to study, go early! \n\nThere's metered parking in front of store AND a parking lot in back. \n\nOpen 24hrs = MAJOR PLUS.", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-26", "description": "Long lines for bad service and over priced coffee....what a surprise! This place is the worst Starbucks anywhere --- very badly managed.  Then people hanging out for hours on end so there is no place to sit!! If you want to pay a lot for coffee in a de facto study hall and homeless shelter combined ---this is the place for you....if you have some taste look elsewhere ,,,,,,,,I can't believe the number of good reviews here ---very suspicious if you know what I mean.....", "author": "Bill B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "After this being my go-to place for a quick morning coffee and/or a desperate overnighter during exam week, I've decided to finally give it a review.\n\nStarbucks isn't the best place for coffee; with that said, this place seems to be one of the better Starbucks in the city (this and the one on Montgomery between Sutter and Post). They are usually spot-on with espresso varieties (specifically, the male baristas); I don't recall having a drink that was meant for someone with and uber-sweet tooth. If you're someone that likes the exorbitant amounts of flavoring, then the Fillmore location will do you just right. This place also has the clover-brewing system. I don't claim to have fine-tuned palette for coffee so I'm not exactly sure if it lives up to the hype, but the machine is sleek and shiny so it must be awesome right?\n\nAn added bonus is that it's open for 24hrs minus the 3 hours on Mondays 1am-4am, I believe. This place usually filled with students and cops (I like to think of this place as a police station that serves coffee) Like other reviews have said, it's extremely difficult to find a seat at certain times, but there is usually something open. The way to get the \"perfect seat\" is to just take what you can get, then upgrade as the day/night goes on(I guess this could be said about a lot of things in life haha). Figure out the best times to come yourself...\n\nThe lines seems to be at its worst right when the high schoolers come, which is could take about 8-10min to receive your order; other than that, the wait time seems to be on par with other busy coffeeshops.\n\nAll things considered, this place is better than the average Starbucks.", "author": "Carmelo D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "Went here to study last night. Do you know how hard it is to find a good place to study late at night, around UCSF? DO YOU?? so the only other place I try is tart 2 tart... but its crowded and dingy and they close at 2... This is the next closest thing. I'm giving it four stars because its the only thing open in the middle of the night where I can get coffee and snacks... its ALWAYS packed... especially on a friday or saturday night. The chairs are comfortable and its relatively clean. Just come here.. dont waste your time looking for a place to study because, there have been many-a-time where I have... and failed. lol", "author": "Mish L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-25", "description": "It is my favorite spot / sbux to chill and study. Baristas do remember you well and really good at making orders. Plus, they are super nice. \n\nIt is a very nice place to study and have coffee together at late night. \n\nOne thing its bad is that now everyone know about this place so this place gets really crowded.\n\nAlso,- FYI- this place closes at 1am on SUNDAYS. It is 24 hrs for Mon-Sat. \n\nThere are some ppl who tries to sleep in at this place - NOT allowed- time to time but it is really rare... Cops come to this place all the time - which I really like - makes this place safe. Seats are very comfortable and Restrooms are 90% clean.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "I love this starbuck. It's open 24hr because there are lots of businesses in the area and of course a hospital. There are an endless flow of people coming in and out of this place. Regular and new customers alike. They have a large area where patronages are able to sit and socialize. The staff here are awesome! Super friendly and always gets your order right to taste.", "author": "Sol P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-09", "description": "Meh.  It's a Starbucks - but they don't let customers prop the doors open no matter how hot it gets, and they don't have air conditioning.  Whhaaaat?  When I asked why we couldn't open the doors, the girl at the counter said it was a health regulation.  Hah. Not.", "author": "F C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "the workers are super friendly! great customer service!", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-08", "description": "Gr8 location close to where I live but it's overly crowded all the time! Open 24 hrs which is a plus", "author": "Anthony S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "I would say this is a pretty standard Starbucks. I like the drinks so I keep coming back. If you think the coffee tastes bad, its not the place for you.\n\nOccasionally service is REALLY slow. but 95% of the time im in and out within 5 minutes. \n \nMost Starbucks only deserve 4 stars but this one gets a 5th for being open 24hours. :)", "author": "Laura F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "This place is always crackin' no matter what time of day. The baristas are always so happy! I'd say that maybe they need to calm down on the coffee, but it probably helps them get through their work shift. Clean bathrooms. The girl that makes the drinks in the middle of the night, I think her name is Krystle, is pretty cool too. She knows how to make a drink!", "author": "Denise H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-21", "description": "I suppose the people giving this location five stars are the ones who show up with their laptops and park themselves in a seat for hours on end.  \n\nI love a good pumpkin spice latte on a fall day, but I also love to be able to sit for, say, five minutes to enjoy it.  No such luck at this location, which sadly, is my neighborhood Starbucks.  It is ALWAYS completely overrun by folks who like to treat it as their personal office/living room.  Half the time, they don't even appear to be drinking a beverage at all, just enjoying the free wifi while perusing their email or facebook.  \n\nI must say I blame Starbucks for the problem.  FIrst, they redesigned the location to attract this crowd - the seating here caters to computer users - lots of countertop space.  Secondly, the employees turn a blind eye to the shameless loitering.  The last time I stopped in, there was a chick chilling on one of the few comfy chairs with her textbook, seriously pretending we were all at her house.  Her shoes and socks were in a pile in front of her and she was rubbing her bare feet all over the chair while occasionally looking up to glare at patrons who were searching for a seat.  And she, like the guy next to her who was doodling endlessly on a sketch pad, had no beverage in sight.  Not even an empty one.  I did see a thermos with some soup though.", "author": "Elizabeth M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-26", "description": "My favorite Starbucks in SF because I'm a student and there nowhere else that is open 24 hours serving me coffee every few hours as I study. The downside of this place is.... it's ALWAYS crowded with students like myself, so I now only come here to grab a drink in the middle of the night before I head off to go study somewhere else.\n\n3.5 overall for the hours/free wifi/PARKING/friendly staff :)\n\nTo me it's like any other starbucks minus the 24/7 service.", "author": "Tina T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "You and I were great friends during the final days of my graduate studies. We spent many evenings and early mornings together. You even kept my spirits up with countless shots of espresso amidst the breezy brink of dawn San Francisco air.\n\nYou are always accessible, 24 hours a day, and I can park anywhere nearby on the street. Free internet is a major plus.\n\nI wish you had more space for me when I come visit you, but no one is perfect. Your worker bees are friendly, personable, and put a smile to my face.\n\nThere should be more of your kind in San Francisco because all we need is love. :)", "author": "Tina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-16", "description": "I work right across the street. So why have I chosen NOT to go here?\n\n1. Strollers ALL OVER THE PLACE. You can't walk, sit, drink, eat, or talk without a stroller bumping into you, or some baby crying. Just because you have a stroller, doesnt mean you are queen of the god damn world and that we have to move over or act as if you were handicapped. Stop hitting me with your stroller. \n2. Theres ALWAYS  line, either 6 strollers are in front of me taking up space or its just constantly busy here (even at 330 in the afternoon).\n\nWhy is it so hard just to get a cup of coffee?", "author": "Katie Anne N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-08", "description": "Friends don't let friends drink Starbucks.\n\nBut when it's 4am and you've got to pee real bad and there's nowhere else for you to go - Starfucks is here for ya. \n\n1 star for being 24 hours.\nanother star for being a good spot to people watch aka gawk at Yuppies and make fun of them.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-07", "description": "Its open 24 HOURS??? Came here with my bud Rico on the way to a site.. Man they know how to get you your stuff and get you back on the road. With a smile!! Its good for workers that need to get back to work fast. \n\n Will come  back next time I pull a bad shift lol!!", "author": "Xavior G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-18", "description": "When I need to get S--t done this is where I go.  Why? Its the only 24 hour Starbucks in SF!  Its conveniently located on the #1 bus line which is a plus for me.  Also since there are so many people studying here you def. feel the pressure to soldier on. \n\nHere are a few tips to maximize your study experience:\n1.  If you come here after 5 PM it will be really hard to find a spot.  Let alone two.  Please plan accordingly and pray to God if you want to get a seat next to an outlet. \n2.  Prior to work this place will be jam packed w/ Laurel Heights moms that are dropping their kids off at the JCC, organizing play dates and mommies that cafffeinate suport groups. \n3. Take only what you need.  I'll be honest you aren't gonna get alot of real estate on the table so if you plan on spreading your crap out: 5 different high lighters, a rainbow of post it flags, iPod, iPhone and laptop....please don't come here.  \n4. If you suffer from caffeine overload, you can take the UCSF shuttle to Parnassus from a block away or one of the aspiring med students can practice on you....", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-24", "description": "Can we get a Y -A-Y!!! for 24 hour Starbucks'. I think that was the best decision that the company has ever made.\nThis place is always busy.. even at wee hours.\nCoffee is always good, and there are almost, always seats available to sit in.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "I am not a fan of Starbucks coffee. I don't like the sugary sweet coffee drinks that have too much milk and syrup. And the drip coffee is just too bitter.\n\nBut, this Starbucks has this Clover Press thingy so I can get person cups of coffee. I've order the Kona coffee the last few times and it tastes great with just a dash of half and half. \n\nAlso there is a lot of seating and ever since I discovered I can get free-wi-fi when I load up a Starbucks Card, this has become my new \"search-for-a-job-online\" cafe.", "author": "Julia H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "Dat free internet tho I wrote some gay porn stories in here people Jizz all over the coffee the coffee tastes sticky with a hint of cum in my face", "author": "Ewok T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "24 hours is worth 5 stars already.\n\nVenti iced skinny caramel macchiato is what gets me through my 4 hour night classes", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-28", "description": "I'll do the cons before pros to justify my 4 stars.\n\nCONS:\n\n-pretty gross bathrooms (even though you need a password, its gross)\n-weird crowded hallway type thing where strangers are sitting side by side, some starring as you enter from the back entrance or head over to the bathroom\n-windows fog up like crazy with all the human bodies inside during finals week\n-also impossible to sit anywhere but by the edge of a window (not a real seat)\n\nPROS:\n\n-it was actually fun to sit by the edge of a window while charging my phone and chatting it up with friends\n-I liked the fact that it was packed with college students during finals week at 1am\n-it's open 24 hours, and that's a dream come true for me\n-even though the back parking lot seems a little tiny bit sketchy to me, I'm glad they have more than just street parking", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "Friendly staff! My favorite of all the Starbucks I go to. They're also open 24 hours a day which makes it convenient for a coffee fix.", "author": "Sherman B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-18", "description": "I live near this Starbucks and used to stop in every morning but the service has gotten so slow here that I just head to work and stop at the Fillmore Starbucks. I like the new re-model - more seating and fewer students camped out for hours on end but I wish they could get better workers here so they could move the lines.", "author": "Ann W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "Betty W. and I have spent MANY nights here while we drowned in coffee, books on law and teeth, and what seems to be a never ending line of customers. By the time i was done with my boards and she was done with law school finals, this starbucks felt like home --- and yes, we are a little bit lame. \n\nWhy 5 stars for a regular chain starbucks?\n- its open 24 hours \n- it has clover blend coffee!\n- the workers are nice (and one of them looks like chris brown =x) \n- it is very large with lots of space to study\n- parking is plentiful \n- lots of interesting people to stare at ^^;;\n_________\nthings that will only make sense to betty w :\n- muffin top \n- big red\n- the adventures of finding the perfect seat\n\nIt can be very hard to find seats here as a lot of the time it is full of students from usf, pacific dent, etc", "author": "Tim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "As I write this, it is 5:20AM. I have been here since 8pm, working on an all-nighter for a class. This place is a life saver, but I question if its a life worth saving. Haha, just kidding. Without sleep I'm as bitter as coffee without cream. There have been just enough weirdos to keep things interesting, but not so many that I risk crawling back home, where my warm bed awaits.\n\nOh yeah, the coffee. Its good. I had a (or three) cup(s) of regular coffee cause I'm cheap and here for-freakin'-ever.\n\nThank you, Starbucks. \"Good\" morning.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-19", "description": "It's a Starbucks, kids. So, yeah. It's a Starbucks. This one has the new \"Clover\" machine which is supposed to be fairly high tech on the grind and the brew. A mere thousand or so Starbucks have this particular machine, so that is supposed to mean it's an \"Oo, Ah\" moment. Um, it was good coffee, but I can't say my skirt got blown up in the air by the taste or anything. The staff here is friendly, so that was a bonus. All in all, it's a Starbucks, and, hey, it got my caffeine level back up to normal range again. Yay! Downside: absolutely no room to sit down and get any writing done. The place was packed. Boo.", "author": "Shadi G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-09", "description": "Ah yes, MY Starbucks in the city.  Yes MINE.  I spent more time here than at home the past couple of months trying to study for an evil (no joke) exam.  True to its claim, the location is 24 hours (closes for a few hours Sunday night/Monday morning).\n\nParking is plentiful during most times of the day- seats are not.  This place is BUSY (I heard it's the busiest SB in town).  That includes weekends, weekdays, weeknights- I've had my share of coffee at all times of the week and I can tell you people flow through this place consistently.  \n\nIf you want to grab a seat to get some reading done, I suggest getting here before 7pm for a good shot, otherwise just hope for good luck.  The staff is also really nice and if you're nice to them, they'll be nice to you too (like how that works?).  Great place to get some studying done at night.", "author": "Daniel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "For all those late nights working on papers, studying for finals, and coming here for the free wifi while sipping on my green tea or chai tea latte, I thank you, 24 hour Starbucks. This is the only place where I can sit down and crank out a paper, get distracted by people watching, see the cops come by at 2 in the morning for their usual round of coffee.\n\nI love this place. The workers are nice despite working at the late night hours, it's always clean, your drink orders are usually on time, but around the major study days you'll be hard pressed to find an outlet to plug your laptop in if you need it. It's packed and all the prime study space is usually occupied from 9PM-1AM. So if you come in before or after those times, you can manage to find a seat easily.", "author": "Leslie K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-02", "description": "Review is only for the coffee, the people here are awesome, the cappuccino I got was so gross haven't had Starbucks in awhile but wow tasted like a shot of espresso not a Cappuccino.  also tasted like burnt coffee, who knows maybe Starbucks coffee got worse.  Again people here are fine, place is clean and friendly but please work on your coffee skills, or let Corporate know they have sent you ruined coffee beans", "author": "Nirea S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-10", "description": "Though I do not go to coffeehouses, really, at least do not spend much time in them despite the convenience and easy sociability of the people in these places, especially in S.F., this is an 'industrial strenght' Starbucks coffee place that must have clientele at all hours.  The area this place is in has one doing double - takes on some things that might also be in the Haight, though I hope and know I am completely wrong here.  A really nice place to get a cup of coffee, meet friends, josh around and so forth, ..., and from the looks of things here it's not totally for kids nor for the super - young crowd that one finds in such places sometimes.  Nice!", "author": "Thomas H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-13", "description": "Hands down the greatest Starbucks in the world. There are many interesting people that are fun to talk to late night, and there are lots of spacious couches and places to work. Staff is awesome!\n\nYou may have to wait a bit to find a spot. It's nice because even though you'd imagine a 24 hour anything to be super sketchy, most of the people mind their own business and there are police who come in and out all night, so it's safe.", "author": "Hannah J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-04", "description": "Everyone has to review at least one Starbucks in their lifetime. And if there is any worth reviewing it's this one. Having been a student at USF I loved this place. There is parking like in the burbs and sexy med students. Good mix. \n\nWe all know that Starbucks isn't the best coffee and their hot chocolate bites, but they have good tea. Hard to get that wrong.", "author": "Lee M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-20", "description": "Place was a mess at 8:30 pm when it was slow.  Garbage full, condiment table filthy, and all sorts of stuff on the floor.  You'd think they could at least keep things tidy for the prices we pay!!  They had 3 baristas on duty so I'm not sure why they didn't have time to service the place.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "Busiest-but quickest- Starbucks I've ever seen! These guys know how to make drinks quick! This location is always packed with students studying, joggers, families, and even police officers. Even under all the pressure, the staff are somehow still super friendly and always manage to brighten up my day! They also have a really good selection of things to buy in their store, which is awesome! My favorite barista here is Mark. No matter how complicated of a drink I request, it's made perfectly! I never forget some tip money for these hard workers!", "author": "Brittany F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-20", "description": "Love coming to this spot since it's open 24/7. Having that said, it helps me fulfill my random cravings at 2am. My favorite drinks to get so far are.. White Chocolate Mocha HOT/COLD. Sometimes with a pump of Hazelnut. Passion Fruit Lemonade. Pumpkin Spice Latte. Salted Caramel Hot Chocolate. Caramel Brulee Latte. Hot/Cold. Occasionally would buy some Madelines as well hehe :)", "author": "cadence p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-23", "description": "5 stars for being the only 24 hour starbucks around! +1 more star for good customer service whether it be in the busy morning or graveyard shift at night.", "author": "Calvin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-21", "description": "Hard to give anything less than 5 stars when they appear to be the only coffee shop in town open 24 hours with easy parking and wifi... at least this is basically the only place that popped up in my yelp and google search. \n\nJetlag sucks but is made bearable when I can get a cup of coffee and a muffin at 3 in the morning :)", "author": "John B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "No complaints really. wait a minute, except that a cup of coffee can cost me up to $5 [but that's standard if youre going to buy coffee anywhere nowadays].. and o except that sometimes i cannot find a seat or that people put their bags on other seats so that there isnt room for me : (\n\ni love getting a drink just so i can sit down by the window and watch the cars go by. i feel like a kid again. haha!\n\nfree wifi is a plus", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-23", "description": "Great place to study. Opened 24 hours. Music is quiet and easy to phase out. At times the place gets loud, just remember to bring headphones or ear plugs.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "This Starbucks is great for studying, although there is always pretty fierce competition for tables and chairs during peak times. Once you have a spot, though, it's an awesome spot to camp out for a few hours an chug through some homework and espresso.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-15", "description": "Oohhh!! My friend pointed out that they are the only starbucks in the area with the special brewing system. I tried out the clover brewer, single cup style and it was pretty good! Wow! I was surprised! Then again, I'm not that huge a coffee coniesuer so maybe I don't have the authority to make that judgement but I know what I like, and I liked it! \nI usually go for a medium blend where it's not too darkly roasted but just enough so that it's acceptable. The 100% kona was good!", "author": "Tu L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "Too heavy on the mocha in the peppermint mocha. BUT the lattes are good. The staff is super friendly! Best interior decor in San Francisco... to me.", "author": "Stacy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-16", "description": "I hate. hate. hate. Starbucks. Why go here when there are SO many independent coffee shops that not only have better (read: real) coffee, but have generally healthier options and also help the community?\n\nNow that I've hopped off my mini soapbox, I will credit this ONE Starbucks with being open 24 hours, because it helped me through a really rough final exam cram session. And the staff was friendly enough.", "author": "Sam S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "Good-sized Starbucks.\n\nI like their tables.\n\nThis used to be a hardware store (i think).\n\nI wasn't aware of their 24hour open-status...thanks yelpers.", "author": "Derek N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "I must say, this Starbucks is one of the fastest I've been to in the city. The busier they are, the faster they move!", "author": "Lisa R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "I love Starbucks because there is one at every corner you turn...convience\n\nThis is my favorite one..  Open 24/7 and ample parking!\n\nminus 1 star for being so crowded.\n\n*Note* Just because you buy 1 cup of whatever doesn't entitle you hog a table for 4 hours......", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-14", "description": "It's the only place that's opened 24 hours! Good luck trying to find a place to sit, the place can get packed. Sunday nights they close at 1:00 AM for cleaning. The only down fall it's hard to find a seat when you come around 5pm.", "author": "SF S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-10", "description": "The best part of this Starbuck is that its open 24 hours. The worst part is that there are sometimes long lines just to order drinks and its so hard to find a place to sit. It seems like every time i get there, there are no sits available since everyone goes here to study.", "author": "Ash R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-18", "description": "SERVICE:\n24 hr! What! Unlimited free wifi!\n\nATMOSPHERE:\nBut downside is it's packed :((((((", "author": "Angela L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-05", "description": "For the space I give them a 4 for the coffee I give them a 3. Nice spacious and clean with lots of electrical plugs and WiFi", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-27", "description": "JAVA CHIP FRAPPUCCINO!!!!! ADDICTED (O_X)  $3.59 (GRANDE) for yummy goodness!  for some reason or another i need caffeine at nite time. Yea I noe imma weird XD\n\n\nclosest starbucks that i noe is open 24hrs!!! Need I say more!\n\noh wait I will, The first nite that I met Marie we came here for hrs of chit chat and got to know each other even more. :)  yadayadayda We have been together ever since :D\n\nNOTE: chill spot for a lot of college students and people that jest loved being wired on coffee at nite into the wee morning hrs XD", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "Same drinks and food you'll find at any Starbucks.  And food is stocked throughout the night.  They restocked at about 9:30pm when I was there the other day.  Another plus, the baristas are always friendly and serve with a smile, plus they are super skilled at dealing with a long line.  \n\nReasons two stars were deducted:\n1. Not enough electrical outlets for laptops, so I'm limited to 4 hours or switching my seat.\n2. Need MORE SEATING, this place is always crowded!\n\nBut, it is open 24 hours, 7 days a week.  When I'm in need of a place to do work in the middle of the night, or even late-ish at night, this is my go-to place.  Might have to get friendly with some other people, but it's never been too bad.  It's definitely more of a working crowd than a place to chit chat, at least during the evenings.  During the day, I've seen lots of strollers and work-from-home people.  And of course students.", "author": "Lindsay B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-08", "description": "One of the worst Starbucks you can go to.  The line is always super long and when it isn't, you have to battle for space because every patron comes in with a baby stroller at least two deep.\n\nI work nearby so the only time I make it over here is in the morning or during lunch.  Forget it, I only get a hour and I don't want to waste my time in line.\n\nThe staff is nice.  I think they know there's a stroller/mom/nanny problem and they try to accommodate the people who just work in the neighborhood and not produce in it.", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-11", "description": "Probably the best Starbucks in the city in my opinion. The place is pretty big compared to other Starbucks in the city. The great thing about this location though is that it is the only 24/7 place in the entire city. \n\nThe coffee is pretty good (typical starbucks) and the staff is very friendly also.\n\nOne thing to keep in mind though. Despite the place being generous in size it is usually full at night with students from neighboring schools.", "author": "Ajay K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "Decided to give this Starbucks another chance today and boy did they change! Looks like they hired a lot of new people. The staff was super friendly and quick, which was much appreciated. Also, they finally made my drink correctly! Super happy about the improvements. I will definitely be back!", "author": "Brooke T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "As a grad student, I really appreciate this 24-hour Starbucks, and consider myself a regular.  The baristas are so friendly, and although it gets crowded here, it's a pretty comfortable place to write, study or just hang out.", "author": "Bridget B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-04", "description": "Why give it 4 stars while there's another Starbucks right across the street? It's the magic clover machine!\n\nThrough my \"continuing education\" from someone I admire dearly, I know there's at least a couple around downtown... searching on iPhone I found this!\n\nThe Panama La Florentina was crazy strong and good, and I was recommended to try the iced version. I always love a strong cup of cold coffee.\n\nThis cup would last me the whole day!! But I must also add that the beans were still far from the great ones over at Ritual that I tried last weekend (see my review on 6/2)...\n\nI wish Starbucks did not play monopoly so that more places would have the machine. Having a good cup of coffee is not about waking up on a tired morning or keep up a busy day, it's about enjoying the blossoming the beans, demystifying a stressful workday into relishing the lively life in this gorgeous weather, savouring the birth of delight. Having the machine available at smaller venues would have been like sharing the joy and happiness with others. sigh...", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "Very busy and the lines are too long. Very friendly staff and consistently good coffee.", "author": "yan k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "This is a very very crowded location. However, they are very efficient and your coffee order will come out very quickly. People lounge around, so seats are hard to find. Overall, I like this place. One other gripe, is that coffee strength is a bit inconsistent here sometimes. I ordered the same thing every time, but once in awhile it'll taste very differently.", "author": "Anatoly B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "5 Stars because a 24 hour Starbucks (when they're not shoveling you to the other side of the room during their 2 am clean-up schedule) is a scarce resource.  5 Stars because I can always manage to get work done when I drive all the way over here - and I can pick up some Krispy Kreme at the Cal Mart next door.  It also helps that there's no weirdos and the staff is always upbeat and friendly.  Parking's not too difficult - depending on what time of the day you enter the back parking lot - but you eventually find a spot - and its validated!", "author": "Nin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "This place is great!  It's open 24 hours and has a very nice staff.  The area is pretty quiet and easy to get to (Laurel Heights).  At 2am, you would never believe how crowded it gets.  Definitely a great place to go online while having a great cup of java.", "author": "Anita H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-17", "description": "Ever since I heard about this place, I haven't been able to stay away from it. My ochem grade has actually improved (but my sleep cycle is all screwed up) because the one thing I look forward to on a blah day is driving down the empty, dark streets in the middle of the night to Starbucks, getting comfy with my cup of coffee (cheap refills!) and books, and working on chemistry problems. So is my life. And what's nice is that everyone else there is busy with something too, so there's not a lot of gabbing.\n\nI was surprised at how crowded it is at 12am, and there's not a lot of tables and chairs. Sometimes I have to sit in my car and wait for a table to open up. Also, police officers frequently drop in for a cup of coffee and a chat. I don't know if that makes me feel safe or worried. . .\n\nOh, Starbucks, even though I'm against chain cafes with mediocre coffee, you have saved my life!", "author": "Kym M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "I've been coming here almost everyday for the past two months as I'm in the middle of studying-so-I-can-get-into-grad school extravaganza.  \n\nIt's usually pretty clean, especially for the huge amount of traffic that comes in here at night, being the only thing open other than that Donut store on Clement in this area.  Probably the most comfortable Starbucks I've been to for studying- well lit, sensible amount and placement of furniture.\n\nThis Starbucks also seems to play better music, some classics from Fresh Prince, Tribe Called Quest, and Queen Latifah came on tonight when I was studying.  Way better than the usual coffee shop elevator music.  \n\nWriting mostly to complement the night staff.  They're super friendly and funny despite how cold it gets, the crazy people who come in the cops don't do anything about, or if the store gets egged at 1am.  Super nice and welcoming and quick with orders.", "author": "Bessie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "Everyone knows this location is open 24-hours, always super poppin' with plenty of sweaty butt-cracks, blah blah blah. Unbeknownst to me, it's apparently a great stop for wedding parties too. Yeah! I bet you didn't know that! Last night I saw a ridiculously decked-out bride and groom with their pastel and chiffon adorned bridesmades and wedding guests gathered outside the store like a class of kids on a field trip. Starbucks cups in hand, there was some schmoozing here, mingling there...it was clearly a stingy wedding reception of some sort. Classy!", "author": "Suany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "Here is a continuation of my Study-In-The-City reviews of cafes:\n\nPositives:\n1) Open 24-7 and fairly clean\n2) Most seats are well lit\n3) Almost every seat has its own plug\n4) Free internet (if you pay via a starbucks card, which is not a c.c.; transfer $ into the card whenever its empty and use 1x per month)\n5) comfy seats line both walls (matters if you need some cushion);\n6) more food selection than other starbucks and access to food at a few nearby places\n7) staff is generally nice and doesn't bug you (even for bringing outside food)\n8) individual \"clover\" coffee (strong for studying)\n\nNegatives:\n1) 1 of the baristas thinks that loud fake friendliness (to anyone who will speak with her) is a virtue;\n2) lonely old people who pop up next to you to either yell at you or befriend you cuz they have no one to talk to (when the barista in #1 isn't working);\n3) crowdedness (usually evening/night and weekends)\n4) DAY TIME parking (LOT:  90 minutes in their lot with a guy writing tickets every 2 hrs; STREET:  nil cuz located near a hospital and school)", "author": "Caitlyn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-23", "description": "So I am a regular customer here, I actually come here quite often but now, I may not be. I have put off writing this for some time now hoping it would get fixed. I am frustrated with easy fixes that should be addressed. First, the new re model is great but where did all the power outlets go? There should be more for the chair section in the front, because if the tables are taken, where is one supposed to plug in? And the new supposed \"google wifi\" is even worse. The speed is even slower, making any work to be done, impossible. Whats ironic is the \"Trouble Connecting?\" link on the splash page is pointless because in order for it to show fixes, you have to be connected..... doesn't really seem to make sense does it? The internet for a late night cafe is crucial, on the same level of importance as the actual coffee is. Please, get a T1 speed connection or at least upgrade the router so multiple people can be on the web at the same time! This is the 21st century, my 3G blackberry is faster than this wifi crap!\n\nAs well as, you spend $3-4 on a refresher and get a FULL cup of ice with a teaspoon of the actual drink. at least make it part of the $0.50 refill. Not to mention names but its the new young kid with the super short blonde hair, who also never smiles or is friendly at all. When hes making drinks, its a cup of ice for $4. And the other drinks made by him, never taste good, i dont know if he wasn't properly trained on how to make drinks or if he's just lazy but PLEASE, starbucks, show him how to make drinks properly!! Light ice should mean......light ice!!\n\nOne other thing, where does the line start? There are always two lines starting in front of the registers, making it very confusing and mis leading. Please make a damn sign or at least make it clear where to line up.", "author": "Jossy W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "They have quick service and friendly staff. There are lots of space to relax and enjoy a cup of coffee. There are alot of people coming in and out so that's good. means that they're doing really well. But sometimes the customers just sit there way to long, just hogging up the space. But it's close to my home and 24hrs so i can get a cup of coffee when ever I want.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-18", "description": "What's better than Starbucks? Starbucks that is open 24 hours a day. That sentence by itself says it all. Five stars for that shit alone. \n\nI love my Starbucks. Everyone knows that already. No big surprise there. \n\nIt takes a lot for me to give a bad review of my caffeine wielding monopoly coffee shop, but this one is better, because I can stay caffeinated 24/7.\n\nI don't sleep much, and when I do, I usually sleep like crap, so there are many times I just want to get out of bed and drive or write, instead of staring at the ceiling. This Starbucks has given me wondrous amounts of support to my unhealthy insomniac habit. I can get up and drive for only ten to fifteen minutes and be there in Laurel Heights at Starbucks at 2 am. I know this sounds ridiculous, but there's nothing better than being able to get out and go somewhere when you can't sleep.\n\nHey, can you blame me? I like to be productive.\n\nPlus it's a great escape from Marin. Yes, you assumed correctly. I drive from Marin into SF for 24 hour Starbucks. It's sick, but it's beautiful. I'll even drive out to the beach afterwards and watch the sun come up. It's like being sixteen again, but without all the awkwardness.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-15", "description": "I usually have pleasant experiences @ this starbucks but this last visit was jus horrible!  Ordered the \"clover coffee\" and when I didn't know which type I wanted I was treated with disrespect as if I was stupid.  I wanted to complain but the person that mistreated me was the manager, \"Tina''  How can this location have this \"manager\" running this place?", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-06", "description": "Why you deserve my first five stars review: (Based solely on late night visits)\n\n-24hrs of caffeine satisfaction \n-Double Chocolate Brownie things and Peppermint Hot Chocolates\n-A comfy study area\n-Many cops frequent this 'Bux late night which means I feel safe whilst sipping on my Quad Venti Iced Hazelnut Whole Milk Latte (Whew!)\n-Last nights bathroom code was amusing. 90210, haha, silly baristas. (Well, I chuckled)\n-Well-maintained bathrooms, maybe, because I only come here at ungodly hours. *shrugs\n\nI love you Starbucks, but please stop building new ones on every corner of San Francisco.", "author": "Maggie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-09", "description": "There's people living here at this coffee shop. Showering in the bathroom, eating dinner here and sleeping on couches with their luggage", "author": "M L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-06", "description": "This review is for Keith who works at Starbucks on 3595 California street in Laurel Village. \n\nAfter getting to know Keith, I asked him if it's okay that I write a review for him on YELP. His immediate response was you don't have to. Thanks. But I insisted because it is an honor for me to write this review for Keith. \n\nThis is why:\n\n1) Keith's presence makes Starbucks in Laurel Village a unique coffee drinking experience. He greets you with his charming smile and kind eyes making you feel you've come over to his house for coffee! I used to think Keith was the owner of that Starbucks exactly because of his warm hospitality.\n\n2) A friend of mine once said the experience of drinking coffee mainly comes from your company not the quality of the coffee. That is why I highly recommend Keith to open up his own coffee business. Even if Keith sells coffee grown in his backyard, I am sure he will be successful, knowing the way he makes people feel loved and welcomed.\n\n3) From my observations of Keith's interactions with young, old, hurried, loud, ill, disabled, anxious, funny, talkative, quiet, man, woman, gay, straight, rich, poor, tall, short etc. customers at Starbucks, I can attest to the many roles Keith has played for folks, as well as a barista. His roles include a social worker, counselor, coach, lover!, listener, nurse, nap police, comedian, an interested audience when no one else is watching, and a childhood friend.\n\n4) I wouldn't be surprised that the reason the laurel Heights Starbucks is packed even at odd hours like 3 am is because of Keith's reputation. Other coffee shops including other Starbucks in the neighborhood must have experienced the disappearance of their patrons as soon as Keith started his shift at the Laurel Heights Starbucks.", "author": "Joy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "Many of you know that I'm a Peet's coffee fan.  Well, I don't know HOW my coworkers and other friends don't know this -- or maybe they know that there is no Peet's close to my office.  At any rate, I received a lot of Starbucks gift cards for Christmas.  So, this Sunday, after playing in the city, my family stopped in Laurel Village.  I got my coffee at Peet's and then we strolled down the long block (with stops at the Gymboree, bookstore, and 5 and dime along the way) to get kids' drinks for my little ones.  \n\nI have to admit that as much as I love Peet's, drinks for kids' are limited there:  milk, hot coco, orange juice.  That's it!  At Starbucks, there are several options: several fizzy drinks and juices (in addition to what Peet's carries).\n\nThis particular Starbucks is a gorgeous space, with glass tiles behind the counter and a comfy, yet upscale living room feel to the space.  In addition, it was well-staffed so the line moved very briskly -- two baristas, two ringers, and one floater who took the order before we paid.  \n\nSo I don't mind stopping by for drinks for my kids as long as I get my Peet's fix first.", "author": "Patty W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-30", "description": "As a recent nursing school graduate this place has been the best to study in during those late hours. In the city your options for 24 hour cafes are limited, but this area is safe enough to leave at 4 am and not worry about your car that has parked in the back for the past 6 hours. The coffee and food is like any other starbucks but the location and hours are great for any night owl.", "author": "Brittany T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-13", "description": "I'm writing to complain about an experience at this Starbucks late one evening  around 12:30 a.m. There was nowhere to sit when I arrived. The store was filled with mostly students who were studying for exams. Some students had moved furniture so they could sit side by side which was strange to see walking in. I should have just left when I realized it was that time of year since it is always like that around exams at this particular location. But, I ordered a coffee and a pastry and found a makeshift seating arrangement that was probably abandoned by some other student that had placed a regular seating chair at the end of the bar like area in the store. Moments later someone left a regular table so I prepared to move, but as I was sitting down I saw a disabled couple who also wanted to sit there and I just let them take the table because I thought that was the right thing to do. \n\nMeanwhile, this other chair in the front of the store was available so I sat there instead. Wow, I wish I did not do that! Sitting directly across from me was a homeless looking person who was sound asleep with no beverage or anything in sight. And I was already irritated because of all the students leaching off and slowing the wifi connection, some of whom also did not buy anything. But it wasn't until I saw the person seated next to me inhale a white substance that I thought was cocaine that I asked to talk to the Manager on Duty. While I was waiting for the Manager, who was not on the sales floor for whatever reason, the associate I talked to saw this person inhaling whatever it was that they were inhaling. The Manager appeared a few minutes later and apologized, said he would call the police, and offered nothing else. I reiterated that I was not satisfied and at my urging he gave me coupon, or gift card, or something for a free drink. I was fine with that at the moment but was pretty surprised by what happened next. The police came and escorted the drug user or person who was inhaling something out of the store. And at the same time, I should mention that the other two homeless people seated in the same area were still sound-asleep. I thought to myself well, at least I did something and I felt fine. \n\nBUT THEN- the other homeless looking person who was escorted out by the police returns to the store! AND- it gets even better, the Manager then apologizes to him and offers him a free drink or refill??!  I was dumbfounded and frankly, shocked that this is how it was being handled. But then again, I seemed to be the only person bothered by it. I decided to just leave since I did not feel comfortable and talked to the Manager again before I left because I didn't want to seem like the bad person involved. There was no line but at one point someone else appeared and I casually said something like \"wouldn't you be weirded out if someone sitting next to you snorts a white substance that looks like cocaine?\" in their direction. That other person obviously had no idea what I was talking about and said nothing and then the Manager acted as if I was being confrontational. Maybe I was, I don't think so, but I probably should not have even involved some other random person. Regardless, I've experienced many weird situations living in San Francisco as long as I have, but this has got to be the weirdest I have ever experienced inside a Starbucks! \n\nI sympathize for the homeless people in the store but they should not be allowed to just occupy space inside a Starbucks without buying anything and likewise, using drugs or inhaling substances should not be allowed in any store, Starbucks or not. The Manager was friendly and said he could do nothing beyond what he already did which I believe is mostly true. I think apologizing and offering a free refill to a homeless person who is inhaling substances, cocaine or not is a little strange but I get it that his actions were limited. The store doesn't have security and after all, I appeared to be the only person bothered by this anyway. Most everyone else was oblivious and plugged into whatever device they were using. Surprisingly the most observant people in the store were the disabled couple I mentioned. They appeared to be hearing impaired as they were communicating using American Sign Language. I only know a few words in ASL but could definitely understand the shrug and eye roll that we exchanged as I was leaving.\n\nI don't know what the answer is or what Starbucks can do about this, but something needs to be done and I know for certain that what happened that evening is not the right thing.", "author": "L. A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-31", "description": "I finally find a good spot to hand out with my friends. \nI like this starbuck. Cause good costumers service, nice peoples \nclean. and the most open 24hrs. \n\nIf there i wanna to go out at nite to hand out. use to be I \nwill go the bar hand out the park. now this is my spot..", "author": "sean c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "I frequent here on random nights of the week, generally anywhere from midnight to 5 a.m. because, as a night owl, there's only so many things to do in the Richmond District besides eat at Jack in the Box or Video Cafe.  \n\nThey are open 24 hours unless if you happen to be there on Sunday night (early Monday morning) at 1:00 a.m. when they close up shop for about three hours.  Being one of the larger Starbucks, you would think that there would be open seats, but the place is always packed.  It's safe to say that if you grew up in the city, you're bound to run into someone you know on any night of the week.\n\nThe drinks are okay, just what you would expect from a large coffee chain, mediocre crack at best, but the baristas are pretty fast and friendly.  If you hang around and smoke in front, be aware that there is a smoking nazi behind the counter.  I only say this because he's just trying to do his job and respect the rules of Starbucks as well as the city.  They only thing about this place that bugs me, aside from smoking nazi, is the fact that women customers are fucking slobs when it comes to the bathroom.  Seriously? Does everything need to be on the floor? Do you have to leave your pee on the toilet seat?  Do you have to have your [lesbian] sexing in the bathroom?  Yeah, I know what you did in there - have some class.  C'mon... it's Starbucks not a taco dump. Clean up after yourself for fucks sake.\n\nAnyway... Hella parking and open 24 hours = +1 star.", "author": "shannon s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-04", "description": "No BueNO!! no! No!\nI am very picky coming getting my coffee. I want my speciality drink to be non-fat, extra hot, no foam, vanilla latte. \nWell, this place failed miseraberlly at it. I think they made my drink with no non fat milk, just with vanilla, and ugh the shots of coffee, because I can taste the sweet sweet vanilla and half a empty cup and slurping down foam... maybe it was the bartista.. i give it the benefit of the doubt... so one star will suffice for now... *sigh* until next time.", "author": "Monika T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-13", "description": "I have spent 16 hours straight at this particular branch of my favorite way-to-piss-a-hippie-off. Here's the deal: You tell me a Starbuck's stays open 24 hours and I'm like, \"AWESOME! Dude, I can get a freakin venti caramelatto-chocoletta frappuccino at 3 in the effin morning if I feel like it!!!\"\nIn reality, the only reason you want anything from Starbuck's at 3 a.m. is:\na. You are a student and therefore not allowed to sleep \nb. You are a tweaker and therefore not able to sleep\nc. You have insomnia and you haven't slept since the 90s\n\nMy excuse is (a. student) and I can't describe to you the degree of depravity at this particular Starbuck's at 3 a.m. during finals week...it's serious. Like I said: I was there for 16 hours, 12 coffees, and approximately 3 trips to the bathroom to vomit from nerves and lack of sleep. \nThis Starbuck's is overrun with the stroller crowd during daylight, teenage strumpets from Pac Heights and Seacliff during the evening hours, and (again) suicidal, sleep-deprived students from 10 p.m. til the sun comes up. What a cash cow this location has turned out to be.\n\nI am Starbuck's biggest fan (complain to someone else, tree huggers!!!)  and I am so pleased that this location gives all of us zombie academics a place to comiserate, ponder jumping off the golden gate bridge, and endure massive anxiety attacks in a group setting. What a great alternative to the campus library.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-27", "description": "This starbucks is open 24 hours. Are people in this neighborhood so addicted to caffeine that they need this place open 24 hours? Everyone in this neighborhood is old or has a kid, what is the deal? You'd think MY neighborhood, full of people who actually DO things after 10pm would have a 24 hour option, but no, these fuckers get a Starbucks. Don't they have enough already? \n\nI came here because, on my ROTD day, I was at an all day meeting and though my company says they have wi-fi, it doesn't work,  so I came here during the break to build up my self esteem through your fabulous compliments (THANK YOU!!) and wouldn't you know it? It is IMPOSSIBLE to steal wi-fi in this neighborhood. And you know I am not paying for T-Mobile. I am just a lowly 94117-er. Can't you give me some of your wifi, just for a few minutes??\n\nI will never have your life, Laurel Villagers! If I get pregnant, it won't be a life of mommy & me & parenting classes at CPMC, it'll be a decision between RU-486 and a D & E. My occupation will never be \"the ceo of my family\".  Just give a girl a fuckin' break.  I allow you, when you are in your 20s, to drink beer in my neighborhood and vomit all over the streets. Please just give me some wi-fi when I do some traveling. Please?\n\nCoffee sucks, as usual. And my sandwich was soggy. Ugh.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-03", "description": "This is a pretty nice starbucks. They have a lot of space and the coffee aint bad either!", "author": "Frank L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-24", "description": "Positives: It's big and you can find a place to sit, which is awesome. You can also sit on a couch or beside one of the many windows to people-watch, which is nice sometimes. \n\nNegative: Seeing how Starbucks is a multi-billion dollar enterprise, you would think they would offer free Wi-Fi to paying neighborhood customers. \n\nI will never come here to do work again because of this. There are so many independently owned coffee shops with FREE WI-FI! I would rather give them my business any day.", "author": "Chantal H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "open 24 hours!! wuuhuu", "author": "Carla F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-18", "description": "My favorite Starbucks. I'm not basing my review on the food and beverages because a Starbucks is a Starbucks. Instead, I'm giving this Starbucks five stars because: It's in one of the nicest neighborhoods in the city, there's parking, there are plenty of seats and it's 24 hours.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "One sad note of correction for you all: this isn't TRULY open 24 hours-- on Sunday nights (or technically, Monday mornings) these guys close at 1 a.m. I don't blame them, but I do want to point out that my fellow yelpers led me to believe that I would score some wifi and workspace before my Monday morning deadline... nope.  Back on the scooter I went.\n\nI'm going to give this place three stars, though, because though this may be one of the nicer Starbucks in town, and they get why people go there (there are plugs galore and the place is just built to house a lot of students), the number of people there on any night is unbearable.  When students are fighting over ottomans to sit on--without a tabletop in front of them--it's a flag to the corporate planners that there is a need for more of these sorts of locations that cater to hard-working night owls.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-05-23", "description": "I drive past this place regularly between 11PM and Midnight, and it is PACKED with my fellow classmates. \nI wonder, why do their parents (or they) even bother to pay rent, when they are spending most of their study hours spending $10-15 per visit to this Starbucks? Just a thought. \nOn weekend mornings it's a zoo too, on weeknights you're lucky to even find a place to sit for ten minutes.... \nDrive over to Cafe Bazaar on California near 20th for a *much* nicer cafe experience.... \n\n*************\nOoh, I just read below that there are now TWO bathrooms... perchance it is 'safer'?? \nI haven't bet on it (yet) but I'll update as soon as I venture there again.. \n\nMy initial thought is that two bathrooms just mean more bathroom for them (not) to clean. \n\n*************\nI'm not the biggest fan of the jolly green giant coffee empire which is Starbucks, but my issue with this particular starbucks has NOTHING to do with their evil splenda filled empire... \n\nIt has to do with their bathroom. \n\nIt is DISGUSTING!!!! Ok, fine, it's a 24-hour joint so perhaps my expectations for the facilities need to be brought down a bit, but HONEST TO goodness.... what SANE person would consume food or beverage in this place, much less bring a perfectly innocent child and his or her super sized SUV stroller in this joint (It would need to be disinfected afterwards!) \n\nI'm assuming that the workers use the same facilities, in which case, I would highly question the health codes that are violated in this place. The bathrooom incessantly smells like urine or fecal matter, and it's amazing that patrons put up with it! \n\nTotally, totally, gross.", "author": "M'ia K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-10", "description": "I'm becoming more and more in love with this place. I always find a comfortable seat here now! Been here 4 days/week lately. Yesterday was nice. The server gave us another pastry cause they accidentally broke it. It's just the thought of common courtesy that counts!", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "The tides are turning. \n\nI'm not a Starbucks guy, never will be, but my girl loves their iced tea. I decided to grab her one this morning.\n\nIn the instances over the years when a Starbucks was the only option, I've always refused to order with their ridiculous sizing system. At this point I probably even know the sizes by name.\n\nBut today I went in to get that tea, and the girl taking my order recognized my grogginess. As I ordered the drink she pointed at the cups and asked, \"Big or little?\" \n\nBrothers and sisters, please continue to order your Starbucks drinks in small, medium and large and we will wipe this ridiculous system off the map forever.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-13", "description": "I used to work here!\n\nAnd I loved this job. I loved serving the construction workers in the morning and the students in the afternoon. I loved waving at the little babies in their strollers. Most of all I loved taking orders. I had a trademark flower that I wore in my hair everyday and everybody knows I smile all the time so how could you not want to give your order to me? I don't know what they do at other Starbucks but it seemed like the work of our staff was a ittle more heightened. We all really looked out for each other. Milk containers were replaced not refilled. Sugar containers were always full. Spills are mopped up and tables wiped down. It was a simpler time.\n\nNow that I no longer work here, I am a patron whenever I visit. It's still pleasant. It's still a long wait on a Saturday morning. They still call you by name and it's still a personal coffee experience. Open 24 hours. A large staff. A large cafe space. And beautifully laid out. Puppies wait outside for their owners. Californians rejoice that your coffee is not taxed and way cheaper than New York City!\n\nI love this 'bucks. Always will.", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-14", "description": "Trendy. Expensive. Weak Coffee. \n\nDo you want this? \n\n-Enough said.\n\nOn a positive note, I do like that they are some cute girls who frequent this place...late nights.", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "I grew up in Seattle. I started drinking coffee when I was 4 (one of the many things my grandmother handed down to me - entertaining, shoe shopping, fast talking and coffee drinking). As such, it is only appropriate and expected that i like Starbucks. Don't start screaming at me about Pete's. \n\nI do. I like Starbucks. I especially like that there is a Starbucks 4  blocks from my house and I can lace up my Nikes and walk my grouchy morning self down there.\n\nHowever.\n\nWhy is it that every single morning, if you are to stroll in any time between, say, 7AM and 11AM, the staff at this Starbucks looks genuinely surprised to see the large amount of customers that are in the store? Every darn morning, the line starts exceeding 20 soon-to-be-caffeinated business types and moms with strollers. The line goes out the door. And there is always one dude apologizing and ringing people up and one chick bagging fat free muffins and one completely crazed looking chick operating the milk steaming machine.\nEvery day, same routine  Look of bewilderment in their eyes like \"Dear God! Did Pete's down the street run out of sugar? Is $12/hour worth fighting off this mob?\"\n\nDear Starbucks Corporate:  these poor people need some help! Your brain-washing, ahem, I mean marketing has paid off really well and this store is super busy. The medical staff from the hospital down the street come here to stay awake, the nearby students spend hours and hours here studying, the 1,267,567,562 new moms in the neighborhood stroll in their bambinos and fret over binkie options. The rest of us poor working class stiffs just need some coffee. Maybe you could put in some sort of Express Lane, \"Ten Seconds of Patience or Less. Cash Only\"", "author": "Megan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-18", "description": "Open 24hours.  2 stars.\nFree parking lot.  1 star.\nQuick service.  1star.\nNo homeless asking you for change, and not having to hear them cuss at you when you tell them you really have no change on you, 1 star.\nAnd i ran outta star for their roomy sitting area.", "author": "Tadaa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-16", "description": "This is the only 24 hour Starbucks of which I am aware.\n\nAs a night owl, I'm always glad to visit at 3:30 AM or whenever. It's spacious and I have found the staff to be consistently friendly. As for the food and drinks, it's pretty much standard Starbucks fare. A nice little nighttime oasis....\n\nI have mixed feelings about Starbucks as a chain -- mostly positive, but some negative.  I remember seeing a cartoon in the New Yorker (?) in which two people are sitting at a table in a Starbucks.  One asks the other, \"Are we in this Starbucks or the Starbucks up the street??\"  Yes, there are plenty of them.\n\nBut I give this one five stars for being open 24 hours and for having a courteous staff -- it's not always easy to be courteous at 4 AM, but they seem to do a good job of it!", "author": "Brett R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-03", "description": "The only 24 hour Starbucks I know of, and with a very pleasant and polite staff. \n\nUsually my friends and I catch up here on breaks back from college, over various frappucino's and white chocolate mocha's. It's always clean and always cozy, especially in the whee hours of the night. I wouldn't recommend coming around midterms or finals time as all the crazy college students are cracked up on caffeine and anything as much as a cough will yield death stares.", "author": "Jordann G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-26", "description": "I've recently started drinking more Starbucks cause I want their  gold card. Lame reason, I know. Anyway, I came here after my dad's visit to the SF Endoscopy Center down the street. It was about 8am, so they were busy. Though the line was long, they were able to take my order and make my drink fairly quickly. What's cool is that the workers here recognize the regulars and greet them by name. How friendly of them! I also like that this location is open 24 hours a day--perfect for a study sesh.", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-03", "description": "This place is great, the staff is always friendly as heck dispite the buttload of people that line up and seem to act angry and rushed.\n\nBathrooms are clean, plenty of room, just not during finals. \n\nThank you employees at this starbucks!", "author": "Steven C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-29", "description": "24hrs! 24hrs!!!!  Did I say 24hrs!?  That is what rocks... there is parking... but the minus 1 star is for the tabling hogging college students who think that having one drink allows them to stay there for 5 hours. They really need to find a way to make seating available for all... it just doesn't seem fair not to be able to enjoy your drink and go.  I know USF has plenty of places for you to go study.. I went there! The staff is cool too.. and for some reason it seems to be a cop hangout.. so I feel safe knowing there are licensed gun holders around just in case it is needed... just don't aim that thing at me! \n\nThe staff is friendly too... for a late late night place to go have coffee... this place works for me.. ;-) Alas... it is a chain... but I am not a coffee drinker... not a hard core one... so their coffeee is ok for me.", "author": "Amelia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "The only reason I can't give it 5 stars is because its TOO popular, given its the only 24 hr starbeezies in the area. That being said, recently i've found some good seating there (probably bc I was there for like 8 hrs at a time...ugh.) (and let me just say that grad school can't be worth the pain of the whole app process. ok jk i take that back, i know its worth it. School, please let me in.) \n\nParking is definitely manageable after 6 bc its free street and there's a lot in the back. During the day, this starbucks is not worth it. Meter parking (bleh) and the lot in the back has a 90 min limit and a $65 ticket or something. (big bucks) Not worth it to come out here to study before 6. Tons of outlets and the normal starbucks wifi (ATT-free for ATT DSL customers- and tmobile). all in all, people should get lives and go home (so lamers like me can study more. haha)", "author": "Grace G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "Great 24 hr starbucks! There are a lot of med/law students here studying... The only downside is it gets really crowded between 9-11pm. If you plan to get a spot here get here before or after those times. The baristas are really nice, especially the girl with short brown hair.", "author": "Daisy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-03", "description": "The staff at this one rocks.  I give it three stars because there are always SO MANY annoying people there studying.  I simply do not understand why people find it fun to study in a Starbucks  It is 24 hours and near USF and lots of high schools, but it is so crowded.  If you are going to meet another person (god forbid) to chat and have a coffee, you'd best be going to take your coffee elsewhere or standing around awkwardly while the studying people rearrange in a less spread out way.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "3.5 stars for their barista skills in making drinnks.. WHY? because often times my latte/frap/machiatto would come out flavorless!\n\n4-4.5 stars for their location - hours for operation - parking\n\nstarbucks on california is a great hangout spot for latenight chitchats and homework or studying. plenty of parking. there are lots of tables and the baristas there are friendly + great customer service. \n\nwhat i dont like about this starbucks.\n-caffeine beverages are sometimes very bland (and i feel bad to have them remake it so i just take whatevers there =( ) \n-the music is not soothing for sh*t, cant they play some more goodies from 96.5 or something? some slowjams or lightrock would be nice...", "author": "Jo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-27", "description": "Open 24 hours a day, wow. What can I say? If this Starbucks was at my neighborhood, I'd probably be a regular especially on nights when I couldn't sleep and feel like writing. Sometimes I feel the need to be out where there are people since writing can be a lonely experience. And to be in this cafe where a lot of people seem to be doing their own thing on their laptops can be encouraging. So for sure, this Starbucks is definitely high on my list as one of my most favorite Starbucks. In addition, even though it is street parking, I did not have a hard time finding a parking spot. Maybe this only applies at night, but in San Francisco, to find a parking spot on the street easily is so very important.", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-29", "description": "Even in a Sunday night ay 9pm labor day weekend its full of people. Seems like a very nice, cozy place to get a drink and hang out. But very hard to get a seat at night, the one time I was in the area.\n\nSo its 24 hour Mon-Sat, and till 1am Sun night? Cool. I need to remember that.", "author": "Dijon Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "I spent a lot of money here, so that I would never have to come back.  Let me explain: I came in with a friend and picked up an espresso machine, some beans, and a coffee grinder.\n\nThe person behind the counter cheerfully helped us out.  Even though there was a decent line, she came to give us the skinny on the different products and functions of each machine.  Pretty awesome.  \n\nFrom what I could tell, and I'm by no means a connoisseur, they had a fair assortment of machines.  Unfortunately, the coffee grinder I got was out of stock, so I had to settle for the one on the shelf.  Nothing a good wash couldn't cure.\n\nThe best part was that I got hooked up with employee discount.  w00t!  Now I can enjoy lattes every morning and I don't even have to leave the house...", "author": "Tony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-03", "description": "Ok, this place might be my stomping ground if I had time and babies.\n\nBut I don't.\n\nIf you are usually on the run and don't have time to wait around, don't go to this Starbucks. It once took me 25 minutes to get my coffee. I know because I put money in the parking meter, and I ran out of time. This Starbucks is right by my house, and the parking situation is usually decent. You can pretty much find parking here in the mornings. However, it's so much quicker for me to drive down to Fillmore, find parking, and pick up my Coffee Bean. For this reason alone, I dread going to this Starbucks.\n\nThere's also no chance of getting any work done here. Babies and toddlers are running around and screaming. Moms are trying to make the most time out of their outing of the morning and chatting it up with other moms. \n\nThe coffee here tastes burnt, and the other drinks are always too sweet. Don't go here if you can avoid it. \n\nThe only plus side is that this Starbucks is the only one in the area that is open almost 24/7. That might be because it's next to two hospitals.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-12-10", "description": "THIS is my local Starbucks.  It sits at the end of Laurel Village with some grand, brooding quality, as if it knows everyone around it hates it, but they'll still inevitably go to it.\n\n(I've spent some time thinking about this, and have come to a conclusion. There are four coffee shops on this specific block(Lo Cubano, Petes, Cafe Rigolo, and Starbucks). The mothers and fathers are too scared of the newness of Lo Cubano, Petes has no sitting area, and Rigolo offerst too many -OH NO- fattening goodies.  So everyone to starbucks)\n\nAs I am originally a suburbanite, I can tolerate a Starbucks.  I don't like it, but I do.  But this one, oh, it's just...obnoxious.\n\nIt's not so much the baristas or the overpriced drinks that get to me, it's the crowd.  High strung men and women, often toting along some accesory like a briefcase, an old laptop, or a kid on a leash. Grumbling in line. Bad attitudes all around. \n\nYou almost feel sorry for the staff, and perhaps that's why I continue to go there.  To offer a smile as I order my Grande Iced Non-fat Caramel Macchiato With Extra Caramel to that poor bewildered teenager behind the counter as he gets badgered by an unending line of grumpy elders.", "author": "Carly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-20", "description": "Sitting here at 6:43 on a monday evening, I could go on and on about how Starbucks is the devil and blah blah blah...  \nWhen I feel like I NEED a cup of coffee, I'd sell my eyeballs for 8 ounces of hot caffeinated anything.\n\nIf I were a student;  If I were a smoker;  If I lived within 10 blocks of this location;  I'd make this my home.  I'm not though.  I've been here twice.", "author": "Patrick A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "Great service. Feels like cheers. \"where everybody knows your name.\" This review was long over due. Gene, Mr. Gentle giant always a sweetheart. Helen, so quick and always has my drink perfectly made down to the last drop of foam. Sandra spunky little fun size pack of skittles,always full of personality. Keith, so efficient and such a charmer.", "author": "JUDY H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-07", "description": "I keep claiming I hate starbucks. but this is the 2nd in a week that I'm giving a positive review for (and unfortunately it's going to be 3 soon, damn you Outer Richmond starbucks!). That's it, I give up.\n\nI. Love. Starbucks. I love your lackluster coffee, your bad choice of food, your often annoying and rude barristas. At this particular destination it's the ample seating, 24 hour openness, and the fact that your packed to the gills at all times (seriously, you made me realize how many other students live in my neighborhood.) Look I like the ability to get caffeine at 3am.\n\nNow I've got no beef with Maria D. -- but I love Laurel Heights. It's like Yuppie Light, perfect for me and my special brand of quasi-gonzo-revolutionary-intellectualism. Although I will say this, yeah most of the people that live here suck.  \"Laurel Heights - Hey, we're better than Glen Park\"", "author": "Tyler W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-10", "description": "I love places that are open 24 hours...nothing like it. I'm a vampire don'cha know!! So I bring my cousin and her friend over here one night for late night discussions and coffee. My cousin at the time had been dating a friend of mine and she was going through a phase. I like to play devil's advocate and instigated a conversation. I guess her friend didn't take too kindly to my line of thought when she would TRY to rebuke me. She had taken it way to personally....my cousin and I were having a good time running with it...partially because we were getting such a reaction out of her friend. \n\nMy cousin later told me that her friend hates me with a passion. It's too bad, I thought she was cute. Nothing good happens after 2am...lmao\n\n2 stars because it's open late....really late", "author": "John-Michael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-22", "description": "What better way to start your morning off after an early workout??....\n\nCoffee, of course!\n\nI love the location of this Starbucks because it's literally 24 steps away from the 24 hour Fitness on California Street I go to.  Yes, there's a plethora of coffee places along Fillmore, but I chose Starbucks because I wanted to feel less guilty after sweatin' it out at the gym. So I ordered the skinny cinnamon dolce latte for only 90 calories.  I saved on the calories, but not so much on my wallet...a tall for $3.35. \n\nLove the location, friendly staff. They get you in and out so that you can rush off to your next destination.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-27", "description": "NOT open 24/7... they close for 3 hours on sunday night, so i walked 6 blocks, freezing my ass off, to not have my favorite drink when i was having trouble sleeping. booo!!\n\nUpdate: i just realized i had a one start rating for this place for hella long! I super appreciate this starbucks location for their hours and for how big they are. I've come here multiple times for study sessions and, although it is super crowded, we always seem to carve out a couple seats for us.\n\nthe only thing that is unnerving about this place is the amount of cops that come here.", "author": "A. H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "3 stars, because they run a tight ship, extra star for friendly baristas and being open 24/7.\n\nYou'll see a ton of PoPos because of the 24/7 so feel safe here.  This place is packed at night when schools in session so you might have to stalk for a table.  The music is not blaring here, thank you jebus.  Also, there is a good amount of seating here.\n\nPark in back or park on the street.\nDrink, talk, study or whatever.", "author": "Po L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-20", "description": "Fyi, this location now has gluten-free Valencia Orange Cake for $2.  Pretty delicious.\n\nNot sure if all Starbucks carries them now or not, as I do not frequent Starbucks.", "author": "Mrs F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "I went here last week during a really busy time of the day, and the quality of service has greatly improved.  The cashiers were very nice and helpful and the drinks came out quickly despite the crowd.  Awesome job management did making improvements.", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "I don't really have coffee often unless I'm having to be up early for work, but this place used to be in my neighborhood and stayed open late. And just for the fact that I had a very close friend who worked here that I used to visit, I'll give it 4 stars for the memories.", "author": "Petra S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-13", "description": "(As many a Yelp review has started....)  If I could give no stars, I would.  Well, I guess the one star could count for their 24-hour location.\n\nIt's across the street from the gym and my mom always puts Starbucks cards in my stocking at Christmas.  Hence, the reason I stop.  It always takes too long.  They always screw it up.  They always have a bad attitude.\n\nBut one day, they took it too far.  The coffee machine at work was broken and I needed to pick up one of their travel cases for the office.  I know that takes a while to fill so I always call ahead to whatever location I'm hitting up.  \n\nIt was 6am; I told the girl I'd be there at 7:30--could they have it ready?  She doesn't put me on hold, just covers the mouthpiece and rudely screams the information to a co-worker.  Back to me, yes, they could have it ready.  7:30 for Melissa.\n\nAfter waiting in their atrocious line, I get to the front at 7:35.  I'm Melissa and you've got to be joking me that you have no coffee waiting for me!  \"We forgot.\"  No \"I'm sorry.\"  No \"Could you use a cup of coffee while you wait for our incompetent asses to make what you requested an hour and a half ago?\"  No, just smug looks and the slowest service ever.  If I didn't HAVE to have it, I would have torn them a new one right there and walked out.  \n\nI wrote to their headquarters about the situation.  They did send a gift card (goodie, another one--*groan*).  The amount?  $10.  Hey buddy, that damn traveler is $13 and my aggravation is worth a whole lot more!\n\nDamn, I'm getting heated about this still!", "author": "Melissa Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-10", "description": "I never knew that a green tea latte has this unnatural, neon green color to it. I have been enlightened. \n\nI recommend a grande; there's enough sugar in there to give an 80-year old man an artery-bursting erection for 6 hours.", "author": "Frank B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-23", "description": "I've been to a lot of Starbucks and have to say, this one has the friendliest staff!  The furniture is nice, the coffee is great, and they serve the new breakfast sandwiches.  \n\nOh yeah - this one is open 24 hours a day!", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "I usually only come here around 11pm. The workers are friendly and always try to remember my drink which is nice. Love love love that they are 24 hours! Night shift workers dream!", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "Coffee, 24hrs a day! Best place for late night caffeine! Even at 2am the baristas are perky. Line can get long during the day but overall a great Sbux!", "author": "Maya L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-05", "description": "This is my favorite Starbucks in San Francisco mainly because it is 24-hours.\n\nIf you like to bring your laptop and do some work, this is the place though tables are pretty hard to come by because of its proximity to UCSF (or is it SFSU?).\n\nTrying to work here during the day is not pleasant as it gets a lot of foot traffic. At night, there are a lot of students here doing their homework.\n\nI have spent late night/early morning jaunts here a couple of times. One was when I can't find parking for my car in Lower Haight so I decided to spend the night here and the other was to watch the recent Australian Open Final between Nadal and Federer because my internet was out and I have no cable.\n\nThe staff are very friendly and they try to keep the place clean.", "author": "Dan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "your 24 hour starbucks, anytime and day... there open for you, woot hoot... except for monday's 1am-4am which closed for cleaning :P", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2005-10-21", "description": "This is exactly identical to almost every other Starbucks I've ever been in, except with a much longer line.  I shouldn't have to wait that long for coffee that bad.  I have it on good scientific authority that coffe costs about  64 cents a gallon to brew, theres no reason to sell it for $4.50 a cup, no matter how much syrup, ice and whipped cream you add.\r\n\r\n\r\nhttp://www.cockeyed.com/inside/coffee/coffee.html", "author": "Herbert S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-02", "description": "Starbucks Would get ZERO stars if that were an option.\n\nDear Yelp reader please find below a letter I sent to Starbucks regarding their company.  I was sent a form letter in response and it didnt address any the questions raised in my letter!!! \n\nMarch 21, 2008\n\nMr. Howard D. Schulz\nFounder, Chairman, Chief Executive Officer & President\nStarbucks Corporation\n2401 Utah Avenue South\nSeattle, Washington 98134\n\n Re: Starbucks Stock\n\nDear Mr. Schulz:\n\n I am a shareholder of Starbucks stock and am writing you in an attempt to understand why my investment has lost over half of its value in less then two years.  Let me start by saying I purchased your stock because I was a longtime consumer of your product.  I enjoyed the coffee and the atmosphere that Starbucks offered.  After some financial research I thought it wise to invest in your company.  \n\n At that time Starbucks was not only selling coffee and teas but also divesting into the compact disc market and selling refrigerated drinks in grocery stores.  Starbucks even had a coffee store in China's Forbidden City (quite a feat!).\n\n Since April 2006, when I invested in your company the stock has done nothing but drop.  I've included a chart in case you needed a visual.  It's gotten so bad that when I see the stock only slip 5 or 10 cents on a given day I think it's a victory.\n\n Now, you've just lost a lawsuit requiring you to pay $100 million in back tips to your employees.  I don't normally make a habit of writing letters to the CEO's of a company I own stock in, but in this case I've made an exception.  I need my voice to be heard and I can no longer sit on the proverbial sidelines and watch this company dump my investment.  \n\nWhat are you going to do to turn this around?  Tell me; what future plans do you have that will right this sinking coffee company.  \n\nOr should I just sell what little of my investment is left and join the growing membership of those dissatisfied with big corporate business. If that is ultimately what happens I can tell you that there will be no more of the proverbial sideline for me, I will be vocal, but not for you.  \n\nThank you for your time in reading this letter and I would appreciate a response. \n\n\nRegards,\n\nChris G. \nShareholder\n\nSo let's all go somewhere else for coffee now!! \n\nWho's with me!! hehee", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-15", "description": "Extra star only for being open 24 hours.\nIt saved me during finals and the week before.\nRecently redone to accommodate more people.\nCoffee still mediocre Starbucks, but at 4am caffeine is caffeine.\nDuring normal hours I'll be down the street at Lo Cubano or Peet's.", "author": "Emily P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "I would rate this Starbucks a 4.5 but it's just not that great to round up. 5 stars for being the ONLY 24hr Starbucks in SF but 4 stars for barely having enough seats. I know they could add at least another table for us all-nighters then again it is a small place.. sorta.\n\nThey just recently \"re-designed\" the place and quite frankly, I think the previous layout was waaaaaay better, but I guess I can't really complain if that's the only Starbucks that will service what I want at the ass crack BEFORE dawn-- before because I'm just a vampire like that. Who the hell wakes up during the day anyway!?", "author": "Janell Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-17", "description": "this is quite a quirky starbucks.  it must be because they're 24/7.  they got rid of my favorite dessert pastry ever - the classic coffee cake.  No! - not the one they have now, but the one that used to be squarish, big, and tasty.  those were the days.\n\nthis particular location also seems to attract a lot of the...nerdy crowd.  not the crowd that enjoys the sunday times, or reads the latest palahniuk novel.  it's more like the same crowd that would wait 3 days ahead in line for the new star wars movie.  you see where i'm going with this?\n\nalso, pike place coffee sucks.  i hope they get rid of it.  i'm heading to peet's up the street.", "author": "Ash C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-22", "description": "I used to go to this Starbucks for a whole semester in the mornings before school, now I got too lazy and instead buy those bottled Frappuccino things instead. \n\nIt's way easier to find parking here in the mornings, before 9 am. After that, good luck. Even the lot in the back is pretty full, but that's only because it's surrounded by a bunch of stores as well. \n\nYou won't always find a seat here even though the inside is pretty big. Seems to be a popular place to go in the area. \nThis place was always crowded, but the baristas tried very hard to get everyone their drinks and have them out in no time. Some of them even remembered my name when I came in. \n\nIt's not amazing, but it's not as bad as some of the other locations I have been to in the city.", "author": "Bella S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-28", "description": "Okay. This is SO lame of me to review this... but I HAD the BEST breakfast here yesterday. This isn't served in all the Starbucks locations, but this is offered here in Laurel Village. I've seen this in other Starbucks, so if you run across one in the morning... you must give it a try.\n\nThe sausage, cheddar, egg breakfast sandwich on a English muffin is DELICIOUS!!! It's SO yummy... It's served toasted and piping hot! I love how it's so crispy on the outside. I savored every bite.... With my breakfast sandwich in one hand and a tall latte in another, I swear my Sunday morning couldn't have been any better.\n\nIn addition, they also offer many varieties of breakfast sandwiches: spinach and egg Florentine, bacon and cheddar, and ham, egg and cheese.", "author": "Denise L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-02", "description": "oh BOY.\n\nSo this is my (new) neighborhood Starbucks.  and, true to form, ALWAYS BUSY.  Full of strollers, toddlers, crumby screamers, sullen teenagers, and various other characters.\nGod, i love it.\n\nThey have all my treats.  The staff is sweet.  That's all I need.\n\nOH.  And they're open 24 hours.  If ever I should need such a thing...", "author": "Alison R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "It's great that it is open all night and has plug ins and wifi! But the staff is often curt and immature and there seems to be ALOT of them working all at once. I just came from there and they had no coffee made and thought it was funny that I found that exasperating. I packed my stuff up and left. They are, afterall, a coffee shop with 2 regular coffee makers. Why in the world can that many workers allow the coffee to run out? And then get smarmy about.", "author": "Vince's S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-03", "description": "Review for Starbucks\n\nClean Service from another big boring liberal progressive multinational conglomerate helping to warm the earth.\n  \nI don't know how anyone can drink coffee if the say they believe in global warming.  There is no excuse for cutting down the forest, building a coffee plantation, fertilizing/ pesticiding (petro chemicals) and use a fossil fuels to ship the stuff half way around the world so you can drink it.  You don't need coffee!  You could drink water.  With that said, I don't believe in that global warming hogwash, so I can enjoy my drink of choice.  If I see you there, I'll know you don't care about global warming too and we can toast to our fossil fuel SUV's with abandon or even worse the earth destroying Prius.  (read the down and dirty on the Prius here http://clubs.ccsu.edu/recorder/editorial/print_item.asp?NewsID=188)  \n\nSo many coffee/ tea houses burn the crap out of the tea leaves with too hot water, or by leaving the bags in for a long period of time (yes I could stick my fingers in and yank the bag or the  melted straws used to dangle the bag out but it's too frakking hot and messy.)  All these practices used by these big liberal-progressive-democrat-supporting-ozone-destroying-global-warming-multinational-corporations like Starbucks make the tea become bitter.  These liberal progressive multinationals are too busy trying to make money pushing out 3-4 buck latts to the clients who are destroying the planet to use proper tea making protocol for the low profit margin drinks like the more earth friendly teas.  So it may your tea weak like the science behind global warming, but yank the tea out of the cup quick or you will become bitter like AL Gore.\n\nMeg says the coffee here is acceptable but prefers Peets.   I don't particularly prefer the tea here, but I do appreciate the clean nice atmosphere.  The great muffins and breakfast sandwiches (soon to be ax'd?) make this a decent choice for a breakfast alternative to a sit down restaurant.   The kids and I don't like the hot coco here as it's more bitter-grainy euro-styled than American (funny that I prefer my chocolate euro styled but hot-coco American.)  Anyway I still do enjoy my Tea here and I know that every cup I drink makes me a little warmer inside and the planet a little warmer too.  Whether it's coco, coffee or tea enjoy your next cup!  I know I will!", "author": "jack w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-15", "description": "THIS STARBUCKS IS GOING OFF!  IT IS THE BOMB-DIGGITY SHIZZZZNIT!  LAUREL HEIGHTS, HOLLA!\n\nI'm not kidding.  This place is actually the epicenter of all social activity in Laurel Heights.\n\nYeah, sure it's kinda lame that this is the most poppin' place in Laurel Heights.  But oh well, what are you going to do?  Laurel Heights is \"MacLaren StrollerLand\" and I'm not going to hate on Starbucks for providing caffeinated beverages 24 hours a day to all the moms in workout clothes and their kids with perfect color-coordinated crocs.\n\nI don't function without an injection of coffee and I love that Starbucks is only a few blocks from my home.", "author": "Ellen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-29", "description": "Not a big fan of Starbucks!!  Wait, I have to admit that I love their\"White Chocolate Mocha Flavored Syrup\".  Let me rephrase it, \"I ONLY love THAT syrup and a special request of two pumps.\"  Otherwise, way way way too sweet.\n\nStarbucks is Starbucks.  A chain is a chain.  \nBut this one.....this one has its niche,\n1) 24hr--\n2) Easy parking in the front, the side, and the back.  \n3) Huge seating area \n4) Nice street view with big clear windows\n\nI enjoy coming here Sunday morning sitting in a corner reading my favorite book and observing the activities through the big screens, people, dogs, infants, trees, flowers, cars, even the chairs, all seems alive..... THE WORLD IS VIVID. \n\nI gave it 5 stars for it's location~\nI will come here again NOT because it's Starbucks.\n\nPS.  I only went there ONCE!  THAT Sunday morning ~~ Bleh!", "author": "Smiley W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-06", "description": "Back in the old days when this Starbucks still has booths inside, it felt so much more like the \"Third Place\" enviornment they try to convey.  However, now there are seats everywhere and couches in the middle of the floor, it's almost impossible to walk through the store.  \n\nGotta give it to them for being a 24-hr store though, and the service is actually pretty good!", "author": "Karina L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-09", "description": "The central location and 24-hours of operation make this Starbucks the ideal one for me. Nothing like grabbing something hot to drink after a long night out. And the people that frequent this Starbucks are true characters, I've met some very interesting and cool people here.", "author": "Alldaron K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-27", "description": "This is one of my favorite  STARbucks! They have some Stars workin there!  JoJo and Keith are awesome everytime I come in! They know how to give awesome service and make the environment so fun! This is a busy store but good atmosphere, whether you are wanting to study during the late hours or sit and people watch it's all entertaining!!! Wooo  for this starbucks!", "author": "Natalie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-15", "description": "This place is good. Quiet and the staff are down to earth. It's right inside the Wells Fargo Bank so you can get some money and drink your fix..( ok theres no pun in that one) \nOpen table area and very relaxing. Clean place.\nMy choice.", "author": "Smooth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "I like this place because it's opened 24 hours.  \n\nPlus it recently got renovated this week and it now offers more workspace!  Yay!  More work nights at the Starbucks!\n\nAnd of course now if you get a Starbucks card you get free wi-fi.  \n\nNote this is all about the work friendly hours and workspace at this Starbucks.  Not about the quality of coffee.", "author": "Alan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-04", "description": "love this starbucks!\n\nhave stopped by during late night hours, and it's a good setup with lots of chairs and individual tables that maximize the space.  \n\nthe decor is clean and modern, yet warm.\n\nwas here weds 9am and the place was run like a well oiled machine!  everyone was friendly, quick and accurate.  i even heard a \"pardon my reach\" from one of the cashiers.  thought i spotted a little girl carrying a brown balloon (from starbucks??)  either way, both are a first!\n\nthis location is now first on my list for future starbucks' runs.", "author": "Josie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-28", "description": "awesome place to get your studying done, this starbucks can get a bit crowded, which makes it hard for people to find a seat to settle down with their drink and hit the books. i'd definitely recommend this place for anyone who needs a place to study at because they offer free wi-fi !!", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-25", "description": "I was originally very anti-Starbucks, and wrote that I hoped that San Francisco would be the first city in America where everyone would say \"NO!\" to corporate conglomerations and (in Starbuck's case), frequent only our local independent coffee shops. \n\nHOWEVER, I changed my one star to five after doing some research and discovering that they give a ton of $ to very worthy causes and treat their employees well.. \n\nI still don't care for their coffee but I'd go in and buy my bottled water there!", "author": "Lala B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-05", "description": "Very close and I can walk to this 24 hour Starbucks just blocks away.  What do you expect other than it is, just some place to read, study, meetup, kick it, and actually have some coffee.  \nOh, can park my  motorcycle on the sidewalk without any issues.", "author": "James H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-06", "description": "I like places that are open late, have decent coffee, (really over the coffee snobs) offer internet service, some food and a reasonable amount of places to sit-I'm easy to please.  This Starbucks is all of the above with the added plus of being open 24 hours.  No matter how hard I try, my circadian rhythm just peaks late at night.  Therefore, I appreciate establishments open late because there are so few.\n\nThe crowd is a conglomeration of people.  In walks: students, couples, ghetto-fab wannabes, punks, yuppies, fams w/kids and a smattering of some older professionals.  I just stick in my earplugs, playing either classical or techno music (mostly) and studdy away.", "author": "Katherine P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "Open 24 hours yippiee!!  (3 open 24 hrs)\n\nPositives:  Big store, lots of seating; carries lots of cups and such which is fun as it gives me something to browse while a take 5; has two nice big public bathrooms;  no people begging change.  \n\nThe negatives;  can be crowded even late night; has a few pkg spaces in front w/meters and some on side street so can be a bit difficult to park;  lots of cops congregate here which can be good or bad depending (driving a cab this also means they are driving around here a lot which is not too good for me :);  employees are allright but not really friendly and never seem to remember me.  they can also have a bit of an attitude", "author": "Carol O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-09", "description": "During the day, almost impossible to find parking even with the big lot out back. You wouldn't want to come here during the day anyway due to the crawling children, would-be soccer moms, and geriatrics. At night, it isn't much better. Depending on the day of week, the place is either crawling with wannabe mafioso Russians, students slaving away with their heads in books, drunk people post-club, or slackers absorbing the free internet.\n\nAnother problem with this Starbucks is due to the fact it's late night hang-out central to some, it's a feat finding some place to sit past 7PM. If you manage to find a seat inside, better have a friend to save your spot if you need to piss. There are benches outside, but beware if you're not a smoker. The spit and butts will no doubt disgust you.\n\nGiven how close this Starbucks is to my house (far closer than the quiet, empty, lots of parking 24hr Serramonte Starbucks), I frequent this place often enough to know who works there at night. All the night/early morning baristas are nice and no one I know has ever had a drink order messed up.\n\nIf you're already on this side of the city, really need coffee at 3AM and don't want to pay the booth-minimum at Video Cafe, head here. Just don't expect to sit down if it's the weekend.", "author": "Grace-Monday B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-14", "description": "I have spent many late nights/early mornings studying and writing incredibly long term papers here. If it wasn't for the encouragement of coffee I would never get any work done!\nI love this place- the employees are friendly, the green tea latte is great and I love the way the place has been renovated with more room to study.\nThank you for being open 24 hours!!!!", "author": "Valerie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-16", "description": "My latest update to my prior reviews of this Starbucks would be entirely too long to post here, so instead here's a link:\n\nhttp://sarka.tumblr.com/post/818628275/starbucks-laurel-heights", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "24 hour service thats what help me open my eyes at 5am. before long trip to LA.everything was Nice.Will stop by again!!!", "author": "Armand A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-19", "description": "great staff but like all other starbuck's long line but longer than usual due to location.\n\nNear hospitals, clinics, UCSF Laurel campus down the block, many young parents with time on their hands.\n\nThe staff are amazingly upbeat although overworked.  Good thing there's a Peet's down the block for overflows", "author": "Ariel W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-24", "description": "Starbucks at its best and worst... Good things - open 24/7. Not so good - really crowded during daytime. No easy parking on weekdays if you happen to drive a car from out of area. Now, as a work-from-coffee-place veteran I feel entitled to have some strong opinions about which of those are good spots. My first impression of this one - a coffee factory. High traffic levels. People fighting for a place to grab and work. Pretty descent infrastructure, though. Lots of sockets (unfortunately a major consideration for someone working on media intense, lousy-battery life laptop). Coffee - a matter of taste, but definitely plenty in your immediate reach. Food - never found the Starbucks food appealing. Bottom line - one does not go to Starbucks for food. I don't.  Summing up - good to know the place exists, but definitely not my prime 'office' location, given a choice.", "author": "Rob R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "This place was my second home for about 3 months while studying for my PMP exam. open 24 hrs, free Wifi and comfortable seating. Always clean and friendly staff. there are alot of studious students here making it a great studying environment. O i miss the good old days.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-09", "description": "it's always fun when girls checking out my tattoos forget to swipe my credit card because they're staring. i almost scored four free coffees here today.\n\nthis place is open twenty four hours a day. not sure why this one is open at all hours of the day - it's not as if laurel heights is that bumpin' of a 'hood. but whatever, i'm sure it serves a useful purpose. i know i've been happy with it the three times i've been here lately.\n\nstarbuck's DOES need to get off that damn t-mobile network and offer free wi-fi to people. it's not as if they cannot afford it. jerks.", "author": "Jeremiah W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-30", "description": "Maybe I caught them on a bad day but I took the bus to this Starbucks because of the 24 hour nature... Only to betold they were closing in 30 mins after I purchased my drink.  Then after making a terrible version of my drink refused to stir it.  Worst starbuck experience in SF so far!", "author": "Allen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-06", "description": "24 hours starbucks. one of the fewest in the city that is  still 24/7! its pretty busy and with that in mind..ifyoure going to come here in the future , and i have to wait for you to finish your ridiculous douche bag order( if youre one of these types  : ) )...please get off your phone, control your baby, ACTUALLY  KNOW what you want to order before you get to the register and hold up the already 25 ft line back into the hallway. \n    oh....and dont get pissed off when the barista cant hear you because of the grinders,people and babies crying all over the place , and asks you to repeat the order... they dont read minds and can not tolerate your spoiled shitty tude. dude...they dont want to hear it  and neither do we :) so save it.\n\n\nENJOY your visit here!", "author": "jason t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-01", "description": "this review is only about the red velvet cupcake.  (i don't really care for or go to  starbucks except for their salted caramel signature hot chocolate)\n\ntheir red velvet cupcake SUCKS!!!!!  too sweet, overwhelming flavors that clash, too much........like grocery store quality cupcake......yuck!!!!!", "author": "Cindi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "Why bother reviewing a Starbucks on Yelp? Because it's fantastic. Huge, clean, frequented by a ton of regulars that the baristas know by name --  this place is fantastic. The decor is nice, too -- feels like your run-of-the-mill Starbucks took steriods and got an upscale makeover. Only downfall can be finding a place to settle during the daytime hours. I'm obsessed with this place!", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-17", "description": "A great Starbucks!  Excellent service, lots of friendly smiles, good seating,a dn I got a new favorite brew from their signage: skinny cinna mon dolce latte!", "author": "Margaret L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-30", "description": "The Starbucks here is very nice. There are some outdoor seating, but there is not much. Wifi is free, and the place is often packed. The waiters are usually helpful and nice. You often see college students, adults, and young couples there. Parking can be a pain, but there is a parking lot behind the place.", "author": "DJ Guan Yu M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-26", "description": "Starbucks is my second home. I love coming here and getting my coffee while reading a book. I love the free wifi so I always bring a computer with me. It is definitely a great place to study.", "author": "Queen E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-26", "description": "Good location, always packed though. Sometimes the line is so long you can actually walk a few blocks down the road to get to an independent coffee shop in the same time as you might wait for your turn at this Starbucks. One issue I often have at all Starbucks, tea type drinks are way to hot.", "author": "dunz r."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-06", "description": "Starbucks allows guns to be carried openly. I advise everyone to go down the the block to Peet's Coffee & Tea. The coffee is better, the staff is more  professional and it is much safer...no guns there.", "author": "carol c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-18", "description": "A Starbucks is a Starbucks.  But I like that this one is open 24 hours.  I tried to order my usual soy chai latte but they didn't have any soy milk.  Sad.  So I had to order it with low fat milk instead.  But since they didn't have soy, the guy comped me on the drink.  So bonus points for them.  Ample seating, at least on the night that we went.  Crowd seems kinda high schoolish / college-y and asian, but who cares because you're really there to chat with your friends anyway.", "author": "spiff e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-30", "description": "My roommates and I live in the area.. we stopped by Starbucks this morning. I will admit that I am not a daily starbucks customer but, I come here on occassion. My order is not perfected to a science like most starbucks customers.. I ordered 1/2 hot chocolate and 1/2 coffee, something i've ordered before at many different places and have never had a  problem. The lady taking my order was so rude she made me feel like an idiot. Worse, she did the exact same rude attitude to my roommate just after me. It definitely didn't make me want to become one of the daily starbucks customers. Honestly, I expected a lot better customer service for such a busy and well known coffee shop, early on a Wednesday morning. I was too afraid to ask for the manager because it might've been her. She has very blonde hair and small glasses.. watch out!", "author": "Elaina L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-04-04", "description": "The line is always way too long & even at 11pm every single seat & table is taken by someone with a laptop. I'd rather go the the Walgreens next door for a snack, then walk back home.", "author": "Melisser E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-18", "description": "Ummmm, YES.  I LOVE this Starbucks!  Lots of comfy seating - perfect for doing reportcards the day before they're due, or grabbing an iced latte on the way home from partying.  AND, its 6 blocks from my house.  *w00t*", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-16", "description": "The biggest starbucks in town that I've been.  They have extensive seating options (with a ton of plugs to handle your laptop) and a Clover machine to make you a fresh brewed cup (at a premium price of course).", "author": "Sheetal S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "Was here tonight and the barista asked me if I wanted whipped cream on top of my hot chocolate instead of putting it on there like they always do.", "author": "Darius A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-10", "description": "This starbucks stands out from others because it's 24 hours. I know some of the people who work there and the environment is really friendly. Nothing better than a VBF and a book to read while sitting on the couch.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-28", "description": "If I didn't HATE the Starbucks Corporation with a heated passion - I would have given this place 5 stars. Normally - I wouldn't be caught dead ordering a Venti Non-fat Decaf Peppermint White Mocha Frappacino with No Whip. Any coffee drink with more than one or two verbs isn't really coffee now...is it? Really...I'm a Philz Iced Coffee kinda guy. Or Blue Bottle. Something simple of quality. Don't go here for the drinks (at least I wouldn't). Go here cause it's open 24 Hours! If you're a Grad Student - this is as cool a study area as you'll get at 2:00 AM. Seriously, if Hastings, Golden Gate and USF had a common ground - this Starbucks would be it. I'm not a student (my friend was), but I came with a good book and an open mind - and honestly, I really enjoyed myself. Sure beat sitting at home watching the latest Nip/Tuck and reruns of South Park. I still hate the Starbucks Corporation - but you'll probably find me back here after normal business hours. I'll be the guy with an Iced Egg Nog Latte in the corner ducking behind my guilt and shame ;-) No really though...I do like Egg Nog Latte's...\n\nEDIT: Okay - this is the first review I've edited (just adding this portion and taking off one star). I've since been back to  this location. I took a star off because I think they play their music too loud, and in the 2 hours I was sitting there I heard \"Chestnuts roasting on an open fire\" probably 4 times. It's the holidays - I get it. Play something else. And hey - let's face it. My 2 star review of Starbucks ain't gonna hurt their bottom line.", "author": "Eli S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-20", "description": "So it's the closest Starbucks to my place, and the added bonus is that it's always open.  However, being that I'm a student and want to do some work here, I can NEVER get a place to sit unless it's at 4AM.  WTF?!  The cashiers/baristas are pretty nice considering they have to deal with the people who come here...\n\nThe only added bonus is that there are lots of students/good looking hospital folk who come here.  I just wish I could get a place to sit.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "This is a very solid Starbucks - funny that it is the only late night spot in all of Laurel/Presidio Heights! I'm a big fan of the expanded seating, though I'd say this is not the best spot if you want to sit and gab with a friend vs. get some work done. It has a very \"serious\" vibe about it, with lots of students and self-employed types bent over laptops. Service is always very fast and friendly - do not fear the long lines!", "author": "Kiesha R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-26", "description": "One of the friendlier, less corporate-feeling Starbucks in this world.  I especially like the plethora of seating options close to the window for people-watching and boyfriend-waiting-for.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-15", "description": "Five stars for being open 24 hours and for bringing back the Cinnamon Dolce Latte! The staff also makes a killer Blacked Iced Tea (Sweetened)! Yum.....", "author": "La C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "Generally Starbucks coffee is not my favorite brand of coffee, however I do appreciate the Limited Offer Coffee at the Laurel Village Starbucks. This offering at the Laurel Village 24 hour Starbucks is worthy of calling vintage coffee and the price for a tall which is equivalent to about 8-10 ounces of coffee is very reasonable considering the quality of that limited offer special blend.  I tried the Ethopian and it was delightful!\n\nI like the fact that this coffee location is a 24 hour site and that the neighborhood is central to many medical facilities.  The scones are scrumptious especially the vanilla and maple scones.\n\nI happened to notice that this Starbucks also offers a breakfast sandwich and coffee, which I think is a good idea at a coffee site.  They also have items for lunch and for snacks too.  \n\nI would like them to expand the number of microwave cups that they sell so that the customers who want microwave cups in large sizes will have more of a visual selection of ceramics to choose from. Last time I was in there I purchased the large brown Starbuck Mug with the company name on it.\n\nThe seating in this coffee location is really great, you can spread out or choose to be by yourself. There are also areas of seating where you can converse with others if you so choose.\n\nGenerally the barristas are efficient; The lines though large at certain key times of the day, move fairly rapidly.\n\nThe site is clean, and seems to be well managed.", "author": "Dee C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-03", "description": "Laurel Village Starbucks FOR THE WIN~! because it's close to my house and close to all the other close-by shops which i adore so much. but screw the parking when i can't find any!!!!!!!!!!!!!!! or have to walk really far!", "author": "Tina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-30", "description": "Seriously, why do you mess up my order EVERY TIME and then look at me like I should just take the messed-up drink and move on? Who manages this store for god's sake?", "author": "Beth T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-06-21", "description": "THIS Starbucks was completely unredeemable for a long while. I once asked for a coconut frappucino (RIP) and the cashier said, \"Excuse me, but we haven't been making those for 6 months!!!\" I was really sad and thought his behavior ABSOLUTELY UNCALLED FOR. I had him as a cashier another time too, and he is always in a bad mood. Recently, I went to this Starbucks and my friends ordered this chocolate drink. Well, a man was going around giving out free samples of the same size. For that, I give this place another star.", "author": "O K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "comes here a lot. great study spot. open 24 hours. line could get pretty long depending time of day. seating could get pretty crowded also.", "author": "Hector W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-23", "description": "is open 24/7 but dirty and homeless people asleep in the cafe :(", "author": "matt p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-21", "description": "I love this location!  The furniture, the space, the staff...and let's not forget the fact that it's open 24 hours!  Yeay!", "author": "Frangelo A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-08", "description": "24 hour starbucks - what more can you ask for... \n\nyou can find students studying late night here or people just on their laptop in the middle of the night.  This neighborhood is clean and neat.  I was surprised when this starbucks became 24 hours - thought the neighborhood would object to it. \n\nI used to work on that strip of store and starbucks never failed me.  I've never had problems with the workers here tho there is usually a line when it's a holiday - but i m pretty sure there are other starbucks that gets packed during holidays.", "author": "Kapo T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-12", "description": "24 hours! I was thrilled to come here and study. It was a break from the library. It was pretty busy when I got here but managed to find a perfect corner spot to study. Everyone working was super friendly.", "author": "Jasleen K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-10", "description": "OH GAWD Strabucks I love and hate this place. 24 hours that's great so when you need a caffeine fix at 4 am when your up studying for finals it's  a good place but it will be something if you find someplace to sit. They place the music way too loud in here do they not have consideration. Young people like to hang out and smoke outside while drinking their drinks. And police officers come here for their caffeine fix. This starbuck has its own culture. Ehh", "author": "Kristina S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-12", "description": "This is the WORST Starbucks I have ever been too. I'm a starbucks addict and go everyday, but I will go out of my way to avoid this one. The first day I went I was the third person in line, but I waited more than 15 minutes for a Chai tea latte. The baristas were too busy talking too make the drinks. I went back a second day and the line was out the door. I finally got to order but I had to wait 15 minutes for my chai tea again. One of the Baristas was instruct 2 others on how to do something, apparently unaware that they were extremely busy. When I finally did get my tea it was made with nonfat milk, which I didn't order. I left it on the bar and walked out. In over ten years of going to starbucks I have never walked out and left my drink. I usual have a good experience with starbucks baristas - they usually pay attention to the customers and give great service. Not at Laurel Heights Starbucks.", "author": "Puja S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "I am generally not a fan of Starbucks.  But, after some exhaustive yelping I discovered that it's one of the few coffee joints in SF that's open the hours I need with decent seating and parking.  So, with much skepticism, I gave it a onceover.  And guess what?  It's great!  Lots of tables and parking, a great mix of people, and a friendly staff to top it off (even after midnight when most people would be falling out of love with the barista lifestyle).  The girl working the register on my second visit actually remembered my name from the night before.  Compared to Palo Alto, where the barista wrote \"Annie\" on my cup without a second thought, this place is a miracle.", "author": "Andrew N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-18", "description": "This Starbucks is one of the best run businesses I have ever seen.  I told them so when people from Seattle were in the store.  The fact that many of their baristas have been there 3, 4 or even more years says it all.  Not to mention my coffee tastes the same every day.", "author": "B T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-17", "description": "Is the Devil. I drink my coffee black. And they have awful coffee and drive out local business as fast a wal-mart. Boo.", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "really great popel so nice and friendly", "author": "Ebony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-03", "description": "Open 24hrs a day. Crowded at times. But hey, where else are you going to get some Starbucks coffee in the wee hours of the night!", "author": "Vance L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-25", "description": "I had this pleasure to work at this store as a \"borrowed partner\" whenever they needed my help in the mornings/noons. My main store was another 24/7 Starbucks located in SoMa on 9th St @ Howard St.\nEffectively on 12/24 I am not a Starbucks employee any longer.\n\nI wanted to thank all the partners I worked with, and all them customers I served. Definitely fruitful 2 years of my life, not to mention very first job I got after moving to USA.\n\nMay all of you be healthy, happy and may all your dreams and plans to come true in New Year 2009 !\n\nThank you so much,\nthe blue-eyed Tomek aka Tommy the Polish Guy.", "author": "TOMEK W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-02", "description": "A 24 hour Starbucks is always welcome for a random night that needs to be filled by caffeine. My only gripe is the lack of seating - but isn't that the problem with most coffeehouses? Always chock full of students, this one's pretty standard issue, but remains a favorite pit stop.", "author": "Wally N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-19", "description": "This Starbucks is okay.....just too many people and not enough space to accommodate everyone!  Sometimes they burn the coffee and it tastes bitter, then I have to ask for a new brew....ugghhh, I hate burnt coffee first thing in the morning!   They need to get new furniture because those lounge chairs are looking really worn out.  At least it's open late and I can go there for a late night fix!", "author": "Daria i."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-22", "description": "I used to go to this Starbucks 3 or 4 times a week to get some work done. There's a lot of seating and plenty of outlets. I also liked that a nice mix of regulars, hospital employees, police officers, locals, and students frequented the place. The last 5 times I've gone, though, the place is PACKED with students only. They've made it their study hall away from school. There's never a seat to be found. They often take up 2 seats because they need a seat for their backpack. I've even watched them bring their own food and drinks and never even order a $2 tea. Or they save seats for friends who don't show up for an hour, while people wander around looking for a place to sit. Lately I walk through, see no seats open, and leave without buying anything. And I've been looking for a new place to frequent because I just don't like the crowd there anymore. What a shame the Peet's just down the strip doesn't stay open later. :(", "author": "Corrine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-25", "description": "as the only 24 hr starbucks, this place is a great place for me to get my work done.  lots of tables, and lots of competition to get those tables.  so be hungry like a vulture, snag a seat, and hold onto it for dear life.  now get your work done.", "author": "Dan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-22", "description": "Opens 24 hours, what else can I ask for more..... Parking during the day is bad. Other than that, two thumbs up for the staff at 3595 California.", "author": "Jimmy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-16", "description": "Nice to have a 24 hour Starbucks near by, but there is never a seat available here whenever I go.", "author": "Roger R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-21", "description": "i go to starbucks once ina while especially when im on my lunch.. (usually only a few ppl in line cause its usually busy) so i was there on my lunch one sunny day. only two ppl in line and whom which one of the co workers knew chit chat for awhile finally i was up next for my order. cashier proceed to glance over at  me a few times and turned around to clean....what the heck???? seriously i was the only one in line... i stood there for a more mins and left... cant believe i got ignored... unaccpectable... disappointed", "author": "Stephanie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-26", "description": "They do not offer decaf coffee after 12pm. Are they insane!! Your only option is to have them individually brew a cup of decaf for more money. No more Starbucks for me. Peet's is only a short walk.", "author": "Doug H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-31", "description": "Usually, I wouldn't want to support a chain, but this particular Starbucks is outstanding. The comfortable chairs, and Carmen Lundy music really sets the mood. Order something extravagant with a pseudo-name, and you will be pleasantly suprised. Look for the cute barista with candy cane striped socks, and one rolled up pant leg. Beware of the one with blonde hair, tatoos, and black rimmed glasses, he may look cute but really he is a grumpy mini-frap server that interrogates you for laughing at the funny banana flavored mini-fraps. He hates his job, and you, in turn hate him.", "author": "Bethany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-04", "description": "WOW! nicest and biggest starbucks i've ever seen! they're decor isn't cookie-cutter starbucks either. different art on the walls, cute faux bois pendants, orchids, and wayyy more seating than at a normal starbucks. but you definitely know you're in laurel heights when you see all the babies and yoga-pant-wearing milfs.", "author": "N. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-14", "description": "24 hours? i am down with the establishment is all i have to say about this starbucks.", "author": "Terry S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-05", "description": "5 stars... i used to work here 5 years ago.  it wasnt open 24 hours and they didnt have them ovens.. but the staff there was always fun in the 2 yeras that i worked there.  some of the locals can be downright assholes... so if you crack a smile to the staff, they'll be super nice to you.", "author": "Doug .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "this Starbucks is big and roomy and is opened late.. their customer service is excellent compare to the other Starbucks I went to..I usually go with a small group of friends to get hot chocolate and sit down to chat for awhile.. very relaxing atmosphere...", "author": "Lily T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-17", "description": "First off I am a big Starbucks fan.  I like great coffee and for the most part Starbucks delivers the quintessential American Coffee experience as well as the lifestyle that is sold to the customer.  That is fine with me.  I am not a coffee snob and for what they do they have a good product....for the most part.  There is a reason they are on every street corner.  This Starbucks in particular is what you would expect in this neighborhood...busy...crowded...and full of rich people and their children.  Fine with me, what else do you expect from a Starbucks in Laurel Heights, 24 hour Starbucks nonetheless.  The only problem I have with the Starbucks corporation is the inconsistency in drink making.  You never really know if you are going to get a good drink or not when you go in.  Made correctly you get a good product, but that probability is 50/50.  Most of the time their blended drinks aren't blended enough and for the coffee drinks you get a lot of burnt milk, for that I give it 3 stars.", "author": "matt g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-11", "description": "This is the best starbizzle around cause it's open 24/7.  If you were supposed to do something all day but didn't come here and work until you hate your life.  I must warn you this place may be run by the yakuza b/c I see a lot of them in here.  The breakfast sandwiches taste like the box a frozen pizza comes in.  Sometimes they play decent music which is scary or my taste sucks.", "author": "Dirk C."}
