{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "A convenient, spacious spot that provides a great working environment. For a Starbucks, this place exceeds my expectations.\n\nThe first thing you notice about this Starbucks is the layout. The building has a wide entrance door and a very long interior. The inside has almost a \"hallway\" feel - it occupies more square feet than most Starbucks I've been to in the city. They often have some good hip-hop, R&B, and 80s pop music playing in the background. I was very happy to hear Stevie Wonder and Kool and the Gang being played here.\n\nThe couch is very comfortable to sit on and work for hours. I've never found seating to be a problem here. Besides the music, background noise leans towards the quiet. I haven't ordered anything custom here, but I had no issues with the drinks I have ordered. One star subtracted for outlets that don't work. 4/5.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-16", "description": "Nice staff, but cleaning up the cream and sugar area evidently is not a priority. Quite dirty, haven't seen this at other Starbucks. \n\nWas at this store for over an hour and this area remained untouched by the team here.", "author": "M E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-26", "description": "This rating is only for the reliability of Starbucks being a place to order a drink and charge your phone or work on your computer. There are NO outlets here, in the entire coffee shop. I repeat- this is not your standard Starbucks! I am not a Starbucks coffee drinker-- I go there for the reliability of what it offers consistently nationwide--decent espresso drinks, cake pops, reliable internet and a place to charge my electronics. \n\nThe barista was nice in explaining it, but I'm new to this side of town and would have gotten in my car and driven across town instead of walking all the way here to work. For now, I'll work until the power runs out ‍! I get that these are \"champagne problems,\" but Starbucks has made a niche space for them in this world--you get consistency and generally know what you're walking into! \n\nKudos to a nice guy explaining it!", "author": "Shelley V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "I went up to order a caramel frappe I asked for extra caramel like I always do at any other starbucks but when I asked I saw the person making my drink I asked him if I can have more than what he pit because what he put wasn't extra and then said ok I watched him as he did so he still didn't put extra caramel but I didn't want to complain and ruin his day like was a annoying customer plus I had to be back at work on time so I just said ok and went about my day my frapp was not very good to me because it wasn't how I unusually like it", "author": "Dameyon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Thanks to the barista who recommended Majesty- citrus jade mints non caffeinated cousin to me. Tastes just the same.  Too bad there's only one bag left. Had to mix it with emperors cloud. Aa a matter of fact most of their teas are out of stock. Really Starbucks?", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-02", "description": "I remember being interviewed here one night back in 2012 by a guy with a bad back. He hurt himself skateboarding. I didn't get the job! \nBack in the the 2000s, while attending SFSU as a Journalism Major, I remember you had to enter a 3-digit number to enter the bathroom. I was reporting on the Inner Sunset at the time. I rarely come in here nowadays!", "author": "Julio B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "+ Location is convenient (for me)\n+ Spacious, and plenty of seating every time I've come\n+ Outlets spread out \n+++ THEY HAVE NITRO COLD BREW\n- They got my nitro cold brew order wrong\n- The door is always left open\n\nIf you couldn't tell yet, I'm in love in Starbucks' nitro cold brew and the adorable cold brew lid (aka adult sippy cup lid) that it comes with. I think it's super weird when there are signs for new-ish drinks that list a single price and I assume it comes in one size, but then they ask me what size. It's just a me thing. My drink today came with \"light soy\" for some reason, but I didn't bother asking them to redo it because it's cold with the door open so I'll just get a free tea refill when I'm done. Also, I was offered a normal lid for my nitro cold brew. HOW WOULD I ENJOY THE BUBBLES WITH THAT? To sum it up, it's a standard Starbucks that has the drink  I like, but it's kind of whatever otherwise.\n\nTheir speakers also malfunctioned while I was here and some guy shouted \"that didn't happen\" so that kind of cheered me up.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "Today the bathroom code is 90210 - Horrific experience:  I drove over an hour and a half in traffic after working in Palo Alto and after parking, I had 15 extra minutes to get to my chiropractor's appointment (YAY!!), where there's a very convenient restroom for me. But rather than doing that, I remembered there's a Starbucks where I could replenish a pound of coffee I need to get anyway.\n\nSo I get there, and look for someone to ask to use the restroom. The employee stocking an area behind the cash wrap is way too busy to respond to me saying, \"excuse me\" and the barista wearing warriors gear rudely tells me once I purchase something, they'll stamp the code on the back of the receipt for me. I wouldn't be asking before I ordered if I didn't need the code urgently - I asked for the code because I needed to stop the pee dance so I could be a customer. Even after pleading with the guy, he said no. \n\nI bought a banana, to them being snide but church-like in their politeness. I rsaw the code on the receipt and went to the restroom and didn't even take my receipt and banana, because like I said I AM A CUSTOMER IN URGENT NEED OF THE RESTROOM.  While I waited to get my banana from the cash wrap, the cashier sweetly asked the guy making a purchase if he'd like the code to the restroom stamped on the back of his receipt ( like it's an extra perk ) to which I told him the code and upon leaving, I mentioned the code to the whole store. \n\nThe barista who refused to allow me to be a customer by preventing a positive experience said pretty rudely, \"alright, BYE!!\" as I left. Apparently this new policy is gonna continue to be a problem for this location.\n\nFor any Beverly Hills 90210 fans, the next business coming to this spot may as well be called the peach pit.", "author": "Rocky S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-17", "description": "One star for the very rude guy running the register this evening,Friday, Aug 17. I ordered a latte and then asked for the restroom code and he would not give me the code. It was 7:45 pm and he said the restroom was being cleaned. I asked if I could use the restroom after it was cleaned and he said \"no\". I said \"I can't use your restroom?\" and he said \"No, we are closing in 15 minutes.\"  I wonder if he is racist or just a jerk. Taller guy wearing the gray knit cap, glasses, beard.", "author": "Allie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-21", "description": "No wonder this is a 2.5 stars Starbucks.   Mobile ordered dragonfruit mango infusion.   Misplaced my order.  When I follow up, very unfriendly staff saying mobile has to wait.  I told her I have been waiting for 10 mins and I asked if the one on the workbench is mine?   She said no.   Then once she walked away, I asked another staff to check what's the name on that red drink, then actual it has my name on it.  WT.............!", "author": "Hirsk H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I've lived in this city for years and find this location to be one of my favorites. Baristas are genuinely friendly, restrooms are actually clean and they always get my drink right. It can be difficult to find seating at times, but if a cafe is by a college and has free WiFi...I mean, what did you expect?\n\nAnd so many people get butt hurt about their bathroom policy. You purchase something you get the code, because restrooms are for customers, no? Naysayers try to turn it into an ethical issue, when really they just don't like being told \"no\". Stop the whining and accept that you don't get to have whatever you want. It amazes me how privileged some people are. And, what cafe in San Francisco doesn't have a code/key these days?\n\nI hate to see such nice workers belittled and mistreated by people that have such a misguided sense of entitlement. Please don't abuse these baristas just because they work for a large corporation that you think you can gain something from.", "author": "Alexis H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "We checked the store hours for this starbucks before walking over to get a drink last Saturday. When we got there 15 minutes before closing time, the doors were already locked. Update your store hours or stay open until your posted hours on your official starbucks website! Waste of time! The employees didn't seem to care to answer my question and just ignored us knocking on the door. \n \nOh, and on a different occasion we had to plug in our laptop while we were at this location. The outlets near us don't work, and some were even covered up. \n\nThe customer service here is inconsistent. Mixed with some employees who care to give you customer service and others that definitely should not be in a customer service oriented position.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "Quick take:\n\nThe place is always crowded with people who don't buy much coffee but steal WiFi,so seating is hard to come by.\nThe service is quick,friendly and polite. Efficiency isn't the problem though. The problem is two fold;If you are getting something other than a mocha or a specialty drink,the coffee is bland. Go elsewhere!\nThe second problem is that the bathrooms are always filthy. I've seen truck stop bathrooms that are cleaner. I'll go to one of the neighboring coffeehouses instead.", "author": "Zardu H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-27", "description": "I use to live 3 blocks away long before this Starbucks ever existed.  The neighborhood has evolved over the decades and has become a dining destination with the plethora of restaurants within blocks of each other.  This is the only Starbucks around until you hit 19th/Irving Streets.  I like it because it's spacious and has a wide walking aisle.  You don't feel crowded during peak times.  \nI don't like the incidental homeless person who harasses you if you sit at their outside metal tables.  The staff turnover seems high.  I seldom see the same folks working here. Not a huge amount of SB merchandise to choose from but I did see the usual San Francisco and California mugs.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "This place sucks tbh my favorite coffee shop closed so I had to come here it was messy and a bad working environment. If you want a comfy coffee shop to work go to Snowbird's coffee its the best!!!", "author": "Coco B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "This Happens to be one of my favorite Starbucks. This location is spacious to where you can sit and not worry about somebody standing over you  because the line is right by your table. This location also has to outside seating which is nice because who wants to sit inside on a beautiful day. Their restrooms are always are nice and you have to get the passcode from the Barista. The Barista are usually friendly when I come in and they make sure to repeat the order back to you just in case they misheard you. \n\nIt's on a busy street so parking is always rare. But the J train drops you off right in front. There are stores and other restaurants around the startbucks, so grab your order and casual stroll down the street.", "author": "Monee C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "RESTROOM!!!\ncome every now and then on this location cause it's around my neighborhood. Today I decided to walk cause I needed to get something near by but I end up needing to do use a restroom to tinckle and so I walked in and ask if I can use the restroom. Lady told me the code should be on your receipt. I replied that I haven't buy anything yet then she said you'll get the code after you buy. She said it was part of their POLICY!!!!! Woooooowwww!!!!\nHow PATHETIC this PLACE Starbucks HAd become. \nWhat is costumer service if you are not going to serve. \nI sometimes walk around the city and I literally smell urine see poop everywhere and is this what our world have become... preferred to see poop and step on poop or smell urine on the street because places like this won't let people use their restroom!!! Starbucks YOU USE TO BE BETTER THAN THIS!!! It's just making me think that your employees are too lazy to clean or you Starbucks have just simply become PATHETIC!!! Great customer service! Just AMAZINGly SUCks!!!! Your new name should be starSUCKS!!! Suits you best", "author": "Lulane P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "I get that maybe around 5PM it might be low peak time and you're kind of in an end of the day slump but it shouldn't be difficult to differentiate between a grande cup and a tall cup, especially since you don't have a rush of orders to get through. When they remade the drink to switch it to a grande, the employees seemed disgruntled and made us feel as if our drink may have been tampered with or something. Also, this location needs to standardize using names with each order or its difficult to know which order belongs to whom. I'm glad this isn't a Starbucks I visit often.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "Went in for a quick coffee stop. Never again. Store manager was extremely rude. I hope she has a bad day filled with rude humans like her.", "author": "Majid A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "PLEASEEE bring back working outlets. I'm begging you. I would stay longer and buy more if outlets worked! \n\nOther than that the staff is always great, lots of spaces to sit, clean bathrooms. I also appreciate how the staff are always gracious to the homeless people who frequent the location.", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-22", "description": "I love this Starbucks because of the friendly staff - genuinely kind and personable people. \n\nI would give 5 stars overall, but Starbucks recently removed all of the outlets! I'm guessing this was to prevent people from camping out all day without making further purchases, but sure makes it tough to want to come here at all when I need to do work for 30 minutes over a cup of coffee. \n\nIn short, good for grabbing a cup to go but I'll be hitting up other neighborhood coffee spots for when I need to plug in and enter grades.", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-16", "description": "Both bathrooms out of order!!! Are you kidding me?\nDrink coffee and cant use bathroom?! Because someone has painted and wrote profanity in the bathroom ! I undressed it has to be cleaned but i think i would rather see something offensive than driving 20 minutes in the city to find a bathroom!!!!", "author": "Ali N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "Yo. What's with cutting power to some of the outlets and blocking the rest? I don't know if thats  store policy, but it's kind of a turn off.  \n\ncoffee was good, service was professional, seating and space were ample, but the lack of a functioning outlets felt very unwelcoming. #whereisthelove? #illstillbuyyourcoffee", "author": "Alice P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-27", "description": "More reminders of this being an impossibly expensive city with a changing climate. Stay away Moms of children who aren't perfect. If you don't mind being judged by the staff that gossips, or accused of being a thief by young baristas that are annoyed by children being children, go here(keep in mind I know they will lie), but pettiness and passive aggressiveness ruled the roost. LAST Week I went here while waiting for my child in an activity. I purchased a soy chai latte, and 2 hot cocoas for my children and chatted outside w/two less fortunate men, one was an AF Vet, told them I would be back after picking up my daughter. I left, picked up my child and gave each man $5. I have children with a Vet, so I understand they endure a lot. TODAY I went there again today and stood at the register, the barista never saw me and so I went to use the restroom, but I returned to the table when a gentleman asked me to watch his bag, I obliged. I happened to see the Tai, the AF Vet from last week who walked by, looking spiffy and say Hello and he sits down next to me where I was watching another customer's bag. A Latino man sweeping up with a tattoo on his neck, walks past and says to us in a tone more annoyed than helpful:  \"Can I help any of you with a minimum purchase?\", and mumbles to another customer that my son had taken a chocolate milk(he is 2, and it was below the table, I hadn't realized this)-it was vanilla, but I go and pay for the milk. A few minutes later, he had grabbed an apple juice(again it was under the table and we were seated close to the counter nowhere near the door, I hadn't realized this), he wasn't being loud or pulling breakables off shelves, and there was no line so, he was nobody he was getting underfoot of( I know how busy children  can be).  So the employee who had never bothered to greet me in any welcoming way or tone, then says to me:  \"Are you going to purchase that?\" What is the implication? I hadn't realized he grabbed an apple juice and he wasn't being loud, was he implying I would willfully commit theft?\" We were sitting down nowhere near the door(It is a long store), and I had already made a purchase. That sounds like a line a shopowner might use if he or she saw an unpurchased item in a person's pocket about to exit. Is this how Starbuck's trains its employees to speak to people? \"You better hurry up and buy something or get out?' Minimum purchase? Is this an elite nightclub? Then I went to speak to the manager-Chas, a young, pretty fair skinned black lady. She gave me an insincere apology by not only back peddling, but by defending his position when she had not even bothered to consult him. If you weren't there at that moment, how can you defend it? She said: \"You have to understand our position-the baby was walking back and forth\", is a child not allowed to walk back and forth? What was very clear is that she was so comfortable in what she was saying, and lacking in any sort of embarrassment or surprise, that it is clear they had already discussed what they thought of me. He was annoyed I returned the apple juice to the shelf, and I believe my son had detached the straw but I certainly wasn't going to give them more money after that remark. Chas also said to me that they would say the same thing to anybody else, well I hadn't brought that up, so that tells me, they wouldn't treat anybody else the same way. I am a mixed race woman, a minority just like them. I didn't have on designer clothes and I was wearing tennis shoes. I spoke to two undesirables in front of them. A beanie-wearing teen who got up to order, and the Vet, while looking clean, looked weathered in his face, as if he had fallen on hard times. So, she brought it up, not me, they would treat others differently. I know people will look at this and judge as they did, that control-your-child attitude but they could have handled it differently. I have worked many customer service jobs and in the food industry as well. I always received good comment cards. He could have said: \"Ma'am, are you aware your son, has a juice?\" \"Would you like me to ring that up for you?\" Why do that when you have been emboldened by your gossiping and judgemental co-workers. I have been to a lot of Starbucks lately with the cold weather and have received good treatment. Not here though. What was worse than the man saying what he did, was that a supervisor would back him up and tell me to understand their position, so thanks Chas you are ok with your co-worker accusing me of thievery. Can't wait until you someday have a child walk back and forth somewhere and people roll their eyes behind your back. This Starbucks is about 4 blocks from the biggest playground in SF, steer clear.  I guess all is well as long as these two don't work with children and their third co-worker who has leaning over and talking to her as I walked away and it was clear(although they will deny it, we all know how that works), Mean Girls, isn't just a movie. Last visit.", "author": "Mi C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-26", "description": "After visiting the park, ordered a few drinks here and tried to charge my phone but they Don't even have any socket! All the socket are not working. The worst thing is the Asian man was rude!", "author": "Amy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-28", "description": "Some dumb ass employees at this location. I ordered an iced coconut milk mocha macchiato and the employee charged me extra for coconut milk. I told her my drink specifically comes made with coconut milk and asked why I'm being charged extra but she insisted on charging me extra anyway and said that the drink is only seasonal even though you can still order it all season long. I later realized that I could've simply ordered and paid the correct amount through the app itself instead of dealing with a complete moron that they hired. They only get an extra star instead 1 star rating bc one of the employees there is cool and actually knows what he's doing. I'll be back to prove that moron wrong eventually...", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-10", "description": "Starbucks recently came out with a berry sangria tea, which one of my clients bought me at work in Mill Valley. When I took my first sip, I was so surprised at how refreshing and flavorful the drink was, as I normally order coffee or frappuccinos. The sangria (non-alcoholic of course) was the perfect blend of sweet and tangy, and had fresh blackberries and orange slices in it.\n\nI was so in love with this new (and healthier alternative to fraps!) drink that I wanted to get it again that weekend, at the Inner Sunset location. I wanted my friend to try it as well, as I had been raving about it all week. We ordered a VENTI to share, and once I took my first sip, I was so disappointed in how bland and watered down it tasted (no orange slices either). This was NOT the refreshing drink I had wanted, and nicely asked the barista to please remake it. I could tell they were a bit taken back, but they honored my request and remade the drink. Second time around, it was still super bland, tasted the same as the first time, and so I just left. I eventually went home and added apple juice to it to enhance the flavor... \n\nOverall, super disappointed. I'm basing my review on a single visit, yes, but chains like Starbucks should have consistent taste and quality every time! It shouldn't matter which location I go to, I expect my drinks to taste the same. That was definitely not worth the ~$5...\n\nI'm giving 2 stars since they attempted to remake the drink. Thanks, but no thanks.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Not sure why the reviews for this Starbucks is so low...\nAre you in San Francisco and surrounded by a plethora of amazing mom & pop coffee shops that could arguably have better quality coffee? Yes. Is this a pretty great Starbucks? Also yes!\nThis store was clean, and had a very open and inviting sitting area. I have a lot of requests with my drink (I'm looking at you, my fellow low sugar & coconut milk fans), and my barista was super kind and patient. I also have to say, they made one of my favorite Starbucks drinks I've had in a few months! Not totally sure why this one tasted so much better than my recent trips, but I'm in love. So in love that I'll probably get off my bus again to make a stop here and then just catch the next N that comes by. #WorthIt", "author": "Sophia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-17", "description": "Since the remodeling it has gotten better, but the service hasn't.  The place isn't very clean either with sticky tables and floors.  They have all the amenities that other Starbucks locations have but not enough seats and super slow internet.  Because of this I find it hard to even try to start doing work here, let alone trying to find a table that someone isn't already camped on for the day.\n\nIf I'm specifically craving a Starbucks drink I will come here, otherwise I'll usually go to another coffee shop on the block.", "author": "Pia V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-21", "description": "I've come to this Starbucks multiple times, usually get typical service. This time they decided to give me 2/3rd of my drink, that I've ordered from this location (and many other locations without a problem) before. The cashier, Zoe, decided to give me my drink like this. I didn't say anything immediately as I was confused and shocked that they gave me my drink like this. I went back to another barista for them to just top it off and she said \"we aren't allowed to.\" Please show me where?\n1. I am allowed to customize my drink with \"no ice.\"  \n2. Venti size is clearly advertised as 24 ounces, I did NOT get 24 ounces. \n3. \" Our Barista Promise-Love your beverage or let us know. We'll always make it right.\" \nDisgusting service, did absolutely nothing to try and satisfy the costumer. \nI had to drive to the nearest starbucks for them to fix my drink..\n\nAlso want to add that the second barista I went to was not wearing a name tag. Talk about going by the \"rules.\"", "author": "Sergio J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Y'all are the kindest Starbucks employees! Thank you for the bougee dopio espresso and chai! Keep being you. Love, yessica.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "They just remodeled this Starbucks with tons of outlets and individuals workspaces.  It's one of the nicer Starbucks in the city for sure, I just wish they were open till midnight.", "author": "Arman J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "This is definitely one of my favorite Starbucks Coffee shops in the city.\n\nHere are some of the reasons:\n- Clean facility\n- Friendly staff members\n- Efficient services\n- Seats available inside and out\n- Spacious path between the seating area and order counters\n\nI came in between 11 am - 12 pm today and it wasn't super crowded, being able to immediately get a seat is also a good thing.\n\nSome of the items I ordered were:\n- Kettle Potato Chips\n- Venti Vanilla Latte (Iced)\n\nI am definitely coming here for a pastry and a cup of coffee when I am nearby.\n\nUCSF (University of California, San Francisco) Parnassus Campus is not too far from here.\n\nParking: street metered spots*\n*Coins or Parking Meter Debit Cards highly recommended\n\nMUNI Routes\n- N Judah\n- 44 O'Shaughnessy", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-10", "description": "Disgusting washrooms. Then the blond girl goes to 'clean' the washroom after I use it. Comes out of cleaning washroom says to the girl making my drinks 'do something to their drinks'  for one your nasty coming from cleaning a washroom to behind the counter. For 2... we know what you were doing. Fair warning for anyone else trying to get a beverage. They might give ya an extra 'swirl' if they feel like it.", "author": "Rachele V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-19", "description": "I absolutely love this Starbucks.\n\nSo far all the employees have been great! The service is always quick and cheery. At 6 in the morning you never know what kind of employee you're going to run into. I can say that every morning I've come in everyone here is bright and cheery, what a way to start the day!\n\nAll the drinks, excellent, of course.\n\nA little pricey, but it's Starbucks.\n\nClean shop and sometimes there are homeless people outside, but that's a given in SF.", "author": "Elysia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "All starbucks are good and if it comes with a friendly staff, its definitely a 5 star", "author": "Vishal K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-16", "description": "Coming to this Starbucks is a treat. It's clean, the staff are friendly, and every couple of months they revamp the inside. \nIf you want tasty drinks and a place to hang your hat while you work or visit with friends, then this is the place for you.", "author": "Nessa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-24", "description": "I love this store!!! Great last stop before I go home from picking up my daughter from school. I remember that guy screaming and acting like a pretentious queen. Complaining about the bathroom. I'm glad this store regulates the bathroom password. It clearly states outside the restrooms, \"customers only\".  I mean, there are hobos and people that shoot up I. These restrooms. I'm glad they enforce the rules. And for the banana eating rocky s.... well, let me just say. You have the ugliest o face eating that banana.. I can say more about it I'm sure you waking up everyday looking In the mirror is punishment enough. Keep it up sbux!!", "author": "Peter N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "All staff are warm and friendly! Only took them a week to learn my name and custom drink order! My favorite location to go to because I feel right at home :)", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-25", "description": "Good thing about this Starbucks on Irving and 7th Ave: they open at 4.30am on weekdays! Okay, 99% of Yelpers won't care but there ARE nights when I can't sleep and I rather get up early.  Like, super early. And I need to run on caffeine. \n\n4.30am Starbucks to the rescue! Additionally, the folks sleeping on the side walk give this Starbucks a nice Tenderloin feel to it. \n\nCan't complain about the baristas attitude like the Yelpers below - it was 4.30am and I think it's too early to have an attitude.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "#datenight - we were in the Avenues for an art show and decided that was no reason not to treat ourselves to some Green Tea frappuccino goodness. From the time we stood in line, we could tell this might be a less than enjoyable experience. The cashier was distracted and even though there were two other workers on duty, he rang us and eventually made our drinks, all with a whatever feel. I felt like he was already gone. I don't need sparkling wit, but a lack of personality is a bit much even at the end of the day. It's the end of his night but the beginning of ours.", "author": "Thomas T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-13", "description": "Almost crashed my car getting here since I was so nervous about meeting my date, which, when I stepped into this place, I regretted picking.\n\nThere are homeless men sitting everywhere, and they don't even have beverages. One was even asleep on the table.\n\nWhen she arrived, she looked stunning, and I felt like such a tool for picking this less than classy place.\n\nI got her drink order, a cappuccino ( and a latte for me) and I almost spilled the drinks on her as some homeless guy ran out of the bathroom with a bag.\n\nOverall, the location is creepy, but the drinks are okay.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-15", "description": "Context: Today, Sunday Afternoon.\n\nLocation: On Irving, an easy walk if you live in the Inner Sunset. Or just take the N, if you don't feel like walking.\n\nWait: This Starbucks is strangely busy! All the tables are full and there's been a line the entire time I was working here. **\n\nService: The guy at the register is nice. But, the management needs some improvement. They ran out of wooden stirrers. Also they offer no straws at the service station where they should be, with all the creamer and sugar are. It was frustrating. No straws or stirrers what kind of coffee shop is this?! WIFI is free, but its buggy. *\n\nAmbiance: They have some nice outdoor seating that offers both shade and sun. Its nice because its not just tables next to the side walk, they have railing that separates that space from the sidewalk so its not completely open. Sidenote, the tables on the inside are poorly lit and so close to the bathroom, you can smell it. Yuck. There's so much space in here, but I think its poorly utilized. They have two lounge chairs in the front where two or three tables easily be placed. It gets a more and more cramped, the farther in you go. There are outlets, but I only saw three outlets in the back and three in the front. Six sets of outlets for a Starbucks this big is a little lacking in my opinion. At least put out a power surge! ***\n\nDrinks: I got green tea and my friend can ice vanilla coffee. Its a standard Starbucks. I go here because I know there will be a restroom, tables, outlets, and as a Gold Card Member I get free refills. **1/2\n\nRestroom: Two separate unisex bathrooms. Messy. Another testament to poor management. Paper towels all over the floor and no toilet seat covers. Luckily, there was AT LEAST toilet paper and soap. **\n\nTo be honest, there are SO MANY GOOD COFFEE PLACES in Inner Sunset alone.  Why go to Starbucks if you're just drinking coffee and reading a book? Be adventurous and try DRIP'D or Martha's or Golden Bear or Flywheel. But, we all come to Starbucks because we know what to expect, no surprises. We know what franchises offer: known standardized services, which is why we get stuck coming here...\n\nSo heed my advice, if you're don't need to hardcore study or work, but are in a relaxed mood go to another local coffee shoppe. Support your local businesses! Don't feed the huge commercial beast known as Starbucks. Try something new, you may be delightfully surprised and then write a Yelp review, so the rest of us can try it too!\n\n\nAverage: ~2 stars. Mediocre.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "My least favorite Starbucks by far. This morning, the cashier had a horrible cough and was coughing without covering his mouth....right near the cups. It took close to 15 minutes to get one tea and one Americano because the 4 people behind the counter where screwing around having fun the entire time (note...there were no drinks ahead of mine). Totally no one in charge and no one managing the counter. Only one carafe of whole milk to use. Dirty area where the milk and sugar was. Would give it zero stars if I could today. The service sucked!", "author": "K M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "After spending almost four hours at the deYoung, I had to head home. However, I was feeling tired and needed an extra jolt to make it home. So, in-between transfers from MUNI bus to LRV, I need coffee, coffee, coffee. Lucky for moi, I had my resuable Startbucks mug ($1.00; every reuse gets a ten-cent discount) and ordered a small coffee. Good for Starbucks!\n\nIt has been awhile since I was at this branch, so oh my, where is the milk and cream? Arrgh! I asked one of the barristas who was kind enough to point out that it was right behind me. Whew! And much to my delight, there was a full jug of half and half. I needed a few moments to feel awake as well as use the wi-fi to check in at this Starbucks before heading home to ma mere and La Dolcita (who was going to give me heck upon my return home). \n\nFresh Review #18 of 100 Yelps! for 2013.", "author": "Chiara A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-18", "description": "I was there at 9:30am on a Saturday and there wasn't much of a line. Employees were efficient and friendly. I ordered my usual dark roast drip but this Starbucks seems to charge a bit more. Maybe cause they've recently gotten a facelift?", "author": "Liz N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "(My roommate's story from today that I'm posting on her behalf.)\nWay to ruin my day before I've even had my coffee. You know how Starbucks coffee is hotter than the earth's core? Plus they don't pre-sleeve the coffee anymore, which is fine. I carried my coffee from the counter to my table, then lifted from the top to add a sleeve. Turns out the barista didn't put the top on right, so coffee ended up all over myself, the table, and my phone. While I'm flustered and in a complete mess, trying to clean up myself and my stuff, the table is still dripping with coffee.\n\nAnother nice customer had to ask the staff to help and clean the table (napkins can only do so much). After 5 minutes someone finally came over to mop up the table and never asked if I was alright or if I needed another drink, nor even made eye contact with me. I had to say something, so I told her I spilled because the top wasn't put on right and I asked if I could have a new drink. She seemed pretty annoyed with me, but said \"Uhh... Ok... What did you have again?\"\n\nI told her my drink order again so she could go told the barista. The barista started on 3 new drinks before making mine again, so there was definitely no rush to help me out when I'm just ready to get out of there at this point. The entire ordeal made me feel like I did something wrong and I was being punished, when it's the customer service that's lacking in this place. From ensuring drinks are delivered safe and non-booby-trapped, to helping guests who are struggling to clean up a mess, then to the attitude in general when dealing with situations like this.\n\nGet it together Starbucks at 9th & Irving!\n\n-Roommate", "author": "Nic E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-12", "description": "I have never received bad service or attitude from Starbucks employees, this is the first time. This girl of name Alex has for sure an attitude problem, she was probably having a bad day but come on, it's barely 9 in the morning. So disappointed, I know I should've gone to Peet's.", "author": "Sergio L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Since calling Customer Service after having problems here, Starbucks Staff have been more friendly, polite, curteous, and inviting.\n\nThis is my neighbourhood Starbucks, take it or leave it, & I would rather enjoy my experience here as I sit in the Lobby having Pumpkin Spice Latte's, Cafe Mistos, & Milky Teas whilst reading gossip magazines & playing on my mobile phone. \n\nThis Starbucks has a very feminine presence that I love! And all of the Ladies that work here are Lovely. I do have a few favourite baristas!", "author": "Julian I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "Just your usual Starbucks fare - which for me is usually iced or hot tea. This location seems a little on the busier side because of it's location.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "This place just got a new makeover and I'm digging it.\n\nThe space is redesigned to allow for a longer line and a less crowded pick up area. \n\nFor those who like to work here, more outlets have been made available but unfortunately the current internet situation could be better. Hopefully this will change soon as they used to have better wifi.", "author": "Alice H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-01", "description": "I haven't really been back since my first review in January despite living around the corner. Well, I stopped in this morning.\n\nThere were a few people sitting, a few people waiting for drinks, and a few people ordering. Seems like decent business is happening here. The wifi here is a bit spotty, keep having to reconnect which is terribly annoying. \n\nI got a mocha this morning, and it was overly sweet, not hot, and not mixed well. Meh. When I ordered, I asked for a small mocha no whip. She repeated it back as a tall no mocha. At first I was like uh, I guess? \n\nSeating is plentiful. Not much else to say. They got my friend's name completely wrong. She used her credit card and her name is on the credit card. The name was fairly off. I mean I would understand more if they did something like Kelsey to Chelsea, but not John to Scott. \n\nThere wasn't much interaction and usually the cashiers are very energetic and friendly. This one smiled but didn't seem too enthusiastic to be up and working at 9am. The energy from people in the wee hours in the morning can transfer over to customers. Drink some coffee and wake up please.", "author": "Kaje Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "I love this location i live 5 blocks way  ...customer service is amazing all the employees are wonderful  i been going to this location for 6 years  ...sam...cj...Clayton...carmen..nicko...brian..\nRobbie...Annie...love all of them you guys are awesome", "author": "Sabreen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-17", "description": "I like this place. Yes it's always busy but I've never seen it crowded. This location has a good variety of seating including several outside options which are prime for people watching.  The vibe is chill. Great for studying or working.", "author": "Lynsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "Yeah I don't know why this Starbucks has gotten such low ratings in the past. I was a bit hesitant before going for this first time based on the reviews I read here. Ultimately though my experience was perfectly fine and enjoyable. I was studying and there were plenty of other people studying/reading/etc but still a good number of open tables. I'm not normally in this neighborhood so I probably won't be back anytime soon but if I lived nearby I'd keep going there for sure. No complaints at all!", "author": "Bjorn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-08", "description": "Considering that this is blocks from Golden Gate Park and UCSF, it always manages to have seats open. \n\nOn the down side, worst internet EVER. I've been coming here since 2011 and you guessed it, I always end up using the Yancy's Saloon wi-fi (really cool bar next door) or come in to read books.\n\nIn other words: don't come here unless internet is optional to get any work done. There is Yancy's, Mellow Mellow, or La Boulange with amp space and good working wi-fi.", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Just got the teavana iced passion tango. Tasted like soap and when I told cashier they didn't seem to care. Wasn't that busy. In general customer service is decent, nothing exceptional. This is just an overall bad experience. Also, skip sitting outside smells of piss and trash. I usually like Starbucks experience, but this one will leave a bad taste in your mouth.", "author": "Rebekah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "Alright place to stop for some work or quick coffee.", "author": "Corie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "The baristas who work here are really quite friendly, however they're sadly also incredibly slow. They enjoy chatting with each other, taking their time with your order, washing the dishes while your drink sits in the blender.\n\nThey're just not a treat and street sort of establishment.\n\nWhich isn't a bad thing, because my drink was always done well... it's just something to be prepared for if you're in somewhat of a hurry, on your break, etc.\n\nAlso on the plus side is this locale has a ton of seating, so you'll never hurt for a chair...", "author": "Meg T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-10", "description": "Probably one my least favorite Starbucks. Immediately after walking in I was hit with a wall of coffee smell, so strong, I felt that I didn't need to order a caffeinated beverage to help wake me up. \n\nPart of the coffeeshop experience for me is to be able to have a place to work and that usually includes having access to reliable wifi. I couldn't get a connection at this particular location, so I had to take my leave.", "author": "Kim C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-23", "description": "Great Starbucks! The staff is always friendly and patient when I don't know what I'm gonna choose. Time by time,  homeless come in and just stay in restrooms for a long time which is kind of annoying.", "author": "Lino M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-06", "description": "I've noticed a downturn in the rating for this location starting March 2011.  This seems to coincide with the last manager leaving the store.  Interesting.  Starbucks needs to get their act together and keep good people and not pressure them out and replace them with robotic brainwashed corporate types.  Oh, wait... that sounds like Starbucks! \nI've got an idea, stop going to Starbucks and go support your local coffee shop.", "author": "Carlton M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Always a friendly staff!  They seem to be working hard to make it fast for you even though lines can get long.  Very busy location due to the Park next door. I love the Clover coffee that they have.  Way better than the iced coffee.", "author": "Jacob W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-10", "description": "This is your standard Starbucks chain. There is outdoor seating and its right, literally right, by the train stop. So you can hear the trains super loudly. Other than that its got the standard starbucks fare. But its a nice place to stop by if you are in the area and looking for a coffee place or just to sit down for a while.", "author": "Sofya T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-14", "description": "I am not really a fan of Starbucks, but how can you avoid it. It has such an interesting menu. The Beanery is actually really boring and lacks many items that Starbucks has, such as caramel apple cider. I chose this Starbucks over the Beanery because of that.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-01", "description": "The drinks range from average to bad. But the one-star review is for the management that could care less about its customers.\n\nI put my stuff down on a table, went to get my drink, and came back to find a chair had been placed on top of my table. Then I looked over and saw a man recording my reaction with his iPhone. The lady next to me told me his friend had put the chair there.\n\nHe can play whatever pranks and rearrange the furniture however he wants for all I care, but I don't need some creep with a recording of me on his phone. Of course, he and his friend very unconvincingly denied doing anything so I talked to one of the baristas. He seemed concerned and asked me to tell his manager, who didn't give a damn and continued making drinks. I'm not expecting you to tackle the guy, but if someone's harassing one of your customers in your business, maybe you could pretend to care.", "author": "Kaylin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-27", "description": "Pluses: this location is larger than many Stbuxes and is located near the Inner Sunset/7th Avenue corridor. The staff is friendly; they don't just go through the motions like some other places but actually chat up with customers.\n\nGranted there are some customers in-their-own-world, and others of the non-odorific hanging about too. The main issues are the lack of seats (could have better furniture layout as there's a big gap running the length of the store) and the lack of parking...well, unless you go on a Sunday night. And for such a busy part of the City, the closing time of 10pm bites. I stop in only if I really have to.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-05", "description": "I was really displeased with the way they handled \"the line.\" I walked in with my family and the only other patrons at the queue were a nice couple. I saw that there were two registers being attended so I stepped to the available register. The woman at the counter instead of asking, \"how may I help you?\" or \"welcome to Starbucks\" she rudely pointed at me for me to \"go to the end of the line.\" I thought this was rude but I thought that she must not have been standing at an operating till. I walked to the line entrance only for her to call me back to the register with a \"may I help the next guest please.\" She seemed completely deranged. The staff here was completely detached from what a positive service experience should be. The Valencia cooler was good.", "author": "A P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "Samir and the rest of the May 2nd Barista gang need a lesson in COMMUNICATION, MATURITY AND LIFE.\nStarbucks like these keep the negative hipster barista stigma alive.\nI had been sitting at the table outside with someone for 30 minutes and walked inside with my big computer in hand and asked nicely if I could use the restroom. Samir said no, literally no. I nicely said, really, I though you guys give restroom codes. He said no again. Would not budge, would not bother to ask if I was going to order something. \nWho wants to bring their coffee to the bathroom with them?? I asked him why he wouldn't allow me, when literally 30 minutes before they had given me the (unique) bathroom code without contesting me (and there was no line then by the way). \nI asked him why he didn't bother to ask if I was going to stay-I clearly had a computer with me. I said you have no idea how much money I might have given Starbucks today. The rest of the ignorant baristas walked over (a red hair guy, Asian guy and hispanic - sorry but I have no other description) and essentially ganged up on me. I walked out and I swear I will never go to a Starbucks again. \nOh and I walked back in to ask their names where they were laughing and talking about me. TALK ABOUT IMMATURITY.  Yeah, I will DEFINITELY do everything in my power to avoid Starbucks and warn anyone who I work with that I will NEVER EVER meet them in a Sh*tbucks again. What a horrid company culture.", "author": "Shelby Nameless S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "It's kind of out of my way, but I love visiting this Starbucks. Unlike some other locations, I've never had a bad drink here and it's typically very clean and customer oriented. It's usually pretty busy but they're usually pretty quick here. Everybody is really friendly, but  Brandon, Samir, Rachel and Carmen are my favorites. I come here mostly for the warm and welcoming attitudes of the friendly baristas working here.", "author": "Tyler R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "this is one of my favorites to go to. the staff are awesome and they are so fast even with a line. this review is for Carmen though. she kills in in there, always had a smile and even though I know it's because I go in there so much, she always knows my name and order and that's a special employee right there!", "author": "B G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Great customer service! Though my drink came out really slow and there wasn't even that many customers waiting for drinks. The barista was great on the afternoon that I came. My green tea frap was nicely blended, ie no huge ice chunks in my drink! There are a nice set of tables and chairs if you want to sit in and the mood inside is nice. A great escape from the business of Irving.\n\nA", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-31", "description": "I have no problem with this Starbucks at all. I don't understand the low reviews. The service is friendly, and they serve everything that other Starbucks do without giant price spikes for the area (unlike anything downtown). There's also really nice outdoor seating for those rare sunny Inner Sunset days.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-19", "description": "Worst customer service I had ever experienced at a SB. They did not even read the coupon that has worked at 4 other Starbucks in the city. \n\n\"Please note: Clip and Follow is not offering a coupon - We are advising of the current promotion from Starbucks for a FREE Hazelnut or Caramel Macchiato at participating locations. Ask your Barista for the Coupon or Ring as Discount Code 350.\"\n\nThey asked me to print it out.........no other Starbucks asked me to print anything. Just to give them the code. What was worse, was when he asked his manager to come out to tell me the same thing. She said that other Starbucks were breaking the rules by giving me the free coffee without a printout. So I went down the street to Dash Cafe and bought myself a cup of better service.", "author": "kim w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-25", "description": "Nice remodeling job , but they might as well receive another bad review. Just went with my family for some drinks, including my 1 yr old daughter. She stood still in the middle of the new open space near the entrance with a good 3-5 ft radius around her in all directions. (NOT directly in front of the door) Not loud or causing any trouble. Not in anyone's way. One of the young \"baristas\" called out for us to \"move out of the way\" with an annoyed look on her face and a wave of her hand. I was offended as there was no need for it. I would be more concerned about someone possibly spilling hot coffee on my daughter than you. Don't worry, I will be moving her out of the way and out of the store, never to return.", "author": "Verna L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "This location is really unkept on multiple visits it's been dirty. Also not a fan of the awkward seating.", "author": "Josie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "My favorite SB! Love the people here. Wifi seems faster than the other stores. Baristas know what they're doing and consistent. Close to a lot of muni lines.", "author": "Mike R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-11", "description": "Ok...now we've all been here. But this Starbucks is absolutely the sloooooowest one I've ever been to. They operate on a glacial pace, at best, and I don't know why! Great hours and great place to sit, but the music is loud, they don't clean up often, and oh, did I mention they are sloooow?", "author": "Kevin F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-10", "description": "Attitude check! What is wrong with their baristas?! My co worker and I came in to buy drinks, she ordered a green tea latte which had CHUNKS of green powder in it. DO YOU NOT KNOW HOW TO MIX A DRINK?! When she drank it, a blob of the powder got in her mouth.. Gross. She asked the barista to make it over again, and she answers \"That's how it's made\" with an attitude. No B, we've ordered this many times before and it's never looked or tasted like that. My co worker argued that it wasn't tasteful and if she can just make another one, the bitchy barista then answered\n\"What do you want me to do?\"\nCo worker: \"well I would like it more homogenized, it's really powdery\"\nBarista: \"well that's how it's made, so what would you like me to do? I can't use the shaker because it has soy\"\nWhat happened to the \"barista promise\"?! Really...? You can't even use a spoon to mix it up? She was rude. I on the other hand ordered a caramel frapp, with extra caramel, I was charged extra for the caramel, but guess what? No extra caramel. No wonder this Starbucks location has low ratings. Poor customer service. Won't be back. You guys suck.", "author": "Pauline E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "I like this place, its large, clean and fairly relaxed... they have some good baristas but a few that are plain obnoxious. .. loud talking, throwing things.... I don't wanna hang out in a frat house. I wanna do my work and drink my coffee.... current Barista needs to go work out, take a xanax, or somehow chill the hell out. I hate when Baristas are hyper, over friendly and sarcastic to guests, talk loud,and treat the store as if it's a bros hangout.  ... that means you bearded one.... chill out so I can read my book.", "author": "Emo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-27", "description": "In general kinda lame. I do come here in emergency situations and need a crappy, bitter cup of coffee.\n\nThe staff here is really nice and does a great job but they have such an inferior product that no matter how perfect they are, and they are, this joint sill sucks.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-16", "description": "I have worked at Starbucks for three years. I know the biz.\n\nBut this place needs a serious makeover. I can honestly say that every single time I've been here, which is every so often on my way to work at Golden Gate Park, they forget to make my food order. I order it first and say it slowly, but for some reason, the five or so who are working just cannot seem to understand the concept of putting a sandwich into the oven when ordered. This place is not busy at all. There's really no excuse for this much neglect. When a customer is standing by your counter by the oven, don't look over and ignore them, and then wait a few minutes to ask if they need anything. If you have time to stock the pastry case, you have time to make a damn sandwich. \n\nOther than that, the friendliness of the workers never seems to be an issue. I just wish they'd pick up the pace, speed is very important at a cafe, especially in the morning!", "author": "Tayler P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-15", "description": "Great location, love the area facing out for people-watching. Good amount of seating. Most of the staff I've encountered has been lovely.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "Nothing to rave about. It's a Starbucks. Barista Sofia should be sent home if she is going to be scowling the whole time.", "author": "Jun Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-04", "description": "Said it once, and I'll say it again. \n\nThis place sucks. \n\nSomeone (that probably works there) named Jeremy G decided to be a smart ass with me over Yelp.\n\nI also forgot to mention that he said they probably spit in my drink. I'm guessing that's something that they do.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-05", "description": "This is a rather spacious location, though I wouldn't say the space is used quite as well, or made to be as warm/cozy, as it could be. But my visits here have always been in the evening when it's not busy and it must come in handy in the morning with the crowds and all that jazz. The two comfy, leather chairs in the corner by the door must be the money-spots, you get the most amount of privacy of any seats in the house and you get a clear view of that peculiar televisual radio and of the sparkly, stylish baristas. \n\nThere's a fair number of outlets throughout for all you mobile computers, and the placement of the toppings/milk/other additions bar is central enough to be out of the way for those enjoying a good sit/sip. There's pretty much a straight line from the entrance to the bathroom too, so you can bee-line it to the potty in times of emergency, whether it's before the coffee or afterward. And the location itself is right along the N-line. \n\nI'm not entirely keen on Starbucks coffee so I'm an unfit judge, but the service here is great. Between myself and other patrons whose interactions I've eavesdropped on, these guys got the whole bit down. There doesn't seem to be a large population of regulars here ever, but the baristas do their best to make everyone feel at home, which is what makes me feel okay with coming to a coffee shop whose coffee I don't drink.", "author": "Jake m."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-26", "description": "My Spicy Chai Latte had a very milky taste that I didn't like. A good place to sit down with some coffee and work.", "author": "Hari B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-03", "description": "Pretty difficult to find a table to sit down at, let alone an outlet to plug a phone or computer in. Came on a Saturday so I guess I should have known better. Would not suggest this location for getting work done. Great for the \"grab and go\" coffee though if your in the neighborhood.", "author": "Riley C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-19", "description": "This particular location is on my way to work. With a 3 person line, it took 7 min to make my iced soy mocha. Why? Because the staff here never stop gossiping amongst themselves. It's shocking. I don't want to know what you think of your manager, and work is probably not the best place to have that particular discussion. Also, the spot where your coffee is deposited is always covered in liquids, meaning my straw was instantly useless as the barista dropped it in a circular puddle of someone's drink. If the shop was busy, I would understand; however, they weren't.\n\n1) Stop gossiping \n2) Clean up", "author": "Chris G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "Open early\n\nA little scuzzy because there are many homeless people there.  You can't leave your stuff on a table while you go to the bathroom or it can get taken--kind of a pain to pack up laptop when you're studying but hey, thats San Francisco.  If you think about it, it's kind of nice that a giant corporation like Starbucks lets homeless people come and go, use the bathroom etc.  Rare and kind of heart-warming don't you think?\n \nTables are usually full and you have to share with strangers\n\nService is great.  Very friendly. Reliable internet.", "author": "Meg M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-27", "description": "across the street from tart to tart if you absolutely hate it. I hate finding parking here. but it's consistently a starbucks =) =)", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "Usually good but when they aren't brewing decaf and you order one they will ask if you want an Americano and charge you extra. Pretty lame and inconsistent. Some baristas will do the right thing and charge you for the coffee you wanted.", "author": "Joseph W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-12", "description": "One of the female workers was extremely rude..saw me watching her take forever making my drink and started saying she dislikes people watching her make the drinks...well if you do..then don't freakin apply to work at Starbucks! she also spat out my name in distaste..pretty sure she made my drink wrong...just aughh awful customer service..totally needs to improve on her attitude", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "update: the barista (maybe) sent me a message on here, explaining the protocol that delays someone who is on a cleaning task from attending to the next customer in line. the effort is appreciated.\n\n\nnormally don't write about places like starbucks, but there was this one time i was here and barista 1 was sweeping behind the counter. he hella kept going while i stood there for a hot minute. then finally barista 2 showed up, who finally took my order. i appreciate that they keep the shop clean, but i think they also shouldn't just let customers obviously just stand and wait.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-12", "description": "Dear Starbucks on Irving, \n\nwhy do YOU keep disappointing me with your drinks? WHY oh WHY? how hard is it to make my non fat sugar free vanilla latte? is it really that hard? you can NEVER make it right. its either too bitter or there ISN'T any taste at all. i don't know why i keep coming back, i think its because of the location. i like the fact you are located right on Irving which is near my house but today was the last straw.\n\nit was a HOT day in San Francisco. while driving back to the city from Oakland, i was craving for a Iced vanilla latte after a hard day of work. a NICE COLD REFRESHING LATTE but nooooo, you DISAPPOINTED ME once again. \n\n*waiting for drink*\n\nserver: non fat sugar free vanilla latte\n\n( *i approach to get my drink* )\n( *to my surprise, my latte was white?!! )\n\nme: umm...is this really a vanilla latte?\nserver: YES (without smiling)\nme: umm...isn't it suppose to be brown?\nserver: no, that's the vanilla latte\nme: are YOU sure?\nserver: wait, let me see -- ooh yea.\n\nINSTEAD of making me a NEW one, she decided to pour the coffee in the cup and handed me back the drink WITHOUT MIXING THE SYRUP TOGETHER! \n\nfirst of all, you DON'T know how to make a latte and then you want me to MIX IT?!! i don't mind mixing the syrup and the milk by myself BUT at least say \"SORRY\" or make me a BRAND NEW one because its not going to be good if you just pour the syrup into the cup.\n\nneedless to say, my iced vanilla latte wasn't good at all. i couldn't even really taste the coffee and the coffee was too light. *sigh* \n\nNEVER AGAIN!\n\n2 stars = clean environment \nno stars = bad customer service besides making the drinks BUT none of the workers seem to smile when working behind the counter. \n\n*shaking fist*\n\nSincerely,\n\nGirl who drank a white coffee latte", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "Vanilla latte and a cheese danish! YUMMY! Can't go wrong with that. :)\n\nI love most starbucks locations... because majority of their drinks are the same quality and so on. \n\nThe only thing I don't like about this location is the parking! Irving is such a busy street, especially in this neighborhood. When I'm itching for coffee and I can't find parking...OH THATS NO GOOD.", "author": "Jo L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "Friendly barista crew. Knowledgable and remembers customer's drinks.\nHomelss visitors create a challenge for restroom cleanliness at times. Hats off to the barista crew for managing this as well as they do.\n\nBig location, decent musical selections, routine regulars who seem friendly. Drinks are good and served quickly. Food is generally fresh. Good service.", "author": "Christopher C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-07", "description": "I'm a huge Starbucks fan...but I loathe this location.  The people who work there are generally okay...except for one girl who works there who is loud, bawdy, and obnoxious!  She yells at customers, cracks inappropriate jokes with me that make me want to smack her, and disrupts the peace.\n\nI also find that this location is usually full up, so you can't get a table...and half the tables are taken by bums who've wandered over from the park.  Not that they don't deserve to sit at a table, but often they aren't even drinking any coffee and are taking up an additional chair with their gigantic, filthy backpacks.\n\nBut worst of all, this location has offended me in a way that is extremely rare for any restaurant or coffee shop:  it smells in there!  I don't know what the deal is, maybe they burn a lot of items, forget to empty the trash, or never shower, but there's usually a strong, nasty odor in there of some sort.  I can't for the life of me figure out why.  And while I admit to having sensitive olfactory nerves, even my husband, who rarely smells anything notices the stench and complains.  Needless to say, when we're in this neighborhood and need coffee desperately, we rush in, get our drinks, and promptly leave, so as to avoid the horrible smells, crowded atmosphere, and noise pollution from the barrista!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-18", "description": "Ok service...could have been more friendly. But the drink was up to Starbucks standards so I'm happy. There is a nice patio area outside to sit in if it is not freezing outside.", "author": "Victoria Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "Love baristas at my neighborhood store. They are fast, friendly  and personal. Place is always packed with locals reading and drinking coffee. Pay attention to sale shelf - you could find a great bargain!", "author": "Victor B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-08", "description": "I complained to Starbucks (Howard Schultz, President and Chief Executive Officer) about the rude manager at 744 Irving / 9th Avenue, who refused to ring up separate transactions and allow me to get separate stars.  I was informed by Starbucks Customer Relations that the \"stars policy\" is discretionary per store.  \n\nSo the upshot is: boycott this store since you cannot get separate stars.  Maybe once sales plummet, the manager will be replaced.", "author": "Lou Ann B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-02", "description": "Starbucks is usually a hit or miss, sometimes my coffee is perfection and sometimes it gives me the GURGLES and makes me curse the BARISTA that effed up my drink. I am happy to say today they didn't do the latter which my stomach as well as the porcelain god appreciates. \n\nThe coffee places I frequent are usually pretty empty by around 7pm but since this location is so close by UCSF you will often find students studying here (shout out to Tim B. and Betty W.) as well as locals who come to have a cup of joe and mooch off the WiFi.  As we got in line waiting to order the friendly barista offered the guest before me and I a free cup of coffee? SAY WHAT? a huge corporation such as Starbucks that overcharges for everything was offering FREE COFFEE! I couldn't resist and accepted his kind gesture and mind you it wasn't a Tall but a nice sized Grande. SCORE!\n\nSince I wasn't in the mood for just their Pike Roast, I handed this off to Matt L. and ordered a Peppermint Mocha Non-Fat with a smudge of whip. PERFECTION! My stomach thanks you today.", "author": "Myron J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-22", "description": "I've never been told to wait in line for water and ice. Especially when the drink \"girl\" was not doing much. Forgot her name but she was about 4ft 5 with red streaks in her hair and she was Asian. I simply said the tank of water was out and she said you need to stand in line. I explained I was already in line with the other 15 people. And of course there was one cashier. This is unacceptable and she was very rude", "author": "Edward S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-24", "description": "It's hard to hate a place that sustained me when I worked at a lab at UCSF and is within walking distance of my boyfriend's apartment.  It's got tables, places to study, and typical Starbucks treats and coffee.  I actually like it better than the Beanery, so if you're in the area, you might as well come here.  The people working at this location range from friendly to freaky, though.\n\nOh, and I also made tiramisu using their espresso and it turned out awesome.  So that's gotta count for something, right?", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "I come to this location a lot in the late evenings, right before they close. The baristas who work the closing shift are really friendly. There is a young lady there who always remembers my drink and my name and I find that very sweet. I can't speak for the morning rush since I don't come here in the AM but the service at night is efficient. There is a patio outside and many more seating inside. This is a low key Starbucks in an affluent neighborhood. The only real complaint I may have is their pastries run very low at night and usually there is nothing left, but then again its not their fault.", "author": "Apple F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-09", "description": "The cashiers are rude. My cashier picked a fight with me about my re-fill receipt. As a gold card member I understand the process, but this location seems to treat regular customers as if they are a bother than loyal.", "author": "William R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-19", "description": "Seriously?  Are you really serious?? \n\n6.20 am on a Sunday morning, and you're frickin' closed?  The sign on the door says you guys open at 6 am.  6.20 am, and dude is inside taking out the garbage and \"signing\" to Melly Mel (with his arms folded into an \"X\", not telling her, but \"signing.\"  WTF.) that they're closed.  \n\nC'mon bro.  Your job ain't that hard.  You make coffee, clean the bathrooms, and take out the garbage.  If you need to take out the garbage before you open up, maybe you should come in earlier - like at 5.45 am because remember???  YOU OPEN AT 6 AM!!!", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-18", "description": "Holy fuck, I don't know what the fuck his name is, but he's a fucking asshole. The tall white guy with curly hair and some goatee going on. I been coming here lately and I always have him as my cashier. But his bitchass really ain't giving no respect to his customers. Starbucks, please fire this guy. Send him back for another week of training or something cause nobody wants a rude worker.", "author": "Emily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-16", "description": "The first time I came here and had a bad experience was a year or two ago. I asked the cashier to reload my card with 5 dollars and gave her a 20. I ordered and left shortly. I returned again because I felt like I was missing something. Turns out, I was missing my 15 dollars change. I didn't ask for it back; however, because there was no proof that they didn't give me my change. The cashier just didn't give me a receipt. \n\nThe second time.. was a little better. The cashier just forgot to give me my cake.", "author": "Danielle Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-19", "description": "Terrible Sbux. Baristas are loud and obnoxious. Not very attentive. Dirty. \"JEREMY! I JUST WANT TO STICK MY FACE IN THE TRASH\" say one barista, ugh this place is a joke.", "author": "Mario M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-27", "description": "This does not taste like Starbucks coffee and the bathrooms smell like an animal stall.", "author": "David D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-17", "description": "Big turn off when I'm sitting here studying and all I hear is yelling coming from the back of the kitchen from staff. If you need to sing (off key) that bad, go work at a karaoke bar. It's rude to be loudly chatting with each other while your still working and patrons are here utilizing your facility. Not professional, I don't need to know about how you guys want to go party.", "author": "Serina H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-05", "description": "Thursday at 2:30pm the place is PACKED!! The space felt cramped and not enough electrical plugs. Also crazy people and loud talkers at this starbucks. Oh my mocha was not even hot.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-09", "description": "I just want to say... i wish it opened past 10. half of ucsf would greatly appreciate! \n\ni like to watch that one asian homeless lady who uses it is a resting point sometimes. as a dental student i approve that she uses their bathroom to brush her teeth ... but as a customer I am little disturbed. ;)", "author": "Tim B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-30", "description": "This has got to be one of the most unique coffee establishments in the country, wait, possibly the world, no universe! Oh right, it's just my local neighborhood Starbucks. Lately the vagrants have taken a liking to this place I've noticed. I go here when I end up here sometimes because it's later than the local independently owned places. This is not the best Starbucks by any stretch of the imagination. As others have noted, it does seems like it's gone down hill from about a year ago.", "author": "Ken L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-14", "description": "This Starbucks location is SLOW!!! The morning crew is incredibly slow. They need to stop gossiping with each other and focus on their customer service and speed and efficiency. I order a simple grande latte and the quickest I have gotten out of there in the past few months is almost 15 minutes. Isn't Starbucks supposed to be the fast food of coffee? There is nothing fast bout them! \n\nI sure hope that the manager of the store or corporate reads this because something needs to be done ASAP.", "author": "T T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-25", "description": "I only frequent this location if my regular spot is closed or crowded. It can be very busy here and the service is less than.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-10", "description": "If you live in the Inner Sunset, you know that most of this neighborhood shuts down not long after dinner -- if you're looking for nightlife, there's sports bars, Irish pubs, Tart to Tart, Crepevine, Donut World, and this Starbuck's. If you want an unobtrusive place to read or just get out of the apartment at night, with free wifi, this outpost almost serves as a beacon of hope.\n\nIt's clean and tidy, although the bathroom may not be the cleanest. The baristas are friendly and remember regular customers' drink preferences. They recently remodeled the place -- according to one barista, people complained about the lack of open tables. So the middle part of the wall is one long bench with a half a dozen small tables for one or two people each, in cozy quarters. And there are larger tables in the front and back.\n\nI actually think the redesign has caused *more* crowding, since more people have starting coming in now that they know there's more space. I actually have to wait for a table longer than I did before the remodel. And now that the internet is free, it can be a little slow, especially if you're trying to get some work done.\n\nStill, the lack of other good options and the general reliability of Starbuck's chains makes this a much-needed coffeehouse in the 'hood.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-05", "description": "The wife and I always travel here after eating at our favorite indian restaurant (Naan & Curry), they are always spot on with our orders, and are a nice spot to relax before we continue our day.", "author": "Timothy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "The staff at this Starbucks makes you wonder if you have wronged them somehow in your previous life. My first visit to this and the staff were absolutely rude when asked about the restrooms. They are horrible at their job. Makes you feel like why Starbucks!", "author": "Nithin B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-22", "description": "This is by far the worst Starbucks I have ever been to in my life. If I could've given zero stars I would have. I live nearby and have been enough times to say that this review isn't just based on one, or two, or even ten experiences. In a nutshell, no matter when I go in, it always seems under staffed, dirty, and the staff that is there seems tired, unenthusiastic, under showered, under trained, and like they would rather be anywhere on the planet but there. I've worked in a coffee shop before, and in retail my entire adult life. I know that it can be stressful, and maybe not your life's passion, but I also know that it's not rocket science, and that if you can't figure out how to spell my four letter name correctly and clearly, then you've got big problems. I also know that if you think your job is that awful, there will always be someone else willing to take your place, who might actually understand the value of having a job. I can't believe that the store manager, or district manager of this store, whoever they are, have let this store become the inefficiently run embarrassment of a dump that it is. I would think that if you are part of a huge corporation who seems to pride themselves on great service and quality products, that you would be more on par with some of the other locations, that are in fact amazing. The Chestnut street location in the Marina is pretty much perfect any day, any time, and no matter who is working. They are friendly, and fast, and it is obvious that their regular customers, of which there are many, genuinely enjoy going there. Maybe the people in charge of the Irving location could learn something from them. Or, they could just keep having customers roll their eyes at the baristas, while they wait 20 minutes for a latte will most likely have espresso grounds floating around in the bottom.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-25", "description": "I asked \"everything bagel\", she gave me wrong one. I couldn't believe someone doesn't know how \"everything bagel\" look like??? Or if you are not sure, just don't bake it without asking customer. I even didn't complain, it's gonna be waste of my time.", "author": "Micky F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-25", "description": "I like Starbucks, but this one just doesn't do it for me.  It's so far off from Starbucks' original mission and everything that made them so successful; meanwhile,  it exemplifies everything the SBUX-haters love to talk about: it's too corporate, anonymous, thanks for your money, hardly any service at all.\n\nMy Mom wanted to buy the French Roast, but they didn't have it so we bought some other one, then they didn't offer us the free coffee you're supposed to get when you buy beans.  They DID have a wide variety of mugs and cookies and other crap that has nothing to do with coffee (minus one more star for that).\n\nYet the location is so convenient that I find myself going here anyway.  Please get better.", "author": "Jin D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-08", "description": "Ghetto Starbucks in my block.\ngonna get shot by a glock\nwhere is jenny from the block.\ngoing to the restroom i see a sock.\n\nI'm not a fan. I used to be but now it's too trend. I am peet's man.\n\nSometimes I might come, but I can NEVER find anywhere to sit and read. The music is too loud. The people there are weirdos. \nAnd worst of all, you have to pay for Internet. \n\nOne more thing, they are never any cute girls around.", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-23", "description": "Watch out for the people who go into the bathroom with a backpack. Expect to wait in line for at least 5 minutes, with at least 3 other people waiting to use the bathroom, while the person with the backpack is probably doing every hygienic ritual short of an actual shower.\n\nDon't know what's up with the wi-fi, couldn't connect to either AT&T or T-Mobile...or mooch off Yancy's Saloon's wi-fi for that matter.", "author": "Janel Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-28", "description": "Worst customer service among all Starbucks. I love Starbucks but hate the terrible service that I got today. I was waiting by the counter to order but the two employees just kept chatting with each other while ignoring me for a while. After I ordered I was waiting by the coffee machine for the food and drink to be ready. They put the food on the farthest side of the counter, without telling me until I asked them later. It was already cold. Am I supposed to look around the whole shop to find my food? I pay Starbucks for the service, not the coffee. I was also surprised how unfriendly they were. Wish the store manager can fire those people and hire better quality ones (or provide a better training).", "author": "alex e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-13", "description": "There's a reason I always order my lattes extra hot from here - because if I don't, I get it at room temperature.\n\nThere's a reason I always order an extra shot in my drinks too - because if I don't, I'm just drinking brown water.\n\nThe last time I went in, the bitter old queen behind the counter was about as social as a gnat.  He really shouldn't be working there - or he should take a Midol!  \n\nAnd an observation:  why is it that 80% of the seats are taken up by homeless people?  Crazy homeless people...I mean, homeless peeps gotta get their Java on too, but when they sit there for half a day nursing the same cup o' joe, it' s time to ask them to move.\n\nOh how I wish there was a Peet's...", "author": "Christy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-21", "description": "It's a Starbucks.  What else do you need to know?\n\nOut of place here in the Sunset.  It's been here ten years so I finally take a look and think to myself WHAT ARE YOU, CRAZY?  YOU'RE A BLOCK AWAY FROM FOUR OF THE BEST CAFES IN TOWN AND YOU GO TO STARBUCKS???\n\nWell yes, technically they are crazy here.  Word is out among park bums, free shower in the Starbucks bathroom.  Ewwwww.\n\nI would be crazy too if I had to listen to Neil Young all day.  I love his music but after the 57th time in 4 hours Old Man Take a Look at Yourself gets kind of...old.\n\nWifi here has been on the fritz.  And no comfy seats.  Which defeats the only purpose of coming to Starbucks.  It's right next to the Muni stop so away I go....to another Starbucks where the chairs are plush and T-Mobile works!", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-03", "description": "Good location, Free WIFI (from next door).. \n\nCut: mega coffee chain store\nPaste: Inner Sunset\n\nTo be honest the only reason I go here is to use up the gift cards I got last Christmas and because you can hardly open your eyes without seeing a store. To be fair, they serve decent coffee and occasionally they have some interesting seasonal drinks too.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-16", "description": "Quite possibly the    s l   o     w     e   s       t     Starbucks ever. Every time I stop in be it a weekday or a Saturday morning the result is always the same, a 10+ minute wait to make and receive my order. I can't tell you the number of times I have though, \"hmm, a coffee sounds so good, I have 12 minutes before the next Judah train out,\" but after waiting in line for 6 minutes with 3 people in front of my just to make my order I have to walk out or miss my train. This happens SO OFTEN.\n\nMy normal on the way to work Bux is in the financial district that, when I come in, is morning rush hour with double the traffic and it still takes half the time to get in and out of there as it does this Starbucks on Irving.", "author": "Geoff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-27", "description": "Ackk! I'm writing a Starbucks review.  Goddess, help me.\n\nOk, so let me headline this review by stating that this review is SOLELY a tribute to their 'White Chocolate Mocha' -- \n\nI can't help it, I've been fighting the urge for wayyys too long, and supporting the local Hoop-La, but damn.  They make a *good* white chocolate mocha.  Fo' real. -- don't add whipped cream or make it \"soy\" cos otherwise it'll be sugar-overload insanity - I think it was purrfect as is, as was, and as it always will be -- cos they always get it right.\n\nI don't like admitting to their goodness.  It bites me.  \nSo I hover in limbo at 3 stars.  Voila.", "author": "Anjali V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-14", "description": "It is great... GREAT people, open earlier than ANYTHING NEARBY by two hours..  \n\nIt got popular for a reason.. the coffee is fine.\n\nIt is good, and if the Beanery, Alvin's, or Kaleo is closed, this is a perfect spot for coffee.  Would love to give it four stars, but I just can't.\n\nIf it is normal hours, hit the local mom and pops.  Up at 4:30am?  Sucks to be you... but you are set for Starbucks!", "author": "Uncle Fishbits Aeneas X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-18", "description": "I never had a problem with starbucks. And yesterday this super talkative dude made my most favorite drink ever. He had to remember how to make it but he did it. So props to him. The situation was funny.", "author": "Julie Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-12", "description": "came into today, no line. i hate the long lines at any starbucks downtown.\n\ngrande caramel frap w/ whip cream please\n\nwhile i was walking home and drinking my frap, i realized i forgot to order decaf...i hope i'll be able to sleep tonight.\n\noh yeah, this is the starbucks that doesn't have internet, or...at least the last time a laptop was brought, it didn't work...another starbucks (the one on irving & 19th) has internet. i think if you have a registered starbucks giftcard, you can go online for 2 hours each day...\n\ni like how this starbucks is spacious inside and they have outdoor seating. it was a nice day today and all the seats inside were taken, so we sat outside.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-05", "description": "Good old reliable, I know what to expect here.  \n\nAfter another experience with a small coffee place in Hayes Valley that made me a machiato without any caramel, I ran to this location to get what I had been craving all morning.  \n\nYummy, they always do it right here.  I know corporate greed, chain, puts out the small mom and pop shop, and all that.  But really, on a Sunday morning, I just want what I want the way I want it.  And Starbucks delivers every single time, hands down.  I have never been to a Starbucks where my drink wasn't what I expected, that is the beauty of a chain.  I can get the same drink at any location.  And sometimes that is all I care about.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-11", "description": "in general this is an awesome place to go if you want to study or just hang out with friends but there is one major thing that i absolutely don't like about this place.  There's this one employee, i think she's the assistant manager or something - she's one downfall.  Whenever and i mean literally everytime she makes a drink for us, first - all the drinks no matter what they are literally taste exactly the same, you're paying $3.85 to basically drink expresso and hot milk only even though you ordered a caramel macchiato or a cappucino or americano...there literally is no difference.  I understand the budget and economy is tight and you gotta cut back on ingredients but dang, you don't have to be this cheap that you don't get any kind of flavors.  Speaking of flavors, the second point is, i don't know why whenever she makes the drinks, not only do her drinks taste the same but they also taste \"rotten\" as if she's making her drinks with expired milk - it's fuckin disgusting!!  My friends and I always wait till somebody else takes over the drinks department so we can get our money's worth.\n\nSo, if you ever plan on going to this starubucks and you order a drink, make sure this girl isn't the one making your drink.  She has dark brown hair, wears glasses and the biggest observation  - she's always wearing a tie.  She usually wears a black tie but a couple days ago she wore a green tie.  It's a tie nonetheless!  Just warning you guys.  Other than that, all the staff members are awesome and they make my trip to starbucks worthwhile and their drinks actually taste like what you ordered and something a person wouldn't even give their dogs.", "author": "Me V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-24", "description": "It's just another Starbucks with the standard menu, furniture, and background music.  Oh, they didn't play Nora Jones here.  I used the washroom here and was surprised that it was quite clean.  \n\nService was rather mediocre, especially since I was told the washroom key was taken and it was actually sitting at a different part of the counter.  I waited for a little but but decided to confirm again with her that they really didn't have the key.  It was then that she said, \"Actually, the key's right there...I just didn't see it.\"  OK, maybe you're busy or preoccupied with making someone else's drink but you should at least have the decency to see if I was still waiting for the washroom when you realized the key was at the counter!  Thanks, lady!\n\nAnyways, this is a pretty busy Starbucks with the tables pretty much 90% occupied and a relatively low turnover rate.  Most tables were occupied by students studying because you see a number of open textbooks, highlighters, and notes.  \n\nI also spotted some interesting things happening around here.  People would walk in with a box of take-out from a nearby restaurant, buy a coffee/tea, and then proceed to finish their meal at Starbucks.  I saw someone with food from a Chinese restaurant and another person with a box of pizza!  It almost felt like I was in a food court...except everyone had a drink from Starbucks.", "author": "Ginni S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-15", "description": "The barista working here was so nice and adorable. She was busy helping another customer, but very politely told me she would be with me soon. Joked with me a little, even though I was sleep and caffeine deprived. I would stop in again if I was in the area and needed a pick me up.", "author": "k h."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "It's always really cold in here! I'm shivering in my peacoat.  I think this is a clever ploy to make us continually buy hot drinks.", "author": "Monika L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-04", "description": "I went over to the Inner Sunset in hopes of finding a good place to plant my butt and work away on my laptop. I like lots of space and windows (for occasional people watching breaks) and most of the cafes in the area didn't meet this need so I settled for Starbucks.\n\nI ordered a soy latte which was average. This place is huge and clean. There's plenty of tables to set up any workstation. However, there was one problem that day, wi-fi wasn't working. I left shortly after that.", "author": "Barney M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "This place gets really busy especially on the weekends! Reason to be patient here...great service with free smiles=D I was at dash cafe to try out their acclaimed coffee and to do some work and study but their service was so lousy I ended up back to the place I'm always usually at and I got my greentea latte (have been craving this since I got back from Japan) and I got to use my xmas gift card! I LOVE Starbucks;*", "author": "Neo23 T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-21", "description": "What can I really say...It's a Starbucks. Good place to study if you don't mind some San Francisco characters and the loud music. I went in to study and immediately saw a long line but it went away relatively quickly and then another line formed...so i waited...it went by pretty fast. I got a regular coffee black. they cant really mess up on that...but the cashier thanked me by my first name. he prob read it off my starbucks gold card.", "author": "Brendan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "I like this starbucks for its ambiance, nice people, large space. It can get busy as the other reviews note, but if you don't come during the morning coffee rush, you'll find a nice quiet corner table tucked away where you may be able to get a tone of work done! It worked for me.", "author": "Mimi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-11", "description": "Why am I giving this place four stars?\n\nIt's clean.\n\nIt's friendly.\n\nAnd I heard somewhere that Starbucks HAS to let anyone use the bathroom -- definitely a plus in my book!\n\nNot to mention the fact that it's hosting a sickie like me as I wait for Adam to come kidnap me and take me to Milano for dinner!", "author": "Allison L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-29", "description": "I'd have to agree with Shantangi...no line and my order was messed up. But I'm basing my review on the actual site. I really like this starbucks because they have tables placed along the wall with plenty of outlets. Oulets everywhere! Love it!\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-18", "description": "I wasn't very into Starbucks until they initiated the 50-cent refills for regular coffee, since I don't drink but a tiny bit before it's cold; so I'll get a small coffee that's half-full, and refill it every two hours or so that I remain nearby.  I liked that because I was paying about the same for the same amount of coffee, 2-3 dollars for venti-quantity in installments during a given day, without paying 1.50 per visit, which allowed me to drop that dollar in the tip jar instead, and produce less waste overall, which was a happy routine.  A couple weeks ago, though, one of the managers at this place started charging me full price for refills because I go to my office a block away instead of sitting in their always overcrowded, homeless-people-waiting-to-use-the-bathroom lounge.  So I don't go here anymore.", "author": "dule i."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-19", "description": "I live a few blocks away from here. They know my name and drink. I try to get to know them a little too..\n\nIf you're working from your laptop though, the wireless network here sucks. Keeps turning on and off for no reason.\n\nOtherwise, it's part of my morning routine.", "author": "June C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-03", "description": "It's Starbucks. No surprises here. Coffee that tastes as if the beans were burnt, not roasted. Lattes that are more like hot shake, not a coffee drink. But it will do in a pinch. \n The tea is fine, not fantastic. At least they have honey for the tea (quite important for me) and sugar in the raw for the coffee. The people who work there are usually friendly and chatty, and never balk at serving me drinks when I walk in minutes to their closing time.\n  Most importantly, it is open when most everything else near is closed. That is admittedly when I end up here. And it is a few steps away from the bus stop, and sitting inside with warm coffee beats shivering in the cold, foggy, San Francisco evening. The only thing that could please me more would be if they became 24 hours.", "author": "Miss Kae O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-12", "description": "By far the worst Starbucks in the city with the most incompetent crew who manages to get my order wrong or not at all almost every time.  Also, the \"attitude\" of the baristas are too much to bare ... are you kidding me?!?", "author": "S. I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-17", "description": "the barista said to me, \"why don't you look nice today?\", with a dreamy smile and a flash of pearly whites.\n\n5 STARS RIGHT THEN AND THERE.\n\n(my white mocha wasn't too shabby either)\n\ni am currently plotting my next outfit/hair/makeup/nails in anticipation of my next return.", "author": "sara n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-25", "description": "First thing you have to ask yourself is \"Why am I here?\"  Are you here to get coffee, use the restroom, mooch off the wi-fi, or any combo of the three?  \n\nThen, expect the following: \n- Coffee: Pretty standard Starbucks quality stuff. Custom-made to suit even the most fanatical coffee devotee's needs, on-point with whatever you need.\n- Restroom: Scary, scary, scary. Also, frequently and notoriously used as a personal shower/number 7 depository. I would laugh, except I don't want to breath in the fumes. Unfortunately, you don't have much of a choice if you're stuck in the Sunset with a bladder the size of a peanut.  (Ask yourself, can you make it to the gleaming, but sometimes smelly bano at De Young?) \n- Wi-Fi: Excellent, if there aren't too many people with laptops around and you're not trying to watch any videos.  YouTube can wait.  \n- All: Not bad. The service is awesome here, save for a few meanies.  Most of the SB peeps remember faces and are very open to making whatever crazy drink your inner-child desires. I'm thinking of my mint chocolate chip frap(extra coffee, extra cc chips) as we speak.\n\nLastly, enjoy.  This Starbucks may not be the Schultz' go-to archetype, but it certainly is cozy.  The remodel and the neighborhoody-ness of the SB peeps make you feel like you're in the title sequence of Cheers.  So... Cheers!", "author": "Daisy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-11-26", "description": "Ever wonder where happiness goes to die? Found it! This is the saddest Starbucks in the corporate-loving world. \nStarbuck's is my friend, though. In the ever-unstable world of coffee consumption, I always know what I'm getting at Starbucks. PLUS...they have a little thing called the LIGHT Frappuccino!!! This makes the world of bad-for-you deliciousness accessible to diet-obsessed folks like me. \nBack to this location...wow! Frowns abound and the cavernous interior beckons to your inner downer. I don't know what it is about this place that just makes me want to run screaming for the nearest sub-par mom and pop shop or Peet's. Maybe it's the homeless guy outside yelling at me about my \"fancy shoes\" or the trekkie hitting on me while I'm ordering. Or maybe it's the lady with five kids banging on the bathroom door as soon as I get in there. Maybe it's that they NEVER EVER have Christmas blend (my favorite). Even when it's (surprise!) Christmastime. Maybe it's their always-empty pastry case (even early a.m.). The staff are nice, but when I want a cookie, I want it!", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-30", "description": "I love Starbucks coffee. I love Starbucks beans. I love Starbucks treats. I do not love Starbucks that have zero couches. I would spend way more time here if they had couches especially since this is my neighborhood. I am pissed I can't find any coffee houses/cafes with nice, big, comfy couches in inner sunset. Please get couches!!!", "author": "Snora E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-19", "description": "I went to this SB when they were having a promotion for their holiday drinks, buy one, get one.  So I ordered my husband's drink and then a peppermint mocha for me.  The guy tells me they ran out of peppermint, so I say okay, I'll have a regular mocha.  Then he rings me up, but doesn't give me the promotion.  I ask about it and he says that the computer will only do the special if he rings up a peppermint mocha.  So I suggest he do it that way, since I did try to order peppermint,  he says that would be against store policy, it would mess up their inventory!  Hello, it is a Saturday afternoon in December and you are out of peppermint.  Your inventory is already messed up.", "author": "Nicole J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-10", "description": "This is my local Starbucks, only within walking distance! I see the regular baristas, and a few new ones here and there. Overall I don't have a problem, but whenever new people make my drinks, they tend to suck. Pros about this Starbucks is that it's big, but most of the time there are barely any place to sit down to relax or study. If you have AT&T DSL, you can use your username and password and you'll be connected! That's what I like about this and other Starbucks!", "author": "Edgar G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-30", "description": "Starbucks is Starbucks is the people behind the counter. And I have one favorite employee here who is great. He is loud and silly and on one particular day he was talking about getting fired from his other job. And then he dropped a thing of milk and everyone was like, again!? hahaha. classic. He is great. The other employees all seem cool, too.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "Simple..never messed up my drink order, never had to wait more than like 4 minutes (tea frap tangerine thing), usually enough room to sit down and a lot of outlets for a laptop.", "author": "Nic K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-19", "description": "The Good: Decor is up to date. Drinks are adequate. Haven't been here in about 7 years though.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-28", "description": "I go here  for the pastries...and the occasional venti coffee with toffee nut syrup. Other than that, I usually go across the street to the beanery.", "author": "James J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-01", "description": "Starbucks on 9th and Irving is the BEST! The staff is super and nice, but the best part, Free Newspapers, the NY Times and SF Chronicle. You don't pay! The best lattes and free newspapers.", "author": "smith m."}
