{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "ONe of my two go-tos around baseball season. Perfect places to just order a drink, sit down and chill.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-02", "description": "Decent Starbucks in a central location.  Fast friendly service, not too many in door seats and 4 small tables out front.  The bathroom was surprisingly clean!  Bonus there", "author": "Kim K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "Food: 4/5      Price: 4/5     Service: 5/5     Ambience: 5/5\n\nThis location is right next to AT&T Park, and always jam packed on Giants game days! The service is fast though. You get to meet a couple of enthusiastic Giants fan pre or post-game too! \n\nOrdered:\n* Peach Citrus White Tea Infusion, Grande ($3.25)", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "The service was not friendly, didn't ask name, nothing available sugar free. Cashier was rude.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Just another one of those places where a group of the employee's friends and \"family\" hang out during business hours. Just walk on by.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-14", "description": "My experience was less than favorable. With my morning off to a rough start, I figured a cup of coffee is just what I needed to get my creative juices flowing. \n\nI saunter in and it was a small line, but no more than the typical at any Starbucks you visit. Equipped with my Starbucks reward coupon in hand (on my mobile device), I was excited to get a free drink. A nice gentleman handled my order, but was not very experienced at the register. I provided my coupon for redemption and after scanning, it did not go through. Instead of asking for help the first time, he explains it did not go through. Well...duh! I noticed. We go into my app and he says my coupon is only for gold members. My coupon clearly stated, \"Enjoy a free drink today for a taste of the Gold level benefits.\" \n\nHe proceeds to tell me my total. I pay and then he tells another barista about the issue. Why didn't he do this before I paid? The other barista informs him of the issue and instructs him how to properly redeem coupon. Since I had already paid, he asked me if I would like to use the coupon at another time because he would have to void the transaction, etc. I mean, come on! At that point, I said forget it and I'll just come back another time. Then, he offers a generic sorry. Truly frustrating! I mean, I get it. However, my request was not a difficult one. I just wanted to redeem a coupon for a free drink. I did not mind waiting to resolve the issue, but it appears the employees did not care about resolving my issue.\n\nGood customer service is rare to find nowadays. I was not asking for something complex. I just wanted a nice latte and to utilize my coupon. That's it, that's all. I know which Starbucks I will not be patronizing.", "author": "Julia W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-25", "description": "During my solo San Francisco trip on 12/15/2015, I decided to take a break at this King Street's Starbucks just located near AT&T Park at the SoMa neighborhood. As I entered their doors, this place is much similar to most Starbucks locations across the U.S. although they have some good features like the wireless smartphone charger which it's a great idea to use if your battery is ran out soon.\n\nEvery baristas in this Starbucks is doing a great job for making the customers an amazing service despite the busiest environment. No cons at all!\n\nAdditionally, every Starbucks drinks and food like Skinny Vanilla Latte tasted not bad! Everything is simply delicious.\n\nParking can be average to park at King Street's Starbucks. You can park it at the nearest surface street parking if it's available. Otherwise, you can walk, ride a bike, or use public transportation easier without the hassles.\n\nAll in all, King Street's Starbucks is a good place to take a coffee break while traveling or living in San Francisco. A worthy visit. My rating: 3 1/2 stars.", "author": "William L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-08", "description": "The staff at this Starbucks makes it a point to befriend their clientele thus making your normal Starbucks run an incredibly enjoyable experience. The baristas are quick, friendly, and professional! It's my favorite Starbucks in SF!", "author": "Sana I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-30", "description": "Forgot about my drink order and didn't even bother to apologize.  Worst customer service ever.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-17", "description": "This is the only Starbucks in the entire world that doesn't do names on cups. Someone else just took my drink.", "author": "Cisco R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "My PR squad at Ubisoft LOVES this place! The drinks are always top notch but more importantly, the staff is always amazing. After coming here for so many years, it's safe to say we come back time again just as much for that boost of positive energy from the amazing folks who work there as much for the great drinks. \n\nI can't say enough what a positive experience it is every single time I walk into this Starbucks.\n\n- Stone", "author": "Stone C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-02", "description": "I used to think Starbucks had reliable wifi when I needed to get work done, but not this location.  Pretty much unusable for anything.  The connection just kept timing out.  But it is good to know that there's a Starbucks located near the SF Caltrain station.  Seems like it closes on the earlier side so don't expect any late night caffeine, but I'm sure this place gets slammed during the morning work rush.  For the drinks, they seem on par.  Seating-wise, the place is a little lacking.  There is one communal table that could probably fit 6 at max.  There are a lot of 2-seater tables that end up getting filled by one person.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-16", "description": "Probably the worst Starbucks I've ever been to. The front doors look like humans and possibly wild animals drooled and spit all over it. Nice first impression for a place that serves food. The baristas seem to care less about being friendly and more about talking to each other and their boyfriends. They also like to talk about being late and their Manager being mad about it in front of customers. UBER professional. Instead of waiting for me to finish my drink order, they just interrupt and assume. Instead of suggesting another item to eat when what I was asking for was out, she just looked down. Great at her job . And when I was walking out, the chick that always wears her dirty hair in a bun was saying bye to her boyfriend and standing in the middle of the doorway and didn't even acknowledge that I was there or say excuse me. If you want to go to a Starbucks where they are rude and it's dirty, try this one out.", "author": "James D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-10", "description": "Staff was eh. Not friendly or attentive. I ordered a mango green tea lemonade and my drink was definitely rushed. They were more interested in getting back to their conversation then taking their time with my drink. The drink itself was nothing special.\n\nI do like the location and that they have plenty of seating both inside and out. The store itself seemed clean enough, although it could use a little stocking on the food and drinks in the display cases.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "Thank God for this Starbucks.  Seriously.  With this Starbucks being on the way to my office form the SF Caltrain station, I find myself stopping by most mornings for a hot cup of joe to wake me up and warm me up.  An awake Michael + a warm Michael = a productive Michael.  Yes, I am usually one to go to Peet's over Starbucks, but this Starbucks is too convenient to ignore.  Moreover, this Starbucks is a breath of fresh air compared to the Starbucks on Brannan (see my review for that one).\n\nPros:\n\n+ Friendly, pleasant employees\n+ Indoor and outdoor seating\n+ Fast transactions\n\nCons:\n\n- Most mornings, lines are long and seating is limited.  \n- Please stop butchering my name.  (See pic.)\n\n4 stars", "author": "Michael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "I'm happy I found this place when waiting for my Megabus to leave. It killed the time. Free Wifi and Coffee. Was not busy at 7:30 in the morning. I even witnessed random acts of kindness while on my computer looking out the window. Good Samaritans handing out hot drinks they bought in the store to the homeless.", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "The reason for 2 stars is the awful customer service. There is one barista in particular that always seems to have an attitude. The location is good but unfortunately the staff is not.", "author": "Janani G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "I enjoy most Starbucks because of the friendly and upbeat staff, quick service, and uplifting atmosphere. This location was anything but.\n\nThe staff seemed somber and lacked any type of energy. Yikes... not really the type of interaction I want to get when picking up a cup of coffee!\n\nMy biggest gripe was that they somehow spilled or overfilled my drink (most of the exterior of my cup was wet from the drink), but didn't even clean it up. I don't mind a coffee streaked cup, but the least they could do was wipe it dry, right? \n\nAlthough this Starbucks is close to my office, I'd rather walk a little further to Philz!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "This is a Starbucks located next to the Caltrain Station. I had some time before an interview so I stopped by here for a quick bite. Service was quick and I was able to eat within a span of like 15 minutes. The multigrain bagel was just fine!\n\nThere's a decent amount of seating although this isn't the largest Starbucks of course.", "author": "Danielle C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "Please replace the lady barista who makes the drinks during the Mondays 2-2:30pm shift. Starbucks must have really low standards when hiring baristas because this barista was one of the most rude, arrogant, and unfriendly barista I've dealt with at Starbucks. She has a frown on her face during the entire time and complains to customers. Why is Starbucks employing a barista who has horrible customer service and hates her job????", "author": "Jane H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-01", "description": "This Starbucks is conveniently located only a few minutes walk from the ballpark which makes it a great place wait for somebody. I would think these baristas have heard virtually all coffee orders by now but they always seem surprised when I order my usual, a double quad iced expresso.  Yes, that's eight shots of expresso over ice! Yum! It's enough to fill a 24 ounce Starbucks cup to the brim. Just barely enough space for four packets of equal.\n\nThere's lots of indoor and outdoor seating at this location. Nice music on the inside and fun people watching on the outside.", "author": "John F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "Waited in a line for 13 minutes...To finally get my coffee.  Why the low rating?  There were 3 baristas, 2 cashiers, and 4 total people in line.  Seriously annoying!  I'll just automate the minimum wage jobs to stop having to wait and have decent service.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "I love this particular Starbucks!\nI come here every morning before work, and I'm always met by friendly baristas who address me by my name and start making my usual so I don't have to order myself.", "author": "Lina A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "At times this Starbucks is packed so that you'd think it will burst any second and other times it's an almost cozy place to sit and have a coffee. \nThe staff is friendly", "author": "Dario S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-01", "description": "I am a big fan of Starbucks in general. I have my usual drink and am a regular. One thing I really appreciate is good customer service in most stores. Unfortunately, that is not the case in this store. Last time I went, they messed up both my friend and my orders, and the barista refused to remake them to the correct orders. The cashier overheard and ended up remaking my drink. Today, the same thing happened where I saw the same barista make my usual drink incorrectly, and she insisted that it was correct. That did not fool my eyes or taste buds. I threw away my $4 drink as soon as I walked out the door. \n\nI get that if you're busy you might be reluctant to remake a drink that you messed up (multiple times! So not a one off), but some of us have dietary restrictions and literally can't digest dairy.  Since this happened to me twice in a row, I will be going out of my way to another Starbucks. Would not recommend this place unless you're okay with baristas making drinks their way. =]", "author": "Aimee Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-24", "description": "Not bad! Not too crowded mid-day.  I popped in to grab a coffee and get some emails out the door for an hour or so.  Perfect actually.  Got a good table and a cup of joe and was all set.  But really, they outfitted all these tables with PowerMat, so there are little dongles you can use to wirelessly charge your phone. But all the iPhone Lightning connector ones are always gone.  Always...like some jerks steal them - as if they can use them anywhere else aside from a Starbucks...srsly its not like your house is outfitted with them.  Quit stealing them and drink more coffee.  #kthxbye", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-14", "description": "I asked the barista if they had \"for here\" cups at this location. They had no idea what I meant because they just gave me a regular paper cup. \n\nI sat inside the shop the entire time drinking coffee. It's such a waste. Starbucks, please educate your employees so that we can help reduce waste!", "author": "Jessica K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-18", "description": "I come here almost every morning before work and the employees are always so kind and energetic! \nThis is my favorite Starbucks in the city.", "author": "Alyssa A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "Thee worse starbucks I ever been to. I go here a lot when I miss my morning coffee at the starbucks on 4th & brannan which by the way I recommend if you don't mind the walk for better quality drinks. I had so many issues at this location. I usually order through the app & just come in to pick up. One time I order, come in couple minutes after estimated time & nobody could locate my drink. Then all of a sudden the drink appears on the area where they make the drinks. Then another time I order a mocha frappuccino for my coworker. It is watery, has no whipped cream when on my mobile order it CLEARLY says whipped cream. THEN when they do put it I have to bring it again & had them add the drizzle. TODAY WAS THE LAST STRAW! This is their untouched VENTI LIGHT ICE green tea latte with caramel drizzle. I pay extra for caramel drizzle can you atleast act like you put a decent amount? This looks like grande extra ice in a venti cup. Who hires these people? When I complain they want to act like i'm such a pain in the ass. Uhh maybe if you made my drink right i wouldn't have anything to complain about. This place only makes money cus they're near the ballpark. Otherwise they'd been long gone.. might i add the dress indeed was watered down, tasted just like milk.", "author": "Diane Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Have gone into many Starbucks and by far this was my worst experience. My father's wife had asked for toilet paper when going into the restroom and was ignored, she then asked another worker he responded, \" not my job\" then I asked for the same and the employee responded by saying..,\"if you guys\" meaning the customers \"would just let me do my job I would do it.\" the stress of the job seemed to be getting to this employee which she took out on customers. She had the nastiest attitude, unprofessional demeanor, and no social skills all of which are needed to work in a customer service oriented field. Will never go back to this Starbucks.", "author": "Jorge C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "I was having a headache after lunch and wanted to get some tea to help calm the head banging.  Starbucks has one of my favorite iced teas and I hadn't been in a while, so it was the clear choice for chilling out for the rest of the day.\n\nI ordered the passion iced tea with two pumps of raspberry syrup to sweeten.  The nice thing about Starbucks is that, anywhere in the world, I can enjoy the familiar sweetness of their delicious drinks and their iced tea never disappoints.\n\nOne thing I definitely noticed was that the WiFi connection was way slower here than at other locations, but I suspect that has something to do with being located in the hotbed of technology.  Service was quick and there weren't any lines, and they have some great seats outside where most people like to hang out with their dogs.  Overall, definitely one of the better SOMA locations.\n\nFood: 7/10\n\nService: 8/10\n\nPrice: $\n\nAtmosphere: 8/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-07", "description": "3pm rush and we were stuck on Harrison to get back on the freeway. My brother bear and I decided to order an afternoon mocha from the convenience of my phone. We figured since we were barely moving, it'd ready by the time we loop around Starbucks again. It took about 5 minutes and it was already ready. I pulled over with my hazards on so my brother got our drinks quick considering how packed it was in there.\n\nWe were happier sitting in traffic with our hot mochas in hand.", "author": "Jasmine B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-11", "description": "As a barista myself, I do understand how difficult it can be to provide best customer service all day. But come on.\n\nWhen I asked the cashier for recommendations, she talked in such soft voice that I couldn't hear very well. When I asked her repeat, she sighed, rolled her eyes, and repeated the list in annoyance.\n\nWhen I presented a free drink coupon, the cashier didn't know how to enter it into the computer and had to ask for help. Understandable. While doing so, however, baristas who were \"helping\" the cashier talked to her in such condescending way and carried that exact attitude to the customers. So rude.\n\nDrinks were made pretty fast, store was decently clean, and music was nice. Other than that, customer service was horrible, and nothing much was special.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "This is one of my favorite Starbucks I've been to in SF. I come in almost every day to do work and they are all extremely friendly!", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "Friendly staff, efficient services and one of the most spacious coffee shops. The number of seats inside and outside, sits around 20-30 maybe 40 customers at max. Definitely another nice spot to get that caffeine fix before heading to work, getting on the bus or train.\n\nFYI:\nHere's information I found on Starbucks website:\nTheir business hours (hours of operation) are:\nMonday - Friday 5:30 am - 8:30 pm\nSaturday - Sunday 6:30 am - 7:30 pm", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-13", "description": "when staff comes out of the restroom, after addressing maintenance issues in there, they should definitely be washing their hands in the  sinks that actually display instructions right there behind the counter. Alas, while waiting in line, I observed just the opposite, in other words, ewwww! now, are patrons supposed to inquire, whether staff washed their hands in the bathroom? Or assume The sinks are for decorative purposes only? (needless to say I left.)", "author": "Johnathan Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-18", "description": "Really small Starbucks near the Caltrain station. Had to stand for a bit with my drink before I could get a seat! Although the drink quality was good, if you're looking for a relaxing place to read/work just head somewhere else!", "author": "Nishad J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "I have been going to this Starbucks since they opened many years ago. It is on the way from the SF Giants parking lot A, where I park, to my office. The baristas here are very friendly, quick, remember that I always get a venti soy no whip mocha and care about helping people with their drinks and food. Carmen, Isabel, Lizzie & Keyanna are all exceptional baristas & people! Britannee, the new manager here, is my favorite Starbucks manager in the approx. 12 years I have been coming here. She is super friendly, works as hard as any barista, and has an amazing heart. This Starbucks is always clean, has outdoor seating, and is a great place to meet people, including sone of the SF Giants, as the stadium is up the street. I met Hall of Fame pitcher Randy Johnson his last year pitching with the Giants. See you there!", "author": "Randall C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-28", "description": "Nice tiny SB. Walking distance to AT&T Park.  Found SB SF cup ornaments here for $7. Perfect for holiday gifts if someone you know likes ornaments and is into SB.\nHad a cup of Peppermint Skinny Mocha, $4.15 for a tall.  It was made a bit weak here compared to other SBs I've had around the city.  The staff here are very nice and try to be helpful.  The cashier told me because they are a small SB, they generally do not carry as much SB merchandise as the larger chains. They have a few tumblers but that's about it.  They have one uni-bathroom. Bathrooms are generally rare at most SBs.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-11", "description": "Yeah Starbucks, stupidly long lines, burnt overpriced coffee, the worst pastries in the world , etc.  ..... but if you happen to be waiting for the Megabus or something down here on a weekend morning (when Caltrain station doesn't open until like 8) it's one of the only things open, providing a coffee and bathroom lifeline.\n\nWell, the bathroom is kind of a last resort type deal, though. It's in OK shape but it's tucked right next to the coffee mixing station to where errant toots could put some poor soul off their breakfast.\n\nWhile I was waiting on the Megabus here last time, I'd had a crappy night of sleep the night before and kind of dozed off leaning gently up against the wall for 5 minutes or so. Nothing unusual and I wasn't dressed like a hobo or carrying garbage bags or anything. Anyway, I woke up to some old fart complaining at the counter about \"OMG THERE ARE PEOPLE SLEEPING IN HERE\". Lol dude if people sleeping in public really rustles your jim jams that much, you picked about the worst city on Earth to live in.\n\nAnyway it's OK in a pinch but it turns out the McDonalds around the corner is also open at like 6 am every day, so I prefer to go there.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "Super convenient how it's connected to Wells Fargo!! I was in and out because it wasn't so busy.. I was welcomed and the service given was nice..", "author": "Emm F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Took the calltrain with my son to hang out in the city on bay yo breakers day week end. We walked a few feet fom calltrain train 4th street and found this starbuck. Grabbing my latte. Nice redesign. Not crowded. One bathroom and fast wifi.", "author": "Juliette C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-08", "description": "I ordered a skinny soy peppermint mocha and it's probably the worst drink I've had at any Starbucks. Maybe because it was a skinny that not much sugar was added, but I figured that I still would taste the soymilk, chocolate and coffee, but nope. All I tasted was something like watered down coffee with peppermint syrup. I didn't finish it and had to throw it away.\n\nI still like the friendly staff and the convenient location since I work nearby. I'd give this place another shot for their other drinks but no more peppermint mocha for me...", "author": "Vanessa V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-08", "description": "Came to this Starbucks location to redeem my birthday reward. I ordered a caramel macchiato and walked back to my workplace. Then found out that all I'd gotten was half a cup of steamed milk, foam, and a drizzle of caramel on top. What? I returned and asked if I could have my reward refunded or another drink and was denied both! The cashier talked to me in a patronizing tone, was incredibly RUDE, and just unpleasant in general. I am not pleased and will not be returning to this location again. What the crap Starbucks?", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "Hung out here for a bit while waiting for my boyfriend to get off work since I got off early  (yay!)\n\nIt was very warm & my sweetened passion tea lemonade tasted amazing!\n\nThe guys that were working were friendly. They later walked around & offered everyone a free taste of chocolate croissants. I mean.. It's chocolate. On a croissant. What's not to love?! I gladly accepted. It was a perfect extra compliment to my now relaxing day (after work of course)\n\nOver all a good Starbucks location. The drinks were made fast granted it wasn't too busy when I was there. \n\nI would come back here just to read a book or cool off on a very warm day.", "author": "Joanne R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-06", "description": "Starbucks are easily found and there were about 3 in a few blocks radius around here but I chose this because it was right next to the caltrain station, I'd just missed my train and the next one wasn't for another hour. \n\nI ordered a chai tea latte, which like any other starbucks drink had some caffeine to go with the syrup. The starbucks itself isn't very well maintained and like other ones had absolutely no \"cheer\" to it. \n\nI like you starbucks but you can definitely do better than this.", "author": "Minks M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "Great location by AT&T Park and always fast service. Service in the early morning is impeccable but going around 12 or later you'll find a few of the team members goofing off and paying you very little attention.\nIt's totally fine to have some fun at work but get it together when you have a customer to take care of.", "author": "Marisa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "Normally it's ok but they aren't always quick enough as people rush to Caltrain. Today I had paid for my order and instead of offering a refund they just offered another drink that I don't like. I would have stayed to talk further but I had to get on Caltrain as the employees just talked to each other. Quality of the coffees I get is normally great though so props to them on that. They just need to be more efficient and prepared for the most basic orders.", "author": "Taylor H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-13", "description": "It would have been a great spot to enjoy coffee after the Giant's game...except they close at 7:30. What Starbucks closes that early? Plus, the guy at the door was kinda rude to us.", "author": "Kathy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-23", "description": "The barista's BO is permeating the entire place... the girls making my coffee...just chit chatting.... put my coffee down didn't even call my name. Latte tastes terrible.  I don't expect much from Starbucks at this point, but this is beyond bad.", "author": "Emo S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-22", "description": "It was freezing and I had to use the restroom.  There was a ridiculous line, and everyone seemed to take ten minutes.  Literally.  \n\nThey had a \"happy hour\" special going on where if you bought one holiday drink you got a second for free.  My mom bought one and no one told her about the special.  She saw the sign after she got back to our table.  I thought this was lame.  If you're going to have a promotion, at least promote it.  Yeah, there's a sign, but that's just crappy.", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-16", "description": "Today was a sad day for Starbucks, but an especially sad day for a ex-Starbucks employee of 3 years. Let me start out by saying I love Starbucks. I come from Seattle where Starbucks to me is like my second home. But today...boy oh boy was I disappointed.\n\nPer usual I ordered my Iced grande soy green tea latte with light ice. Transaction was normal, I even sat down at the tables to patiently wait for my drink. When they finally called my drink I saw from afar that my drink wasn't the normal green color that it usually is. I was like \"hmmm this must be the wrong drink\". As I walked closer I realized...man this is my drink, but what ended up happening was just wow.\n\nAs I approached my drink I realized that all they did was dump my milk on the bottom, slap some ice in it, dumped my matcha on top, and called it a day. I told the barista \"excuse me but I think you forgot to mix my drink\". The barista responded with \"no sir that's how it usually is\". To not be a total dick I decided that it wasn't worth my time to argue with him any further and just proceed with mixing it on my own. As a barista for 3 years I understand how these things can be overlooked and mistakes could easily be made. I politely responded \"it's okay i'll mix it myself, but usually the drink is green if it's mixed. Just saying\". I ended up snapchatting this to some of my friends because it was so bad, but I was also sad to see a partner respond like that. Hopefully the rest of the drinks he served weren't like that. I mean the slogan has always been \"Always provide legendary service and that your customers are always right (even if it's not fair)\" and as of today that legend became a myth.", "author": "Nathan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "It's nothing special. Obviously convenient but expect to be in line at any time of day.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-27", "description": "This is one of the Starbucks that I go to frequently. Usually pick up a sausage sandwich and latte to go. Not a bad spot to do some work. Regularly crowded though. Another downside is that wifi is on the slow side (still AT&T). Also it is hard to come here sometimes when I am craving Philz which is just one block away", "author": "Allen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-05", "description": "the one star is not for the cashier who helped me but the barista who made my drink. This is the first time I ever had the worst sbux experience. I walked in and noticed that the clover was shut down so I decided to order something strong but EXTRA HOT due to the fact that I was sending it to a friend working a graveyard shift in oakland. I ordered a grande quad shot white mocha at 200 degrees so it could still be hot by the time my friend received it. As i approached the handoff bar, the rude barista says \"your a partner right? well then you know we can't steam it up to 200 degrees\". Instead of responding negatively toward her I decided to nicely say \"then just steam it up to 190 i don't care\". \n\nShe hands off my beverage and as I'm feeling the cup, the heat is not bleeding through. I asked her nicely: \"did you steam it up to 190 because its not bleeding through\". her response was \"I don't know what I steamed it to but Ill just remake it for you, we don't steam it up so hot because it overflows\" then I told her \"well i need to send it to Oakland so it needs to be hot\". \n\nAs for the rude barista whose trying to tell me how to do my job, I've been a partner at sbux at the same store for seven years and still going, we always heat customers beverages to the requested temperature as ordered. Thanks for the info little miss know-it-all but WE ARE ALLOWED TO STEAM IT UP TO 200. I even told other partners and former partners and they had the same shock as I did. Next time just make my drink the way I ordered it to avoid all the hassle unless its an actual standard we're not allowed to follow.", "author": "Jeanine I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-15", "description": "Convenient location with friendly baristas - Starbucks sent me a reward coupon via email and I was a little surprised that they had trouble figuring out how to use it, but they stuck with it until the problem was solved, with a good attitude the entire time. Wide variety of seating (ie, small/large tables, couches, outdoor seating) given the small space. Is anyone else confused on why there's a Starbucks in the Safeway right next door...?", "author": "Clarice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Fast friendly amazing service. Seems like because of the busy location they've made restrictions on the use of the retroom, you must purchase so etching first to get in. Other thank that it's clean and the workers are very nice.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "The usual Starbucks experience. Nothing impressive, nothing bad.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-23", "description": "Standing at the end of the bar. Watching Miguel make drinks. Even though he has some time in between drinks, he ignores me. I am just needing a little more water before heading to the game. He make sure not to make eye contact with me. My friend is in the line waiting for a water. Thankfully the man at the register gave my friend a cup for me...I wanted to re-use my cup but since the man at the bar wouldn't acknowledge me I ended up with a new cup of water in which he poured,  please. We are coming in. Bought a coffee. Want a water in the same glass. To be ignored. In my book bad customer service, on Miguel's part.", "author": "Olivia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-02", "description": "A clean and friendly Starbucks experience.  I've been in this store several times while waiting for appointments next door. This particular store has always been relatively clean and presentable within reason based off of the hustle and bustle of customers flowing throughout.  The perfect location right next to CalTrain and Safeway you can easily pick up your perfect cup of coffee to go or while shopping for your next meal.  There is a nail salon, and tanning/hair salon located a few doors down and they all welcome beverages.  \n\nStop in and say hello to your neighborhood barista.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "This place is right downstairs from where I live but I don't visit often enough because safeway next door also has Starbucks coffee and they valid parking. :) I sometimes come here to read on Sundays and the vibe here is always cozy and warm. :)", "author": "Claire Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Sippin hot chocolate, big book of Suduko, chillin and people watching from the main store front window. Awesome!\n\nQuick friendly service. \nAbundant comfortable seating. \nNice atmosphere.", "author": "Patricia V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-22", "description": "Hung over. Dying. Didn't think I was going to make it but lo and behold, a Starbucks as soon as I hop off the train. \n\nTypical set up. Not enough outlets accessible. Overall it's alright. Great location.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "It's Starbucks. But they know people stop by utilizing the CalTrain station need by so they are pretty efficient when making your drink. Plenty of seating :)", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "I've had many many experiences with this starbucks as I am often in the area. The food and drinks are standard, although my drinks are not very complicated: a black iced coffee, maybe a chai latte. However, the service is definitely lacking depending on who helps me. One gentleman is quite helpful and accommodating, but some of the other staff sometimes seems to carry a bit of an attitude sometimes..not so nice. Besides that this place is fine. I go here for convenience, but I definitely get more smiles and \"have a good day\"s from Pete's or the smaller Starbucks in Safeway a few yards down.", "author": "Cara O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Very nice Starbucks itself.  Great for when I come into the city, get off at the 4th & King Caltrain station, and have to walk along and toward the Embarcadero.\n\nI don't always like the atmosphere thanks to some of the snooty, surly patrons that seem to frequent this place.  There are young professionals, then there are just yuppies...  Just my personal experience.\n\nThe staff are generally friendly or, at worst, polite.\n\nI've had worse and I've had much better Starbucks.  I tend to come to this one just because it's merely convenient.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "Awesome staff. Having traveled 2,000 miles from Illinois my well has dried out. Two mas dias until it get refilled. Well Ive bought coffee since 2006 at Starbucks. Have the Gold card to prove it. So anyhow, I'm running on fumes and they have obliged my needs for a place to hang, charge up with hot water for my tea. Yep Im reloading my gold card/iphone app come May. They have way more than earned my money. Ps I alway throw in dome change into the tip jar so Im not freeloading more than I have to. Starbucks ROCKS!!!! Xoxoxo to Starbucks.", "author": "Crista S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-12", "description": "I come in here almost every day to get a coffee and go. The people are pretty friendly, but I'm pretty low maintenance with what I need. \n\nToday was a completely different experience. I asked the lady to give me hot water to put in my empty tea cup. She responds and says that I need to pay for a refill... of water?!? Tell me if this makes sense, but she says that if I don't put the used tea bag, which I already purchased, back in the cup of water then it's free but if I do put it back in then I have to pay. I would understand this if they are giving me another tea bag, but this is just water. This was a very disappointing experience, and I thought that the logic was awful. I will probably be going to the other coffee shops that do not charge for extra hot water. Absolutely ridiculous!", "author": "P L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-15", "description": "Bad service. Bad wifi. Frappucino not made well, too icy and too much gap. It's not even filled up", "author": "May L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-25", "description": "This starbucks is very consist in their customer service and the quality of orders served. I couldn't ask for anything more.", "author": "Sergio G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "This is the closest Starbucks to AT&T Park and thus a lifesaver for those early mornings before the game when you need a boost of caffeine and/or something to eat in order to survive the long wait outside the Yard (or to use the restroom).  The decor is your standard Starbucks but clearly due for one of their new remodels, and the staff is always friendly.  They have a great \"assembly line\" system to get you through the line and to your favorite beverage quickly as it's one of their busier stores, especially on game days.  A lot of homeless do frequent the place for a cup of coffee, which is fine as long as they don't smell too bad, but one did get a bit violent on my last visit when the barista asked him to leave after staying too long at a table.  He threw a cup of full sugars against the wall behind my head.  Kind of caught me off guard.", "author": "Chad B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "This Starbucks was conveniently located right between the Caltrain station and AT&T park so it's a nice stop for anyone who is getting off of Caltrain & walking. It was typical Starbucks decor inside and an average Starbucks size. What set this Starbucks apart from others was the friendliness of the staff & the accessibility of refreshing water. The employee who took our order was incredibly friendly and even made a joke when I ordered a medium by accident (as a seasoned Starbuckian I was horrified that I had somehow made such a rookie mistake)! The drinks were made quickly and were deliciously refreshing. They also had water & cups accessible on the counter so you didn't have to ask for water at all. This was wonderful since asking for water is such a pain, especially if they are in a rush. The outdoor seating was cute in the heart of SF as well. Loved it!", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "Very welcome place with excellent food. I has dragging my luggage looking for a place to grab a small lunch before leaving SF an stumbled upon this small gem. The place is king of upscale but with medium range prices. Hostess was very accommodating of my tourism self and luggage. Waiter brought out a sampler dessert plate which was amazing! I proceeded to ask for coffee to add to the cafe experience. \n\nLoved the place and was overly thankful for their hospitality.", "author": "Juan E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-07", "description": "Love this Starbucks especially since it's on the way to my work. Love it even more because of Seema and Irish, my favorite baristas who always have my drink ready even before I get to the counter.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-22", "description": "Sadly I think they have a bunch of new folks who are working there who haven't been properly trained.  Went in to redeem my birthday drink and the order was taken down without an issue.  Question.  When I order my green tea latte with soy or coconut milk and no foam, I'm never asked if I want it sweetened...it always has been and has bee perfect.  Again, I was not asked and after waiting 10 minutes to get my drink, the other barista (a young Africa American woman with a cute bob and her name tag started with a K) who was making the drinks handed me mine.  I tasted it and knew that it was not sweetened and asked her if she had sweetened it. She answered no and turned away.  I asked her to sweeten it for me and she gave me two pumps of sweetner and turned to give it back to me.  I asked if she could make it a total of five pumps and she rolled her eyes.  She did give me the additional pumps, but really?  Isn't it your job to make the customer happy?  And I asked nicely but apparently it was a bit too much for her to really do her job.  Sadly, as much as I love Starbucks and this is the only one that is close to my work, I am realizing why I love Cafe Bravado and Philz so much better.  This Starbucks will not be getting any of my business or my employer's business ever again.", "author": "T C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "For an extra sweet drink try a venti ice coffee with 3 pumps of the frappucino sweetener and half and half made by Jaz. She's the best! Super friendly staff here!", "author": "Amanda H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "The male working at 7:30pm on Sat 8/1/15 announced that the store was closing. I told him I'd just use the bathroom for two minutes before leaving. He refused to let me use the bathroom, telling me that I couldn't because he had to lock the door immediately at 7:30pm. He could have locked the door, let me use the bathroom, and then let me out. In my opinion, this was third-rate, incompetent customer service.", "author": "joe c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "My favorite Starbucks!  The staff here ROCKS!!  They usually have my drink ready by the time I have to pay.", "author": "Art S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "I've been to about numerous Starbucks...probably more than my occasional trip to Target, my parents house, even church (sorry).  I guess this is what happens when you have work 7:30AM. The NEED for a warm cup of Starbucks latte/coffee in order to function.  \n\nAnyway, this specific location has the BEST staff.  They always seem to brighten up my mornings and never failing to make my coffee exactly the way I like it.  Trust me, other Starbucks have failed miserably: a tall, one and a have pump, soy, sugar-free cinnamon dolce late.  I might be bias though since I'm a regular here.\n\nKeep up the good work!", "author": "Jacquelynne S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "I love to come to this location during lunch. Grab a coffe or tea and sit outside, there is usuaully a nice breeze going. Staff is friendly and helpful, also super speedy. Only thing I would say is that the heater is up too high inside the store for me. Also the seating outside has too many chairs or not enough tables, I always feel guilty sitting down when im by myself.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "Hang out here for lunch...hooked on the Iced Coffee.", "author": "Dan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "Came here for my usual Caramel Macchiato during FanFest 2012, the lines were horrendous, but the staff seemed to have control over it which was great. they obviously were busy but did not show their anxiety, Loved that some of them were wearing Orange Giants shirts!", "author": "Samuel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "This place gets two big points. First, it was a nice, warm place to duck into out of the rain. The second being that I had an extra yummy hazelnut latte with whip here.\n\nOne thing that threw me off, though, was that they close at 6:30 on Sundays. Nothing wrong with that, though! I work at a Starbucks, and'd love to have those hours at my store!", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "I'm torn between this place and the Starbucks in Townsend.  They both have excellent staff.  The staff here pretty much knows me and they are friendly. The place is clean.  The bathroom is also clean.  Great views and on a warm afternoon, just sit outside and people watch - excellent way to chill with friends.  This place is really awesome thats because of their customer service.", "author": "Nix L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-26", "description": "I'll admit that the location is convenient and the drinks are made to the usual Starbucks standard.  My issue is that this place is pretty small and the staff is pretty incompetent and unprofessional.  The girl that made our drinks was unorganized and splashed dirty washcloth water everywhere (drinks included) while her friend just laughed at her when she spilled something.\n\nI understand that it's only coffee, but I'm paying $4 for it.  Please take your jobs a little more seriously.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "came here to get my morning dosage before work. \n\nfast. efficient. space to sit.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-03", "description": "I usually dislike anything that is a super food chain such as Starbucks, but I have to admit, their lattes are pretty yummy... I have a fantastic espresso machine at home that I use to make my morning lattes, but i didn't have any milk this morning, so I stopped by starbucks on the way to caltrain... \n\nThis location is very close to the 4th and King caltrain station... very very friendly staff and very clean... a few tables for sitting... they even have a few tables outside... surprisingly, this location wasn't crowded at all during the morning rush hour... awesome! \n\nThat have a new (or new to me) pastry... mini vanilla scones... YUMMMMMY!!!", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-17", "description": "I'm a Starbucks whore.\n\nYes, yes...I know the purists out there despise the corportate giant...my friends in Seattle refer to it lovingly as \"Char-bucks\", but I love it.  The convenience, the selection.  Whenever I'm traveling I always keep an eye out for the local Starbucks.\n\nThat being said, some branches are better than others....some are slow, some are dirty, some the people who work there are incompetent.  I love this one in particular because early in the morning, there's hardly ever a wait.  The barista is quick and efficient, as well as friendly.  My only minus star is because the person taking the orders doesn't assist the person making the drinks when there are no customers.  I found this odd this morning when the barista was already working on three other drinks, and the cashier took my order and stood there.  Tsk, tsk....lazy girl.\n\nStill, my drink was made rather quick - and it was as good as it always is!", "author": "Melanie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-06", "description": "TOP NOTCH SERVICE HERE!!!\n\nI buy Decaf Cafe Verona, finely ground, for my Melitta cone (thanks RM for turning me on to this coffee method way back when!).  I no longer get the mocha's or other sugar-laden tasty drinks.  Just my beans ground up nicely.  I love this location as it's right on the way to the train, and it absolutely stands out from every other SBucks I've been to.  \n\nTwo visits ago I asked if they had my fav blend and two people looked everywhere for it.  I walked out without coffee and went to the location inside of Safeway for it (but the beans were nearly expired and I'm fierce about exp dates!)  \n\nMy last pound of beans came from here and the NICEST most HELPFUL gal was utterly meticulous about getting my beans ground just right.  She even pulled two colleagues in on it to ensure my satisfaction.  When I was leaving she said to bring the coffee back if it wasn't right.\n\nWOW.", "author": "Sparkely K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "Freezing!!! Turn the AC off we are in cold SF don't news AC! Doesn't help I'm drinking a iced double shot espresso either. Yes I was cheap today bought the shots and filled it up with free milk = cheap strong latte. Also grabbed a bagels with cream cheese Mmmm... still can't feel my fingers in here", "author": "Karen T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-03", "description": "Convenient location to Caltrain, the Ball Park, MUNI, and Safeway. Workers here are typically friendly and quick enough to bust out a line. 3 stars for being a typical Starbucks, nothing over the top and not bad with their service.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-22", "description": "I find it ironic that this Starbucks is right next to a Safeway that promotes a very big Starbucks sign in it---the Safeway one always is less busy.  Anyways, this is a pretty normal shop, but seems to have a bit more seating than others.  It is also really close to the bus lines and the 4th/King Muni train stop.  It's a great place to grab my \"grande 5-pump soy chai latte\" before I hop on the train.\n\nTimes visited: 2+", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-11", "description": "It's kinda of scary when Safeway has a Starbucks and two doors down there's this one. I guess the Caltrain rush might justify it however since at some point people will just give up if lines are too long. Surprisingly the crew that I interfaced with here were super nice. Took in a green tea latte waiting for the train and watching the rain come down.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "I ordered a gingersnap latte today, and the barista making it offered me a FREE extra shot of espresso and also FREE extra ginger topping! \n\nMORE CAFFEINE YAY!!\n\nBTW: this is purely about the gratuitously FREE stuff I was very kindly offered.  If I were rating the coffee, it'd be 2 stars.", "author": "Christina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-17", "description": "A Starbucks is a Starbucks is a Starbucks...\n\nSo, what makes this one rate a review?  The people behind the counter here are just awesome.  From the kickass manager to the friendly owner.  From the hip quiet expert to the hip loud game enthusiast.  From the girl with the amazing smile I have a little crush on to the other girl with the amazing smile I have a little crush on.  (I have a lot of crushes)  The thing that makes this Starbucks special is the people.\n\nWhen I walk in they nod and are already making my drink.  No matter who is behind the counter.  Even the newer staff are incredibly happy and pleasant.  That kind of thing comes from the top and speaks volumes of the ability of the managers.\n\nMy hat is off to you guys!  Cheers!!", "author": "Travis E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-02", "description": "Been here a couple of times, however they completely screwed up my chai latte order today morning. It's the worst chai latte I have ever had at any starbucks till date - it was so dilute that it felt like plain hot milk. Never coming here again, the lines are so long and even though they seem to service people fast enough, I am not paying 3$ and wasting 15 minutes of my time to drink hot milk. So disappointed.", "author": "Tangerinegate A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-25", "description": "These guys can't get the order right, or they're very slight of hearing. My friend asked for ice; the dude says \"you want rice with that?\" cmon man", "author": "Jerrold C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-10", "description": "Though I am normally against the flavor of corporate coffee (cause if it ain't \"fair trade,\" it's \"unfair trade.\") but these people are funny and have great personalities. I would only go to Starbucks to get lactose intolerant /poisoned so I could get out of crappy jobs early in the past, but this place allows me to pay for my groceries at the register which is a perk and then some as I buy lunch there in the morning before I sk8board down the street to work. The down side is that you can't tip these homies since it is against the \"rules.\" Fuck that rule, who ever made it wasn't behind the register sporting smile on their face that hurt to say no to me. One day I'm gonna tip these folks when they least expect it and insist that in my country it is a custom to show gratitude to those of us that are in the mouth of servitude.", "author": "Muhammad R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "this place is leading to the demise of my coffee addiction.  now that i'm on the quest for a gold card, i am quite a frequent customer.  if you haven't registered one of the many gift cards you've received for your birthday or christmas, definitely do so now!  my SKVL's are now $2.55 as opposed to $3.05 which helps decrease the amount i spend on caffinated beverages.", "author": "Carli F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-27", "description": "today was the second time in a row i got an extra shot for free.\n\ni thought i was spesho until i saw christina y's review.\n\nwhat's going on here?  highly suspicious but i give them a grand 5 stars for the best deal in town (for now!)", "author": "Josie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-13", "description": "Self confessed caffeine addict. New to this city, so I start scanning the nearest Starbucks. The one on Brannon and 4th is my favorite since it has everything I like about Starbucks. Friendly Baristas who get to know you and your drink, remembering how to make your variant of a Macchiato, and reasonably quick service.\n\nEnter Lug (If you aren't into mysteries and Campion, read shaved, medium height, stocky guy) at the King St Starbucks. Bossy, rude to customers, and quite simply a bad barista. \n\nI had to bail once on a paid drink since the wait here sometimes takes upwards of 20mins. The other dude was nice enough to remember me and offer a drink the next day. Lug walks in and says \"No Sir.. we can't do that\". Its not like I asked for it! And when someone says \"Sir\" that way, the sarcasm fills the room. He insists on being the only person at the bar, which would have been ok if he were at least a decent barista. I have been with Starbucks for 10yrs now, and hands down, this is the slowest coffee maker ever! Chatting with his favs, giving the evil eye to the rest, overheating the milk everytime... this guy is running his fiefdom. I feel bad for the other baristas who i think share the pain. Bottom line, he was bad enough to trump my addiction.\n\nHave to thank Lug for helping me wean off  of my four shots a day. Down to the occasional visit with the Brannon folks, and I am on my way to a caffeine free existence. What a difference one person can make.. both ways! I didn't think one could kick a 20yr habit. So \"Thank you Lug!\"", "author": "Jean Luc P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "no complaints. walked in and got free coffee i guess they messed up on an order  and everyone around was saying no they didnt want it so we took it .. thank s helpful awsome staff!", "author": "LoveMeTender t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-21", "description": "It's like any other Starbucks.  I'd consider this one a small one.  Has a bathroom for guests, tables and chairs and the normal goodies you'd find to snack on.  Nothing wrong with this location.", "author": "Bernadette M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "Great reviews from everyone...I hate to give props to Starbucks but I am finding more and more that many of the Tully / Peets and even privately owned coffee houses just don't get it. If I were to create an ideal location with the staffing and service to boot, this would be it. Easy to access locations just walks from the train depot and ball park. Baristas say they get steady streams of people throughout the day. Thanks for the samples and thoughtful service!", "author": "Tanya P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-14", "description": "Meh. Same stupid coffee everywhere. I run by here on my way to Caltrain in the mornings and hate the long lines. Get it together, peeps.", "author": "Saumil M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-18", "description": "I know you can get better coffee in this city, but this is my weekly sunday morning stop, and I like it.  Nearly every Sunday morning I wake up too early (around 7 am) with my husband still asleep, so I sneak out of bed, shower and go for a walk along the Embarcadero.  Inevitably this walk leads up to Starbucks for a morning cup of coffee (just a regular latte, nothing of the fancy stuff for me) that I drink on their terrace, enjoying the sunshine and the peace on a Sunday morning.  I like the fact that they have reasonably good coffee, for a reasonably good price, at a great location.  I wouldn't go anywhere else for my Sunday morning 'bakje troost' (Dutch expression meaning 'cup of coffee')...", "author": "Marijke D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "I like this place to hangout with my laptop.  Most workers are very cheerful and upbeat.  Bathroom is cleaner than most.", "author": "Regina J."}
