{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Javier is my fav barista. Friendly and always got my drink right. Kia is a funny girl to talk to. Celia will say \"have a wonderful day\" when she passes the drink. The bathroom is a bit disappointing, but you're at DT SF, what do u expect? \n\nI recommend to try blended strawberry lemonade and bacon egg shoulder sandwich.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-03", "description": "Worst location ever and they lie about Drink Times! I order on my app and they click its ready to go but it's not! Such liars.\n\n\nSo slow! Avoid this place if you can.", "author": "Vanessa W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-17", "description": "Another 1 star well deserved the most unprofessional staff I've ever encountered such rude people \nAfter ordering my small white mocha and been charged for it I've got a call from the barista which was Latina lady stating that they can't make my drink because they're out of it \nI changed my order just to keep things smooth \nAfter getting the drink there's no sugar cane I asked again and the answer was we're out !! Lol\nI decided to return the drink and here comes the change ,, that lady threw my 5$ on the floor in front of everyone for no reason \nI asked for a manager or a supervisor then that black ghetto girl showed me the real face of her \nAnyways this will be escalated to the highest level soon till those ladies are out of business", "author": "Farid F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "Convenient location if you're on the go to, or from the financial district or union square. Not much metered parking here but, there is a parking garage around the corner. \n\nLow star rating due to plenty of Hobos/panhandlers  in or around this particular location and restrooms are usually messy. \n\nFriends of mine have gotten cell phones and laptops stolen here too, so if you happen to doze off while enjoying your favorite cup of coffee, better put your valuables and or electronic devices away.", "author": "Benny L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-20", "description": "Zero stars...the worst Statbucks ever! 15 min for a drink to be made..individuals coming in after me are getting drinks left and right, then when he finally gets to mine its wrong..another 5min! This place is the slowest most inefficient Starbucks i have ever been to. The staff moves at a snail pace as if they are high! The owner needs to either invest in supervision or fire and replace the current one along with the sleepy school kids!\n I work in the building above this one which would have made it convenient; however i will go to the Peets down the block for now on!", "author": "Trina T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "I Was here yesterday.  The store was not that busy and my order was taken quickly and also received my coffee quickly.  The one negative was a person sleeping in the store.\nWent back today and it was like a different store.  Again not very busy.  There were 4 of us in line.  The 2 employees I could see,were,to their credit busy performing tasks.  It took awhile for the cashier to acknowledge customers and take orders.  She was not friendly and would rather not be helping customers.  The barista was very very slow,unfriendly, and also was not wanting to be bothered by customers.\nAfter finishing my order,instead of serving it she let it sit there until I asked for it.  Even worse, she served a customer a cup that was only HALF FULL!  \nAgain today there was a person sleeping in the store.  It seems that the Rules posted in most stores are for show only! They CLEARLY PROHIBIT sleeping in the stores!\nIs this the best Starbucks has to offer?", "author": "Scott B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-17", "description": "Unprofessional staff and if you're in a hurry, definitely try to go elsewhere. Even mobile ordering takes 10-15 minutes for anything instead of the 2-5 the Starbucks app claims. Why are there only two people working this massive, always busy location? I'm sick and tired of running to meetings in the morning because I'm waiting at Starbucks for 10 minutes longer than I should. Posting this at 7:55, ordered at 7:39 and item 2 in my order is nowhere to be found. Ridiculous.", "author": "Conor C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "Apparently Quad Venti, 4 pump pumpkin spice latte now means triple 1 pump pumpkin spice, latte :( not a great way to start off my new year. Service in this location continues to go downhill. I usually use mobile ordering now, but am not always able to. The rare occasion that I don't use this service, my order is incorrect.\n\n\n** 4/24/17-\nAnother terrible experience today! Most of the crew here are phenomenal, but today was not the best team. My mobile order was made incorrectly and on second attempt, still incorrect. All I received was an empty 'sorry'. Whatever happened to the recovery coupons and the promise that if you don't enjoy your beverage, they will fix it. The store was very slow during this time, yet the staff were struggling.\n\n** 3/18/18-\nSomehow the service in this location gets even worse. Mobile order sitting in the printer 10 minutes after received. No sense of urgency from the team, no apologies, only 'it's right there' while gesturing toward the printer. As a former partner, I am appalled!", "author": "Jeffrey R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-30", "description": "Received half my order, had to remind them after 15 min. Staff is constantly on their phones.", "author": "Sandra D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-08", "description": "It seems that when I come here I get whatever the baristas want to give me and not what I actually ordered. What's that? Your name is Steff and you wanted a grande iced coffee with soy milk and no flavorings? Enjoy this tall warm-coffee-that-we-poured-over-two-ice-cubes with coconut milk and a cinnamon sugar shot, Jennifer.\n\nSigh.\n\nAnd I'd like to explain to them that what I pay for isn't what I get, but a) the no-nonsense cashiers are painfully busy since there's a revolving door of customers (side note: as a result, since it's so heavily trafficked, this place is also one of the dirtiest Starbucks I've ever been to), and b) the baristas making the drink squirrel away before your cup has even hit the counter top so you don't even get the chance to point out you were given the wrong thing.\n\nIf you like a crapshoot with your coffee... you like to gamble with your caffeine intake (personally, I don't; I need it when I need it, y'know? This is my productivity and sanity we're talking about here!)... come here between 8 and 11am.\n\nMaybe you'll get what you wanted.\n\nMaybe you won't.", "author": "Steff D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-16", "description": "I just ordered a Blonde coffee and the cashier served a luke warm cup of coffee so I complained and then she tops it off with pike place brew instead of serving me a new cup. Boneheaded Eejit!", "author": "Julian I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-15", "description": "This is the most poorly managed Starbucks I have ever been to. They had one person taking orders and one person making drinks. It is an extremely busy Starbucks too. I had to wait 30 minutes for 2 drinks and ended up having to ask for my cake pop on the way out. This Starbucks should have a minimum of 5 people working. 2 taking orders and 3 making drinks. The trash on the counters was overflowing as well. It has been like that every day I have been there during our vacation. I have it 2 Stars instead of 1 because the 2 people working there did an amazing job. It is not their fault.", "author": "Denise R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-01", "description": "After a visit to the Contemporary Jewish Museum, I stopped by this branch of Starbucks to grab a quick bite to eat and to have another round of the Pokémon GO frappuccino drink before heading home. The Starbucks Pokémon GO drink consists of its vanilla bean frappuccino mixed with raspberry and blackberry, and topped with whipped cream. And load up on some pokéballs and other items as this Starbucks is a pokéstop. Maybe catch a Pokémon or two or three. . . .\n\nA very merry friendly barista greeted me when it was my turn in the queue. He took my order of the Pokémon GO Frappuccino and a butter croissant. Unfortunately none of the selections of pastries and other offerings did not sing to me. The barista offered to warm the croissant for me if I wished, and it was quite appropriate considering the weather.\n\nSome of the staff at this Starbucks were unaware of the Pokémon GO partnership and were unaware of the recipe. They were surprised this Starbucks branch was a pokéstop. Fortunately, the barista who took my order was able to help his colleagues find the recipe. \n\nThis branch of Starbucks looks small on the outside, yet when walking inside, it is roomy. And it was not crowded, I found a quiet spot to munch on my croissant, drink my frappuccino, load up on pokéstops, and play Pokémon GO. On my way out, I thanked the barista for his very helpful assistance. I would definitely return to this Starbucks branch the next time I am in the area.", "author": "Chiara A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-02", "description": "Typically, I don't review food chains. I normally bias towards artisan locations because of their uniqueness. In this particular case, I'm reviewing this Starbucks location out of spite.\n\nTo begin with, the general quality level of Starbucks is my opinion has consistently declined over time. They no longer feel like cafes but more and more like fast food chains.\n\nThis specific Starbucks location was the rock bottom of my Starbucks experience. First, the entire location was nasty. It was as if keeping it untidy was deliberate. Secondly, the staff was totally unfriendly and rude. I understand the lowered bar because of the food chain culture but in this case - using a touch screen would've been a superior experience compared to the cashier who rung me up. Lastly and worse, not only was the staff rude they were incompetent too. I asked for a tall Black and White mocha with no whip cream and twice they gave me the wrong drink. The first instance they gave me a hot chocolate and for the second instance they gave me a black and white mocha with whip cream. To cap it off and after finally handing me the correct drink, the server had the nerve to roll her eyes as if it was my fault.\n\nTo summarize, this was a terrible experience and never again will I step foot at this Starbucks again.", "author": "Jon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-03", "description": "I would not recommend this starbucks. Walk down the street instead. The managers name here is Kristen. The supervisor on staff was wearing gray and had curly hair and glasses. \n\nI had a complaint that the wait was very long. The supervisor then at one point made a comment out from across the room saying \"there are 86 other starbucks here\". I didn't quite catch the rest. I later asked if the comment was directed at me since she shouted it from across the room, to which the response was \"it's to everyone in general.\" \n\nI got the sense that the supervisor was saying that there are other starbucks to go to if we have a problem with this particular starbucks, we should remember there are \"86 others\". \n\nOn the bright side, one of the employees opened another register and the line went down very quickly.\n\nLater, as I'm typing this, the supervisor also swore at a homeless person using words like \"shit\" and \"I'll throw your shit out if you don't leave right now\". I understand that her assertiveness was to get the homeless man to leave. However I believe there could be better ways to do so without swearing or threats.", "author": "Scott K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-24", "description": "Very disappointed in this store today. I usually take a side street and go to the Starbucks at 201. 3rd St. but they were also disappointing within the past couple weeks. I ordered hearty blueberry oatmeal, everything bagel and a caramel frappe. I got the the frappe, than continued to stand there waiting for the bagel and oatmeal which I finally had to ask for. Meanwhile an employee behind the counter walked away to go on her \"break\" never once asking if I had everything I needed.... I made this order from the Montgomery Bart Station on my phone via the app right before I got off the train. At least when I asked where my order was the remaining employees made it right away since they realized they had messed up. Of course they gave me no blueberries with the \"blueberry oatmeal \" that I ordered.. I hope if I return that this won't happen again and my order of everything I ordered will be ready.", "author": "Carleen S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-14", "description": "I used the mobile app to order 6 minutes away from the store. \n\nAfter 10 minutes of waiting in the store, order was finally delivered. \n\nThere were two people working their tails off, two on a go slow strike and two on their phones....", "author": "Gavin M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-17", "description": "This one star review goes to the cashier Roxanne who made me wait too long for an everything croissant. I watched her ring up person after person instead of getting my croissant. I watched her chat with someone in line who was either a friend or a Starbucks employee because she allowed him to write his order on his cup while they blabbed on about nothing important, I'm sure. And when I asked her what was taking so long she continued to ring up other customers and I watched their drink orders get completed faster. Then a customer, who could see how frustrated I was, got to the front of the line and asked Roxanne to please follow up on my order before she placed her own. And Roxanne did not think anything of it. She said it'd be another minute but was ready to take another order. Roxanne- just so you know- you work in an industry where you're probably one of the first interactions a person has with another person on any given day. You also work in a bustling downtown environment where I'm sure efficiency, speed, and convenience mean a lot to people that are going to work in the morning. Get it together.", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "I had a great experience here! Shout out to Dani for helping me out and making a great suggestion for their Za'atar Chicken & Lemon Tahini Salad. Speedy checkout too. The store was well stocked and fairly clean.", "author": "Maianh N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-06", "description": "Two men were openly smoking meth or heroin in this store using the straws provided by Starbucks. None of the baristas said anything while I was there. I tried to call but no one answered the phone and there was no answer machine.", "author": "Lake R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "SO slow. You'll wait 20-30 minutes in line if there's a considerable amount of people waiting. Absurd. I feel at liberty to speak on this since I worked as a barista for several years in college. The baristas here seem like they're working in slow motion - there's just no hustle, period. You're better off waiting for something better at Blue Bottle down the street.", "author": "Mallory W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-22", "description": "#49 A Clover machine is a coffee maker that brews one cup of coffee at a time. It brings out the flavor of the coffee by controlling the temperature of the water and the brew time. This prevents the coffee from tasting acidic. Basically, it's like a legit Keurig.\n\nThis Starbucks is 1 of 14 locations in SF that have a Clover machine. They have a variety of flavors available, but since I wasn't being picky I asked the cashier to give me her favorite Reserve coffee. Both her and the barista recommended the Burundi blend, which is supposed to have a hint of lemon and spice. I didn't taste it. It just reminded me of the Blonde blend. It was good to try but I don't think I would regularly spend $4 for a tall cup of coffee.", "author": "Kirstie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "My boyfriend ordered a tall black tea lemonade & venti ice water . The cashier definitely do not want to be there because it showed in her face. Oh & a barista who made our day even more wonderful (sarcastiy) named Laura definitely should not be employed there. She was short & rude . Definitely zero customer service ethic in her. I aksed for the bathroom & she was snappy about it which I understand there are alot of transients around that may take advantage of that but she doesn't need to be rude. The store was dirty & smells like urine. Sorry, definitely not coming back thanks to your awesome baristas!", "author": "Liony H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "I was looking for a Starbucks, and then I saw this Starbucks. I went inside and I THOUGHT I was ordering an iced coffee... and then it turned out that's EXACTLY what I ordered. Sorry I don't know why I capitalized so much of that... were you reading it like I was upset about something? Hm...\n\nI'm not from San Fransisco, and while I actually really enjoyed the city I came across horrendous service a multitude of times. Surprisingly the best service I came across was at a burger joint called \"Split,\" and THIS Starbucks! Everyone was really nice here and there was a lot of seating and... you know... coffee! \n\nI'd love to write more about it because I love giving five star reviews, but I'm not really sure what else to say about it. You know when you're dating and you meet that really nice person that you have absolutely no problem with? But also something seems off because you're also not very excited? So you want to say more about them but there's just no substance? And then you start to feel a bit apathetic and maybe a bit sociopathic and then you decide to live a life of crime and then you rob a bank and then your driver crashes into the ocean and then you almost drown and then you discover your super powers and then you become a superhero but then you use your new super power on your new wife and she drowns and then you become a vigilante with nothing to lose but then you meet a mentor who gives you hope again and you begin to love again and then you give it all up so you can start a career in accounting? Oops. I peed.", "author": "Justin E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "Mobile Order from 3rd street everyday, only one lady would make my order right! Especially today, No fat milk became whole milk! No foam became half cup foam! Only taste milk flavor, very weak coffee！Hey,PLEASE! Check the order when your making order!", "author": "vivian l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-03", "description": "This Starbucks is large with plenty of seating for a Saturday evening. The service was only okay. My drink, when it was finally done, was left on the counter. No one called out that it was finished. The tables were askew and dirty. The restroom was disgustingly filthy. The trash at the fix up your coffee station was overflowing, and the station was messy. There was garbage on the floor. I expected much better from a Starbucks located in SF's Financial District. Many customers came and went. Do people not realize that this is not the norm for a Starbucks?\n\nI have to say though, my drink was really good!", "author": "Katt M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-29", "description": "Ahhhhh, Starbucks. Always comes to the rescue! Though it's not always my go-to, when it comes to coffee because I always like to see what local brands offer, they always seem to fill certain immediate needs. I needed green juices throughout the week, in a hurry, and they served their purpose! For those that know me, know that I cannot get through the day without my green juices! I travel with my superfood powder supplements and need to mix them with a fruit/vegetable blend juice. 2 days out of my 5 day stay at a nearby hotel, I walked over to buy the juice and they always had them. The line moved quickly and customer service was done with a smile. This Starbuck's was clean, plenty of seating and located right on the corner of 3rd & Market. Will I be back here? Of course! They also sell the city & state Starbucks collectible cups here, too! Woohoo!", "author": "Rebecca W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-20", "description": "Slow wifi, lots of homeless that steal pretentious clueless management. Dangit if I wanna reserve a table then I can do that. That glare and fakeness is why Im in contact with corporate...\nFive stars cause its Starbucks. Mmmmm", "author": "Crista S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-29", "description": "The lady taking the order is in a bad mood.  Customer service should always be excellent,especially when I am so demanding.  Very poor service at this Starbucks", "author": "Miguel F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-19", "description": "Extremely disappointed with the service I received at this location today. I work Saturdays and needed some coffee to get through the day. I've been here before and had quick and friendly service. Apparently they no longer care about pleasing their customers. After the two girls who ordered before me got their drinks, I was expecting to receive mine. As I stood there waiting, I watched the baristas make four drinks and proceed to give them to two off-the-clock employees. Us idiots who actually paid for our drinks just had to stand there and wait. Since my time and patronage is no longer important to them, I won't be back at this location. I suggest going to the one on Kearny where customers are actually their priority.", "author": "Alie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "I love my Starbucks and my coffee, and this location is one I go to frequently. I would say the service is good, but it tends to be VERY BUSY, almost all the time. I would assume this is because it is close to the Moscone Center and close to Montgomery Bart.\n\nSomething to note is that there are usually several homeless people outside, which is not necessarily a bad thing, but some of them can be a bit pushy.\n\nOverall though, this is a convenient locations, the staff is great, and I would recommend it!", "author": "Umang P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-03", "description": "Service and coffee were up to the usual Starbucks standards here (take that as you will).  Like many urban Starbucks, it has an unusual amount of space for a coffee shop in a high rent district which makes it a nice place to stop if you are shopping or being a tourist like myself. Also, to their credit unlike almost any other urban store or chain including ones that pride themselves on being hip they have a relatively clean public bathroom.\n\nUnfortunately all the things that make this place appealing, also make it appealing to fairly marginal homeless or the urban deranged.  To be clear I don't mean those homeless who have bought a coffee and are sitting there with a chance to sit down in a normal place and relax for once.  I mean scary/ deranged people who walk in sit down next to you and wait until the staff politely asks them to leave.  I feel bad for the staff but they do their best to be courteous  and don't bother those who are actually customers even if they are clearly homeless.\n\nA true SF Starbucks :)", "author": "Sanjay W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "So, let me start with: I'm from LA. Came out to San Fran for the weekend on a small vacation and decided to explore the city (on my own) One of my must-do stops was definitely China Town, and as any other CA'ian/ I need my Starbucks. I stopped by this one on the way to my destination to get myself a cold brew and hopefully charge my phone as it was dead. Although I had no luck actually accomplishing my charge due to someone who was already there charging his laptop/tech items, I did get myself a yummy drink! \nI continued on to my excursion before being deep into China town and realizing I had lost my phone! Immediately, I turned back and tried retracing my steps and stores I had went in during my walk... nothing was found. As you can assume, I was in panic mode! The last time I did remember pulling out my phone was at this Starbucks... so I went back and asked the girls at the counter, 2 of which were Addy and Maya (I believe, sorry! I have such a terrible memory) They asked if it was also a wallet, I said YES! They checked the back and one of the girls was telling me they did find a red case iphone, of which they went out of their way to charge it (it was dead as stated above) and waited for a call... \nLuckily my boyfriend called and they answered/ made him aware that my phone was there. \nMy boyfriend came by and picked it up. \nI asked them if I could please use their phone to call and confirm if this was my phone/ he had in fact picked it up, they kindly agreed. \n\nBoyfriend confirms he picked it up.\n\nI can't say THANK YOU enough to this location's staff, and specifically Maya and Addy for assisting in my phone recovery/ info. \n\nI couldn't imagine being in a large city with no phone, no uber, and basically SOL. \nIt means the world to me they put in the effort of charging it and answering my call. Good deed did not go unnoticed! \nI just wish I could have tipped them more (I only had $5 cash on me) \n\nThank you thank you thank you girls. You saved a mommy heartache for possibly loosing a thousand pictures of my toddler, and of course a headache and $700-800 for another iPhone (this was my last insurance- phone claim. I know... I need to be more careful.) \n\nYOU GIRLS ROCK, xoxox", "author": "Jessica J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "This review is for Starbucks at this location in relation to other Starbucks in the city.\nI have been on a search for the perfect coffee shop for getting work done, while sipping on a cup of coffee. And this location is definitely a top candidate!\n\nThings I really like about this location:\n\n-This Starbucks is conveniently located in the FiDi right off the bart\n-Very friendly staff, who emits positive energy and fast service\n-The drinks are actually made to my taste (not too sweet)\n-Plenty of space and seating for everyone\n-Free wifi from ATT and the city of SF (this one's faster)\n\nThings that could improve:\n\n-Cleanness of the restroom\n-Cleanness of the tables\n\nI would definitely frequent this location, if I am in the area.", "author": "Solongo B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-30", "description": "DISAPPOINTED and NOT returning.  Staff is not friendly.... rather rude.  Don't want to start my morning off like this.  Been there early mornings (6:15 am) and staff is always rude but decided to give it another try this morning.  At 3rd and Market Starbucks at 6:15 am on Wednesday, 8/30*17.  The guy at the counter was rude and didn't want to be there.  He was slamming the cups down, no eye contact, seemed in a rush but no one else in line. I stood at the pick-up line waiting to ask the barista for something and she ignored me.  I asked the Barista for a coffee sleeve and she sighed in disbelief.  My husband asked for ice and she sighed again.  There's other Starbucks and coffee shops open in the area with much friendlier staff.", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-10", "description": "Ducked in to grab my aesthetician a skinny mocha on my way to my waxing appointment, and... what's that? Why yes, I AM gay. Why do you ask?\n\nANYWAY, it was a perfectly serviceable Starbucks, cleaner than I expected in a busy downtown location, and the servers were in a good mood, which is generally a hit or miss with service in SF.\n\nDefinitely would return, they were nice and it was clean and kind of a cool angular layout. It's a Starbucks, not a five-star super-cool indy coffee shop, but all things considered, a good one.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-10", "description": "This is the most dirtiest place I've ever been I don't know why its not shut down!!!! Its never clean and there's always homeless people taking over the chairs and bathroom and I feel dirty sitting on the chairs because nothing is ever clean!!!!! Oh and there's about two people working there so it's extra slow.", "author": "S M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "I have never seen such a nastier restroom. The floor had not been cleaned in awhile. It's only two o clock. The bottom of the toilet seat was marked with feces and urine. Find another toilet.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "I don't ever recall having a very bad experience with my visits at any of the Starbucks Coffee shops I've been to. Most of the baristas at Starbucks are very nice and friendly so this is something that gets me going to Starbucks from time to time. Although I must disclose that sometimes they maybe a bit short staffed. When the staff baristas are there, they are attentive. Their service may not always be top notch but when the barista staff are present, I see that they continue to work hard every day to achieve excellence in customer service.\n\nOf the times I've gone to Starbucks, I ordered:\n- Vanilla Latte\n- Pike Place Roast\n- Ham, Egg & Cheese Breakfast Sandwich\n- Bacon, Egg & Cheese Breakfast Sandwich\n- Sausage, Egg & Cheese Breakfast Sandwich\n- Turkey & Swiss Cheese Sandwich\n- Red Velvet Whoopie Pie\n- Chocolate Whoopie Pie\n- Double Chocolate Brownies\n- Iced Lemon Pound Cake\n- Marble Pound Cake\n\nFor me basically, I enjoy going to Starbucks Coffee just because of the number of store locations they have. Once again, the service at Starbucks Coffee may not be over the top inventive but they continue to work hard to achieve excellence in customer service and doesn't even matter if it is hard or easy. For full disclosure, I've tried coffee and latte from Peet's Coffee & Tea as well as Tully's Coffee! Whether you are in a rush to get to school, work or any events and special occasions, Starbucks has a location nearby to serve you when need a pastry and a cup of coffee/latte on the go!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-12", "description": "I get it, most of these kids are caffeinated, but when someone tells me my order instead of taking it. Thats rude. I walk in to place my order. A tall young man grabs my coffee thermos and before I say my order, he states \" you want a refill or this is your first time?\" mind you spilling the coffee I had left on himself. Again I have not placed my order. I was probably overcharged to say the least. I attempted to continue my order as he looks at me perplexed. I tell him \" You didn't allow me to place my order, that's rude\" He rolled his eyes. At this point I was finally placing my order, after I got his attention. Are you kidding me? What happened to the customer service. It's more like, let me tell you what you want. The young mans name I believe was Max or Mac. I overheard a co-worker say his name. I later on proceed to talk to the management and the manager on shift thinks it's a joke. Starbucks really? Date of incident Tuesday 13/2016 approx time 11:40 / 12:13pm noon.", "author": "Johny M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-23", "description": "Rude and unhappy employees...result in a bad service. I'm never being in a such a bad Starbucks in my life. Never coming back.", "author": "Karine G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "This is my goto Starbucks when i get off the Bart.  Depending on my path way I Pass 1 starbucks all the time and this one usually doesn't have a long line.   The staff is super friendly and they remember my name at least 80% of the time.\n\nIt has a lot of tables and a open format and a lot of plugs and power.   Ask the staff for the code for the bathroom which helps keep it clean.", "author": "Homer S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-09", "description": "Lately this Starbucks has been looking a bit sketch inside.  There's people bringing in their sleeping bags and carts into the coffee shop.  I think it's sweet that they let people come in and rest, but probably also a good idea to keep a close watch to make sure everything is sanitary and safe.  A crazy guy ran out from the bathroom screaming about his asshole and picked up a chair and threw it across the room.  The workers just stood there.  I was literally scared for my life.  Another person sitting there had to stand up and ask the guy to leave.  Wait isn't that the worker's job?  So at least he should get a thank you from the workers right? Nope.  Nothing not even a thank you sir for helping.  Good thing they messed up on my order and I was able to give him my extra drink as a thank you.  Security is probably needed for this location for everyone's sake.", "author": "Lynn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-23", "description": "We stopped in for water and a smoothie on the way to BART from MOMA. They have good seating, small and large tables and also bar seating facing 3rd. \n\nMy honey's orange mango smoothie tasted like bananas. I suppose we shouldn't try non-caffeine offerings at a coffee shop...\n\nThey have two bathrooms available for customers.", "author": "Emily J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "Nice, spacious location. The few times that I've been here I've noticed the number of homeless people that come in to sit around or use the restroom.", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-18", "description": "I come here almost everyday (2 months) and have yet to experience bad service or crappy food. The people who work here are very friendly. It can get packed but what Starbucks do you know that isn't?", "author": "Rich C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "Its your typical starbucks. Its only good if you're in the area cause its not worth driving since it'll be hard to find parking and too many cars driving especially that its in downtown. One of the few starbucks that closes late. Only came here since i was waiting for my brother to finish work before we go home. Spacious. Friendly staff. Got the hot chocolate. Decent amount of flavor. It wasnt super hot, mostly warm. But it does satisfy my taste bud for sweetness. Shouldnt have gotten the brownie since it was too much of chocolate but needed a snack to bunch on", "author": "Julie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "I like this location because it's HUGE and had all sorts of seating and electrical outlets. YES. PLEASE. \n\nI got a refill for my iced coffee and the staff seemed super fun and nice.  Everything was clean even the bathroom!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "I'm not a big fan of coffee, but I do like some coffee drinks at Starbucks, always leaving with good mood and a big cup of Caramel Macchiato. Also, a very pleasant surprise was, when I asked for a double caramel, to make coffee a bit sweeter, they didn't charge any extra fee. Will came back definitely.", "author": "Dmytro Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "I've never reviewed a Starbucks but I felt compelled this time for two reasons: first, this Starbucks has a clover! I enjoy supporting local coffee roasters (especially when I travel) but they rarely open at or before 5 AM. Finding a Starbucks with a clover is difficult...but you have one here SF!\nSecond, this Starbucks has wireless charging spots by Powermat. First time I've seen and used one...too cool! \nLike:\nHigh ceilings with great big windows where you can sit, enjoy the music, and take in the City. \nFirst Starbucks I've seen that puts out a pitcher of water so that one doesn't have to ask all the time!\nOverall a pleasant and attractive Starbucks!", "author": "Hector M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "I bag on Starbucks coffee all the time but honestly it's not that bad anymore. It's not great but it doesn't have that charred flavor ... they leave that for Peets now. It's a little better than McDonalds and such I guess. \n\n4 stars not really for that but for being Moon Base Alpha downtown on the weekend when most everything else is closed. Open at 6 am on weekends with caffeine and sugar, a good restroom and even some power outlets floating around in dark corners. I would imagine due to the location it's a total cluster if you visit on a weekday when the FiDi crowd is gettin up every mornin from the long crotch warming and takin the eight fif teen to the ci-tay, but on a weekend morning it's pretty mellow and a nice place to do some computer stuff and drain the wizard.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-28", "description": "This Starbucks is too crowded for my liking, even at 7am in the morning when I get off Bart here. There's usually a line of at least 5 people here, and people tend to linger around for a really long time after they get their drinks so there's never any seating. In the corners of the store, there's usually a homeless person sleeping which is not welcoming at all since there's a weird stench that inevitably fills the air...\n\nIf you're looking for a Starbucks, I'd recommend the one down 3rd street about 3 blocks or the one on New Montgomery which is about 1 block away.", "author": "Austin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "Perfectly good place to wile away some time before an appointment. Ample seating, a few outlets, a bathroom that doesn't require a code or key. \n\nDrink was made as I expected and quickly. Staff seemed friendly an efficient. Definitely an up to standards Starbucks.", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "This is my FAVORITE Starbucks in California despite having worked at two Starbucks before. \n\nThe staff is friendly, the location is great, drinks are consistent (as they should be), BUT the bathroom is disgusting.  Kudos to them for being the only business on Market street that would let people use their bathrooms though!\n\nIan, Lisa, and the lovely lady with curly hair (just caught a peek at her name tag - Andrea is her name) are fantastic!  Actually the whole morning crew is great!\n\nThey have good wifi too :) I've never had any issues connecting and it's relatively fast!", "author": "Maggi K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "I don't want to sound rude, but if the barista is unable to make a simple Frappuccino how can u call this a coffee shop??? Lol 1 star for at least someone tried making me another but same result.... it was quite annoying to start your day like that sorry to say but this starbucks is bad!", "author": "Tommy Rainier C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "I like this location. It's bigger than most starbucks I've been to and is super comfy if you wanna hang out with a coffee. I normally just come here to pick up a coffee before work so being fast is key! The employees here are quick and friendly. Can't really ask for anything more from a starbucks. Maybe better espresso?! Yes, yes I think their espresso is weak, but I get so many starbucks gift cards I have to spend them on something!!!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-25", "description": "I haven't come here a lot like I use to so I decided to try it out again but yet again service hasn't change much still so poor.", "author": "Lin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "This is my FAVORITE Starbucks in all of America. Here are the reasons why:\n\n1) Great seating area up against the glass for people watching on the street.\n2) The employees are always super nice and smiling. \n3) It is super clean. \n4) Free WIFI. \n5) Tons and I mean Tons of plugs for the electronics. \n6) Has a largest set of merchandise because along with being addicted to their drinks I am also addicted to their mug and cups. \n7) Open late!!!!\n\nI can't wait to already go back because this place is almost better then my own living room.", "author": "Cris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-02", "description": "How odd that there was no previous Yelp listing for one of the more prominent Starbucks in town. You know which one I'm talking about...the comparatively spacious one in the Hearst Building on 3rd and Market Streets.\n\nIt's not that I love or hate Starbucks. Like everyone else, I take them for granted, use them, and immediately dismiss them once I toss the cup. It's really like any other unhealthy relationship. But I want to cite one unique aspect to this location...you have a good shot of getting a seat here - even on the weekend. That's the only reason I'm writing this review.\n\nNo need for me to state anything about their holiday drinks or their baked goods. You know them more than I do. But when my dogs get tired from pounding the pavement in the middle of FiDi, this is where I know I'll be able to park it until I'm motivated to face the world again....http://www.youtube.com/watch?v=miiUKBHxDQo", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "lol, this review is actually cringe worthy just typing, though I imagine for those reading it's much worse. \n\nI just asked the fair skin lady with curly hair making the drinks (10:33) if she could please get me a small cup with half ice filled, no water. \n\nAnd then she shouted, \"Wait!\" and followed with \"No, I already have too many drinks to make right now.\" \n\nokay, calm down, ma'am. \n\nNeedless to say I just walked out in complete shock, truly a disappointment coming from a Starbucks Barista.", "author": "Tao H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "As the unemployed fresh graduate that I am, I usually come here and sit here all day while my bf is working at the big office building across the street. Hey! No shame! I do buy a drink! \n\nThe service here is very friendly and the drinks are made pretty fast. I like how you can always find a seat and they're always an outlet nearby. During rush hour, it might take about 15 min of standing around looking sad with your laptop in your arms, but there's always someone leaving sooner or later. \n\nAnd there's free wi-fi! I'm not sure if it's a limited offer, but for the past few visits this year, I've gotten free wifi without logging into any ATT account. YIPPIE! \n\nBeware of those crazy bag ladies that drop in every once in awhile. The baristas are pretty nice--they dont kick them out, but do occasionally remind them that they cant be sleeping in the corner. \n\nMy go to drink: Tall Skinny Caramel Macchiato. I love how it's bittersweet and how I still get the taste of coffee. YUM! And I love my daily cup of regular coffee in the afternoon.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-22", "description": "This Starbucks is in a great location near the corner of Market and 3rd Street.  It is quite busy so the workers are too busy to keep the tables and chairs orderly and wiped on a regular basis - but other than that, it's a decent place to stop for your favorite Starbucks drink.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-06", "description": "The menu and staff are the same as any other Starbucks location in the US, however, this one is extremely noisy and crowded and there are tons of homeless people walking around drinking free waters and watching everyone drink their coffee...kind of creepy if you ask me. The gf and I got the hell out of there quick after a homeless lady was staring us down while we were waiting for our drinks", "author": "Brian P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "I don't think I'll ever come to this Starbucks again. My cell was snatched from me while I was sitting inside their store near the entrance on December 26th. Staffs nor customers tried to help me catch the theft or call the police. How could they act like nothing ever happened. I had to ask myself if they can help me call again so the cops can help me write a theft report.(A pedestrian outside the coffee shop helped me call before.) All they can say is \"our store phone has no power from Thursday X'mas holiday\". I wonder how can they have no compassion??? What if that happens to them and no one help them. So, be extra careful when you're in public places. I didn't expect  my cell to get snatched inside Starbucks. Thanks!", "author": "May W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-10", "description": "I've been coming to this Starbucks for about 8 months.  I work very close to here so it's an easy stop from BART on the way to the office.   The baristas and cashiers are very friendly and make an effort to remember your name and/or drink.  Some know my drink, others know my name, and some know both!  Personally, just the fact that they remember either one is impressive to me - i mean really: how many people do they serve coffee to every single morning?!  I don't even want to venture a guess, but i know it's got to be incredible. \n\nDue to my special dietary needs, i always order decaf and sugar free.  i would say 98% of the time they are right on it.  There were only maybe 2 instances where it was wrong, but if i don't recognize the person making my drink, or they don't call it out correctly, i'll always double check.  i have NEVER walked out of there with the wrong drink.  (I know this because my blood sugar didn't sky-rocket like it would with the regular syrup, nor was i shaking from any caffeine.)  Once or twice they realized their own mistake and re-did it right away.  (I know it's odd to order decaf in the morning, but i'm sure i'm not the only one, and i can't risk in-taking the caffeine.)\n\nThe line moves pretty fast, and sometimes if they notice me near the front of the line, they'll label my cup so they can start making it while i wait to pay.  My workday can be pretty hectic sometimes, so saving that extra minute or two is much appreciated!\n\nJust yesterday, i tried the 'Bucks around the corner because our offices moved locations and that one is now on the way to the office.  But they felt much slower, not as friendly or peppy, and it just didn't feel the same.  So i will gladly continue to come to this location and take the extra walk around the block.  To me, it's just worth it.", "author": "Char B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-12", "description": "I never would think to review on a Starbucks (there are just so many of them), but this is a special one. It is so special, in fact, that my coworkers and I have actually had conversations about how we hate to get our coffee anywhere else. \n\nThe staff here is the friendliest and quickest group that I have ever seen. They know my name, the name of my coworkers, the name of the people in line around me in line and they know all of our favorite drinks and orders. Without sounding too corny, their friendliness is the bright light in my work day.\n\nHighly recommend for anyone who works in the area. I don't even mind writing this knowing that it could lead to a busier Starbucks...they can handle it. :)", "author": "Cathryn H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "Was in the City to take care of some business and needed a spot to grab a Venti, and fire up the MacBook. This is a nice big location. The workers are very friendly and I can tell it's a bit of a chore to keep things in order considering certain elements of the nearby clientele. The WiFi (by AT&T) wasn't strong at all, but I was able to use the City's WiFi coverage effectively. They have the new cell phone charging system, which works but it covers the headphone jack on my HTC One M8. I'll be coming back when I'm in the area.", "author": "Russell M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "LOVE THIS STARBUCKS! They are the epitome of what every location should strive to be more like.\n\nThe employees are at the top of their game at this location. \n\nThey are ALWAYS smiling, call me by my first name and then always end with \"Have a nice day\"!\n\nI am pretty much at this Starbucks every morning and whether I get a hot chocolate or the most what I call, \"Foo-Foo\" drink - the customer's service is A1 hands down!!\n\nOh, let me not forget the POSITIVITY, it's definitely in the air and so contagious!", "author": "Isadora Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "This branch has a great location, is huge, and is open later then the other branches in the financial district (til around 9 or 10). It's quite busy, but there's always a lot of seating choices. Drinks and service are what you would expect. \n\nThe only negative is that the wi-fi is spotty, slow and difficult to connect to if you sit near the windows closer to the street.", "author": "Jasper P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "With many Starbucks to choose from in SOMA, this is by far my favorite.  The staff is very friendly and providing excellent customer service is paramount.  I wanted to compliment Tiana, who is an exceptional Barista.  She always remembers our drink order and goes out of her way to provide superior customer service.  Stopping by in the morning on the way to work is the perfect recipe to start my day.", "author": "Lon H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "6/12/11\nWalked into this place for a regular cup of coffee and to our surprise we walked Into one of the 10 locations that had a clover machine in the bay area! There are only 65 of these $15,000 machines in the US...the BF was in love and seriously had the best time...such a funny thing to say about a coffee place..but it was the highlight of his day!", "author": "Belle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "Nice place to sit back and relax after a week of running around visiting San Francisco.", "author": "David M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "Five stars for location, service, clenliness and access to power outlets and seats.  Right next to my favorite parking garage in the area (Hearst parking garage).  The bathrooms are always clean and I've never had to wait too long for a table or seat to open up.  I haven't had any dropped internet connections either.  \n\nThree stars for other patrons.  There's always a couple weirdos in this Starbucks.", "author": "Richard T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "Has the best staff!!! Line gets long but they move it along very quickly! The staff is super friendly and always remember everyone's order and names.", "author": "Kendra M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-19", "description": "Was just here earlier, as it was raining I was craving for their hot chocolate. It was my first time being at this location and it was great! Service was awesome and so was the hot chocolate, it was kinda crowded but I did managed to get a seat which was great.\n\n\nThe only thing though there was this guy in the dark corner(the table with the lamp) was staring intensively at a girl across the table while, fondling himself which was quite disturbing.......", "author": "Tc S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-15", "description": "This is one of the bigger Starbucks with plenty seating.  A lot of people hang out inside the coffee house during weekdays.  Don't count on finding a place to sit.  \n\nCoffee is typical Starbucks.  Nothing in particular stands out on the drinks.", "author": "Steven M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-17", "description": "BAH! \n\nYou stole all the clover machines! You made it so that I can't get my Stumptown (or any other decent roast) Clover brewed anymore! I finally tried the Starbucks beans brewed via Clover at this Sbux location, and while light-years better than the regular coffee, it still does not compare. \n\nDamn it!  I want my Stumptown Guatemala Finca al Injierto clover brewed!", "author": "Don B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "Unlike a few other Starbucks in the area. This one actually gets my order right. Every time. Keep up the good work. Nice people too.", "author": "Fallon D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "It sure makes me sad that I won't see the team at this Starbucks anymore. :( They are awesome!\n\nI worked around the corner and came in literally M-F...and they knew me by name, and always had my obnoxiously long and detailed drink order downpat. The manager, Domi, is such a sweetheart - many a time he referred to me as \"Love Muffin\" and when I insited that be the name written on my cup, the baristas didn't even flinch.\n\nLots of seating available, and the Wi-Fi is great. I wish all Starbucks were this friendly and I'm gonna miss my crew a lot!\n\nThanks for caffinating my mornings for two and a half years, guys!\n\nLurve,\nStacey\n\n(Also known as Love Muffin - Iced Grande Nonfat Caramel Macchiato with Extra Caramel, Light Ice and 4 Pumps Vanilla...and often, a sausage breakfast sandwich. :)", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-07", "description": "I get off the bus right before this location on 3rd, and depending on timing, want to grab a mocha before getting on BART. Several times I've passed it up because there was a line of at least 6 people and I had less than 15 minutes before my next train. I tried it once and it worked out okay with a little hustle. But this morning, coffee was a must, I was willing to risk it again. I ventured in, with a line and 12 minutes before the next train. They are super efficient here, trying to get orders down before you get to the register and the baristas are on top of things quickly making the drinks. As a bonus, they're friendly too! If you have time to hang out, plenty of seating with great people watching on Market. It's also pretty clean for such a high traffic store.", "author": "Amanda F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "I was going here after a film at the cinema because I was hungry and my mouth was watery for some Starbucks. I haven't had Starbucks since forever. \nI was expecting a long queue to get my grande Vanilla Bean, but thanks goodness It was not. \nIt was kinda stuffy inside.\nThe WC's are okay and good thing they have them. I got my vanilla bean faster than expected and I was pleased. The atmosphere is okay but as every starbucks is like YOU can NEVER get a good armchair/table to be there.", "author": "Nadav M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Located right under the parking garage...convenient location.  Service was good and our drinks were made perfectly.", "author": "Trish S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-01", "description": "I agree with Jenny G -- this also is my favorite SBUX in SF. \n\n**It's close off the Bart -- whether it be Montgomery or Powell station\n**So convenient that SBUX now has free WiFi\n**The bathrooms are well maintained here, and clean! (Bonus - - clean bathrooms on Market St.!!)\n**The staff has always been friendly. \n**Love using my Gold Card here for free drinks\n**Plenty of outlets in the sitting area to charge all my gadgets\n**It's close to my Starwood Row of hotels\n\nThanks SBUX!", "author": "Jessica A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-27", "description": "This is my favorite go to Starbucks in downtown! Everyone here is very nice and friendly. I used to come here 5 times a week for my regular morning coffee run. Now that I'm working somewhere else, it's not as convenient for me, but I do stop here if I get to Downtown early. They have lots of seating area with free wifi.\n\nDominique is the friendliest and nicest briasta I've met! He remembers your name and your usual order. He really knows how to make you feel welcome and comfortable. Way to kick off my morning!! \n\nI wish all starbucks offer the same experience....", "author": "Jenny G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-21", "description": "One of the bigger Starbucks in the area. Clean and the baristas were very friendly. Also this place has TWO bathrooms! One of men and one for women. NICE! A key code is necessary. Free wifi like all the Starbucks.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "This starbucks location is actually pretty good. It's located right near the montgomery station and market. There's always a crazy morning rush that lasts until like noon-ish. \n\nThe coffee's alright and the customer service is pretty good. I wish they were a bit more efficient and quicker like other locations.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-24", "description": "Least fave at night, but probably better during the day.\n\nGrabbed a double cap after the MOMA visit because I had Osha Thai for dinner and the starchy richness of it all had begun to sink into my conscious.\n\nThe barista was cool and made my cap extra hot.  I gave a dollar for the Giants tip box, one for the contending team.\n\nCushions and sofa seating comfortable, although at night, the element became a little iffy.", "author": "Miika M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-21", "description": "This starbucks gets a big high five from me! We happened to have lunch nearby and popped in for a quick afternoon pick me up. \n\nAside from patient barista (didn't rush me when I was pondering over what to order and didn't mind when I made a change to my order AFTER he had written it down on the cup), he was also so friendly and fun! I was fighting with my friend about who gets to pay for the drinks, and he confiscated both of our cards/cash out of our hands and pulls out a quarter: heads/tails. After he took our $5 bill as payment, he did a little magic trick for us (it was actually really cool!).\n\nSuch outstanding service, I really wish I had gotten his name! Thanks for the fun afternoon break.", "author": "Stella C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-11", "description": "This is best Starbucks cafe that I have been to.  There is a clover machine!  Also, they allow you to select any type of bean that the store carries to brew in the Clover.\n\nThe place has many tables including their purple velvet  chairs.\nWith many options and a lot of space, you can't go wrong by coming here.  \n\nDon't worry about long lineups, the barristas are fairly quick.", "author": "Spiro P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-25", "description": "This use to be my stop before going into work, but the service has really gone down hill. One of the last times I went, my order didn't get placed correctly. I waited 15 minutes for a breakfast sandwich and when I inquired about where it was from the Batista working the bar, he was very rude and told me to keep waiting. I did and inquired again after a while longer. He told me they were very bust so to just keep waiting. Another employee over heard the conversation and went to look. Turns out, my order didn't get placed. Would have figured that out if he would have looked the first time. \nI went back today after months of not going in, and sure enough the same rude employee was working the register. They were brewing more Pike drip coffee(which is what I ordered.) Instead of telling me it'll be a few minutes while they brew and giving me the option of another blend, he was almost forceful that I take the other coffee, and when I told him I'd wait, he insisted I take something else because it would take 5 minutes to brew. I again told him I'd wait. Not sure why I kept having to tell him that. \nThe rest of the staff is very nice and accommodating. Smiles all around, which is why I don't understand why they have this guy working there. He's not a people person, which is fine, but he shouldn't be working directly with people then.", "author": "Erin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-26", "description": "Terrible service. Right I got to the register, the bartista freaking ignored me like I was an invisible wall. Seriously!? I was wearing bright purple that day too! I asked for ice water and 2 minutes later of ignoring me, he finally said \"Oh it's over there\". REALLY!? \n\nLuckily I don't life in SF, never going back to that starbucks.", "author": "Jade F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-10", "description": "I'm rating yet another Starbucks... yes, I know you're probably questioning why, but this one really impressed me. Even more so than the one I normally go to on Polk street (as it's close to where I live).\n\nI was in the area getting lunch with a friend nearby, and had to work directly afterward so I popped into this Starbucks randomly as I knew Starbucks offered free wifi, and I could use a caffe mocha.\n\nI walked in and this Starbucks was pretty huge. The lighting was great, and there were quite a few spots to sit... WITH outlets! Perfect! The staff was friendly, smiley, and personable. The crowd was a nice of mix of people keeping busy and to themselves. The only complaint I'd have about this place is that they music is a little on the loud side, though nice, and easy to tune out. I had my headphones so I wasn't bothered one bit.\n\nI'd work from here more if I lived closer, but I'll choose this Starbucks every time I'm in the area.", "author": "Ashley D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-04", "description": "One of the few places to sip on Clover Machine coffee, though some of the baristas make it better than others and seating is at a premium.  You'll still find me here enjoying a cup.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-01", "description": "Just a good Starbucks - close to the Westin.", "author": "Patrick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "This is my favorite downtown Starbuck's location. There are a few Starbuck's that could be considered on my way or the closest to my office, but this location wins me over with their consistent customer service. They literally make my morning with their cheerfulness. I can't imagine how many people go through this location every morning in the FiDi and yet they always remembering me (I don't even go there once a week necessarily)! How is that even possible? Because they are the nicest! The gay baristas are seriously the best and brighten my day instantly when I hear, \"Amanda, love!\" and they hand me my drink and then tell me something else sweet about having a good day. How can you not feel loved? They are the best and my Soy Chai is always perfect.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-06", "description": "I generally like starbucks and did not think that they can screw up coffee.  But this place reeks.  Bad coffee.", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-08", "description": "Staff was super friendly & efficient but the place was a mess as was the restroom.  It was Sunday ~1pm, not esp busy but the tables & counters were dirty / sticky and floor was littered with trash. :'(\n\nWe purchased our drinks and left, not a place to linger.", "author": "Robert K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-21", "description": "All other things (service, menu, etc.) being equal, there are four benchmarks I use to grade a Starbucks:\n\n(1) Floor layout/Number of tables;\n(2) General probability of an available table;\n(3) Availability/number of electrical sockets for laptops/cell phone chargers;\n(4) Cleanliness of the bathroom.\n\nThe ladies bathroom here is consistently clean; there are plugs under the benches lining the left wall; usually there are tables to be had (only once out of many times was I SOL); the layout is not too cluttered; there's a greater than average number of chairs/tables at this Starbucks.\n\nMy #1 study starbucks in SOMA/financial district.", "author": "Brianna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "Why this Starbucks is awesome:\nFree unlimited wifi\nplenty of seats (tho can get crowded)\nBATHROOM (pretty clean at that)\nSells fruits & sandwiches\n\nThere are a row of plugs for your electronics along the bottom of the booths.  The crowds mostly professionals though you do get a few interesting characters. Overall pretty comfortable and cozy to spend an afternoon in.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "Literally the NICEST people. They all know my order, get it to me quickly and wish me a good day. Perfect pick-me-up on those rough Monday mornings!", "author": "Lauren G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-18", "description": "There's a Peet's Coffee down the street with substantially better coffee, but the service is good and the location has enough space to sit down, get some work done or just chat with some friends over scones.", "author": "Caro D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-07", "description": "Been going to various Starbucks and Peets around SF and Sac to try one thing--the Peppermint Hot Chocolate. \n\nI've tried this location twice due to it's convenience near the bus lines.\nThe verdict: too much chocolate and not enough peppermint.\n\nOn another occasion, came here to get a cup of warm peppermint milk.... what the heck milk cost more money than hot chocolate (which contains milk) O_O when I was in Sac last week, milk was a lot cheaper.", "author": "Natalie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-06", "description": "Came here on a morning and ordered a tall ice tea sweetened shaken with ice but no ice in the cup. The guy even told the girl shake the tea and then pour it without the ice, not that hard right, I'm not even picky I don't ask for 3 pumps this, 10 grams extra w/e nothing, simple. It started to get busy and she called my drink and what is in it ice. I say \"uh excuse me can u make it cold but no ice please?\" she nods and does it again, and gives me the tea and again with ice!!! at this point I get angry and tell the guy is she stupid or is she asleep i simply asked for it to be cold and strain out ice how hard is that? the guy apologizes and makes my drink again. Finally it comes but then no sweetner! I tell the girl (the guy has to get back to the line) that I want sweetner. She takes it put sweetner and ice back. Its the 4th time and my drink is not right. I tell the guy my order again and only on the 5th try is it right. I didn't ask for a complicated drink its simple make it cold and hold the ice. The girl was sleep walking because she made all the wrong drinks and more people were frustrated. If you don't want the morning shift call in sick or be asked to re-scheduled or money is going down the drain!", "author": "Priya U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-18", "description": "I am lactose intolerant and bad things happen when I have dairy. I really mean BAD!  This location is probably the only place where they don't make a white chocolate mocha with soy taste like a sweet mess of crap. The other locations seem to make my soy mochas too sweet and I still have the urge to run to the bathroom afterwards. \n\nThis location is one of the biggest in San Francisco. It has tons of seating with couches and tables. They also offer all of the baked goods and breakfast foods. That's right.  You can get those yummy breakfast sandwiches here. They're still hot and toasty by the time I get to work. \n\nThe service is always great here, too. Too bad there are a couple Starbucks closer to my work than this one. But maybe I should just walk my lazy ass over there.  My butt will thank me for it!", "author": "Lisa X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "I'm a customer at the Starbucks on 3rd Street and I just wanted to say that every single person staffed at this location is amazing. I've been coming to this Starbucks for about a year now and compare it to other Starbucks that I frequent on the weekends when I'm not at work and none of them compare to the one on 3rd. The minute I walk in you can feel the positive energy, everyone knows my name and everyone is always in a great mood! I recently when on YELP to write a review and before I could start, I found myself reading all the other wonderful reviews people shared about this Starbucks. I just wanted to thank everyone on 3rd and Market for making my mornings great and always putting a smile on my face! You are ALL an awesome TEAM!", "author": "Yoyo F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "Big location. Gotta get here before the morning rush or after lunch.", "author": "Brent A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "this is a definitely a solid starbucks. they make a HUGE effort to remember your name after only 3-4 times. only problem is i like to switch things up so when they guess my order it's usually wrong...but not their fault ;)\n\ncome early as they run out of breakfast sandwiches.....damn tourists....!!!!", "author": "J S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "I've been hitting this place in the mornings because it's right on the way to work. By the second day the cashier was remembering my drink order. On the third day he encouraged me to bring my receipt back after 2pm for some promotion. \n\nSeems to be all guys working there - the straight ones are really friendly without being overly fake and perky and the gay ones are all \"here's your drink honey, have a sparkly day.\" \n\nI thought it'd have a very touristy vibe since it's right at Market St. and near hotels, but aside from some people having suitcases, it's cool.", "author": "Green Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-19", "description": "O.k.... so its Starbucks and not very unique or a new discovery or anything like that...but, I wanted to pass on the 411. \n\nOn my way to Herman Plaza early in the morning for the Zip Line, which I missed, Boo.. \nBut anyhow, making my way to the plaza from the cal-train and its EARLY.. so I am in need for coffee jolt! Plus I need to use the little girls room, like ASAP. \nSee the Starbucks and perfect I can kill two birds with one stone... \nSo I'm in and there is this password locked pad and I get it SF has a lot of loafers... but it is a tourist bound area and I mean its Starbucks\". \n\nIts busy, its morning... everyone wants coffee and I'm doing the potty dance... so I get the attention of the barista and ask for the code, he looks at me like *blink, blink* it's for customers.. \nAre you kidding, I know I look like I took a freaking shower this morning. Plus how do you know I am not a customer are you working the register.. I'm lucky I even got him to make eye contact with me.. \n\nSo I'm like yeah and, he gives me the code \"WHICH IS 90210\" for anyone one else in the area who happens to go... \n\nThen, to top it off! For being so early and for a locked password required bathroom, it was not a pretty sight.. \nI practically had to sanitize the whole dam thing.... whatever, I did buy coffee. \nThe cashier was friendly, the coffee was made well and timely... \n\nBut ugg.. really unfriendly barista...lame.", "author": "Summer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "My Favorite Girlfriend's favorite Starbucks.  \n\nWalk into a quiet zone right on the main artery to the Financial District.  There are tables and chairs, cafe style, near the front door.  Comfy lounge chairs, sofas, and coffee tables by the giant picture windows on 3rd Street.  Some more private seating back behind the bar area, and bar seating where you can watch the baristas as well.  \n\nI waited a few minutes for a lounge chair, and then, with a tall nonfat latte, took advantage of the serene setting to write my love note commemorating our 7th Anniversary.  \n\nYes, it's official.  I have become monogamous.  And that, it turns out, is a very good thing.  Over the years, My Lady has become The One for me.\n\n---------------\nP.S. I originally misfiled this at the 201 3rd St. location.  Yes, I was that far in the clouds that day.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-23", "description": "Ugh.\n\nI think I understand addiction. I haven't really ever had a real understanding of it until today. Sure I watch Intervention and have learned that heroin isn't a very good idea. I've learned that popping excessive amounts of pills is probably not on the top of the brilliant idea pile, but I must have missed the episode on COFFEE ADDICTION!!\n\nAs you can see from some of my other coffee place reviews, I've fought this thing like the plague. I didn't want to get sucked into the caffeine ups and downs. I didn't want to spend $5 each morning for a drink that takes 5 words to order. And I definitely didn't want to get to the point where my foot is tapping uncontrollably, I am typing faster than 120 wpm and I am ready to do a cartwheel in a dress in the middle of my office.\n\nHow is this shit legal? It shouldn't be! \n\nI guess I should have listened to Nancy Regan back in the day and learned to just say no. All I ask now is, when you see me on the corner of Third and Market in a short skirt and a nappy weave, mainlining coffee whilst offering to perform lude sexual acts in exchange for a Starbucks Venti Iced Vanilla Soy Latte, that you will be gentle. I never should have taken that first sip.", "author": "Stephy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-02", "description": "This Starbucks is better than most because it's full of comfy chairs.\n\nHOWEVER: I came in here at approximately 11 am on December 2 (a Saturday) and ALL of the comfy chairs were occupied by middle-aged women wearing Christmas sweaters, each passed out amid her own sea of shopping bags. I mean, like drank-yourself-into-a-stupor, snoring-in-the-back-seat-of-your-friends-car passed out. \n\nLadies! There are 37 more hours in the weekend! And 24 shopping days until Christmas! Please, pace yourselves.", "author": "Liz G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-05", "description": "This Starbucks is one of those slow ones when it comes to having coffee. They are almost always short-staffed in the mornings. Heating up the sandwiches is always way faster and by the time you get the coffee, breakfast is cooled down already.\n\nStill prefer Peet's coffee but the service is even slower.", "author": "T L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-26", "description": "Ruby!  The manager and the baristas are super sweet here.  As a former customer of the week, I have to say that this is the best Starbucks location I have ever been to.  They would always get my latte (nonfat, sugar free vanilla) right.  Sometimes I would go down to the King St. location to get one of their fabulous breakfast sandwiches and they would mess up my drink (thus ruining the rest of my day).  \n\nThe extra stars are for customer service.  They used to make my drink as soon as I walked in - I didn't have to ask.  They cheered me up when I felt down.  We chatted and bonded.  \n\nThis is a smaller location (and no breakfast sandwiches) but they keep it cozy and friendly and they have the best baristas.  Daniel (a barista) is also a talented photographer and they display his work there.  They also have fun events like water balloon fights.  Ruby and her team go above and beyond.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-28", "description": "Manager JD and his team of baristas are the BEST!!! These guys are on it. I've been a regular customer here for awhile, and I've always felt that the group here worked very well with one another. They always have a constant flow going and are making sure that the customer's order is in and then ready to go asap. \n\nJust remember- when you come here, you are in the heart of a tourist city. Be a bit patient since there could be a tourist trying to order one of their fabulous Clover brewed coffees or a cappuccino and counting out USD for the first time. Even then~  one of their baristas will probably step in to get us regulars in and out fast as possible. Love them!", "author": "Rie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-18", "description": "Just this week, I switched up my routine en route to the office from the bus stop, now passing this Starbuck's instead of Peet's.  The folks behind the counter are  pleased to be at work and actually want to serve me.  I get my grande coffee so fast (granted it's not that complicated) - say \"thanks so much,\" and smile and they actually  smile back and say \"have a great day.\"  What a glorious exchange for 8 in the morning....love starting my day here.\n\nAlso, a large comfy space if meeting someone in the area to catch up.  Hard to find around these parts.", "author": "Catherine B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-07", "description": "I can cope with the over priced food and drinks but it is REALLY REALLY cold in all of the Starbucks to the point where it is very uncomfortable. I am in one right now and freezing. Turn the damn heat on... I will not be coming back to one anymore.", "author": "drew c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-24", "description": "Wah wah wah.  No one wants to admit that they like Starbucks cuz it ain't cool.  It ain't all hipster n shit.  Well, I guess the original jessica m. isn't cool.  I isn't all hipster.  I drink my delicious coffee from Starbucks at the lovely Sculpturesite location 4/7 days a week.  Sometimes, I even get a sandwich.  Bite me.\n\nOh.  And the baristas are my dawgs.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "I know.... it's a Starbucks but, they have the Clover Machine here... it is supposedly will save Starbucks.\nThey also have limited run, Indonesian beans.\nRight now, my favorite is the Bali Batur. YUM!\nLove the rich dense smoke and chocolate flavor\n\nOn the way to work, I saw that at Pete's 4th@Mission, they are pushing their Sumatra Blue!", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-23", "description": "Starbucks in SoMa.\n\nOpen\n24Hours.\nI wish there were more things open late. It is rough finding things if you work late.", "author": "Brendan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-06", "description": "Our firm doesn't provide coffee for us, and I am usually too late to run to Peet's (ALWAYS preferred over SB) so I have taken to frequenting this place recently.\n\nTheir coffee is what you'd expect, I get the drip and it's just fine. \n\nWhat I do appreciate is their method of managing all the Jane Q. Conventioners and the John Q. Tourists, both of whom apparently only frequent coffee shops with a drive through because they have to have their hand held anytime the line is longer than 4 people.\n\nBut this 'Bucks is somehow able to efficiently and regularly get me in and out in a reasonable amount of time.\n\nThat and drip that is just fine keeps me coming back.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-09", "description": "The staff is friendly enough. They always get my order right, which is more than I can say about a certain neighboring Starbucks. But honestly, I shouldn't have to wait ten minutes to get my drink.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-04", "description": "After spending time in SFMOMA I was thirsty as we headed up to Market to catch a bus to our next destination for the day I see Starbucks, and decide right than and there that I needed a Venti 3 pump classic shaken green tea.  Rarely do I get a Starbucks that can do it right, for some reason the 3 pumps and shaken part are kind of hard for some.  Guess what this Starbucks was successful in making my Venti 3 pump classic shaken green tea for me!  They also had friendly service, a lot of seating and a clean ladies room.", "author": "Me H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-01", "description": "The staff is AWESOME but...I go in there every week after 9:30 and they are always out of the breakfast wraps, so I leave and go get the breakfast sandwich at Subway.  I would think that after like 10 times the manager would simply order more each day.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "Pretty good for a starbucks.  Nice layout, chair zone is in its own little world away from the action.  Electronic bathroom keypad system.  T-mobile signal is a little weak.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-04", "description": "Well, they have a Clover coffee machine now, so that is something. A small (oh, sorry, TALL) cup costs $3-$4 dollars, and it still tastes like coffee. But, at least you get a little song and dance with your cup.", "author": "Tom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "Good staff! Some of the new baristas aren't as friendly, but I don't expect much! Other than that, they're pretty quick to get my order because it's mostly busy in there, like every Market street Starbucks!", "author": "braydon a."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-24", "description": "Oh Starbucks. It's been a long and winding road and you used to deliver some great customer service. Unfortunately, nowadays the great customer service is hit or miss. So, we spot this Starbucks location with a \"Yes! Coffee!\" sigh of relief. The 2 associates were cleaning up but there were people studying so I asked if they were still open. The female associate looks at me highly annoyed and says \"Well, yeah, but only for like 20 minutes, so, like, were pretty much closing up.\" Okay, I used to work in the food and beverage industry for many, many years and 20 minutes to closing means, expect a few more customers before closing. 20 minutes is plenty of time to make me my freaking latte, bitch.  So she just stared at us and I said \"OK, well, I don't want to bother you so can I just use the restroom?\" and she was like \"Sure\" and continued cleaning. But my friend, bless her soul, waited til I got out of the restroom and then ordered some damn coffee! Ha ha! They were SO so irritated, so rude and I wish this wasn't so because I really like this location. Luckily, there isn't a shortage of coffee shops in the city. But shame on you closing crew at this location! Rude!!", "author": "Heather B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-08", "description": "They know my name.  They know I can't resist turkey bacon.  They haunt my dreams...", "author": "Corrie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-12", "description": "With a Starbucks literally on ever corner down here, this one is by far my favorite. Merely because, unlike the others, it has seating. Lots of comfortable seating so one can enjoy their drink inside with a book, knitting, or some friends.", "author": "Lizzie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-31", "description": "you know you suck when McD's beats you in the best coffee catogory.\n\nthey better add something else thats new... the sandwiches wont save them and there coffee is only good when no one else is available.\n\nwhere is Java Detour or Intelliegencia coffee?", "author": "rasaka s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-20", "description": "I usually go to the much busier, but much faster (and accurate) Starbucks on Montgomery.  I did stop today at this Starbucks to grab a morning bun and chai latte.  After waiting quite a long time and watching others pick up orders placed after mine, I went back to the cashier and said my chai had not come up yet.  He grabbed a cup and wrote my name on it and called it as a 'missed' order to the barista.  I then heard the barista call out to the cashiers to write the customer's name on the cups.  Then the barista continued to make drink after drink but not my chai.  I had been in the store for almost 15 minutes, and went back to the cashier and said I had to leave and walked out the door.  I called on the phone about an hour later and they will be nice enough to give me a chai tomorrow.  But I have come to expect fast and accurate service from my other Starbucks.  Oh, and I asked for my  morning bun NOT heated up, and it was heated up.  0 for 2.", "author": "George R."}
