{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Very popular Starbucks located more in the central part of the Mission District, so it's primarily bordered by residential buildings, some office buildings, etc. Very quiet and clean in this area. This location has a large interior, with plentiful seating, including two large tables (one in the back near the bathrooms, and one up front). They are also pretty quick about mobile orders, though again, it depends on how busy they are.\n\nBathrooms require a code, so ask a barista if you need to use it. Free Wifi was pretty stable, so this could be a good spot to get some work done. Overall, there's a lot foot traffic that comes through here, but not that many people stick around in the store for too (or if they do, they're doing work alone), so it was pretty quiet. There's also a bench out front should the sun decide to show itself :D", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-12", "description": "The evening crew needs to never come back. Starbucks just hires anybody nowadays. Some people don't need to be in customer service. Usually it's just one person, but the whole evening staff needs coffee themselves. \n\nI ordered a salted cream cold brew through mobile order. You can say that a cup full of dirt and water would be the same thing. And when I politely asked if there was any salted cream in my cup, the barista responded with so much attitude that I almost rolled my eyes so hard that I was looking at my own brain. \n\nThe other worker who was changing the trash just kept on ranting about hating making frappuccinos really loud. Announce it to the whole store already. You knew, before taking the job, that frappuccinos are THAT drink.\n\nI also was observing how the cashier interacted with customers. \n\nCashier: \"What do you want?\" with the same crappy attitude as Ms. Mobile Order Sunshine.\n\nGet a new job. It's obvious y'all would rather sit in the corner and stare at a wall. I'm pretty sure I won't be coming back here.", "author": "Ro R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "This Starbucks is huge they have so many seats and tables holy shit lol and the staff is good too moving fast like a cheetah in the Sahara dessert looking for a deer to eat", "author": "Marc T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "Horrible and slow!  After waiting for my drink, I never got it and asked for my money back.  They stand around and watch each other, versus dive in and help each other make drinks.  Never again.  My drink was not in line because the \"paper ran out\".  HUMmmmm.... maybe write it on the cup instead and put it in line?", "author": "Aj C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-18", "description": "So spacious! There's so many tables and I'm loving the high ceiling and super chill vibe. However, this location does feel really far from everything else and I wouldn't ever come if I didn't have a car.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "The team at this Starbucks are the best.  They always make you feel welcome.  They are consistently fast, professional and friendly.  Britni, Luis, Irish, etc..   They are so sweet and accommodating.  They make you feel like family and they always get my drink right regardless of how high maintenance my order is.   They practically start making my favorite drink when I walk through the door but, of course, wait to see if I want something new or different.", "author": "Ashley Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-08", "description": "This is my 5th time of this place getting my order all the way wrong! How hard is it to read an order with no extras or changes?! I tried to give them the benefit of the doubt but no more.", "author": "Ameerah A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-24", "description": "Almost every time i go to this location,, I always get a slow barista. I placed a mobile order and every customer in line when i walked in was served,, and two people were given bathroom code, which required multiple retelling. And two people were given precise directions to the bus. I inquired where is my espresso, which is the easiest and quickest drink to make all you do is push a button. The barista look weak and started making a new order that just came in. Removing this shop from my list of favorites", "author": "Michael B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "So friendly here! Great spot for lounging as there are sooo many chairs and tables. The tiny girl with the glasses at the register was sooo efficient and sooo friendly. I think her name was Tina. My new favorite Starbucks", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-20", "description": "Treated so poorly by employees. Made a simple order, salted caramel mocha. Yes I'm aware this drink is no longer available but still can be made without the salt. Toffee nut. Mocha. And caramel. The girl taking my order was so rude when  she reminded me there was no more salt,  and seemed annoyed when I wanted extra Frap roast.  \n\nThe girl making my drinking could not read my order with sloppy handwriting on the cup. She yelled at her fellow coworker. Coworker could not hear her so she yelled my name out and rudely asked, \"what do you want?!? What does this say?!?!\"   \n\nAnyway, Starbucks please bring back salted caramel mocha but without salt so they can quit telling me that there is no salt available.  \n\nBig, cozy starbucks. Poor employee choices.", "author": "Shanny A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-11", "description": "This Starbucks is a great location for lounging or doing work because it has a wide open space with a bunch of seats and tables but I must say the service is horrible. I come pretty often for a quick pick me up, and every time, I feel like I'm met with rude baristas who are so nonchalant about everything. I never felt the need to write a review for something as common as Starbucks, but this time I just wanted to express my experience. The last time I came here, they forgot to make one of my drinks, after I told them that they did, they didn't even apologize that they forgot. I came here again today and ordered a Green Tea Latte. It was filled with HALF foam so I basically got like 8oz of latte. I didn't want to ask the barista to change it because she seemed super busy. There was only 1 girl making the drinks while the other employees were talking to each other in the other corner. I asked her for a cup holder and she called to the other employees  and weren't even listening to her. I waited for 5-7 more minutes and then the girl saw I still didn't have the cupholder and had to get it herself. THEY NEED TO WORK ON THEIR TEAM WORK SKILLS.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "This place is a trip.. I've come at several different times of the day. My most recent trip was early in the morning, i needed my cup of coffee on my way to work. I get my coffee, fine, no problem. I go to the condiment bar to pour my half & half and both containers are empty. With 6 people standing behind the counter, I asked three times and the barista asks the other 5 workers standing around talking to refill the condiment bar.. and they act like they don't hear her.. almost 5 minutes later they finally go to the back to refill the half and half.  Most of these workers are lazy. I guess they need to understand that yes, you people are at work, but others gotta get to work too. A simply cup of pike shouldn't take me 10 mins to get. \n\nThree other times I've gone to visit with my daughter and they are always out of certain ingredients. \n\nFrom now on, I will be going to peets coffee or even a mom and pop coffee shop which is closer to my job. I'm not going to miss coming here.", "author": "Christie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Take away my hipster credentials, I don't care anyway! While my other favorite coffee spots in SF are Sightglass and Four Barrel, sometimes I just want a peppermint mocha with a f^ck ton of whip cream, free wifi, and no one giving me the stank eye for grading papers for 3 hours. \n\nThe folks working at this Starbucks are really truly awesome - they are super kind to the wide variety of people who hang out at this location (sometimes all day) while also catering to those of us who have a crazy list of drink specifications. As a result, this Starbucks ironically feels more like \"the people's coffee shop\" than any of the hipster spots nearby.", "author": "Jean L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-08", "description": "Poor customer service \n\nThis Starbucks is convenient with nice amount of space, but the staff consistently get orders wrong (handing a customer a sandwich labeled no cheese that clearly has cheese on it), don't do quality control, and don't communicate clearly to customers. When a customer asks what a product is, the reply should be clear and helpful, not muttered quickly as if they don't care. Hint: You're trying to sell products.", "author": "Nik S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "I placed an order with my mobile app at about 7:59 pm today, and got to the store at 8:05pm.  All of the doors locked, but people were inside cleaning.  I tried to let the employees know I placed an order with my app, and would like to, either get my drinks or refund.  After 10 mins of trying, a very rude employee came to the window and told us they were closed.  I showed her my app order and she started typing  me a message on her phone...  the message basically said 'go to another store to pick them up.'  Really?  I said how?  She then screamed behind the window and said 'you know how to read?'...  that really ticked me off.  (What???  Because I am Asian???)\n\nBottom line: things happen, but all you have to do is be nice and apologetic...  and a refund of course.  And that's all I expect for many years of paying expensive coffee.\n\nI have attached 3 pictures...  1). Store hours on the app, 2).  My order, and 3).  The rude person that works inside this store.", "author": "Benny T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-11", "description": "I was expecting bether customer service from this particular Starbucks, but i faced a very bad service. At aproxmatlly 5:15am or 5:20 am Wednesday 04/11/18 i came to the cashier. Wanted to get my everyday usual venti Dark roast for the past 10 years, the girl cashier first of all with no smile or not even a little friendly face greeting not even facking it give me the coffee. I used my Chase Nank card unfortunately my Card was declined.i apologized to her i was very embarrassed allready. I come to this Starbucks almost 4 to 5 days a week they know me i work for the Department of Public Health. They see my badge. Guess what she did to my coffee? She poured the coffee in thr sink and i apologized to her again and i asked her for hot water.\n\nQuestion for everyone who is reading this? What would you do in this situation?\n\nThank you", "author": "Obaid G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Greatest SB IN SF! Big and open lots of windows and cozy seating A+ as far as Starbucks goes!", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-13", "description": "The staf is friendly. The place is clean. I like the hot chocolate with coconut milk.", "author": "Yovana M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "I'm so happy there's also a local Starbucks my new job. I love Blue Bottle and Coffee Bar, but sometimes a girl also wants to go somewhere with a rewards program!\n\nThere's still a small rush of people during peak morning hours (around 9-10AM), but I never had to wait more than 10 minutes for my order. This was a positive change from my main Starbucks when I was working in downtown SF. The baristas here are very friendly and accommodating -- once I ordered a cold brew and they ran out, so the barista offered to put a free shot of espresso into a regular iced coffee. Great customer service!\n\nThe big plus of this specific location is the entire building -- there are so many plush chairs, bars, stools/chairs, and outlets. It's a prime location for workers and students to get work done for awhile. Sometimes I come and sit here during breaks from work.\n\nThe only improvement I would suggest is that they monitor the restroom better. I have seen the toilet clogged more than once and some homeless people use the sinks to wash off. Just be aware when you use the restroom!\n\nI see myself being a frequent visitor here to maintain my Gold Status with SBUX :)", "author": "Bonnie Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "I had a long, hard day at work and went to this Starbuck's to treat myself to a frappuchino. The girl at the register was brand new, because she was flustered and confused-so I was very patient. I ordered my an additional shot to be blended into my frappuchino and she could not find the button to push to add the cost to my order. Instead of asking for help from another employee, she tried to talk me out of getting an additional shot added to my drink. When she saw I was not going to change my mind, she then asked for help. She looked teary eyed and I did feel bad for her. The manager took her into the backroom. Another lady took over the register and one person was making the drinks. There was a long line and alot of people waiting for their drinks. I waited and waited and waited for my drink. As I waited, the manager emerged from the back room and the new girl resumed her duties on the register. The manager and the previous woman on the register proceeded to casually fill napkins and add straws--they were taking their sweet time oblivious to the long line and backlog of people waiting for their drinks. I was watching the Barista make mine and he did not add my shot. Since I paid .90 cents extra for the shot- I do expect it to be added to my drink. I asked him for my shot and he was so confused. He looked at the order sticker on my cup where it states additional shot and he was like \"oh ok\". It took almost 15 minutes to get my drink.", "author": "alexandria s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "I've been a patron of this sbux for about ten years as it's the closest one to my office. Until recently it's always been pretty good, with the exception of unreliable wifi (which is really unacceptable in this day and age) and the liberal sprinkling of crazy and/or homeless people who populate it.  \nHowever, I've run afoul of a female shift manager who seems to get moist engaging in petty power plays.  She has made a point to bust my chops over ordering a solo espresso in a 12 oz. cup and asking for whole milk to be added, up to about 3/4 full.  She insists that since it's \"more than 4 oz. of milk\" I must pay for a latte.  She's taken up this silly crusade after I've been ordering the same drink almost every weekday for ten years.  \nI contacted the corporate headquarters, was credited with ten dollars for my trouble, and assured by them, in writing, that she is wrong to do this.  As she continues to be like a dog with a bone, I've shown her the emails, but she insists she has discussed it with the district manager.  \nLast week, I actually spoke with him, as he was in the store.  He told me to my face that she is wrong, so I figured, problem solved.  \nAu contraire.  Today, I was there again and a different barista made an issue of it.  She specifically stated that \"Elisha\", the manager, made this point. \nNow, all this drama is over about 10 to 15 cents worth of milk, AND, as I've pointed out to Elisha, I can just order the espresso, skip the milk and use half and half, which they have on the condiment bar, AND WHICH COSTS THEM MORE THAN REGULAR MILK.  She acknowledged this, but her power trip won't allow her to use basic common sense.\nIf Sbux has this type of anal retentive person as a manager, it should really send her to training on how to treat customers.  She is essentially calling paying customers thieves.  \nPerhaps Elisha should spend more energy trying to stop the people who walk in, steal bags of coffee and walk out.  \nI'll keep going, because it's convenient, and I'll just use half and half instead of milk.  I'm sure Howard Schultz would be pleased at how this store is run.", "author": "Baba D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-29", "description": "The only thing that place has going for it is space, there's lots of it, and location down the street from KQED and downstairs from BAVC otherwise, it's like a high school cafeteria with an obligatory clique of teen girls \"working\" there. It's consistently dirty with enough staff to clean. They lack the most basic customer service.\n\nI'd rather use a robot or a kiosk they're so lofty there that they don't even say thank you when you put money in their tip jar. Don't worry in years these sorts of jobs will be obsolete hastened by the lack of customers like me.", "author": "SF T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "Great Customer Service! Big Place to relax with a cup of coffee or just have it to go as i always do. Claudia always helps me out with my drink which already remembers. She is so efficient and polite.  I'm so grateful to be served by nice people like her. Highly recommend this location!", "author": "Ingrid A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "Starbucks in the Mission. McDonalds in Paris. Amazon Prime in Rome. \n\nYou computer people know that the food you get here is not real food don't you? Did your overpaid parents teach you that? It comes in CE labeled little plastic bags that they microwave JUST LIKE DUNKIN DONUTS.\n\nThere are traditions of coffee from Mexico, Eritrea. There are macchiatos where they don't dump in a gallon of milk but make real macchiatos like in Europe in a small cup. But noooo. Jam a place like this in SF and kill off 12 local businesses.", "author": "Tom K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "This is my neighborhood Starbucks and they always provide excellent service here. The baristas are always so nice and they always try to put a smile on all customers face. \n\nThe atmosphere and location is pretty awesome too. There's plenty of tables for you to sit and enjoy your coffee. There's individual seats/couches as well! \n\nThe quality of coffee made here compared to other Starbucks by far is much better and consistent. Most places the quality of their drinks very from time to time however this place is always consistent. \n\nOne of the better Starbucks in the city so check them out.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "Dirty restroom with no paper of any kind every day!.\n\nNo vanilla, nutmeg, or chocolate for coffee offered.\n\nStaff mediocre on good days.\n\nGreat parking though", "author": "Craig B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "I come to this starbucks location all the time as it is close to home.  Guillermo \"memo\" always helps me out and does a great job making my complicated venti coffee. Thank you!", "author": "Claudia V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Pros:\n-lots of seats\n-short wait time \n-nice ambiance\n-friendly staff\n\nCons:\n-could be cleaner\n\n9:02 am", "author": "Tonirose B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-18", "description": "It shouldn't say open store hours 4:30 am if it's not going to be open at that time! I got up early to be able to make it here before work got there and it's CLOSED I waited a few minutes keep in mind i got there around 4:40 I seen a few people inside but NOPE store remained CLOSED!", "author": "Jairo E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-30", "description": "Ordered an iced green tea latte and had an inch of foam on top . Not worth it to come to this location.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "11/07/2014:\n\n- Clean spacious coffee shop\n- Friendly staff members\n- Good service and location*\n*It's located conveniently below Bay Area Video Coalition and across the street from KQED television station as well as a MUNI bus yard facility.\n\nSeating is available inside and outside. Free Wi-Fi and the signal is very clear. There was a line with 3-4 patrons when I walked in, but it moved quick. Lines aren't super long which is also another good thing. Overall, positive first experience here.\n\n*Holiday themed beverages and cups are back by popular demands. Just in time for the start of and to brighten up the holiday season. Starbucks Coffee gets major bonus points for being one of the coffee shops integrating holiday themed beverages. That's the holiday spirit!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Good Starbucks. Enormous dining area. Fast friendly service. Relatively clean, but could do better. Bathroom was okay. Curbside parking only, but at 1300 on a Sunday I had no trouble finding a spot. Neighborhood is a bit Shady.", "author": "scott h."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "It's supposed to close at 9pm ... but at 730pm, they close the food\n\nAnd at 8pm, open the doors to allow open air to blast in, and bring in outside tables.", "author": "mario c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "When it comes to chains, I try to do the rating based on the specific location, and this one was just OK. But don't worry, in terms of getting your coffee fix, this place will do just fine.\n\nThe good: wifi was fast enough for me to watch some tv on demand which is always a plus. I happened to be in the area and needed to kill an hour. The seating is also plentiful and rather uniquely shaped to take advantage of space. While I think it allows a lot more seating, it also makes it very easy for someone to look over your shoulder. So if you're the type of person bothered by that, this might not be the place for you. \n\nThe bad: I had to wait quite a bit considering they had 4-5 baristas. Granted I didn't see anyone just standing around, but I thought they'd at least have more than 1 person taking orders given the line. Tables were a little dirty leaving some of them unusable until someone cleaned it up, but again since they had so many this wasn't a huge issue. Also, parking is kind of a pain. Granted, it's San Francisco so Parking is a pain everywhere. But with only street Parking it can be difficult to find a spot\n\nTLDR: pretty standard starbucks.", "author": "Chad Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "I love the baristas here. They're friendly and the service is great. I love the overall atmosphere, and I usually come here on weekend mornings to focus.\n\nMy only reservation is that the wifi here is incredibly slow. Even for browsing and checking emails, it's just noticeably slow.", "author": "Raakin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "I go here almost every day because I work close by and my coworker loves their fraps. Everytime I go here, they would always mess up our order and my coworker is lactose intolerant. We don't order soy or coconut milk to be a hipster SF person, we really can't drink animal milk. There are times where we have to go home from work because of their mistakes. They never hear the order or double check with you to make sure they hear you. They will also mess up when they aren't busy. Get it together guys.", "author": "Anh N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-29", "description": "20 minutes for a cup of mediocre coffee .. Really?!\nIt might be a good place to duck out and get work done or have a quick meeting but its still Starbucks and the staff are often overwhelmed.", "author": "Eric C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-04", "description": "My family and I have been taking my senior citizen father here for a few weeks now because of the spacious seating and relative accessibility - plenty of room for his walker. Dad loves the consistency of the Americanos they serve here, and he always enjoys their sandwiches and pastries, especially the chicken artichoke sandwich and a slice of the lemon iced loaf. The staff have been pretty friendly overall as well. Basically, going to Starbucks, especially this location is the highlight of his day any time we go. So four stars for all of the above!\n\nI'm taking one star off for one issue though. The other day there was another customer in line who had her dog with her. I asked her if the dog was a service animal, and when she indicated no, I asked her to take the dog outside. That dog owner gave me the stink eye the entire time because she said she'd brought her dog there before and apparently the staff let her. However, my dad had just been discharged from the hospital after surgery, and we just wanted him to have a moment of joy before taking him home. He didn't have to be exposed to an untrained animal and potential disease carrier who could react unpredictably in an enclosed area. Anyway, there's enough seating outside so pet owners can still enjoy their lattes.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "It's a Starbucks. All Starbucks are pretty much the same, but this one is quite big and it has a lot of seats and tables (including a large one by the door) so it's better than others to go read a book or get some work done.", "author": "Marta F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-17", "description": "Pros: Plugs, wifi, and open later unlike the nearby Coffee Bar that has a way better ambience. \n\nCons: The crowd is...rough around the edges. In a couple hours saw people charging ankle parole anklets, people using the bathrooms to bathe, people with bags and bags of belongings camping out for the day even sleeping on the chairs. I guess the upside of that is they don't mind if you camp out at a spot to work all day.", "author": "Alicia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Brittanee Avila, the manager, is the best! Always friendly, down to every barista I've encountered, and the space is amazing. A big fan of this Starbucks.", "author": "Dave M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-09", "description": "This is a great neighborhood Starbucks. Great location, good seating, reliable wifi, air conditioning when it's 80 degrees out in SF and you can't stay home.  \n\nSadly, I was there today at 5pm when they closed early. I'm not sure what time they normally go to - 8pm (per Yelp) or 9pm (per google's listing), but they closed 3-4 hours early. Apparently they were understaffed and the staff hadn't even taken their lunch break at 5pm. Starbucks, what gives? \n\nA nice outcome is that I found another coffee shop, even closer to where I live, which I wouldn't have if the store had staffed properly and stayed open as advertised.  Thanks, Starbucks!", "author": "C L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "They never open on time. They don't care what time they open. Have to travel 10 from my house going the way just to get my coffee in the morning. Nobody smiles. Won't be going here ever again", "author": "Chris C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "Of all of my thousands of experiences at Starbucks over the years this was undoubtedly the worst. As a rule Starbucks does what they do exceedingly well but that is not the case in all the outlets in San Francisco and this store is the perfect example. Upon entering the store yesterday I noticed five employees immediately behind the counter three of which were cleaning and stocking the shelving behind the counter. As the line behind me began to grow no one behind the counter changed what they were doing in order to take care of the customer's with money in their hands. The cashier and barista continued at the pace and the employees stocking and cleaning continued on not to be bothered by customers waiting. \n\nI placed my order with the cashier and provided her with the commonly used abbreviation for Sweet N Low (SL). It was fairly evident to me that she was new and not very experienced at the ordering process, however she was very nice with a great personality. I waited patiently for my order, along with  five or so other of people, and I noticed that the barista was falling behind. As i waited he began to call out order for what they were because there were no names on cups, further evidence of the inexperience of the cashier. When I noticed that my sandwich order had not gone into the oven after five minutes of observing the process I was told it was in line to go into the over. Funny thing, the ovens weren't even on and had nothing else in them. I then noticed that the barista had not put in my sweet n low, I made mention of adding it and I was told, \" the health department doesn't let me\", with great attitude. I was then handed the drink which was not at all what I ordered. I became fairly frustrated and asked if anyone there knew what was going on and could someone else make my drink. A somewhat pleasant young lady came over and said she would make my drink. She did, and it was right but at this point I'd been there in excess of ten minutes. A significant waste of time for coffee. \n\nKeep in mind I'm not a rabid complainer, but this type of thing is far to common with Starbucks today. It seems that things are changing and the focus on customer service is simply not what it used to be. And this is certainly evident at this location. I was there twice in two days and that was enough. I'll be going back to the store at 9th and Howard.", "author": "Erik T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "I've been here like two times and it's very spacious and cozy and the staff here is welcoming. They work through the lines fast and even when a barista messed up my drink, she offered to remake it and went out of her way and made it in a bigger size. I got my drink just a few minutes after I had informed her it was made wrong too. Super sweet staff and super chill environment. Would definitely recommend.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "This place is a disaster. Does Starbucks headquarters know that this store is operating? Or have they gone rogue and completely independent of the company? They certainly haven't gotten the memo from 5 years ago that a Trenta size is available - but the employees are happy to suggest a Venti instead, since they're always out of Trenta cups, or at least 99% of the time. They are a hot mess. The employees are rude, the lobby is a disaster, and they'd probably be better off just closing up shop and calling it a day. Every single visit is a total nightmare. I used to frequent Starbucks regularly, but after dealing with this store one too many times, I've lost my appetite for the entire company.", "author": "John O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-14", "description": "The expectation from a Starbucks is never not that hight so it's definitely not the scene to shoot the awesome movie Great Expectations but at least the coffee is somewhat decent and it's very customer centric.\n\nWell scratch that for this particular location. The staff was so annoying that I did not get to try that somewhat decent coffee. The store manager or whoever definitely needs to remind these folks that Starbucks chain is built around customer satisfaction. Well store proliferation too but that's out of scope for this review.\n\nAnyway long story short: Dear management please do not let your customers have huge deviations in their experiences with your stores. A chain has to be consistent and that means properly educating your staff on manners at the locations they seem to be missing those.\n\nHorrible!", "author": "Yigit B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "Was driving in the area and stumbled upon this Starbucks. This is actually an interesting location to have a Starbucks, as I usually expect coffee shops in areas with high walking traffic. The customers at this location tend to be police officers, MUNI drivers, and KQED staff. This particular Starbucks is huge compared to many locations in the city with a lot of seating. Got the usual Ice Coffee with Vanilla Syrup which was nothing out of the ordinary. The service here was very quick and the baristas were very friendly. Overall not a bad place to study or hangout. A lot of parking in the area with metered spaces in front and free street parking across the street.", "author": "Peter C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-08", "description": "This is the slowest service I have ever experienced in Starbucks.  Every time I come here it takes forever even though they always have several people.", "author": "Sophie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "Usually, I come here for my mocha green tea latte but today with that bad service and BAD ATTITUDE I will go elsewhere", "author": "Jenny H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "+ nice seating area\n+ big study area\n+ not very crowded\n\n- freezing", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "This place get's 4 stars for being THE coolest Starbucks I've ever seen.  I've been to the original store in Seattle and I've even worked at Starbucks back in the day so let's just say... I've gotten around the 'Bux block.\n\nThis store is so open and the perfect place for kicking back to read a book, working on some design or spreadsheets on your laptop, or just grabbing a coffee and people watching.  The space is definitely unique to the Mission area and I believe it's so different so that it can compete with the likes of Coffee Bar down the street.  Although I prefer other coffees - this store has to be my go-to place for coffee atmosphere.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "The best Starbucks I've ever been to.\n\n01. The place is big. Many seating options.\n02. Plenty of energy outlets.\n03. Free fast wifi.\n04. Ar conditioning that works.\n05. Couches, chairs, tables... \n\nOne of the best places to get work done.", "author": "Jonathan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "This is one of the classiest Starbucks I've ever seen-they even have art by local artists and hipster prints on the walls. I believe I saw a black and white photograph of Candlestick Park, which was classy and I always appreciate the baseball shoutout. \n\nI only stopped in because I really had to use the facilities and the burrito spot I usually pop into for that purpose on Valencia was going to be a close call, so I changed up my usual routine and boy was it a great idea. The usual Starbucks has a single occupancy bathroom and occasionally there's a code to get in (don't get me started on this subject), but this one had THREE WHOLE STALLS. There was no code to be had, much to the relief of my bladder. \n\nI'm not really sure why anyone would go to Starbucks other than for the reason I did, considering that you're in what is probably one of the top 5 cities in the world to get super bougie coffee. You're in the freaking Mission for goodness sakes-there are at least 17 local, artisanal, handcrafted, non-gmo, ethically sourced, single-origin roasters within walking distance for a 700 pound human. I guess if you really #*^%*#* love Starbucks, then this one should DEFINITELY be on the top of your SF itinerary. For the rest of us, the bathrooms are bomb af.", "author": "Leighliana J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-04", "description": "The space is yes, large with lots of seating which is great. However this is the worst place to go to study or to have a conversation or to read. The music is always played extremely loud, this makes the atmosphere very, very uncomfortable. The loud music in turn makes people talk super loud. Yes, its not a library so its understandable but the music is SO LOUD! Even when you wear earplugs. I've asked for them to turn it down and they said that something about the system is broken so that its either really loud or off. Weird, they just remodeled a few months ago. You would think a company as massive as STARBUCKS would have the money to send a repair guy out to fix said problem. \n\nLibraries are closed today in observance of Veterans day, otherwise I wouldn't be here.", "author": "Andrea E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Had to give this Starbucks 5 stars for being the nicest of ALL n the city. Loads of seating, nice bogs, furniture, condiment bar, lots of outlets, MASSIVE space.\n\nHaving said that, staff hear have big shoes to fill for having such a nice coffee house/pub atmosphere to work in!", "author": "Julian I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "I love this coffee, great service and very clean.\nMy day always start with cup of coffee from Starbucks, vanilla latte is my favorite.", "author": "Moranii B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "If there was ever a Starbucks with personality, it would be this Mission location. There's a bunch of great breakaway areas to work inside and out (it's a great place to bring your dog on a sunny day) and the menu boards are handwritten. People get together in groups here all the time and the lack of hipster 'tude makes it the perfect spot to GTD.\n\nI ordered a cafe vanilla Frappuccino but forgot to get it decaf, the result being that I'd now be buzzing away for the rest of the night. It was delicious of course, but it did chill me out just as the rest of the cafe tends to do due to over air-conditioning.\n\nI definitely dig this spot because of the great personality of the joint and the dog-friendliness of the area. It can get a bit windy sometimes though, but the abundance of free parking makes it an attractive spot to squat. Definitely worth checking out!\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 9/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "Ditto the previous yelper reviews - very spacious and plenty of tables.\n\nHuge Starbucks located on the corner in a mostly business industrial part of the Potrero/Mission district. \n\nTwo separate entrances.  The one we entered on Mariposa has an one step down so careful! Easy to miss the step and take a tumble.  The other side around the corner must be the ADA side.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "We stumbled upon this Starbucks while wandering through the streets on our last visit to the city. Luckily a parking spot opened up right in front of the store when we arrived. While they had a good flow of customers coming and going, it wasn't crowded at all. The space is larger than most locations, clean, with a nice mural on the entry wall. Looking around, it seemed to me that there were more outlets than an average Starbucks, so that's potentially helpful for those who are coming in for longer periods of time. Service was decent, coffee was standard. It was definitely a nice pit stop on our travels.", "author": "Christel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "This is the Sbux that's local to my office.  Coffee Bar is just a block further, so I usually go there, as the coffee is much better.  Today I wanted to check out the Sbux remodel, however.  The use of space is much improved; they moved the counter/registers to the far wall, which keeps the line from clogging up the doorway.  They also got rid of that useless conference room area in back, which opens the place up quite a bit.  I saw a review about loud music - I didn't seem to notice that.  \n\nOn the not-so-wonderful side, they were out of the breakfast sandwich I wanted, so I ordered the recommended alternate.  Then I was told \"Oops, out of that one too.\"  I ended up ordering one I didn't really want (it was a free birthday treat - yay!), but the guy was really nice and gave me a card that's good for a free beverage next time.  \n\nAll-in-all, cool changes and a nice customer service save.", "author": "Kimberly Q."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-09", "description": "***This is a pretty big Starbucks with a wide variety of indoor seating as well as a few seating options outside; this store has your typical Starbucks offerings; they have already started selling holiday season items including an interesting advent calendar, which should have had a more interesting and integrated look as opposed to just being a series of 25 little canisters of sweets; their men's restroom was out of order***\n\nMetered street parking is available.  The meters only take coins.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "This Starbucks is big inside. Also the are better comfortable seats at this Starbucks than at most Starbucks locations. I try to go to this location as much as I can when I am in the area. I would recommend this location to anyone who loves Starbucks.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "Worse customer service ever! The barista took my order and i especifically said \"light drizzle extra caramel on the bottom\" ... Of course they drown the cup with caramel sauce and i told the barista at the bar if they can tranfer it to another cup because it was suppoes to be light drizzle.. The second barista said \"it says extra caramel\" so i told her it says \"light\" one of the barista rolled her eyes and talked to the other one about making another one. At that point i was angry i asked for another cup and transfered it myself. The cashier barista came over and said \"its not a big deal!\" ... Well let me tell you for $6.45 and getting simple instructions wrong yes! It is a big deal.. Get it right and be nice about it cause you made the mistake not me. Fyi if you go to this location expect to get attitude if you complain. These 3 young girls need to be retrained on \"customer is always right\" and maybe you 3 need to reach out to your store manager about future trainings!", "author": "Jenniffer P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "Awesome Starbucks spot, great spot for studying and getting work done. The only reason I am not giving it 5 stars is the music is beyond loud. Asked the barista to turn it down, but music volume is set at a \"fixed\" volume. \n\nApart from the music blasting, favorite Starbucks location in the city!!!!", "author": "Natalie D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-08", "description": "Today, I ordered a large, iced soy latte. There were 4-5 women working, my order was taken and after 5-6 people got their drink (mine was definitely not kept in the order received), the gal apologized for the wait. The service is terrible, slow and efficient. Going back to Peers where they have almond milk! Starbucks uses GMO.", "author": "Bernadette B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-21", "description": "This is a wonderful industrial design Starbucks that perfectly blends with the surrounding neighborhood. The place is spacious with lots of different seating arrangements, from sofas to a table. \n\nThis is one of my favorite places to come and do some work while having coffee. This could be the best Starbucks in the city.", "author": "Bartholomew F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-26", "description": "Food, drink, and customer service are the same as other Starbuck. However, it have one of the most annoying music I have ever heard, which is usually not a big deal since it is personal taste issue I can block with my earphone- except its loud and disruptive. I have barista misheard my order more than once (small tea, small coffee, etc... how hard can that be? It is not like I am doing a, I don't know.. non-fat, no foam, but heavy caramel, grande soy milk latte in a venti cup and etc, etc... or whatever crazy complex order some have. ). The design feels airy and light with all the windows, and it would had been a great study spot or place to chat with friends, but the music make me feel like I was in a pub instead of a coffeehouse.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Love going somewhere where they know my name but spell it wrong lol... This is a must stop on my way to work and they KNOW how to make my coffee always deeelish", "author": "Yvonne T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-10", "description": "The large venue is perfect for business meetings, but it is consistently freezing cold.", "author": "Simone W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "This is probably the nicest Starbucks in San Francisco.  It's not my \"favorite\", because obviously that's my local Starbucks in the Castro (which is absolutely fantastic!!), but if I was in my car, driving around the Mission, I totally make guilty trips here to grab some awesome coffee.\n\nMy favorite drinks are the Starbucks Reserve coffees, which they brew on a Clover machine, which is only available at probably 200 Starbucks world-wide - and this is the only one of two places in San Francisco that has them!  By having Starbucks Reserve coffees, there's usually around 4-5 special coffees you can have made single-cup just for you!  These are usually pretty exotic single-sourced coffees, such as their amazing Hawaiian Ka'u coffee.  They also usually have a Tanzanian (though sometimes just the Ethiopian).  It's actually pretty fun, because the Reserve coffees come and go based on the growing seasons, so they're always awesome.  I usually put cream and sugar in my coffee, but with the reserve coffees, I usually cut them back considerably because the coffee is just so good on its own.\n\nThere's also a lot of space here: Lots of tables, spread out, so you can set up a laptop, relax, and do some creative work by yourself.  Perhaps this is even the biggest Starbucks in SF?  It has to be.  It's huge.", "author": "Jon E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "This is one of my favorite Starbucks in the city. It's huge! Lots of different types of seating ranging from loungy chairs to high top circular tables. There are also two long work tables if you want to meet up with friends. The large windows let in lots of light and it's not located on a super busy corner so the sounds of traffic are pretty minimal.", "author": "Casey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-06", "description": "Comfortable spot to get some work done! Service is fantastic!  One of the larger Starbucks in the city plenty of room for using your computer.  Internet speed around 9mb not bad!", "author": "Thomas W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-30", "description": "Just hope store manager will read this.  While I was staying there for 1-2 hours and when I went to the counter to ask for the water, I was told to make line to get cup of water..... No offense, but you can avoid customer disturbing your line of operation simply you put water OUTSIDE of your counter as other coffee shops do....  I am not gonna make lines and wait to just get my water..... Common, Starbucks.... Be flexible or put water outside so that customer can drink water not making line.....", "author": "Miho Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "I don't normally review Starbucks locations, but this one stood out enough to warrant one. The location is pretty nice, has a ton of seating, and even has a private room in the back that can be used for meetings, or just to get away from the louder crowd outside.\n\nMinus points for closing early one night (7:30pm instead of the listed 8pm), and for not checking up on and cleaning the bathrooms often enough though.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "The best place to have a cup of coffee and write the next great novel... If only I didn't spend so much time online...\n\nPublic transit is strongly recommended as parking is tough after 8am. People work around here, you know...\n\nThe staff is friendly and make good coffee.", "author": "Joe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "Ohhhhhhh is THISSSSSS what a Starbucks can look like?\n\nI got so used to my beloved but dilapidated Sunset Starbucks that I forgot that there are establishments where you can SIT DOWN on the toilets without contracting something fierce.\n\nThis place is spacious and clean, bustling with people in and out all the time.  There's a perpetual long line but it seems to move quickly.  Lots of tables and space to study since it seems most people are just grabbing and going.  \n\nAs a helpful guy pointed out to me as I looked around, befuddled with computer charger in hand--there are TONS of outlets, they are just sneakily hid underneath the paneling near your feet.  \n\nThe coffee is--Starbucks--tastes the same everywhere.  Nothing really eye-popping or out of the ordinary here.", "author": "Meg M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "5 stars for pure seating space and options. By far the most seating I've seen in a starbucks in San Francisco...at least so far.", "author": "Matthew F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-11", "description": "Love the set up!  Very comfortable place to meet folks and have a coffee chat.  9 out of 10 times the service is so incredibly friendly - I actually go out of my way to meet folks at this location.  Sadly, every once in a while the service is slower than usual and today I had the unfortunate experience of quite rude interaction with a barista.  I was frustrated with a service - shared my frustration and basically was met with \"not my problem.\"  For the price we pay for coffee at places like this, any less-than-professional experiences need to be named.  So, I am naming it.  Hopefully this will be an experience of the past and if I return will experience the professional and friendly folks this store is known for.", "author": "Eli Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "Basically like any other Starbucks in terms of drinks and food, but what's great about this one is primarily its location and work space availability. \n\nThere's so much room here! If your'e looking for a place to get some work done in a relatively quiet environment, this Starbucks is the place for you. I'm going to assume that a lot of people make their way to The Coffee Bar just down the block for lunch and that hipster-isque vibe that makes it unique. Either way, it means that this Starbucks is perfect for focusing on work and/or just catching up with a friend in a quieter space. There's tons of tables (and even a larger conference size table) available. if there isn't a meeting, the friendly staff should be willing to let you use the space as long as you don't make a mess.", "author": "Cheston W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "The surrounding area is a bit residential, a little too empty and dark for my liking.  Was able to park right outside, so I didn't feel weird walking in the dark.\n\nThe inside is quite spacious, lots of outlets, different table and chair heights.  It is pretty much an ideal place to do work because you can choose exactly what you like to be comfortable.  When I came there, it wasn't very crowded, so I was able to sit where I liked.\n\nDef recommend if you're a big starbucks fan, as well as a person who likes a place to work.", "author": "My An V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-03", "description": "This is my first time coming to Starbucks since the remodel. I like the ambiance inside- lots of seating areas with ample access to outlets. The problem, however, is the internet. I came to get some work done on a Sunday, and the internet was unusable. It's your standard open attwifi, but was so slow that I couldn't load many web pages. Hugely disappointing.", "author": "Emily E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "This is as good as it gets -- for a Starbucks. \n\nFirst, the design isn't their standard corporate design. There's a bit of uniqueness to it, with an industrial vibe that's pretty cool. \n\nSecond, this place is made to work in. There are long tables, plenty of outlets, different kinds of seats for different preferences, and even a private room that I suppose you can snag for meetings or whatever. \n\nThird, with a Starbucks Gold Card you get free refills. If I'm drinking drip coffee, I can spend $1.50 on a tall coffee and keep going all day on that. And after 15 of those, you can get a $5 triple/venti/mocha/latte/frappu-whatever with the nifty certificate they send you in the mail. Yes, I'm abusing the system. But whatever. \n\nFourth, for those of us who stop in before or after things you need to drive to, there's plenty of unrestricted parking nearby. \n\nFifth, the people here are nice. I ordered a triple latte (three shots), but the barista asked me if I wanted a free fourth shot after I ordered. Given the mountain of law school reading I had to do here, I quickly agreed and thanked her. \n\nSixth, it's a chain. Perhaps a negative. But it's chain-ness keeps the obnoxious hipster baristas and clientele away. Which can be very welcome in this neighborhood (though I still love living here). \n\nI did get assaulted by a homeless woman here once last year, but that's not their fault. It is San Francisco, after all.", "author": "Tom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-15", "description": "I can't even tell it's a corporate business, it feels so Mom & Pop as well as welcoming.\n\nGreat Location\nHuge Space for lounging or getting work done\nAwesome & Helpful staff, although I do believe there could be more employees there.\nPerhaps a but understaffed.\nGreat Drinks\n\nI Love It.", "author": "D F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-27", "description": "I'm not going to review the coffee or food, because it's the same choices as any other Starbucks location in the city.  What I'm going to focus on is what makes this Starbucks different, unique, if you will:\n\nHOURS:  Closes at 8 pm.  Too damn early.\n\nENVIRONMENT:  It's huge.  There's oodles of seating.  And not only is there seating, there's COMFORTABLE seating, leather chairs in not one, but two different seating areas!  Unlike various other Starbucks locations (Church/Market, for example), it's not overly air-conditioned and is a comfortable overall temperature.  While there's lots of natural light from the vast windows, there are no skylights in this location, so it can feel cavernous later in the day.  Also, while there's a back room with a long table with seats around it that often has the door open, you can't sit in there unless you rent that area out.  Tacky.\n\nBARRISTAS:  Polite but not generally friendly.  Cashier guy is always cool, but for some reason the two women who always seem to be making my coffee beverage give me attitude, not to mention take twice as long as any other Starbucks I go to (maybe it's because there's never a line here, so they're not \"on\"?).\n\nOverall, if you want a Starbucks that isn't overcrowded, doesn't freeze you out, and doesn't have any bums or crazy people, this seems like a great place.  I'm fond of going here, but like I said, they close waaaaay too early!!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-02", "description": "I just battled parking found one ordered n was unable to pay with the only money I had which was a 100 dollar bill and was told I couldn't pay with that they don't carry enough change in there tills for that??? So they emediatly cancelled my order and farewelled me Lol this is the largest corporation probably close to apple and I can't pay with a 100 dollar bill? Wow cool", "author": "Amore T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "One of the best Starbucks I have been to. The set up is much larger than average with lots of large tables, comfy couches and bar seating. The plugs even have an additional 6 plug piece added to them to maximize charging. Lots of solos catching up on emails, studying and reading the newspaper.The baristas are friendly, wifi is fast and drinks are consistently Starbucks.\n\nIf you are staying awhile, bring layers- it gets cold!", "author": "Seema M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "This Starbucks is the best! The renovation here is amazing and has a great welcoming feel! I come here a lot during the work week because it is just around the corner. The drinks are consistently on point and the baristas are all super friendly. I can tell they enjoy their work. I completely recommend coming here for a quick drink and food!", "author": "Britney L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-02", "description": "Slowest wifi I've ever experienced in a coffee shop. Worst part: there were less than 10 people there.", "author": "Adam T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "This is my new favorite Starbucks.\nThe atmosphere is very inviting, and the decor is fabulous. There is a back room that is cozy and professionally set for meetings. They have several lounge areas for people to sit and relax, and plenty of seating for several people to just sit and read while enjoying the music and beverages. They also serve clover coffee; a must if you go here!", "author": "Rosie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Decent location. Spatious. I question placements of seats. Employees didn't seem too friendly. I prefer the Starbucks on California.", "author": "Kay G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-06", "description": "Baristas are great but they consistently mess up what milk goes in what canister on the condiment counter. I've mentioned this multiple times but the issue is still ruining 1/5 mornings every week on average. IT'S SO EASY TO MATCH MILK TO NAMED CANISTERS!", "author": "D E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-15", "description": "Starbucks is Starbucks.  This is for sure.  I will say, however, that this Starbucks has WAY more space than most I have seen, so for that I will give credit where it's due.  It was also remarkably quiet, so it had more of that quiet coffee shop feel.  It's located on a block that used to be/still is pretty industrial, so that lends itself to the more spacious layout.", "author": "Mel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "Love the staff , my drinks are always made like I request  them. They have a great seating area .I had a great experience there.", "author": "Leane A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-10", "description": "Don't come here if you wanna use internet. WORST STARBUCKS to do work related things!", "author": "Ahmed H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-16", "description": "Good space for study and hang out to catch up with friends.\n\nI come here often, DON'T KNOW WHY, bc my coffee doesn't always come out tasty, it makes me a bitter grumpy person bc it turns out nasty. \n\nI didn't care much about it until i had my sister run in to grab both of us coffee...i've noticed this a few times but it didn't bother me, at least they took my order and made my coffee, wasnt perfect but good enough, but this time they took my sister's order, she ordered TWO coffees....took my sister's money and started to chit chat with each other behind the counter, didn't even give my sister a chance to say, \"i actually ordered 2 coffee\", it's partially my sister's fault for not being more aggressive about it, but she did say EXCUSE ME a few times trying to get their attentions.....horrible. she came out with one cofffeee and we end up sharing. poor thing\n\n\nI've noticed the other times my coffee turn out nasty was also bc they were busy chit chatting in the back, i absolutely do not care abt that, but if u can't multitask.....DON'T even try.", "author": "Helen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "I love the ambiance of this place!  It's a good mixture of people and it's right next work :)  \n\nLOVE IT!!!!!", "author": "Alicia A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-15", "description": "the crew at this location are terribly inefficient and continually lose or mix up orders", "author": "Got M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-28", "description": "Love this place. The staff are always smiling and joking with customers. You can tell that they actually like the people they work with and in turn makes better customer service. The vibe is pretty cool. Always a different mix of ppl. Usually students.", "author": "Harlyn A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "Starbucks is a starbucks in terms of what they sell... HOWEVER, this is a low-key starbucks that  a lot of people don't know about with plenty of seats on a Saturday afternoon.\n\nGood to study, work, and/or have meetings. There's a small room in the corner where it's private. Will be back!", "author": "Vic F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-20", "description": "My favorite Sbux in town. So many comfy chairs and a cool vibe that no other Sbux has.  I love going in here and just hanging out. This place definitely feels like a real coffee house unlike a lot of the other Starbucks in town, especially many of the recently remodeled ones. The staff that works at this location are amazing and do a great job even when the line gets really long.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "This Starbucks bought the rights so that NO OTHER BUSINESS CAN SERVE COFFEE ON THAT WHOLE CITY BLOCK. That includes Charles Chocolates on the other side of the block where you would want a coffee.\nScrew you Starbucks, you come in, put all the mom & pop coffee places outta business then own the rights so no-one can come close to you.\nThat's fair trade, a democracy???\nGO GET A MUCH BETTER COFFEE AT HEATH 1/2 a block away on 18th Street in a MUCH cleaner space.\nUgh Starbucks, you're so so lame.", "author": "M H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-15", "description": "Drove all the way out to this area because the place looked spacious on yelp and I needed a good place to study at. While there was a lot of space, the place was swarming with little gnats and flies. They were literally everywhere. I'm not picky when it comes to my starbucks but I can't focus if flies and gnats are buzzing in my ear. Come on guys. Invest in a fly swatter or an insect light trap. You guys need it.", "author": "George G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "Starbucks is the best ... especially there caramel latte definitely going back place is neat", "author": "Jeselyn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-27", "description": "Oh no!!!!  Just drove by and it looks like it is closing!!!  :(.    Such nice and friendly people... I hope it's just a remodel!!!", "author": "Lucia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "This is one of the nicest, biggest Starbucks locations I have patronized. It's a short distance from my work so I stop in here frequently for snacks and beverages. There is plenty of seating and they have a full coffee bar which is really nice. I think they serve other coffee as well but don't quote me on it. The staff are really friendly so it makes me want to visit this location more often. I will be back...", "author": "Amy J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "This is yet just another Starbucks that doesnt have their own product. If its not one Starbucks not having Christmas Blend at Christmas time, then its this one not having decaf. Of course they try to upsell me to something called Clover Coffee - if I wanted something different, Id have said I wanted that.\n\nIm at that point that I dont think Ill be frequenting Starbucks to earn more worthless rewards. Oh yeah, the barista here talks way too much to his coworkers when there is not only a line waiting for coffee but also to order. \n\nGuess with Starbucks cutting partners out of investments and revamping, they are now hiring people who no longer care about the wage they earn.", "author": "William D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "This is the biggest Starbucks Ive been too. Corporate but laid back...I like it.\n\nCinnamon Dolce for Cholo, Iced Mocha for Joann and Grande Drip for me.\n\nHighly recommended.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-16", "description": "First of all, I am an unabashed Starbucks fangirl. Second, this Starbucks happens to be below BAVC, where I take classes every few months. I'm SUPER IMPRESSED with this location because after only visiting maybe three times (with months in between visits) and they remembered me and my order! There is a ton of seating, free and fast wifi, and has a great cafe feel because there are always people sitting around reading/working/studying.", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-28", "description": "I usually prefer independent coffee shops while floating around San Francisco looking for a comfy spot with free Wifi... BUT... I have to say I think this is my all time favorite Starbucks.\n\nIt's huge... There must have been a restaurant or something here before, cause there is lots of space, lots of tables, lots of comfy leather chairs.  There are also outlets like every 5 feet... along the walls, on the floor.  Everywhere.\n\nI love the big windows.  Looking around at 5pm the place is comfortably lit, and most of the ceiling lights arn't on.  Tons of natural Potrero sunshine comes pouring in.  If it wasn't so windy, I'd be sitting outside right now on one of their MANY sidewalk tables.\n\nI read a bunch of reviews about lousy coffee or service.  I havent experienced ether. Starbucks always tastes the same to me... slightly above average with bonus points for convenience and consistency.", "author": "Kevin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-27", "description": "This is one of the biggest, friendliest Starbucks in the city. I come here despite how hard it is to get here from my house and I love it.", "author": "Sky K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-17", "description": "The worst customer service experience I have ever had at any coffee shop, this includes internationally as well, went from rude, to obnoxious and they should be ashamed of themselves. Didn't even have a cup, but if it's anything like their service, IM GOOD! Good luck this store", "author": "Thomas C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-25", "description": "This is the coolest looking Starbucks interior design wise! It is super cool, and I give it 5 stars on that note. \n\nI wish I could say the same for the service here. My usual staple order is an iced coffee with caramel syrup--not too complicated, but this location seems to have A LOT of problems keeping orders straight, even the simple drinks. On one occasion they forgot to make the drink altogether--oops! When I had already been waiting awhile, giving them a chance to figure out their mistakes on their own.  I go here often, because it is close to work, but I do wish they would beef up on the service side of things at this particular location.", "author": "Nichole P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-04", "description": "Wow, they really did a great job with the interior design of this place and before it wasn't half bad either. I think it's a country/western feel to it. I was shooting in a studio near here this week and I am happy I get great strong coffee with big tables and wifi in the morning.\n\nTwo more days of this place this week.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "Great place to get a pick-me-up drink, sit back and enjoy the San Francisco weather. Friendly baristas, quick service, good seating.", "author": "Jon A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "I can't think of any difference between this starbucks and any other starbucks in the city EXCEPT for the service.\n\nAll the staff people here are friendly...sometimes too friendly. One time, I think the cash register guy was flirting with me? He took my order and then he made my drink, he was acting a little bit playful when he handed it to me. (he pretended he was handing the drink, and then I reached to grab it, he pulled it back, smiled, and then gave it to me) That was a bit awkward/confusing....\n\nBesides that, the other staff people talk to you while you're waiting for your drink, I love how they put your drink in the cardboard sleeve and then hand it to you. Other starbucks don't do that, which gets me a little mad. If it weren't for the location, I would probably come here more often.", "author": "Sophia G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "I came to this neighborhood Starbucks for a house meeting one night, as we considered voting somebody \"off the island.\"\n\nWalking up, the place looked packed with people in animated conversation. We immediately huddled in a corner and held our powwow for the next hour. It was about 45 minutes into the conversation that we all noticed, hey, it's awful quiet for being so crowded. Another look around revealed that everyone was talking in sign language.\n\nI think that happens every Tuesday.\n\nAs far as Starbucks go, this really is a nice one. Yes, it was one of those \"special\" Starbucks that started the whole shift away from McCoffee. As far as the neighborhood goes, I'm not sure if this is the best presence or not. [see my business photo for this location]\n\nNonetheless,  I give it four stars for its class: two for Starbucks, and two for the layout and decor.", "author": "Taj M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-05", "description": "Hi\nThe barristas who see me about once a week, most have already memorized my order.\n\nalthough this place could be cleaner: tables, counter, bathrooms, it is very charming and homey.\n\nI liked it better when it was a bunch of computer geeks and me vs the Latino families who let their children run wild and the \"all of humanity\" grouping.\n\nthat said it's like being at someone's home and as it used to be Circadia Cafe, with live music, etc. it's a cool place.\n\nWish it would empty out except for me and the geeks but I like and appreciate this place and think the barristas are really working toward full excellence and I so appreciate them for the work that they do", "author": "ALLEGRA A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "ATMOSPHERE:\nOoh, this one's a nice Starbucks. So big. Some plush reading chairs. Has an industrial yet trendy sort of feel to it. Their bathroom has some crazy artwork of the city. Love it. And gotta love how Starbucks switched to free unlimited wifi.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-06", "description": "Yesterday I visited this Starbucks for the first time since it was re-opened. I was impressed by the architecture, Starbucks turned an old, rusty and boring coffee shop into a more modern and appealing one. The look of the revamped Starbucks is absolutely gorgeous and without doubts it's in a much better position to stop losing clients to the Coffee bar that is across the street. However, once again I could not stay at Starbucks for more than ten minutes, the speed of internet was slow, very slow.  I could barely navigate the Internet and once again I had to walk to the next door coffee. I do not know whether this is a marketing strategy and Starbucks does not offer fast wi-fi so that people do not stay there a long time, if that's their strategy then it is  working wonders at least with me but if it's not the strategy then the managers should start thinking that maybe is worth to spend an extra hundred bucks a month to offer at least a decent wi-fi connection. I am not going to talk about the coffee or about the attentive staff members at this location because the internet issue was my real experience, it's like going to a sports bar and find out that they are showing the games in an old black and white tv; enough to force me to leave the place without any comments. I will come back if they start offering a decent wi-fi service; however, do not expect me back if they continue to offer the same internet service that was used in the past by Fred and Plebbes Flintstone.", "author": "Serge B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-08", "description": "They just finished renovating this place. I remember when it was \"Circadia\" and much better. Now since the renovation...the music is too loud. You can't hear yourself think. Numerous people complained and were told 'nothing could be done'", "author": "Calvin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "It's a big space, good for small meetings and Luis is the man. \nHonestly I have nothing else to say...\nAh, yes, talking about mocha....I haven't found a good one in a mile range.\nStarbucks still has the magic touch on this morning treat.", "author": "Dario B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "this starbucks is GREAT!\n\nsometimes i swing by while i'm moving my car waiting for the street cleaners and i don't ever feel judged when i stroll in bleary eyed wearing sweatpants.\n\nit used to be an old wells fargo bank and is huge.  there's tons of seating... comfortable chairs, a long table, smaller tables with a few chairs, hi-top tables, outdoor seating.  i've camped out here for hours while working on my thesis and it felt like i was hanging out at home.\n\nthe staff are always super pleasant and they seem to be pretty close since i see them joking and chatting with each other.", "author": "Lauren P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-20", "description": "So I love Starbucks. I used to work for Starbucks even. However, this is the absolute worst Starbucks ever! They are slower than any other Starbucks that I have ever been to and they consistently get my orders wrong.  Come on Starbucks, you can do better.", "author": "Cecil J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-25", "description": "WOW, you wouldn't believe the space. If you're a students or office workers, looking for time at the coffee shop to finish your work, This is the right place for you. The space is huge, relax, atmosphere is good and clean. I've never seen any Starbucks in the city that is this big. This place totally my best Starbucks in the city. In great Potrero neighborhood, walking distance from 16st Bart Station, this place is awesome. I will come here more often...", "author": "Thyra K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "This Starbucks is HUGE! Lots of furniture and wall outlets. Background music is comfortable to listen while working on a laptop. Space is very clean and the baristas are extremely nice and friendly. Ordered the Oprah Chai tea latte. Just amazing how fast it is done and how delicious it tastes compared to other Starbucks. I don't know if this is normal but the barista made the drink before taking my money, which I feel is awesome.", "author": "Daniel M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "Favorite Starbucks yet. Great, big space with a diversity of seating. Big windows so natural light streams through. Friendly, fast staff. Clean bathrooms.", "author": "K A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "The Wi-Fi is not okay for our expectations in 2015.   The place is still good, but I'm ready to pull a star because we now expect better WiFi network, and this place is failing on that.\n\nI like the way Starbucks does most of their spaces, but this one is particularly good, like other reviews describe its a particularly big space.  It has long tables, also the little round ones, the leather chairs.\n\nThe space is almost always at that condition where there are people there, but there are some good seats left.", "author": "Gregory D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "Best location in SF! It is super spacious with outdoor and indoor seating's. You can opt for the cozy lounge chairs, the bar seating's, the small tables for a catch-up session with some friends, or the big tables for studying/reading.  There's also a private conference room in the back. That's pretty awesome! Overall, this location provides a welcoming/comfy atmosphere.", "author": "Therese F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-11", "description": "With so many inspired coffee houses in the city why would anyone go to a place that is a carbon copy of literally a million other places?  Please!", "author": "Nikki K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "I love this place.  It's so spacious.  I get my \"usuals,\" do some laptop work and listen to their music.  It feels so serene.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "Love this SBx...when the staff is right. \nThere is a shift of workers that are fabulous-the manager (sweet lady) is fabulous...but then, there is a shift of VERY, very, VERY loud-pushing obnoxious-staff.  (yelling: to each other-across the shop-out the orders-and it goes on...) Perhaps that would be lovely to work with...but NOT when you are working...", "author": "SLH H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-29", "description": "I got there fairly regularly for my AM coffee (the caramel macchiato with extra caramel in case you care).  Overall a nice place, staff is pleasant. \n\nHowever, they are not consistent with the coffee. I always ask for mine with extra caramel and I'd say that 15% of the time they don't get it right (i.e. they forget the extra caramel). It really depends on the barista who is making your coffee.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-09", "description": "This is my favorite Starbucks!!\n\nFriendly service w/ a conference room w/ Complimentary Blasting AC! can't ask for a better coffee joint.\n\nlove ya!!", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "Huge tables at this SBUX.  We came here after Coffee Bar was packed.  Long communal tables are reminiscent of college libraries; you could get some work done.", "author": "Erika C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-28", "description": "My favorite Starbucks in the city! \n\nAs much as I'm a fan of being a local yokel when it comes to my coffee, I've never been one to turn my back on Starbucks. When it all comes down, I guess I'm not really all that militant about anything, let alone where I get my coffee, and some days are just Starbucks days...particularly when I'm in my car, rather than on foot, and running errands in the Potrero Center area, which I do quite often. \n\nThis Starbucks has everything going for it...the employees are efficient and friendly, and there are a lot of repeat customers, which creates a community feel. It's in a spacious and attractive building, with comfy living-room style furniture (feng shui, anyone?), and their bathroom is always clean and easily accessible. I've never had a bad experience here. \n\nThe parking situation can get a little harried, especially in the early morning hours. Get there before 8 or prepare to circle!", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-09", "description": "So, this is dumb because I'm reviewing a freaking Starbucks. How dumb is that?\n\nAnyway, I just need to get it off my chest how annoying it is that you order, then they repeat your order to you, then you correct them, then they YELL your order to the barista (50-50 chance this is incorrect again), and you yell your corrections to the barista yourself, and then they finally ring you up. And the 50-50 chance you actually get the right order in the end. \n\nWhat the F is that? I don't want to play freaking telephone at 8:45 in the morning!!! What a waste of time! Just f-ing write my order on the damn cup while I say it the first time, damn!! And that's what I told them today!", "author": "Thlel Yan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-27", "description": "One of the better Starbucks in the city. This is my go-to study spot; been here almost everyday for the past couple months. Plenty of chairs and tables to go around. Parking is easy to find on weekends and weekdays after 4ish. During working hours on weekdays, you may have to park 2-3 blocks away. \n\nMy advice for those who plan to stay and study for 2+ hours: bring a sweater even if it is 75+ degrees out. If you don't, guarantee you'll freeze your ass off.", "author": "Andy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "I'm a Starbucks gal, I'll admit it.  I also like Peet's and Tully's, but over the last ten years, Starbucks has been a consistent caffeine satisfier.  However, not all Starbucks venues have that glamorous look and I don't always feel like staying in and sipping my drink.\n\nThere are a few that just scream diva.  This location happens to be one of them.  \n\nWhether it's the smooth open layout, the large windows that wrap you in sunlight glory, the wooden floor that makes you feel like curling up in front of a fireplace and indulging in your beverage, or the lovely background music that plays Edith Piaf and Eartha Kitt classics, this specific Starbucks always gets me staying in and savoring the space.  \n\nI also recently started studying for an exam and with my inability to focus most of the time, I'm amazed at how much I get accomplished at this location.\n\nSo thank you Mariposa and Bryant Starbucks, for not only always making me a drink that gives me the goosebumps, but for also whipping me in shape and getting my a** to actually concentrate on something!", "author": "Swetha G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-05", "description": "Looks like this location deserves yet another one of those 'okay, it's Starbucks, but hear me out...' type reviews.\n\nI'm a big fan of these place. It's really spacious and has lots of seating options--whether you want to curl up with a book in a chair, chat with your friends on the couch, or get some work done at one of the many tables. I can spend hours in there working. There's also a small conference room looking thing in the back if you want to have a meeting.\n\nPeople are friendly as is the staff, and the only reason this place doesn't get five stars is because, while it does have wifi, it is, alas, not free. \n\nAlso, this place needs a  better picture! But I don't think my camera phone will do it justice...", "author": "Tara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "Best Starbucks in SF - maybe in the US? \nYes I'm a normal San Franciscan that prefers to frequent the mom & pop stores. Yes Philz is great as is the Coffee Bar around the corner from this Starbucks but this place is a cut above. They have never messed up an order, it always tastes great, staff is VERY friendly (although my favorite barista here is now at Kasi), comfy couches, chairs, plenty of newspapers to read, I could go on and on.", "author": "Teresa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-07", "description": "Nice friendly staff - always greet you with a smile. But most importantly love their Clover machine which gives you a fresh, custom brew of your liking. I wish more Starbucks had these.", "author": "Sunil K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-05", "description": "As Starbucks go I really like this location. It's BIG. Spacious with soft cushy chairs around the outside. Great for business meetings or just hanging out.\n\nTimes visited: 5", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-22", "description": "I have always liked this Starbucks.  A lot.  There's lots of seating, the crowd is very mixed, and the baristas rock the house.  And get it right.  Every time.  :-)", "author": "Evan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-18", "description": "This is my favorite starbucks in the city.  The staff are awesome and always get my drinks correct (even before I order them).  \nI'm always greeted with a smile and a friendly familiar face.  In fact, I've gotten to know a few of the people here pretty well.  \nThis is my home away from work...when I am just fed up, I go here and vegg for a few.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "My favorite Starbucks location - absolutely no comparrison.  I love the interior.  Art/deco meets corporate.  They also have an entirely seperate room for groups!  NO other starbucks has that.  This is an amazing location with a great friendly staff and Clover (my favorite!)", "author": "Theo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "This is my favorite Starbucks.  I usually prefer to support the local, independent coffee shops, but this one is different.  Very comfortable atmosphere.  Great for studying...or just getting coffee with friends.  Only down side is that they close at 8pm.  Years ago they use to close at 10pm.", "author": "Cin W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "i love this place because it's such a big space.  i love the stage and the small group meeting room that can be rented.  i used to come here to study at night and on the weekends and have never had a problem getting a table.  \ni usually get a refill on my coffee so they've never given me a hard time.  they close around 10pm so that made for good study time.  the staff are great and so friendly!  in their downtime, they keep busy by cleaning, organizing, or checking on the customers.   another cool thing about this place are the murals in the bathroom.  gorgeous paintings!  \nparking can be tricky.  the city metered bryant street so parking on mariposa got all the more challenging.", "author": "Serena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-08", "description": "This place sucks. it makes my heart hurt.", "author": "Sid M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-18", "description": "This location has remodeled to the \"indi\" cafe style, total remodel...lots of options for sitting alone and with groups- leather sofas, high metal tables, low wooden tables, and even a conference table.", "author": "Susie W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-06", "description": "I really love this starbucks if there is ever a starbucks to love! The staff here are excellent and they really take the time to chat with you. The store recently had a renovation - and I think it looks pretty cool. Very urban and Mission. Overall - excellent service and good coffee. Yay!", "author": "Cat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "Probably it's just me being unfamiliar with West Coast Starbuckses but this particular locale was very atypical in the best way possible. First off, it's huge and the serving area/counter space stretch nearly end to end in a very cool way. They could probably cram a billion small tables and chairs in here if they wanted to maximize space but even with the relatively inefficient set-up I wasn't hurting for a spot to sit. Instead it's a less is more approach here with plenty of nice comfy couch type seats, long tables, and a good number of counter seats. They even have a few outdoor tables although the surrounding neighborhood doesn't exactly encourage outside people-watching. In fact, location is probably the most inconvenient part about this 'bucks. Then again what do I know, I'm just a tourist! Anyway, although I will in all likelihood never be back here, I truly did appreciate the 25 odd minutes I spent in this Mariposa gem.", "author": "Andy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "This Starbucks is totally a little caffeinated community center.  All kinds of people come and go here; MUNI drivers, high school students, book clubs, annoying laptop people like me, cops (lots of cops, actually), students, etc. It's big and spacious and comfortable and I am very happy to do my ladyblogging from here.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-21", "description": "The spinach and feta wrap is tasty and under 250 calories.  This is the only item with posted calorie information.  I, who has a metabolism of a sloth, appreciate this.  I doubt that I would willingly eat an apple fritter if a sign posted next to it said 1500 calories.", "author": "Wakako U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-25", "description": "This is that legendary Starbucks you've all heard about. Back during the dot-com boom the company experimented with a concept called, \"Circadia\" with a wider food menu and alcoholic beverages. Apparently it never caught on beyond a trial, but this store location still has unique furniture and an incredible luxury for groups: a free meeting room! Now if only they had electricity outside...", "author": "Cameron K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-12", "description": "SLOW SERVICE....in the morning hours, i wanna get a predictable mediocre cup of americano and get the hell out.  often time they take tooooo way tooo freaking long. i stop going thier.  my co workers said the same thing too...", "author": "B K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-28", "description": "Okay, it 's Starbucks, I know it's a corporate machine. But NO prices listed for the coffee drinks?! When I asked why no prices listed the guy at the register looked like a deer in the headlights and asked his colleague, \"Um, Ah, can you answer that?\". She gave me some lame story about them being the only  \"green\" store and on and on, but it didn't answer the question. The list of items are on a blackboard - is it green to save chalk?  She did say \"Well you can ask me prices. \"  But who will? Just another corporate scheme to see if they can make more money by not listing their prices. I live in the neighborhood, but after I finish up my gift card, which at their prices won't take long, I 'll head to one of the local indie places for my coffee fix.", "author": "Wendy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-06", "description": "Hey, it is Starbuck's, and I never go there, but when I was a student, I have to say this was the BEST place to study. Never crowded, out of the way, big study tables, tons of parking, good for groups. I can't understand the menu but once I had a cinnamon dulce latte with whipped cream and it was pretty good.", "author": "Katherine B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-10", "description": "The coffee sucks. They give you a disposable cup if you want one or not, and there's no recycling. Pathetic. If only a local shop could score this space.", "author": "Lester D."}
