{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "This place is so convenient and consistent. Good location and a good choice for coffee in Noe Valley. Has a community feel to this Starbucks location.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "Coffee/food as you expect from any Starbucks but mobile order processing is bad. Usually takes longer than estimated, even if just ordering a coffee. Don't come here if you are in a rush.", "author": "Andrew A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-26", "description": "It's there, that's it. Nothing that special about this location. There are some employees who have been there for a long time that know customers by name but you'll find that anywhere. The store has some funky people who appear to have set up residence at the store since they are just always there, day or night, including some homeless and other generic yet random individuals staring blankly at a laptop and plunking away. But that can also be observed at basically any other Starbucks. One thing that may be unique to this location is the cavalry of strollers coming and going and the accompanying annoyance of children. Be prepared!", "author": "L. A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-13", "description": "By far the worst Starbucks I have ever visited. I can only order to go because this place is always busy and there aren't enough chairs. The worst part is that it takes for ever to get the orders, sometimes it takes up to 20 minutes to get a cappuccino or a latte. The manager should assess the staff and make sure they start expediting the orders the clients place.", "author": "Giselle R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-31", "description": "Mobile ordering. \nThey don't call your name out. \nJust check the counter where you normally pick up. \nThere is no designated/marked area for mobile order pick up.", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-31", "description": "Bathroom out of order? Other bathroom dirty no toilet paper, toilet water running non stop , wasting water? Get the toilets fixed for the customers and save water for the Earth and I'm sure the big bosses at Starbucks don't like wasting all the money we spend there. Coffee is good fix the Bathrooms please!", "author": "tommy b."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-12", "description": "The espresso tastes burnt.\nSometimes this place seem understaffed.\nInconsistent execution of drinks", "author": "H O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Nice place and baristas are really friendly. Almost no wait even though a very long queue.", "author": "Ramb V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-01", "description": "I used to come here when my kid was attending the middle school close by. There is never room to sit down as there are always nannys and other moms with the toddlers there with huge strollers and tons of adults using their laptops.\n\nI only have to say when I have gone in to order a coffee I am not always treated the same way as if the first or last person behind. I've gone in and the cashier smiles, says how are you to customer in front or back of me when ordering but when I come up to order its more like a stare no greeting. It comes from a particular women employee there, I think she is the manager.", "author": "Vanessa T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-23", "description": "There's a homeless dude talking loudly to himself and growling at customers. Maybe ask him to leave Starbucks?", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-01", "description": "Well I'm not really a coffee drinker at specialty coffee barista places, but my sister in law and needed coffee since its only literally less than 5 minutes from my house,we came here I got a decaf don't even ask what they got cuz I don't know the names of these specialized coffees that they make. LOL \nThanks for Reading... ~Liz~ :)", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "The staff at this location are very friendly I love all of them. My drinks are always perfect! Except my ice coffee never has room for milk. The selection of quick food is great too!", "author": "Cory T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Super friendly staff. Great spot to stop in on chilly nights. They are the only coffee shop open past 7 within walking distance.", "author": "Desiree R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "This Starbucks location is my regular place for chai tea. The group of people that work here are all fabulous. The crew is personable, friendly and they get my complicated drink right. At 5 am that matters to me. It really feels like a community of various ages and backgrounds but yet all like a 'family'. I think R is a great manager and is extremely interested in making it a special place for people to work, enjoy conversation and meet friends. He has some amazing people on his team that really brighten the experience. They really do offer the Starbucks 'green apron' experience.", "author": "Pamela S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-27", "description": "I ordered two shots of espresso on ice and asked for some whole milk to put some on my espresso, this very rude employee named Robert , ginger with freckles, said very loudly No that would just be a latte, and refused me the milk I wanted to put in my drink. I have never had a problem until now , he seemed like he had small man syndrome or something , pretty salty lil guy, trying to embarrass me or something yelling at me in front of everyone , didn't work, but it's ok dickhead I wrote corporate about my experience, I'm very disgusted at this clown of an employee. And I had tipped already, like just give me the milk prick lol", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Hard to imagine a better coffee experience than this location. There's almost always ample seating and they have a clover machine. Every time I come in here I'm treated to great service in a welcome environment. Special shout-out to Vanessa and Nguyen for making me feel especially appreciated.", "author": "Josh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Extremely quick, kind, and courteous staff.  I have the opportunity to travel frequently for work and this is by far my favorite Starbucks that I have ever come across.  The location is a plus too.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Great seating options and efficient and friendly service. I like having the option of getting some real food with my coffee in the morning instead of something sugary and unhealthy so I go for their breakfast sandwiches. Packed on the weekends so if you're looking for a chill spot to hang out and get some work done this isn't the place.", "author": "Lorna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "Nice and friendly staff members providing very efficient service. Clean spacious store, plenty of seats and outdoor seating is available. This is another Starbucks that gets 5 stars for the availability of breakfast sandwiches at 3 pm.\n\nI do like that the Wi-Fi signal here is very strong. The music being broadcasted is good and soft which is something I like. It is always good to have background music and the volume here is perfect. If you want a place to finish homework assignments or conversate with classmates, friends and colleagues, then you found the right spot.\n\nTwo benches for outdoor seating right in front of the store. This is my go to spot for a quick coffee fix when I am in Noe Valley.\n\nUpdate on visit from 07/03/2014:\nThis store looks clean and spacious, plus it went through renovations making improvements more noticeable. I really needed something for that caffeine fix and Starbucks obviously was nearby, problem solved.\n\nMuni route 48 Quintara 24th St passes by. Therefore, public transit is a very good alternative.\n\nFYI: Wi-Fi here is now Google Starbucks*\n*\"Free Wi-Fi from Google\"*\n\nWi-Fi signal is very fast here - props to that!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "The baristas really make the difference at this Starbucks location.  It's been noted before by many reviewers--I hope that it stays that way!  Gotta love Noe Valley.\nOne pet peeve that has nothing to do with this location:  I am not a fan of the Starbucks policy of asking me my name in front of a line of total strangers.  Hence, when they ask, I am usually Gary or Adam.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-16", "description": "Customer service isn't great. Cashier was very friendly to the customer before me but was very rude to me. I guess you have to be a regular to receive decent customer service.", "author": "Olivia W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "I used to come here pretty often. It's a great spot to get some work done on your own but it can get busy at times. For example, when kids finish school, they somehow all go to Starbucks to buy some drinks. \n\nIn general, the baristas are pretty friendly. Huge plus is that it opens pretty early.\n\nIt's a small place though, so not very good if you want to do some group work or study...", "author": "David L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "My father and I came in here last weekend to grab ourselves breakfast sandwiches and drinks. The cashier we had was super friendly and made some small talk with us. He told us that on Tuesday, which is today, this location will start letting its customers order their drinks online so that they could just come in and pick them up. A cool little feature I remember having at the Starbucks on my college campus. \n\nI would say my visit to this location was great, but the barista here was pretty awful. The whole time I was waiting for for my drink and sandwich, she had a scowl on her face. You could totally tell she just didn't want to be there. While I do remember the barista's name, I won't type it here, but you know who you are! \n\nFor this little story, let's just call her J.\n\nAfter J called out this one lady's name, the lady told J that she asked for low ice on her iced coffee. When J heard this, she began to look really agitated. She grabbed the drink from the lady and poured a quarter of it out. Instead of remaking the drink, which is typical when something is wrong with a drink, J merely dumped some of it out and added back some coffee and milk. The lady looked pissed when J thrusted the drink back to her, as she definitely had the right to be, but the lady didn't say anything. \n\nAs I watched this scene unfold, I got upset for her! While I give a shout out to the cashier who worked with us, I must say that J definitely needs some work in the customer service department.", "author": "Janelle C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-10", "description": "This starbucks is below their already low standards and there are much better coffee places in the area.\nIt smelled really damp as I entered, the staff didn't acknowledge me as I was next in line. The cappucino wasn't very good and the place is a little dirty and messy.\nI'll stick to other coffee shops", "author": "Joffrey T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-03", "description": "Most slowest Starbucks I've ever been. Employees are still sleepy I think. 2 people at register and one making drink. Ordering was fast but waited too long", "author": "Namuun N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-14", "description": "The only time I'll drink Starbucks is during the holidays and tonight being a blustery 57 degrees, I felt like a holiday flavored latte. So Starbucks (much to my husband's dismay) it was!\n\nAfter today I'll probably won't be back at this location. Upon walking in, I stood there in front of the register to place my order. The two behind the counter don't bother to look up. Oh, I'm sure they heard me. It's hard not to hear footsteps on wooden floors. Finally, I clear my throat and the person too busy sweeping the floor behind the register finally looks up and reluctantly takes my order. \n\nAfter paying for my drink, I wait around just looking at the sad and dried up looking La Boulange savories behind the glass counter. After several minutes of waiting, I notice that a cup has been ready and waiting on the counter. It had to be my coffee so I go up to stand in front of the barista and I say pointing to the cup \"And this is...?\" And she flatly says the order. I walk away with the cup annoyed that I couldn't muster up a \"thanks\". I mean what was the point of taking my name when no one is going to bother calling or announcing the order? \n\nPerhaps I have high expectations because I worked in customer service when I was much younger where our performance metrics was based solely on customer satisfaction. If you had a hard day you still don't take it out on paying customers and make it their problem. I don't even care about receiving a smile and a \"how are you\", I just need you to do your JOB. \n\nOh and the kicker was the drink was horrible and tasted watered down. Two thumbs way down.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-16", "description": "I have come here twice while working g in the neighborhood.  And cant figure for the life of me why the don't ask me my name or call out the drink. Expresso is meant to be consumed fairly quick. But both times my order sat on the bar. \nAww well. \nNot to mention. I should not drink Starbucks anyways. Coffee brewed way to hot and beans burnt", "author": "Kenneth S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-16", "description": "I really like the girl barista ( sr I fogot her name) . Everytime I came , she know my name and favorita my drink ,that's great !!!Good place for stdy or work if you dont come at the morning.", "author": "Amelia D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "Even though there are about 50 coffee/tea shops on this block, I like the benches outside.\n\nCame here to try the chai chocolate latte, didn't like it, but i did sit outside and people watch.  \nDuring the day this shopping area is pretty busy with brunch-goers, momies, nannys, and dogs.  LOTS AND LOTS OF BEAUTIFUL DOGS.\n\nBut staff was nice and they have a good size bathroom.  The end", "author": "Hazel K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-02", "description": "I live in the neighborhood and have been a semi regular customer here for about a year now.\n\nI've debated whether or not to write this review, as it was a one time incident that has forced me to never step foot in here again. Every time I think about it, it irks me, and I think this Starbucks and its patrons would appreciate hearing this story.\n\nOne Sunday morning, my friend and I came in at about 10AM to get coffee before a hike. As I enter and walk about 8 ft, I hear someone yelling from the way back of the store \"WATCH YOUR STEP!\"\n\nI look down to realize I've stepped in a very large steaming and wet pile of dogshit (verging on diarrhea). And so had another patron that entered seconds before me.\n\nI also realized there are dogshit footprints all over the floor from previous customers or whomever stomping into the same pile.\n\nFinally after the shock wore off, I hopped over to the condiments bar with my clean foot to grab napkins, and an employee ran up and started yelling at me to sit down.\n\nI attempted to clean it from my sneaker but it was embedded in the sole so I had to hop with one foot all the way to the back bathroom. \n\nAfter dry heaving a bit and successfully removing all the shit from my shoe in the bathroom, I started to leave with my friend - OBVIOUSLY we were not craving coffee or food any longer.\n\nAs we were walking through the store to exit, the same girl that yelled at me to sit down earlier, yelled from behind the counter: \"Sorry about that, TRY to have a nice day!\"\n\nWhat upsets me is that she or a manager didn't come up to me to apologize privately and sincerely and offer me a fucking free drink. \n\nAnd also the burning question I have for management: WHY THE IS THERE AN UNATTENDED PILE OF SHIT NEAR THE ENTRANCE?? INSIDE OF THE STORE???? Especially when it was clear they knew it was there. Have a spotter there for God's sake!\n\nThe whole situation was handled SO poorly, I cringe at the thought of walking in here again.\n\nSeriously, just drive the extra 4 blocks to Philz - better coffee, better service, NO DOG SHIT.", "author": "T W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-01", "description": "The local Starbucks. Obtained my first holiday cup here before Thanksgiving then walked across the street to take some pictures of the Christmas lights that lined the street. Great post -dinner experience.", "author": "Joshua F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-01", "description": "Starbucks is like any other quick-service food chain... You've been there at least once so you know what to expect.\n\nWith that in mind, a few things I noted:\n\n-Quick service at the register\n-Not overly crowded. People come in, then get out\n-Empty seat/table available so that I can sip my drink and surf the web in peace\n\nIt was a beautiful, sunny, hot Noe Valley day and walking along 24th Street made me thirsty... so I stopped into Starbucks for an ice cold refreshing Vanilla Bean Frappucino... HOWEVER I noted the following:\n\n1) Yes I came in to sit and cool down and sip my icy drink but the AC was blasting too much that I couldn't stand it anymore and figured I might as well take my chances in the sun and risk sweating/heatstroke than to freeze inside Starbucks.\n\n2) There was something in my Vanilla Bean Frap that was... Missing. I couldn't quite put my finger on it but it was the most bland, unfulfilling VBF that I'd ever tasted. It didn't taste like a VBF... just some crushed ice with milk and whipped cream.. It lacked... something. Maybe it needed a bit more vanilla flavoring?\n\nMaybe I'll ask for an extra shot of vanilla flavoring next time and see if that does the trick??", "author": "Joraine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-26", "description": "At the direct heart of Noe Valley is this pulsing, busy, bustling Starbucks.\n\nAnd while I could get nostalgic for the Noe Valley I knew before I moved away from SF, I will just say I've noticed that change in the 'hood seems to have steeled the employees here a bit.  \n\nAs a (now) interloper, they just aren't as friendly, as welcoming.  But they aren't mean or aloof, either.  They're willing to return a smile, but maybe won't offer one first...   They're getting it done.\n\nThe dog-watching outside is incredible!  Thank heavens for those benches.\n\nYou know, I think I could sum up how I feel about this Starbucks this way:  On my last visit, I managed to snag and have a chat with a terribly handsome bloke.  Disarmingly handsome, barrel chest, good attitude.  But his name was Dave. (The Daves are always bad news in my life...sigh.)", "author": "Evan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "I frequent this Starbucks more than any other, and have always been greeted by a sweet smile and a happy \"hello\". That  is certainly evidence of very good training :)\nIt's a great spot for a mid-morning coffee break. And their pastries have really gotten so much better. \nI actually appreciate seeing the long time employees, being there year after year. It shows loyalty on both sides. I'll be there tomorrow ;)", "author": "Rita B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "On a recent afternoon when the coffee shop was completely full two tech workers had taken over the entire front corner of the store; 2 tables, 8 seats in total. They were not drinking or consuming anything from Starbucks, one actually went so far as to break out his homemade lunch. When I pointed out to a manager what was going on and that they were taking seats from paying customers I was told that the two mean had been there all day and the staff of the store did not want to deal with them!", "author": "Brian K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-23", "description": "Pleasant staff.\n\nLeather cushioned seats/bench by the windows.\n\nOpen till 10 a.m.\n\nFree wifi slow as molasses as per Starbucks standards.", "author": "Inigo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Good customer service, relaxing place, and they steamed my milk super well! I love it. I come from SoCal and I will definitely visit this Starbucks again when I'm in NorCal.", "author": "Frankie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "There is a guy who works here weekday mornings that will transform your name...aka Emily = Emmaleigh.  Cute way to start my morning.", "author": "Emily Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Love this Starbucks for three main reasons:\n\nLocation \nService \nGood Music \n\nAll the employees are friendly, their background music is perfect for relaxing and getting work done or simply meeting with a friend. They play classic old jazz, quintessential SF style in Noe Valley!", "author": "Sushma S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-30", "description": "Poor attitude by cashier Makayla and received dirty cups filled half way with beverage in a dirty facility. Do NOT come to this location.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "This is the first SBUX I've seen that has the loaner charger attachments here in SF. That's a plus. Usually limited seating, so don't plan on sticking around here. They usually don't have as many people working the bar as they should, so waits should be expected. Either way, still a solid store.", "author": "Shawn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "I come here for two reasons: the baristas are ALL really cool and friendly.  They remember your name and your order. . . if you go often enough!!!  The bench window seating is a great place to chill, drink coffee, eat breakfast, and lock down your toddler who can doggie/people watch while not running a muck, annoying the study goers, or getting in peoples' way!!", "author": "Karin E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "THE friendliest baristas!\nAND, they're knowledgeable about their products and brews!\n\nCame here on Halloween and the day of the Giants parade and everyone was all smiles despite the crowd! The boyf decided to ask which brews were higher in caffeine content and one of the baristas totally gave us a little factoid that we didn't know!\n\nI love Noe Valley, SF, and this Starbucks was great!", "author": "Riana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-17", "description": "My #1 issue or concern with most restaurants and cafes is the customer service.\n\nThat's why this Starbucks gets 5 stars.  The service is spot-on 99% of the time.  I consistently am greeted by a fun, respectful, and friendly barista.  They all have unique personalities and seem to work together well as a team.  I'm equally impressed that they can handle the morning rush with ease and speed.  And if they make a mistake, they fix it quickly and without a fuss.\n\nThe location is pretty spacious for the City and I can usually find a table to sit at and work.  Occasionally the interior can be chilly and I've had to ask them to turn up the heat.\n\nI just wish all Starbucks were as pleasant.", "author": "Kellan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "Laptops to the side, children to the middle.  The line gets stupid kinda long way too often, and I'm not really sure why.  I do very much like it here and often work during the week perched on the perimeter benches.  There's a pretty friendly staff, good coffee, free wifi...a lot to like.\n\nHowever, to address some residents, what gives?  I dont need to be slobbered over by your giant dog that you tied to the bench by the front door while you grabbed a latte.  I also dont need to see you prance in with your little dog off leash.  All that time you were deciding on which scone to get, your little dog is running about behind the counter and under tables, eating whatever it can off the floor and sniffing at my bag.  Curb it yo.", "author": "David S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-30", "description": "I don't know when this came to pass or why, but something marvelous has occurred at my favorite Starbucks in San Francisco: Bitter Barista Man is no longer employed here.\n\nAt long last, I can return to indulging in my lovely Frappuccino-induced hazes without any sourpuss to ruin the splendor!\n\nAs promised, here is my updated review.  Thanks to all you beautiful men and women of Starbucks Noe Valley for your 5AM smiles and 8PM fabulosity.", "author": "Brendan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-12", "description": "It's Starbucks, so there is no need to talk about the food or drinks... if you've been to one, you know what you're getting...\n\nI'm of the fan of the Noe Valley location for the big windows and two restrooms which you don't need codes to access.\n\nCons: The restroom was dirty, as in t.p. everywhere. I'm surprised there was any left for those of us who may need it. Also, there a quite a few one or two person tables, but unlike other locations, there aren't any nice big tables.\n\nThe baristas were nice and the drinks came out fast. Another Starbucks success.", "author": "K A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-10", "description": "While I realized that I've talked about this Starbucks in some of my other reviews, I just now realized that I had never actually reviewed this location! \n\nBottom line - you know what to expect beverage-wise. However, the staff at this store is phenomenal and the atmosphere is amazing. The store is clean, the booths are comfortable and each and every barista is kind, open and talkative. \n\nSimply a great place to get a coffee.", "author": "Tom A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Accommodating staff, neighborhood atmosphere, la Boulange pastries. The fact that there is two bathrooms is a big help. Super clean inside and out.", "author": "Roxanne O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-04", "description": "First time I experienced an awful Starbucks.  Horrible cashier--she couldnt understans name, give an order correctly (two dark roast drips), and forgot to put in our bfast sandwich.  Then her help kept screwing up on which roast!  Awful", "author": "Jez S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "This Starbucks has extremely attractive, well-groomed baristas.\n\nI sincerely appreciate the whitewashed walls.\n\nTwo bathrooms.  Neither of which require a key or code.\n\nMusic is not distracting as it can be at a lot of Starbucks.\n\nStaff did a kind thing for me, too.  I can't say...don't want to get them in corporate trouble!!\n\nAll in all, very laid-back.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "I don't live in the neighborhood, but I go out of my way and have been doing so for 3 years. The early AM staff are cool. I think any place that opens at 5am to serve us GRUMPS coffee is cool. Place is clean and the coffee is fresh. If you don't know what you want they'll help you decide. My favorite Starbucks by far!", "author": "Matt O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-01", "description": "Employees are fast, friendly, and keep the place spotless. Good music and ceiling fans. Comfy suede benches. Clean bathrooms. Wish there were more tables and that they hadn't replaced pumpkin with peppermint on Nov 1!!!", "author": "Heart T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "I love the location on the corner, and that they have 2 bathrooms, unlocked!. Its pretty crowded most of the time, but the employees are nice, and never had an issue with my food. Come here daily.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "Totally standard Starbucks location -- efficient workers, convenient location and what not.\n\n+1 star for the baristo who always spells my name G-I-N and yells out \"Latte for Gin!!!\" Good morning to you too!", "author": "Jen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-04", "description": "Poor wifi sunk this coffee shop for me.\n\nI worked in 5 different coffee shops in the last 36 hours.  While this Starbucks was decently sized and has lots of natural light, let's face it, you can get that in a lot of other coffee shops.\n\nFor me, it was important to be able to get online.  This Starbucks is seriously bandwidth constrained.  Brought back the days of \"world wide wait.\"\n\nSuggested alternatives: Dolores Park Cafe not far away at Dolores and 18th, or Ritual on Valencia (and 21st, if memory serves).  Not sure which other spots on 24th St in Noe have free wifi or even functioning paid wifi.", "author": "Nathaniel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "Before I drove to Carmel, I went here for coffee.\n\nWhite mocha for me and Cinnamon Dolce fo him.\n\nBecause its in Noe Valley, everything is great.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-20", "description": "There's something lovely about Noe Valley. I guess it's the small town feel in the middle of the big city. Everyone talks about how friendly the staff members are. It's true. They are extra friendly compared to those in other Starbucks location I've been to. Most importantly, it's where I found my love for Cheese Danish. That's review-worthy!", "author": "J A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-21", "description": "In the morning there often are 2 and sometimes even 3 homeless people sitting at tables. One keeps scratching herself", "author": "Rick P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-06", "description": "Awesome and friendly baristas and they also remember your name. Central location, has that neighborhood feel to it. Great place to meet with people to chitchat over coffee. Outdoor sitting available. Wi-Fi is free and fast. Wish they have couches instead of those stiff chairs.", "author": "Thea T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "This review is for a very sweet barista there. A sweet sassy young guy with reddish brown hair. I had just gotten off work and was not in the best of moods and he brightened my day up with little jokes and his friendly demeanor. Great customer service from him!", "author": "NellieBell L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "I come here at least once a week after I drop of my mom to work in the morning. I've never had a problem with the morning crew. They're friendly & they provide quick service.  One of the guys recommended their bacon, gouda breakfast sandwich & it's been one of my regular starbucks items to buy. I don't know the name of the barista that always makes my drinks...but she's quick & she remembers all the \"regulars.\" \n\nParking sucks, but after going around the block once or twice, I usually find a space.", "author": "Michelle F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "How does one review a Starbucks. They all are supposed to be the same right? Well call me bias but I like this one. Maybe it is because I live in the neighborhood and this location is within walking distance. But what ever it is this I like this place and better than most Starbucks!\n\nNow if you plan to bring a kindle, ipad or laptop to do a little work expect seating to be limited. It is on the smaller side and typically pretty busy. However if you are lucky you might snag a spot in the window and have a perfect perch for fantastic people watching.", "author": "Ryan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "For being a large company, this Starbucks has certainly created the feel of a small local business. It is always busy with people drinking, eating, gathering. The service is very nice and friendly as well. I come in all the time, and they always have a smile on their face and a great coffee waiting for me.", "author": "Andy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "This place is really hit or miss like indian food that's really tasty but could send you to the porcelain throne every 10 minutes.\n\nI've had wonderful times here in the evenings churning away at my laptop in the lovely, predictable Starbucks ambience. \n\nAnd other times this place feels like Hogwarts when the nearby school gets out and kids are practically playing Quidditch inside. Guh! It just makes you want to snip your vas deferens right then and there.\n\nBut you gotta give them cred for having predictably good coffee, free wifi (if you've bowed-down to the AT&T lords) and plenty of seating. Sometimes I prefer going to other nearby cafes but there is no one cafe to rule them all in Noe.", "author": "Pete C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "Does not appear to be your typical Starbucks from the outside, other then a small Starbucks sign hanging on the corner. Very cute with helpful baristas who are eager to satisfy your caffeine craving. Try the \"dirty chai\" latte (chair latte + expresso) for an extra kick.", "author": "Ali A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-07", "description": "I think I've been to every Starbucks in San Francisco and Daly City.  This is the the snootiest one. \n\nNow you are probably thinking I'm one of those high maintainance customers that need their coffee to be at exactly 120 degrees (true story), but I'm not. I am perfectly happy with you just pouring my coffee and me paying too much for it. \n\nOne thing I gotta say to this morning crew. I don't wanna be awake this early either boo, but please take out the bitchface with my coffee. Thanks......", "author": "Christina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "Always fast and friendly!  Not always easy to find a seat, but I'm a lover of Starbucks!", "author": "daniel l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Everyone who works here is so nice. John and George are the nicest of the all.", "author": "Lawrence G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-29", "description": "When I tell my friends that my favorite place in Noe Valley and Mission is this Starbucks I get awkward looks of disapproval - Starbucks is not in fashion. Luckily I never cared about what's fashionable and I owe this place months of wonderfully spent productive time, so I think it deserves a detailed positive Yelp review from me!\n\n\nWhat's great about this place?\n\n-- the lighting: plenty of daylight on a sunny day, still plenty of light on a foggy day, pleasant warm artificial lighting in the evening\n\n-- the atmosphere: a good balance of people coming here to chat with friends, spend time with their kids/parents, study, read, work; good mix of different ages, cultures and types of people\n\n-- the decor: very well done interior (but nothing extravagant); I love that they change the artwork on the walls from time to time, and the quality of the artwork is actually respectable\n\n-- the staff: always friendly, they take time to listen to the orders and gladly accommodate special requests\n\n-- the music: just the right volume level, just the right energy level, chosen with a sense of taste\n\n-- the \"library\" aspect: I can study/read/work here for an unlimited amount of time - stayed as little as half an hour, as long as the whole day (and I am not exaggerating when I say the whole day); there is free wifi, albeit it is a bit too slow for my liking\n\n-- the cleanliness: not so uncommon in Noe Valley, but can be difficult to come by in some neighboring areas\n\n\nWhat's unique about this place?\n\n-- It's open till 10/10:30pm. As far as I know there is no other cafe in Noe open this late. \n\n-- It actually has decent cafe food for less than $5. Anybody knows of another clean cafe open late that would serve food for this little in either Noe or Mission?\n\n\nAll in all, this cafe makes me happier every time I visit. Hope you feel the same next time you head there.", "author": "Rika A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-30", "description": "One of my go-to study spots. nice area, friendly baristas that know my name and personal order before I order.", "author": "Michael L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-16", "description": "I really don't care if one of the girls behind the counter has the wrong color shoes on. The three ladies working this morning couldn't decide if they should say something to the other lady about her shoes and then decided to ignore everyone in line and discuss shoe color and uniforms and god knows what!!!\n\nPleaseeeee just take my order and give me my coffee!!", "author": "Kathleen E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-16", "description": "This is my local Starbucks (live across the street from it) and me and my family unit love this coffee shop. We hang out there a lot, as if it were our second living room. Super friendly baristas who really seem to know you (well, your name, your order and your family...;-). So it feels familiar and very friendly every time. I know you're not \"supposed to\" like Starbucks because of the chain and stuff, but to me this is a local coffee shop!", "author": "Viola M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-07", "description": "My daughter lives in Noe Valley and I visit two to three times a year. I'm a loyal Starbucks customer and have been to Starbucks in London and Zurich. But I will not go back to the Noe Valley location because of only one staff person and her name is ROXIE! She goes out of her way to be rude to me; she obviously remembers me (always says, \"what do you have again?\"). But always forgets to get my food and drink and when I ask, she says that someone else took it. The last time I was in, she started yelling at me to go to the other side of the bar to pick up my drink, when I was going in the opposite direction to use the restroom. She goes out of her way to be rude to some customers and incredibly nice to others. But she NEVER forgets to be rude to me. Too many other great coffee places in Noe Valley to go back to this one.", "author": "Jan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-26", "description": "Roxie was very rude and condescending.  She yelled at me when I asked how I was to use my birthday reward. She snapped back, how you never used your app before? SCAN IT! sc---an it. It turned out that she didn't even know how to give me my birthday reward.", "author": "Lily K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-02", "description": "I've visited this location quite a few times since I work across the street. Unfortunately, I haven't received friendly service on a regular basis. Although prompt, other aspects of service have been lacking and quality has been inconsistent. Today was my last visit there because my drink was made incorrectly, without the extra shot or whipped cream I ordered as well as priced higher than usual. I inquired about the price difference but was responded to with a smug attitude and vague reasoning.  Convenient as it was, I'm bummed to say I won't be returning.", "author": "Cheyanne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-07", "description": "People who complain about fattening coffee drinks need to shut up because if you really don't want to get fat, then here's a hint, momma: take it black. Coffee has zero calories & zero nutritional value. What did you think would happen when they added cream & chocolate?\n\nThis particular Starbucks holds a special place in my heart. When I lived in the Mission, my boyfriend & I used to stop by when we would take walks in Noe Valley to escape the roommates & we would sit outside and narrate people's lives. We once speculated, rather loudly on what was truly inside the vanilla frappucino. The khaki wearing, preppie ladies, who looked like seven sisters college graduates, were absolutely not amused.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-14", "description": "Before you go off on \"oh there are so many other better places than Starbucks for coffee\" and \"gee, do everything they make have like 8,000 calories?\", I like this one for a couple of reasons:\r\n\r\n- there are two very wide and comfy benches in the window\r\n  (although for those of us with short legs we end up\r\n  having to dangle them far above the floor like you're\r\n  in a highchair)\r\n\r\n- very easy to get to at the corner of 24th and Noe\r\n\r\n- strong wireless signal with plenty of power outlets\r\n\r\n- fairly friendly staff\r\n\r\nAnd if you really don't like the coffee there are several other coffee options right next door...\r\n\r\nTimes visited: 5+", "author": "Amy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "i'm here now on a lovely sunny day in Noe Valley.  employees are super nice.  really nice clean store, lots of tables to work on or just sit at.  it's an uppity family-style neighborhood so i expect to be around crying babies.  what i didn't expect was to have a baby's diaper changed right next me on the same bench nose shot away while i'm eating my was-delicious veggie artisan sandwich.  the mom knew it was stinky because she was talking to her kid in her baby voice \"stinky... you so stinky\"  no shit lady. i mean yes shit, there was definitely shit.  so i wait it out the changing, she finishes up, and then rolls up the used diaper and puts it on the floor by her feet.  still stinky.  get up and toss that shit.  i'll make sure nobody steals your stroller while you get up and walk 12 feet to the bathroom.  \n\ni know this has no reflection on the store or employees, except that there are cameras up, but is nobody watching them? maybe they're for after hours, and that's fine.  so i didn't do my good citizen's part and tell her not to do it right there, but i was in shit shock. i think i still am since i'm writing this review- but the 3 stars are for my overall experience.  if this didn't happen, it'd be a 5... ish.", "author": "Monk R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-15", "description": "Oh how I love my 14th St. Starbucks!  Not so much for the food and drink (at that hour in the morning, I hardly know my name without coffee... so any coffee is good coffee at that point),  I go because I love those folks!  The atmosphere in there is just lovely, not just the art on the walls and the comfy window nooks, but because the staff is TRULY LOVELY!  Friendly, upbeat, quick, efficient... they always remember my name and my order and I always leave with a smile.  My day just isn't the same without my morning trip there.  \n\nIgnore the chain aspect of the store... go if you like your morning coffee served with personality and friendliness.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "As I wait for what seems to be a millennia for my wireless to be installed in my new pad, this Starbucks has been very helpful in allowing me to check my mail and surf conveniently close to home.  The service so far, meh.  They are never overly friendly to me but I don't really go to make new friends.  The coffee was true Starbucks coffee with no complaints.  I've noticed the weekend staff is a little more friendly than the weekday staff.  This could be just coincidence but I have noticed a trend.  I have no real complaints and I love that the place has a lot of light for those sunny Noe Valley weekends.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-25", "description": "I stopped by after caroling the other day. This Starbucks lives up to the chain's reputation of providing a comfort experience. Their coffee is spot on, as always. I ordered a vanilla latte which tasted great but could have been a tad hotter. \n\nThis location in particular is nice, if a bit small. It can be cramped with long lines in this vertical oriented store with limited seating especially during the holidays.", "author": "R K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "As far as Starbucks locations go, this is a good one.  A good amount of space to hang out and watch the strollers go by and the staff is always friendly.  I've never even seen it too crowded, so when I'm in a hurry I know I can stop here... if I'm able to find street parking that is.", "author": "Laura P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-20", "description": "The customer service here has suddenly gone down hill.  At the peak of the morning rush there is usually only one person on the register and one person making the drinks.  The result is a line back toward the door and a wait time that increases with each visit.  \n\nThat alone would have only knocked their rating down to two stars.  But today, I show up and find bugs flying all over the pastries.\n\nYeah...thanks...but no.  If they can't keep their store clean enough to prevent bugs from flying on their food, then I will gladly take my coffee business to Spike's in the Castro.\n\nAbsolutely disgusting.", "author": "Wayne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "This is my neighborhood Starbucks. The staff is good and I like the coffee. However, I despise the new decor. Yuck. I'll keep going there because it is the only Starbucks in my neighborhood. The new decor is cold and stark. Too bad, but the service and products are good.", "author": "Michael W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-06", "description": "I really doubt you're scrolling through these reviews to see what the service / quality of coffee is like at this particular Starbucks. Or any, for that matter. In fact, you're probably only reading this because you're also writing a review for this Noe Valley location.\n\nSo, I will tell you a story instead.\n\nThe other morning I went in early before work. After ordering my drink, I heard a tinny \"beep, beep,\" and saw one of those god damn meter maids in their Interceptor. Apparently it was street cleaning morning and the Interceptor was giving a get out of jail free card to someone. A few more beeps, then SF's finest get into the mix and yell, \"Hey, silver Lexus, New Hampshire plates!\" Some lady jumps up and goes, \"Oh, me...\" obviously confused by what was going on. Everyone puts their two cents in about it being street cleaning.\n\nI look at the cop in front of me and we both shook our heads like, \"tourists,\" possibly the first time I've ever felt camaraderie with a cop. Then she said, \"That was nice. VERY nice.\" And then I remembered why.\n\nThe service here has only been beyond mediocre once. Workers tend to look like they're zoned out. Not particularly friendly. Not entirely hostile. I'll probably start going to Bernie's and hope they induct me into their cool club.", "author": "Salina Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-27", "description": "Is this the typical Starbucks with all the same drinks? Kind of but not really! The seating is what makes this location stand out. I liked the cushions by the big windows. It's nice to sit there for a bit and people watch while the time passes by.\n\nOoohhh... check out the CD sale. Most of the stuff is on sale for $7.99.", "author": "Teresa Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-18", "description": "Thank goodness there is a Starbuck's in my neighborhood. \n\nThanks to Starbuck's I can get a chocolate buzz from their delicious Hot cup of Chocolate anytime. \n\nThe prices are reasonable, that's why I keep coming back!", "author": "Bianca B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-12", "description": "Lovely staff, good location, but once again they were out of stuff! Last time it was soy milk. This time, I stopped by in the morning on my way to work, but no chai. The staff were appropriately apologetic and all, but management needs to get its act together!", "author": "Laura H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-18", "description": "My favorite Starbuck in the City! Home away from home ;-)\nLove the cheerful staff, comfy window seats and killer frappuccinos.", "author": "Jini R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-17", "description": "Ah, the ultimate in Yelp resume padding: a review of a single link in a massive chain. And not just any chain, the most ubiquitous chain to ever look across the street and think, \"You know, there are customers over there who aren't coming in me, I think I'll open up there, too!\"\n\nThe sameness of Starbucks is at once its strength and weakness. You can bank on a guaranteed 3-star coffee or americano anywhere in the United States. It has become the average by which all cafes are now measured. Starbucks offer all of the things you expect from a cafe, without any of the hassle of experimentation. \n\nThis Starbucks, however, does a decent job of fitting in to its Noe Valley environs. I can't imagine that the benches in the window were their idea, but they get props for not taking them out when they took over whatever used to be there. It also has one of the only public bathrooms on 24th Street, and  there's a LOT to be said for that.\n\nBeen there over 20 times. Had many meetings there, and sat there in the window with my toddler son while he pounded on the window watching the dog walkers go by and I got just enough juice to chase him down the street. The crew is friendly, the service quick, and they never glare at you if you walk in and grab the restroom key first, order (or not) second.\n\nThese days this Starbucks has become the back-up to the recently re-localized cafe across the street, and seems to have plenty of seating.", "author": "Greg Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-08", "description": "The closest to where I live is here and it's far. At least it is in a quiet area to relax and avoid loudness from the outside. Cannot complain.", "author": "C G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-16", "description": "I went to the neighborhood starbucks the other nite to meet a friend. I would have gone to our local coffee/tea shops, but they were closed. They close at seven and 8 at night, which is ridiculously early... it does not leave room for people to meet over coffee to chat. Anyway, this starbucks is open till ten, and there were people in there. They sell the usual starbucks things (tried the vanilla roibos tea latte finally, its good!) but it seems a little less shiny than a usual starbucks. Lots of space to sit and a little more worn, not as bustly rushy. More neighborhoody local.  I liked it.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-18", "description": "Music too loud for any real creative work, but wow, does that pumpkin spice latte go down easy. Unusually spacious and airy for a Starbucks, with some longer tables as well as the standard only-large-enough-for-a-small-lap-top disk tables.", "author": "Joy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-28", "description": "I'll admit that I am a sucker for Starbucks. I love those holiday cups, the wonderful aroma and the Christmas music playing when you step through the doors. The White Peppermint Mocha, Gingerbread Latte, and Pumpkin Spice Lattes are delicious.\nOne of my favorite places to go when I need a pick-me-up, but I will say that you can almost never find a place to sit.", "author": "Catherine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-28", "description": "Meh. It's your average Starbucks place. Almost all of our orders were more or less messed and mixed up. But oh well..", "author": "X O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-22", "description": "I'm not going to lie, I am a big Starbuck's fan--always have been. Since moving to San Francisco, this location in Noe Valley has become my favorite. You know how Starbuck's idea behind each store's interior design and ambiance is said to reflect the neighborhood in which the store is located-well this Starbuck's design did a great job of just that. It is mellow and airy inside, with great lighting. It can get a tad too busy/loud for my taste at times, but that is usually only during rush hour. It is one of my staple spots to go and work and sip.", "author": "Nichole P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "I'm updating my review because this 'Buckys just keeps getting better. They did a renovation and now the space is GORGEOUS and where there used to be lack of seating, there is MUCH seating. Also, they now have straws a the sugar/milk station thingy, AND I haven't run across any grumpy baristas yet -- maybe they sacked the grumpy ones and hired some nice friendly new people. Yay!", "author": "Brooke H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-05", "description": "I've seen Starbucks stores of similar size or smaller with more seating than this location!  In the n times I've been here, I've never been able to acquire a seat, lame!  The workers are friendly enough though, but the baristas can be a little slow.  I do like that they usually have a good selection of on-sale merchandise, not that I've ever purchased any of it, but it's nice to know they're there.  The store is also dog and kid friendly, but it's Noe Valley so I guess that's expected.", "author": "Vicente G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-19", "description": "Long story short, I switched jobs and I go to this Starbucks because I \"have\" to.  It's my only option on my commute and I really can not survive without my morning drink.\nLike a few people before me have said, the service here is nothing better than mediocre.  There is a certain barista there that I don't quite understand.  Whenever I see him behind the drink bar, I know to add ten minutes on to my commute.  Things just are never quick with him.  It's very irritating.\nThere's a woman there that feels the need to tell her life story to everyone.  Don't get me wrong, I love a good life story but not when it interferes with the time in which I will be able to consume my beverage of choice.\nBecoming a regular here is a bit more difficult than at my previous starbucks.  They seem to look at me like I am a stranger every morning, I have been coming here for several months and I am anxiously awaiting the day when they have my drink made for me before I even walk in the door.\nI suppose that's all.  Three stars and I'll keep coming back...", "author": "Meghan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "Amazing Starbucks with plenty of space to hang out and people watch. Neat neighborhood with a good amount of eye candy. Keep an eye out for the adorable tiny blond barista.", "author": "Rey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "When I am in town visiting my friend that lives in Noe Valley this is the Starbucks we hit every day (she goes here every day since she lives here). They have the friendliest staff and the coffee is always spot on. Their food selection is nice and fresh!", "author": "Kari S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-25", "description": "THE BEST STAFF EVER!  I would list their names but I'll allow them to remain anonymous!  This is by far my favorite Starbuck's EVER!  Manager is super great, everyone is friendly and they get the drink right and nice and hot!", "author": "S B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "This Starbucks and I got off to a slow start together, and now we are the best of friends.  I love their employees.  Most of them know what I order, and I always feel very welcome there.  They have fresh pastries, and a nice selection or adorable mugs that I can't stop getting my boyfriend to buy for me. ;)", "author": "Jenn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-08", "description": "A starux is a starbux is a starbux - you can always count on a decent cup of coffee, nice ambiance and good music. I enjoy stopping by this starbux to get a mid day caffeine buzz!!", "author": "sonam d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "Typical starbucks but beware of the line in the morning.  The queue can backup pretty bad", "author": "Sam G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-22", "description": "mayra is the worst starbucks cashier. came in today for a coffee and while i was next in line she had to turn her head to a barista and carried on a conversation for a good while before taking my order. way to go mayra!", "author": "Bree B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-31", "description": "I have been a couple of times to get coffee which is quite scary as so far it is the only place I found that does a good coffee.  Why can't someone learn how to froth milk - it is suppose to be creamy and gooey not like airy and holey!", "author": "Tiffany S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-07", "description": "go across the street to Bernies. The coffee is so much better you'll never return to SB", "author": "Michael F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-27", "description": "oh gawd---what did they do ---  it looks like a cheap redo\nice cream parlor---what's with the white--and nooo comfort---was\nhopin' for some comfy chairs. did they get a new designer?  they\ndidn't even refinish the floor.  It's like the first remodel that's retro\nto the previous. what's up *bucks?", "author": "Julia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "Starbucks is great!! My top picks: java chip frappuccino, caramel frapp, passion tea lemonade (unsweetened), mocha doubleshot (canned), and peppermint mocha (holiday special). It's really convenient because I go to school near there. I'm young, but my mom is a coffee fanatic so I take after her. I can't go anywhere after school without my afternoon mocha doubleshot. I don't really pay attention to the pastries, but a good food item they have is tomato and mozzarella hot panini that they heat up for you. My dad always nags about it being a corporation because he doesn't approve of coffee or corporations. I don't care, though. Starbucks may be a corporation, but it has the best pick-me-ups!", "author": "Massie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-12", "description": "Good coffee, friendly staff, and they helped me get my phone back quickly when I left it on the counter.", "author": "Avril S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-30", "description": "BUT ONLY 2 STARS  FOR THE CUSTOMERS!!!!! People who have seen the \"Donate books for Children\" bin right by the coffe pick-up counter, and PLACED THEIR TRASH IN IT, need a lesson in respect and compassion.  If you're not going to be cool enough to donate a book (which I haven't either) Then there is no reason you need to be so stuck up and lazy to not put your trash in an actual trash bin you pass on the way out! NO excusses Noe Valley consumers, NO EXCUSSES!!!! Thats not just a slap in the kids faces but a Biotch slap!", "author": "Eric O."}
