{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "I get the same thing from every Starbucks, a black tea lemonade with two shots of raspberry and cane sugar. I have one heck of a sweet tooth! This Starbucks location got my order right and out fast. Depending on the time you go it may be busy, but the line always moves fast and the staff is friendly. They can be stressed l, but are very nice people of you are respectful.\n\nFinding a place to sit is near impossible, and finding a wall outlet to charge your electronics can also be hard because it is very busy most of the time.", "author": "Libby M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-25", "description": "Hi Starbucks West Portal. \n\nPlease stop stocking items in your pastry display that aren't for sale. It makes for a crappy experience. If you are out of an item, pull it from your case. \n\nWe make item decisions while waiting in line, in view the case. It is deceptive to give false choices. \n\nPlease stop this practice. \n\nYour customer, at this location, 12 years and counting.", "author": "Christopher K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "I live my west portal Starbucks.  Such nice Baristas.  Matt, are you the Manager?  You are so nice and a highlight to my morning.  I just love Starbucks.", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-18", "description": "I ordered decaf coffee and a croissant. Not warmed up. Apparently the order taker cannot reach into the pastry display and grab that; another person needs to do that. It took 11 minutes to get that darned croissant. That's unreasonable. I'll try Peet's up the street from now on.", "author": "Maggie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Special shout out to the amazing team at the West Portal Starbucks! Always cool under pressure no matter how busy it gets. Friendly, attentive and smiles the whole time. Keep up the great work!", "author": "Rebekah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "It's a Starbucks. Just came here to check the hours but now I have to make fun of reviewer Melissa: \"I normally do mobile orders to minimize the time I am there. Doing so today, there was still a bit of a wait. The barista simply called out my name for the mobile order and then proceeded to work on the next. No greeting, no smile, nothing.\" \n\n...they made you the beverage that you paid for, after preparing beverages for people who got their orders in before you.  Why do you need more from a service experience than Being Served and Not Rudely?  Is your life so empty that you expressly go to Starbucks to make small talk with people who have to be nice to you, pay no mind to the line of irate customers forming behind you?  \n\nThis is my main work cafe when I'm in SF and employees here have always seemed extremely busy and helpful. I guess Can-I-Speak-to-Your-Manager moms can always find something to complain about.", "author": "Christina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-13", "description": "Ok to come during the week. I stopped by after lunching nearby and wanted to read a little bit. Couldn't stay too long since i parked in a 2 hour residential zone and didn't want to risk another parking citation in the City.\n\n I've been here years ago during a weekend and it was crowded. It's a small location and not that many tables, so i wouldn't try to come on a weekend. Except for this lady sharing the long bar table who kept clicking her pen on/off perpetually and banging her arm on the table (super UNCOOL)....she looks like a regular who comes and stays 1/2 day. Brought her lunch and laptop and work. Just wish ppl would be more courteus in a communal setting sharing a communal table!", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "Ordered 3 cold busters. I was not told that they ran out of  Teavana peach/mint tea. By the time i got home, i've realized I got defense tea bags. very disappointed, now i have to toss all 3 large drinks away.", "author": "John C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-29", "description": "I were so disappointed. I ordered maple pecan frap, but they made mocha frap. And its tasteless and not worth the money.", "author": "Khoa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Nice Starbucks on the corner of West Portal and Vicente. Fast, relatively friendly service. I like the fact that one of the workers came outside to clean the sidewalk. Bathrooms were also relatively clean.", "author": "scott h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "Yes, once again, this place is packed.  The line kept going and going...until it hit the door.  People in line were on their mobile phones, probably opening up the Starbucks app to pay- but none of them ordered through their phones.  So I did. \n\nAnd while they all stood in line waiting to order at the register, I picked up my drink and left.\n\nHope I don't sound too snooty here- at least half of the people in line had their mobiles out...", "author": "David B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-27", "description": "Maybe I always come during off times, but every time I come in this store always seems to be so dirty with straw wrappers and napkins littering the floors and tables. Their trash is always abundantly full and the baristas aren't the friendliest in the AM. They just seem to be focused on cranking out drinks rather than balancing customer service and efficiency. \n\nI normally do mobile orders to minimize the time I am there. Doing so today, there was still a bit of a wait. The barista simply called out my name for the mobile order and then proceeded to work on the next. No greeting, no smile, nothing. \n\nWell good thing this isn't my main Starbucks.", "author": "Melissa N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "This location is relatively small small so I wouldn't recommend studying here in the afternoon with a group of friends. I've never been here in the morning so I wouldn't know how the environment is for studying. I've only been here twice during my four years at SFSU and I wish  I came here more often that then Starbucks at Stonestown. \n\nI had a caramel macchiato my first visit and a passion tea lemonade sweetened less ice my second time. Both visits were great! I'll definitely return.", "author": "Danae L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-19", "description": "I stopped by for a cup of coffee last weekend. The place was so crowded we could not find a seat and had to leave. But before we left I took a look at who actually had a cup of coffee or drink in front of them. I saw one cup of coffee and everyone else was enjoying the wifi with nothing in front of them, not even water. I am not sure how the place is staying open.", "author": "Cray T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "It's my first time here. 10:30am on a Wednesday, its busy and my man, the dude with the rose plugs is killin' it! A mad man on the bar lol. Reminds me of when I was a barista and got into \"the groove.\" Busy store, great timing, and friendly staff", "author": "Jasmine C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-24", "description": "Between all the kids who all order blender drinks, the lukewarm order taker, and the signage for drinks they don't serve, this is the least awesome Starbucks in this end of the city.", "author": "ipvcake i."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-22", "description": "The service here is laughable. You can get here with the store completely empty and still manage to wait 15 minutes for a coffee. Keep your orders short and simple and be sure to speak clearly. Can't remember how many times my super simple latte has ended up as some crazy mocha or overly sweetened drink when that wasn't my order.", "author": "Dee R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-15", "description": "I typically stay away from Starbeezy's that are in neighborhoods such as these as they are packed full of kids on their laptops crushing seasons of One Tree Hill or Gossip Girl on Nextflix and constantly complaining about what this boy did to this girl and what she said about her... \n\nAnd this particular location is case in point. Stopped in to get a hot chocolate and the line was about 10 deep with not one open seat left inside the place as there are kids everywhere with laptops open not working on homework but instead sucking the wifi dry while they take part in the newest teen craze... \n\nTo \"Netflix and chill\" (well, these kids are actually chilling so get your mind out the gutter for a sec)... So I finally get to the counter and place my order and wait to hear my name called for my ridiculously simple order. After about 10 mins they finally called my name. I watched several people that ordered after me get their mochas and fraps and that sealed the deal for me at this location. \n\nThe staff working the registers were great but I am going to assume that the baristas know who their regulars are and they wanted to put them first?!  Whatever the case is I probably won't be back here anytime soon.  \n\nGood luck kids of this generation, it's time to stop streaming and start exploring in the world class city you live in... Just my two cents.", "author": "Josh H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-18", "description": "Worst customer service ever!  I would give 0 star if I could.  I was buying some pasteries to take to my grandmother, and the person who was taking my order got my order wrong.  I got 4 pasteries and they put it in separate bags.  I asked for a big bag, and they told me they ran out of big bags.  When I checked on one of the orders, it looked like someone bit off one of the pasteries.  When I asked for a new one, the person helping me practically threw the new pastry at me!!", "author": "Nicole S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-02", "description": "I can't believe this is the only SB location near my house that has Wireless Chargers! This is where I had my first date with a Latina (back when Singlesnet.com was popular.) Few memories . . .", "author": "Julio B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-02", "description": "The coffee they made is never the same, always different taste!  Can't never get it right!  Waste my time, waiting for a coffee tasted blend or too bitter!  The people here needs to retrained!  All the other Starbucks I went taste similar except this one!  Very disappointed", "author": "Terry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-04", "description": "Busy Starbucks.  Came with my daughter on a Saturday morning and pre-ordered with App.  Sat at the counter right by the pickup area at 10:15A and our orders arrived promptly. However, I had to ask 3 different baristas and did not get my cup of water until 10:45a.  One after one pointed at another barista to get one single cup of water while I sat there watching them. I know it's busy, but 30min for a cup of water is truly ridiculous.  When it finally came, the guy handed it off like \"Here, don't bother us\".  It wasn't like I'm not a paying customer.", "author": "Corrina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Passed through while on my road trip. Got a couple of hot drinks and was able to charge all of my electronics. Its really well kept and has clean bathrooms definitely worth stopping by.", "author": "Luis V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "Pretty standard Starbucks. Drinks are fine, staff are pretty friendly, and they make your drinks decently fast. Can't complain! \n\nI work across the street so I'm here at least once a week, ordering my caramel machiattos and eyeing the La Boulange pastries in the glass case. For all you rewards members, if you're looking to rack up some quick stars, the vanilla bean scones for $1 aren't a bad option! \n\nIt can be hard to find a seat here during prime times; around lunch and between 5-6pm. They have bar stool seating in the middle of the cafe and next to the front counter (where you can awkwardly stare at the baristas making drinks), a few tables with chairs, and a long counter-like table that faces the street - perfect for people-watching :) Good number of outlets to plug in. Wi-fi is super slow. You'll find students studying here, working professionals on their laptops, and seniors alike all enjoying a cup of coffee here. Great neighborhood staple!", "author": "Deanna Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "This place is always packed! I come here randomly throughout the day since it is the closest one to where I used to work, and I don't think I have ever seen it empty.\n\nThe baristas seem to switch out every 2-3 months or so. The newer ones are always shyer, but they all warm up in the end. The male baristas are noticeably friendlier and are the ones who make an effort to get to know their regular customers. The females, not so much.\n\nI usually order a unsweetened soy iced coffee, and they make it perfectly most days. The baristas are generally really nice about remaking my drink for me.\n\nI'm actually a little sad that I won't be visiting this place quite as often anymore! :(", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "Gross. Just gross. The store was disgustinggg. There was only one trash can (that I saw anyway) and it was overstuffed with empty cups and garbage. The area where you can add things to your coffee was a disaster as well. Milk and sugar everywhere. The service was okay. The barista was too busy chatting with a friend to give me any sort of acknowledgement. \n\nOn the bright side, my strawberry acai refresher with soy milk was super yummy. So at least there's that.", "author": "Taylor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "This review is long overdue! I encountered a lovely barista named Rose one evening and she was just the sweetest! Rose, if you are still working at this location, props to you! I would not be surprised if you received a promotion either. Thank you for the impeccable service!", "author": "Tina O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "Been here a couple of times. Iced Chai is as good as the other Starbucks. The seating's not that great & feels uncomfortable after 30 minutes. The AC blows cold & its really hard to sit on the corners. Besides, its crazy crowded.", "author": "Shahul H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "This is my go-to coffee spot since I live nearby, I love the fact that they remember my name and never get my drinks wrong. Come here during morning or night time, you won't be disappointed. By the way, their employees are well trained.", "author": "Renee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "We're from LA so we were kind of expecting the usual starb. employee. But they were so stinkin nice! They were quick to make conversation and made an effort to get to know us. By the time we were done talking to the cashier our drinks were ready! Wish this customer service was readily available back home :)", "author": "Leanne C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "My drink is always good! Some branch lack on the syrup but here is the perfect balance. They are efficient, they can be overwhelmed, especially on weekends mornings, but they manage pretty well.", "author": "Morea P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "I just had a great moment at this Starbucks in WEST PORTAL! \n\nI got my drink fast, I got made right and the Baristas were really cool! They were not Robots! \n\nI loved it! \n\nSpecial Thanks to Vero and Raffo! I may had messed up your names and I am sorry about that but the crew that was there at 1130 am on February 25th was awesome!", "author": "Adam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "A 5 star for best cafe in town.  Their coffee drinks are never bitter, their pumpkin spice latte frappuccino is out of this world, their service is fabulous(always with a smile)!!  THEY''VE GOT ENERGY BOOSTERS BUILT INTO THEIR TABLES FOR YOUR DEVICES TO RECHARGE.\n\nI try to go here as much as possible.  Compared to the other cafes in town, even vs the other starbucks in SF, they open the earliest and close the latest, giving me lots of time to work on my laptop.  There's long lines for their drinks, but their great drinks are worth the wait.  And their service is always quick with a smile and some faces you can't forget.\n\nThe cafe has a neighborly atmosphere with everyone from elderly to teens to even the police stopping by at night.  It has great viewing with large windows facing the street.  It's a small cafe, but has lots of seats and outlets with free wi-fi.  They even have mini-powering stations for your ipad, ipod?\n\nIt's nearby lots of banks, Walgreen's, a pet store, restaurants, a small fruit/vegetable market and a post office as well as being in West Portal Station with all the metro muni L, M, K buses.\n\nThe only thing that's a bother is if it's busy, their bathroom has long waits and runs out of bathroom tissue which I'm in the habit of reminding their staff about. And they only have 1 bathroom stall for men and only 1 stall for women while their cafe has LONG LINES out the door DAY AND NIGHT!!  The other thing is their pastries are super expensive - a small little donut or cake for $5???  I usually get my bag of pastries from nearby safeway's or other cheap bakery before coming here otherwise I'll have nothing to nibble on with my frappuccino.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "This SB has had an improvement in the staff training.. There's a customer who was making a lot of noise in the store today, his name is Greg.  Most of the regular staff know him by name.  He's clearly disabled and may have a mental health issue.  I was going to try the new \"chili mocha\" which I received a notification from SB was available to members for 3 days starting 9/3/16.  Alas, it was not true, this SB told me it was not yet released. \nWhile waiting in line, I noticed how well and respectful one of the staff treated \"Greg\".  She was a redhead with a short bob.  As she meticulously prepared the coffee orders, she would acknowledge \"Greg\" and replied to his repetitive comment.  \nIt was later, when a slender male co-worker arrived to work, who also knew Greg, told Greg to calm down (I didn't think Greg was upset or anything, just obsessive), told Greg they were busy and had to get back to work, and pointed towards the front door, while verbally, in a firm but non-abusive tone, told Greg he had to go outside/leave, and he did, with his cup of coffee in tow.   They should be commended for handling the situation in a diplomatic manner. \n\nI work with people who are sometimes disabled or have mental health issues and the situation could've escalated into something bad but the kindness the redheaded young lady showed Greg was just full of humanity.  This SB location should be proud of her.\nAnd she did a great job with my latte.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "I pretty much just sit here and use their wifi.  I think this place is swarming with all kind of people. Police, high school kids, college kids. bums, professionals, old people from Saint Francis woods. It's a mix of people. This is the craziest starbucks there is in san francisco for sure. I saw ATT premise technicians discussing game plan for an install. I saw people grading papers for their classes. I guess they were from sf state as assistant professors or TAs. I acutally bought a  tall chai latte.", "author": "Selby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "This is my hood. My haunt. The place where the girl I had a crush on in college used to go to. So, it too holds a special place in my heart.\n\nThe drinks are always done right, and sometimes when I'm working and using their free Wi-Fi I sometimes feel the pang of hope when I think that I've spotted her here again.", "author": "Jack R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-01", "description": "This review update is for the Iced Vanilla Lattes - these iced coffee beverages are perfect for a bright and sunny day like today. I like the service here cause it is very good and a perfect spot for me to get a cup of coffee before heading to school or work. The staff here are friendly and customer service is very efficient.\n\nGetting a seat here is generally not a very big problem since most customers order their items to go. One downer here is that the Wi-Fi signal getting dropped and this happened to me as well. A coffee shop with plenty of seats, friendly staff and efficient customer service brings a satisfying experience every time!", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-21", "description": "I never realized that this would be the best place for me to relax and study. Especially, the corner places ;), no body can disturb you and then, you can finish your work.\n\nMy place for weekend. They got cool baristas and friendly environment :)", "author": "Pratik J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "Really. An iced green tea latte is supposed to come with clumps of mix at the bottom? I asked to have them mix it. They told me I just need to shake it or mix it with a straw or wooden mixer. Ummmm I paid you to make the drink right. Won't be coming back here. There are so many other options.", "author": "Sara C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-24", "description": "#notdeaffriendly\nI recognize being a barista can be a challenge even at the best of times. Being a new, deaf customer in unfamiliar territory means I need to be extra-sensitive and aware of a hearing person's lack of exposure to the deaf population. In fact, I go out of my way to make the experience favorable for both of us.\nUnfortunately, there's always that small percentage and the short-curly haired female employee at 2:15 pm today qualifies. Churlish, glaring looks and claiming, \"I KNOW!!!\" After I informed her of my deafness. \nThank goodness for the kindness of a stranger who assisted me in getting what I wanted via another employee.\nI had been told Starbucks practiced  a culture of rudeness towards citizens with visible and invisible disabilities. I always assumed there were more than 1 side of the story. \nBelievable after this last experience.", "author": "Wanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "The staff is extremely friendly a girl with the pink hair and a guy with a Grey hat & white piercing , both so sweet and nice ! Defiantly coming back to this location. Keep up the good energy", "author": "Simon B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "Why is it always so cold in here?\n\nStarbucks drinks are always going to be Starbucks drinks. But service is good, atmosphere is great (laid back, lots of people studying and chatting/catching up), and there are a lot of outlets and places to sit. The tables are small (to make room for more people, I assume), but this is fine. The only thing I consistently have to remind myself is that I have to wear more layers than usual every time I plan to sit there for more than an hour.", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-18", "description": "Cashier was friendly but the barista made terrible drinks. Ordered a white chocolate mocha and the taste is completely off, not even close. Never had that happen before and this is my usual. She seemed to have made drinks while in a rush even though the place wasn't busy at all.", "author": "Andrea M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "The more I come here the more I love this location! The staff here are awesome. Friendly and on their game. I especially appreciate their kind treatment of the special needs people that hang out on WP. They are never dehumanizing to these folks but they also don't let them ruin the store.", "author": "Corey Jace W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Come here for a good brunch bacon egg croissant fritter Frapuccino strawberry Greek yogurt", "author": "Anthony V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "My brother-in-law wanted to grab some coffee before work and I had plenty of time to spare.  We cruised over to West Portal so I would be near the Muni station and hopped into a packed Starbucks for the morning Joe.\n\nI ordered a hazelnut latte (free hazelnut!) and got to chill before the day really kicked off.  I much prefer the flavored lattes to the plain and I'm glad the flavor is free as a Gold card member.  It just makes you feel special!\n\nI'd definitely recommend grabbing a card and start earning those rewards.  The benefits can't be beaten and it's free!  This location is pretty good and there are a few seats near plugs if you want to get stuff done.  There are some good (and not-so-good) restaurants nearby but you can't beat the proximity to the train station!\n\nFood: 7/10\n\nService: 7/10\n\nPrice: $\n\nAtmosphere: 7/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-10", "description": "This place is great! Always filled with energy from the students & characters who live in the neighborhood! The 5 stars is for Friday nights are the best. Be sure to catch the 9'o'clock crowd. Eclectic hipster mania!", "author": "C C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Great location but crappy service, especially if you like cold brew coffee.  They may as well take it off the menu.  We have gone there numerous times and they always say they just ran out. Went there today at 7am and guess what, they \"just ran out\". Never happens anywhere else", "author": "matt m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "I like going to this Starbucks because it's really close to my home. They recently just kinda remodeled the place, different set up now. To be honest, I like the old style better, no doubt about it now it fits more people in there, this also become a issue, most of time it's just too crowed, I don't like that, people sit next to each other, I want to have my own space. \n\nI tried to go there to work last Sunday around 3:00pm, again I couldn't find any seats. Maybe this just a typical issue for all the Starbucks, they are too popular. Particularly for this store, I wish they can have outdoor seats, West Portal just a super nice town, I love going out there during the weekends relax, enjoy the sun, if I could sit outside and have a cup of coffee that would be perfect.", "author": "Dave Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "If you need a place to get stuff done then this is your spot.\nIf you need a place to catch up with a friend then this is your spot.\nIf you need a place to daydream and people watch then this is your spot.\n\n\nI don't know what it is about this particular Starbucks but it reminds me of the ones I used to go to back in college... where when I look to my left, someone is studying, when I look to my right, someone is studying, then I just look ahead at my computer screen and tell myself damn... I better start studying too. Do they put something extra in the coffee? Inspiration? Motivation? Creativity?\n\nI don't know, maybe it's just the incredibly strong AC they have turned on no matter what the temperature is outside. Cold drafts hit those spots in the corner (with the little round tables) so beware if you are afraid of freezing. Minus one star for that because SF is already cold enough, don't know why they have to make it colder.\n\nSomehow I always leave this place feeling good and feeling productive.. so I don't really care what it specifically is but they must be doing something right. Wifi is reliable and they have plenty of seating. \n\nOtherwise, there's nothing really special about this Starbucks but it's a nice place to get some work done when all the libraries are closed on the weekends. Plenty of parking (at least on the weekends - probably won't be as lucky on the weekdays), coffee stays consistent and baristas are friendly enough.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-01", "description": "I have an idea that will make even more money for Starbucks, as well as a better cafe experience for the rest of us. Purchasing something gets you 1 hour of free internet and a table. After that, people should pay $5 for the 2nd hour; $10 for the third hour, and so on down. Or, they can rent a table for a $50 flat fee for the day.\n\nI'm kidding, but only partly. Because some people really DO seem to camp out here for the whole day, making themselves at home, spreading out their books and papers, filing their nails, pretending like they don't see that there are 10 other people looking for a seat. They know they are being trolls, but they just park their butt there anyway to update their Facebook page, shop on Amazon, and whatever other pressing needs they may have.\n\n When I go to Starbucks, I want to get my drink, chat with my friend or check my email, and be on my merry way. I don't need a table for more than 30 minutes.  It is not fair that I have to stand around sucking down my coffee while other people, whose grande drip house brew has long since been consumed, are lording over the tables like it's their living room. I don't think I've ever stayed at a Starbucks more than an hour, and why would you want to, since their loungy music selection repeats about every 40 minutes?\n\nTable Trolls, get out! You should be prepared to pay to rent the space and the internet access that you so blithely believe to be yours all the livelong day.  Otherwise, move over because my butt needs a rest, too!", "author": "John S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "Loud Starbucks! Employees are very friendly (to customers & with each other) but don't come here to study. The music is loud (another customer was plugging her ears while she sat reading) & request for music to be turned down a little fell on deaf ears.\nWill drive the further distance to go to Starbucks on California to study in the future.", "author": "Sonya C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "This Starbucks is probably in an area with more independent cozier coffee shops. It's there and sticks out. I don't really care.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "The sweetest workers at any Starbucks I've ever been to! Super helpful, energetic, and kind!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-13", "description": "I came to this Starbucks a lot back in high school when my best friend and I would have our semi-annual meet up over coffee and pastries. It's always pretty crowded and never enough seating. If we're lucky, we could find a big table for the both of us but most of the time we just sat by the smaller tables made for one person. No biggie though, since we never needed too much table space. Every time we came here, our drinks have always been right. \n\nI came here recently within the past month on a Sunday evening with my sister. The interior looks really nice now! There's plenty of counter seating around with small tables here and there. Definitely looks more modern. Anyways onto the reason why I'm really yelping.. my sister ordered a Green Tea Frappuccino with java chips and caramel syrup and I got my usual Caramel Frappuccino. There was only one lady working behind the counter. Not so unusual because it wasn't a busy night. But then when we got our drinks.. she forgot the caramel syrup in my sister's drink (at first I thought she might have blended in the caramel.. but nope didn't taste any trace of it) and my \"caramel\" drink ended up being a Chai Frappuccino.. what the heck?! Good thing I wasn't feeling too picky that day because I NEVER had a Chai Frappuccino before so I didn't mind it TOO much.. but to mess up our drinks like that and even writing it correctly on the cup was disappointing. \n\nThree stars for the good ol' times.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Staff is always friendly, the line moves quick and the best of all, they have a CLOVER MACHINE!  We originally discovered this amazing coffee maker in NYC and have been addicted ever since.  It's basically a reversed French press and gives a huge caffeine kick!  You can go as simple as Pike Place Clover (my favorite) but you can get as fancy as you like and choose \"the good stuff.\" Depends on your coffee budget!  Tip:  if you choose a tall ask to put the coffee in a grande so there's room for milk/cream.\n\nThey have quite a bit of seating but for some reason the lower seats are always filled!  They do have bar seating as well and these are usually available.  It's a very bustling place so I don't recommend coming here with the intention to study.  It can be quite loud and the lines have the potential to wrap around this tiny joint.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-23", "description": "Saw lots of flies on those cookies in the counter... Nastyyyy Never going there again ._.", "author": "Hgf J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Pretty good location.  Pretty classy inside, friendly staff.  I like going to this Starbucks around Christmas when I'm shopping around in Westportal.  Its cute.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-24", "description": "This StBux is not big, but it is located in a great location in a small neighborhood. There are always people occupying tables or studying here. Half of my visits I don't find a seat but the customers turnover is high.\n\nFriendly staff, consistent drinks, pretty quick service - the typical experience. Again, the location (i.e., convenient to get to, quick turnover on parking spaces, nearby shops and eateries, etc.). \n\nAt night, there's always, like, some SFPD convention here, so you always feel safe - or nervous - depending on your history, ack!", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-17", "description": "It's a great Starbucks spot. Only 3 stars because the line is impossibly long and for no good reason. Seems massively disorganized and can take 30 mins to get a regular coffee. Super stressful. Whenever I see more than 8 peeps in line I walk away. It's not worth wasting all that time. Hope they can improve.", "author": "Kenneth S. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "Mini update: This is probably the friendliest Starbucks I've been to. I came at noon on a Thursday and was promptly served by the awesome Matt and Tim. Got my drink in under a minute and was super happy. Thanks WP Starbucks! :)", "author": "Anastasia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-11", "description": "Sometimes it can get a little stressful during a work day so coming to this Starbucks might just be the perfect remedy.  You get coffee and you get good laughs.  The absolute best waker upper indeed!\n\nI've been coming here maybe 5 times a week religiously for close to 2 years now until recent.  They've always had a long line and poorly managed staff.  Make no mistake, most the employees are just awesome but the speed of service is poorly managed by the manager and/or supervisor.  Coming from managing successful well branded flagship stores (not going to name where) of my own for many years leading each store I touched to drastically increase in sales in all aspects and customer service ratings as well as managing a small flourishing office these days, makes me a bit of a snob when I see major noticeable inefficiencies.  I literally stopped coming here recently after the most comedic encounter... TWICE!  I couldn't bear to endure another stomach cramping laugh cuz it hurt so damn much... So I just had to remove myself from this location and opt for the Stonestown or Twin Peaks location where it's a serious get shit done type of Starbucks... Ok not that serious but you get what I mean.\n\nI order a grande soy latte every work day for KB since she can't function early morning without it.  More superstitious than anything of coffee fiends I think but who am I to judge.  I don't drink coffee.  I have no idea.  For snackings KB and I tend to always lean towards the butter croissant so of course that's what we'd order majority of the time.  However, the croissants would come out flattened from their tongs they use every once in a while.  I'd always request beforehand for them not to crush my croissant.  Hey call me high maintenance but I like croissants for their buttery fluffy flakiness... not when it's a dense clump of butter pastry.  Please someone tell me that's a reasonable request.  Most the staff will make sure it comes out the way it supposed to be.  Somehow the comedy came rather recently and this is how it went down with 2 very particular staff members, one of them being the manager, on 2 occasions.\n\n\nFirst occasion:\n\nDee Dee Dee Dee Dee Dee! (As the oven would sound)\n\nDirty blonde: COLIN! (Hands me bag)\n\nI look inside.\nMe: Excuse me.  Is it possible that you don't smash my croissant next time?  It's OK this time.\n\nDirty blonde: I can't.\n\nMe: You... Can't?  I don't get it.\n\nDirty blonde: I can't.  That's how it comes out.\n\nMe: It's never like that at La Boulange or other Starbucks around here.\n\nDirty blonde: It can't be.  The croissant caves in once we heat it up.\n\nMe: You mean like... It implodes?\n\nDirty blonde: Yes it just caves in so there's nothing I can do about.\n\nMe: *chuckles* Are you serious?!?! Never heard of that before.  That's so funny! I'm sure you could adjust your grasp of the tongs. Kinda pisses me off I'm paying for this but whatever I just won't order this from you ever again.\n\nDirty blonde: Sorry. Can't do anything about it.\n\nThat was just hilarious n irritating at the same time.  Where do they come up with this stuff?!?!  At least think before you come up with some random answer that makes no sense at all.\n\n\nSecond occasion:\n\nMe: A grande soy latte... And a butter croissant but can you make sure it doesn't come out flattened?\n\nSammie (manager): No we can't.\n\nMe: Why? It shouldn't be too much effort...\n\nSammie: I know who you are. I remember you. You were yelling in here about that the other day causing a scene.\n\nMe: Wow... Really?  (Now asking other employees who I remember was there that day) You two were here a few days ago... Was I being loud or causing a scene?\n\nBarista 1 (Latin Kid): She's speaking for herself... That's not what happened.\n\nBarista 2 (Long dark hair braided girl): Don't worry about her... she's always like that.\n\nMe: (Speaking to Sammie in a very chuckling and chill manner) Now that you are accusing me in front of everyone waiting in line, I want to review the videos with you.  Please take me to your video recordings because I really need to see this so you can prove me wrong.\n\nSammie: No.  We don't have videos.\n\nMe: Uh... then why are those cameras set up?\n\nThat was just too much.  I was literally laughing at this point and the always cool baristas (those 2 especially) were just chuckling along with me.\n\nJust for kicks, ask for \"Dirty Blonde\" and/or Sammie, order a croissant, and ask them to be careful to not flatten it.  Please let me know how it goes.  ;P\n\nSo yes... come here for a coffee and good laughs.  You will surely wake up from stomach cramps!\n\nI wanna give 1 star but most the employees are super cool which earns them 2 stars. As long as the poor management continues to fail on hospitality they will never get more than that.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-04", "description": "This is becoming my home when needing late night focus on a school project.  I appreciate that they open late and it doesn't get too crowded in the evenings.  Though the wi-fi is free, it is slow in connecting.  The table area, that looks out to the street, I can always find a spot to plug in my laptop, however the floor, under the table, & the window sill could be cleaner.  As much as I'm not overly picky about a little dirt, I am a little disgusted about seeing a dead fly on the sill when pulling my power cord from under the table.  When there are loads of crumbs and sticky areas on the floor, I begin to question.  Finally, when I go home, I do not appreciate my clothes and backpack being stained with smells of coffee or whatever has been created in the machines.\n\nUnless there's another more convenient place (maybe Java Beach...but that's kinda small) with sufficient seating and late night hours, I still find this a convenient place to work, risking coffee smells when leaving for the day/night", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "I come here almost every day, and I am never disappointed.\nThe employees are extremely friendly every time, they seem to be having a good time working there. The drinks are delicious. There is a nice seating area to work, with a mural of West Portal. You will not be disappointed!", "author": "Emma L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Nice cozy spot if you can find parking.  Free charging stations for your phone.  Super friendly staff.  My boyfriend bought one of those tumbler cups and they gave him a discount and filled his drink to the top!", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-04", "description": "I'm only in West Portal (a charming hamlet in the middle of our overpriced fishing village) to visit \"my\" oral surgeon. Blech. The pain is eased by a visit to this Sbux, where a gentleman usually holds the door open on the way in, and another on the way out. The barristas appear to be chip on shoulder free, though they are not pouring the fastest cup of joe in town, it's cool. Nobody is in a hurry in Mayberry.\n\nPeople smile and greet me on the streets of WP, even though I am a stranger in this strange land. Oh, if you need to get a tooth pulled and then get an implant, I highly recommend Dr. Dean Duncan, right across from Starbucks and West Portal Books.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "My favorite Starbucks because the staff actually cares! They make an effort to be friendly. They also employ people with special needs which makes my heart sing! They have a great selection and give suggestions. There's plenty of seating and wifi. Thanks West Portal Starbucks :)", "author": "Liz B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "One of the nicer Starbucks .  The coffee is yum, employees....nice.  Clean, somewhat cramped space. It's always busy!", "author": "Bleep S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-20", "description": "Came in earlier with my dad and got coffee and tazo tea. Convenient location, moderate space to sit and do whatever you need to do.. the only complaint I have it that the guy who took my order just seemed completely out of it and as I was giving him my order he was staring at something outside and completely ignored me.. then later had to ask what I said again.. HOW RUDE.. if you're tired, PLEASE DRINK SOME COFFEE.. you work at Starbucks for goodness sake.. thankfully the guy who was making the drinks was really friendly.. so he made up for my experience at the other counter.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-16", "description": "I was at this location yesterday and today. I was helped by Alicia who brings a ray of sunshine to the store. Her bright personality and energy made my day! Everyone else is wonderful too.", "author": "Nancy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-17", "description": "This is my favorite Starbucks in the whole city. In a great neighborhood, the staff is always very nice here. Have never had an issue with my drinks here. Love the vibe.", "author": "Anonymous ?."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "Drinks made well. Open late, so good for work though wifi can get spotty and molasses slow. Plenty of metered and residential parking. Quaint neighborhood. Yep, I'm in fandom :)", "author": "Lana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-20", "description": "I'm not the type to sit and hang out at a Starbuck all day... this place is pretty much a grab and go place for me.  Westportal can get pretty busy during morning rush hour and parking and the wait in line can be kinda crazy sometimes.\n\nThey usually try to keep the line flowing as best as possible.  The staff is always friendly. And I will always try to take full advantage of my Gold Card Status here vs. a Starbucks located in Safeway (they do not honor discount for syrup)", "author": "Sheenie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "I've been going to this Starbucks for over 10 years ( so I might be a little biased), but its one of the best locations. \n\nStaff here is always nice and gets the job done quick!\n\nMy coffee is almost always good (there are a handful of times it wasnt) and it is always a short wait. Although they always have a line, service is quick and efficient. I've been to other locations (ahem Geary & 19th), where there was no line, but it took forever to get my drink. If I have 5 mins to spare, I will come to this location. My fave Starbucks in the city!", "author": "Mai H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "I like this location because it's close to my church and work. The staff here serve up your drink fast. Even though there was a long line in the morning, I was able to get in and out in less than 5 minutes!\n\nIt's the same three people who work weekday mornings and they're super friendly! They practically know all the customer's name and order by heart.", "author": "Jess s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-02", "description": "So now Starbucks has surreptitiously raised their prices again by reducing the size of their espresso shots.  \n\nUnacceptable.", "author": "AJ P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "This location is really mellow, always clean every time I come. It's right across from the theater and it's perfect for a pre or post movie peppermint hot chocolate! Most people think you can only get peppermint hot chocolate during the holidays, truth be told you can get it year round. The staff here are really polite, I like that they have people working here from different racial backgrounds. Very diverse. Pastries are always stocked and they never really run out of any products. Minus one star cause lack of seating.", "author": "Roxanne O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-21", "description": "OMG you ran out of soy milk?  At 3 PM??\n\nListen, I understand you're busy, but like... seriously.\n\nFail.  This lactose-intolerant CCG is not happy.\n\nThe extra star is for service being friendly and apologetic, the atmosphere less frazzling than the downtown Starbucks, and nicer customers in general.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-09", "description": "Three words: WiFi sucks here. \n\nOk it's free but other SBs I've been to don't have as many interruptions. Can't risk writing more because service will no doubt crap out.", "author": "Janet O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "It's like... Starbucks. Where else can you get an extra whip extra caramel pumpkin spicy coffeeish drink?", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Starbucks is starbucks...I just get my Grande Pike...Service needs loads of improvement.", "author": "Malou C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-01", "description": "It's a Starbucks, what's there to really review.\n\nWifi... it's meh. Gets the job done, but cuts in and out, and kinda lags. \n\nNudge-Nudge...There's a Peet's up the street, towards the tunnel.", "author": "Garland W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Coffee at buckys is always so so anyway not good not bad just always the same but these cafe is great, staff are v friendly and coffee is good", "author": "obgyn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-03", "description": "Great place, super fast wi-fi. AC working perfectly. Parking is available. I like this place!", "author": "David V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-29", "description": "This Starbucks is one of my favorites. I love the workers there and how they always make my drink right and quickly. They always have smiles on their faces and memorize most of their customers.", "author": "Lawrence Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-25", "description": "For the Love of Pumpkin Spice Lattes, I begrudgingly come here.\n\nBefore I knew and/or tasted better java, I adored Starbies in a big way: bought mugs, gift cards, lounged around the store, made a pilgrimage to their first location in Seattle as well as ones in Vegas, New York, Tokyo and even drank their stuff once in awhile.\nWhat can I say?  When I like something, I really go all out.\n\nBut now that I experienced some truly outstanding coffee and know what it should taste like, I am even more mystified on why I still like their Pumpkin Spice Lattes.\n\nIt has to be the syrup since it's sure not their espresso. How does it retain just enough of its flavor to give their lattes that pumpkin spice goodness I enjoy?\nI seriously thought about buying a bottle of the stuff but ultimately could see me abusing it -- I'll leave that to your imagination\n\nSo until I find something better, guess where I'll be frequenting for my fix.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-27", "description": "Spelled my name right :) got my drink wrong :( I ordered a white chocolate mocha and I got a mocha.", "author": "Jean T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-08", "description": "Not sure what happened to my review but I remember I had written one about this place before. This is the safest place that one could be at, always a police presences around at night. The service however isn't that great. They will do the friendly hello but one can tell it is mandatory.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-03", "description": "This Starbucks it open until 11PM everyday, the staff is generally pleasant and the internet speed--is OMG faaaaaassssst!!!  This particular one has comfortable seating and is well lit, too.  What more can you ask for from a Starbucks?", "author": "Randy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "When the line starts to bend around the store, people in the back come to the front and help take orders. Great team work!", "author": "Jess W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-16", "description": "The baristas and bartenders there were amazing and nice. I am quite fond of this location because it is very close to my church and it's on the way to my work in the mornings. \n\nThey are friendly and nice, and know all the customer's name and their \"usuals\" and manage to get down a \"complicated order\" right on the dot. It is the same people that work weekday mornings and because of their uplifting attitudes and smiles, it can turn a gloomy sunset morning into a sunny one !! \n\nThe coffees are extremely hot and freshly brewed, and that's the most important part. No one likes to drink overnight coffee just reheated up right?", "author": "Benetta H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-22", "description": "I love my neighborhood starbucks!This one isn't quite as busy as the others. Seats are plentiful in the early morning. Most people grab and go. The service is always quick and the drinks are on point. 5 stars across the board for Starbucks! \n\n- BEWARE OF DPT.. they check on the 2 hour parking !! They are on it!\n\n\n-SFCheapGrub", "author": "Mike H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "I LOVE Starbucks coffee!!! I'm always served with great service and there has not been a drink I have not liked.", "author": "Lucy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-08", "description": "Yeah, yeah..I know, people are supposed to hate Starbucks.  I've been to their various locations throughout the city.  \n\nI still drink their chai tea lattes and cappucinos.  \n\nAnd I use a gift card too.\n\nThey still have good drinks, and delicious sandwiches, but I don't go often.  But it's better than Tully's.  I find Peet's to be better than Starbucks though.  \n\nI like this location, because of the seating.  :-)", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "Typical Starbucks.  Good service (the blonde lady is awesome... She's a hustler).  The only downside, they keep this location super cold (air condition is really high).  It probably wouldn't matter if west portal area was sunny and warm most of the time.", "author": "Karin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-16", "description": "Come here everyday. The people and management are told notch. They get your order taken and out to you in record time with great customer service. Susie is the manager there and is the best. She is so nice to everyone who comes in and always has a smile on her face. I love going to there every morning.", "author": "Dennis W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-03", "description": "I like this Starbucks. Parking is easy compared to most places in SF, and who doesn't like large windows for people watching, while enclosed in warm and homey environment away from the cold? I am very productive here. Perhaps it's every other patron has their head buried in their Apple laptops. Sorry Apple, I am a Lenovo man until you price your laptops properly.\n\nBathroom is dirty for Starbucks standards. Used paper towels and ripped up toilet seat protectors on the floor. Reminds me of Berkeley bathrooms.", "author": "William H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-03", "description": "Extremely slow service despite short lines", "author": "Benjamin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "After the renovation, the wait time here takes even longer. Generally friendly baristas. They do know their regulars well! With how often I go there, my drinks have been consistently good as well and not watered-down.", "author": "Kitty K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-04", "description": "THE WAY I SEE IT # 69\r\n\r\nYou can work for peace on Earth everyday, in the comfort of your very own car. It's easy; just follow the Golden Rule. Don't like being honked at? Just 69! look at the picture of your starbucks cup...this is just sooooo funny!\r\n\r\n69!\r\n\r\nHAHA lol....69 hehe....haha", "author": "Stanley K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-01", "description": "Very friendly staff; dark roast tasted burnt. Wifi was frustratingly slow. I know, I know, do your work at home buddy, but if I need to to do it at a cafe, I won't come back here.", "author": "Mr. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "This Starbucks is in a good location and we were to grab coffee before driving back to Santa Clara from San Francisco. Limited street parking and does get busy on weekend.", "author": "Sam M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-12", "description": "Friendly staff at the West Portal location.\nPoor design of the climate system.  A cold draft from the unneeded air-conditioner is annoying to many of the customers.  Temperature of the cafe is sometimes frigid.  Starbucks Corp. should invest in an innovative cooling system - a window that opens - and take advantage of the free carbon-free air-conditioning San Francisco offers.", "author": "Tom C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-06", "description": "Not what it used to be but it's still cool. My favorite is Katie!! She always has a smile on her face and provides the best customer service.\nIt still beats all the other Sbucks in the city.", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-05", "description": "I'm usually not a huge promoter of Starbucks, just because I prefer my smaller, more locally run coffeehouses.\n\nBut the people working here are always really warm and willing to make any substitutions/additions I request, no matter how busy they are. It's an awesome place to study/read and somehow feels more homely than the other locations of this oh-so-popular coffee chain.\n\nOh, and the cashiers' genuine smiles and friendly greetings always make my day.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "I come here every week day to get a hot chocolate with whipped cream and a chocolate croissant or a chocolate chip cookie or just hot chocolate. It's always good", "author": "Samuel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-11", "description": "Friendly staff.\nPleasant environment.\nEfficient service.\nWin!", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Friendly staff they were so nice to me, and offered great service with smiles. Good job ladies :)", "author": "Christie N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-30", "description": "I been here couple of time and at different hours.... Their soy chai is really bad. The whole cup tastes like soy milk. There is no chai tea in it. I rather drive farther to the location by SOTA HS. Better quality and better service.", "author": "Doro C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "This West Portal location is always busy. It's got a nice neighborhood feel where upon entering you'll see folks sipping their coffee, working on a crossword or you'll see some kids drinking hot cocoa chilling with their parents before a day out. \n\nService is fast, drinks have been great so far. Parking is really difficult (don't park in the bank building or you'll get towed!). The only problems with this place are: there is never any place to sit because it's so busy, the tables are usually pretty dirty because it's so busy, and there is no outside seating. On the whole, a pretty average Starbucks.", "author": "Dawn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-30", "description": "A bit run down as Starbucks go.  It's definitely been \"well loved\" by the neighborhood.  They also have draconian refill policies posted due to the people who sit down and hang out all day.  Points for keeping the line moving quickly!", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "Friendly workers here. I always come here to grab a drink before work if I have time or late night when I have exams to cram for. I hate how it gets super crowded during certain parts of the day.. Long lines means no coffee for me unless I intend to be late :/", "author": "Athena W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "The good: Theres one really cute barista girl there that makes me want to go back. Drinks are adequate and the decor is up to date.\n\nThe bad:  Haven't seen her there in several months though. Theres this one handicaped baristas guy that uses my cup as a micriphone before giving it to the drink maker.\n\nFour stars for this location but minis one for the spit in my cup. I ended up not drinking it and stopped going here all together. Eww.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "Wow. I was thinking I cannot write a review on my Windows Phone app on Yelp BUT I can draft one. Since WiFi sucks here we skip tablet and do this. It has been a while since I have inland deep inside SF in a neighborhood. They are like villages hiding and pretending to be 100% city. Do they have enough of their own culture to be unique? I think so. And you can tell the locals are the culture. I sit here looking out the window. In any commercial setting this would be the perfect seat. It is. I am looking out and I see nothing. No building. No people. No cars. No views. Nothing stands out making this seat a worthwhile spot. That is a neighborhood. People are happy being as they are. They don't have to go commercial and fix everything. That is very American. It must have property value and it must be worth selling so sooner or later somebody shows up to fix. A developer or city. They fix them buildings. They fix intersection. Heck they even fix the people too. They probably have to go so property values are safe. Yep. That is America everyone complains about. It has NO people. This hidden village amidst an evil city run by the devil and his minions who change leading guards often not to be noticed, has people. They are happy. They are hiding. They pretend they are Franciscans. Go San Francisco. Until they are discovered they are safe. Then is NO people again. Property values overrule. The coffee is good today. I was afraid to yell Tall Blonde. I asked for a Tall Coffee and got a Tall Blonde. Pike is okay but I can finish light roast. Nice Starbucks. 1 Nov 2013", "author": "Cush D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-14", "description": "An ex-boyfriend was in town today and looking for a tour guide. \n\nHe couldn't find one, so he asked me instead.\n\nAdmittedly, a little nervous about seeing him again after 6 years, I stopped here for coffee to buy a little time. \n\nThe wait was so long that it took 20 minutes to get my iced black coffee after ordering.\n\nIn hindsight, I appreciate the delay - it shifted the focus to my late arrival and off of the weight gain and chip on my shoulder.", "author": "Janney B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-14", "description": "As noted, it's Starbucks.  But hey, if I'm going to spend $3 on a coffee, at least get my order to me in order - not after the 3 people who were behind me in line.", "author": "Obi W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-27", "description": "A friend of mine and I had just got out of a random book reading down the street and she said \"I need tea!!!!!\"  \n\nWe walked down here to Starbucks and the line was pretty long, but it's all good.  I had to pee so bad so I darted for the bathroom (code 100) which was, well it could have been cleaner, but it was decent.  There was a bit of the line for the bathroom throughout the evening because the mens' restroom was out of service.  Maybe that's why the bathroom was messier than it should have been ...\n\nI got a rice krispy treat and a chai latte.  Both were good but man, I remember back in the day that the rice krispy treats were huge and now, well they're not so much.  Damn economy.  Must be the rise in rice prices ...\n\nThere seems to be more space to sit down than there used to be before it was remodeled.  I like the couch/sofa thingie which adds more room to sit.  But be aware that lots of students hang out here as it's near SFSU and the M stop is just outside.  We were able to grab a side at the \"bar\", but mostly the laptop users and bookworms were not going to be moving anytime soon.  Must be midterms ...\n\nIt's an ok spot.  Ideal when Peet's closed down the street.", "author": "imelda j."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-15", "description": "I wish I wasn't a sucker for second chances. every time I've came here my drinks taste like milk!\n\nWhy do i need to pay $4 for a cup of milk?", "author": "Beck S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-25", "description": "This is the best place to get coffee in the city...why? The people who work there - they're just genuine folk...gimme that and my coffee and I'm set. Cheers gang.", "author": "conaill g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-30", "description": "I've had Starbucks from multiple locations and have even gone here a couple times, however never have I ever felt the experience was noteworthy enough to write a review for it. Tonight I went to Starbucks with a few friends because we all felt a desire for a coffee run. My order was taken by a barista by the name of Matt, and he also made our drinks. Not only was he friendly and kind, he gave off such a great vibe and sounded quite sincere when he wished us a good night and thanked us for our visit. When he called our drinks he also added in a vibrant tone, that \"at west portal Starbucks we try our best to make it like the photo\" which I agree, my caramel brûlée latte looked definitely fantastic! I've never found a need to post reviews but his service to me tonight was so wonderful it has to be remarked upon, so thank you Matt for such wonderful service tonight (: ! I would definitely recommend this Starbucks, it was fabulously festive looking also (:", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-06", "description": "I really like the location of this Starbucks.  I like West Portal because its always bustling with people, plus its a 5 minute drive from where I live and is home to my favorite Mexican restaurant.  Parking sucks, but I always know where to park. \n\nHowever, the store itself, I don't like so much.  While it is nice and cozy, the staff is, what do I say, a bit nonchalant.  I come here with my cousin all the time, and they always mess up her order. Open up your ears, its not even complicated!  They never say sorry either or act like they were at fault.  It was always like, \"Oh whatever.\"  And not to say all the time, but customer service at this WP Starbucks generally sucks.", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "location is great! and SUZY is AWESOME!! if i can't make it out to philz or coffee bean during the weekends, this is my starbucks of choice. and during girl scout cookies season, you can ALWAYS find them right outside! geez, but i hate that there's never any open seats!!", "author": "Ann T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-07", "description": "I love the fact that I can go to any Starbucks in the world and get the drink I order  the way I want it.  I know what to expect.  Now with each store there are variances:  \n\nParking at West Portal notoriously sucks.  Sometimes at odd hours you can get parking but most of the time I have to circle a few times around the block ( I would rather circle and park on that block then have to run or walk 3 blocks in 4 inch heels) to get a parking spot.  But really never more than maybe 3 trips around the block.  People are going in and out of those spots all the time.  \n\nThere is always a line anywhere between 7:30am to 8:30am.  Figures, everyone in the world is trying to get their morning coffee, not just me.   The staff tries to move it along and while going in and seeing a line 15 people deep may scare you, I've been in slower moving lines, they really do try.  \n\nThe drinks are great, and the staff is very nice and accommodating.  Usually in the mornings, not all the tables are full as most people in that 15 person line are getting their drinks to go to work with.  In the afternoons though almost every seat is taken with students and people alike.  So if you see a seat, snag it!  \n\nOne thing to note: there are always always cops in here, I think this is the safest spot in the city.  I have been here at times when there were 3 cop cars lined up double parked outside.  Was there an emergency in there?  No, just cops getting coffee.  I mention this because when I had my car broken into less than a mile away on Monterey Blvd, it took 1.5 hours for a cop to come see me, and I have a sneaky feeling it was because the 3 cop cars were on break at West Portal!!!  Maybe not all of them have to take a break at once?  Just a thought.  \n\nAnyway, my one complaint that keeps it from being a 5 star review would be that whenever I have gotten a seat here, the tables and seats are always messy.  I know they work hard and have to deal with lines of people, but maybe just once in awhile they could come and wipe the tables down?  I don't mind doing it, but I don't have that wet towel they have behind the counter, and sometimes a napkin doesn't get all the sticky spills off like their towels do.  \n\nThat's it for me.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-12", "description": "This place has a good vibe. Lots of families and students make this their spot on weekends. The baristas are really friendly, too.", "author": "Janet R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "Starbucks is far from my favorite coffee. In fact, it is the bottom of the line I will pay for by the cup. But one thing Starbucks is consistent in is providing a safe, clean, non-annoying place to sit and relax for a stretch. This location in particular. I have never had anything but nice and helpful service, the bathrooms are clean, and the people who tend to spend time at this location are courteous. Throw in the free wi-fi, and you have a winner. It also is one of the only places in the West Portal area that is open past 8 or 9pm, let alone late evening, which is why I originally ventured to this location.\n  The main problem is is this location is so good at providing these things, it is often difficult finding a seat or an outlet for your electronics. It could use some more computer friendly seating, as since as soon as someone gets one of the prime seats, they are not giving it up for awhile.\n  So 2 stars for the coffee, 4 stars for the late nights service and seating and free wi-fi.", "author": "Miss Kae O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "Clean facility and I got my $1.50 coffee in less than 2 minutes from the time I paid and ordered! The area is nice and setting is clean. Very well organized and no problems at all (unless maybe you've got a car and are looking for parking). Very classy and uptight.", "author": "R C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-30", "description": "Starting to get back into the coffee habit. Italian Roast iced coffee is the only way to go. I think this is all I need to start the day off good. I like this location cuz it brings me back to my roots, my home town hood if you will.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-02", "description": "I like this Starbuck's because its size. It's a good place to relax with a cup of coffee and talk or whatever. I HATE this place (minus one star) for the annoying little middle school kids who constantly mug me..and hang around with their starbucks frapps thinking they are the SHIT. Excuse me, but you're not. \n\nOther then that...I love the service, everyone's nice. Good drinks. I just don't understand why they can't have the pomegranate and tangerine frapps all year long! Oh well...summer is good. My work always does their \"Starbucks run\" over to this Starbucks. =) \n\nOh yeah, but it's hard to park. =\\ I would suggest walking or taking the L or something...it's close to the West Portal Station. And my hairdresser, Starbucks and a haircut all in one...GREAT!", "author": "Alison N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "Busy location! Try to come before the meters start. I try to avoid when it is 15 people deep in line. I come early to get my Pike's Kudos for the barristas and cashiers for knowing my preferences.", "author": "Infodiva B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-24", "description": "I love this Starbucks; it REALLY keeps me sane!  Right before I head to the peninsula I stop by the \"neighborhood\" for my coffee which is always great.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-06", "description": "I like the setting of this Starbucks, very warm and welcoming. Drinks are like other Starbucks. But their service is what makes me really angry and upset. It was so bad that I decided to sign up a Yelp account and write this review. I got 4 cake pops and a tall caramel flan Frap. I asked her to spilt it in 3 transactions since not everything were for me. She gave me a very annoyed look and asked again how I would like to do. I explained to her again and told her what exactly I would like to do. I literally said twice that I would like the frap in one transaction, 2 cake pops in one, and the other 2 cake pops in another transaction. So assuming she understood, when she asked me to scan my Starbucks card the first time. I just did without questioning. Then, I realized the first transaction was for all 4 cake pops, then one for the frap. She said she thought I had another drink, and said she had already charged the cake pops together. What surprised me the most was she just said \"bye, next\" after she told me she had made a mistake of what the customer asked her to do. There was no apology or anything. It's true that this is just a very minor issue, really no big deal if they made a mistake. But how she handled the situation and how she treated the customers was really unacceptable. I really wanted to publish her name here, but I'm also worried if it'll bring her a lot of damage. I thus decide to just briefly describe this cashier. She is not very tall, about 5'3\", rather dark skin, with long hair. She was the only dark skin person among others in her shift. It was a Thursday at around 5:30pm. So, be aware, everyone! I really hope someone can tell her what is the right attitude to have working in the customer services field, whether you're only the cashier or barrister, or a manager of a department store.", "author": "Elizabeth T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-12", "description": "The dirtiest Starbucks I have been too. Just go to Peets coffee. Always keeps their place clean and friendlier people behind the counter.", "author": "Maria W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-16", "description": "I like the employees here.  They are pretty cool, my only problem with this location is it's often fairly busy and hard to get a seat for my laptop!", "author": "ryan l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-20", "description": "This location is pretty small and always seems to be full. I am usually in and out of this location on my way to other places... In fact, sometimes I come here way out of my way to City College to grab a hot chocolate.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-04", "description": "A Starbucks is a Starbucks.  I don't drink coffee.  Never have and never will.  Luckily for Starbucks, they still receive my patronage every once in a while because I know so many coffee drinkers and they serve things other than just coffee.  My sister and I stopped in after a visit to Fruition.  It was a little chilly out so the warmth of indoors was nice.  It was relatively empty for a Saturday afternoon so there was no line and we got our drinks very quickly.  Since I'm not a coffee drinker (as mentioned above), I ordered the Apple Chai Tea Infusion.  It was either that or the Berry Chai Tea Infusion, but I figured apple was a safer bet than berry.  I'm not sure how the berry would have tasted, but the apple tasted like hot apple cider.  Just like it.", "author": "Kris L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "Since I could probably throw my latte from one Starbucks downtown to the next across the street, I decided to pick one that I actually like visiting. The baristas are friendly and consistent with their drinks, and one of my friends has a habit of picking up on the male employees. It all works out.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "Thanks for making my morning cheerful every day! I live two blocks down the street and go here minimum once a day. The guys are very nice. Love this location.", "author": "Liza A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-15", "description": "Do you really know what a good coffee taste like? You need to try Blue Bottle", "author": "Gustavo R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-14", "description": "I've been going to school and living between WP and Glen Park for quite some time now--and this place (during the winter) is my place of study. The staff are friendly, remember my drink, and make good conversation when the place is slow. Standard Starbucks drinks can be had for reasonable prices. They're always packed so finding seating can be difficult. Chatting up with a Barista and waiting a few minutes usually does the trick. The place is clean too...so that's a plus. Oh, and bonus points to this place for shooing out a customer whose Bird was making a mess while I was trying to study lecture notes about diabetic edema.", "author": "Christian D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-24", "description": "This is the closest starbucks to my house . . . it's good & usually fast enough to get me in and out in minimal time. More and more though I find myself up the street at Peets instead. Oh yeah, and parking sucks all over West Portal so it's best to walk here.", "author": "Todd F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-02", "description": "I won't go in to detail about Starbucks (if you're not familiar with them at this point....), but rather will comment on this location which is in a great, centrally located spot on West Portal.  It's a great place to stop while taking a walk through the neighborhood.  \nThe staff, on the other hand, could use a shot or two of espresso.  This location always seems to be well staffed but it always seems to be the slowest Starbucks I've ever been to.  They always seem half asleep or just uninterested.  \nIf you're not in a hurry, this is a nice enough place but if so, go to the one on top of the hill by Tower Market.", "author": "Barry K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "I like this Starbucks. Not bad.  It is lively atmosphere with the young and old. They are open late ( till 11pm)., which is another plus. Internet signal is strong enough and consistent. Staff?  Generally, fine.", "author": "AI T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-24", "description": "Do NOT go to this Starbucks. They have this outrages policy of no refill if you leave the store. NEVER heard of such policy in other Starbucks. My advice is to go to Peet's which is just half block down. If you like to have a refill after end of work day...Peet's will give a refill for $1 without hassle.", "author": "linda w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-03", "description": "Yeah, it's only Starbucks... But, I think it's the best Starbucks in San Francisco. I like the location, I like the staff, I like the way the line usually moves, I like that I can usually find a seat, and I like that the restrooms are usually functioning.", "author": "Bruce S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "I've only been here once, but I must say I really like it.  Even though it's another Starbucks, it actually almost felt like a real neighborhood cafe.  I think it has to do with the fact that it's on a corner, the employees are super-nice/friendly, and the patrons also seem to know each other.  Even though it was not the cleanest (they're super-busy), the restrooms were clean.  I was surprised.  So, in a nutshell, it's like a neighborhood-cafe with the corporate Starbucks amenity of having a clean restroom.", "author": "sarisha h."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-06", "description": "why do u always mess up my order?!? even when i gave you guys a second chance, you guys messed that up too!\n\n+1 star for getting my order right the third time ( i wouldnt have gone back, but my cousin made me and it was the closest starbucks )", "author": "JUDY L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-13", "description": "Now if I were rating Starbucks as a corporation it would not be four stars, but rating this specifc locations is higher, for a couple reasons.  Now, cleary I had a customer experience that most people dont have.  I've slept with two of the employees at this particular store, mostly because my roomate worked there, so you can't exactly expect.  But I'm thinking to myself, what places in the city come to mind as places I like, and I thought, well, Starbucks West Portal has always worked out well for you.  But more importantly for strangers, this is the closest Starbucks to a lot of the sunseters who live post Noriega.  So when the internet goes out, you can bring your laptop down.  Parking isnt so bad, not nearly as bad as most parts of the city.  The only drawback I'd say is that the place seems to be a haven for the fuzz.  Cops are in that place like, well, cops would be at a coffee shop.  And they always double parked, but thats not the 'bucks fault.  So many fond memories, an the place reminds me of home, maybe because my kitchen table is the former handicap table at this location.", "author": "Mike C."}
