{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "This is my favorite Starbucks location.  The service @ this location is superb compared to other locations like Noe Valley...Thank you for making my morning better with a grande cup of coffee and two packs of honey.  Keep up with the good work!!!", "author": "Don L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-11", "description": "Well, this Starbucks surely wins the dirty shop award today. Dirty restroom, dirty counters. But hey, wait, I see a guy wiping tables. \n\nAnd couldn't get a Clover Coffee since the machine was being cleaned so guess some things get cleaned from time to time. \n\nBig open space though. \n\nCoffee?  It's coffee. Nothing to get excited about.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "There is a girl here named Sam, she has pink hair today. She is the ultimate Barista. She is ultra-efficient, hardworking, is cheerful without being overly-so. When a mistake is brought to her attention, she corrects it without attitude. This woman should be in charge of training employees.", "author": "J. C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Okay all Starbucks should be modeled like this one. Feels cozy and it's comfy. No drug addicts and no one harassing you for change. Great cool staff with no bad attitude.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "I had a bit of a rough night and needed coffee. Stopped by this Starbucks location on Friday, July 28th around 6:45am. It was early and a weekday, so it wasn't too busy. We easily found a table for two after getting our coffee orders.\n\nI got a triple espresso and I believe my friend got a flat white? I have no idea what that is, but apparently it's espresso with steamed milk? Isn't that just a macchiato? I'm honestly not very versed in all the different Starbucks beverages, but our total ended up being $7.60 for both drinks. I'm not the biggest fan of Starbucks espresso in general as I find it weak, but this did the trick early in the morning.\n\nNice location as it seems comfy and there was plenty of seating when we got there. But I'm not the biggest fan of their coffee. It is convenient though as there are Starsbucks locations everywhere and I can easily use their app to do mobile ordering, etc. Overall, three stars.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "I was surprised at just how big this Starbucks is!    It looks like a small shop from the outside but, when you walk in --it just keeps on going and going. \nThere is a ton of seating and I was able to score the only available seat at that time-- a comfortable arm chair by the fireplace.  This coffee shop was packed at 4pm.\nMy latte was excellent as was the slice of pumpkin bread that went with it.\nThe vibe is chill and the people were too.  What a find.\nI worked a bit using their free wi-fi and enjoyed some down time from a hectic, busy week.", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "Guys, every single time I pick up my drink from your location, it tastes awful.  It's SOOOOO disappointing.  My husband just brought my drink home to me right now.  It tastes like water.  Your location is the only one that consistently makes me a lousy latte.  I love love love Starbucks but the Portola location makes the weakest, lamest, latte.  Please figure out how to improve.  Is it the \"pull\" as you call it?  Or are the beans old and no good?  Or maybe inexperienced baristas?  I just find it so disappointing to spend $5 on a double short latte and to get home and have it taste like nothing.  Disppointed", "author": "Pauline C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-06", "description": "Lots of space. Good service with friendly baristas who sometimes have been around for 10 years!! Can be crowded when high school are having their break. Main recent problem is dogs: more and more people are bringing their dogs in and often staying there with them. Doesn't feel very hygienic somehow.", "author": "Emmanuel R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "On a recent trip to SF, I stayed at my friends' house 2 minutes away. Needing caffeine, I planned on going for a coffee run, and asked what they wanted me to pick up for them. So the conversation went like this: \n\nme: Hi, I need these... (looking at my phone for the list) \nCashier: Sure, what can I get ya?\nme: Grande ice white mocha\nC: Whipped cream?\nme: I don't know, do people usually get whipped cream?\nC: Not usually, but some people want it, so I always ask.\nme: Then, no. \n\nme: Also need a tall extra hot non-fat latte\nC: Any sprinkles?\nme: Huh? Do people usually get sprinkles?\nC: Some do, but you don't have to.\nme: Then, no. \n\nC: Anything else?\nme: Yes, a croissant.\nC: Would you like that toasted?\nme: Uh .. do people usually like it toasted\nC: Some, yes. It's flakier\nme: Then, yes.\n\nC: Anthing else?\nme: Yes, a cinnamon coffee cake\nC: Would you like that warmed up?\nme: What? Seriously!? ...um... do people usually want it warmed it up?\nC: Yes, if they're going to eat it soon.\nme: Then, yes. \n\nC: Anything else? \nme: Yes, venti drip, little room for cream. Can you tell which one is for me?\n\nWe both laughed at the series of questions. He was a great sport for having the patience.\n\nThe interior is large, spacious and have tall ceilings. There are large black & white prints on the wall, and almost every table was occupied at 9:30 am with people chatting with their friends, and others on their laptops. I like this location, and I would come back if I'm staying with my friends again. And of course, my venti drip managed to wake me up and got my day started ... so thanks for that! \n\n* Street parking may be a little tricky as there aren't too many spaces, and others park & wait for the next space.", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "After a long day of going around the ​city, a couple of friends and I decided to take a visit at one of the nearby Starbucks locations. It was about 9 PM.\n\nThe staff were still very active ​and seemed like a tight group of friends. I wanted to try my hand at ordering an item off the secret menu. They didn't know what it was but, a quick search on my phone provided them instructions and they made it readily and happily. They treated me like a longtime friend which is very nice compared to the stereotypical populace of San Fran.\n\nWe spent about a half an hour there and the place was well insulated and blocked a lot of the sounds of the busy streets.\n\nOverall, would recommend this to a friend even if they weren't near the location.", "author": "Eliza H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "I hope this Starbucks pays attention to these Yelp reviews. Been a long time patron of this Starbucks. I've recently been using my mobile app for my orders, and have been sorely disappointed. I've had issues with the food portion of my order. Once I had to wait 15 mins because they were so behind. Thankfully, the barista Victor addressed this issue before any of us customers who were waiting for our food orders addressed it with the staff. Granted, it was busy, and during the rush, Victor was very proactive on trying to figure out why this was happening and busted his butt to make sure we were all taken care of. \nToday was a different story. I went later in the morning with the expectation of it all being better. Nope. My beverage was waiting for me. But again, not my food. I waited for about 5 mins, got not acknowledgement so I made the first move. I asked about my breakfast sandwich, to which I received and immediate reply from the barista who was making coffee right in front of me the entire time i was standing there...she said \"oh yeah, that girl grabbed your sandwich instead, but here is hers, its the same one, just take it\"...WTF? Really? Oh, and it was the last one. They offered to re-heat it. NOPE. They offered a refund. I was hungry so I said screw it, I ordered something else. Not happy with the mobile service there. I get mistakes happen, but catch a clue baristas...Victor gets it, why can't you?", "author": "Danielle G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "The bathroom did not have a passcode, bless up. Still bought a white hot chocolate though, and spilled it on my shirt, wtf man. It was still pretty good.", "author": "Donald C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-28", "description": "Best caramel macchiato I've ever had in. my. LIFE (and I've had at least a billion). God bless the baristas who work at this location!", "author": "C M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-15", "description": "I usually don't write reviews on here, but coming to this Starbucks today was deemed appropriate. I was there around 6 pm, not busy at all.  I ordered an iced decaf cafe americano. As I waited for my order, the barista (I forgot to get her name but she's a young lady with curly hair) called out my name with my order, which was given to me in a hot cup. Confused I asked her what it was and with a sarcastic voice, she said, \"decaf cafe americano.\" I said to her that I ordered iced. Her coworker even verified my order by saying, \" Did I not put \"iced\" on there?\" The barista grabbed the coffee then she rolled her eyes. She grabbed a cold cup to put water in it, pushing the water dispenser so hard that the water splashed from inside the cup. The coffee she grabbed from me, poured out the content then threw the cup in the trash in a tossing manner. As I waited for my new iced coffee when she finished, she tells me \"Here you go,\" as she tossed it on the counter in a sliding manner. I was so livid, but I didn't want to call her out because I did not want to make a scene.", "author": "John S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-19", "description": "Sorry guys.  Although I was greeted and the guy who took my order was upbeat and friendly, It took too long to deliver my warm food.  The store was not busy.   When I finally got the food, it was sans the packet of Siracha sauce.  Not a big deal Except the clerk gave me attitude when I told him that the sauce packet was missing.  When he did provide the packet he lectured me about ordering it at the register.  He clued out on the part where I said that I ordered it and they forgot to provide it.  It's a packet of seasoning.  Ya don't give the customer grief over a .10 cent item especially when the store made the error.", "author": "M A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "There is plenty of seats in this Starbucks, especially at the long wooden table in the middle. You will ALWAYS find seats to study here (unlike many cafe in San Francisco). And there are 4 different types of seat! You can seat at the community wooden table (if you like a lot of table space to lay out your things), at the regular coffee shop tables, the elevated coffee shop tables, and the sofas. The staff are always very friendly and the service is very fast. The environment is clean and cozy, a perfect place to grab a coffee and get some work done. I wish it opens later than 8pm.", "author": "Q X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Even if you stained my teeth coz I am a coffee addict I still love you! Your caffeine is getting into my veins! Very down to earth!", "author": "Noah R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Came here today to order a Grande Soy Single Shot Caramel Latte. Jorge was great and made the drink, however, upon handing it to me, he immediately took the drink back and said, \" oops! Yours was the soy!\" \n\nHe immediately took it back, and remade the proper drink for me with soy. \n\nGood catch Jorge! It would have been a gastrointestinal Armageddon for me if you didn't catch it! Not everyone remembers...", "author": "Peter R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "What a great starbucks location! Drinks are well-prepared, staff is friendly! And today we got free cake pops with our order", "author": "Thalia C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-18", "description": "This place is quite big and the decorations inside are amazing. The only thing that irritated me was the lady behind the counter wasn't paying attention to our order and ended up messing one of our orders. I had to tell her THREE TIMES that I wanted something but then  she ended up charging and giving me something else.  I would rather go to other locations where the service is better.", "author": "Abby K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-22", "description": "Located on Portola, there is plenty of metered street parking available. At peak times there can be a bit of a line/back-up but it moves quickly. They offer breakfast sandwiches that can be warmed up, other drinks and many pre-packaged lunch items.  \n.\nMany tables have power for your lap-top and wireless charging that can accommodate most any phone, I-phone or Android.\n.\nIt seems to me every roast, even the Blond tastes burned but it is tolerable when I dont feel like crossing town for something better. I get a bit confused with their cup sizes because they dont call them small, medium or large; they are Short, Grande and Venti...I hope there is no test before I pick up my coffee.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "These guys up here are awesome. Always smile and never rude. Always a pleasure to come here. Most stylish wall too by the way. My venti vanilla latte is delicious. Never too much milk and enough espresso to make it worth driving out of my way for. Thanks guys", "author": "S F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-03", "description": "I asked Victoria at this Starbucks to brew a pot of decaf coffee since they didn't have any made. She said she wouldn't brew a pot of coffee just for me. Given the fact that they are a coffee shop and charge around 3 bucks a cup for coffee... Most other coffee shops will do this if they are out of decaf.", "author": "James M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Bad experience at this Starbucks. My brother ordered 4 Frappuccinos. When he got them he saw that they were watery and not how they usually make them. He told this to the barista and she answered, \"well we don't put any water in them\". Obviously he didn't mean that they had water, although they DO have ice in them. He explained what he meant and asked her to make them again. Already having an attitude, the barista proceeds to make the Frappuccinos again - only this time one by one - taking her sweet time and whispering to one of the other baristas behind the counter. So the Frappuccinos were better the second time around, but had been sitting on the counter because the barista decided to make them one at a time. What's with the attitude? I would understand if my brother had been rude or yelled at her, but he simply explained why he wasn't happy with the consistency of the drink and the barista seems to have taken it personally. Not good service Starbucks. Not good at all.", "author": "Cindy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Nice layout and technology oriented. Even if I try to avoid Starbucks (especially in SF I would rather go to some indie coffee shop) I really liked this one because of the communal table and the availability of giving juice to my thirsty phone. We did not have difficulty getting a parking spot just in front of the store as it was a Sunday afternoon, but I can guess is not easy to park during 'normal' hours.", "author": "Carmen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "This is still one of my favorite Starbucks to come. The location is large with plenty of indoor and outdoor seating. Free wifi and outlets.\nThe staff is always happy and helpful. \nI encourage everyone to do online ordering it's faster or you can stand in line and breathe in all the people watching.", "author": "Erin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "Does this place ever get crowded?\n\nThis Starbucks has a nice layout - wide and stretched, not too stuffed with tables and seats, yet I never saw it completely crowded. It's one of those Starbucks that actually allow a nice conversation without overhearing what the chatty girls on the next table have to say about Kim Kardashian's latest outfit faux pas.\n\nCombine your visit with a sandwich from Mollie Stone's and you're good to go.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "We've been to this SB a few times and I like it because the place is so big compared to smaller locations.  They have a big long table for laptops, high stools/tables for 2s and I especially like the 4 comfy, big lounge chairs - makes you feel as if you're at home and want to ask,  \"Where's the fireplace?\".   \nUpon entering, you'll see the enticing merchandise for sale and to the right, a wall full of mugs, thermos, cups.  At this time, a few older merchandise are marked for sale, but only reduced by about $4.  There's the usual SF items - a lovely ceramic SF decorated tall mug with gold colored cap, about $23 but I would be afraid to use it outside the house because if you drop it, it will shatter.  There are the thin, transparent glass water thermos and plastic ones with SF decorations.\nThe counter has a lot of enticements for you to buy, food, snack bars, etc.  It just feels so much more spacious.  I was surprised at the number of folks in there at noon, on a weekday.  A couple of pairs of cops also stopped by for coffee at separate times.  The budget conscious cop or non-Starbucks coffee drinker would buy purchase their coffee from the place next door, so there are options other than SB coffee.  Molly Stone's market is just a couple of store fronts away.  \nToo bad SB is raising the price of their coffee, by as much as 30 cents.  A venti mocha and tall latte cost $8.  I could get nearly a whole pound of SB beans on sale for less than that at Safeway such that buying a cup of coffee at SB is more a treat than an everyday thing.", "author": "Ry T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "First off, I want to say Victor is fabulous!  Most of the staff are very customer oriented.  What's up Michelle with the Blue hair?  Rude, obnoxious, unfriendly, curt, generally all around unhappy person?  It only takes one person to create an unappealing atmosphere.  If you hate what you are doing.. walk.  ‍", "author": "Deb C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-30", "description": "This isn't my 1st time going here cuz it's on the way to work, and normally good. But TODAY f'en seriously, the worst customer service from cashier to server, either both don't understand simple English or being ignorant. Chocolate chestnut  praline. 1st didn't a wrong order with coffee 2nd all I have is chestnut praline in hot water. Listen to direction..", "author": "Marlui A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "Found my new to go place Starbucks when i have work. This Starbucks looks small & somewhat hidden from the outside, but inside it is spacious, has couches & whoa a fireplace (fancy fancy)! This particular location must be cool & special because the police academy is pretty nearby and it is also where some of the popos hang out spot to grab coffee or chit chat. \n\nThe service is quick & fast when I went on a sunday morning. My vanilla latte was made to my liking. \n\nI'll definitely be coming back to this Starbucks on the daily during the mornings!", "author": "Kathleen U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "I like this Starbucks location. It's so close to my house and tucked away in a tiny local neighborhood. Next door to Creighton's and Tower Market as well, yay. Never really had a problem with their service.\n\nWell, you can't really say too much about any ol' Starbucks and their drinks or pastries. Starbucks will always be Starbucks. I came here once for Thanksgiving studying and it was super distracting because I was still in school mode while a bunch of families were coming in and out, celebrating and cheering on the holidays.\n\nAnother moment I remember here was when I came to do some reading and ordered a peach green tea lemonade. The barista was like \"hey, aren't you that girl who works at that gelato shop?\"\n\nYes, I am that girl.", "author": "Kathleen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "I really want to like this Starbucks because the floor plan space is HUGE. If it weren't for the metered parking, this would be my go-to coffee house to work out of. The space alone is worth one added star. \n\nSadly, this location has more cons than pros, and all service related. A few cashiers/baristas here have snarky attitudes that I've never encountered at a Starbucks before. Typically attitudes are friendly and attentive at other Starbucks, which is great. This location, on multiple occasions with different staff, has taken way longer to ring people in line up, and combined with less then friendly attitudes, is surprising to say the least. \n\nThe other gripe I have with them is their cold brew! I've ordered it here 4-5x and each time it tastes like a burnt Iced Americana. But the place is always super busy that I cut my losses over a $2 drink and try next time. Needless to say, I won't order the cold brew here anymore if they can't get the logistics down on making it. Yuck. \n\nLastly, I asked for a venti iced water to go with my coffee and food I bought, and the cashier stated they're only allowed to give me a tall. I asked if she could make an exception, but she wouldn't budge. Wtf?!", "author": "Matthew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "This Starbucks location is super technology-friendly! On the long shared table, there are Powermats installed! Powermats are wireless charging stations. There are also plenty of outlets and seats, so ideal for studying/working. \n\nOne of my fave Starbucks locations :)", "author": "Samantha C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-12", "description": "This Starbucks is very close to my school so I am there a lot, and usually it's fine but today I had a very unpleasant experience that made me never want to patronize a Starbucks again.\nWhen my friend and I got to the counter to order, we misread the price so we had to pause to get more money out of our wallets. This was an extra 10, maybe 15 seconds of waiting, but the barista taking our order, his name was Victor, said \"next time ladies have your money ready, I have my general manager watching me and I have a line behind you so I can't be standing here with you counting change!\" \nKeep in mind that there were four, maybe 5 people in line behind us. I was shocked by his rudeness. Seriously considering going in to speak to the manager about this employee. No matter how stressed out you are you don't get to be rude to the customers!", "author": "Sophia J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "This is my Starbucks I hit before work. I hate the fog and occasionally getting into near accidents outside because people don't pay attention that it is a one way street. Even customers coming out of here walk in the middle of the street to get to their car. So many idiots that makes a ton of money, but can't read a sign. \n\nThe coffee shop opens early and closes even earlier. I get there at 7am and it is empty most of the time and others filled with cops when school is out. The staff tries to get people out fast, so fast that they screw up the orders. When school is in, this street is packed.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "This Starbucks is absolutely amazing. I frequent this location almost daily, mainly during the a.m. shift. The customer service is phenomenal and the way they go above and beyond to treat each customer with respect should be applauded. There are some new staff who can use a bit more training when it comes to having a friendly demeanor. However; those who have been working here for an extended period of time are just the BEST EVER!! I truly love coming here and enjoy every minute I spend in this establishment..", "author": "Lila N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "I've been going to this Starbucks since my freshman year of high school so the cashiers and baristas are familiar with me and what I usually order. They have really quick service despite the fact that a lot of people coming in whether they are students from SOTACAD or staff from Laguna Honda.", "author": "Thricia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "This is a really nice Starbucks. It has a large, comfortable interior, a variety of seating options, powermat chargers in a number of spots, and a good bathroom. Cleanliness and appearance are very good. Employees are always friendly, and make my drinks correctly and quickly.\n\nAs for cons, the parking area (with parking meters) can be a challenge to get into when driving on Portola from the direction of downtown. Portola is also daunting to cross as a pedestrian. Inside, there's a bit of a maze to get in line, but it's a straight shot to the exit if you want to grab your drink and go. One time in the past couple months, it was very humid inside and the windows were fogged up. My glasses became fogged up as well.\n\nI'd go here more often if only the location was convenient for me. Hopefully the comfort and service here remain consistently great.", "author": "Brett N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-22", "description": "Had ordered a tall cinnamon dolce latte over the app.  When I picked it up, I was wondering why it was so light in weight.  It was only half a cup. It's not a tall order.  They should have named it half-tall latte. I ordered the same at another location. It was 3/4 of the tall cup size.  Honestly, don't call it tall if it's not tall.  Tell it like it is; half tall or 3/4 tall.", "author": "Nanette L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Love this gem. Best Barista Ryan, who is new to the area. Go by and say hi to him and welcome him to the city. He is a hard worker and always smiles. Staff is fun and friendly.", "author": "Jaimie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-03", "description": "My favorite Starbucks in the city! \n\nThis location looks the nicest, is always super clean, and, by far, has the best service. I love love love the people who work here, and sorry to pick favorites, but be nice to Mal and Mau (I think that's her name)- they're the best! They're always extra friendly and genuine and they're the main reason why this location is the best. \nThanks, guys!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "I know you might be thinking \" why is this guy writing a review for a Starbucks ?\" We already know what Starbucks is all about right ? True ! But this location is different from other locations .First difference , I like to order a small , medium or large at Starbucks and they gave me zero crap for doing it . Second , staff is super chill and they work well together ... I know makes no sense , works well together ? Yes . They're like the goldenstate  warriors of Starbucks . If one guy is busy , it's next man up and he'll start your order and have it ready for you by the time you pay for it . They have good chemistry here is what I'm trying to say. Every time I go here it's always good vibes whether it's 5 in the morning or later on in the afternoon . Plus plenty of room to study work or lounge around. All in all ,good place to get Starbucks coffee haha", "author": "Toan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "This is a great place to work. It's spacious, fancy and clean. There are free cordless charger for all smart phones for free. There isn't anything like this from Starbucks anywhere else but here. No noisy, or annoying people. I love this place.", "author": "Thyra K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-19", "description": "My wife and I go to this starbucks quite often, normally during the early morning or mid-day. my wife went in tonight around 7 and was treated so rudely by michelle and corey. my wife ordered, with michelle, a creme brulee Frappuccino extra thick and a mocha latte. michelle barked at my wife that she meant a caramel brulee Frappuccino and she wanted it with extra ice. my wife ignored how rude she was and waited for our drinks. she noticed that corey was actually making her a mocha Frappuccino instead of a latte but decided not to say anything. when she noticed that he was making a caramel brulee latte instead of a Frappuccino she told him, before it was finished, that she ordered a Frappuccino. he then rolled his eyes and sighed, 'I'll fix it.' my wife was so upset by how rude they were that she called me to tell me about it. so, not only were they rude to my wife, they messed up our drinks. I understand people have hard days but there's no reason to ruin someone else's day too. very bad customer service from these two.", "author": "Jelina A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Always, great coffee, great service, but the worst almond croissant's like eating baked bread just need better recipe everything else is great :)", "author": "Sergei Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-23", "description": "This location is great.  Located on a strip mall by Walgreen's.  Very long and spacious storefront.  Lots of tables.  The barista counter is located in the far back of the store.  Metered parking spaces, and easy parking. \n\nAnd they've always got tons of the Pick of the Week on iTunes unlike the other two Starbucks that I frequent.  Maybe it's due to less foot traffic.  Dunno, but I like that extra perk.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-12", "description": "This is the place where I am misgendered more than any other place. I say that folks who work at Starbucks should stop using binary terms (sir, ma'am) to decide what a person's gender is upon first glance. You're wrong, a lot. Just say hello or good morning", "author": "Reese G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-19", "description": "The physicals of this store are great. Good place to sit and meet people.\n\nBut this store does not respect the nationwide starbucks coupons. I've gone in here multiple times when I hear about a starbucks special and they always have some excuse to not honor the promo or they change the promo slightly.\n\nToday I went in for the free tall starbucks blend coffee. As I stood in line, their sign even said \"free tall starbucks blend coffee--until noon\". So I'm like OK cool i guess they are having this promo. I'd come in a few months ago for a separate promo only to be told it wasn't on during that day. \n\nI get up to the register, making sure to get the order correct. They tell me I need to also buy a 'pastry' to get the deal. OK there is a big line and I dont want to make a scene so I get the pastry. No big deal. Then I went down the street to a starbucks inside a safeway to check what the deal was, and they're like yup you can get a drink. no need to buy a pastry. I already have my cup but wtf. \n\nI buy my share of starbucks coffee and gift cards but it just leaves a sour taste in your mouth when you go in thinking you will get a deal and they even advertise it. But there's a catch. They are taking advantage of the parent company's promo but goosing their own profits by only partially participating.", "author": "J B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-03", "description": "This location is located in a nice small shopping plaza. I almost missed it when I was looking for it. It's really big and spacious. Friendly staff. I needed a large coffee carrier and they prepared one right away. They packed all the cream, sugar and cups.", "author": "Karen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-19", "description": "Us Miraloma Residents love our Starbucks. The staff is amazing, remembering names of the patrons and they work really well as a team. Going here is always a nice experience. Friendly, attentive caring staff.", "author": "M S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "This place would get five stars, because the service is amazing considering the volume of customers in the morning, but they let the extremely annoying artsy high school kids from down the block overtake the place every morning.  I don't want to watch you draw random non-sense while playing your ukelele all morning overly hipster high school kids.  Go and learn some real life skills.\n\nBONUS - there always seems to be a SFPD officer (or 6) hanging out at this Starbucks, so I always feel safe leaving my laptop/book out on my table while going up for a coffee refill or to the bathroom.  If someone wants to try and jack my stuff in front of six armed officers, then honestly they probably deserve it.", "author": "Brice H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-03", "description": "This Starbucks location is convenient for me when I'm around the area. The baristas are friendly and chill and the frappes are great! :-)\n\nWould go back again.", "author": "Lauren Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "This Starbucks is down the street from where I grew up so at one point, I frequented this place a lot. I like that they have a fireplace and couches as well as the standard table and chairs. The store is clean and staff is friendly. \n\nBe careful around 3 on regular weekdays. The high school kids invade the store when they get off.", "author": "Christy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "This starbucks has the BEST CUSTOMER SERVICE. Their baristas always try to learn the names/drinks of the customers and they are always attentive to giving great service. I love the positive vibes amongst their team and how nice they always are specially when it is super busy. This is the best Starbucks in the city ;)", "author": "Braulio A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-20", "description": "I like this Starbucks location a lot because its really spacious and the employees are so  friendly except for one... but I'm not going to point out anything specific lol. Lets just say he seems to always be in a cranky mood every time I go here. Other than that everything about this location is great. If you go at the right time, it's a pretty chill spot and my drinks are always made perfectly.", "author": "Alyssa C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "This Starbucks is my favorite one.\n\n Quiet, spacious, never *too* crowded (in other words, you'll always have a place to sit. Unlike West Portal Starbucks...). The free wi-fi is also great (which probably has something to do with the lack of people).\n\nThe service is also fantastic. Very friendly and helpful baristas. \n\nThis location also has a fireplace. Sitting by a fireplace in a cozy chair makes studying more bearable. \n\nThe only reason I knocked down a star: closing somewhat early at 8pm. I wish it stayed up until at least 9, but it is what it is. They open early at 5am, for morning-people!", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "I just moved to the area recently, therefore, I don't have internet.  I love using Starbucks free internet, but I also love drinking Vanilla Bean Fraps or Caramel Apple Spice. Now, I am a partner, but this is not my store.  The staff here are very nice and the place is very clean.  They also seem to have a good mix a people sitting talking and using their computers.  If you need a seat, you may be disappointed here or you can wait until a seat opens up. I would recommend stopping by and giving the partners (baristas) there a high-five and order a drink. They are sure to give you service with a smile.\n\nThank guys for the delicious drink...\n\nAnd as always,\n\nHave Fun!!!", "author": "Christian H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-04", "description": "This Starbucks is the best Starbucks I have ever been to, to be honest. The first you thing notice when you walk in is that it's a very spacious place. The smell of coffee is intoxicating to any half awake high school kid like me. The staff here are friendly (shout out to Jae!) and if you get to know them long enough, they are quite the friendly lot, unlike most other Starbucks where you are served just coffee, here you are served coffee and community. The drinks taste far better than most other Starbucks I have been to. If there was one last cup of coffee I can have at anywhere in San Francisco on the last day of my life, it'd be here.", "author": "Richard L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Been going to this Starbucks for a couple years now and everyone here is amazing. The second time I came in they started talking to me and making conversation and made me feel really welcome, it's crazy. It's always clean, looks incredible ( especially in comparison to other locations), and is incredibly spacious. I also noticed that the baristas and managers here are significantly more friendly towards their customers. For example, every time I walk in, I see Victor saying hi to a kid or making other customers feel like they are actually wanted at the store! Five stars to this Starbucks, these people havent disappointed me at all.", "author": "Justin Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-15", "description": "Any place with an employee that insists, to my face, that they will put a plastic lid on my warm-ordered (specifically ordered not hot, so that it would not burn) coffee cup - despite me being right there to say not to put one on in advance, and then when they insist, me practically begging them not to put on the lid , and despite me then insisting I really don't want it and explaining it's just a waste of plastic and that I am going to just put it straight in the recycling bin 1 foot away from when they handed to me, - and then they go ahead and stick on the lid anyway and tell me to have a nice day, gets one star from me, sorry", "author": "Mike D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "Of course my cappuccinos are always amazing, but it's the morning crew here that is the shining gold star of customer service. I would nominate this store for the \"if you want to be trained RIGHT in customer service you train here\". Even after they are busting through a 15 person line, when you step up you are treated like the very first customer of the day. Great job to all, EVERY DAY.", "author": "Jodie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "This is a solid Starbucks. The staff are friendly and welcoming, the newly redesigned building is really pretty and the drinks are made quickly. There is also a bunch of seating so you can always make yourself comfortable.", "author": "Emma W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "There's no doubt that when it comes to customer service, this location leads the pack.  Helpful, friendly and knowledgeable staff.", "author": "Kit P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-05", "description": "My wife and I come here every other day and feel like this is almost our second home... The team rocks across the board, so say Hi for me to Victor, Jae, Michelle, David, or really any other member of this team. And you guys, keep up that spirit!", "author": "Stefan N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-04", "description": "To start my mobile order was not ready. I watched the barista make the ice green tea latte. A little water, ice, milk then the green tea powder on top then she put the lid on and swirled it around and handed it to me. The powder was not dissolved and stuck on the lid. When I questioned it the barista informed me that's how it's served I told her I received one like that. I asked for the manager he listened then he said his shift just ended and I spoke with another manager. He didn't leave and stayed to listen. When I asked for my money back and didn't want it anymore the first manager says I'll drink it. Unprofessional but what do you expect from a manager kid that looks like he's 17 yrs old. Has anyone ever received a drink like that before? I haven't! Not going back! Miraloma/Portola store", "author": "Chris V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-25", "description": "This could seriously be the nicest Starbucks I've ever been to. It's just lovely inside. Lots of space to spend lots of time here. Love it.", "author": "Karla R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-01", "description": "Bad customer service. Lady at the register didn't get my order correct, put my cup down before I finished saying my order so of course she got it wrong. And she didn't even read back for clarification. Barista with the glasses has too much attitude and poor customer service. When I asked if the drink syrup would be affected because he poured it out he said \"you tell me.\" Skip this Starbucks if you don't want snappy baristas giving you attitude", "author": "Kimmie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Starbucks is Starbucks no matter where you go, for the most part that is. The employee's here are not necessarily the most enthusiastic coffee shop workers I've come across but they are nice and decently quick with my lattes! The reason I'm writing a review about this specific Starbucks and not the other 100 locations I have been to around the city is because they always have a place to sit and it's a great place if you need to study or get some things done. Lot's of outlets and it's big inside so you don't feel like your sharing a computer screen with a stranger. Also, they have a lot of cool Starbucks nick-nacks so if you need a last minute gift this is the Starbucks you should go to. They have some metered parking in the front, or if you down to walk a block or so its free!", "author": "Brandi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "Service is always excellent and so are the drinks. This location is conveniently located near my house.\n\nI wish I knew her name but the African American barista who usually works the register is absolutely wonderful and by far the best customer service provider out of all the Starbucks locations I've been to.\n\nKeep it up", "author": "NC B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-19", "description": "This location is the swankiest yet. It's like they took the best ideas from all the other StBuxes and incorporated them into this location. Besides the standard tables for two and tables for four, it also has a fireplace, a communal table and sofas. It looks small from the outside but it's quite roomy inside. Baristas are friendly just enough.\n\nIt's busy-crowded in the morning, since it's a stop along the very busy Portola Dr (leads to 19thAve/Hwy280S or toward downtown Market St) and O'Shaughnessy Blvd (leads to Hwy101 or alternate route to 280S) intersection. The lack of parking will be evident, unless one is willing to wait or search for parking in the nearby side streets and walk a block or two. Otherwise, meters are $.25/8mins (meter maids have field day giving parking tickets here..bordering on blood lust even).\n\nIf going around late afternoon, this place is a stop for kids after school lets out. So, the \"clientele\" is predominately kids, or parents who picked up the same kids from school and decided to stop in. At night, they close early (8pm).", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-10", "description": "As far as Starbucks goes, this one is nice. There is free high speed wifi and the staff are helpful and friendly. It's clean and tidy [possibly been decorated recently?] and you can sit for a while with a latte and your macbook without any fuss. There is parking out front, on a meter, and I think it's free after 18:00. We have been a couple of times and we will probably return on future holidays. Don't forget to check out Mollie's whilst you're here - review to follow!", "author": "Lindsey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-30", "description": "Is it even possible to LOVE a Starbucks? I wasn't sure until I moved to the area and started coming to the Portola Starbucks about a year ago. Now I can safely say that I love this Starbucks. The baristas at this location are the reason why they deserve 5 stars. I would give these baristas 6 stars if I could. \n\nI finally had the opportunity to ask the names of my favorite employees at this location and they are:\n\nJay, Stephen (I think), and Jackie. \n\nJay never fails at making me smile. He's so kind, funny, and super quick at taking orders and making drinks. \n\nThe morning crowd of post-drop-of-kids-at-school parents can be daunting (long lines), but this location is well-staffed and quick at getting everyone in and out. \n\nParking might be worth complaining about, but I've never had a major issue with it and I'm stopping by this Starbucks almost everyday. I rarely have to circle around to get a spot. It might be hard to get a front and center parking spot, but you can usually find one closer to Mollie Stone's or in the next lot over. It's about a 2-second walk anyway, so who really cares?\n\nOnly advice--- avoid this area during the school year between 11:30am-12:30pm. The high school kids have off-campus lunch and they crowd up the Starbucks (and every other store in this place). I sometimes end up coming during that time anyway, and it's not a big deal. Like I said, the baristas keep the line moving. I just try to avoid it because listening to the conversations of 16-year olds talking loudly is like nails on a chalkboard ;)", "author": "AnneMarie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "one of my favorite starbucks in the city! i know some starbucks are cramped and don't offer much seating, but this starbucks in particular has a large open space and many tables, perfect for those who need to study or just want to read a book with their coffee. there's also a cozy fireplace, and a bathroom that's clean and equipped with a VACANT/OCCUPIED sign (my favorite part to be honest, i hate when people try to open the door when you're doing your business)!\n\nthe baristas are friendly and the drinks are good. they've spelled my name right on a somewhat normal basis, which is a rare occurrence at the other starbucks i've been to.\n\nthe one thing about this place that doesn't get it 5 stars is the fact that THE AC IS ALWAYS ON! i get a good study/read on, but i'm freezing my butt off in less than an hour. this location is already in a foggy, windier part of san francisco, no need to accentuate the weather with a bone chilly air inside as well!\n\nlove this starbucks, hate the air conditioning. if you're planning on coming here for an extended time period of over half an hour, don't forget to bring a sweater!", "author": "Caitlin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-26", "description": "Average coffee. I don't typically drink Starbucks unless there are no other options because I prefer much stronger coffee. I do like that this location is larger. Beware of the SOTA kids at certain times, it can get loud and crowded.", "author": "Maria M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-12", "description": "While I typically prefer coffee shops that are not corporate giants, this Starbucks location does offer a nice gathering area with a fireplace to boot.\nThe real winning point of this location is the friendly staff.  You know that you are frequenting a location often when the staff knows your order before you get to the cashier!  \nI also will occasionally hold a meeting here, as my office is on the next block.  There do tend to be many teens gathering early in the morning prior to school starting, but that aside, this location is \"Winning\" for me.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-18", "description": "I go to this location usually because of the parking. But as of lately, quality of service and coffee seems to be lacking. I'm use to the marching drum line pace of the financial district locations and of course, coffee being coffee without the grinds in them.", "author": "Lisa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "I occasionally work in this area. When I know I will be there I look forward to this Starbucks. I'm not sure what it is, except maybe the great staff, but this location has an edge over the rest. \n\nI always wish I had time to hang out here, but I never do.", "author": "Stella N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-18", "description": "The staff here is super friendly. Even though it's obviously a big chain, this Starbucks has kind of a neighborhood feel to it. You see lots of regulars. Big ups to my man Jae here for chatting about comic books and Game of Thrones.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "I come here all the time.  Staff is great.  Coffee is delicious but not as good as many other coffee places in SF such as Peets, Muddy Waters, Philz and Blue Bottle.  Starbucks prices are way too high.  Convenience.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-06", "description": "Last night I went there! I really want a hot chocolate, I found a near starbucks! I get there just about 8pm! And I saw a people right there! I try to open the door but it is close! I just want to ask a question! Then he turn off the light! What? I can't just ask a question? \n\nI really really love starbucks,but it is a bad impression!", "author": "Gan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-18", "description": "David, Jay, Amira, Ria, Alicia, and Victor and all the rest - GREAT CREW GREAT STARBUCKS - love love love them !", "author": "jennifer t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "I've been coming here since the day they opened back around 1998.  It's one of the best places to come by for a break from work and have a little chit chat from the staff.  Come often.", "author": "Joe N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-16", "description": "This is a FIVE STAR UPDATE, folks, with an important tip: \n\nFor those of you who are Starbucks regulars, know this: it benefits you WAAAAAAAAAY more to use a Starbucks card (their gift cards, not a credit card). Starbucks now has a rewards program that is rather minimal, but still offers rewards, and you can only be a part of this if you have a registered Starbucks card. \n\nWhy would you do this? Well, the big benefits are this: 2 hours FREE Wifi every visit, free syrups and free drinks every once in awhile. \n\nThe best part about this is that you don't need to spend any more than you normally would. Even if you go to Starbucks infrequently, get a gift card the next time you go. Instead of paying for you drink, put $5 on the card and use it to pay. When you're done, you can register it online and then use free wifi (which you normally would be paying $9 an hour for). \n\nHope this helps!", "author": "Tom A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-25", "description": "I am super impressed by the baristas at this location - I used to come here more frequently until I got a Starbucks at work.  Now, it's usually just Sunday mornings on the way home from dog walking.  But, they always get my drink right and - I don't know how they do it - they remember my name and what I drink. All of the staff has been very friendly and my drink order is always right.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "For those of you remember when Starbucks first came on the scene, this place is reminiscent of why you started going to Starbucks in the first place.  It's less commercial and more coffee house in comparison to most Starbucks.\n\nIt's huge.\n\nIt has plenty of seating.\n\nIt has different kinds of seating including a communal table and living room style chairs near the fireplace.\n\nThe baristas are really nice.  Conversational and efficient.  And happy even tho they can't see daylight from where they work.\n\nIt's convenient.  There are buses and there is usually parking (metered).  It's in a small \"strip\" that also houses Mollie Stone's, drycleaners, Walgreens.  And it's not too far from Miraloma Auto Care if you're waiting for your car.", "author": "Bee J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "This is probaly the best Starbucks around. The people who work here are great and always remember my order. It's clean and even during the noon rush the orders go out quickly. This should be a model for other Starbucks!", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "5 stars because well, the staff is incredibly friendly and always tries to make conversation with their customers! I like friendly staff. :) Hahaha.\nIt's really clean too, so I have no problem finding a table to sit at if I'm ever in there, waiting for a friend. \nI know Starbucks doesn't have the STRONGEST coffee, but I mean, it's still pretty good. Pretty decent. The variety is awesome. I usually get myself a Vanilla Latte or a Green Tea Latte. \nThe location is also pretty good 'cause it's close to the buses that take you to Forest Hill or Glen Park Bart Station. There's also a parking lot with meters and street parking.", "author": "Susan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "Staff is upbeat and efficient.  Plenty of seating and the store is quite spacious.  Normally  I just grab and go, but I find myself staying longer than normal at this particular Starbucks.", "author": "Stacey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-02", "description": "I'm not a big fan of Starbucks but this is convenient and there isn't much out in Twin Peaks so I come here when I absolutely need a cup of coffee. During the school year it gets very busy and loud with HS students from nearby SOTA. It can get annoying. Their lounge space is large in comparison to other SF locations.", "author": "M R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-11", "description": "Accessible parking, especially on Sundays but it gets packed. Friendly staff.", "author": "Daniel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-26", "description": "I wouldn't usually review a Starbucks, as they tend to be about the same, but this one is an exception. For one, it's BIG, with a good amount of different types of seating. I like to come here to study for that reason and also because it has a decent number of outlets to plug my laptop into. It's surprisingly not that busy, and while if you park right outside it's metered, there's some residential parking nearby if you don't mind taking a short walk. The staff is nice, the music isn't too loud and it tends to be a comfortable temperature. No complaints!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-14", "description": "I was so happy to see this Starbucks come up when I searched \"best coffee shops\" on Yelp.  It's my local Starbucks and I thought I was biased, but after visiting tons of others around SF, I still think this is the best one in town.  \n\nPROS:  The staff here is what makes it special-- I hope they get credit for these positive reviews.  They always greet me with absolute sincerity, beyond niceness, remember my name, my 'usual' orders and they are FAST.  I've seen them do this to many other people as well.  They are intelligent, switching gears fast according to what's needed at the time.  They all work in sync.  Some are students working their way through school or artists, but all treat the job as a professional, not as a 'temporary' thing.  I've been in at 6AM and later at 1PM- no matter how tired they might be, they don't show it.  No drama, no-nonsense, customer-first service and yes, they crank those drinks out, even with the additional pleasantry exchanges.\n\nCON:  Parking. The meter maid cruises this little strip because it's easy ticketing for them.  Why there is a meter maid in this area is beyond me (and a waste of tax dollars).  \n\nCOMPARE Other Starbucks: long lines (because of a take-your-time person behind the register), longer lines waiting for drinks to be done, staff only do one thing at a time, the napkin/cream table is a mess, drinks don't taste quite 'right'.\n\nI thought twice about writing this review as I don't want the secret to be out and end up with a crowded local coffee shop, but I'm glad that others feel the same way.  This team is hands-down awesome.", "author": "Jane Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "Hot coffee and idle banter usually mix to form an ideal morning, but rare moments arise when my soul yearns for solitude. While there's another Starbucks closer to me that's heavy on high-dollar baby strollers and people yakking into cell phones, I've found the 20 minute walk to the Starbucks on Portola to be a worthwhile effort when I feel the need to appease my inner hermit.  \n\nIt's decorative schema and music are straight out of the corporate cookbook.  Management-approved artwork hangs from earth-tone walls, while a large window combines with overhead track lighting to provide a varying degree of luminescence that gradually dims as one moves towards the rear of the establishment.  The place is BIG for a San Francisco Starbucks....big enough that I've never had a problem finding a seat here.  And from a customer-demographic standpoint, the crowd is typical of any Starbucks....no age group, ethnicity, or definition of hip seem to rule the roost.  Better yet, the customers at this location are largely sedate, solitary, and delightfully dull.  \n\nAnother reason to like this spot?  Fog.  Fog or light precipitation lends a bit of ambiance to the ideal coffee vibe.  And when fog rolls into San Francisco, the top of Portola is usually one of the first places to see it.  Other positive aspects include standard-issue wireless access along with laptop-friendly A/C outlets every 12 feet.\n\nBad points?  Myself and rocket-fuel went our separate ways many moons ago, and the decaf coffee at Starbucks seems to be abnormally high in residual caffeine.  The bathroom door is customer-accessible, but it's usually locked...and using it requires badgering the staff for a key.  It's out of the way location is a mixed blessing:  Though it hinders access, it also helps to keep the masses at bay.  Still, Forest Hill MUNI is only several blocks down Laguna Honda, and the 48 Quintara makes a stop 50 yards from the front door.\n\nIt's quiet.  It's solitary.  It doesn't host a horde of beautiful people or packs of social lions, but it doesn't attract screaming toddlers or exuberant teens either.  All in all, it's a pleasant trade off...one where human interaction is sacrificed for the sake of unhindered solitude.  Nothing about this location is either extraordinary or unpleasant, but it has it's place.  If you're looking to get away from society for several hours and you're willing to take a bus to do it, that familiar green sign at the top of Portola could be an option...", "author": "Mike W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "I don't go to this Starbucks often, but it is in fact the closest one to my house. The workers here are extremely friendly. They greeted me with a \"good morning\" and left me with a \"have a nice day!\" and not only that, but they were super energetic. The open lounge area is comfy and spacious. Although, at times it does get quite busy. Overall, this is one of the best Starbucks I've been to. I love it here!", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "Melancholic, perky, studious, inspired, nostalgic, relaxed, or lazy... Starbucks accommodates all my moods and is a great place for me to collect my thoughts and enjoy great coffee. \n\nThis is my favorite starbucks in the entire city. I don't know the baristas personally but every single one is super friendly.It's spacious with a fireplace and truly an asset to to the neighborhood. However watch out for the 3pm rush of weekdays when it turns into a daddy-day-care and a field a tots bumrush the place. (Since when do kids drink coffee anyway?)", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "Every time I come here they always remember me.  I wonder if I come here too often.  If anything I need coffee to stay awake from a long day at work and this is just the place to do it.  I can come in before work or during lunch; it doesn't matter since it hits the spot.  Some people don't like Starbucks because of it's enormous corporation, but hey this coffee works for me. \n\nI am not familiar with the names but I have almost always had good service and a small conversation with the staff every time I go.  I only order a couple different things off the menu so they usually know what to expect for me.  However, I did have this one bad experience at this Starbucks.  One day I came here I look around to see if any of the usual familiar baristas are there, but no one that I have recognized before.  As I order my coffee, I am charged $1.95 for a grande cup of coffee, which I expect.  The cashier is of course not paying attention and takes my money.  He gives me back $8.05...unbeknownst to him theres nothing wrong with that except for when I paid with a $20 dollar bill!  I am going to admit I do have quite a strong memory, so I strongly remember that it was a $20 since I had that bill in my wallet for quite some time.  I explain to the cashier that I gave him a $20 bill.  He responds, \"Let me check the receipt--it says you paid with a $10 bill.\"  I, however, do not back down from my statement that I gave him a twenty.  I told him to check the cameras and check his till.  He again replies, \"I don't have any twenties in my till.\"  I told him to look again, and therefore he explains only when another customer orders is when he can open the till.  \n\nAs I wait by the cashier to prove him wrong, the next person orders and the till opens.  There IS a $20 in the till and he absolutely does not want to believe me.  I cannot believe this guy tried to short change me, after the loyal customer I have been.  Eventually, he calls his manager over and he forks over the rest of my change.   This one time experience makes me think about how this happened in the first place.  That gentleman MUST have been new because I had never seen him there before then and I do visit frequently enough for the rest of the workers to remember me.  As for all the other workers, they deserve 5 stars, but this one cashier gets minus one.", "author": "B T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-14", "description": "Needing some caffeine comfort, I sat in a cafe off the Champs-Elysees in Paris and ordered a latte. The waiter gave me a quizzical eyebrow look and questioned \"latte\"? I nodded \"oui\". Frenchie then returned with a cup of tea. TEA??! I SAID LATTE!\r\n\r\nWHAT'S COOL about Starbucks, they never make that mistake and if you're ever homesick while traveling abroad, just step into Starbucks and BAM! It's like you never left your American city home. I like the Portola store because of the easy parking, choice between table or couch seating, and the cozy fireplace.\r\n\r\nWHAT'S UNCOOL about SBs:\r\n-When someone gets their drink before me, even though I ordered first\r\n-When they short me a couple of ounces on a 16 oz cup\r\n-When they ask for my name to write on the cup. I silently giggle and say \"Al Coohalic\"\r\n-The calories that accompany an ExtraHotGrandeCaramelMarchiato\r\n\r\nDid you know the Starbucks logo is a sea siren, a two-tailed mermaid whose songs would lure sea men to their deaths. Seductive siren = seductive drink.  Earlier versions of the logo displayed the nekkid mermaid in its entirety, navel revealed and two tails spread Penthouse style. Now that's a cup quote.", "author": "Teddy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-25", "description": "Apparently, this Starbucks isn't JUST my destination when I need an iced tea and I'm too lazy to brew/chill a batch myself.  It's also my polling place, so I'll be voting there, too.  \n\nOut of fear that they'll turn me away from the polls, I'm giving them a good review.  (Also, the people who work there are really nice, the drinks are always exactly what I wanted, and I've never waited longer than 60 seconds to get my order.)\n\nAlso, they'd get an extra star, but they got rid of their free wireless internet.  When they had it, my roommate would go down there so she could play World of Warcraft...but then she'd get really paranoid that everyone knew she was geeking it out in the corner.  Now she only plays at home or at work.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-05", "description": "Ok, I dont know how much you can say about ANY Starbucks, but I love this particular one because it offers FREE WIFI, w/o signing up for the TMobile crap. Altho I did not enjoy my orange mocha, I got some work done. Nice interior and a parking lot if you drive. But again this place is a SCORE for free internet! Just be hush hush about it people.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-05", "description": "I wouldn'tve stopped in were it not for the fact that I'd just eaten a plate full of greasy food at the Bashful Bull which didn't sit particularly well. \n\nNevertheless, the restroom was reasonably clean, & the guy in line behind me was kind of a jerk, so I took my time & left quickly (HOPE YOU ENJOYED IT, BUDDY). \n\nI've always wanted to insert allusions to pooping into a yelp review, & fittingly, Starbucks has given me that golden opportunity. If nothing else, corporate coffee shops are good for one thing: Me to poop in.\n\n[But really, nothing but love for this particular Starbucks, as without it, I might've been in some trouble]", "author": "Pete J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-06", "description": "This is my neighborhood Starbucks--the friendliest staff ever!  They had some turnover in Jan 2008, so I am not seeing the same faces anymore (boo, Chris, come back--it's not the same), but still just as good.\n\nIt has a funky smell, though.. not sure what it is, but the steam always makes the place smell moldy or something...", "author": "Steph M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-19", "description": "This is one of my preferred Starbucks locations because its very roomy (a San Francisco anomaly) and has a fireplace.  The service here is always quick and courteous.  The internet connection is predictably reliable.  \n\nThe hours stink, on weekdays they close at 8pm.  I bet if they were to stay open later, they'd have the business to justify it.", "author": "Matthew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-15", "description": "This is the only Starbucks I know of where more often than not,the coffe is consistent.The staff are extremely friendly,and it's not too busy.The time to avoid?Lunchtime when school is in and all the kids from the hideous high school across the road come in to ablitorate the place.\nThe bathroom is disgusting - so avoid it at all costs.Come to think of it, I have never been in a clean bathroom at any Starbucks, so the management need to work on this one.\nApart from that,this Starbucks is pretty good.", "author": "Monique H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-25", "description": "Nice, large location. I don't usually Yelp Starbucks anymore because what more can I say that I haven't already Yelped, and I'm just getting a regular ol coffee. However this visit was more notable than most because of the awesome service - the counter guy was really friendly and put a smile on my face.  So keep up the good work, twin peaks starbucks!", "author": "Jen D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-01", "description": "Ok, it's Starbucks.  It is what it is.  What's there to review?  Well I'll tell ya, the hot breakfast sandwiches.  I would seriously like to know whose idea this was.  What suit in a boardroom thought it would be a good idea to take a breakfast sandwich (that may have tasted pretty good in a test kitchen or at the point of preparation) and ship it to a zillion locations where they can nuke it for you to order?  The sandwich was VERY hot, with microwavey chewy-on-the-finish bread, tough eggs, and a little bit of redeeming cheese.  Yeah, yeah, but what really got me...  the bacon.  It's a very sad fate for bacon to end up on a Starbucks breakfast sandwich all pathetically limp and soggy.  It's hard for me to see bacon like this because, me and bacon, we're close.  And the final offense...a sticker on the breakfast sandwich bag that reads, \"Great coffee deserves great food.\"  Really Starbucks?  I just looked up great in the dictionary.  Hmm.  Well, shame on me for desiring something warm and delicious and believing I might get it at Starbucks.  I mean, my expectations were sufficiently low, but even so, I was totally disappointed.  \n\nOh, but no ill-feelings about the staff (friendly) or the ambience (Starbucks-y.)  I just don't believe the microwaved breakfasts do even Starbucks justice.", "author": "Jennifer K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-12", "description": "The idea of going to Starbucks doesn't sit well with me, but this particular Starbucks is very good.  The staff is friendly, and usually very fast.   I would give them 5 stars, but it's Starbucks and I just can't bring myself to do that.", "author": "Maggie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "came here early morning for a coffee fix while waiting for a friend. i ordered their upside down caramel macchiato with soy. workers here are friendly and charming. however reception for wifi at this location sucks.", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-09", "description": "Anyone who give me anything for free gets an automatic five stars, even if it's right before closing and they were going to throw it out anyway.  That's just good service!", "author": "Bodacious T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-31", "description": "5 stars because this Starbucks is fast, has great service and the fireplace is awesome. I now expect too much from any other Starbucks I go too!", "author": "Dee D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-04", "description": "This might be my favorite Starbucks, even though I've only been here twice...  the baristas are friendly, they make the drinks super-fast, there's a large selection of pastries, AND....  there's a f*-ing FIREPLACE here.  Which is good, because that is one foggy neighborhood.", "author": "Andi T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-29", "description": "bottom line fake coffee,.if you are getting an espresso drink you need to add tons of extra shots to even taste the coffee.  a coffee shop should be   first and fore most about the coffee.  this would have been my first one star review but luckily the service is great and the place is so confortable  and spotless.  add plus is the nice fireplace on a cold day.", "author": "brian l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-22", "description": "my favorite starbucks out of all the others because this one never gets overly crowded and the line is never too long", "author": "Anita L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-19", "description": "The outside is very deceiving because inside the place is huge and roomy.  The guy initially serving me seemed disinterested in what I was saying as I tried to figure out what I wanted. A real friendly bloke came from the back and saved me.  What I ordered was pretty good.  The only thing that I didn't like about the place was the smell.  It didn't smell like freshly brewed coffee but smelled like freshly brewed gym socks.  I had to quickly run out of there to prevent myself from gagging.  Oh well at least my frappacino was good.", "author": "Trinky V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-06", "description": "Truthfully, Starbucks is Starbucks.  But, this Starbucks has FANTASTIC customer service!  It's nice and roomy!  Plus, it's up the street from my house!  They rock!", "author": "Karla F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-25", "description": "Ok. This was a tough one. This is my \"neighborhood\" Starbucks and I go there quite often. It's relatively quiet, clean, has lots of seating, a fireplace, and clean bathrooms. If it wasn't for all of that it would only get 1 star and even as I write this I have my doubts about giving it 3 stars instead of 2. Main reason? The coffee drinks. Now if I'm paying almost $4 for a latte I expect it to properly made. They do a fine job with the espresso but they have absolutely no idea how to steam the milk. This has happened over and over and over again. I even tried to explain it to them but they got all pissed. The milk is supposed to be velvety and smooth. The foam is supposed to have small bubbles and the foam is supposed to last for the entire time it takes you to enjoy your drink. What you get instead is a thin watery drink. I even told them to make it just like Peet's does but they didn't get it ;-)", "author": "Pablo P."}
