{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Skill and artistry alone - I'm so awed.\nEveryone is an artist in his or her own right!\nI was blown away by a simple yet skillful and creative method of serving ice cream.", "author": "Leslie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "I've been here twice and I really want to like STEEP, but there's been something a bit off each time. Maybe I'm just ordering the wrong things?\n\nThe first time I got the strawberry pom creama with agar boba and 0% sugar. I'm used to getting 0% sugar with fruit teas because usually the fruit syrup is sweetened, but it was a huge mistake this time. The whole drink tasted watery and flavorless and the cream didn't mesh well with the strawberry. \n\nThe second time I got the mango coconut smoothie - also just weirdly flavored and not quite right. I feel like it would be hard to mess up mango chunks and coconut cream, but it didn't taste at all like I imagined.\n\nI'll probably come back to try the matcha drinks or rolled ice cream, but it's been a miss for me so far.", "author": "Katy Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-29", "description": "A rather disappointing experience here. I've had rolled ice cream before at other places and was looking forward to trying STEEP after seeing reviews, but I don't think it's worth coming here a second time.\n\nThe descriptions of the rolled ice creams all sound delicious and I had a hard time choosing which one to try. I ended up picking the Coffee Meets Waffle: Andytown Roaster coffee mixed with waffle and coffee beans, topped with house whip and coffee beans - sounds delicious right? Sadly, the ice cream itself was quite icy and flavorless, with barely any hint of coffee. I forced myself to finish it because it was $7+, but the only part I really liked was the housemade whipped cream. \n\nI tried a bit of the Salted Caramel Pretzel as well and it was a bit better than the Coffee Meets Waffle - or at least, it had some salted caramel pretzel flavor.\n\nFree toppings is a nice gesture. I got almond flakes and fresh fruits, which they put on the side in a little cup so that it wouldn't fall off the ice cream. (The fruits were not very ripe or sweet either though.)\n\nMy sister also got the passion fruit aloe tea, which was supposed to come with passionfruit seeds; however, there were clearly no passionfruit seeds in her drink, and when she asked the staff working behind the counter, they said there weren't supposed to be any. Why list the passionfruit seeds on the menu then? Also just a warning that this drink is extremely sweet and they said they could not adjust the sweetness for it, so we ended up mixing in a ton of water to dilute it.", "author": "Ivonnie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Best rolled ice cream in SF! \n\nI love watching them make each order, and the menu is constantly updated. The last time I was there, some flavors included Mocha JavaScript and C++ Dutch Chocolate, I kid you not. Welcome to SF!!\n\nAnyways, I love all of their matcha options and also the Original Oolong, which I got with grass jelly and matcha boba (they were out of regular boba.) my friend got Matchapolis which was matcha and sesame rolled ice cream with strawberries and matcha boba. They get so creative! \n\nUsing Straus Creamery (the milk Boba Guys uses) makes the rolled ice cream smooth, creamy, and rich. \n\nThe decor is very cute and they know you may be going there for the 'gram--there's cute quotes on the walls, plants, and a box to put your rolled ice cream for a picture! \n\nFriendly, helpful service. I do need to try the boba there but it's so tough when their rolled ice cream is so good! I always go when I visit GitHub but Steep is also right near the ballpark soooo", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "3.5/5 Overall\nI come here waaay too often since it's the closest boba place to my work. I like their fruit drinks since they use real fruit (fyi the sugar level for the fruit teas is actually the amount of fruit purée they put into the drink, not actual sugar). Go-tos are the Tangerine Kumquat Tea and Strawberry Pom Tea with agar boba. Their milk teas are a little too watery for me so I would stick with their fruit teas. The boba is usually just okay (sometimes it's too hard or not sweetened well) but they don't charge extra for agar boba so that makes up for it. A normal drink comes out to about $5.5 with a topping. I would go to Asha over Steep if it were closer since their teas are better, but convenience usually tends to win out.\n\nI don't normally come here for their rolled ice cream, but my favorite would have to be the oolong one!", "author": "Alice C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-14", "description": "I got the jasmine green milk tea and the actual tea was super watery and tasteless. The boba was decent but I was overall disappointed by the tea. I heard their fruity drinks are better here. The size of the drink is pretty big so it's a decent deal!", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "I went and tried the boba it was my first time having it so I asked the guy working there what the most popular one was. He was really helpful and recommended the oolong. He asked me how much I like sweetness like how do I drink my coffee. I told him I have a sweet tooth so he used a mid to high sweet level. It was really weird at first with the tapioca bubbles but the flavor was good and the bubbles grew on me. I think I'd try another flavor next time.", "author": "Alex J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "My thoughts on rolled ice cream is that it is overhyped/ overrated, but I liked STEEP's rolled ice cream! Prices for rolled ice cream are not too bad/ the norm. I like how they use Straus Creamery in the ice cream. :D\n\nI got the matchapolis (sesame and matcha rolled ice cream, topped with strawberry and matcha boba), which was a nice treat. I was mildly amused with the two flavors rolled together. I didn't like the matcha boba- it was super weird, but everything else was good. Not super sweet, and I would come back if I lived in the area!\n\nThe drinks are also worth getting.  My roommates got the Legendary Matcha Milk Tea and Vietnamese Coffee with boba, which were both fantastic.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "This business can be creative with the rolled ice cream but the service needs to be improved a lot!!! Service is super slow despite the place is not busy at all!!\nLots of people coming here are working professionals including myself and I can't afford to keep waiting here for a glass of bubble tea!!! WTH?!!!\nThe 'add ons' is super stingy as well!!! I added the red bean and herbal jelly into my tea and I keep struggling trying to dig into the bean and the jelly!\nCan't you guys be reasonable in terms of the 'add ons' portion?? Your price is not even cheaper than any other bubble tea stores out there!\nThe only positive things about this place is that it is clean and cool.\nBut again, the wait is ridiculous!", "author": "Irene X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-05", "description": "They do rolled ice cream desserts here with fresh fruit toppings, really good but a bit pricey ($6.50). I ordered the matcha black sesame latte ($5) and wasn't a fan of it. I normally like black sesame but it needs to be paired with something creamy otherwise the gritty texture just tickles your throat...the soy milk wasn't cutting it, I liked the idea of it but it made the drink taste bland and gave it a watered down consistency. So I went back and exchanged it for a different drink using regular milk (they were kind enough to do this free of charge), but the earl grey tea flavor still wasn't very pronounced. I was bummed bc I really love earl grey things. Go for their desserts, pass on the drinks.", "author": "Cammy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-06", "description": "Cute little stop in San Francisco with a nice vibe and good staff. The wait was a little long for us, we know that rolled ice cream takes time but it took about 20 minutes with two girls working (there were 5 guests ordering at the same time). Honestly if the ice cream was out of this world I wouldn't mind the wait, but it was kind of just normal ice cream in a fun shape. We tried the matcha and the C++ cocoa. Both were good but maybe not a 20-minute-wait-kind-of-good. \n\nMight be a fun date stop where the conversation is more important :).", "author": "Lori M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Steep is a workday essential where I work! It's about a 2 block walk from our office, and we love it.\n\nThey have lots of options here for ice cream rolls. I think my favorite is probably the Thai tea or the strawberry shortcake. I also think it's cute that they name some of their ice cream rolls after software engineering things like C++ or mocha JavaScript. They definitely know their area well! \n\nThey also have tooooons of tea here, so if that's your thing, or you're like me and you love both tea and ice cream, there are plenty of boba options. I really love the lavender earl grey, but you really can't go wrong. They also seem to have a lot of matcha things, but I'm not a matcha connoisseur, so I'm not sure how good they are. \n\nIt's also a pretty small place, but I think you could manage to get some work done if you really had to. To be honest, I don't come to Steep to work so it doesn't bother me, but if you're looking for a place to land for the day to do some serious work, this probably isn't a good place for that.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-06", "description": "So I'm torn. Their Earl grey lavender boba has great flavor and they can sub out milk for dairy free options... But their boba was not fresh at all... Like hard in the center.\n\nGuess I'll have to try again and see if it was a fluke... Stay tuned.", "author": "Mandi W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Pumpkin Pie ice cream that is better than Grandma's pie?!?!? Absolutely cheered me up and made my day.  $10.00 with tip... Totally worth it!!", "author": "barbara e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "This place is tucked away between business and condo buildings. Their ice cream combinations are unique and all sound so appealing it was hard to choose. They also sell boba tea and different types of boba! If you're a matcha fan, this place is heaven. Almost everything on the menu contains matcha! Again, just like the ice cream, it was hard to choose from the milk teas. \nThe ice cream was rolled and softer than others I've had but the flavor was all there. The salted caramel pretzel was the perfect balance of salty and sweet. The matcha boba tea was okay mainly because i only got 50% sweetness so it tasted like unsweetened tea. ‍ I'd come back and just get regular boba tea, with all the sweeetness and things. \n\nDon't pass this one up especially if you like matcha.", "author": "Jenna T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-10", "description": "This is my neighborhood boba tea/icecream roll spot. Been here several time and they have a great assortment of flavors to choose from! So far I have tried thai iced tea, pure black and oolong with and without boba and its delicious! They can alter the sweetness level for you if you like.\n\nThe matcha latte is also pne of my personal favorite if I am in a mood for something warm.\n\nThey ice cream flavors are very unique and stand out every time! My favorite is matcha with sesame but this time I tired the C++ dutch chocolate with cocoa bits cream and FREE cheesecake topping. Delicious! \n\nHighly recommend for your boba/ice cream fix!", "author": "Nidhi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "I visited STEEP for the rolled ice cream and it is definitely worth the visit! We tried the green tea and cookies and cream flavors. They were both delicious, but I definitely want to return for many of the other flavors!\nNot only was the ice cream delicious, but the service was great. The closing time had changed and was incorrect on Google. We arrived as they were closing and had already turned off the devices the ice cream is rolled on. They were kind enough to stay late an turn the devices back on in order to serve us.", "author": "Emitom H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "Rolled ice cream is pretty cool, but the storefront itself is a very small space.  There's cute mini photo set ups, ready for your instagram posts. \n\nICE CREAM\nMy Thai\nUji Matcha- no strawberries\nCoconut cream- berries on the side; so far this has been my favorite.  Vegan ice cream FTW\n\nThey close pretty early on weekdays, just like the rest of SOMA...but it's nice to know you can order online for pick up.  I really want to try the boba and smoothies, but I've only been here for the ice cream.", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Steep is located in SoMa and offers delicious drinks and ice cream rolls. Loved their ice cream rolls - so creamy and not overpoweringly sweet! I haven't seen mixed rolls before so had to try both the matcha polis (matcha + sesame) and matcha politan (matcha + strawberry) both topped with regular boba and strawberry. \nAlso tried their earl grey lavender and it had a great balance of both flavors. Friend tried the strawberry matcha lemonade and said it was really good as well.", "author": "Vicky R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "When I first saw a photo of their rolled up ice cream, I had to come! The rolled ice cream trend looks so pretty, but it doesn't taste that great. I like the toppings on top, but the ice cream is the part that I wouldn't recommend. It's possible that I just haven't found the one that I like yet. I recommend getting their boba instead. I like that they open late and that the location is convenient for me.", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-07", "description": "With this summer heat, rolled ice cream is the perfect way to beat the heat!\nI got the my Thai with mochi on top - so yummy and definitely hit the spot. \nMy little brother also seemed to really like the cookie crush flavor.\nThe staff was nice and quick to tend to customers,\nkeep up the good work!\nWould definitely recommend if you're in the area or just craving some rolled ice cream. :)", "author": "Gabby O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-06", "description": "As a founding member of ice creamaholics anonymous, I gotta keep up my addiction to remain in the club. What other reason would I have to visit STEEP 3 times in 1.5 weeks? ;)\n\nBoba: I got the matcha latte and it was probably a 3.25 / 5. The middle of the boba was somewhat hard, but at least they were slightly sweetened. The latte itself was very milky, but could have used some more matcha flavor (sorry I compare everything to Asha's deep green beauties).\n\nIce cream rolls are cool to look at, but I'm not actually sure they're all that tasty. I've tried the thai tea, oolong, and matcha rolls. The thai tea was true to taste and fairly strong in flavor at that. The oolong was interesting too, but could have used some more flavor. The matcha was less strong in flavor. They tend to crumble if you eat them too soon after they're made, but if you leave them out for too long they melt fairly quickly. The texture doesn't work for me since I like ice cream to be creamy and airy. Given that there aren't any air pockets in these, it's more like eating frozen cream. 3.25 / 5.\n\nGreat for an Instagram photo (they even have a little photo booth especially for this purpose)!", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "I have been there several times and tried different drinks and rolled ice cream. You can't go wrong with any of these flavors.\n\nFor the tea, my personal favorite is oblong milk tea with 50% sugar. Oblong tea have stronger aroma than other green or black tea options, which makes the milk tea more enjoyable.\n\nThe best thing here is the rolled ice cream. I literally loved all the flavors and toppings. I do hope they offered a smaller cup options so I can be there more often feeling lguilty about all those calories", "author": "Wenjing Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "A nice treat! The bit of a wait to roll the ice cream is worth it! Staff is friendly and informative. Our favorites are Thai ice cream and Java chocolate. Street parking not a problem if you go on the right day- meaning no events.", "author": "Jodie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "Amazing matcha lattes (50% sweet) with quality matcha powder you can taste! Will definitely be back soon. \n\nPros\n- Strauss milk for ice cream roll ups\n- interesting ice cream flavors like for four barrel coffee and black milk tea with a shot of matcha \n- alternative dairy like Califia Almond milk\n- interesting toppings including egg pudding \n- great friendly service, no lines \n- easy parking on weekends \n- clean, modern cute location\n\nCons\n- minimal seating, cramped space \n- jasmine milk tea tasted watery \n- boba balls not sweet or chewy enough", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Well, my rolled ice cream cherry has finally been popped and I'm glad STEEP ceremoniously did the honors. \n\nWhile visiting friends in SF, we found ourselves in a bit of a dessert dilemma -- some wanted boba, while others wanted ice cream. At Steep, you can have both your dreams come true AND document it in style... No need to look for that artsy perfect backdrop either, they have their own mini foodie photo-shoot setup! \n\nAnyway, I was on team ice cream that day, so here are some verdicts:\n\nUJI MATCHA: This was what I chose because I love green tea errthang. It comes with strawberry and red bean toppings. For me, it was a strange experience because it felt like I should be sipping what I was eating. It was a little too rich, so I didn't finish it all. The strawberries were a great complement, but I wasn't a fan of the red bean. \n\nORIGINAL OOLONG: My friend's pick. It comes with herbal jelly and boba. I actually liked hers better than mine. The tea flavor was strong but not overpowering, and boba is always a good idea! Tasted refreshing. \n\nCOOKIE CRUSH: My bf's choice, and probably my favorite of the three we ordered. It's a cookies&cream ice cream, with cookie whip, cookie crumbs, and an Oreo. It sounds like a cookie overload, but it was the perfect blend. Not too heavy.\n\nOne of our friends had the JASMINE GREEN MILK TEA, but it wasn't a community thing, so I can't say much about it...\n\nSIDE NOTE: There are additional toppings you can add for FREE! If I had known this, I would have been all over that mochi and condensed milk! They also have various fresh fruits, cheesecake bits, dark choco shavings, almond flakes, and organic granola.", "author": "Kat B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "This is probably the only tapioca shop who has gotten my less boba and extra ice on point in the first try haha so gotta give credit when credit is due\n\nI was ecstatic to find any shop that has lavender anything so it was a must stop for me if I ever stumbled upon the area.\n\nI ordered the earl gray lavender milk tea. the lavender flavor is very strong, so strong the drink did end up tasting like soap lol cup is 24oz - only one size I believe and right around $5.xx range\n\nI'd love to come back and try more of their other drinks if I'm in the area again. they also offer rolled ice cream if you want to try that!", "author": "Yeanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "What is not to love, boba in SOMA, ice cream made to order.\n\nMy favorite is their roasted oolong tea, boba, red bean and 25% sweet is all you need", "author": "Tony T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Best icicle dessert!! Dont mix this place up with the other Steep near by which doesnt have the icicles. I made that mistake and took my team on a field trip across SOMA. Both locations have milk tea, but only one has ice cream and the other has acai bowls. They have the same name and owner, but could be confusing because some people incorrectly added these photos to the other STEEP location. \n\nI had the cookies and cream icicle ice cream. The toppings are unlimited and to your choosing. I topped mine with fresh fruit (strawberry, blueberry, and watermelon), boba, condensed milk, cheesecake bites and mochi. Absolutely wonderful! \n\nPlan to eat there because it melts quickly. They have many flavors to choose from (see menu picture I attached). Not sure if you can mix and match but that would be cool! \n\nIts a far walk, but I guess I need to work off those calories anyways right? Will definitely be back again soon!", "author": "Claire W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "This is my new favorite place in town. The black sesame seed rolled ice cream is THE BEST. Great texture, temperature and taste. TTT\n\nYou can add unlimited toppings to it, so I always get it with additional mochi, cheese cake bits, and fruits. I'd highly recommend. I've tried the green tea one too, but not as good. I have committed to black sesame seed until I get my 10 stamps. The staff is always friendly there and there is even a little instagram station for you to take some hipster photos and @steep. Tried it for the gram, but not a big hit. The succulents were competing for visual attention.\n\nThe space is not too big, but I've never had an issue getting a seat. I can't wait to be back! Don't go to the other one that's like .3 miles away. It is not nearly as good.", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Delicious ice cream that is not too sweet. I also had a classic boba tea that was good. I really liked the green tea strawberry combo, and my co-worker had the chocolate one that was sweeter. It had this great chocolate mousse that came with it. One downside was that the service was really slow. It took us about 30 minutes to get what we ordered and there were only two or three orders ahead of us. Not a lot of seats at the place either.", "author": "Xi-Er D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Aesthetics & Hipster Boba Place? Checked.\nInstagram-worthy picture? Checked.\nColorful drinks & Rolled Ice cream? Checked.\nGood show of workers rolling the Ice cream? Checked.\nSitting room & Chill area? Checked.\n\nI was in Soma neighborhood to pick up my friend up from Cal-train Station and I suggested to get some boba around the area. I always wanted to try this place and bam! here I am and it was only couple blocks away. We got there around 3pm when there was no line and plenty of sitting area. I ordered Strawberry Matcha Lemonade (4/5 ratings) and it was really pretty with triple layers of color. I loved the aesthetic-ness and picture-worthy of the cup. The drink itself was good, but I wasn't extremely satisfied with the drink. It came out a little sour to drink and kind of heavy on the bitterness of the matcha.\n\n They have a mini photo booth backdrop that lets you take pictures of your drinks with good lighting. We were chilling for a bit and all the sudden the line got longer. So it does get a little crowded in Steep. Next time, I might try the rolled ice cream!", "author": "Judy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "My friend and I got here 15 minutes before closing and were met with amazing service. The staff is cheerful and welcoming, and didn't mind that we stayed a bit after closing.\n\nWe ordered the strawberry cheesecake rolled ice cream, and added some extra topping with no additional cost! The ice cream itself was creamy and flavorful, and we could taste the freshness of the strawberries.\n\nGreat food and atmosphere! Definitely worth the price.", "author": "Lilith H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "I've been to STEEP twice now and I'd say they have some of the best prepared teas (boba or not) in SF. \n\nYesterday I tried the Chrysanthemum Tea with Honey recommended by the owner, and it was amazing! The fragrance of chrysanthemums was fully extracted but not overpowering. (It can get bitter if you over-extract.) The amount of Honey was on point.\n\nThe quality of their tapioca is consistently good, which can't be taken for granted because a lot of boba shops are either sloppy or too cheap to cook them fresh. I always give shops who do it right bonus points.\n\nI haven't tried the ice cream rolls yet. Guess that's what I'll get next time!", "author": "Joseph L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "I LOVE ice cream and this place makes the rolled up ice cream pretty well. It was my first time trying the rolled ice cream. I ordered the oreo one with mochi and fruit. It is so cool that we get to watch the process of them making the ice rolls. Rolled up ice cream is definitely not as creamy as regular ice cream, but it was still a cool experience. I believe the price was only $6 for this with unlimited toppings, which is not too bad for ice cream in SF. \n\nAlso, this place has a booth set up for you to take your photos for Instagram, which is a pretty smart idea. I heard about this place on Instagram because of this booth. I'm glad I saw this and tried the rolled up ice cream here. I think it's definitely made well and worth it.", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "I gave STEEP's ice cream rolls another try and wow, what an improvement. They now have several ice cream machines and the staff seems to have gotten the hang of making these rolls. \n\nI like the calming decor of the shop and the variety of flavor combinations. We shared an order of one of their specials - Hokkaido milk tea ice cream rolls with clear boba and cheesecake bites. I also asked them to top it off with fresh blueberries and strawberries. I was very impressed.\n\nI'm so glad STEEP is only a few blocks from the office. It's perfect for an afternoon snack break.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Solid dessert spot for trendy rolled ice cream and milk tea. Steep uses quality tea and ceremonial grade matcha for their ice cream! Also a great spot for Instagram worthy photo ops.\n\nI came to try the matcha rolled ice cream and it definitely impressed. The technique used to prepare the desserts is pretty novel and it's a fun place to get something sweet. I'm not huge on desserts but this place is pretty special. You get free toppings too! Fresh fruits, mochi, cheesecake bits, dark chocolate shavings, almond flakes, organic granola and condensed milk at your disposal.\n\nThere's a station to order and then a viewing area to see people making the ice cream. They have lots of flavors: Thai tea, oolong, cold brew, coconut, earl gray, cookies & cream, cheesecake, black sesame, Dutch chocolate and mango.\n\nUjimatcha - Ceremonial matcha ice cream w/strawberry & red bean. Exceeded expectations! The matcha is no joke here. It tasted like pure matcha flavor and not like the usual ice creams that are more daisy based. We enjoyed it with mochi.\n\nEarl Gray Lavender Milk Tea - So happy to see that they offer non caffeinated drinks here! I got it with almond milk and 0% sweetness. The flavor was great and exactly what I expected.\n\nLove the concept and I don't mind paying around $7 for a koala tea dessert.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "OMG! I totally loved mine! The rolls were so tight that it didn't melt right away like some do. And the flavor of thai tea really came thru. I wish there was one in the East Bay! My only gripe is location as it's tough to find parking and it's all metered by the ballpark which means $$$$$.", "author": "Carolyn S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "I've heard about the rolled ice cream phenomenon and was anxious to try it.  There is no place near my work or home that does it, but thankfully, Steep is close to AT&T Park.  On a Sunday, my wife & I strolled in around noon before a 1:00 PM Giants game.  The place wasn't too busy, and everyone in front of us ordered boba or coffee.  \n\nAfter looking at the menu on the wall, I selected the My Thai while my wife chose the Silky Sesame.  After ordering, we waited on the side, where the server made the ice cream in front of us.  He poured the liquid mix onto a slab of really cold metal (probably cooled with liquid nitrogen from below the counter).  As the liquid started to solidify, he used two spatulas to shape and form the ice cream.  Once the ice cream gets to the correct temperature and consistency, he shaped it into a very thin square sheet, then used one of the spatulas to scrap the bottom, rolling the ice cream into its signature shape.  The rolls are placed in a bowl, then garnished with the toppings.  \n\nThis process took about 5 minutes, and the staff can only roll 3 orders of ice cream at a time, so be prepared to wait a bit if it's busy.  I asked him how long it took to learn how to do this, and he said \"way too long!\"  I guess I won't be trying this at home anytime soon.\n\nThe My Thai has Thai tea ice cream, garnished with boba and coconut pudding.  The Silky Sesame has black sesame ice cream with agar boba and fresh fruit.  One good thing about Asian-style ice creams is that they are not overly sweet.  The coconut pudding and fruit, respectively, offer some extra sweetness, but we never felt we were drowning in sugar.  The My Thai was sweeter than the black sesame, but both were very delicious.  The ice cream also had a dense consistency from the freezing and rolling process.  \n\nYou can also get additional toppings on the ice cream at no additional charge, but the flavors we got were perfect.  And we got orange and black ice cream for the Giants, too!  We plan to make this a regular stop for Giants games in the future!", "author": "Jeffrey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Yay! Finally, ice cream rolls are in SF and within 10 mins walking distance from my boyfriend's place - love it! \n\nFor $6, you get a (small) bowl of ice cream rolls (usually 4 - 5 rolls), with a generous amount of FREE toppings. My favorites are the cheesecake + mochi + boba. I think one bowl for two people is perfect. \n\nI absolutely loved the black sesame one, and I can't wait to try matcha & pistachio. I will be back :) and try everything on the menu.\n\nP.S. kinda cute (or weird...) that Steep set up an area for your ice cream to be photographed (see my pic) with perfect lighting and cute props.", "author": "Dana Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Really good way to present ice cream! Rolled and not scooped. Foodies would luv the free toppings. \nYummy teas of various kinds, both sweet and natural. \nGo and enjoy.", "author": "Albert T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "I was told about this place by one of my co-workers and as I need a break from the office (and it was only a 10 min walk) we stopped by for some boba. \n\nSince I work on 2nd street, the walk was nice as it was sunny and downhill, but the store front is a little hard to find, as it blends with the surrounding companies in the area. I did find the inside nice looking and wish I could try the rolled iced cream, but as I am lactose intolerance, I could not (maybe they will do coconut milk ones soon).\n\nI ordered a JUST TEA: Jasmine with boba, soy milk, 50% sweet and iced. Overall, it was tasty, but there were certain things that can be improved upon as I grew up in SF, and there are A LOT of boba places. The boba was nice, but few a little more chewy than more and had a off sweet after taste. The tea was nice, but with the soy milk, it was not as milky as it could have been like the non dairy boba's from Sharetea.\n\nWould try them again, but maybe just the tea without boba and milk, as with all that stuff, my boba was over $5.", "author": "Mei L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Rolled ice cream is the new hip thing! Been here twice and both items I've tried has been very flavorful. I love their options of rolled ice cream. They also offer boba drinks, but I haven't tried it yet. \n\nThe first time I came I tried the Oolong one which is still my favorite! Love that it comes with the herbal jelly and boba. \n\nToday, I tried the myThai which comes with coconut pudding and boba. This one has good flavor, but I personally still prefer the oolong. \n\nI would definitely come back to try their other flavors (esp. the coffee one and the black sesame one).", "author": "Karen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Recently, I've been really into ice cream.  It's the perfect dessert after every meal and since the sun has blessed us with its presence lately, it's a great treat to cool the body down.  STEEP has been making a big name for themselves with their refreshing drinks and now, with the new ice cream roll up craze, STEEP has mastered this dessert as well.  \n\nMyThai - the roll ups had a nice texture and the thai tea flavor was noteable.  The coconut pudding complemented the thai tea.  The boba was a tad undercooked\n\nFriendly service", "author": "Linda N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-24", "description": "I ordered the \"legendary matcha milk tea\" with boba, which was $5.50, but sadly, the matcha tasted very powdery and weak. Other places offer matcha milk tea that has a much stronger matcha flavor and where the matcha is also much better mixed. Honestly, I wouldn't recommend the matcha tea/milk tea here.\n\nI also saw several people order the ice cream rolls, which looked cool, but for $6, was a terribly small portion size (the recent bowl looks even smaller than the ones I've seen in pictures). I thought other places were expensive, but the bowl here was tiny and there were hardly any toppings (other places allow unlimited toppings). Caveat: I didn't order it myself, so I cannot speak to the taste.\n\nThey have a few small tables, a few benches both inside and outside, and one gender-neutral bathroom. They are located in a small suite in the Splunk building (the main entrance is just next door). Staff was generally friendly, but seemed a bit impatient with us when trying to figure out what to order. After 5pm, it got super crowded, so expect to take it to-go or need to sit on the benches outside. \n\nAll in all, okay boba and dessert place, but it wouldn't be my go-to. Prices seem kind of steep for the quality you get and the matcha did not stand out to me.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "Welcome to SOMA! Apparently roll ice cream is now the \"thing\". I had them in NYC and cities around the bay and I think Steep is pretty good. Better than most places in the bayarea but not as good as NYC. I wish they have more flavors. I got the oolong milk tea, my favorite milk tea drink ever. The ice cream was very smooth and rich. $6 dollars, comes with toppings and don't forget to add fruits, no extra cost. Small but I think its the perfect size. They also serve boba drinks as well. I would need to try that next time. The store is bright, clean and service was nice. \n\nAlso, they have a instagram set up for those who wants that perfect pictures.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Novelty of rolled ice cream is cool and they have funny flavor names. Line can get long even on Sunday afternoons in a particularly dead part of soma. The bowls deteriorate pretty quickly though so there's that. Presentation was overall nice and seating inside was limited but most ice cream places are like that.\n\nEDIT - plus, FREE UNLIMITED TOPPINGS!! go ham.", "author": "RachEl L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-07", "description": "Alright, this place is really closer to a 3/5 if we're just rating the quality of the boba drinks themselves. I've had better, and in the bay, you have a lot of options.\nBut this place is close to work, quite decent, and the staff is always super friendly and they get your drinks out quickly.\n\nI've never had a *bad* drink here -- nothing has really wowed me, but I'm pretty happy coming here when the boba cravings hit.\n\nAs always, 100% sweetness is probably a little too much; I go with 25-50% but I've found that it's not entirely consistent between drinks. I usually stick to the fruit teas, and I'd have to say the mango is one of the best!\n\nThey also have rolled ice cream here, which I still need to try!", "author": "Gautam G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "Nothing beats ice cream on a warm/hot day, especially when the ice cream doesn't melt right away! Came here with a friend on Saturday afternoon at 4pm. There were about five people who ordered before us and we had just beat the mad rush. \n\nChoices of different flavored ice cream rolls and drinks. We both got the ujimatcha that came with red bean and strawberries. We asked nicely for mochi (yep, there is a sign that says free topping, please ask nicely). The matcha ice cream was flavorful and coooold. A bit hard in texture but I didn't mind it since the ice cream doesn't melt as fast. Red bean was sweet, a good balance to the cold. Mochi was good. Strawberries were cut a bit thin, but I'm ok with that. All presented nicely in a cup- IG worthy. :)\n\nService\nThere were three people preparing the orders, two of them making the ice cream rolls and one adding the toppings. Yes, it took some time to get our order, but the air conditioning was strong. \n\nOther\nThere is a cute instagram set up with lighting for anyone who wants to use it to take photos- cute idea. Parking was not difficult as long as you're willing to walk a block or two. Additional flavors (not on menu) of ice cream rolls such as sesame, ube, etc available posted on the bottom of the menu.", "author": "Iris H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Rolled ice cream!  I tried the My Thai with coconut jello, boba and I added mochi balls.  Additional add-ins are free!  To be honest, this is my first time trying rolled ice cream, so I have nothing to compare it to, but this ice cream was delicious!  \n\nThey also have various teas and milk tea that I didn't try but look good too.  \n\nThis place is clean, with a few tables to sit at and benches out in front.  They were not very crowded when I went, so I didn't have to wait very long.  I assume if it's crowded it will take awhile for the ice cream as the process takes some time while they wait for it to harden.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "It took me a year to visit Steep in spite it being down the street from my house.  \n\nI think it was just a little too hipster looking for me.  Finally went down to try it with a friend, and the quality was about what I expected.  I got the roasted oolong milk tea and added crema.  Though my drink had the addition of both milk and cream, I couldn't really taste either.  There was too much water in the tea, and it just seemed to dilute everything (the taste of the tea, milk, and cream).  It was all right, but for $5 I would want something a little more refined.  The crema itself was also not very rich and could have used more salt.\n\nTips and Tricks\n-Okay this is a weird one, but that strip of Brannan is frequented by dog walkers so watch out for poop!\n-Rolled ice cream offerings were extensive, and there are plenty of things you can add into your mix\n-They have a light box set up so you can get that perfect Instagram shot!", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Pretty good but very tiny storefront. So if you have more than 2 people then I would suggest you plan to grab n go.\n\nTheir mocha ice cream rolls were pretty tasty. I substituted the jelly for coconut pudding which was a good choice.\n\nThere's about 5 tables available but really small ones so I don't recommend this place if you plan to do some work on your laptop. \n\nThis location is slightly different from thw other one close by. This is the one that offers ice cream rolls, not acai bowls/cups. The main way to know is that this location says Creamery in the title but the other one doesn't.\n\nThe quality is there so I will be back again to try more items. I'm curious about their mango mousse.", "author": "Laura Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Want some dessert? COME HERE! Both ice cream & bubble tea are worth it!\n\nRolled ice cream - not just a fad but actually really delicious & I love the denser, harder texture! (Steep Creamery is also much better than NY's 10 Below, much better flavors!) \n\nWe ordered the Coffee Meets Waffle with the FREE toppings of mochi and fresh fruits. The first bite, we were thinking \"oh it's pretty normal...\" but the more you eat, the better it gets! The ice cream is so cold that it doesn't melt too fast which is awesome. \n\nI really appreciate that the ice cream and toppings here are not too sweet and are all natural ingredients. I also like that there are unique flavors such as oolong and black sesame! Can't wait to try all the different flavors.\n\nBubble Tea - we ordered the Jasmine Green Milk Tea with Boba and the tea isn't too sweet at 75% sugar. There could be more boba but not complaining too much since the boba is perfectly chewy.\n\nCan't wait to come back!", "author": "Rohenne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "**3.5 stars**\n\nI came here primarily because I wanted to try their oolong ice cream rolls! It comes with boba and herbal jelly, but there are additional toppings that you can ask them to put on your ice cream, for free. At $6 a cup, there's only 5 (sometimes 4 and a half) rolls of ice cream. It's less than what other ice cream roll shops give you, but they don't skimp on the toppings. I had way more toppings than ice cream and I found myself eating boba and mochi long after I finished my ice cream. I could taste the oolong flavor in the ice cream but it didn't really 'wow' me. My boyfriend got the cookie crush flavor which came with whipped cream and an oreo. He forgot to ask for more toppings so his was a bit boring, lol.\n\nIt's a bit pricy and the ice cream wasn't as good as Icicles, but I really liked how they have \"Asian\" style toppings like boba, jellies/pudding, and mochi. The shop is small so there isn't any table seating, but there are chairs on the side to sit while you wait for your ice cream. I also thought it was super cute how they had a little table set up for a mini photoshoot for your ice cream, complete with a backdrop and lighting! Overall, it's a decent place for ice cream rolls and I probably would come back if I'm around the area to try their MyThai and Uji Matcha flavors.", "author": "Cecille W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "My first rolled ice cream experience. Surprise surprise.. it tastes just like regular ice cream with an added mesmerizing, insta-worthy factor. Fresh ingredients and good amount toppings. Probably better described as the asian version of cold stone ice cream\n\nThe drinks were good, not amazing. Couldn't really taste any sweetness in the matcha latte at 50%. I was confused by all the type of matcha drinks, so here's the breakdown. Old fashioned matcha = matcha, water. Matcha latte = matcha, milk. Matcha milk tea = matcha, milk, tea\n\nEntrance is a little hidden so just look for the long line (located next to Splunk Inc). I can only imagine how long it would take to get ice cream here in the summer since each order takes about 2-4 minutes to make.", "author": "Betty C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "Just half a block away from where I live, this place can be dangerous. \n\nI got the silky sesame ice cream roll and it was extremely sesame-y!!! Most of the time, when you order matcha or sesame flavored ice cream, it usually tastes diluted or not intense enough for my taste but this place does a really good job on making sure the flavors are strong. \n\nWill definitely be coming back to this place a lot!", "author": "Mai W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Loved the rolled ice cream here! This was only my second time trying rolled ice cream, but the rolls here were much better than the ones I had the first time around.\n\nSTEEP offers ice cream rolls in 5 different flavors. Each cup is $6 and is made with Straus milk and raw sugar. The flavors are as follows:\n\nMyThai - Thai tea ice cream topped with boba and housemade coconut pudding\nUjimatcha - matcha ice cream topped with fresh strawberry and reb mean\nOriginal oolong - organic oolong tea ice cream topped with boba and housemade herbal jelly\nCookie crush - crushed chocolate cookie ice cream topped with housemade cookie and whipped cream\nCereal Coder - mystery cereal ice cream topped with cereal and crushed waffle cone\n\nIn addition to the toppings that come with each flavor, they also offer free toppings of: fresh fruits, mochi, cheesecake bits, and dark chocolate shavings.\n\nMy friend and I split the oolong, which despite my initial reservations about the herbal jelly, ended up being really good. The jelly is almost flavorless, and eating it with a spoonful of the ice cream was nice as it provided a smooth contrast (texture-wise) to the ice cream in my mouth. \n\nThe ice cream itself was creamy and had the texture of normal ice cream instead of the brittle ice cream rolls I had previously experienced. They advertise their ice cream as being made from high quality ingredients and you can definitely tell as you're eating it.\n\nYou have to be patient waiting for your ice cream order, though. Because they are handmaking each rolled ice cream to order, it can take a while for your order to be ready. We probably waited a good 20 minutes if not more for our order.\n\nParking in the area is fairly easy on the weekend; there were multiple open spots along the street when we went on a Sunday afternoon. They were metered but I didn't have to pay because it was Sunday.", "author": "Dianna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "I was just talking to my husband about how amazing these \"stir fried\" yogurt was on the street of Philippines the other day, then I found this spot. Instead of yogurt, they use ice cream liquid batter. \n\nThe wait is really long because this is legit small batch, hand made, and dairy free ice cream (typical SF hipster stuff =]). People seems to complain about the $6 price tag. I actually think it's very reasonable considering the amount of manual labor to hand turn these babies. \n\n\nWe ordered six flavors: MyThai, oolong, cookies, strawberry cheesecake, sesame, and pistachios. MyThai and strawberry were A+ perfection. Oolong, cookies, and pistachio were a solid B+ (flavor wasn't very strong but still good), sesame is a C(I'm not too crazy about the texture nor the agar boba). Their drinks are also amazing, and fresh. Fruit lemonade had real fruit in it. \n\nTips:\n1. Wait for a minute or two after the rolls are made to allow them to soften. Otherwise you won't able to scoop with your spoon.\n2. Order pick up because it takes 2 minutes for each cup to be made.  \n3. They offer unlimited toppings, I asked my cups to  be filled with mochi, and filled with Mochi they were.", "author": "Tata X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "Unique concept for ice cream being freshly made and rolled up into rolls!  You get to see how they make it in open, public display. \n\nThey have tea and boba drinks on a simple menu.  I opted on their MyThai Ice Cream and one gets to choose toppings!  It includes coconut pudding, which was a sweet surprise that complimented with Thai milk tea flavor.  I chose boba, fresh fruits and chewy mochi.  The whole small dessert cup was packed with jumbo delight!\n\nSee-through big windows and metal stools for seating.  No tables.\n\nContemporary and hipster vibe.  There is even a photo booth right where one would pick up their order.  It gave me an implication to take snapshots of my ice cream rolls with succulents in the background and the name of the place with a hashtag behind it.  Good digital marketing to pass the word along to try this place out!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-19", "description": "Was super excited to try this place. Got tired of those \"boba guys\" all over the city.\n\nLove how they have tea and thai style ice cream. I came hear with the thought of getting the legendary matcha milk tea but somehow I ended with the Earl Grey lavender milk tea. I regret my decision. I don't like flowery flavors but I love earl grey so I thought it would be good. Tea flavor is great but that lavender killed it for me. I think it might be an okay ice cream flavor but not in the tea in my opinion. I'd definitely be back though and probably try the ice cream next time as summer is around the corner.\n\nPARKING: Obviously it's the city so parking will always an itch so no other comments about that. \n\nVIBE: It is in a very neat area and the store is very clean and spacious. Nice contemporary place to sit around and enjoy your tea or ice cream.", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Love love love this placeee! \nSo happy there is finally an ice cream shop in SF that makes rolled ice cream & I'm even happier about the flavors they have to offer!\n\nI was super excited to see that they have oolong flavored ice cream! It tastes just like milk tea--for all you milk tea lovers. They use real tea and I really felt the caffeine kick in after finishing the whole cup. Loved their toppings! I got herbal jelly, boba, mochi and honeydew, which all went well with the oolong ice cream. :)\nI also got to try my friend's Uji Matcha ice cream and it was so good.... very high quality matcha and I'm very particular when it comes to matcha because it can sometimes be too powdery or bitter. \n\nIt's was also very entertaining watching them make the ice cream because it freezes right away! You can also ask them to chop up the strawberries into your matcha ice cream, which I will definitely be trying next time.\n\nAnyways, I highly recommend this place. Prices are reasonable and they also offer boba drinks and coffee! I can't wait until my next visit already. :)", "author": "Leilani Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "Came here this past weekend and thought it was okay.  It definitely is different.  Location was under a business building and not really a high walking traffic area.\n\nWhen I walked in, didn't know where to order.  There was workers but nobody said where to order.  I think they should have a sign above that says \"order here\" so people are not so confused.  I saw other line up by the display as they were confused too.\n\nAnyways. I got the oolong tea ice cream roll which I thought was very flavorful.  I tried my friend's mint condition and reminded me of toothpaste..it was just not the right mint to duplicate.  \n\nOverall, it was fine but don't think I would go out of my way to go here.  Also, I think the staff should be more upbeat and friendly to give a good customer experience.", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "I've been so excited to try new things year after year!  Take frozen treats for instance; starting from shave ice to shave snow.  This year, a new form of frozen treat has entered the spotlight.  I couldn't wait any longer, so I had to check it out.\n\nBefore I quickly wrapped up my rainy Easter Sunday, I came all the way to the almost deserted Brannon st. which was few blocks close to AT&T Park.  And there it is, STEEP Tea and Creamery!  You have the very same STEEP Tea café that makes tea lattes, milk teas, and coffees; in addition to what would be the new concept of a frozen treat.  Say hello to the rolled ice cream!  Looks quite similar to rice sheets (if you take away the r from the word \"ice\").\n\nI'm glad the new creamery opened on weekends, and many people came here, but other patrons were still into bubble teas.  Shouldn't they supposed to go for ice rolled version of the boba drinks instead?  Pour the contents into the ice tray, mash them to bits, smear them thin like a cement, and chisel them into rolls.  There you have it, five frozen rolls with boba toppings, just how I pictured it!  I admit, workers have chiseled slowly; however, steadiness is what makes a good rolled ice cream.  \n\nSTEEP Tea and Creamery shall be one of the best places to have rolled ice cream!", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "Steep literally just opened across the street from my work and I've visited 4 times in a span of a week already. Talk about dangerous!\n\nMy favorite drink here is the Mango Green Tea with Lychee Jelly. It's so refreshing and the lychee jelly has a nice chewy texture. The ice cream rolls here is also worth trying and they offer plenty of flavors including cookies & cream and green tea. You can also top your ice cream rolls with Matcha Pudding & Boba. It's an amazing combo and my coworkers are obsessed!\n\nBefore this place opened, my coworkers and I would pay tons of money to Postmates to get Boba Guys delivered. Looks like we won't need to get boba delivered anymore since Steep is literally a 2 minute walk from the office. This place also has a rewards system. Buy 10 drinks and get 1 free. What a great incentive!", "author": "MyTien P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "I LOVE Steep. So when I found out they recently opened a new location AND serve rolled ice cream..?! Take my money, Steep. All of it. \n\nI recently tried Icicles in SJ and fell in love with rolled ice cream. STEEP Creamery & Tea is the first in SF to have it so I'm glad I don't have to venture all the way to South Bay to get my fix. If ice cream isn't your thing, don't worry they have their drinks here too. \n\nBack to the ice cream, I tried the Thai tea flavor which was really good and reasonably priced at $6. You have the option of adding additional toppings free of charge such as fresh fruit, mochi and cheesecake bites. Boba's an included topping, which I thought I would like.. but I'll pass next time. Too much chewing. \n\nI'm sad I didn't get to try any other flavors, but I will be back! Hopefully by then they will have some tables inside.. the stool situation was not ideal.\n\nEdit: Got a message regarding my review, furniture is on the way! Got sent back because it wasn't the color ordered #aesthetics", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "I really, really wanted to love it. The store is adorable and clean, and the ice cream rolls are so freaking cute and Instagram worthy. Watching them make the ice cream rolls was fun and many people were snap chatting away. Prices are a little steep(ha) but fairly standard for SOMA.\n\nBut man, that ice cream is so bland. We got the matcha and it tasted like creamy ice with a teeny amount of matcha flavor. I'm not a fan of super sweet desserts but it felt like I was eating diet ice cream. Also since they roll it out, it was very dense and almost impossible to eat with a spoon. Toppings and mochi were generous but rolls were so overrated. Pistachio was better but still meh. \n\nI'll stick with their boba teas, as those are tasty and fresh!", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Sometimes le boss gets on my case for being \"anti-social\" at work.\n\nPssshhhh, that's because he hasn't seen me after a couple of dranks. Just kidding, I probably wouldn't have a j.o.b. if he did and would have to go into Yelp retirement. \n\nI'm social....around food and people that love food. That's why Yelpers get along so well - we can talk food all day. \n\nSTEEP has the BEST milk tea in San Francisco, even better than Boba Guys (I'm really bad at posting reviews for boba places but they're 5 stars).  When I saw Tao Tao W. check into \"STEEP Creamery & Tea\" and saw that they were serving Thai Ice Cream Rolls, I quickly sent the business link to Kathleen U. We kept running into each other at new business openings and she didn't make me feel crazy for taking an uber/lyft during lunch just to try a new place...because she did it too. So why not be crazy food obsessed together. \n\nOpening last week, STEEP Creamery is an offshoot of STEEP (in the little alleyway of Ritch) that sells made to order, handcrafted Thai Ice Cream Rolls. They're the first SF shop to offer this latest food trend. Since AT&T Park is nearby, I can imagine STEEP Creamery & Tea being very busy once baseball season comes into full swing. \n\nOn the day we went, they had 5 flavors: My Thai (Thai Tea), Cookie Crush, Roasted Oolong, Uji Matcha, and Pistachio. They only have one size for $6. Each flavor comes with pre-set toppings but you can add any others for free: boba, housemade coconut pudding, housemade grass jelly, fresh strawberries, red bean, mochi, cookies, cheesecake bites, dark chocolate shavings, and whip cream.\n\nThey also sell their signature STEEP teas, milk teas, and UJI matcha. Caffeine free options available. They have a rewards program (buy 10, get 1 free). Cc's accepted. \n\nI ordered the Roasted Oolong Ice Cream Rolls which came with boba, housemade grass jelly and Kathleen ordered the My Thai (Thai Tea) that came with housemade coconut pudding, boba, and mochi: http://bit.ly/2ouDYpI\n\nSince everything is made to order, expect a wait if there's a line (we got there early so no line). The Straus milk concoction is poured onto an iced grill, smoothed across the surface until it stiffens, and is scraped into ice rolls. \n\nThe first time I had Thai Ice Cream Rolls was at Icicle's first location in Willow Glen (http://bit.ly/2ow3Mlh) which I enjoyed but I like STEEP's much better...\n\nI loved the Roasted Oolong Ice Cream Roll - it was deliciously creamy and silky smooth with the perfect amount of creamy sweetness. It was literally like their Roasted Oolong Milk Tea but in ice cream sheet form. Unlike many milk tea places, the tea flavor really comes through. The boba had a good bouncy chew and the grass jelly's mildy bitter flavor balances out the sweetness. Although I liked the toppings, I'm an ice cream purist. I would have enjoyed it just as much if the rolls were nekkid because of the high quality ingredients. \n\nThe ice cream rolls are very IG friendly and they even have a photo cube with succulents for staging so you can get that perfect picture. \n\nThere's several stools and a bench to enjoy your ice cream treat. \n\nIn the future, I hope STEEP considers opening a spot in Mid-Market which is in dire need of a good milk tea and dessert spot. It's going to be one expensive daily addiction but you can never have enough balls in your life, or in your mouff.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "We went here on a Sunday evening and there was a pretty steady stream of customers! The menu is concise (in a good way) and they are generous with toppings. I tried the Thai tea rolled ice cream and enjoyed the flavor and texture. It seems like high quality stuff, and the price reflects that, perhaps overly so. Each ice cream costs $6, which is quite... steep (hehe excuse the pun) even for San Francisco. If you want something simpler without the gimmick, Crossroads Cafe has large ice cream portions for a good price and is walking distance. If you're willing to pay for the hype, then give Steep a try!\n\nI didn't order bubble tea, but boba was a topping on my ice cream. It was just the right kind of texture you want in tapioca - firm, but still chewy. \n\nKind of slow process, so don't go if you're in a hurry!", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "4.0 stars for STEEP. \n\nThis was my first time getting rolled ice cream. It's fun to watch them make it, and it tastes like a cross between ice cream and a deconstructed milk tea (if you get the boba topping). I got the oolong tea with boba and herbal jelly along with blueberries. SO GOOD! \n\nIt's slightly pricey at $6 but it's one of the new trendy things these days and worth trying at least once! \n\nClean, simplistic decor and friendly service.", "author": "Brenda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "I like the concept of ice cream roll. \nIt's a chill place to hangout after lunch or dinner. Bright and clean. The menu is easy to follow.\n\nThe ice cream itself is just okay.  I'm not super impressed by it. The wait is kind of long. Not sure if they can turn down the cold plate and form the ice cream faster  ... ?_?\n\nI would come back for casual hangout. It's still a pretty nice place. =)", "author": "Rachael C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Rounding up to 5 stars as I'd be excited to take anyone here for a new, fun experience, quality ice cream, and reasonable prices. Obviously one whole star is earned by the form factor.\n\nIt's hard to find - we were looking for it and walked right passed it. Look across the street for the red Alno sign as your guide; it's the door after Splunk. \n\nThey have certainly capitalized on the trend of instagrammable food, so much so that there's actually a small photobooth with lighting and a phone tripod to get that perfect shot. Don't forget to capture that video of them freezing and rolling up the ice cream. There's a lot of time and effort that goes into this (much more than just scooping ice cream), so I can imagine how it might be a bit slow at popular times. For us, it was relatively empty near closing time and we were happy to take our time and watch the magic in the making.\n\nGimmicks aside, my thai iced tea ice cream was really great. I also tasted the oolong, which was good but too subtle for me. The actual amount of ice cream is pretty small, but there are plenty of toppings to make up for it (you can also get any extras you want to cram in there for free). I was a little saddened to realize that eating the rolls destroys their beauty and uniqueness, unless maybe you can withstand the cold to eat them like finger food super quick before they melt.\n\nI'm already debating if the next trip will be to try the cookie crush ice cream I was eyeing, the matcha latte, or a boba drink. Could become a dangerous walk home.", "author": "Cristina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "I am so glad there is a good tea place in SOMA. \n\nThe location: close to home. That's all that matters. Just kidding. It's a good location if you're walking. There is street parking but this is a mostly residential area, so parking is probably hard to find. If you're lucky, you'll find free two hour parking. Woohoo. It's pretty small inside. There's a bit of seating but it gets crowded quick, especially when people take breaks from work and head there with coworkers. \n\nThe ice cream: rolled Thai tea ice cream with mochi and boba? Yes please. It doesn't really take long unless there's a ton of people. The ice cream was so good. It tasted exactly like it should...Thai tea with mochi and boba. That's all I've tried so far because I'm not a huge ice cream fan (aka I'm lactose intolerant). I can't wait to come back to try more. \n\nThe tea: Thai tea: very delicious. It was a bit bitter but that's the way I like my tea. The regular jasmine milk tea was good too. It was a bit sweet but I just have to ask for less sugar next time. The crystal boba wasn't as sweet as other places. I couldn't really tell if I liked it or not. The regular boba was delicious. It was chewy and the perfect texture for me. \n\nOverall, I thought this place was really good. Luckily, it's convenient for me to get to, so I'll definitely be back to try more.", "author": "Cicily C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "I love boba tea and I've never had rolled ice cream before so we decided to order it. Now I know how the rolled ice cream is made and it tastes great! I came for food and left with new knowledge. :)", "author": "Eugene Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "The ice cream roll craze has finally arrived in SF! I bet they will start popping up everywhere in the city now since ice cream rolls seem to be the new poke bowls. \n\nI had my eye on STEEP as soon as they opened and was finally able to make the trek to SOMA after work last week. Parking was a breeze at 6pm on a weekday and there was no line to order. I'm sure that has changed now since the word is spreading. There are only three ice cream machines and the liquid mix takes a few minutes to freeze before they can get rolling (pun intended!), so depending on how backed up they are, you might be waiting for a while. \n\nWe ordered the Mythai (thai iced tea) and the oolong flavors. They both came with a set list of toppings but you can replace or add whatever you like for no additional charge. My thai iced tea ice cream came with boba that was perfectly chewy and a coconut pudding that I enjoyed despite not being a huge fan of coconut. We both opted to add mochi because why not?\n\nSTEEP is reasonably priced and delicious, but not really that special after trying it once and getting the picture for social media (let's be honest...that's really all that matters, right?). I probably wouldn't come all the way across town to get it again, but it's a good sweet treat if you're nearby on a warm and sunny day.", "author": "Olivia V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Let me start off by saying this place is not expensive compared to others, the average price for rolled ice cream is $7 here and drinks are about $5. Place was quaint and hipster with seatings. I ordered a Matcha Politan with condensed milk and mochi. Ice cream was really good, not that sweet at all just perfect. The mochi was chewy and delicous. The matcha boba was also really good!\nIf your looking for a quick desert or drink stop by here!", "author": "Jason X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-28", "description": "Welcome to the neighborhood, STEEP! I love the concept. Asian-fusion ice cream, Ujimatcha drinks, Thai tea, tapioca pearls! All in one place!\n\nThe space is tiny and immaculate. They really capitalize off of the Instagram revolution by having a little light box in the corner for you to take your food photos in perfect light -- complete with cute succulents! \n\nI loved that you could choose the sweetness level of drinks. The mango drink is completely vegan, no dairy. I liked that they offered an option for us lactose intolerants :)\n\nThe one thing to be aware of is that the wait can be quite long, especially if you order the ice cream rolls. Each ice cream roll is made to order so it can take a while for your order to be ready. \n\nOtherwise, yum. I can't wait to come back and try the matcha drinks.", "author": "Rose K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "I am SO happy Steep added aloe to their toppings :D\n\nSteep's selection of boba drinks and ice creams are really top-notch. Definitely recommend.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "After having Icicles in San Jose, and the original in New York City from 10Below, Steep does not even come close. It's unfortunate because I've been patiently waiting for rolled ice cream to make its way into San Francisco. \n\nFirst of all, our order only had 3 (visible) rolls of ice cream. THREE. Underneath the toppings laid 1 more roll of ice cream. At Icicles or 10Below, the workers fill up your WHOLE CUP with rolled ice cream.. at least 5-6 rolls per order. I paid $6 for loosely rolled up ice cream?! You're kidding! \n\nBoba as a topping is a nice touch, which is something I haven't seen at Steep's competitors but this isn't enough to keep me as a customer. \n\nThe high reviews are very deceiving, as they must have been written by people who are amused by the concept and haven't had the original. You're getting ripped off people, lol!", "author": "Ingrid E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Awesome new ice cream and boba addition to South Beach! It was within walking distance from work. This review is only for the rolled ice cream, but I'm excited to come back to try the milk tea! I gave STEEP 4/5 stars because of the price  ($6 for ice cream is still $$$$ in my opinion although you do receive many toppings); however, I can also see this place getting extremely crowded once it becomes more popular because there are only three ice cream making stations and the process to \"roll\" does take a while. Overall I would recommend trying this place at least once!\n\n[Rolled Ice Cream]\nI tried the MyThai flavor while my friend tried the Oreo Cookie flavor. The MyThai came with a pudding, nicely firm tapioca, and beautifully rolled Thai Thea flavor ice cream rolls. I personally liked the Cookie flavor more with the cookie flavored cream and the Oreo, but both tasted great - not too sweet and a nice blend of toppings to complement the ice cream rolls. \n\n[Service] \nYou do have to wait a bit for the ice cream, but the milk tea came out extremely fast for the other customers that ordered it. However, I can see a queue potentially forming during the summer as there isn't much seating or space in the shop.\n\nTry this place before it gets too popular! You'll at least enjoy watching your ice cream being made right in front of you.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-09", "description": "Been to this second location of Steep many times with coworkers, family and friends. I've tried their matcha latte, milk tea with different toppings and rolled ice cream. Loved their C++ rolled ice cream - it had chocolate, waffle cone, and chocolate ice cream, mashed altogether and fun to watch it being made. Earl lavender milk tea was my goto decaf drink. Matcha latte was also very good, not over sweet with 25% sweet level. The only thing I couldn't really finish was their herb jelly topping when I tried the other day.. :( Drinks were a bit pricey similar to Boba Guys, but rolled ice cream was definitely worth trying and watching. If already feeling the ice cream deserves a photo, a mini photo booth awaits :-)", "author": "Jaclyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "Pretty place to chill in around soma. Great location for people from the office to get boba or ice cream. It's close to its first location.\n\nWhat's cute is that they have a little photo light box section for your drinks and things!\n\nOh and build up those points to get free things!", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "I got the Matcha flavor and my sister got the Thai Tea flavor. Both were really great and tasted EXACTLY like the teas, in other words, the taste of the tea is there without being overly sweet.\n\nToppings were pretty generous and it was a good amount of ice cream. I will say I was left wanting more--but in a way that I felt like there wasn't enough to begin with. Either way, I didn't think $6 was too bad considering they also offer free toppings (e.g. Fruit, cheesecake bites, mochi)\n\nNext time I really want to try the cookies and cream flavor. It seemed to be the most popular!", "author": "Angelina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "Yummy stuff!  Sweet, refreshing, and hits the spot on a warm SF day.\n\nI have to come back to try so many other flavors.  They have everything from ice cream to boba drinks.\n\nAlthough it's a little on the $ side, it's something new here.\n\nI'll have to make a trip out again soon.", "author": "Julie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Fresh boba and rolled ice cream tucked into a quiet area of San Francisco that's very close to the heart of SOMA. I've been here 3-4 times and every time it's been a high-quality experience. My go-to is the strawberry black tea boba, which comes with a puree of strawberries. You can adjust for sweetness level too. I've also tried the matcha red bean drink which is also fresh and authentic. \n\nI've tried the Coffee Meets Waffle rolled ice cream with cheesecake bits as toppings, and it was really creamy and delicious. Just watching them roll the ice cream is also therapeutic in its own way. You can tell that the employees here take great pride in their work and are fast to bring out the desserts too!", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-15", "description": "I tried their matcha roll with the free toppings of chocolate shavings, mochi, cheesecake and fresh fruit....which were very tarte and not ripe yet.\n\nAll in all...I don't like matcha ice cream and the roll was VERY frozen and the cup was small. About 5% kept coming out of the cup because it was so frozen I couldn't scoop anything properly.\n\nThe idea is pretty cool on bf, but not really great to eat. I would probably try the hot matcha if anything.....", "author": "Lynn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-29", "description": "# 16 Steep (not Steap) *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n\nSame establishment as the one on Ritch they now serve ice cream as well. \n\nThey are #16 out of 30 in my rankings below which makes them good but not great. The customer service is good and they usually aren't too busy which is a plus. \n\n\n\nRod M tours San Francisco in search of the BEST standard milk tea with boba. I have individual reviews for all the places listed below.  Check out my latest reviews for the most up to date list. \n\nI recently embarked on a completely pointless quest to rank most of the Milk Tea/Boba Places in the area.\n\nRules: I ordered a simple milk tea with Boba (regular sweetness, ice etc.)\n\nRanking explained:  #1 (listed at the top)  is my favorite/ #30  (listed at the bottom) is my least favorite. \n\nRod Boba SF Rating = (Taste of Milk Tea / Taste of Tapioca Balls) on a Scale of 1 to 10 (10/10) being the best score possible\n* Please note that I like my boba a little bit sweet. I don't like it too milky, too strong of a tea taste or too watery.  I prefer fresh tasting larger \"boba\".  Powdery drinks (those places that simply have a plastic carafe that they pour out of ) and boba that tastes \"old\" get docked on my rating scale. \n# 1 Itea *Rod Boba SF Rating * 9/9 *Rod's Yelp Rating *5 stars \n# 2 Puppy bobar *Rod Boba SF Rating * 8/8 *Rod's Yelp Rating *5 stars \n# 3 Asha Tea House *Rod Boba SF Rating * 7/9 *Rod's Yelp Rating *4 stars \n# 4 Caffee Central *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 5 Cool Tea  *Rod Boba SF Rating * 7/8 *Rod's Yelp Rating *4 stars \n# 6 The Boba Shop *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 7 Good Earth Café *Rod Boba SF Rating * 7/7 *Rod's Yelp Rating *4 stars \n# 8 Hanlin Tea *Rod Boba SF Rating * 6/7 *Rod's Yelp Rating *4 stars \n# 9 Keep it *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 10 Wonder Tea *Rod Boba SF Rating * 6/6 *Rod's Yelp Rating *4 stars \n# 11 Tpumps *Rod Boba SF Rating * 5/7 *Rod's Yelp Rating *4 stars \n# 12 The Ramen Bar *Rod Boba SF Rating * 6/5 *Rod's Yelp Rating *3 stars \n# 13 Sharetea *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 14 Tanca *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 15 Boba Guys *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 16 Steep (not Steap) *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 17 T&T Café *Rod Boba SF Rating * 5/5 *Rod's Yelp Rating *3 stars \n# 18 E Tea *Rod Boba SF Rating * 4/6 *Rod's Yelp Rating *2 stars \n# 19 Steap (not Steep) *Rod Boba SF Rating * 4/5 *Rod's Yelp Rating *2 stars \n# 20 Maggies Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 21 Sweet Heart Café *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 22 Honeycreme *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 23 Elixiria *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 24 Quickly *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 25 Plentea *Rod Boba SF Rating * 4/4 *Rod's Yelp Rating *2 stars \n# 26 Mi tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 27 Ten Ren Tea *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 28 Wonderful Foods/Dessert & Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 29 Out the Door *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars \n# 30 I Café *Rod Boba SF Rating * 3/3 *Rod's Yelp Rating *2 stars", "author": "Rod M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "I had high hopes of this creamery place. But sad to say it's just alright! I ordered the matcha and oolong flavored ice cream rolls. \n\nI was expecting the matcha to taste fresh and not powdery.. the ice cream itself melted pretty fast and the matcha tasted so much like powder :(\n\nOn the brighter side the oolong tasted exactly like oolong tea! I would recommend this one. \n\nMaybe next time I'll try something different !", "author": "Jenny S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "I wasn't quite into the hype of rolled ice cream. However, one wonderful rare warm weather Sunday, my friends and I came here and it was delightful! \n\nThe flavors are truly fresh and taste natural. And free unlimited toppings whassssup. \n\nThey do have a non-dairy coconut option off the menu! #vegan\n\nThe service was a little slow since I understand the process is more than just scooping. \n\nThey are $6 which is actually not bad since it comes with all the toppings and is non artificial.", "author": "Aria S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-20", "description": "This place should just stick to the ice cream rolls and get rid of the boba. There's so many good boba places in the city, and unfortunately this ain't one of them. But I'm absolutely addicted to the ice cream rolls here. \n\nCame here a few times after work. It's located in the heart of SoMa, a bit small but have a very simple yet contemporary ambiance to it. There's only 3 tables, so seating is extremely limited. STEEP is known for its ice cream rolls, they have a variety of different flavors and toppings you can try. You order at the register and then you get to watch them make it. I've only tried two of their flavors here - the black sesame one and the matcha one. Boy oh boy, they're both delicious. Oh did I mention you get FREE UNLIMITED TOPPINGS? ya, go nuts.", "author": "Xin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "This place is pretty amazing but don't come if you're in a rush.  Your order will take some time since they literally have to make your ice cream.  It's a very fun process to watch and the unlimited toppings is pretty awesome.  The Thai iced cream was delicious.  I added mochi, fruit and boba.  One serving is enough to split.  The employees working here deserve mad props because they put a lot of work, and I'm talking there's some physical labor in there, to make each order.", "author": "Alana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Atmosphere [4.5/5]: The store is clean and cute. They have around 3 high-top tables - it could get crowded so wish they could get more sitting space. \n\nDesserts: we ordered 4 flavors of the rolled ice cream. They were all pretty nice, and we can tell that the ingredients are good. They use Straus milk for their rolled ice cream, which makes a difference in the taste. And, FREE toppings!\n\n - Uji Matcha [4.5/5]: how can matcha go wrong? The flavor of matcha is pure, strong and at right amount. The only thing was that this one melted very fast for some reason so I took off half point.\n\n - Original Oolong [5/5]: our favorite of the night! The oolong flavor is great - strong and perfect balance of the sweet from the cream and the bitter from the tea. \n\n - Black Sesame [4.5/5]: we could taste the generous amount of black sesame they put in. But I found it getting a bit sweet as I eat more. \n\n - Mango Coconut [4/5]: personally, I am not a huge fan of this one; yet, it is quite refreshing and is certainly not the artificial flavor of mango. \n\nWill go back when craving for rolled ice cream!", "author": "Susan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Stopped by after lunch to try out their roll ice cream and was pleasantly surprised! \nI've been to several roll ice cream shops and I can say STEEP is one of the few that produces strong and authentic flavors. \n\nDESSERT: \nSteep serves ice cream and drinks. Their roll ice cream is one of their newer items on the menu. I love all their roll ice cream flavors they offer, especially their tea flavors. They also offer toppings such as: cheesecake, mochi, fruits and cookie crumbs which are all included in the cost of the roll ice cream. \nWe ordered: \n+ Roasted Oolong Milk Tea $4: I actually found their drink to be strong in their tea flavor, but my BF did not like the graininess of the tea, but I didn't mind it.\n+ Roasted Pistachio w/ boba and matcha pudding $5: I was a little hesitant to order this because most places use artificial pistachio flavors, masked in sugar and chunks of pistachio. BUT not STEEP. You can taste that they blended pure roasted pistachio into their base and it tasted delicious! The matcha pudding, cheesecake and mochi were a good touch, but I did not like it with boba. \n+ Uji matcha w/ mochi and fruits $5: wow. I was very impressed by the strong matcha flavor. It was more on the bitter side which is how I like my matcha. It means their they didn't skim on the matcha powder! \n\nCompared to most other roll ice cream shops, they serve less quantity of rolls than most places. \n\nSERVICE: \nThe guy that took our order was very friendly and knowledgeable of the menu. We did not have to wait long for our order. \n\nAMBIANCE: \nNatural lighting, clean and simple. They only have 2 narrow tables with 4 chairs each and a bench near the front. So seating is limited. \n\nVerdict: I would totally be back to try their other flavors.", "author": "Samantha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-25", "description": "Oreo milkshake was alright. Didn't see it on the menu but the hostess told us about the milkshakes. This location is pretty isolated from other shops. I can imagine parking can be bad during the day but I came at 6:45pm on a Sunday so I parked across the street without any difficulty. \n\nThey have a platform for people to take their food photo. What a great way for free advertisement. It's also creative (;", "author": "Jess W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "Boba & rolled ice cream? Yes STEEP got you covered! Love their concept and literally anything you get on their menu, its so SO good! I havent gotten something that disappointed me. Although there are some drinks i personally like more. Matcha sesame latte, roasted oolong milk tea and kumquat tangerine green tea. If you love sesame and matcha, you HAVE to get the matcha sesame drink or the matchapolis ice cream. They have the best matcha and it cant go wrong! Bobas always on point too!", "author": "Ho H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-06", "description": "*** In Short ***\n\nTasty and Instagram-worthy Thai-style rolled ice cream.\n\n*** In Depth ***\n\nI'd been wanting to try Thai rolled ice cream ever since I first came across it on Reddit, so I was pretty excited when I found out that I could get it here in the heart of SF, rather than going all the way to Taiwan (KIDDING, kidding - Thailand), inevitable hipster tax be damned. And while it's missing the appeal of being served from atop a giant ice block from a dingy street stall, their approach with the ice cold metal surfaces is undoubtedly far more hygienic.\n\nThey have a few options that always seem to be available, as well as daily/seasonal specials. If you're a fan of chocolate ice cream and brownies, and ever see the C++ on the menu (this IS tech central, after all), I'd highly recommend giving that a go.\n\n***Accessibility Info***\n\nVenue - While not exactly tiny, with the high top seating on the side and the rolling stations to the other, aisle space can be a premium, especially if a bunch of people are milling about, recording their ice cream being rolled.\n\nBathroom - Didn't try them.", "author": "Johnny W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Ice cream rolled out and up!  The place has a great selection and very friendly staff.\n\nThe made to order ice cream is excellent, I had the Key Line flavor with tiny crumbs of graham cracker crust sprinkled on - rock in'!\n\nI recommend it for sure, cool spot.", "author": "James D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-15", "description": "I was actually on my way to Steap Tea Bar.. But somehow my Maps accidentally sent me to STEEP Creamery & Tea- has that happened to anyone? LOL \n\nWe tried their Mango Fruit Tea (4/5)- I wish I could have asked for extra sweetness because the taste was too subtle. I really like the mango pieces tho\n\n! We also tried the Legendary Matcha Milk Tea (3/5) cause I tried waay  better matcha milk tea, I should have tried the strawberry matcha lemonade.. That would have been different (& possibly better). \n\nPersonally, I didn't try their ice cream so I don't want to give them a bad review. If they're specializing on ice cream, you shouldn't  dislike the business on the quality of their boba- ya feel me? I'm just really critical on the quality of boba cause I've tried better ones in San Jose\n\nCome & try this business for yourself! Ask the staff for their opinions :)", "author": "Jezza Mei O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "Cute space, but the one in Ritch is way better! I ordered a peach milk tea here without adjusting sweetness and ice..and it was wayyy too sweet, it was pretty much undrinkable!! I never adjust the sweetness on drinks I order from Steep on Ritch St, so that way very surprising. \n\nOn the plus side, they do have ice cream curls here which seems to be the more popular treat here.\n\nIf you order boba, just know that they run sweeter than most and to definitely adjust your sweetness level!! A-ok for a quick boba fix..", "author": "Jennifer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "YES quality boba and great location. There's no other quality boba in this area--ok except for their other Steep location in Ritch Alley. This location has their rolled ice cream though. Clever ice cream names and combos. I'm a fan", "author": "Alias A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Stopped by this place after a Giants game. Ice cream tastes good. It's just getting used to ice cream texture in a roll form. Toppings are free. Strawberry and matcha ice cream are really delicious. The coffee ice cream didn't have enough flavor. The shop has a small inside sitting area but I think that's normal for SF. Overall, STEEP is good place to go if your group wants ice cream and Boba.", "author": "Geraldine N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Yum!!! Creamy and silly smooth texture rolled ice cream with great toppings like fruit, cheesecake, mochi, chocolate flakes, etc. Will definitely come back and try other flavors.", "author": "Vinitha R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-10", "description": "Ah STEEP. Welcome to my hood.  It's taken a REALLY long time for businesses to open in this part of SOMA, so when I saw STEEP's sign as they were constructing their spot, I was super excited.  The whole \"rolled\" ice cream thing took over the Internet and there wasn't any place for me to try it nearby.  Enter STEEP. Getting your rolled ice cream fix is now more accessible than ever.  My only rub? It's just OK in taste.  I still prefer my precious soft serve options and it's hard to deny the superior tastes of Humphrey Slocombe at the Ferry Building as well.  That being said, I did enjoy the Oreo mix concoction and watching them make it was mesmerizing too. I love that this is here now, here's to hoping that more shops like STEEP come soon!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "Soooo good. They have unique combinations of ice cream and the toppings they put on afterwards really make all the flavors pop. The ice cream tastes fresh and isn't too sweet despite everything that comes included with it. We also got a drink here - the milk tea is perfectly creamy without being too sweet and the boba balls were nice and juicy (not like with some other places where they are semi frozen, yuck).\n\nThe staff was super friendly and knew what they were doing, and it was really cool to watch them make the ice cream. And they even have a \"photobooth\" where you can take a picture of your dessert after they've made it and post it to social media. \n\nGreat find!", "author": "Anita L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-05", "description": "Great tea and not a far walk from tea the Caltrain station! I came here with a friend and we ordered the rolled ice cream and two drinks. The inside of the shop is super cute and very comfy. The service was great, too. Also, the bathroom was cleaner than most places.", "author": "Cheryl O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "I thought SF had reached peak ice cream what with HS, Smitten, Mr & Mrs Miscellaneous, Bi-Rite, etc. But it seems we're getting another wave of ice cream with an Asian twist and/or fancy presentations. I'm talking about Garden Creamery, Powder, Uji Time, and Steep.\n\nAt steep they have special tables with cooling elements on which they pour the liquid, Once frozen they scrape it up into a mound then carefully smooth it out into a thin square. Then they scrape it up row by row into nice little rolls and topped with yummy treats like boba, coconut jelly, mochi, etc.\n\nAs you may have guessed this is a very labor intensive process. So don't expect your ice cream to be ready quickly. I'm guessing 10 min at least? But it's very entertaining to watch so all is forgiven.\n\nA few minor quibbles -\n\n - I wish they had a better container for the ice cream rolls and toppings. Looks cute but you have to be very dextrous to eat without toppings falling all over the place. Then because toppings are on top when you're halfway through you're just left with ice cream with no toppings which makes me sad.\n\n - this is literally frozen water so it's not creamy or fluffy since it's not churned like ice cream. The rolls are actually very dense and I'm not sure I like how hard they are texture wise. You have to work harder with the spoon to even get a scoop and it just sits kinda cold in your mouth.\n\nEven on weekends this place is not too busy.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-21", "description": "Ambiance and the prices are right but the flavor is a miss. I ordered the cookie crush and it was very bland. My best friend ordered the shortcake strawberry which had a little bit of flavor. They are a little skimpy with the mix-Ins which may be why the ice cream is bland. Won't be coming back.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "Really unique and delicious. Made to order, thinly rolled sheets of ice cream, you'll enjoy watching them make it almost as much as you'll enjoy eating. Really delicious ice teas with boba as well.", "author": "Donna B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-16", "description": "Sorely disappointed with this place. \n\nI know these guys are known for their ice cream rolls so the staff mainly focused on getting those out to the customers while only one person cashiered and made the drink orders. Our three drinks took over thirty minutes to get to us only after I reminded them that we had yet to receive them. \n\nI ordered a roasted oolong with boba and it was no bueno. Watered down and had ice filled to the top even though I asked for light ice. Would not recommend.", "author": "Natalie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-20", "description": "I have been to both their permanent location and their pop up and while the permanent location does a decent ice cream, their pop up was less than desirable. I had ordered their basic matcha with boba and 100% sweetness (it was a long day and I just succeeded in completing a major project and needed a quick pick me up before getting back to my desk quickly) and when I picked up my drink, I saw that the boba was missing so I asked if they could add it. It took a few minutes for them to add it and by then I was running late. I grabbed a straw and started to head out, taking a sip at the door to find that it was not sweetened at all (I drink matcha on a very regular basis so while I was expecting a sweet drink the straight matcha was not horrible, just not what I needed this afternoon) and when I went back and asked about it, I had two different responses on the sweetness so I figured I could not trust having it remade (and I was late already.) I would suggest getting their ice cream as it is fun to watch them make it, but maybe skip their boba teas unless you want to go back multiple times to get it right.", "author": "Beth I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "I had a taste of the cookies & cream and the black sesame rolled ice cream, but oolong was THE ONE! It pairs so nicely with the toppings of herbal jelly and boba. Definitely will be back for the oolong!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "What do you do when you have a sweet craving and there's nothing nearby that interest you? Ask Yelp!So Yelp brought me to STEEP and it's nearby enough to get to from fidi so I gave it a try.  \n\nNever tried rolled ice cream before so for my first time, I think it's pretty darn good.  I had the original oolong ice cream with boba and grass jelly.  It's creamy and not overly sweet.  It tasted just like a boba milk tea in ice cream form.  One thing I regretted is not reading few more reviews ahead of time because I wanted the mochi toppings but it didn't come with my order.  Didn't know you can ask for it until I read the reviews at home.  Bummer!\n\nAlso why not 5 stars because my portion came out some what smaller than the cheesecake ice cream when comparing side by side.  I was hoping for a instagrammy shot (the shop has a little photo booth set up) but my cup seems a little sad looking.\n\nPrice is reasonable for what you get and a good place to go for some Asian style creamery as there's really nothing around the downtown area.  Will go back and try their boba tea and other ice cream flavors.", "author": "Shirley H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-28", "description": "This is only second time having rolled ice cream so I'm no connoisseur but it was disappointing. I had the Uji Matcha - the consistency was too thick and the flavor was not good.  Not sure if it was because there was a rush and the maker went from order to order. Minimal toppings also make it disappointing. Probably won't be back.", "author": "Leona W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "A welcome addition to quiet South Beach street scene. They've expanded their hours since their first months, so that's awesome.\n\nThe ice cream rolls with boba is a great twist on Asian snacks. Oh and the matcha menu is legit too, one should not require sugar to enjoy tea.", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "What a cute little ice cream and tea store! San Francisco needs more rolled ice cream options, and STEEP certainly fills the gap! I stopped by here for dessert and got the matcha rolled ice cream, which came with strawberries and lots of red bean. The ice cream here certainly isn't cheap at $6 a cup, and only about half of it is filled with ice cream (the other half is made of toppings). But while the value isn't fantastic, the ingredients are definitely of high quality, and the atmosphere is nice and trendy as well.", "author": "David K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Boyfriend and I shared the oolong tea ice cream rolls. We asked for some extra toppings with our order and they gave it to us for free of charge :) it was $6 total. The rolls were much thicker in texture than other places I've tried. \n\nParking was a piece of cake in this area. Strange location since there aren't too many stores nearby. \n\nStore is super clean and well lit. I really like their photo booth idea. Easy way to market their business!", "author": "Sarah T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "It was fresh tasting and delicious. I ordered the coffee meets waffle which tasted jut like cold brew coffee! The topping was waffle cone but I think you can ask to to add any because I did for free. They roll it really cold therefore it doesn't melt fast!! There is a small but all very tasty selection. Can't go wrong", "author": "Rubi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-05", "description": "This place is AMAZING for their rolled ice cream. The matcha tasted incredibly rich and the texture was very smooth. In addition, you can add unlimited toppings - I added fruits, mochi, and condensed milk! The staff here is also very friendly and hard-working. When they were making my friend's ice cream rolls, one of them cracked and wasn't holding very well, and they re-made it without a question. \n\nThey also have a cute photo station assembled where you can take a picture of your ice cream with some succulents in the background. Definitely a must for all of you hipsters out there~\n\nThe only con of this place is the lack of seating because it's so small. Definitely consider this if you have a large party. However, this will definitely not deter me from returning again!", "author": "Sheila S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "I'm glad that there's finally an ice cream roll and boba shop nearby me now! I've came here twice and tried the matcha and strawberry ice cream rolls. Both of them had a strong tasty and creamy flavor. It wasn't too sweet either. I suggest adding boba, mochi, and fresh strawberries, they go really well together! \n\nStore is clean, customer service was nice and friendly, and right next to at&t ball park. Emily helped me out and suggested the strawberry cheese cake rolls, definitely will try again!", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "Black sesame with agar boba, fruit, and mochi! Probably wouldn't get the black sesame flavor again because it has a weird after taste, but everything else on the menu looked good including their green teas! $6\n\nSide note: the ice cream tastes better when you let it sit for a few min because right when they give it to you it's too icy and kinda chalky", "author": "Mallory B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "STEEP was my first experience having rolled ice cream. I loved watching it be made into rolls. The staff was friendly and the ice cream was super tasty. Perfect on a warm SF day.", "author": "Katie K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "YIPPEE STEEPEE!! you have done it again!!\n\nI love STEEP so much that I am planning to try all flavors they have (not to mention they have weekly special or something, it's a never-ending tasting contest for me!)\n\nSo far I have tried Chocolate, Ooolong tea, Pistachio, and Matcha:\n\nChocolate - is good if you adore the rich texture and aftertaste of chocolate\nOolong tea - what can I say? It sure tastes like tea!!! \nPistachio - Pistachio is HEAVEN. There is real pistachio inside mmmhhmmmm I want it now..\nMatcha - I am not a matcha person, but this does taste like legit matcha! and it's good with the fresh, organic strawberries...\n\nTIPS FOR YA: Boba as topping is cool, however, if you leave the boba with the ice cream for too long, boba would become rock hard. I don't know bout you but I am #TeamSoftBoba. Just sayinggg", "author": "Ella U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "Came here on a hot day and walked 25 mins in uncomfortable shoes just get here. Was totally worth it - the Thai tea rolls tasted just like Thai iced tea. I also got a strawberry tea which was good but nothing to rave about. Definitely will be back to try the other ice cream roll flavors!", "author": "Dani T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Suprisingly cheap in cost but high quality ice cream. Pretty cool experience, took the lady here on a day out in the city and she enjoyed it. We got the Matcha rolled ice cream (could do w/o the red beans) with mochi, cheesecake and fruits. Overall pretty good but theres a place called lets roll in Sunset that does rolled Ice Cream. Its a little more costly but I think they have more of a bang for your buck.", "author": "Navdeep D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "Love their menu items. My peach oolong tea tastes pretty good but boba is too over cooked. Prefer the chewier ones.", "author": "Cloudy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Rolled ice cream is a sensational Thai frozen dessert. And no, you don't need an international plane ticket to get your hands on a cup of rolled ice cream. \n\nToday, I indulged myself in a cup of freshly made to order Ujimatcha topped with strawberry and red bean. The experience? Simply authentic! The Ujimatcha rolled ice cream was rich in flavor, creamy and yielded a refreshing bittersweet silky taste. This place will keep me coming back for more! \n\nIt's definitely worth the visit to STEEP creamery!", "author": "Amy Karina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "YES! Finally tried the famous rolled ice cream :D\n\nMaybe it's a little hyped up but sometimes, you just wanna know! This place is super close to my work so I wrangled up some friends to go with me. I wanted to have their Black Sesame flavor but unfortunately when I went they were sold out :( So I settled with Thai Tea plus Fruit and Matcha Pudding. They don't us many ingredients and it's a very small portion of ice cream but it was refreshing and super delightful to eat on a unusually HOT SF day. The quality of the ingredients is pretty good and you learn a lot about their ingredient sourcing but there isn't much too it. In the end, it's a pretty pricey ice cream, coming in at $6 dollars for, what would add up to being 1 scoop plus toppings. \n\nI'd like to go again and try the Black Sesame and maybe I'll take a bubble tea too at some point! Great to check out if you've never experienced the ice cream roll but probably not an ongoing place to go time after time unless you have $$$$ hah", "author": "Nerissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "I fell in love with STEEP and couldn't wait for STEEP Creamery to open. Came in today at 2pm for their soft opening with some friends and we were super excited with their newly feature Thai rolled ice cream. \n\nThey use organic Straus Milk infused with loose leaf teas. They offer Thai, Roasted Oolong, Ceremonial Uji Matcha, and Cookie Crush. I didn't want extra caffeine since I ordered for a white cocoa matcha latte so I went with the cookie crush. It was AMAZING! Not too sweet and super creamy. They make their own whipping cream which is definitely a plus! $6 worth spent! \n\nAlong with ice creams, they also offer a variety of bubble tea drinks. From earl grey lavender, uji matcha, mango mousse, to tai guan yin tea. Lots of selections! I'm excited just writing this..! \n\nGreat customer service and will definitely be back!", "author": "Lily X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-15", "description": "This milk tea here is disgusting. I ordered the Legendary Match Milk Tea and added red beans. The tea tasted like water with a scoop of matcha. The red beans are what added the sweetness and made it taste remotely decent.\n\nMy boyfriend ordered the Mango Fruit Tea with coconut pudding. This just tasted like water with a splash of mango flavor. The coconut pudding had the texture of firm tofu. \n\nThe service was good, the employees were very nice and friendly. But the drinks were just really hard to swallow. Do they not taste the drinks here that they are serving?", "author": "Brittany N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Yes this is my second review and yes this is my second time there in a week and i'm going again tomorrow. WHY? BECAUSE ITS DELICIOUS. But really, co-workers came into town and had to take them because they don't know what rolled ice cream is. It was an educational trip. Because there was a big group of 7 of us, we took the opportunity to order all 4 flavors to try. I took a little nibble of eat. \n\n1. Matcha - so you can get this with the ice cream ROLLED into the ice cream or on the side or both. We got it on the side. It was so good, not overly sweet and not overly matcha powdery flavored either. The strawberry and red bean is a great compliment. \n2. MyThai - STEEP has some of the best Thai Tea in town and this in rolled flavor is exactly the same. creamy, again not overly sweet. it comes with coconut pudding and boba. This is was my time having their coconut pudding despite going to their original location forever. I will now be occasionally adding coconut pudding to my drinks. I'm not a fan of coconut but this was not over powering at all. \n3. Cookies and Cream - a favorite of 2 of my co-workers who finished it all. It's pretty much how you would expect it to taste and was just equally as good. \n4. Roasted Oolong - see original review\n\nAlso I'm a fan of their jasmine green milk tea too. Even unsweet, its just enough and you can def taste how fresh the tea is. One point though is that I do wish the coconut and match pudding are a bit more of a pudding consistency versus a harder jello type form. However this isn't enough to dock any stars.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Went here with a coworker to grab some boba.  It was sweet and sugary, just the way I like it :)  I didn't get a chance to try the ice cream, but they seemed to have a good selection and I would really like try the rest of their selection of treats.  I'll be back soon if I need another quick boba treat during work.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "The first time I had ice cream rolls was in SoCal at Chelo, thought it was meh.\n\nSTEEP changed my mind. This place is quite close to my work so we stopped by during lunch for some dessert. We shared a matcha ice cream roll. It came with red bean and strawberry toppings. The matcha is BEST, not overly sweet and just the right amount of matcha flavor.\n\nDefinitely recommend this if you're a matcha fan.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Tea is good quality. For some reason, my Matcha yea didn't taste well :( but other things like Classic Thai and cookie dough ice cream tasted great", "author": "Pranam D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-30", "description": "Service is great. The food flavors are just ok. I've tried matcha, Oreo,Thai tea and oolong tea. I gotta say the matcha was my least favorite even though I'm a big matcha fan. The matcha flavor is lacking. The Thai tea is not bad. My favorite is the oolong tea. Love how they give you unlimited toppings. I like their matcha pudding!\n\nI opted out of the red beans since they are too filling. Don't be afraid to change out the toppings from the suggested toppings.\n\nI love their mini photo shoot area. Very creative!", "author": "Ivy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-12", "description": "I've been eyeing this place the last couple times I was headed to a Giant's game and finally decided to try it. I got the \"Cookie Crush\" which is a cup of rolled cookies and cream ice cream (5 rolls) with cookies and cream whipped cream topped off with an Oreo cookie.. very yummy, although the price may be a little STEEP for some.. $6, it was worth it nonetheless. They have some bar stools in the window and a couple benches for seating, but other than that there aren't any tables. On a busy day you might feel a bit cramped. Simple and modern; I'd go back.", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-04", "description": "I was surprised to see STEEP has expanded and opened another location a couple blocks away! Even better, they sell rolled up ice cream! I think the price for rolled up ice cream is a little steep (har har) especially because you get a smaller quantity. For that price I'd rather get a giant scoop of ice cream. Not to mention that rolled up ice cream is more on the icy-side to keep its consistency.\n\nI think it's really generous of them that they offer complimentary toppings if you ask nicely.", "author": "Janet H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Love the cream top black tea\n\nThe ice cream rolls might be kind of a gimmick but they're fun to watch being made. My kid was enchanted.", "author": "Kate J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-28", "description": "Black sesame ice that tastes like peanut butter. Rock hard ice cream that comes in a flimsy cup. But you have a cool selfie station, that's nice! \nHow come there is no selfie station in your bathroom with NO toilet seat covers. NO paper towels. Overflowing trash can and really love the special touch of all your nasty cleaning supplies thrown in the corner. #notimpressed #ew", "author": "Jess K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Freshly prepared ice cream with tea infused flavors. They don't skimp on the toppings either. I was surprised with loads of boba and mochi in my ice cream. Only wish I can eat this everyday without getting fat.\n\nAlso they have all the same drinks as you can get at the other Steep location. So even if you don't feel like ice cream, you can still get your favorite milk tea.", "author": "Steve M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-26", "description": "Finally! An ice cream and milk tea shop in SoMa. It's become one of my favorite go-to spots in the neighborhood.\n\nRoasted Oolong Milk Tea: By far my favorite drink on the menu and top 5 favorites in the Bay.\n\nMatcha Milk Tea: Matcha can be one of those flavors that can be subtle or weak if not properly prepared but the tea flavor comes through here.\n\nMango Mousse: A twist on the traditional mango sago drink. This one is made with almond milk and completely vegan.\n\nIce cream rolls: If you're a fan of tea flavored desserts, then definitely try the Original Oolong and MyThai. Uji Matcha was a bit bland. They also have some new flavors like Pistachio and Coffee with waffle mixed in.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-12", "description": "I heard from a couple of friends that this place was a must try, especially because they had ice cream rolls designed after hype tea flavors and instagram trends. I thought the thai tea rolls were a bit too sweet for my liking and didn't really reflect the flavors of an authentic thai tea. Even though the main attraction was somewhat of a disappointment, the other side toppings inside were great. I really enjoyed the boba and what I think are mochi pudding squares complementing the ice cream rolls. \n\nBasically, this place has potential. The ice cream could be better but I think I'm better off dropping some $$$ on their tea instead with a good selection of add-ons. The STEEP price for ice cream rolls in my opinion is just not worth it.", "author": "Felix L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "They just opened, but I strongly urge you to try! Sometimes their specialty menu surprises me, as a huge bubble tea fan, I got earl grey milk tea rolls today.\nOne thing I really appreciate is that you got free toppings, definitely try out the cheese cake!", "author": "Para S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Mythai is the best although pistachio and ujimatcha have great STRONG flavors. It was good with yummy toppings although it tasted pretty much like regular ice cream to me. But it was a cool experience and I will try the drinks next :)\n\nThe downside is that it takes awhile to make each individual cup of ice cream.", "author": "Karen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "I don't understand why everyones complaining about their prices?! For $6 you get a full cup of  delicious-ness, packed with organic Straus ice cream and unlimited toppings! If you're comparing STEEP to other rolled ice cream places, WHY? You just can't! They dont use flavored syrup or powder to make any of their drinks and ice cream base. Although portion is smaller than others but they definitely don't charge you $8-$9..! Also they don't skimp out on the toppings when you ask for more too. But realistically this is enough sweets for one person. Honestly, if you go to any other ice cream parlor, they easily charge you $4-$5 for a single scoop. You're getting a deal here! \n\nThey have 4 regular flavors - uji matcha, organic oolong, mythai, and cookie crush. They alter flavors weekly, today they had C+++ (biegium chocolate), black and orange (orange cream). I ordered for a uji matcha roll that paired very well with fresh strawberries and red bean. The ice cream wasn't overly sweet but the red bean gave it a kick to the sweetness, which was perfext! I also ordered for a mango mousse with bubble. Made with coconut milk so completely vegan for the ones that can't drink dairy. It was so creamy and had a great balance of mango and coconut, bubble was on point sweet and good consistency. I could drink one everyday! \n\nI'm so addicted to you Steep!! Can you please open more shops!", "author": "Stella L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "$6 is what I paid for my frozen concoction. This price is considered a bit high but you're paying $6 for the novelty of the ice cream rolls and you're paying for quality ingredients. I saw that they use Straus (milk? cream?) in the ice cream base. They make their ice cream bases fresh. I've been here a few times to see if there are any different flavors. I've seen pictures of various flavors and it seems that the flavors will be rotating. I've tried the thai, oolong milk tea and the matcha ice cream rolls. I like that you can add additional toppings (for FREE) and can make some substitutions/changes to your order. \n\nMy favorite one so far has to be the oolong milk tea. You can definitely taste the tea flavor and it is heavenly! (What do you expect when the shop sells tea as well?!) I would totally pick up this flavor if it somehow made its way to the frozen aisle at the supermarket -- it's that delicious! \n\nFor the matcha flavor, you are able to have the strawberries mixed in. I find that it tastes better with the strawberries not mixed in with the matcha. I love that this one comes with red bean. I was able to add mochi to it and it was so yummy! \n\nOne of my few gripes with Steep is how crowded it gets in the afternoon. WHY MUST EVERYONE COME OUT FOR A BREAK AT SAME TIME AS EVERYONE ELSE? However, I shouldn't be too surprised by this, considering the location of this shop. We were lucky the few times we visited because parking wasn't too difficult. \n\nOH and there's an adorable photo booth with succulents!", "author": "Jay Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "I've been here several times now, every time I'm pretty much back here for their matcha latte. I have searched far & wide for a tea spot that can make one that rivals Intelligentsia's in Silverlake District in Los Angeles. \n\nMy boyfriend also is a fan of their rolled ice cream. We've been to Chello in SoCal & Icicles in San Jose and we both definitely agree that we like the rolls at STEEP the best, by far.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "Delicious new take on ice cream!  The pictures will show you everything you need to know :)  Plus they have the usual selection of bubble milk tea.  Really friendly staff.\n\nLimited seating inside.  Come on a nice day and bring your ice cream or drinks a block away to nearby South Park (in the block surrounded by Bryant, Brannan, 2nd, and 3rd).", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Favorite rolled ice cream I've been to! They're also open pretty late, which is cool for a late treat. I really enjoyed the My Thai and the Matcha Green tea! Highly recommend coming here for rolled ice cream & a good place to hang out :)", "author": "Lexy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "I don't give out 5 star reviews but this one is worth giving. I rode Uber all the way here so I'm pretty excited. I bought the Thai Tea ice cream roll with boba and mochi. It was really good. The boba was so soft. It felt like a party in my mouth. The mochi was really good and soft. The ice cream was really good and cold. It tastes like actual Thai Tea. Overall, I will definitely be back! It was worth the Uber ride!", "author": "Jonathan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-14", "description": "All the flavors are good and tested by the owner before putting it on the menu. Fast service but no parking during baseball games. All ingredients are fresh and its not too sweet. Must try all the flavors!", "author": "Jan H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "Something different... kids enjoyed seeing their ice cream made. Liked that you can add toppings for free. Ice cream flavors are good but they need to add more (flavors)", "author": "Angel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Great boba and rolled ice cream shop, conveniently located in SoMa.  \n\nI haven't tried their rolled ice cream, but their boba's pretty good.  Their tea tastes refreshing and they have a nice rotating selection of flavors (a couple rotating for the season, the rest stay constant I think).  \nThe store's well lit and has a nice area to lounge and look out at the street.  It's also very conveniently located for any other tech workers around AT&T park.  Bonus, they've got a light box, so you can take your fancy instagram photos with some props and nice lighting :P", "author": "Keith C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Thai styled rolled ice creams? Yes please!\n\nTried the oolong and matcha and they were both delicious! They were about about $6 each and they offer some additional free toppings like mochi or cheesecake bits (it changes)!\n\nI also wanted to try the pistachio but when I went there they did not have it anymore (they changed it to cereal). Hope it'll come back!", "author": "Janet K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "We tried the strawberry cheesecake and cookies and cream. Ordered for take out and walked it home about 3 blocks. It survived the walk and stayed fresh the next day in the freezer. Not too sweet and fluffy texture! Will be back soon.", "author": "Maria C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Went with a few friends, and everyone was pleasantly surprised. Maybe hand rolling ice cream is actually a functional trend. \n\nTried all the base flavors and they were all really good, so comes down to your personal preference. Obvious favorites are thai tea and matcha flavors, but if you have a thing for pistachios, then i'd say definitely try it.\n\nI don't have the most effective palettes, but the difference between rolled ice cream here and regular ice cream is obvious. Flavors are more intense and the texture is much creamier. \n\nBottom line is glad i tried, and would go back.", "author": "Davin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Boba in this place is insane. Pretty silky and smooth. I always get the plain black with 25% because I can't handle too much sweet. \n\nThe service is amazing. I placed a wrong order last week and the owner switched for me at no cost.\n\nThey also have a loyalty program where you get 1 free after 10 purchases!\n\nHighly recommended", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "Finally got around to trying to place before a ball game. It wasn't packed when I visited but i heard there's normally a line. I can see why. Their ice cream is good and flavorful. I got the Original Oolong, which has Oolong Tea ice crea, with boba and herbal jelly. Yes, super asian, but I'm a sucker for ice creams with tea flavors, mainly because it's really hard to find a place that actually makes it well. Steep makes this very well; you can actually taste the tea in the ice cream. \n\nThe only thing to be aware of is that the ice cream is really dense, so it feels heavier than normal. I shared with someone and it was the perfect amount.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "The coffee meets waffle icecream is SO good and you can add as many of the toppings for free as you'd like (mochi, fruit--though I wouldn't recommend it for this one), cheesecake bites, etc). The oolong icecream was good but compared to the coffee, the flavor was REALLY light...almost to where you couldn't really taste the flavor.\n\nThere wasn't really a line when I came which made it great but even without a line, the icecream DOES take a while to make. If there were a long line of people, then I would understand why people get annoyed on why it takes so long just to get something like icecream.", "author": "Diana Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "Earl grey lavender is caffeine free and SUPER delicious!! :)\nRolled ice cream is also absolutely stunning; the consistency is pretty thick though", "author": "Frances W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "It's really fun to watch the ice cream being made! Fun spot to take friends, and the flavors are really yummy (we've tried the Thai Ice Cream and the Cookies n Cream). Between those two, the Cookies n Cream was really delicious! \n\nThe ambience is really nice and fresh, and usually the wait isn't too long. They have benches outside which my friend and I sat on. It was great because we saw so many cute dogs pass by.", "author": "Priya B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-30", "description": "Only stopped here for some tea on a hot day.  The place was a little difficult to find.  Also be sure to check their hours as the 2 locations have different hours and aren't really that far apart from one another.  Just make sure you're going to the right one!  Anyways, this location is really nice, a small amount of seating available.  The place was pretty busy, but most customers were just waiting for rolled up ice cream.  Decided to just get some tea since I didn't see any pitaya or acai at this location.  The mango tea was refreshing.  The mango puree tasted very fresh, it was on the sweet side.  However, it didn't really mix that well with the tea, overall still a satisfying drink.  I'll have to come back again for the ice cream, just keep in mind that there might be a wait for it depending on how busy it is just because it takes so long to be made.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "I got matcha roll ice cream that was great. Also, on top with moji, red bean strawberry and chocolate.", "author": "Pinarat S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Yummyyyy! Loved their ice cream  I feel like trying all the flavors! And next time will try the tea.. a good thing about the place is they open till late hours as well.", "author": "Alia K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "This whole place was very aesthetic!! I came here at 3pm and there was no line. I ordered the my Thai since everyone claims it to be very good and the Jasmine milk tea with boba. They made my ice cream right away but the cup size was very small and I noticed there was only 5 rolls in the cup. Considering that I paid 7$ for rolled ice cream I thought I could pick out my own toppings. The ice cream rolls came with coconut pudding and boba. After I finished my ice cream I threw the rest away. Wasn't impressive at all. I would just go back to icicles again LOL. However my brother loved his Jasmine milk tea with boba.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "I've been to the other STEEP location before and enjoyed their teas, so I thought I'd check out the Creamery location during my spare time! This location also does teas, but I think the main appeal is their rolled ice cream. It was my first time getting rolled ice cream so I was looking forward to it.\n\nI got the strawberry cheesecake flavor, which has cheesecake incorporated into the ice cream and is topped with cheesecake bits and strawberries. The serving is very reasonable and they give you a lot of toppings! My friends got a cookies and cream flavor, and we all agreed that the strawberry cheesecake was better. The ice cream was pretty creamy and thick, but I'm pretty sure that was because of the cheesecake in the ice cream and not necessarily because of the actual ice cream.\n\nI also got the earl grey lavender milk tea (50% sweetness) for later to have and I have to say, the flavors were a bit too strong for my liking. There was too much going on. I'd pass on this one.\n\nOverall, I liked it and I'd come back again if I was in the area, but it's not something I'd crave and/or go out of my way for. For now, I think I'll continue to go to the original STEEP location since I think they do teas better.", "author": "Trisha V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "I was excited to see that there was one of these ice cream roll places right in SF so we could try out the new trend-- the fact that it was tea-themed was just even better! The employees were incredibly kind and friendly. When we visited, there were twins who were rolling our ice creams side by side at the same time which was so fun to watch! They gave us a little extra ice cream in a cup that didn't quite make it into perfect roll formation. It was a lot of ice cream! And they were generous on the toppings. Definitely a fun place to check out near AT&T park. Also, I love when boba places let you select how sweet you want your milk tea to be- 25% is just perfect!", "author": "Suzi P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Iced drinsk only come in 24oz/ $4. Pretty good value compared to boba guys. The boba is not as soft as boba guys i will admit but I enjoyed the coffee base in this one more. I like that they didnt overload my drink with ice", "author": "Song K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "First try, pretty yummy. Had Earl grey lavender tea with boba, Jasmine tea with jelly, coconut ice cream (extra fruit), strawberry shortcake (extra fruit) + uptown (mochi + almond flakes). All were delicious. No disappointments. Love the FREE toppings option.\nOnly thing I would say is to have some lower tables/chairs to make it more kid-friendly (safety).\nWill definitely be back!", "author": "s t."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "They have ice cream rolls here! All the rage. \n\nHigh quality boba too. Really cute interior.\n\nAll good portion sizes.", "author": "Charles C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Ice cream rolls in SF?? Count me in! :)\n\nWhen I had my first ice cream rolls at Chelo Creamery in SoCal, it was a huge disappointment. Chelo's ice cream rolls fell apart and the flavors were just not there. But after having the ice cream rolls at STEEP, everything was perfect. We had the MYTHAI & UJIMATCHA ice cream rolls. The MYTHAI had thai tea ice cream topped with boba and coconut pudding. The UJIMATCHA had matcha ice cream topped with fresh strawberry and red bean. Each ice cream roll was made to order. Both ice cream rolls came out in perfect rolled shape. It also did not melt that fast too! Both ice cream rolls were creamy, smooth, and flavorful. I loved how the ice cream were not overly sweet. The toppings complemented both ice cream rolls perfectly. (PLUS, you can add more toppings to your roll as they have unlimited toppings.) They were refreshing, delicious and perfect for a nice warm day in SF. I'll definitely be back here when I have ice cream rolls craving. :)", "author": "Philana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Love this new rolled ice cream! Definitely would recommend going to try this even though it is far! Love the flavors they have and the place is super cute!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "I just so happen to be in the neighborhood and wanted to try them out. I ended up getting the Mango Mousse drink. The cost was a bit pricey ($5) but it's what I'd like to say a speciality drink and a treat. I wouldn't get one everyday since that would be such a total waste. I would go back to try something new. Definitely worth a try.", "author": "Cynthia L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "This takes the smashed up cooked-in-front-of-your-eyes Cold Stone concept to the next level. Pouring milky ice cream in liquid form onto a cold stainless steel surface, the ice cream and its mix-ins are crushed, stirred, and folded over and over again. The resulting mix is smeared evenly across the countertop in front of your eyes and sits for awhile (allowing you to set up the perfect instagram story documentation) and cools until it hardens into ice cream form. They then carefully scrape the ice cream into 5 rolls and then put them into a bowl before adding toppings. Super awesome perk - toppings are free! Choose from chocolate shavings, cheescake bits, mochi, and/or fresh fruit. Luckily I was the only person in the store at the time, so there was no wait, but I imagine the line could get pretty long if they're busy since each roll takes at least 5 min to make since the liquid has to set for awhile, and there's only 2 countertops made for the rolling. \n\nStrawberry cheesecake + fresh fruit + mochi 4/5: solid strawberry ice cream, definitely more flavorful once the rolls melt a bit. Topped with a ton of fresh fruit and chunks of cheesecake, this was a great concoction, not too sweet. Mochi was kind of chewy and harder than I'd have liked, but maybe this changes from day to day.\n\nChocolate sundae 3.5/5: with the chocolate whipped cream and chocolate shavings, this was a little bit too rich for me. Would have opted for some other toppings to mix in, but nothing on the menu sounded like it would have made for a good match - except more chocolate shavings.\n\nThe novelty of this ice cream made this super exciting for me, but the people who work there definitely expect you to Snapchat, Instagram, and further document their ice cream rolling. They were even filming their rolling technique when they made my ice cream. There's a corner for you to photograph your ice cream rolls in front of a white backdrop with their hashtag #steepup. Perfect setup for all your social media needs. \n\nSuper clean, super modern, will be back for the milk tea drinks, hoping this is a solid SOMA boba joint as well.", "author": "Kathy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "This place is right by my office so I probably go here too often now. I went originally because it's the perfect combo of boba (which I can't get enough of) and something new I figured I should try (ice cream rolls). They're not really that different from regular ice cream as the rolls start to melt pretty quickly, but it's fun for a moment. I just love the feeling that they're turning the milk tea into ice cream, which may or may not be the method, but the flavor of tea is definitely as strong as it is in properly brewed milk tea. And I LOVE tea flavors in ice cream! It's fun to have so many to try here.\n\nI wasn't a big fan of the pistachio, which was disappointing as that's also often one of my go-to favorites. HOWEVER, the Thai tea is total winner. And the special they had for taro is that rare flavorful taro that's not relying too heavily on sweetness to carry it.\n\nNot the friendliest bunch, but orders come out quickly enough. Just make sure you get your extra free toppings if you order them as they sometimes miss adding them to the already full bowl. When mochi is a free topping, it's really sad when you've already left and realize you didn't get any :(", "author": "Shawna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "I had never tried rolled ice cream prior to STEEP, but it was delicious! I ordered coffee with mochi for a topping. It was $8. The coffee ice cream rolls came with some waffle bits which gave the ice cream a nice little crunch. I'm not sure if I'll ever get rolled ice cream again, but I'm glad my first experience was at STEEP.", "author": "Nasrin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "It was my first time to come to this ice cream store, and I love it! I chose myThai ice cream roll and my friend chose Oolong, both tasted good. Recommended!", "author": "Jenny M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-16", "description": "Good but nothing super special. I got the Thai tea with bob at 25% sweetness. It was plentyyyy sweet, I can't imagine who would ever order 50-125% sweetness. The interior was cute but really small and I couldn't find napkins anywhere, which was weird.", "author": "Sara T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "What we finally have rolled ice cream in SF??? Yes that's right so you better roll over here. I've been waiting for this day to come since rolled ice cream is such a big thing in SoCal and other parts of the Bay Area. It was about time SF brought rolled ice cream and STEEP did that. Steep usually serves drinks/pitaya/acai bowls but now they expanded to tea infused rolled ice cream. Their new location is in a really quiet area as well as it being hidden. Their menu don't have many flavors yet since all their flavors are supposed to be \"tea infused.\" I got the oolong rolls since I never had milk tea flavored ice cream before which sounded really interesting. They have three ice cream machines but they were kind of understaffed during the time I went. Upside is that this week only, you can add as many toppings you want at no additional cost. Steep's boba never disappoints and their homemade grass jelly & coconut pudding is amazing. They even have a little booth for you to give the food a photo shoot which I think is another step up for Steep. Come and give the oolong a try, it's so good you might even get another one after.", "author": "Lisa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "Interesting ice cream and tea shop - came here with a friend to try out their rolled ice cream. I ordered their matcha ice cream, which came with some blueberries and strawberries and some mochi bits. The concept of the rolled ice cream was very interesting, and the flavor of the matcha was decent, but I guess I'm just not used to the hard texture of the ice cream and prefer  softer and fluffier ice cream. Also adding the fruits felt a bit off and the flavors didn't mix well with the matcha. Overall a decent try. The price is pretty expensive ($6 per cup) for what you get.", "author": "Alvin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "Amazing ice cream created in a very unique fashion (with names of dishes any developer would love). Try the C++ w/ fresh berries! 10/10 - would recommend.", "author": "Daniel B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-23", "description": "Ice cream isn't very good and the boba addon was vile. It was fun to watch them make it, but the end product wasn't worth the effort.", "author": "D K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "Pretty disappointed with their Jasmine milk tea. Seriously lacked the pleasant, floral scent and taste that makes jasmine milk tea so amazing. The tea taste was strong, but on the bitter side. The sweetness was uneven... strikingly sweet in the beginning and the end. The boba texture left some to be desired... it was too hard in the middle. Overall, definitely have had better jasmine milk tea in the city. I'd still give it a chance with roasted oolong tea, but overall, I think this place invests much more in their rolled ice cream, which I still need to check out.", "author": "Ke C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "I ordered cookie crush ice cream roll. The ice cream was ok but let it melt a little before you eat it", "author": "Cameron M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "I guess most reviews here are about their ice cream rolls? But for me, I tried it (elsewhere) and never got into that hype. So, I ended up just getting tea instead. \n\nI really love Earl Grey so I ended up getting the Earl Grey lavender latte since it was cold and rainy that day. I also got a Honey Green Tea for my friend. Both drinks were delicious. I do wish the Earl Grey was a little stronger though. But it was still very good and it definitely earned me up. The Honey Green Tea was refreshing and tasty. \n\nOverall, great spot for a quick boba/tea fix. I guess I'll try their ice cream rolls next time?", "author": "Wendy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Very cool and nice place to chill and eat some ice cream. Never had rolled icecream before and this was definitely a good place for first timers. Highly recommended.", "author": "Tina L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Went here on the way home from the city.  I was finally able to experience the notorious ice cream rolls that you see all over social media.  For what you get, it also isn't too expensive.  We were also able to find parking fairly easily.", "author": "Madelyn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Really good. Good ingredients and nice photo booth for food. Cookie crush is the way to goooooo! Icicles in SJ is like a 2 hr wait! Just come here before it gets too popular.", "author": "Andrew E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "This place is poppin!!!! On this visit I ordered the milk green tea and their oolong ice cream -both were amazing. Ice cream rolls were on point and the toppings they suggest just works. The tea is high quality, the taste is just right, not overwhelming and none of that watered down BS you get at just about any other boba spot. Their boba balls are delectable. Every ball has just the right chew with a hint of sweetness, it is so beautifully balanced as if they handcraft each boba individually which is out of this world but isn't totally unbelievable considering the thought and attention that's demonstrably given to everything from the warmth of their lighting to the way the sugar packets are organized -these people know what they're doing and they do it right. I also love that they are a small, San Francisco-based shop run by hardworking locals", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "I came here for the rolled ice cream but have been coming back for the milk tea. Don't know if I'm sold on the rolled ice cream novelty - it was cool watching them make it and it is nice treat, but I guess I prefer the traditional scoops of ice cream. Good to try at least once though! Some yelpers complain about the price but I think it's reasonable considering the quality ingredients they use and the free extra toppings.\n\nI've been here a few times already just for milk tea. I just get the plain black with boba and less sugar. Boba is on point - soft and chewy. I'll have to try their other drinks next time. I'm happy that there's a decent dessert place in the neighborhood now.", "author": "Zell C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "Their strawberry cheesecake rolled ice cream just melts in your mouth. Portion sizes are huge, as the ice cream is a little pricey. But definitely go - its an ice cream making experience and an amazing dessert place!", "author": "Tejas G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Delicious boba tea and ice cream. My favorites are the Coffee Milk Tea with cream top 50% sweet and Earl grey lavender 25% sweet (no caffeine) all with boba. Definitely recommend making a trip here. Can't wait to try the ice cream when it's warmer. \n\nJust wish they were open earlier on the weekends!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-15", "description": "Finally tried this place. Earl Grey Latte was good, not too sweet, just how I like it. They also have rolled ice cream with unique flavors. Will try that next time around when in the city again.", "author": "Rose T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-17", "description": "I tried icicles before, compare with icicles, I prefer icicles than steep. But considering in san francisco, steep is good choice to give it try.  highly recommend to try rolling ice cream, Uji matcha is okay level, the milk-taste is heavy, covered matcha flavor.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "definitely came here for the snapchat and insta post and doesn't hurt that I am a HUGE ice cream person as well! I got the thai rolled ice cream and my boyfriend got the cookies and cream rolled ice cream and a honey green tea. The tea was definitely the best thing we had and I highly recommend it. The ice creams were great but definitely better for the insta! Will definitely be back though to try more of the teas and ice cream :)", "author": "Rachel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "(4.5 stars) They have three vegan options and non-dairy milks (+.50) for their milkteas. They have a vegan roll up ice cream thing that is coconut based with mango and some other toppings; I think that's the first vegan option for rolled up ice cream I've found! They also have these two drinks: mango purée + coconut milk + raw sugar and taro +coconut milk + raw sugar. I got the mango one with boba and 75% sweetness and it was veryyyy sweet...(maybe because the boba is sweetened) so I would get 50% or even 25% next time! Anyways, cool interior and friendly service. If you take the N metro all the way to Brannan st, it's just a few minutes walk to STEEP!", "author": "Erika W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-01", "description": "We ordered the oolong ice cream and green tea ice cream.  Both were excellent in a way that they taste like they are supposed to.  Woman behind the counter was very nice.  The place has high ceilings and was clean. Hopefully they can keep up the quality. So glad this place is walking distance from my place because it's hard to find boba tea in the area.  They were also very nice to my dog.  He got a dog treat.", "author": "Urban E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Good vibe, limited seating. But it's always fun to watch roll up ice cream. If you ask nicely, they can add fresh fruit with no additional charge to your ice cream:)", "author": "Emily L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-31", "description": "Their taro drink is not fresh, they are made with sweetened taro paste. Even when I ordered 0% sugar, it tasted like 150% sugar. I asked them to make it less sweet but they said they couldn't do anything because the paste is sweet. Don't write that it's fresh if it is pre-made paste. I wasted $6 on this.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-20", "description": "Pros: Ice cream itself is not  sweet. Generous toppings. Clean environment.\n\nCons: All they did was just pouring the ice cream base onto the freezing slab and rolling it. Then, they added toppings ON TOP of the ice cream rolls. I expected ice cream base+ toppings being chopped and mixed well on the slab and rolled, just like how you and I saw on the viral ice rolls videos! Hello-- this makes your ice cream rolls not so different from what other regular ice cream shops do! What's the point of getting ice cream rolls if you aren't going to mix toppings on the slab? If they change the way of making ice cream rolls and they do it RIGHT, I am willing to visit again, though.", "author": "Amelia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "I ordered My Thai which Thai ice tea flavored ice cream roll.  It comes with boba, homemade coconut pudding, and a free topping.  I added strawberries.  Really friendly staff and clean chic little place.  They have a little photo shoot set up for your ice cream rolls.  I will come back to try other flavors.", "author": "Klo H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-08", "description": "Nice little place. The earl grey milk tea snow rolls are really good though I don't think I would've put fruit topping on it. The strawberry tea is quite refreshing but not very sweet. The matcha strawberry lemonade has an extremely strong lemonade flavor though. Couldn't taste anything else.", "author": "Gayle Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "I got the matcha with red bean and it was pretty good. Although the more I think about it I don't think I tasted much tea ? Anyways I think the service was friendly too. It's located in a hipster neighborhood. I feel hip.", "author": "Vincent L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Soooo good! I've been craving this type of ice cream for months now after watching so many videos of it online. And after visiting San Francisco, I found this place and I'm so happy that I did! We ordered the Thai tea and coffee crush - both amazing!", "author": "Andrea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Very good milk tea (black) at 50% sugar. Their tofu pudding is an interesting topping: a bit crumbly, but tastes great, and the texture is nice in milk tea. I also tried their matcha rolled ice cream, which tasted fine but was just too tough for my taste---the opposite side of the ice cream texture spectrum from, say, the matcha soft serve at Uji in Japantown.", "author": "Blake A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "So glad I found this place! My friend and stopped by here on a Saturday night after dinner. The matcha rolled ice cream was very refreshing - not too sweet and didn't taste powdery. It came with massive amounts of fresh strawberries and red bean as toppings. Steep is less than a 10 min walk from the Caltrain station and I would highly recommend anyone to stop by for a quick snack", "author": "Sherrie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-24", "description": "Fun for kids to watch them make the ice cream. Love the free toppings (who doesn't want mochi in ice cream). Very generous portions. In the end, the texture is not as creamy as I like, but it's still good ice cream (very Asian focused flavors like Thai tea, matcha, black sesame).", "author": "B. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "Affordable boba shop just opened up by my apt! So excited as there aren't a ton of good food options around to begin with. Service is great, had the rolled ice cream and boba and it was all delicious! Worth a try", "author": "Holly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-14", "description": "I was really intrigued by their ice cream rolls so I tried the root beer special - yummy!  I liked the unique whipped cream on top, although I wasn't sure how to eat the ice cream rolls (whether to pick up with my hand or try to cut it with spoon).  Eating was a little tricky although when it started to melt was much easier to eat.  Would like to be able to mix and match ice cream flavors (half & half flavors) so hopefully they will do that in the future.  I also ordered the organic honey chrysanthemum iced tea and to be honest it tasted medicine-like so wasn't a huge fan of this tea.", "author": "Terrie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-02", "description": "My friends and I agreed that the strawberry cheesecake flavor is the best one!!! I also tried the thai tea one and the oolong one. My group and I didn't love the Thai tea flavor - it tastes exactly like the drink but it just didn't mix well with the toppings she got. The oolong one was good too - it REALLY tastes just like the tea!", "author": "Sophia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-13", "description": "Pretty bland not worth the trip. Service was good and it was crowded but eh no thanks", "author": "Chanell S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-09", "description": "Good value ($6) and good flavor-got the pistachio one. Can't wait to come back to try uji matcha. Also love that we got there around 9pm on Saturday and there was no line. Hated that I had to wait about 1 hour at Icicles in San Jose for the same thing.", "author": "Mengyuan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "Have tried it a couple of times now...and it's meh.  The boba is just a touch undercooked. The flavors are not as intense as at other places.  And though it looks nice because it's so new, I've walked in and there's boxes piled up against the walls and drink prep area is not that clean.  Hopefully these are just start up issues cause they're so close to my work!", "author": "Monica K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-20", "description": "Cool concept and great toppings! It's a little pricey but worth the experience. Much creamier ice cream than you'd expect.", "author": "Maegan P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Love the options that they have for their ice cream toppings! Boba, grass jelly, mochi and coconut pudding!?! Their ice cream was also really good. I was going to say the only downside is that they close early (was 7PM I think) but I just noticed that they extended their hours!!!", "author": "Karen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "STEEP Creamery and Tea, not to be confused with STEEP on Ritch St, is a small, clean, modern chill spot for your ice cream and boba fix.  If you're really into ice cream that tastes like the real Thai tea, matcha, oreo, and black sesame, I would recommend coming here.  It's not as sweet as usual ice cream.  They hand roll the ice cream in front of you, and although it doesn't look like much, it is enough to get by ;).  I give this place four stars for their ice cream taking on authentic flavors, since it isn't like the usual green tea or Thai tea mixed with vanilla.  Sometimes they have specialty flavors like.peanut butter toffee, and on their current menu strawberry cheesecake. Unlimited toppings!  You can actually taste the flavors, and... It doesn't melt too fast, so enjoy. I would definitely come here to try the other flavors, but for me it might be a one hit wonder kind of place.  Nonetheless it's worth coming to try all the flavors and you'll see that they use actual ingredients (strawberry preserves in your strawberry cheesecake).", "author": "Janet T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-03", "description": "Love love the matcha flavored ice cream! Flavor is on point. My boyfriend ordered the cereal flavor (I forgot the name) and it was good too, tasted like capn' crunch. You can also add toppings that are listed in their menu for free. The price for the rolled ice cream is $6.", "author": "Rachel A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "I'd have to say this is one of the best ice cream spots around the city.  You have to try the my Thai!!", "author": "Vivien K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-08", "description": "Majorly disappointed . My jasmine milk tea was water downed and bland. And for $6 bucks ? No thank you. I'll give a star for how clean and nice the place looks though.", "author": "Phuong V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-15", "description": "Not really sure how this place has 4.5 stars. Ordered a mango fruit tea from here to try it out. They say they it has mango purée in it but the tea is bland and tasteless. I was expecting somewhat of a smoothie texture, but it looked like there was maybe 2 drops of purée inside. The coconut pudding add on also looked and tasted like it was tofu in my tea. Bland. If you like tasteless bland tea, you'll love this place.", "author": "Kelvin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "This is a very sweet small shop. The employees are very kind, warm hearted and friendly. The ice cream and tea were very delicious. If you are looking for a cute, casual spot for a treat, with kind and curious employees, this is the place for you. I would highly recommend visiting Steep Creamery & Tea.", "author": "Kylie J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-02", "description": "I had the MyThai ice cream rolls and the Earl Grey Lavender milk tea. I didn't care for the coconut pudding in the MyThai as I'm not a huge fan of coconut however the ice cream was delicious. \n\nThe Earl Grey Lavender milk tea was disgusting and I almost spat it out because the lavender was so strong.", "author": "Laura G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "It's good. Not a lot of flavors but good if you like teas. Only bad part is the wait. Ordering is quick, but waiting for your rolled ice cream is painful. There was no line to order, but a long long que to wait for your order. Waited 30 min to get it.", "author": "Juliet S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Not bad! It was my first time trying this ice cream trend. I got the My Thai--3 rolls of Thai tea ice cream with some kind of jelly/pudding and a LOT of boba. I got the free toppings mochi and cheesecake bits. Total came out to $6.00. My friend got the Cookies and cream one which also had 3 rolls of ice cream, mini Oreos, and whipped cream. Found metered street parking on a Wednesday afternoon, and there were a lot of people waiting when we got there. It's a small place--no tables, just a couple benches and some stools.", "author": "Shar Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "I've only tried the boba and the mango tea so my five stars for those two gems. It's right under our building so it's really hard to resist.", "author": "Pawanpreet G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-09", "description": "Yum! For those that like to taste TEA  in their boba, this is the place for you. \n\nOne star off for how long it takes for them to roll ice cream. Delicious though ;)", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "It was worth a try, but I don't think I'll come back. The whole vibe from the environment and the staff was just, cold. The place is in an office building and didn't look like it was meant for food service. The most flavorful ice cream was the oolong. The customer service could be better; it seems like no one smiles--like no one actually likes working there.", "author": "Sav D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "I got the cookie crush with cheesecake bites and dark chocolate, and let me say it was amazing. A fun dessert for all to eat and just as delicious. If you want a great sweet bite this is the spot.", "author": "Aneal V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "I love this place so much I go there pretty much every single day of the week! They remember my name and they remember my order! Their drinks has always been really good, and the quality never changes, which means you get an amazon drink every single time! Their ice cream is also really good, the strawberry cheese back ice cream has tiny bits of cheese cake inside! Try their matcha red bean milk tea, and their uji matcha ice cream!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Steep creamery is pretty decent. Tried their Thai tea and their Taro ice cream rolls. Very decent amount and the ice cream is really good especially when it is on a hot day, it's very amazing when you add milk tea a long with it too. OH YEAH! Don't forget to add mochi and fruits! That is the best part of the rolled ice cream! So why 4 stars? The line is way to long and there was only 2 people working that day. Other than that, I love this place a lot.", "author": "Clayton L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Yay rolled ice cream! I've had rolled ice cream at other places that just kind of taste like regular ice cream. I got the oolong flavor here and it's got va really good tea flavor. The ice cream was a little harder compared to others so it gives it a bite vs just tasting like regular ice cream. I was worried the toppings would be hard, but the boba and grass jelly was really good with it. The drink was ok though, they had crystal boba though which I've been craving a lot lately. I'd come back if I'm in the area!", "author": "Katherine T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "Probably more known as an ice cream place, but my first order here was the Earl Grey Lavender milk tea with crystal boba. I'm usually super pumped about lavender flavored things, but can't say I'd recommend this drink since it tastes like lavender detergent with a tinge of the bitterness from milk tea. Maybe the ice cream is more exciting.", "author": "Sharlene T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "This is a great addition to the neighborhood.  The shop is very clean and it is fun to watch the ice cream being rolled.  I tried the cookies and cream flavor, with some fruit topping.  Very good!", "author": "Katie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "I was a big fan of their first location, but to add some more specialty drinks AND rolled ice cream? I count resist but go during day 1 of soft opening. The rolled ice cream was delicious. I got the matcha with the strawberries chopped into the ice cream. Will be back soon", "author": "Emily L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Delicious rolled ice cream- fresh and intense tasting. Toppings were yummy, too! I'm worried for my waistline now, as this is very close to home. Next time, I'm getting boba milk tea.", "author": "Nivy G."}
