{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-13", "description": "We came for dinner around 6pm on Saturday and got seated right away. For how delicious this place is, I was surprised the place didn't fill up completely by the time our meal was wrapped up. We'll definitely be coming back! \n\nThe Good: \nBanchan was amazing. I'm picky about kimchi and Stone Bowl's kimchi was perfect. It was sour/umami, not watery. It was crunchy & fresh, not soggy and mushy. \n\nWe ordered several variations of the soft tofu soup bowl, and all were equally amazing. My favorite was the beef tofu soup with mushroom as an extra add-on. While this didn't take away from the tofu soup, I was disappointed that they don't seem to do different levels of spiciness. Even though I requested spicy, it came out mild. It also wasn't salty enough but adding a little bit of soy sauce from the condiments on the table fixed that. Nonetheless, it was so good that I'd come back and order the same thing again! \n\nThe kimchi pancake was also a favorite at our table. \n\nI couldn't tell if it was because the tofu soup was particularly hot or if the restaurant is just warm, but I was definitely feeling uncomfortably hot by the end of the meal.", "author": "Yuchen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-10", "description": "Another delicious restaurant that's located only a block away from SF's place, we like to walk over here when we're feeling lazy and want some Korean food and side dishes. Unfortunately, this place is a little on the higher end price-wise, so we only come here so often. It's a very clean restaurant with a beautiful interior. I feel like they had an uplift with furniture and paint inside recently, but can't verify that. \n\nTheir side dishes are pretty good, usually it's the kimchee, radish, broccoli, and fish cakes. The waitresses are usually pretty nice about refilling it if you want extra. I usually order their spicy pork with rice on the side and it's nothing special to any Korean restaurant standards but very good. Their bibimbap in the white bowl is a healthy alternative to their stone bowl version. It's interesting cuz they had kale in it but it mixes pretty well with the rice, egg, and other condiments. Their army stew is great on a cold SF day to warm you up. It's your typical bowl with spam, noodles, and rice cakes. If you're in the area and craving Korean food with the notion already that you'll be spending at least $20 per person, try this place!", "author": "Ada C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-05", "description": "I found this place through Yelp. The six of us were seated quickly on a Saturday night around 6:30pm.\n\nWe ordered the following:\n- Soft tofu stew: my favorite! The tofu is soft and flavorful and I cannot get enough broth. Tastes perfectly with white rice. You can choose it with mushroom, kimchi, beef, seafood or combo\n- Army stew: hodge pot of ramen, ham, sausage, kimchi, etc. A little spicy\n- Bimbimbap with vegetables: you need to add some hot sauce for flavor\n- Spicy pork: I did not try\n- Rice cakes under appetizer\n- Seafood pancake: I was a little disappointed because the pancake is not very chewy or crunchy. It is more on the soft side\n\nService was ok. Our waitress checked in us once during the meal and that was all.\n\nI was disappointed at the side dishes for both quantity and quality. Of course you can ask for more but if there were only three tiny pieces of broccoli for a party of six, you may feel my feel. The flavors were not outstanding as well. I love Korean side dishes but this place did not give me a reason to strengthen my love.", "author": "Sunny X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-05", "description": "The best part was how their stone pot tofu soup came out bubbling hot and stayed hot throughout the meal. It pains me to give any Korean place 3 stars but I wish they could do a bit better with the soup flavoring. Typically they will ask you how spicy and they didn't here. Plus they don't offer the croaker fried fish. \n\nThe side dishes were fine. Nothing amazing but no complaints. If I still lived in the Haight, I could see myself eating here a few more times but it's not worth the trek right now. \n\nVery friendly staff and responsive. The restaurant is spacious, had a tv and there's a really large central table for large groups.", "author": "Young Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Not sure how long this spot has been around, but it was decent! The prices were a bit high, but normal for what I've come to expect in San Francisco. I ordered soondubu, and other people in our group ordered \"army stew\" (which was enough for 2 to share) and ddeukboki. The service was friendly, and they refilled our banchan multiple times while we were eating. I wouldn't go out of my way for this one, but if you're looking for an easy dinner in Duboce without a wait, this place might be a good fit for you. Was pretty empty on the Saturday night we went in.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "Big fan. I love soft tofu soup and this one was great. It was quiet for a Saturday night, though we got there late (9pm) plus it was st Patrick's day so most people were on liquid diets. Either way, I love me a nice quiet restaurant in the city. Also really cute inside. \n\nI got the kimchi version of the soup. It was more tofu heavy than anything - lacked some broth and other veggies etc. but overall very tasty. I asked for ramen noodles on the side which I was pleased about. \n\nFood was fairly quick and piping hot. I'll be back!", "author": "Kelly G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-12", "description": "Had a fairly yummy dinner at Stone Bowl Plus. Came on a Saturday night around 7pm and it surprisingly wasn't crowded. We ordered the Jap Chae which we thought at first was a bit pricey considering the serving size, but it was yummy enough to feel worth it. We also got a bibimbap with spicy pork (delicious) and the kimchi pancake. I found it a bit greasy but my boyfriend absolutely loved it. Service was very friendly and our water was always filled. All in all a good meal!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-11", "description": "Food: 4/5\nService: 4/5\nAmbiance: 4/5\nOverall: good food quality but I could get better portions elsewhere.  \n\nThe extended review...\n\nFood:\n\nGalbi chim - definitely good in flavor but I have been to other restaurants where the portion size was bigger and the meat was more plentiful.  \n\nService:  friendly and attentive service.\n\nAmbiance: one good thing about this restaurant is that you will not walk out smelling like BBQ.  There is great spacing of the tables so it's not claustrophobic.", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Nice and clean reasturant.\nBibimbap is really good with red sauce. Not too spicy.\nPickle and fish cake BANCHAN is yammm~\nI ordered 2 Bibimbap and tofu hot bowl.\nI will come here again!", "author": "Sue B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "4 stars for the location and ambiance. Fewer stars for the food.\n\nCame here with a group of 6, and luckily there was a long table in the back. The location was great- positioned on Haight Street near Muni and a couple popular post-meal adventures (Duboce Park and Painted Ladies). I admired the modern style of the restaurant as we were taken to our table.\n\nWhat I wasn't a fan of- small portions and high prices. The food wasn't bland, but some of the dishes left me flat. I suppose plain, as another Yelper put it, is an accurate way to describe it. \n\nNo rushing to come back, but depending on ones craving and budget, it might work for some.", "author": "Nicholas G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "The ambience of the place is so comforting! The staff is extremely lovely and helpful and the service is really swift (tbf it wasn't that busy). My favorite part of going to a Korean Resturaunt is always how they give you loads of mini sides, and it definitely wasn't a let down here. We ordered the seafood and the combo tofu soup; really yummy and satiating. Overall a great dinner!", "author": "Alina Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "Had an excellent meal at this restaurant! Some of the apps were pricey for what they were. The fried chicken was literally only 3 pieces. But most of the menu was well priced and delicious. Would definitely recommend", "author": "Nikki N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Fantastic delivery experience. Food came ahead of schedule, and was especially delicious. We had: Kimchi Pancake (it arrived crispy!), Army Stew, and Spicy Pork. We'll definitely order again.", "author": "Sage K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "I came here for dinner on a Saturday night and it was good. Service is really nice and quick, and we got our food really fast. I ordered the beef ramen, but I think i will try some of their other hot soups next time! The tofu soup seemed popular.", "author": "Lillian B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-15", "description": "I wanted to give this 4 stars. I really did. I even slept on my review to see how I felt in the morning, but I couldn't justify it. The price for the bowl was just too high for what we got. The bibimbap was certainly good, but at around $20 a bowl, I would have to be pretty desperate for korean to come back. The veggie stone bowl is $13, and I added kalbi  (beef short rib) for an extra $7. I was a bit skeptical to begin with, but the picture on the menu looked very enticing and promised  thick slices of kalbi to look forward to. I was disappointed when the food arrived. 5 or 6 thin, squared slices of short rib were scattered around the top. Not at all what I was hoping for. \nBesides this, the service and staff were friendly amd the restaurant was clean. I'm still searching for good bibimbap...", "author": "John W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Popped in here after work with a few friends and we were able to get a table right away. It was around 7pm and they were steady away, so mid-week you're in for a good chance of getting a seat without any bother. It's clean, open, light, and not too loud. Staff are super friendly! My mate left his card at the table after we left and one of the waiters ran down the road to return it to us, which was really lovely.\n\nThe minute we walked in my friend suggested we start with the pancakes, and he wasn't wrong. They're large enough to share as a light starter amongst three, so you won't fill up before the main event -- that is, one of the hot stone bowls. Two of us went for the spicy pork and it was a treat. I couldn't finish all the rice, and you should mix it faster than I did lest it crust up on the edge of the bowl. Everything, from the egg to the meat to the veggies, was delicious and not too pricey.\n\nPerfect spot for a low-key, delicious, filling meal. I'm a fan!", "author": "Rowena H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-04", "description": "Couldn't get into ramen around the corner from here so we were relegated to Stone Bowl for another kind of Asian cuisine.\n\nVery quick and great service- the people are super nice. However, the food portions for the incredibly high prices (even for SF!) did not seem fair. We ordered two bulgogi steak bowls for nearly $21 each and they came out with barely a handful of meat on top of a ton of veggies and fillers. Not cool.\n\nI ordered the ramen bowl and it was tasty but again... very overpriced for what you're getting. The place is super clean though and caters to the SF crowd seeking very drab and consistent 'cultural' food but I think this place would not impress any true Korean or person that has enjoyed true Korean cuisine..", "author": "David T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "For three people, we ordered two soft tofu (one dumpling and one seafood) plus a plate of short rib. The food was pretty good for Korean in NorCal. Prices are pretty standard as the soft tofu soups ($12-$15 depending on the filling you get) and the place of galbi being about $20.\n\nThe short rib comes off the bone, pre cut in bite size on a bed of veggies. It was different and really nice. Much easier to eat (although I also like eating it off the bone).\n\nCheck in for a soda.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "I have two words for you: \n\nKimchi Pancakes\n\nThat is all.\n\nActually this spot has a lot of great menu options including Galbijjim, Soft Tofu soup, Steamed Beef Rib Stew, and Bibimbap, but I am absolutely obsessed with the Kimchi Pancakes.\n\nAn additional note: this place is great for large group (i.e. professional dinners, birthday parties, etc.). They have a large table that sits up to 20 people in the middle and they are very accommodating :)", "author": "Vasiliy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-23", "description": "This review is for delivery only. I'm from LA and constantly crave good Korean food, so I'm super sad to say that Stone Bowl Plus unfortunately will not be our go-to Korean spot in SF. \n\nThe Kimchee soup was too tangy for our taste, and the rice cakes were hard wen they arrived. I tried heating up the soup a lot more which did fix the rice cake consistency, but the soup itself was still unsalvageable. \n\nThe bibimbop has so much potential with the ingredients, but didn't come with the requisite red sauce to mix in (luckily I had my own, but I didn't think to get it until most had eaten the bland version already).\n\nThe fried chicken was tasty, but the pieces were so small! It was more of a popcorn chicken app than a full chicken entree- just to set expectations.\n\nPerhaps I need to give it another try in person, but for now, I'm disappointed by the delivery/takeout version.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Tasty food, good service, happy place. A bit expensive, but not for SF.\n\nAny dish comes with their traditional 8 small side plates which are fun to look at and to eat, things like a bit of kimchi, a vegetable, some sprouts.\n\nWe got savory pancakes, which were delicious; raspberry wine, which was good, but one smallish bottle was enough for three, because it's pretty sweet; and the \"stone bowl\", hot bibimbap, rice with ingredients in a hot stone bowl that crisps the rice. All quite tasty.", "author": "Dan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "This is how small the duk boki portion is!!! Waiting half an hour for Uber X to deliver this box. Unbelievable, it's not worth the price. This is not the first time I order duk boki, I know how big one portion is. I'm really disappointed.", "author": "Kaylee T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "You know why Koreans are so skinny and healthy looking...because their food is so healthy! Whenever I start a diet Korean food is the only food I can eat. \nThis place was definitely a winner.\n1. Food was healthy \n2. It was inexpensive\n3. Food was filling \n4. Great service \n5. And not so busy that we couldn't get a spot without a reservation.\n\nAlso- I decided that my favorite wine is the Korean raspberry wine! must must must try it!", "author": "Julianna I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "A solid and delicious Korean experience!\n\nAdmittedly, I was a bit skeptical going in seeing the prices outside. Korean food is usually pretty affordable yet starting prices for a simple soft tofu soup was $14 and bibimbaps started at $13 with no meat. Still, we were craving Korean food and this is probably the best and most authentic place in the area.\n\nWe ordered:\n- Kimchi pancakes ($7): a solid and sizable appetizer. The pancake was soft and the kimchi taste was really strong. \n- Beef soft tofu soup ($14): my boyfriend ordered this and he said it was pretty solid, but wasn't super special. \n- Seafood stone bowl bibimbap ($17): This comes in a stone bowl that is sizzling when it first comes out so the rice gets really hot and crunchy. This bibimbap came not only with a good amount of seafood, it also came with a ton of veggies with a runny egg on top. The egg wasn't too runny but I was really impressed with the seafood and veggies. Make sure to use the gochujang sauce in the red tube that they give you!\n\nI thought everything tasted really fresh and really tasty. Of course there was banchan (free sides) and while pricey, my seafood bibimbap was really good and I even had a little to take home after! The service was also top-notch and my water was always filled whenever a server passed by.", "author": "Jingxi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-24", "description": "I think the food in general is super overpriced here, which is unfortunate. Food is also just so-so. I much prefer the Korean places out in the richmond/sunset. It's usually pretty empty in the restaurant during dinner time, so it's usually our backup if Iza Ramen or some other place nearby is too busy.\n\nEverything I've had here was all right, nothing to rave about. Very average korean food. I think the kimchi pancake was well done though. Good flavor. The tofu soup and bibimbap were both not as impressive. The flavor is just.. off? It doesn't have that rich Korean taste, if that makes sense!", "author": "Grace D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-18", "description": "This might be the worst Korean food I've ever had. I ordered normal bibimbap and a side of fried chicken. This was a pickup order. The chicken was plain (I didn't see an option to add any kind of sauce / spice). Here's how I'd rate the items:\n\nbanchan - super weak. Boring kimchi, tasteless or gross everything else except the fish cakes, which were ok.\n\nfried chicken - no flavor and crappy texture, especially for a Korean place.\n\nbibimbap - the one thing I expected them to get right, and it was awful. I've had better bibimbap on planes! The veggies didn't taste very fresh and the sauce had a pretty bland flavor.\n\nThe order was ready at the expected time, everyone was friendly, and I didn't die. So go here if the other reviews make it sound good to you, but I won't be back.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "A very pleasant, pleasing-to-the-eye environment inside. Both the male and female wait staff are very courteous and professional. Food was delicious. We ordered of kimchi fried rice, kimchi pancake, and army stew tonight. The first time I was here, i ordered dolsot bibimbao with kalbi. Overall, the dish was delicious.\n\nAnother note on staff:  Staff greeted us and bid us farewell with a smile. \n\nThank you for a pleasant dining experience. I will be coming here again, when I visit SF again.\nxoxo", "author": "Caro B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-04", "description": "yummy korean soups! Came in somewhat skeptical since no one was inside (not to be a front runner or anything), but was pleasantly surprised. They have all the drinks you'd want: korean beer, soju, and a whole bunch of different wines. \n\nMy family went out initially looking for ramen, but everyone changed their minds once we saw the menu. My brother got the army ramen with spam ham etc. i gave it a taste and was pretty impressed, but their noodles are definitely not made in house. \n\nI got the spicy tofu soup with kimchi and loved it. it was spicy and got my nose running and body warmed up, and it came with a side of rice for when my mouth got too hot. the stone bowls keep the soup really hot for a long time! \n\nService was awesome too, but that's probably because we were the only people in there. no complaints though, they were awesome!", "author": "Dillon G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-21", "description": "Do not order deliver with these guys. \n\nMy order arrived with only one of the 3 dishes. When I called to ask what happened. I was given a lot of 'umm' and 'aahhh' on the phone. Restaurant told me is would refund. But seeing as this was placed through uber eats I suspect it's not that easy. \n\nAvoid at all cost.", "author": "Matthew B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Me and my bestfriend had the best experience at stone bowl. We are from Vegas visiting sf! Wanted to try some Korean food around the area. I must say this is by far the best Korea restaurant I have tried in the Bay Area. Must try! Great service! And side dishes are all so delicious as well!", "author": "Lily W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "Food: their hot stone bibimbab is probably my favorite one in SF. Especially the steak is exceptionally good. They have a pretty good selection of traditional Korean dishes. Note: I've never been to Korea, so I can't compare it to local dishes. I ordered for pick up once and it only took them 10 min to get it ready.\n\nAtmosphere & neighborhood: it's located right on haight street in the lower haight which is a not so busy but interesting neighborhood. It's safe and waking around there will guarantee you some fun if you like exploring small parts of the city with local charm.\n\nWait: I've been there a couple of times (also Friday night) and never had to wait for a table.", "author": "Maria H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-10", "description": "Definitely not worth the price or the time to dine here.\nThe food was mediocre and for the price you pay, you are definitely not going to get your money's worth when it comes to the meat portion sizes.\n\nAfter reading some of the other reviews I was expecting the service to at least make up for the food, but it didn't. I had to flag down the waitress to ask for water and when we finally got it we were just handed an emptied out soju bottle filled with water.", "author": "Nicole C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "I have a confession to make. \n\nThis was my first-ever Korean restaurant, which is pathetic for a multitude of reasons. \n\nConsidering that the neighborhood I grew up in is pretty much surrounded by the Korean community of Orange County, which of course is loaded with Korean restaurants. The only excuse I have is that when I lived there I had the palate of a five-year-old and thought that two tacos for 99 cents at Jack-In-The-Box were the bee's knees. \n\nActually I kind of still do. \n\nSo, I see some reviewers with more of a refined palate in regards to Korean dishes claiming that Stone Bowl Plus is a bit on the Americanized side, which is understandable. I agree that the ramen noodles they served were very recognizable as I have about 24 packs of like-product in my pantry at this very moment. However, they sure spiced them up good with spices, veggies, and very tender and flavorful beef. I also enjoyed the picked vegetable dishes that they brought out before our mains, and the wild rice that I ordered on the side due to me may or may not having the drunk munchies. \n\nStaff was amazingly friendly and kind, Stone Bowl definitely gives off a great family vibe. \n\n++++++++++++++++\n\nGreat for a meal after strolling around the area during First Night. \n\nSurrounded by great places to get a beer as well.", "author": "Amanda I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "The staff is probably the friendliest and most attentive staff I've seen in the Lower Haight but the pork bowl is meh. The flavor of the pork which should be spicy and delicious is just kind of blandly flavored and the meat is stringy. The cabbage at the bottom is a nice touch of a way to cleanse the palate afterwards. The entire dish was ridiculously expensive. \n\nI guess my hopes for a decent cheap Korean joint is still a future hope.", "author": "Rohan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-02", "description": "A fellow Yelper told me I don't eat enough in the Haight, and I was wondering if he meant I don't visit the Haight enough or that I display anorexic tendencies when I'm in the Haight. I guess he meant the former, but I was secretly hoping he meant the latter. Fingers crossed. Anyway, I know it's easy enough to take a 6 or a 7 Muni line from Downtown, so I've been coming to this part of town more often lately to try new places to eat. This new Korean spot is in the Lower Haight right across the street from Wonderland and Cafe International, and you shouldn't let the generic name fool you even though most of their entrees involve one. On a Monday evening, there were only about a half-dozen customers in the place.\n\nThere's an Osha Thai-meets-West Elm decor in here with minimalism the key with single papier-mâché flowers in makeshift bud vases (photo: http://bit.ly/1N31y3j). The menu isn't overwhelming, but there was a bit of sticker shock with the Galbi (Short Ribs) priced at $25 and Bibimbap topping out at $19 (photo: http://bit.ly/1MFcK8b). This is no Korean Chipotle. I bypassed the stone bowls in favor of the $18 Pan Broiled Seafood Udon, which sounded intriguing to me since that sounded more Japanese than Korean. It turned out to be somewhere in between and quite a huge portion to boot with clams, mussels, crab legs, squid, baby octopus and mixed vegetables swimming with the thick noodles in a spicy sauce (photo: http://bit.ly/1K07nvi). \n\nIt was pretty tasty, reasonably spicy and a whole lot of food for one person to digest, even me who never complains about double portions. Like any good Korean restaurant, they served their own Banchan plates first, and these were among the most freshly prepared I've had in a while with the spicy tofu and baby broccoli the standouts (photo: http://bit.ly/1VVPerx). The dining experience as a whole was nice and pleasant, but I have to say the higher price point doesn't make me want to come back with great frequency like a Hahn's Hibachi which is my and Jamie W.'s go-to for bargain Korean eats. No, Stone Bowl is a solid once-in-a-while Korean spot and a good reason for me to stop in the Lower Haight.\n\nFOOD - 4 stars...healthy portions, good flavors, a bit pricey for everyday Korean\nAMBIANCE - 3.5 stars...sleek, minimal space...no Korean Air Lines travel posters in here\nSERVICE - 3.5 stars...fairly attentive\nTOTAL - 4 stars...nice Korean spot when you have a few extra shekels in your pocket", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Ordered soft tofu soup with beef. Staffs were pleasant, polite and prompt, keep asking me if I need anything. They are Koreans, the food was authentically Korean cuisine as well. Spent $20 in total.", "author": "Janelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Stone Bowl has some bomb tofu soup!! I got the Seafood Tofu Soup, and it was just full of flavors. Usually, tofu soup at other flavors would just be spicy without any flavoring but this place was tasty. Also, places usually make their tofu soup with so much water that there's barely any tofu or seafood, but this place made it thick with so much tofu and so much seafood. This place has the best tofu soup, hands down. \n\nTheir stonepot vegetable bimbimbap was also a good choice. The vegetables included a really sweet yellow pickled radish, kale, beanspouts, and carrots. It had so much vegetables that compliments the sauce and crispy rice really well. And I was really happy to hear that they could substitute the purple rice for plain white rice. A TIP when eating a vegetable bimbimbap: use the complimentary fish cake dish as meat for your bibimbap, it saves both your money and adds meat to your rice! \n\nI also decided to settle on a meat dish and got the bulgolgi. This was not something I would get again simply because everything else that I order was so flavorful, but the meat dish was disappointing. It lacked flavors and wasn't what I expected. Not complaining, but I will come back to try another meat dish! \n\nThe waitress was super nice. On Yelp, it said that if I checked in I would get a free soft drink. Because I don't like Soda, he offered to give me a free lemonade instead!!", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-17", "description": "This was some of the worst Asian cuisine I've ever had.  The food was really disappointing.  I had the pot stickers, potato thing, spicy soup, and the spare ribs.  The potato thing was OK, but the rest was garbage.\n\nDo not waste your money!!!", "author": "Nic H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-14", "description": "I went here with my girlfriend on a Tuesday night for some hearty Korean food. The menu is smaller than a traditional joint: it really focuses on serving bibimbap, a stone pot stir fry with mixed veggies (and optional protein). Personally, I think the pricing is a bit steep for bibimbap ($13 for the basic, $17 with chicken $19 with beef). For other dishes, prices are in the mid-to-high $20 range, which is pretty high for grilled meat with some veggies.\n\nThe food was pretty good: one of the most authentic and variety friendly bibimbaps that I have had. It was a little dry, even after adding the sauce. My girlfriend ordered a soondooboo, which was just average. The first order was incorrect, so she had to wait in the meantime. Luckily, they left the \"wrong\" order for her to enjoy until the second one arrived. It took over 15 minutes for the second one to come out, so she was basically done eating (lucky to have gotten leftovers).\n\nThe service was below average, with only one waiter and one waitress running the entire front area. Things came slowly, and there were no checkups. I had to get up to ask for more water and ask for a take home container and the check.\n\nThe atmosphere is nice: clearly labeled sign and clean interior. There is a mix of tables for 2 and 4, as well as a nice counter area for mixed seating.\n\nOverall, just an average place. There was lacking service and just above average food.\n\nFood - 3.5\nService - 2\nAtmosphere - 4.5", "author": "Sean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "This is the most authentic and delicious Korean restaurant my wife and I have tried in SF so far. I've tried Sahn Maru in Oakland and the food there is good but the venue and service can't compare to here. I've had Hawker Eats and Ajima's for delivery multiple times but they make everything so damn sweet, yuck. I've also had Jang Su Jang in San Jose and they are rightly famous. I think this place, at least in my one visit so far, compares to Jang Su Jang.\n\nReally clean and nice decor with mood lighting and flowers everywhere. Just overall really calm and peaceful atmosphere.\n\nThe service was really tidy, polite and prompt.\n\nThe banchan was varied and delicious. The kimchi omg, I had three servings. \n\nMy wife and I had Sundubu Jjigae (soft tofu stew) and Galbi Jjim (beef rib). Both were magnificent.\n\nWill be back again for sure, have to try their dolsot bibimbap which they seem to be famous for.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "Started off the meal with fried chicken. Good flavor, but a little dry. Followed the chicken with the seafood soft tofu. Flavor in the dish was missing something and the seafood was fairly chewy.", "author": "Tucker N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "I get take out from here about once a week. Spicy pork Ramen is bomb. If you eat there get a stone bowl. The staff are super friendly as well!", "author": "Zack C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "food: 5/5: out of a lot of Korean food places I ate \nservice 5/5: very quick and always has a smile on their faces :) \nambiance 4/5: I enjoy the ambient music and lighting, slow music to enjoy the food. \n\nI've tried their army stew, and its amazing! The broth is very flavorful and lots of meat! \nI love all their meat dishes! I'll rate my top 3!\n#1 Kalbi short ribs\n#2Bulgogi Rib Eyes \n#3Galbijjim! \n\nI really enjoy their broccoli side dish!", "author": "Lewis C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-24", "description": "Decent Korean food but nothing mind blowing. Tried the bibimbap but didn't feel like it was out of the ordinary. Maybe I didn't have the best dish", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "Stone bowl bibimbap was pretty good I have to say. The dumpling soup was also delicious- the noodles tasted homemade to us. Wait staff was attentive too. However menu was a little too pricey for what you get and not many wine options by the glass. 4 stars for the food only.", "author": "Rob M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "The food was okay but pretty disappointing if you're looking for real Korean food. The menu is completely in English which probably should have warned us. Also, one of the appetizers on the menu was croquettes...?\n\nI ordered the spicy seafood udon, which was hardly spicy at all. It also didn't have broth (probably my fault for not asking before ordering). It did come with a lot of seafood though, which was okay but nothing special.\n\nMy sister ordered the soondubu jjigae with kimchi, which was very mediocre and not spicy AT ALL. Also could have had more kimchi. We shared a ddukbokki appetizer that was also sadly lacking in spice, and the sauce was very thin.\n\nThe service was okay and the waitress was nice. But the price is definitely too steep, especially considering what you get.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Holy new age Korean. I moved into the neighborhood fairly recently and finally found the opportunity to check this place out. As an avid Korean food fan, I cringed a little when I saw quinoa and kale as toppings on the bibimbaps. Little did I know, the food turned out to be amazing. Piping hot bibimbaps and army soups. Army soups even come with cheese melted into it - I didn't think I would like it, but I was definitely proven wrong.\n\nBanchan was not the best, so minus 1 star, but everything else was great! Will definitely be visiting here again in the near future.", "author": "Patricia K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-02", "description": "Wow, $8 for japchae and its tiniest portion ever for probably some of the cheapest ingredients. I finished the whole thing in 4 bites. Ive eaten here a few times dine in and it was fine, but their takeout portions are hella stingy. Place is a bit overpriced to begin with, but this is ridiculous.", "author": "Alexander W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Friend and I came for dinner tonight. We split the jap chae, I ordered the yukejang, and she got the soft tofu soup. My dish was piping hot and quite spicy, and filled with noodles and strands of pulled beef. It was pretty yummy. Would return!", "author": "Grace Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-26", "description": "The interior decoration is the best I've seen at a Korean restaurant but the food is just OK. I appreciate the fact that they care about aesthetics in the space and dishes. Good service with English-speaking waitresses.\n\nDef agree with the reviews below about the price, especially for the bibimbap and ramen ($14 for package shin ramen with eggs? ~_~;) The kimchi was so sour and bad. I also felt kinda sick from eating the beef and seafood tofu soup but not sure if this meal was the source of my cramps.", "author": "Juliana P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-20", "description": "It was a typical cold windy summer night in SF, so my friends and I decided to eat something warm and filling. Korean food equals comfort food to me, even though I was not brought up Korean. I ordered the \"dependable\" dumpling soup.  It was not overly flavored, which is unusual for Korean. The dumplings were mediocre in flavor, as was the broth. My main complaint is the kimchee pancake. I am pretty sure they made that earlier in the day, and just put it in the microwave because it was not crispy. It was lukewarm, and I was not happy with the mushiness and lack of flavor. Also banchans portion were small compared to other Korean restaurants. \n\nService was nice, and waters refilled regularly.", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "Very good Korean food in the Haight. I always get the dumpling soon dubu (tofu soup) and add mushrooms. It's delicious. It's my second favorite place to get soon dubu. The soon dubu is great and oh, so good. The service is very, very nice. It's definitely not overbearing but they're very attentive, prompt and very nice. It's also super clean. I highly recommend it!", "author": "Michi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "I've been to Stone Bowl a few times, and I think they're real positive addition to the Lower Haight food scene. \nThe staff were super friendly, and The decor is cleaning on complicated. The lighting is just right. \nThe food is really good and the stone bowl dishes are really hot! so they're great on a cold, rainy night. \nI'd really recommend trying this place whether not you've had Korean food in the past.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "The food is pretty standard (note to self though: let the bimbimbap sit for a bit to get more crispiness in the rice!), but the service was a bit lacking (hence the three stores). I'll probably come back (as the food is pretty standard), but it's nothing to write home about.\n\nAlso - the tofu soup (vegetarian) has beef in it :(. Beware!", "author": "Christina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "We very much enjoyed our meal here. The bibimbab was amazing, the sides very delicious (those radishes and kimchi). \nThe staff very friendly. Will for sure eat here again", "author": "Sandra C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "I love this place! I come here with my partner, and we order the same thing every time because it is simply too delicious to pass up: Galbijjim, Steamed Beef Rib Stew. I'm salivating right now just thinking about it. It is a HUGE bowl that comes bubbling hot filled with the perfect foggy day items: daikon, potatoes, carrots, peppers, noodles, rice cakes. Topped with the most tender, melt-in-your-mouth beef I've ever had. The sauce is sweet and savory and over the course of the meal will slowly caramelize and cover everything in a delicious glaze. We share it and always feel stuffed by the end.\n\nThe only sad-face is that they are not open on Sundays! We've definitely forgotten this a couple times and cried out audibly in indignation when we remembered - but I think that just means we really love this place. Stone Bowl+, so glad you are in our neighborhood and hope you will be around for a long, long time!", "author": "Eddie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "This is the most soothing meal I've had in Haight. By soothing I mean the servers/owners are the absolute sweetest, and will make you feel like you're over at your Korean best friend's house for dinner while holiday music tinkles softly in the background :)\n\nStopped by for a bowl of seafood soondubu on a brisk Saturday and it hit the spot. As per their name, Stone Bowl has every Korean dish served in a stone bowl you've ever craved: bibimbop, soondubu, ramen. Great addition to the area!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "Though it is not the best ramen I've ever had, it definitely does the trick when you have a craving. The spicy pork ramen and the chicken ramen are our favorites. Probably get to-go orders from here 2-3x a month. \n\nThe bibimbap is also super delicious.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Second time trying Stone Bowl, and this time I really enjoyed everything! Caveat: I spoke to the owners/employees in Korean so I may have won some brownie points with them..\n\nHad a girls night with my friend S, arriving to a full house. Thankfully there are a couple additional tables in the back, so we were able to get seated right away. I got the yukaejang (spicy beef stew) and asked that it be prepared extra spicy. S got the beef & seafood tofu soup.\n\nThe banchan was pretty good--we liked each of the dishes (including fish cakes, pickled cucumber, bean sprouts, seaweed, and kimchi). I enjoyed my yukaejang a lot--definitely made a good call by asking them to make it spicy (it was on point). The service was also stellar--they came by multiple times to check that we were happy with our food and didn't need anything (we did get one banchan refill).\n\nAt the end, we asked for our check, and they brought us some complimentary green tea ice cream! It was pretty awesome, but I don't think they always do it (someone please correct me if I'm wrong).\n\nCome check out this Korean place in the lower haight (the only Korean place in the lower haight) and make sure to ask that your dish be extra spicy if you're a regular Korean food consumer. Cheers!", "author": "Julia N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Delicious food. I've been here numerous times and always bring someone new. Hits the spot when you want some Korean home cooking. Tastes like I'm home.", "author": "Kristine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "I had .. \n1. beef bibimbap\n2. seafood udon \nand 3. lemon soju cocktail :)\nwith shrimp temp (+ mustard tartar sauce)\nThey were all amazing!! Loved them all\nEspecially the seafood udon !! \nIt was perfect amount of seafood + udon :D ! \nI was surprised they had so much seafood in this plate\n\n+ Also the service was great !! \nI loved the lady in short hair :D \nShe was so nice to our table", "author": "Yumi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "Discovered this place from yelp when I looking for a dinner restaurant. Stone bowl is great place to dinner with your girlfriend. \nThe workers are friendly and attentively. They served a good quality food and you can request for Korea side dish any time.\nI loved kimchi here. It's can go along with rice very well, Otherwise, they served you a smaller appetizer and ham in army soup is salty a little bit. \nGood atmosphere for the lovers. It's not priceless and not expensively for Korean food in SF.", "author": "Chinnakrit W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Phenomenal seafood pancake! I ordered a seafood pancake and vegetarian bibimbap for delivery. I recommend both items. Looking forward to my next delivery with Stone Bowl Plus", "author": "Margie S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "This was my first time in the Haight area and craving some Korean food with some friends. We found this little family owned shop that served Korean and found ourselves briskly seated inside escaping the cold and ready for some Korean food in our bellies. \n\nRigh off the bat, we knew we had to get some stone bowl options. There is a variety of choices and an easy to read menu. We got the Army Stew, Kimchi Tofu Soup, Kimchi Fried Rice, and Spicy Pork Bibimbap! All excellent options, large enough portions to fill anyone up with and the it all came out pretty fast. Good array of banchan to start us off as well. The staff was friendly and attentive. The pricing is on the higher end is all, definitely a good Korean spot in the Haight area.", "author": "Daniel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-23", "description": "Nice folks. Let me in a tad before opening time, corrected the wrong dish I'd been served w/o me saying anything. All my fried chicken was pink inside, and the food overall was pretty standard (though at nonstandard prices). Halmoni x Mexibro cooking team. Two things stood out most: friendliness & classical music. Both good things.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-06", "description": "Two words: rip off. The galbi came in a bowl with veggies hiding underneath so it looked super full and steaming but no. It was like 6 pieces of bite sized meat. If you go somewhere else, galbi for 25 dollars gets you 4 times the amount. Very disappointing. Go somewhere else. Not worth the money.\n\nI'm giving one star for the flavor. The other star is out of pity.", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "Food pretty tasty, service friendly but a little slow (we had to ask for water three times), prices seemed on the high side compared to other locations for what is really fast casual food.\n\nWe were four people - had a main each (3x Bibimbap + 1 beef stew) and shared 3 appetizers, a couple of large bottles of beer and a half bottle of Soju and the check was $130 before service. Felt like a lot for what we had.\n\nDon't get me wrong - the food was good and I like the (slightly spartan) atmosphere - that's just a lot for Korean. I think part of the problem is their menu/pricing model - it's structured such that you buy maybe one appetizer and a main course. Given that they don't have much else to sell you which means the only way they can make their target check is by charging almost $17-20 for the main which just feels hella expensive.\n\nHope they get this sorted out - if it was $12 (like a Bento at Sushi Raw) I'd be there a lot. At this price, not so much - which feels like a shame as lower Haight needs more good eating options and variety which this offers.", "author": "Diarmuid R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "Stone bowl is open late and they have great bon chon sides and are opened late, I love coming here to try all their different dishes - everything i've had has been great from the bibimbap to the soon tofu. My partner and I have been here several times and we are excited to try more items on the menu. The servers were also very helpful and quick to serve us and always filled our water!", "author": "Calvin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "I think this is my favorite Soon Tofu place in SF. I tried Cocobang, 707 Sutter and a few other places but they weren't exactly the best. I like how the Soon Tofu at Stone Bowl Plus comes out sizzling hot from the stone bowl so it tastes like it's fresh off the stove. It looks clean and modern on the inside as well. Come here if you feel like having something soupy on a chilly SF night.", "author": "Natalie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "I've been here about 3-4 times and I'm surprised that this place only has 50 reviews so I knew that I immediately had to write one ASAP! Whenever I'm craving a hot, bubbling flavorful bowl of kimchi tofu soup, this if where you'd find me. It doesn't taste sour (as lot of places would just throw in tons of kimchi and have it ruining the balance of the soup) and is loaded with tofu, zucchini, enough kimchi, onions, and the other basics. The Bibimbap is also REALLY good as well and it definitely shows as you walk in seeing at least one at every table you walk by. \n\nThe service is amazing! They're all really welcoming, attentive, and quick. It's pretty dark inside but that's what makes it different from a lot of other korean restaurants. It feels cozy and warm- which is perfect to get a break from the cold SF air. \n\nAlthough parking can be a nightmare on this strip, it is definitely worth it every time.", "author": "Mandy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "This new(ish) restaurant in the Lower Haight exceeded my expectations and is definitely worth a visit. The restaurant has a newly renovated/updated feel and can seat a good number of people. \n\nI ordered the ramen with tofu and asked for it to be vegetarian and spicy. The ramen was served with sides/toppings and it was all outstanding. I was in need of a ramen fix and this certainly did the trick. \n\nAlso to be noted: friendly, fast service.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-13", "description": "I've bever seen here nor will I ever. $18 for army stew??? That dish was built to be cheap! $15+ for tofu soup... bruh hat shit cost $8 at BCD. you wanna seem like a real Korean spot? Get it right fam", "author": "Marcus S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "Best Bimbimbap in San Francisco. The service was quick, the food perfect. I wish they would serve a complimentary kimchi pancake though :-)", "author": "Hessel V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-01", "description": "This restaurant is located a block away from my apartment, I was pretty excited to have a new Korean resto open up so close. Unfortunately the food was just blah. \n\nI came in on a Friday night, the place was packed. I thought that was a good sign until the side dishes came and it was tasteless (including fish cakes, pickled cucumber, bean sprouts, seaweed, and kimchi). I had beef bibimbap, it was just ok, kimchi soup was also just ok. \n\nI think I'll stick to Japantown for the closest Korean food.", "author": "Arlene R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "A great addition to the neighborhood, delicious food and wonderful service. Try the Spicy Tofu Soup with their amazing pork dumplings and the kimchee pancake.", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "Floating between 3-4 stars, Stone Bowl is another great addition to the array of restaurants on Lower Haight.  The two other restaurants we tried had an hour wait and then a 20 minute wait, so Stone Bowl was there to save the day. On a cold November night, a nice warm stone bowl of tofu bipbimbap was just what I needed.  The rice was nice and crunchy at the bottom, although I probably should've gotten the beef instead.  The only other tofu soup place I know is in Richmond, so I'm excited to come back and try it. The ambiance is nice and homey, and it helps that this place is super close to me :)", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "Ordered Ramen. It was instant noodles with some vegetables. Soup tasted good but was shocked they used instant noodles. Very not in the ramen spirit.", "author": "Ash A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "Decent Bibimbap. The stone bowl was a very cool touch, but the rice and veggies were dry. I feel like there was a sauce that was lacking (or maybe the egg yolk wasn't runny enough). Either way, good Korean food, but not blow-you-out-of-the-water quality. The service was relatively inattentive - I had to request that my water cup be refilled twice. Prices are pretty expensive too. About $70 for two main courses and two drinks. Probably won't go back anytime soon.", "author": "Kerry R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-17", "description": "Super yum family restaurant w really sweet people working there :) I got the kimchi fried rice with like galbi or something like that - boneless short rib. I wanna go back and try all the things!", "author": "Salanya I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Food was quick, and fast. Delicious with a lot of mini dishes. Great customer service.", "author": "Andy X."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "This review will reflect my last visit and why I came back. \nThe menu has small and big dishes you can pick from and if youre always hungry like me, its a new place you should add to your list. \n\nThe food is absolutely tasteful. It has its own style of serving as well. The waitress is very kind, cute and young is another reason I liked it here. It can be a very intimate eating or feel like the whole rest is part of your meal in a good way! \n\nIts very clean and modern, and once you step outside it feels like youre leaving a different region. I swear, they did a good job masking the Haight street atmosphere in a skilled manner. \n\n\nP. S. \n\nGood spot for first dates! Or those annoying ass girls that like to eat in small amounts while you can get the big boy plates.", "author": "Yosof R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Stone Bowl is my favorite place to come for dolsot bibimbap. They have great side dishes as well that are always fresh, and of course bottomless! Although not the most traditional, I love the addition of the quinoa and kale, giving it a California touch. They are generous with the meat, and everything is always marinated perfectly. Their side dishes, from jap chae to seafood pancake, are all small enough to enjoy as appetizers. It's definitely on the expensive side, but I'll splurge for a good stone bowl once in awhile!", "author": "Ashley T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-16", "description": "As a LA-born Korean, it's very difficult for me to find good Korean food in SF. This place was pretty good for the area and they give you lots of food and banchan (side dishes). Not the most authentic food but it was enjoyable. \n\nService is prompt and the facility is very clean.", "author": "Elizabeth K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "Well maintained establishment with super nice service staff. The place, as others have mentioned, has a super chill vibe with some semi emo music to go with it. \n\nFood hits the spot for bibimbap and soondubu cravings. Price wise, you can expect a base price of $12. For bibimbap with galbi or beef, it's around $19-20. Not the cheapest place around, but a dependable spot to go if you're looking for convenience.", "author": "Joanna H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "Modern Korean restaurant serving classic dishes. We came here around 8 on a week night and were seated immediately. The restaurant was about half full. \n\nWe had the spicy chicken appetizer (boneless fried chicken in a sweet and spicy sauce), japchae appetizer, kimchi fried rice (served in a stone bowl so you can get the rice crispy!), and bulgogi (also in a stone bowl). The banchan was tasty, and they gave us generous refills. The meal was overall also pretty yummy, although it was a little pricey for what it was (e.g., the bulgogi came with cabbage and onions which were more than half the volume of the dish). \n\nThis place is a welcome addition to the lower haight/Alamo square/Hayes valley food scene since it's the only Korean place around. Not sure if we would go again though since there are many places in the sunset and Richmond with more options.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-17", "description": "Little description of this place:\nA cute family owned Korean restaurant that serves homemade Korean food.\n\n\nFood & Taste:\nLike its name, we ordered Beef Stone Bibimbob & Seafood Udon.\n\nBibimbob is great! Lots of vegis and beef! The stone kept the heat for so long that it almost burnt the rice! \n\nSeafood Udon was a hidden gem! There were lot of seafood inside. A crab, clams, and lots of squid +_+\nIt was a perfect pair.\n\nService: \nLike a family restaurant, they tried to accommodate you much as possible.\nThe waiter even gave some recommendations when we were trying to order, also they come by to refill \"banchan\" several times.\nHow did I find that it was a family owned restaurant? The waiter told me it's his mother who is cooking. He said that in a confident!\n\nGreat Place! I would come here again!", "author": "Heidi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "3.5 Stars, really... but rounding up for proximity/service.\n\nThe stone bowl bibimbap I had was actually delicious, and they have makgeolli, which is really hard to come by... but like the other reviewers have said, everything's at least $2-$3 more expensive than it should be. $19 for a kalbi bibimbap is kind of insane.\n\nHOWEVER, the service was really nice and accommodating, and given the lack of good korean food in SF, I'd be happy to have this place stick around for a while.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "The food was absolutely amazing. The Army stew was incredibly delicious and the galbi meat we ordered along with the bibimbap was probably the single best thing we had at this restaurant. Our only complaint was that we felt the food was over priced. I've had hotpot versions of the army stew that served at least 4 people for a total of $30. Meanwhile the army stew here was essentially $20 for a single serving. Ultimately, it's worth it if you're craving really great Korean food!", "author": "Addie A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-09", "description": "Delicious galbi bibimbap, and the portion size was perfect. The seasoned spicy chicken appetizer was also tasty, although I was so caught up in the bibimbap that I let the chicken sit and it got a little cold. Still tasted good, though. They offer one type of beer, which is nice in this town of beer snobbery. It felt good to just say, \"I'll have a large beer\" and have that be the end of the no-beer-in-my-hand problem, with no extra decisions. Bonus: the beer is light and refreshing. Service is great, friendly and efficient. \n\nThis is definitely my new go-to place for Korean food.", "author": "Laura M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-03", "description": "Jeeez they served ramen straight out of plastic packet. With added broth and spice. Anyone who left good review on that here don't know what ramen is.  Service was horrible. We had to get up to ask for water. We had to get up to ask for check. They didn't come by at our table even once after they dropped off the food. Never coming here again.", "author": "A O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Whenever my fiancee and I want to treat ourselves for a delicious and comforting dinner, we both have the same thought cross our mind: Stonebowl+, our neighborhood Korean restaurant! The menu is extensive, prices are pretty good, and the ambiance is cozy and sweet. A perfect date spot. What I love about this place, and other Korean restaurants, is the banchan- 10 or so complimentary little plates of yummy little plates of pickled vegetables and other things that get REFILLED as you finish them! As far as entrees go, we always get their special Galbijjim, a sizzling bowl of beef stew with glass noodles, carrots, daikon, chew rice rolls. This dish is so insanely good, we've ordered it every single time.  While it's the most expensive item on the menu, it's perfect for 2 to share! \n\nThere are a lot of restaurants in the Lower Haight that come and go, and I hope Stonebowl isn't one of them.", "author": "Nicole H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Good food, great banchan and very good price.", "author": "Balu V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Feeling so blessed that I live up the street from this restaurant!! If you ever need some good, hearty food to warm your soul then this is where it is on Haight Street. The staff is very welcoming, friendly and just over all naturally happy people. Props to Jenny who had amazing service and great suggestions! Another waitress was helping her as well, I didn't get her name  but she had short hair and she was also just as friendly and gracious!! I ordered the Galbijjim and it seriously was the best Korean Stew I've eaten! The meat fell right of the bone and the sauce was amazing! My boyfriend got the Bibimbap which was also really good! (if you mix the Bibimbap with the Galbijjim it's even more amazing!) I will definitely be coming back to try more of the soups!!", "author": "Nicole D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "Stone Bowl does a solid job addressing the dearth of Korean food options in the Lower Haight. It's a little expensive, but the food is good enough to make it into my rotation of restaurants in the area. \n\nStarted off with the japchae, which was both the most enjoyable dish and the best value ($4 for a pretty solid amount of food). I think 2x japchae might be a viable dinner option; looking forward to experimenting with that. \n\nThe banchan were pretty good, especially the seaweed. I might have liked a little more kimchi. \n\nKalbi bibimbap in the eponymous stone bowl was exactly what I was looking for on a chilly night. The short ribs were well-seasoned, and the various vegetables were appreciated. My only gripe was that it's a little pricey at $19 -- guess rent in the neighborhood is pretty expensive, though. \n\nThey're still working out some of the service kinks -- I had to ask for water twice (once more than the drought regulations require!), and they didn't bring out any gochujang with the bibimbap until we explicitly requested it. The waitstaff is super friendly, though, and I have to imagine all that stuff will improve in the coming weeks.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-14", "description": "I was in the mood for Korean, for a small birthday dinner for just my partner and I.  We had booked a show in SF, and I looked for Korean food.  I happen to really like dolsot bibimbap.  I figured with a name of stone bowl, their bibimbap better be damn good.  \n\nIt's a very clean and somewhat stylish restaurant.  Prices are pretty expensive for what you get and to add-on meat.  Don't order ramen, its lackluster, with very artificial broth and noodles. \n\nI ordered dolsot bibimbap with spicy pork.  I enjoyed it, but I feel like there wasn't enough oil in the bottom or the bowl wasn't hot enough, cuz i didn't get enough burning.... \n\nBanchan selection is meagre, and they only offer to fill up your banchan once.  The first time they brought out kimchi.. there was like 2 pieces, not kidding.  I immediately asked them to fill it up, and they brought a nice big patty.  Stil.... sorta stingy.  This is a like a mom and pop place, but they don't charge mom and pop prices, and the hospitality didn't feel generous.  Not planning to visit again.\n\nI feel bad leaving a lackluster review, but I just wasn't impressed with what I received.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "This place is an amazing find!!!! 5 minutes from our house and absolutely delicious -- the banchan was lovely, and the spicy pork bibimbap and army stew were both off the hook!! Can't say enough good things about this place -- we will definitely be back!!", "author": "Leo C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "If you want Authentic Korean food don't go here. We went to try this place since it was walking distance from our hotel and the reviews were good. Food was terrible and service was just ok. Don't waste your money just get a sandwich instead. Also very expensive!", "author": "Pooh O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-26", "description": "The food was not very good. I came here with two friends and got three different fish types - ramen, bibimbap, tofu soup - none of which were good. Perhaps most telling, the Korean among us was not a fan", "author": "Josh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "Good Lower Haight neighborhood spot for Korean food.", "author": "Manny Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-26", "description": "Happy to have a nice Korean option in the neighborhood.  This is homestyle Korean, not too greasy but very comforting.  True to their name, there were many stone bowl options.  My companion ordered the beef bowl and enjoyed it.\n\nService is nice and friendly, though still a little bumpy from being so new.  I saw one of the waiters literally answer questions about the entire menu for more than 5 minutes, which has to be commended.  \n\nAn extremely extensive wine and Soju list made me sort of want to order some alcohol just to take advantage of it.  \n\nOther highlights include mom style kimchi fried rice, and delicious/trashy army stew (with spam and instant ramen noodles!  They were even willing to bring me a slice of cheese to put into it, which is legit.)", "author": "Lorin Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "Great food and even better service!\nWe had beef bibimbap and jhap chae. Both were excellent. \nCan't wait to go back!", "author": "Lis G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Food was great.  Service was even better!  Hope the best for this place.  Family owned and they really care about the food and the customers.", "author": "Chase F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Descent Korean food in lower Haight. I kind of had a doubt cuz some of my friends had bad experiences here before but it was pretty good for me. Nothing amazing but pretty good Korean food in my neighborhood.", "author": "May Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "Solid well prepared Korean food. Dude fishes are delicious and service is great Barry attractive staff. Highly recommended", "author": "Oliver C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-10", "description": "Get the spicy pork bibimbap. You won't regret it. Its *so* *freakin* *good*", "author": "Autumn B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-09", "description": "The place is very clean, service is fine - I just thought that the portions were pretty small for the prices.  $7 for veggie japchae, and it was a very small portion.  The bbq dishes were small for their price as well.", "author": "Mirba E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "I rarely give 5 stars but the overall experience here deserved it!  I was initially going to try Iza Ramen but there was a long waiting line so I went around the corner to Stone Bowl...turned out to be very fortunate.  Absolutely delicious and fresh with friendly prompt service and spotless restaurant!  I ordered the Bibimbab with spicy pork, and, to my surprise it came with 6 side dishes of delicious spiced and pickled veggies including Kim Chee.  I had never had bibimbab before but it was fabulous, tasty and filling.  I paid $18 for this filling dish.  I will be back when I'm in the area.  Try this and you won't be disappointed!", "author": "Jmarc P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "I am wondering if these 4 and 5 star reviews are from friends and family of the establishment, or from people who are trying Korean food for the first time, or just trying food for the first time in general. \n\nThe service was severely lacking: no one checked on how our meal was; no water refill; had to go up and ask for check after 30 minutes of waiting..\n\nThe ramen has got to be the 10 cent Top Ramen you find in the grocery store, no joke. Bibimbap was OK; Banchan (side dishes) pretty tasty. \n\nOverall, not worth your time and money.", "author": "Aly K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "The food was really good and fresh. The ingredients were high quality, the portion size was good, and I left full, when I normally eat two meals at other places.  It's worth $25 (after tax and tip).\n\nI'm very acquainted with Korean food, so I know good Korean food when I have it.\nUnless there were some drastic differences between my experience and theirs, these people complaining about price/quality are trippin'.  It's slightly more expensive than mediocre Korean food because it's better!", "author": "Josh J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-09", "description": "One of the my favorite Korean restaurant in the city. A surprise found in lower haight. The restaurant is nicely decorated, not very crowded. Food is decent, everything I had so far is really tasty. The service at the restaurant is also very nice.", "author": "Shan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "It was ok...the side dish was nothing like authentic korean restaurant- kinda disappointing! We tried the kimchi pancakes would recommend it", "author": "Rainbow Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "Pretty good, but not amazing. I liked what we got here and I'll definitely come back when I have a craving for Korean. The staff was very nice and the ambiance was clean and modern.", "author": "Courtney C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "I had the chicken bibimbap - it was delicious. The meat was seasoned well, and the egg was cooked perfectly - not all burnt on the edges. Some people might find the dish as a whole kind of bland, but that's what the sauces are for. They also bring out small plates of random stuff to try, and refill for free. Overall it was tasty and also fun to eat here, and the service is great.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "Stumbled upon this and decided to give it a try. The servers were extremely nice, the place has a nice vibe. I just thought the food was average it didn't taste outstanding but it was pretty pricey.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "as a long time resident of the Lower Haight, i take pride in my proven ability to accurately gauge which new restaurants will succeed, and which will go belly up. so when i saw the arrival of Stone Bowl in the 'hood, after a quick once-over of the decor and menu, my first thoughts were, \"this isn't going to work.\" and yet, being a sucker for novelty, i figured i should at least TRY it before i started dispensing the Haterade. and so i did. here are my thoughts:\n\n- it's awfully bright in there, and seems like it's trying a bit too hard to appear fancy/upscale (perhaps to justify the prices?) while still coming of a bit cheap. not really the right vibe for the Lower Haight, IMO. astoundingly (and laughably), the clearly brand new tables STILL HAD THE STICKERS ON THEM. i've previously witnessed this trend with baseball caps, but apparently it's now a thing at Korean restaurants, too. \n\n- the prices (at least for the entrees) are flat-out too high. just because everything's getting depressingly expensive in New San Francisco, doesn't mean you need to price things at the high end just because \"everyone else is doing it.\" and while we're on the topic, at $18~ish per entree, you'd think they could at least make some proper menus. instead, we got a two page inkjet printout on white 8.5x11 office paper that was (i shit you not) STAPLED TOGETHER in the upper left corner. way to keep it classy, Stone Bowl.\n\n- the service was passable, but nothing special. our server was cute and polite, but struck me as a bit timid, and didn't seem to have a very firm command of the English language. not a big deal, overall. \n\n- finally, and most importantly, the FOOD. i've gotta admit, as much I was wanting to write the place off at that point, the food was REALLY FREAKING GOOD. everything we ordered was well prepared and extremely tasty! if it were more affordable, i'd definitely eat here regularly, if for the delicious food alone.  \n\nrating summary/break-down:\nvibe/decor - 2 stars\nservice - 3 stars\nprices - 2 stars\nfood - 5 stars\n\n....for an overall average of 3 stars.\n\nso....will Stone Bowl survive in the Lower Haight? i'd say it's too soon to call. in its current state, i'd lean toward wagering no. but with a few tweaks and adjustments...maybe.  \n\nmy advice to the management: tone down the lighting, invest in some real menus, remove those ridiculous stickers from the tables, and, most importantly, lower your prices. this isn't a cash grab, if you want the long-term support of the community, your establishment has got to provide VALUE, not just quality. \n\ni wish them the best. the food really was great. if they can work out some of the kinks, i (and the rest of the neighborhood) just might be back.", "author": "Greg B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Nice atmosphere, great and friendly service, delicious food. I'm always quite satisfied with the bibimbap and the sparkling sake!", "author": "Sonia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "Excellent service, atmosphere, and food for a Monday night date night. We highly recommend the Army Stew!", "author": "Molly H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "So Delicious - The best - YUM!\nThe fired rice w egg is the best - make sure to keep stirring!\nand the Ramen is to DIE FOR!", "author": "SF C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "$15 for a bowl, on the expensive side, but good nonetheless.   This place is in an area with a lot of great bars which makes it a logical place to eat at before going out even if it means spending an extra few dollars versus what you will get at your average Korean restaurant.   Wait staff is very nice and made my friend a new soup after she found hers was too spicy.   Definitely worth a visit.", "author": "Brad M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "Place was alright. Service was a bit slow especially when asking for check. Food was good, had the stone bowl with beef.. Decent portions but seems overpriced.", "author": "Chris M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "Excellent food, excellent service and excellent value. I ordered chicken bibimbap to go, and it was easily one of the best meals I've had in a while from Lower Haight. The ingredients were fresh and very flavourful -- and the portions were decent sized, too. I also love that they provide a nice arrangement of kimchi and other delicious, healthy appetizers with the meal. And they're open until 10pm on weekdays, which is super convenient for me.\n\nI'll absolutely be back here. My only criticism is that they could package their takeout better -- with the nice arrangement of appetizers and carefully-constructed takeout platters, it would be nice if they packaged it in more sturdy containers so it travels well.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "Bibimbap was served piping hot, achieving the proper level of rice crispiness. Quality of ingredients is high, although there weren't quite enough of non-rice ingredients to achieve the ideal balance. Prices somewhat on the high side.", "author": "David C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "Average food, above average prices. Unfortunately I don't think this spot will last long. Too weird to be a date place, too expensive to be local joint.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Super delicious Korean food, very good price. Recommendable are the Seafood Pancake, Jhap Chae, Bibimbab, and the Army Stew. They serve complimentary Banchan (small mostly pickled side dishes al la korean), which are very tasty.\nDefinitely get some Makgeolli with Sprite.", "author": "Nik M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "The food is wonderful. The staff is very kind and attentive. It is quite enough for a normal conversation. The interior decor is simple and tasteful. All around a great dining experience.", "author": "Alex U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "The food is terrific.  We both got a veggie stone bowl and devoured them.  The little pickled goodies at the beginning are perfect.  We even got excited about an unusual sake drink.  We're thrilled to have this restaurant in the hood!\n\nBut please, owners, get an atmosphere consultant.  The ambiance is terrible.  The huge tv on the wall dominates the room.  The lighting is cold and unwelcoming (fluorescent, maybe, even?).  The tables are spaced so far apart it feels unwelcoming and awkward.  We asked to sit in the little alcove in the back because we couldn't bear the tv.\n\nFood: 5.\nAmbiance: 2\nHappiness that this food is nearby: 5.", "author": "Jessica M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Today it is my first visit with Pastor Cho. Fantastic foods and service.  Bulgogi was so delicious. They were so kind and charming. Strongly recommended. Bless u.", "author": "Chiho H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "I don't usually write up for review but I decided to do it.\nGreat Korean restaurant..\nVery healthy bibimbap tastes very good...", "author": "david k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "solid korean food at a modest price with delightful service. we always get the bibimbab with various toppings from tofu to spicy pork.... which isn't too spicy. the makgulli is a nice treat. think sparkling sake. the place is clean and quite with subtle ambiance.", "author": "zachary p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "Stopped in for a casual dinner for two.  Based on other reviews we ordered a stone bowl to share, the veggie pancake, the seafood pancake, and the soy chicken.  We thought the \"soy chicken\" would be vegetarian chicken made from soy and were very surprised when it was actually fried chicken.  I would recommend renaming the dish so vegetarians are not confused.  The food turned out to be way more than we thought.  We could of easily split a stone bowl and gotten one appetizer instead of three.  We were very impressed with all of the food.  Great flavors with a little spice but not too much.  We had a nice size box of leftovers we took home because we couldn't eat everything.  Other reviews complained about the price but we thought it was very reasonable for the amount of food we got.  We spent less than $60 for two with drinks.  This will definitely become a regular stop for us in lower haight.  Great addition to the neighborhood.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "The bibimbob is great. Its enough to feed two. It comes with 7 small dishes, but I admit they weren't that great.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "I love this place, and find myself going there every week. The service is always excellent and really attentive, the little starter dishes are delicious and always different, and the bibimbap, tofu soup (seafood and meat mix), and dumpling soup are really good. And that bek se ju (rice wine with herbs and ginseng) is too delicious...", "author": "s b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Great family owned place. Try the bibimbab :) nice people, very neat and clean. Free appetizers and they seem to care about you, isn't that nice?", "author": "Joy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "I really liked it! Cute little restaurant with great atmosphere. We ordered the food for pick up so we had to heat it up at home. That's why the chicken was a little dry. It's pricey so. We had the Tofu soup, spice pork and bibimbap for $52.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "This was some pretty legit Korean food. The bonchon was on point-which is really how you can tell if the korean place is good or not. The bibimbab was freakin amazing!", "author": "Tom P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "Tasty, great service. Got tofu soup and bibimbop, both were delicious.", "author": "J A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-13", "description": "Excellent food with great service. This is not over the top-fake kind of service. This is honest, small business friendly treatment. I'm happy this place opened up in this neck of the San Francisco woods. Try it!!! Ps my vegetarian roommate is happy that they've extended their vegetarian menu... Whatever... :P", "author": "Juan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-29", "description": "Nice place and super clean. For starters, the pot stickers were up with the best - they provide complimentary side dishes of kimchi, radish etc. We had the stone bowls (tofu bibimbam, beef) for maiin course - sizzling long after they had been set down. Beef stew had a good flavor but the broth was a little thin. The wait staff were very pleasant. Price seemed a little expensive but not bad for the meal. In short, a welcome addition to the area - woudl definitely go again and have the bibimbam stone bowls.", "author": "John B."}
