{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "Sun Maxim is one of many dim sum bakeries in the Sunset area. For the price you pay, it does its job; har gao, siu mai, and turnip cake are just a few of the lukewarm options you can choose from. They serve up some decent congee as well.\n\nAgain, Sun Maxim is good for its efficiency and price, not the quality. I don't imagine Sun Maxim is someplace you'd go out of the way for as it's more of a convenience. You order and take it to go, there's not really much seating here so if you want a sit down experience, there are other options. \n\nParking is all street and all that jazz.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "The place is now wonderful looking and could be cleaner.  But I've eaten here 4 times now & it's the food the prices I like. The 煲仔飯 or rice with pork, or salted fish or ribs... steamed in clay pots is like mom's cooking.  I've not had all the dim sum but will try most of them at some point. The 糯米雞 or lotus leaf rapped glutinous rice with bit of chicken in it, looks good and I will try it when I'm hungry.  I always see old guys or old couples eat there.  I'll be a regular when I find the 2 or 3 things I like & have them over and over again.", "author": "Leung T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-16", "description": "Saw 3.5 and decided to give it a shot since I was near. This place is on Irving and there are many places for dim sum. A previous review said \"does the job\" but I beg to differ!! Their dim sum is not stored in a steamer therefore the Har Gow (shrimp dumpling) had an entirely hard shell, and the shell for the chive one was inedible. Also they do not offer a beef Sui Mai; the other kind I usually get since I don't eat pork, so I can't comment but they are kept in the same display.", "author": "Navila H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "There is no shortage of dim sum bakeries in the Sunset but Sun Maxim is able to hold its own. I REALLY like their mochi (which you need to eat the same day since there are no preservatives) and their zongzi (sticky rice steamed in banana leaves). They sell baked rice and claypot dishes too, which I have yet to try but are unique in comparison to the other bakeries nearby.\n\nI found their standard dim sum fare (e.g., har gao, siu mai, dan tat) to be average. Not terrible but certainly not something you'd go out of your way to try. Overall it's an enduring business in the neighborhood and I hope they continue to thrive.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Super tasty stuff at super good prices. This is the sort of place I love to do my \"San Francisco grocery shopping\" - get lunch for the next week for less money (and a lot less time!) than it would cost you to make it yourself. \n\nWhile dim sum places are a good option for this, some dim sum bakeries have started charging for pork buns by the each (instead of by 3). Not here! And oh btw did I mention their steamed pork buns are delicious? The bread is so soft and just a little bit sweet. Perfection in small doughy form. \n\nThe only thing I dinged a star for is that the pork buns are very bread heavy. Not much meat. The pot stickers and dumplings are better values. \n\nOverall I would say this is tastier than the other dim sum I've sampled nearby, but not quite as good a value. Which...it's still excellent!\n\nThe owners are very very nice and friendly. \n\nThey also take card, too, which is pretty uncommon at this type of place!", "author": "Chris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Best place to pick up quick dimsum to-go around Irving street.  Claypot is a must try if you have time.  They also have great congee.", "author": "John D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-31", "description": "Not bad dim sum! I personally really liked it. My friend and I ordered about $30 worth of dim sum and they were all delicious. The pork buns are the best! I accidentally ordered it but have fallen in love with them. Definitely worth stopping by! Of course this place does not compare to the other dim sum restaurants but this place is a good place to Togo and enjoy!", "author": "Grace H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-25", "description": "Great service but a little slow if you order the Claypool so be aware of that. \n\nThe lady is extremely friendly and helpful with trip advise too. The dim sum and buns were really tasty and served very quickly.", "author": "Jia Jian T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "We were looking for dinner on Irving street.  Other places were full, but for some reason this place was nearly empty.  So we decided to give it a try.\n\nSadly, the food was not good.  According to my Chinese friend, this is the worst food she has ever had.  Period.  An insult to the cuisine of Hong Kong.  They put our food in the microwave. \n\nFrom my perspective, I am picky about meat. The pork was tough and had pieces of fat.  \n\nFor the money, you could eat the buffet at Whole Foods.", "author": "Matt F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Mochi was still soft at 5p. The selection was low but I'm sure it's made just for the day. I had a piece leftover I couldn't finish in the morning and texture completely changed (which is a good sign they are made daily).\n\nNeed to come back and try more items.", "author": "Liz N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-06", "description": "Had to come here cuz road construction .. My first time here too.. Dim sum and steam buns aren't smooth and chewy..not tasty good.. Won't be back again..rather go Happy Bakery up the street..", "author": "Crisy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "I come here on Sunday afternoons with my dad in a wheelchair. They have basic but clean tables and chairs in back and a good variety for a small place. The dim sum is good as the fillings are generous and tasty but he wrappers are a little thick. The people who work there are super nice. They also have frozen items to go such as the Chinese sausage rolls, roast pork buns and whole wheat steamed buns. \nThey also have clay pot stews and steamed ground pork with salted fish and slow ccoked pork belly. I need to come back and try these!", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "EVENT: Going to visit some family members for Christmas... so went to buy dim sum... and it was the best idea ever! Old Chinese people loved it! (that's a good sign!)\n\nHere's what I got:\n12 Shrimp dumplings - 5 stars. \n6 Pork dumplings - 5 stars\n6 Pork dumplings wrapped in seaweed - 5 stars\n3 Pineapple bun - 4 stars\n3 Chive dumplings - 5 star\n6 BBQ Pork buns\n3 Taro cake - 5 stars\n4 Boxes of Stick Rice\n\nPrice? $45!!!!!!\n\n**OVERALL: cheap and good! My old Chinese family members loved it... no complaints!", "author": "Mindy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Best bang for buck takeaway dim sum in the city. My personal favorite is their baked bbq pork buns.", "author": "Kailyn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-08", "description": "This used to be our favorite to go dim sum place but they have gone down in quality and sells day old food. The ha gow was hard and tasted spoiled. Worse of all was the mochi cake had a hair in it. Yikes!", "author": "Karen L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "My boyfriend and I love this place. Their baked pork buns are filled full with delicious bbq pork. Their dumplings are HUGE and so juicy! Every time we come to San Francisco we stop by on multiple occasions.", "author": "Nanu S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "I liked the salted fish and meat clay pot rice! Also, they really do have pineapple chucks in the baked pineapple bun.", "author": "Yvonne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-28", "description": "I was just driving southbound from Petaluma to South S.F. Last sun and saw a load of Asian restaurants on Irving St.  the wrappers for the harr how and spinach shrimp dumplings were so perfect . Soft and stretchy.even after they cooled to room temp. I will be back next time I travel by way of Golden Gate Bridge . The parks Ng was free on the meter Sunday which was a bonus!", "author": "Kay L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-22", "description": "Terrible. Awful. I bought 3 steamed custard buns and they were SOUR!!! The custard filling was bright orange and had huge clumps in it. 10/10 would not recommend their steam buns. The bun part was chewy and not fluffy. I thought \"maybe it's just me, let me have my siblings try it and see if it tastes bad.\" I gave it to my sister and brother and they both SPIT OUT THE BUNS ON THE FLOOR. LITERALLY. So please, do not order their buns there. It was my first time there and it's my last.", "author": "Amanda L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-19", "description": "I happened to be driving through this part of town when my friend had a craving for dim sum. I did a yelp search for what was nearby and we decided on Sun Maxim. I was able to park within a block around 2pm on a weekday. It has a diner/ donut shop feel. Finding a place to sit was no problem. We ordered a good amount of food and the bill was close to $12 so that was pretty cool. We were greeted with some tea. The customer service was great, fast service and very friendly.We ended with a sweet roll that had some meat in it, it was quite tasty. There are no frills here and the food is quite mediocre. Not bad but nothing to be impressed about.", "author": "B T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-06", "description": "The dim sum here is cheap yet delicious! I had major cravings for siu mai and har gao, so I made a quick stop here for lunch. For under $4, I got six huge pieces total of yumminess! :)", "author": "Connie X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Get here early for your fresh and tasty dim sum favorites, they sell out of a lot of popular items by 1-2 p.m.  I was lucky to pick up what they had leftover from the lunch rush around 4 and after reheating it all (correctly) I had no complaints and will hit them up before lunch to try the rest of what I couldnt get.  Counter ladies are friendly with some limited English skills, but hey, just point and tell them how many and it's all good!", "author": "D R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "This place has the best of the best Chinese yellow noodle with soy sauce. There is absolutely nothing to compares with around this area. they have may other finger food as well. \n\nThe clay pots are also to die for but I'm not into sweet stuff so I can't say anything about that.", "author": "Neo N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-03", "description": "Poor experience here. Long line to order food, service is extremely slow. Took 10 mins with 3 people in front of me. Slow to refill food, placed order for some buns but not available and was told the kitchen is steaming it now with no eta. Try to pay with credit card and was told $10 minimum for cards, there are no signs anywhere to indicate minimum charge. Needs to improve on efficiency and customer service skills. Very disappointed.", "author": "Von R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "Can you keep a secret?  Sssssshhhh...\nThey have the best \"Soy Sauce King\" stir fried noodles (See yiao wong chow mein) (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q) that I've had.  This small dim sum location in the Inner Sunset makes me wonder how much better the food quality of these neighborhoods are than Chinatown.  For me, what makes this dish special are the ingredients, flavor, and preparation.  First, they use egg omelet strips, whole chive slices, and sesame seeds in making this dish.  Next, the flavor is not overly salty, which commonly happens since the namesake is Soy Sauce King.  Finally, the most impressive thing is that, given that this is a takeout place, their food is normally reheated.  One peeve of most Chinese takeout food is that the grease/oil settles to the bottom of the container, reminding us of the damage we will be doing to our heart.  There was no visible grease or oil on my plastic box nor, after reheating in another bowl, in my eating bowl.\nAnother favorite is the Sticky Fried Rice (Lo Mai Chow Fan), mostly found in sit-down dim sum places.  Like the noodles, the rice is flavored well and not too much dried shrimp, one of my least favorite ingredients.  \nCome by here if you need a quick bite or want to take something for a future reheated meal.  I don't think you'll be disappointed.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-09", "description": "..my friend and I have been to Sun Maxim a total of two times and both have been together for lunch (+ we also did take out some mochi and dim sum for dinner). \n\nWhen you walk in, you are met with the take out counter which houses the mochi, dim sum, baos, and so forth but as you walk further there are tables and chair for a sit down meal - and I would say for around $7-$11 you can get a pretty good meal. \n\nOrdered:\nBaked Pork Chop with Cream Sauce (they also have Red sauce) over Rice\n\nI enjoyed their baked pork chop and the cream sauce had chunks of mushroom, even though I do think that the baked pork chop was a bit too salty for my taste but good thing the rice did not contain that much salt (but the rice did have egg mixed in). \n\nI also ordered spinach shrimp dumpling and chicken siu mai to go and they were pretty good portion sizes, I don't think they are anything to write home about but if you are in the area you can definitely get some to fill your hunger, you definitely don't have to drive far just to try this place. Also, the last time I had come, I ordered the mango mochi and what is good about their mochi is that they contain real fruit chunks inside which was a surprise for me.\n\nEDIT: oh and the people that work there are pretty nice and one of them speaks English pretty well :)", "author": "Mona L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "Love bunny and I visited Sun Maxim's Dim Sum while passing through. We had a great time and will definitely return. (She says early tomorrow morning.)\n\nResponding mostly to the previous reviews:\n\n(1) mid-afternoon visit, lots of variety in stock, was able to mix-and-match items on plate to try a bit of everything*\n\n* not even close to \"everything\" -- they've got way more than any group could work through in one or four visits...\n\n(2) very friendly and helpful staff, eager to help us check things out\n\n(3) very inexpensive, very fresh, very tasty, worthwhile visiting when you're near-by. (If you live across town near another dim sum place it's probably not worth your whining about it...)\n\n(4) very clean, no waiter, you're actually going to have to walk back to the counter to eyeball the tasty things and order what you want to eat\n\n(5) they've got a microwave, and when something was \"warm but not hot\" they were happy to zap it for us\n\n(6) teas, coffees, other drinks, sweet milk, etc. More than I was able to wrap my head around.\n\nAlso, absent-minded love bunny left her wallet on our table in the back during one of our frequent flights to the front counter. One of the cooking staff noticed and stood guard until we returned. THAT'S IMPRESSIVE and says a lot about the working environment there.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "Very friendly staff, fast service, and inexpensive food! This experience costed a total of $8.10 =)\n\nTaro Pancake ($1.85_3 pieces)\nI've never had Taro Pancakes before but I thought I'd try it out. The taste reminds me a bit of dark jasmine tea? I love tea so I'll buy this again and share it with my dad...tea addict and see what he thinks. But it's soft and easy to eat I think there's chunks of taro inside too? I don't know but I'm going to semi pan fry one of the pieces to see how it tastes crunchy on the outside later this evening.\n\nShrimp Dumplings ($1.90_3 pieces)\nI've always ordered shrimp dumplings every where I go, it's one of the best things for dim sum in my opinion. What I like about this store's version is the size isn't huge but it's not tiny either. Also the flour wrapper isn't really thick or too thin that it breaks when it's steamed and just looks ugly. The inside is good because they don't use huge pieces of fat as stuffing instead of shrimp like some places, I can actually taste shrimp and when I open it up there's small shrimp that aren't tiny tiny.\n\nChive Dumplings ($1.90_3 pieces)\nI got addicted to chive dumplings because of my sister...these ones are a bit different to what I'm used to, they're wrapped flat instead of like a potsticker. It has lots of chives and the wrapper isn't chewy, however the one thing I noticed is it's a bit oily so think just one order (3 piece=1 order) is perfect.\n\nChicken Siu Mai ($1.80_3 pieces)\nI've also never tried chicken siu mai, I've always had pork so new experience! It's interesting, it's chicken and ginger, I love ginger so definitely a plus! I'll order this again to have my family try since the other places we've been getting our siu mai are failing our expectations.\n\nConclusion: I will order again for myself 100% shrimp dumplings, chive dumplings, chicken siu mai! Not too sure about the taro yet it might be because I didn't grow up eating it so it's a bit different but I guess for those who've had it before can do a better review on that than I can.", "author": "Olivia O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-10", "description": "Decided to try this place since I was on Irving and Good Luck Dim Sum on Clement is closed on Tuesdays. So, anyway, I gave this place a shot and their dim sum is just ok. \n\nI got one order of regular shrimp dumplings and they only had 2 left and because they sell them in 3 pieces each, the girl asked me if I wanted to try the shrimp and corn dumpling and I said ok fine. Then I bought an order of shrimp and spinach dumplings. My total came out to $3.80, which was pretty cheap. \n\nThe plain shrimp dumplings were a disappointment. They really lacked flavor. But, the spinach and shrimp dumplings were actually pretty good and I had never had them before. If I come back here, I'd get them again. The shrimp and corn dumpling was just ok. It tasted doughy though. \n\nThe girl working at the time was pretty nice even though she didn't speak English that well. She tried her best to explain to me what they had to offer.\n\nFYI: they do accept debit/credit cards, but with a $10 minimum.", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Great place for dim sum takeout! Very inexpensive! The only caveat is the parking & long lines once in a while.", "author": "Roland F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-14", "description": "I visited Sun Maxim's Bakery on a Friday afternoon around 2:00 p.m. to grab a few sweet snacks before my drive to Sacramento.  There's a large \"grand opening\" sign out front and the inside is definitely nicer than I expected.  It's not fancy at all, but nicer than some hole-in-the-wall dim sum/take-out places that I've seen.  They do have a couple tables too, if you want to eat there.  \n\nI ordered some mochi-like goodies.  I don't know what they are actually called; but they offer a variety of flavors: strawberry, pineapple, mango, durian and peanut.  They are very brightly colored and very cute looking.  They are 3 for $1.80 (I bought them as a gift for someone).  I got to try out the pineapple mochi and it was pretty tasty.  Not amazing, but pretty good.  The mochi part actually was not flavored, but it was filled with some chunks of pineapple and some sauce.  It was sweet and tasted fresh.  \n\nI also ordered some other treats that had a doughy, mochi like texture, but were more flat, like mini pancakes.  These were filled with either red bean, or a custard-like filling- I liked both of them and they are cheap ($1.60 for three).\n\nOverall, this seems like a solid bakery to get some snacks.  They have quite a variety and had a good amount of everything in stock, even in the afternoon.  It's not fancy, but it works.  They also have dim sum and other savory treats.  For now, it's a very solid three stars; but I'll be back soon to try out more treats.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-13", "description": "I came in today and bought 12 steam egg yolk buns. This all started off when one of my mom's colleagues told her the steam egg yolk buns are delicious. She tried some herself and I also tried this item myself.\n\nThis item (#0105) is priced at $1.80 for 3 pieces - very reasonable. Most items on the menu are under $10, it is priced right and designed to fit anyone's budget. The size of this bakery is suitable for 20-30 customers.\n\nI can't give judgment about other food and beverage items at this moment. This is something I have to try out the next time I am here. The service here is very good. There were 2-3 staff members working the front end and the rest of them worked in the kitchen. When I walked in today, I noticed how clean this place looks. It is always a good thing staff and customers. This bakery is suitable for breakfast, lunch, snack and an early dinner. There is a restroom in the back right where the dining area is and it's a convenience. Actually, there are 2 seats in front and the rest the seats are in the back.\n\nPayment: Cash, Credit and Debit*\n\n*Even though they do accept credit and debit cards as acceptable forms of payments, the smartest move is to bring cash with you. Cash, Credit and Debit are known acceptable forms of payments at a number of businesses. However, it will still make a lot of sense to bring cash in case some places might have a sign stating \"CASH ONLY.\"\n\nParking:\n1) Street Metered Parking\n2) Residential Parking after Noriega & 27th Ave\n\nPublic Transportation Nearby:\n- 16X Noriega Express (7X Noriega Express)*\n- 28L 19th Avenue Limited (28R 19th Avenue Rapid)*\n- 71L Haight / Noriega Limited (7R Haight / Noriega Rapid)*\n- 28 19th Avenue\n- 71 Haight / Noriega\n- N Judah\n- NX Judah Express\n- 29 Sunset\n\n*Service available Monday-Friday during rush hour commutes only\n*29 Sunset has a stop on Lincoln Way & 21st Ave", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-02", "description": "Love this place!\n\nI prefer their I'm sum over happy bakery!\n\nTheir hai gow is steam to perfection. Not dry at all.\n\nPlus they accept cards!", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Don't know what the haters are talking about. Dim sum is more a breakfast food, so yeah if you get there in the late afternoon they run out of stuff.\n\nMy roommates and I are regulars here. The shrimp dumpling alone and with spinach are my go-tos; I also love the giant pot stickers and turnip cakes and the rice wrapped in lotus leaf. Prices are cheap, as I always end up getting more food then really needed. The workers are nice, haven't had difficulty communicating or anything, and if all else fails just point at the stuff you want.\n\nWe've tried some of the other dim sum places around (Happy Bakery, TC, etc) and we always end up back at Sun Maxim's. I think it's the best around the area.", "author": "Kayla F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-03", "description": "Great service! Wish the dim sum was warm when served. The restaurant is suuuuper clean compared to other cheap dimsum spots. Steamed buns are so soft and yummy! Strawberry mochi is filled with fresh mango 3/$2! They also have green tea mochi filled with red bean paste rolled in coconut :) will be back!", "author": "Danelle T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-13", "description": "This would be classified as a \"nicer\" dim sum restaurant/bakery. \n\nI came here for the first time this past weekend. I was not familiar with Sun Maxim's, but according to their Yelp photo and Yelp reviews, it looks like it has been remodeled. \n\nI was just looking for a quick snack after my morning exercise. I only ordered the pork siu mai (3) for $1.60. This was a pretty good deal, however I'm not sure if they will let you mix & match? Because I usually like to order a mix of dim sum, this will be good to find out on my next visit. On the dim sum itself, it tasted just like any other - consistent, good but nothing that stood out in particular. I'll have to go back to try more.\n\nAside from a wide array of dim sum, Sun Maxim's also serves a few hot dishes, pastries and sweets. Their chicken & mushroom clay pot for $5.99 looks good so maybe I'll order that next time!", "author": "Mari S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-30", "description": "I personally don't eat dim sum a lot, but I really fell in love with it after I went to this place.\nYou guys should try their bbq pork bread, they are the best!", "author": "Kenny I."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-17", "description": "Yuck! Walked into Sun Maxim hoping for a great dim sum experience. I got the exact opposite instead. As you walk into Sun Maxim, you will notice a counter full of the different choices of dim sum. All of the dim sum looked incredibly old and disgusting. I took so long to pick because they all looked like they were going to give me food poisoning. I ended up having to buy the shrimp noodles with XO sauce. I thought this way they'd have to cook it fresh. I was wrong. \n\nI don't know why i didn't just walk out the second I noticed it was taking so long to pick, but I guess I was just so hungry I couldn't think. It was a horrific experience when I revived my noodles. \n\nWhen my noodles finally arrived, I was so happy to see them come out of the kitchen looking freshly made... But were they? Okay, the noodles were warm and flavorful but the flavor was disgusting!!!!!! The sauce was way too over powering and the drink I bought to go along with my food seemed off. All in all, I will not be returning to Sun Maxim.", "author": "Emmanuella Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "I ordered 100 peach buns today for Self Help for the Elderly to celebrate Aug birthday Moms & Dads. Owners, Tony & Emily are very kind with warm heart to design those cute, yummy & fresh buns for me. I saw great smile & happy faces when each one of them held in their hands. Staffs are polite & pleasant. Will visit this place again & again.", "author": "Wendy W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-26", "description": "The egg tart was totally burnt on the bottom. It was so gross. \n\nThe Chinese donut was really hard and full of oil. It was probably refried from a different day. Not fresh.\n\nAll of the food was not warm. Who knows when they made it?!", "author": "J A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-26", "description": "Been here a few times just for dim sum.  Occasionally there are lines but not too bad.  I'm pretty picky with my dim sum, and overall the quality is just okay.  I wouldn't order the salted pork and preserved egg porridge here though.  It tasted like MSG soup.  I've tasted better dim sum elsewhere but it is pretty cheap and nearby, so I wouldn't complain too much.", "author": "Teresa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Excellent sesame balls and good friendly service. BBQ pork buns are pretty good as well :)", "author": "Michael B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "My mama told me to write this. Why so? Because she has a love-hate relationship with this place. And I completely agree with her on this. \n\nHere's the love - they have the best black sesame rolls and water chestnut goh in the city. They are smooth, light, and flavorful. It's like eating jello. Nom. \n\nHere's the hate - their fruit mochis have passed their expiration dates. My mother have order these mochis on three different occassions, and she has been duped. The go straight to the garbage can because no one in my fam bam wants tummy problems. \n\nSo, be careful what you order here. You may leave happy as a clam or frowning like a sad clown.", "author": "Mabel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "I don't know what it is about this place, but we just keep coming back.\n\nWe went with all sweet last time so we went with 67% savory this time.  The Steamed BBQ pork buns were find according to the boy.  The Baked BBQ pork buns had less filling than the steamed ones & the bread was way too sweet.  The Custard pancakes I thought were going to be seared since that's what the Chinese name says.  Unfortunately, they were not crispy @ all.  IN fact, they were really doughy & chewy.  There was a good amount of custard filling but not much flavor though.\n\nI think we've tried almost every sweet dim sum in the store; guess the next trips are ging to involve more traditional Chinese savory treats.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-18", "description": "It looks like this place got a new owner since the last time I came here.  We bought some pineapple and cocktail buns.  We also got the green onion buns.  The lady behind the counter talked us into getting a green onion roll (tastes just like the bun but is shaped like a small jelly roll).  All bread for 60 cents each.\n\nThe rolls are huge!  Cocktail buns are good.  I do not like the green onion bun.  The Kid didn't like the roll either.  The shredded pork is a major turn off.  I don't care for it.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-09", "description": "Nice clean fair priced dim sum bakery.  Friendly and fast service.  They also have other foods aside dim sum, and a fridge area with pre-made foods to take home.", "author": "Joel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-21", "description": "It's an interesting twist on dim sum - usually when you go into a dimsum togo place they have the big ol pots of it in the little round containers you'd see at a normal dim sum place.... but this place is a little different - they have all the dimsum in a CASE - yeah like a donut shop or pastry shop presenting everything. It's nice - only if the case weren't so steamy. It looks like a good presentation, but problem is when the dim sum comes out it's not that warm or steamy. \n\nSo about the dishes:\nThe taste of the hargow and the shu mai are standard, nothing to rave about.\n Egg Tarts - okay\nbarbeque pork buns are decent - not too big, which I like\nThe congee with black egg and pork is good - not too salty.\n\nMy advice i that it's always cheaper to buy things in 3's here, if you buy one sometimes it's more expensive than just going and getting 3. \n\nIf you don't speak chinese, you're going to have a really hard time communicating to these people what you want, so this is where your pointing and hand gestures need to come in for this place.\n\nOverall: This isn't somewhere you rush into for dim sum, just somewhere you stop by when you're in the neighborhood when you have a craving.", "author": "Christine B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-31", "description": "This is one of the only dim sum places on Irving that I found accepts card. I was walking down the street and most places only accept cash - so I was happy when I found this place.\n\nI love dim sum that's hot and ready to eat. The dim sum here is sitting behind glass and the counters, so it comes out pretty cold and I have to get it microwaved. I'm sincerely hoping it's refrigerated so germs don't grow on the food if it's sitting in room temp for hours.\n\nI've been here twice and always order various dim sum items to go. The potstickers the first time were good. This time, it tasted weird and mushy. Opened it up and it was pink inside. Not sure if it was cooked, so tossed it into a pan when I was ready to eat.\n\nPrice is pretty good. Street parking is really difficult. And again, they accept credit cards.", "author": "LA H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Their onion roll was delicious!!! So far, the only place I know that have dry, shredded pork inside their onion roll=). However, that was the only thing i purchased  at Sun Maxim Bakery. \n\nThe lady behind the counter was super friendly compared to the other DIM SUM place a few stores down the block.", "author": "Jen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-01", "description": "It's pretty hard to mess up Dim Dum To Go, but this place managed to do it. Won't go into details, but there were all sorts of problems. The food is decent, but I wouldn't go there again considering the long wait, poor service, not receiving 2 out of the 5 items we ordered, being charged the wrong amount, and then being asked to pay more money for our order because they couldn't get it right. \nI rarely write reviews, but hey this place really deserved it.", "author": "Jessica Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-24", "description": "I didn't like that they had to microwave my ha gao or siu mai when I stopped by this morning for a snack.  Did that mean it was from yesterday? did that mean it was luke warm?  \n\nthe dim sum itself was fresh tasting, but the microwaving was off putting.", "author": "Sandy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Awesome place for Dim Sum to go! For some strange reason I always go for the Shrimp Dumplings, Shrimp & Spinach Dumplings, Pork Shu Mai, Sticky Rice, and Meat/Preserved Egg Congee.  Cheap and delicious!", "author": "John N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-13", "description": "-new kid on the block?  \"Grand Opening\" \n\n-apartment hunting interim, meaning Lunchtime before crossing back North to the Richmond for an 2 p.m. open house.  \n\nHong Kong ladies in snappy pink shirts & matching cap . . . cheerful and attentive, one particularly helpful & encouraging, I ordered my Taste Test Sampler- one each of the Chives dumpling, Woo Gawk, Jow Hom Gawk, Naw Mai Fon; all larger than life sized at a fraction of sitdown Dim Sum experience.  Steve, dessert mochi custard-filled pan fried patty.  & to sweeten the deal, she threw in an almond tofu drink (hot)!  All the while explaining the HongKong style casserole plates (\"dine-in\").  All this for UNDER $8.00.\n\nDRAMA!  Circling indefinitely on Irving for Mother's Day \"out\", there WAS road rage among the Chinamons. I parked in the Walgreens lot.", "author": "Clifford L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "Since this place opened over a year ago (or remodeled- I'm not sure) I can't stay away. Best walk up dim sum. When you just want a snack or need to bring a dish for a party definitely put this place on your short list of must try. Beware: parking isn't the easiest in this neighborhood.", "author": "Julie Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-20", "description": "\"grand opening\" exclaims the banner. certainly the premises looked new. the take out section is in front. once must walk past the cashier to enter the dining area. \n\nonly dim menu visible. plastic case with dim sum steamed  over. couldn't see.\n\neats: pork siu mai (3/1.85)\n-meatball texture, dry, msg taste\n-chicken bun (3/1.80)\nnice bun denseness, dry chicken taste\n\nleftovers:\n-probably the most expensive dim sum and (worst tasting) on irving\n-service cordial..\n-msg aftertaste\n-cash only", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "I try this place almost 3 times a week , mostly it is my best breakfast choose in sunset area , their dim sum is so good , never fail , the BBQ pork bun is the best item , the shrimp dumpling is awesome too", "author": "joe c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-18", "description": "One star bc I actually like the baked rice. \n\nDo not ever dine in unless you want to be ignored. They have a decent sized dining area but NO WAITER!\n\nORDER TAKE OUT ONLY!", "author": "A b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-04", "description": "We had high hopes since this was a take-out dim sum joint. So we looked at the menu and made our choices as we waited patiently on line. It's our turn and my BF says, \"An order of the pot stickers.\" They were all out. Order of the shumai? All out. Order of the BBQ pork buns? All out. The person behind the counter gestures to the display and says, \"We have chicken buns and dessert.\" How about the claypot rice? That will be 20 minutes. \n\nNow maybe if the person helping us were a bit nicer, we would have had a pleasant experience. Because that couldn't possibly make up for what we did end up getting. Steamed rice with a few mushrooms, red bean pancakes, some kind of fried meat dumpling, and chicken/veggie steamed buns. \n\nI haven't tried the steamed rice with mushrooms just yet but I'm not sure if I want to. The red bean \"pancakes\" were actually just mochi and they were good. But the fried meat dumplings were cold, oily, and terrible tasting. Not sure how she convinced us to get in lieu of the potstickers that they were all out of. The chicken and veggie steamed buns were the only redeeming factor but would I come back? No. Would I ever come out of my way to get here? No.\n\nAlso, I wish that when the person selling us all of this stuff signaled that we took a closer look at the displays to see what they did have left that everything was label. There were no labels in the displays so we had no idea what was what. Also, maybe consider taking down things from the menu if you don't have them anymore. One naturally assumes that if you have a kitchen in the back and a menu on the wall that the items desired may still be in stock.", "author": "Shauna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "Just moved to the neighborhood, and happily stumbled into this Dim Sum Bakery. I call this one the \"sexy modern Dim Sum\" place. Its clean, and the perfectly uniformed pastries lining the case windows just beg to be taken home and delightfully devoured! \n\nI really like the mix of old and new from this bakery. While I thoroughly enjoy the old world authentic recipes, they recently remodeled the place into a chic little eatery. Now I get to do without the poor dead hanging ducks and squids in the window! Lol... I get it, I appreciate the culture... I'm just personally skid-ish around whole dead animals. So in my personal opinion, since these are not in the windows, win-WIN! I get my yummy dim sum, and a cute space as well. \n\nNow onto the food! So far, So good! The dumplings I've had were all super tasty, shrimp and pork. The chicken bun was good, a little bread-y for me... I just tear off what bugs me and keep eating! The custard tarts are ridiculously good. And today, the sweet smiling lady  behind the counter enticed me with fresh mochis! They had just come out. There was Strawberry, Mango and Pineapple. Such beautiful colors, a rainbow of flavorful fun. There is REAL fruit inside these babies! no paste. Real. Live. Fruit! So good. I liked the mango and pineapple mochi, but I LOVE the Strawberry mochi.  \n\nI cannot wait to explore all they have to offer here, with the max item costing  $7?!? Cant beat that... I saw they have a baked pork chop? I'm so getting that next!", "author": "maria K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "I used to work nearby, so I have seen this dim sum place before their renovation and after. Before the renovation, the food was quite bad. But after the renovation 2-3 years ago, they offer a wide variety of food options and the quality of food is much better now. Recently ordered catering for my non-profit mixer, the egg rolls and Siu Mai were gone within 30 mins. They were very fresh and tasty. The tips would be ordering the food at least 30 mins ahead of time. The owner was very nice to help lift the food into my car. Will come again.", "author": "Gogo W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "I only come here for one thing - Seaweed Siu Mai.  They also have regular Siu Mai but I'm a carb-hater and opt for the seaweed instead.  It's lighter than the original and the seaweed is not what I'm used to but still tasty.  I've also tried their Chive Dumplings but I could easily pass on those next time and get two orders of the siu mai instead.  \n\nSomething I did notice was how cold the food is.  Lukewarm food is the worst. Blech.  And typically, if I'm ordering dim sum to-go, it's going to get eaten either in my car or on the way to my car.  Really disappointing that my food was not hot!", "author": "Helen V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Great dim sum!  Y first time there would always go back!   We got a big platter for the oscars and it was wonderful!", "author": "Jeff J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-18", "description": "3/5 delish.\n\nthe har gow has a thicker skin than i'd like that dried a bit, but the filling was solid.\n\nthe pork siu mai is great, the meat isn't that gelatinous glob that you'll find elsewhere, there are distinct chunks of meat. overall, great  and cheap take out.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "I have been here for many times! They have really Good quality dim sum, and their price are also very cheap as well! Their dumpling are the best !", "author": "Chloe W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-24", "description": "The worst place for takeout dim sum on Irving St.  Not only are some of the items not fresh, they don't even look appealing in the case.  \n\nThe menu is in English but the woman who helped me did not understand that I wanted congee.  I tried saying congee, rice soup, jook and porridge and she still didn't have a clue.  She understood the pork part and went to fetch a pork bun.  If you want some, point to the crock with the congee instead.  \n\nDim sum is 3 for $1.50 which is the standard price (same as Happy Bakery).  Their buns are cheaper than most places though, but you get what you pay for.  They have baked buns, steamed buns, dim sum, Chinese rice tamales, egg rolls, sweet rice in lotus leaf, rice noodles and some cooked dishes for the lunch plate special (2 items for $3.80).  \n\n* Steamed chicken bun (50 cents):  The dough is too dense and sweet, tasted like steamed cake rather than good bun dough.  The filling is too salty.  Also the bun seemed like it had been sitting in the steamer too long.  Worst chicken bun I've ever had.\n* Chinese red bean glutinous rice pancakes:  Chewy and thick, not rubbery.  Not bad but too greasy compared to other places.  \n* Pork & preserved egg congee ($1.50):  Seemed okay at first (good consistency) despite the dry pork bits but then I noticed an unpleasant sour aftertaste\n\nTables are available and you can also buy coffee and drinks there.  They've been around for a long time and the shop looks a bit junky - but that's what most takeout dim sum places look like.  \n\nCash only of course.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-08", "description": "My friend was 20 minutes late to his class already and we needed food fast.\n\nProbably not the absolute cheapest Dim Sum you could find, but pretty good on the run. The buns are HUGE. I recommend the steamed pork.\n\nAll in all, yummy for a quick meal.", "author": "Meg T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-28", "description": "I worked two blocks from Sun Maxim's and fell in love because I was addicted to their sesame balls. \nI love their sesame balls and they sell 3 for like $1.60. Definitely my guilty pleasure. Other than the sesame balls, they have good, inexpensive dim sum. Their rolls and buns are pretty good, so is their rice and chicken. I would stop in here regularly for lunch and always enjoyed it.\n\nI will definitely miss my easy access to Sun Maxim's.", "author": "Denise S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-08", "description": "We were across the street at Wonderful Foods, getting our bubble tea, when we were attracted to the \"Grand Opening\" sign in the front of the store.  We decided to get some dim sum snacks from this take out place.\n\nWe had the pork dumplings, turnip cake, and special bao.  I have to mention that food gets cold pretty fast in SF, esp when it's 50 degrees out!  When we first got the food, it was piping hot!  But when we sat in the car to eat it, it was already cold.\n\nThe food was just average.  Nothing special about the pork dumplings and turnip cake.  I think Chinatown was better.  The bao had almost everything in it - chicken, pork, lup cheong, mushroom....  Thought it would be juicy, but since it got cold already, it wasn't.  The price is pretty cheap!  I think we paid less than $5 for this snack!  Not bad for a $5 snack, but I've had better.", "author": "JME C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "New owner(s), but they kept the old name. This is the best take-out dim sum place in the Sunset. I like the fact this place is new and clean. Also they don't use cheap cuts of meat; unlike some of their competitors down the street that uses meats that are fatty and gristly. \n\nThe steam pork buns are my favorite and their ha-gaw is pretty good too; mango mochi is nice and soft. The only set back is the porridge, which I thought was just okay. \n\nI'm a fan and will return when ever I'm int the Sunset.", "author": "J. Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-01", "description": "TAKEOUT DIM SUM\n\nI can't help but think of an episode of Kitchen Nightmares with Gordon Ramsey when i look at this place. The picture on their yelp profile is drastically replaced with the remodeled interior, new showcases, new awning and inviting atmosphere. Walking down irvine, I did a double take, thinking twice about trying out a new dim sum place. The menu board is easy to read with offerings of normal dim sum items: shu mai, bbq pork buns, custard buns. They also have mochi with fresh fruit in them. On top of the counter were small togo boxes of fried noodles and fried rice. I hope this is prepared daily, but even if it is there might be serious food healthy safety issues with leaving them there for the whole day. They have a lot of pictures showing they specialize in clay pot rice bowls.\n\nI ordered:\n*Pork shu mai - flavor was right but unfortunately they weren't as hot as I wished they were\nCustard bun with crispy top - tasted different from other places, with a hint of pineapple\nMochi (mango/strawberry/pineapple) - not for me, just didn't live up to its appeal.\n(*recommended)\n\nI'll probably come back one day to dine in to try one of the clay pot rice bowls. Otherwise, I'd advise to stick to normal dim sum items. I like what they've done to the place, but I only wish the quality of food reflected their design changes.\n\nParking: not difficult during metered times on weekdays, tough on weekends\nWait time: none, nice line of customers, unlike more traditional places you have to shout over old Chinese ladies.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-06", "description": "I went here during afternoon. Nearly everything was sold out and what was left was old. I'll have to come here much earlier to get anything decent. I'm guessing the place isn't popular enough for them to keep cooking new items.\n\nThe store is still quite new, so it is very clean.\n\nThings that are somewhat unique to this dim sum joint: mochi, noodle plates, congee, and sweet rice with chicken.\n\nWhat I ordered:\nBBQ pork bun - solid, but nothing special\nshrimp and chives dumpling - old, greasy, disgusting\nsweet rice with chicken (Lo Mai Gai) - this was a first for me so I enjoyed this. It wasn't spiced well or anything but it was fun unwrapping a lotus leaf, and finding assorted meats within the rice. Mine had a piece of sausage inside of it!\n\nI'll have to give it another try earlier for more dim sum or one of the larger plates. Until then its just another cheap dim sum joint.\n\nEDIT:\nI ordered pork sui mai at 2PM and it was really good. It was mixed with shrimp so it was flavorful, unlike most pork sui mai. Maybe there's hope?", "author": "Rahil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-24", "description": "They have really good fruit mochis here. They have strawberry, pineapple and mango. I like strawberry the best. Everyone I know who's tried them loves them. My parents gave a few boxes of these mochis to their friends, I happen to be friends with one of their kids. Right after she tried one she called me up to ask me where we got them from so that her dad could go buy some more.", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-28", "description": "This place has OK dim sum (shu mai, har gow, steamed and baked pork buns) for take out but they have really good tea. I suppose that balances out although you can't really fill one's belly with tea so it gets 2 stars.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-25", "description": "A friend of mine lives upstairs from this place and it cracks me up how the Chinese ladies who work here have started giving him the free coffee hookup. \"You live upstairs?\"  they said one day, pointing to the ceiling. \"Yeah,\" he said, flashing his sheepish smile that's gotten him free sh*t all over the city. Am I jealous? Noooooo.\n\nHey where's my free coffee, dammit. \n\nEnvy aside, this place is pretty cool (and I know I shouldn't be envious because my friend has bought so much stuff from that place over the years, he's probably earned it!). Their food is a lot like the food I grew up with in Hawaii. You can get rice cake, bean cake, taro cake and these really delectible, greasy sesame seed rolls (here's a pic http://www.yelp.com/biz_photos/kWBDP3TampJ03W0Mn9erxQ?select=6BQPbmGbqeoQ2QKTovfERA) and it's all cheap, cheap, cheap.\n\nThey also have a good assortment of boxed carton drinks that are like no other \"American\" drinks you'd typically find in a drink section (see pic http://www.yelp.com/biz_photos/kWBDP3TampJ03W0Mn9erxQ?select=02q_CrXzoPT6Ek9NbwIEZQ). It's like an adventure to try the different varieties because I can't ever seem to tell what the heck it is and have to go by the cartoon pic on the box (I can't read the description printed in chinese). Luckily, every one I've tried so far has tasted good, and they're inexpensive. Their guava juice is amazing (I think it's made from green guavas as opposed to the ripe kind, and I like this type better). They have a coconut drink, sugar cane drink, taro drink and a few others I haven't tried yet but have been meaning to. Sometimes they sell out of the ones I want - like the coconut or the green guava - pretty quick.\n\nAnyway, my friend just called me today to let me know about his latest coffee hookup (well aren't... you... special), which reminded me to do this review. At first I was like, dude, those women want to see you naked. But apparently even the guy who works there gives him the hookup too. I think it's sweet that they're offering this neighborly gesture (they only started doing it once they realized he lived upstairs). It's always cool to have freindly neighbors. \n\nAnd coffee to go with your rice cake.\n-------------------\nNOTE: they just changed their awning, about one week after I uploaded  a picture of the first one.  http://www.yelp.com/biz_photos/kWBDP3TampJ03W0Mn9erxQ?select=1RnCkD4SHhlrzxkcbBIJag\nNow the name \"Sun Maxim's Bakery\" is mostly hidden behind a tree in front of the building, but if you can read chinese characters you're in luck.", "author": "Laura S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "Rushing to work, I decided to stop here for their Mochi that comes in three varieties, egg custard, brown bean and black bean.  After I got to work I come to find there is mold on each of the ones  that she gave me.  I'm sorry but I just made a decision that I will not go back there.  Before she put them in a bag I asked her if they were made today and she said\"yes\"................I think not.  Buyer beware!  I am a little grossed out because I took a bite out of one of them!", "author": "Laurie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "They just remodeled it! The new ambiance reminds me of Hong Kong! I love it! Looks so much more clean and attractive. Did they change owners though? The mochi is still delicious (Mango in particular) but it does taste slightly different!", "author": "Chantel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "Ordered shrimp w chives - known as steamed dim sum. Too much chives barely any shrimp. But it's a really good place and great service. I'll try the other dim sum. My fave shrimp dim sum is another place a few blocks away.", "author": "San C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-19", "description": "I love getting dim sum here. It's always super fresh first thing in the morning. It's really good and very reasonably priced, cheap even. My favorites are the shrimp dumplings and pineapple custard buns. Two can get stuffed for ten bucks here.\n\nThey did remodel and it looks great! They also have some refrigerated stuff to take and steam. Nom nom. I haven't tried that, but it looks good.", "author": "gabby m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "This was my first time been to this restaurant. Personally I think that it was not expensive at all and a good take-out place. \nBut I choose to eat inside the restaurant.\n\nThe Siu-mai is quite good and I like it so much. I recommend people to try that\nAlso the Salty fish Pork clay rice is quite good,but it took half hour on waiting that.", "author": "Man Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-09", "description": "I really wanted an egg tart. Golden Gate Bakery has been closed for a while and I don't know what to do with myself. I came here to eat one and it was pretty good but it's not the same. I didn't try any of their other stuff.", "author": "Jeromy G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-05", "description": "Chinese fast food: dim sum, noodles, jook", "author": "Carrie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-12", "description": "I had not paid attention to this place prior to it being remodeled. I love the huge menu. The mochi is delicious (3 for 1.90!) and they are filled with fresh fruit. They have a variety of flavors and surprised they have durian. I also like their custard pancakes, radish cake, and the egg rolls are not bad either. I wish they have this banana mochi thing that I always crave for-- but I guess the only place I can find that is in Chinatown.", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "10/07/2011 -   not finalized\nNeed to doublecheck the following ...\n\n\nI need to double check ... I think they remodelled or I am reviewing the wrong place!\n\nWell ... This place looked like it was brand new store located near Walgreen. All of the photos did not looked like what I saw friday!!! \n\n... Just did some research ... there is a Walgreen:\n        listed:        :  Irving Street & 22nd Avenue\n        address    : 2050 Irving\n\n\n**************************************************************\nI need someone else to confirm ... if true ... all the past \n        photos and reviews needed to be updated! \n**************************************************************\n\n\nThe place is one of the cleanest and coolest looking small scale dim sum take out I have seen yet! \n         Yes, I have eaten many dim sum places even as remote as \n                  Visitation Valley and SOMA... and as far as Mountain View.\n\nThe display is modernized:\n       Two food display flanking the cash register podium\n       One houses hot steamed items on preforated trays\n              replaced the either bamboo or alumnium circular steam trays\n              you could actually see the items ... more efficient ...\n                      the server don't have to open up each tray \n                      to view each item.\n              - The shrimp dumplings with a actual shrimp were\n                      pretty good\n              - sui mai was also pretty good\n\n\n\n        The other house either room temperture or cooler items\n               - mango mochi with tiny cubes if real mangos embedded\n                     in it's core\n               - spring roll was ok... too much chives for my taste\n\nThe are several places to sit down to dine in.\nPlace look more upscale than any dim sum take out I have seen.", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "The shrimp dumpling and the spinach shrimp dumpling were quite tasty, we were pleasantly surprised. I have been to many dim sum places in the city and I would have to say this is a good one! And, we also tried the green tea mochi balls...so yummy! For $1.90 for 3 pcs, I have no complaints and definitely come back again.", "author": "Reef A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "It's a good sign when a dim sum joint has long lines, excellent Seaweed Siu Mai, and they've run out of chicken dim sum by the time it's time to order.", "author": "Edward A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "I've been to this place twice in the past few weeks and I've been pleasantly surprised each time.  It is probably one of the better dim sum places I've been to in the past year or so.  As a lot of the other reviews say, the service is great, and they always get your dim sum with a smile.  They have a lot of tasty treats in the front counter case, but they also tell you what is steaming at the moment to make sure you get the hottest stuff.  \n\nThe place is also clean, which is an added plus when eating at Chinese places on Irving St.  The pork buns, both steamed and baked, are very good.  Lots of meat and veggies in them, and very good sized portions.  The shrimp and chive dumplings were also very good.  A little oily, maybe, but not overwhelmingly so.  It's something like 80 cents for 3 of them.\n\nNow, I've been eating dim sum since I was a kid, and I came across something here that I haven't seen before: a baked bbq pork cookie.  It was phenomenal.  Imagine the pork from a pork bun wrapped in a crunchy flaky dough.  Biting into it is an experience, you get the salty and the sweet and the different textures make this dim sum something worth making a trip to this place for.  It also is something like  80 cents, so why not.  \n\nAll in all you can get a good sized meal here for between $5 and $8 which is saying something in San Francisco. My only two issues with this place is that they could use a better place for customers to sit down.  They advertise mainly as take out, but a nice place eat in would be nice too.  \n\nThe other thing is that I was very disappointed with their sticky rice wrapped in lotus leaf.  It was a hug portion, which was nice, but all the taste seemed to have been cooked out of it.  The rice was over done to the point of literally being wallpaper paste.  I think this is the one dim sum to pass on, but over all, this is a place I'd go back to.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-06", "description": "Cheap, the shrimp dumplings and pork buns are are really good. The pineapple buns were good but a little sugary, and the preserved meat claypot was ok, but the meat had a weird taste to it, not bad, just not a flavor I particularly enjoy. The price is right, though.", "author": "claire l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "my rating is based on the ONE item that i've had here, and continue to eat. it's the onion bun with dried pork shreds. it's the best, but you really need to heat it back up in the oven again for about 6-10 minutes so it warms up in the middle, and is crusty on the outside. in every bite you get some green onion and some dried pork. yumsies.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-20", "description": "my best friend and i stumbled across this little treasure trove while walking down Irving in our journey to satisfy our boba craving at tea way down the street before a holiday party the other day.\n\nthey serve basic dim sum items and an assortment of other chinese buns, both savory and sweet. the joint is a little run-down and shabby, but for where it's located, if it was anything but, it would stick out like a sore thumb among the surrounding shops and restaurants.\n\nthe food itself is okay. a little cold, but if you bring them home, a microwave will fix that in minutes.\n\nand the best part? it's extremely cheap. like you'll be full off of $3 cheap. and wait for it... wait for it...\n\nTHEY ACCEPT CARD.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-09", "description": "If you enjoy durian, def try the mochi here! My cousin picked it up, so I can't rate on the service. This is strictly for the mochi. :)", "author": "jolie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-09", "description": "There's no going around it- this plus sucks. Usually I'm not so mean writing reviews, and I'm not one of those people who complains about everything, but they don't even try here! The beef dim sum was disgusting. Biting into it was like biting into beef paste- mushy and no flavor! Even the sight of it makes you want to throw it in the trash. The pork sticky buns were cold, hard, and had very little filling. And the filling that it did have was cold and tough. The lady behind the counter recommended that I try one of their pineapple rolls- basically just bread that tasted like it was soaked in pineapple juice- no real fruit in them. How pathetic!\n\nYeah its cheap, but it's dim sum- its cheap everywhere. Don't even bother with this place.", "author": "David D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-28", "description": "Decent dim sum, ok prices, very nice lady working there. Usually when you don't speak Chinese at a store in a dense Asian area they are stand-offish or down right rude. Here the woman was very friendly and helpful. Pot stickers have very thick skin. Not my cup of tea. Siu mai was the best of the things I tried. Meaty, and thin skin. Ha gow (shrimp dumpling) was so-so. Again thick skin, although the shrimp in the ha gow was better than the filling in the pot stickers. Overall ok. I'm sure I'll be back again predominantly due to convenient location.", "author": "Jenn D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "I use to come here for a small snack or just cuz I'm hungry i'd get some to go dimsum! since the last time, they're remodeled big time and this place looks totally different. It's amazing how it looks now since I'm rarely back home in the city. big ups!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-22", "description": "Cheap and Decent Chinese Food. Came here to buy some Mango Mochi & Soy Milk. (Total was about $2.50) The Mango Mochi looks fantastic! I don't know how they tasted but my friend certainly enjoyed them. And Soy milk was authentic and not powder or instant mix. Will definitely come back for breakfast, lunch, or dinner. Small Cafe style atmosphere.", "author": "Dustin T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "It probably deserves a 3 1/2 stars. The place is clean. The shrimp dumplings are good. The skin is not too thick. I like their siumai too. Everything is OK+. It's not as greasy as Happy Bakery down the street but it cost a little bit more. I did try the take home frozen curry beef brisket. It did not taste so great when I reheated it. I finally added water to it and it made it better. I have not bought the lunch boxes my coworkers buy regularly. I tried a bite and found it disappointingly bland... that was the pork ribs in black bean sauce over rice.", "author": "jane f."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-28", "description": "Delicious egg rolls, but super GREASY! The meat filling in our pot-stickers had pieces of bone or cartilage. Kinda gross....tasty enough but very tough and maybe not too fresh. Had a couple of other unremarkable items....and will be checking out other dim sum take-away spots in the hood.", "author": "Gwynnie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "very very bad food . I bought the 砵仔糕with red bean on it. after I open the bag, I smell something burn already. as the first bite,I found out the red bean is actually burn. I went back the store and talked to the lady and she said nothing wrong, the burn smell is the red bean.this is not the first time I eat red bean and I know the taste between burn and good. bad customer service and I will not recommend to anyone", "author": "Laura S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-27", "description": "I don't normally write reviews, but I thought this place certainly deserved one. \n\nI wish I could give negative stars. This place is just that bad. And I haven't even tried any of the food. \n\nI went inside on my way home from school thinking I could use some hot, cheap food after walking in the chilly fog for the last 45 minutes. After waiting in line for ten minutes (wasn't that busy, they were just that slow), I finally reach the front of the line. To my dismay, I found out that they had no hot food. None of it really looked all that appetizing, and the person taking the orders behind the counter was a complete b*tch. She gave me a quick glance, noticed I was white, and completely skipped over me and began taking an order from a girl behind me that spoke cantonese. I was taken aback at the overt racism, although I suppose I shouldn't have been, it wasn't the first time something like that has happened to me in an asian restaurant on Irving. I didn't give a second thought and I walked out without saying a word. And I'm glad I did, because my friend who had ordered and gotten her food before the incident informed me that the food was disgusting. \n\nAgain, I don't normally write reviews, but I felt this place certainly deserved one. It's just a shame there aren't negative stars available for little gems like these", "author": "Adam W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-04", "description": "When I was a little kid, my mom n pop used to work next door at the Shangari- La. You know that chinese vegetarian restuarant next door? ok well I used to come in here and buy a bun and eat that for breakfast.\n\nI havent gone back in a while but I walk by this place a lot and it brings back memories. hahaha I remember I had to tip toe to give the cashier money..", "author": "phillip w."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-18", "description": "Not the best to-go dim sum place but it's still do-able. \n\nThey do serve congee but not spareribs over rice. Oh man how can you not serve spareribs over rice?! It's like a best seller in any dim sum shop! Anyways, they have shrimp in rice noodles, beef in rice noodles, sticky rice in lotus leaf, chicken buns, shrimp dumplings (ha gow), Siu mai, chiu chou dumpling, Chinese tamales, and much more! \n\nDrinks are on the expensive side. They charge 95 cents for a box of Vitasoy! Wow I could get it for 50 cents right across the street. \n\nLike all to-go dim sum places....CASH ONLY", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-17", "description": "Convient with not only baked goods, but also with cheap Chinese food.\n\nTheir lunch menue is all under $5, but what makes this place special is that they will happly make your to order with a smile.\n\nI got steamed vegies topped with steamed chicken and a side of thier homemade garlic sause.  Tasty, gilt free and for only $5.  It is a price that can't be beat.\n\nI topped it off for one fog their dim sum egg custard which was oh so yummy", "author": "Jai D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-28", "description": "My mom introduced this place to me. It's quite cheap. I used to get their fruit mochis all the time because it was 3 for $1.80. I haven't tried their steamed dimsum and don't intend to. I did try the rice noodles with meat. Sorry I don't remember what exactly come with the rice noodles. The rice noodles with meat is okay. I honestly think I can cook the rice noodles better. I believe it's about $3 so pretty good for a breakfast or quick lunch. I also ordered soymilk, which is boiling hot. LIterally. The first time i tried the soymilk  tasted funky but the second time around it was okay but still crazy boiling hot. I also bought a small box of to go fried noodles. It was pretty good and cost $2. Can't beat a deal like that. Overall, come here if you want a quick, okay tasting meal. Btw, there are plenty of seats if you walk to the back.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-18", "description": "This place is great! \nThey have super fresh Chinese pastry and the dim sum and buns are great and CHEAP! The staff is always friendly and ready to make a suggestion if you ask. The green onion bun is out of this world! Only a few tables so not a sit down friendly place, but take out is fast, easy and delicious! Just thinking about it makes me hungry! YUM!!", "author": "Stephanie P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-12", "description": "They changed owners, they fixed up the place, raised the prices and the food sucks now :(. They used to have the best dan tats (*sp) ever and never run out always ho and fresh. Now they are tiny burned and cold and they run out of them at like 2 in the afternoon!! WTF. \n\n\n```````````````````````````````````````````````````````````````````````````````````````````````````\nI usually get my lazy weekend morning breakfast here. Its really good stuff when your strapped for cash. $5 can get you far!!! Hey,  50 cents can feed me there just get a chicken bun. I love love love the egg custards there! I think its their number one seller too! Once they bring out a fresh trays it dose not take long for them to be sold out! I like it, it convenient for me, really is my favorite bakery in the city. But of course a couple of food items such as the barbeque pork buns, egg rolls are not all that good and are better in other bakeries. \n\n~~ :( the 50 cent chicken buns that where quite large in the past are now much smaller :( same price, so now they are the same sized buns as they have in almost all other bakeries.  I", "author": "Kristina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-04", "description": "60 cents for a slice of pineapple cake (BO LO DAAN GOH).\n\nHm... how do I describe the pineapple cake?  It's a spongy cake with a thin layer of pineapple filling/sauce inside.  On the outside, it's baked with the same crumbly layer that's on a pineapple bun.  You just can't go wrong with that!  These were a big hit at my bro's party.\n\nYou need to special order these because they are THAT good! =D", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-21", "description": "I am obsessed with the steamed pork bun, and this is where my obsession was born.  I didn't even EAT pork before this, but a friend convinced me to try it, and I fell in love.  I haven't found another place that makes them THIS yummy.  I even have my boyfriend hooked - I drive them out to Reno for him!\n\nNow, the staff here can be a little mean, especially when it gets busy, but I almost look forward to the abuse now.  \n\nI wish I could find a place like this that's closer to my apartment.  It is so cheap and yummy and cheap.  Mmmmm.  \n\nOh, their other stuff is good too.", "author": "Carolyn H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-16", "description": "I have mixed feelings about this place.  On the plus side, everything is super cheap.  I LOVED the shrimp and chive dumplings.  They were huge and filled beyond belief with shrimp and huge pieces of chive, not tiny slices you get at other places.\nHowever, I really did not like the BBQ pork bun.  Mine was filled only with fat, not one piece of meat.  It also tasted like cinnamon apple sauce, no BBQ flavor at all.  And, I had to first ask for chopsticks.  Then, I looked in my bag and had to ask for soy sauce.  After double checking, I then had to ask for hot sauce.  Yeah, I'm the white girl, but still know what condiments I like, so hand them over.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-30", "description": "First time I every ordered from here. Before they remodeled, this place looks pretty run down. But this time, it is clean and fresh. Food is cheap here, in price. Many dished, are around $1.60. Quality wont beat yang sing or koi palace, but at least your not paying twice to three times just to kill your hunger in a short period. Price is good, the quality, imo, room for improvement.", "author": "Albert W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-08", "description": "Good friendly service! Food was fresh! Would come here again as a pass by restaurant (: the shrimp dumplings & potsticker were fresh and warm as well!", "author": "Anthony G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-30", "description": "This place is my go to fast dim sum place on Irving. It's descent, but nothing to rave about. I only get dim sum and bread here the side dishes look kinda scary.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-20", "description": "So went to Sun Maxim's again finally (it's been awhile since i last went) and i got about $20 dollars worth of assorted Dim Sum consisting of shu mai, shrimp dumplings, shrimp and chive dumplings, steamed pork buns and also a container of chicken feet. Got back home and my cousin took a bite of the shrimp dumpling and it was cold. It's a little past 10am so i would think that things would be a little warmer since shops are just opening for the business but NO. I tried the shrimp and chive dumpling and again it too was cold, the wrapper for the shrimp and chive dumpling was all cold and hard to chew and i had to pop EVERYTHING in the microwave. After NUKING everything, the dim sum was a little better. Moving forward, The chicken feet in the containers are hit or miss.. and for me unfortunately, was again a miss.. it wasn't fresh and tasted stale and my cousin pointed out that it was a little sour. I don't know if their fridge is cold enough or if it's just old but watch out for it. I think i'll fair better with going to brother's seafood restaurant or TC pastry if i want proper dim sum.", "author": "Lily S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-05", "description": "This is my go to place for dim sum and baked buns in the area. Their buns are big. I like big buns and I can not lie. That's right girlfriend I went there.", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-14", "description": "The best dim sum in little Chinatown! (Irving street)\n\n4 stars for the goods+2 stars for the cleanliness=3 stars total\n\nLets start with the goods: 3 pieces of dim sum (your ha-gow, sui mai) for just $1.40! Everything else like buns, fried dumplings range from 50 cents-$1. Everything here is really good and fresh--when you get there earlier in the day. \n\nNow on to the cleanliness: hmm..well, its pretty bad. I have seen things such as fruitflies(a few times) and cockroaches(once) here very close to their food...especially in the food case where the cold goods are housed. \n\nOverall, good place get-and-go for some yummy dim sum...but don't stay too long here, or you'll see something you didn't expect......", "author": "Jessica h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-08", "description": "Buns and mochi...my god if only the combination boggles the mind...the coolest things about this dum sum pastry bakery is that they offer such a wide variety of buns. I am always partial to pork bun, and I love bbq pork puff pastry.\nMochi done chinese style is also offered but not a lot of flavors...but they tasted wonderful. Not too sweet or greasy for the fried mochi.\n\nThere are seating areas in the back but only for a small group. 4 or less. You don't shop here for the decor...so it's all about the food.\nFor parking, the street is probably the only option other than stopping next door at the Walgreens parking lot. Be warned that you should only use that route for a quick stop...don't park there forever or you'll get a ticket.", "author": "Pauline L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-26", "description": "i only come here when i'm hungry and broke. i work around the area and  i usually just order take-out. \n\ntheir dim-sum is pretty cheap! 3 for $1.50! i always order their shrimp hargow. its not the greatest but its better than the other dim sum place a couple blocks down.", "author": "B B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "Excellent food, but I wish they kept it warm! If you don't come early in the morning when they first open, your food will be room temperature.  Still delicious though! their baked bbq pork bun for 90 cents is as big as your hand! try the pumpkin pancake looking thing on top of the counter, they're filled with red bean paste- I haven't seen these anywhere else, but they're awesome!", "author": "Bobby P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-15", "description": "ordered 3 orders of siumei to go. got home and found only 8 siumeis in the box. can anyone explain me the math?", "author": "James C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-05", "description": "Har gow and xiu mai. \n\nFor three bucks, you cant really go wrong. That said the xiu mai are a pass for me next time. While they were ok they tasted a bit too much of breadiness. The har gow were very tasty, not as good as most sit down places, but theyll charge u 4.65 a set of three, here u get 3 for a buck fitty, and thats with taxes!\n\nI think ive found a perfect \"snack shop' if ur in the area walking and need a slight pick me up come in and order 1 set of dim sim. U wont have ur shoes knocked off but youll be satieted.", "author": "H B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-06", "description": "I went last Sunday (1/29/12) and bought a container of beef stew with daikon radish, a container of daikon cake, and a container of taro cake from the refrigerator.  We tried the beef stew that same night and it was awful!  We tried half of the daikon cake 2 days later and it didn't taste good.  When we were finally ready to try the taro cake yesterday (Sunday 2/5/12), we found white spots (mold) on the taro cake.  I checked the remaining daikon cake and it was fine, so we finished it this morning (Monday 2/6/12, about a week after we had bought it).  I called the bakery earlier today and spoke with a lady who said that the shelf life of their products is about 4 to 5 days only.  I asked her why only the taro cake had the problem but not the daikon cake and she couldn't answer.  I questioned her why they didn't put an expiration date or the date the item was made on the container and she couldn't answer.  Anyway, based on the 2 not-too-tasty experiences with the beef stew and the daikon cake, I don't think it was a loss to us not to try their taro cake.  We will not go back and would not recommend it to anyone.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-06", "description": "I sorry to write but twice had it bad with Sun Maxian.  First time was when I brought some turnip cake home and found inside the cake a dead fly gross!.   Second time inside the bakery a cockroach crawl up to counter into the bake cupcakes.  The worker took cupcake and shook roach off of it and put cupcake back in counter gross gross!\n\nWoud he eat that cupcake I don't think so why he let customer buy it and eat it?", "author": "erica w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-15", "description": "The takeout food Iin the refrigerator) here is not very good. Don't think I'm coming back. Cheap though.", "author": "Dijon Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-24", "description": "My husband bought dim sum from here and bit into his dumpling to find a cockroach steamed to perfection.  EWWWWW!!!!!!  Don't go here!  He could not eat dim sum for a really long time after that, and we haven't been back here since.  I mean I saw it, he bit into his dumpling and there it was, cooked right in the skin of the dumpling.  Ok I'm going to start the gagging reflex all over again.  Don't say I didn't warn you.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-02", "description": "Waddle your fat ass 2 more blocks down to TC pastry.  The dim sum here doesn't compare to TC.  I use to come here when I was fat.  But now I am dumb and fat so I make myself roll 2 more blocks down the street when I could just stop here and save myself 2 blocks of rolling.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-27", "description": "finally tried the buns.  i really recommend the pineapple buns as it's actually stuffed with milk cream and real pineapples.  ask them to make it hot or you can toast it as home.  but i don't recommend the pork bun as there was almost no pork :*(.", "author": "Food Is L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "This is my best friend's favorite place to buy dim sum to-go. I think the chasiu bao has better pork here than at the place across the street.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-09", "description": "i think this is one of the better chinese bakeries/dim sum to go places in the sunset. they have the best daan taats (egg custard) ever!   the crust is always flaky and the custard filling is warm. and their pork buns and chicken buns are always fresh. you can get a lot of food for little $$ here. i would just take-out here, cause the place is a little dirty and usually occupied by older chinese men. this place can be easily missed, so if you're on irving near walgreens - you're close by!", "author": "Douglas F."}
