{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-16", "description": "It's not the best, but their bun rieu/ sea soup is not bad. My friend also liked the five spiced chicken noodle soup, although perilla is probably better. \nDefinitely get the fried roll, it comes with veggies to eat it with.\n\nThe decor is nice, higher end than Kevin's noodle house couple blocks down.", "author": "Debbie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-18", "description": "It wasn't bad. Came here two Saturdays ago for dinner with Gino, Arthur, Micheal, and Jimmy.\n\nIt was fleet week slash bluegrass concert day so everything and every place was packed that night, and we couldn't wait to eat.. so we ended up going here.\n\nI got the Bun Rieu and although it wasn't the best Bun Rieu I've ever had: it wasn't bad especially considering Vietnamese food in the City. I'm accustomed to the Viet food back in San Jose.\n\nService was a lil slow, but they were really nice. I'd probably go for a different dish next time. \n\nI'd go here again.", "author": "Lilian L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-17", "description": "My friend and I came here after we realized that Perilla down the street was closed. As I was craving for the five spice chicken at Perilla, I decided to give their version of the dish a try. \n\nUnfortunately, the flavor was a bit off and it tasted more like a soy sauce/teriyaki chicken than what i'm use to for other five spice chickens that I've had before. The five spice chicken plate was presented with a salad (per my request) and portion wise, it's not bad. However, overall the meat was too salty and had a weird look to the meat (seem like they pounded the chicken flat?).\n\nThe friend and I also placed an order of their crunchy rolls which is a version of the nem nuong spring rolls with the pork sausage. This was not a star dish. The roll was not made well and too loose. The crunchy part of the dish was actually not too crunchy and I wish the piece of pork sausage was bigger. \n\nOverall, it was a nice alternative to perilla, but I don't think ill come back. Perhaps, I ordered the wrong dish and should've tried their noodle soup dishes which they appear to be known for.", "author": "Diane T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Beautiful interior for a Vietnamese restaurant with plenty of seating. The food was yummy as well.\n\nFood:\n-Sea noodles (bun rieu) $10: my friend ordered this and liked it. It's got your crab paste, fried tofu, tomato, and vermicelli noodles all mixed into a delicious and hearty chicken broth.\n\n- 5 spice chicken noodle soup $10: I ordered my noodles with 5 spice chicken to the side since I came from a workout. Needed my protein fix. The chicken was easy to cut, and surprisingly, I finished it all. The chicken portion was generous :) \n\n-Fried imperial rolls: delicious and served piping hot.  The perfect appetizer to accompany the soups.\n\nOverall, a lovely restaurant, and another one for the books when I'm craving Vietnamese food.", "author": "Corinna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "I cheated on Perilla down the street with Sunflower Garden ever since it opened. I feel bad because the owners at Perilla don't see me much anymore but I'm obsessed with the food here! Literally my favorite Vietnamese restaurant in SF. It's new, clean and modern. There is always seating. Giant pot of tea. Great service every time and they know what I want when I go there because I go there at least 2x a week since they opened. Now that I moved work locations, I haven't been there in over 6 months and I'm super sad! \n\nSome of my notable favorites that I have ordered are chicken pho, seafood pho, Mongolian beef over rice, imperial rolls, BBQ chicken/beef vermicelli bowl, and chicken clay pot rice. My secret favorite thing to get here is their avocado smoothie! It is so creamy and delicious I am craving it right now. Now I just gotta find some time to come back to the Inner sunset so I can eat here again!", "author": "Annie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "We order take out from here about once a week. \nSome of the better dishes are the beef pho, the wonton noodle soup, and the garlic noodles with BBQ portk. \n\nTheir rolls,  appetizers and rice dishes are just okay. stick with the noodles.", "author": "Mimi T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "Sunflower has eluded me since it opened not too long ago! I've been meaning to try it with a friend for the longest time and finally came here for lunch recently. \n\nAlthough I've been eyeing the Bun Rieu here and will one day try it - I opted for the five spice chicken and my friend opted for the vermicelli bowl! Both were GINORMOUS! They were huge and delicious. I've actually never had five spice chicken in this manner before, but it came out like it was spatchcocked and it was seriously the most five spice chicken I've seen on a plate ever. It was cooked really well, I didn't need any sauce at all and I had leftovers for another meal later. All for less than $10. \n\nWorth it!", "author": "Deanna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "This is my absolute go-to for Vietnamese food in this part of SF. It's usually not too crowded inside and everything is very affordable! I've brought friends here and they've always enjoyed it and (much like me) wondered why they hadn't tried this place before and why it wasn't featuring a line out the door. As long as it keeps having fast service, a really clean, pretty interior, and delicious food, I'll keep coming back!\n\nI order the bun rieu (sea soup) here and it is incredibly delicious with such rich broth and generous portions of crab meat, tomato, and all the other toppings. I've also tried the rare steak appetizer here and it was delicious.\n\nOverall, excellent Vietnamese restaurant in the Inner Sunset and I highly recommend to all.", "author": "Phillip V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "Every time I go I always get the sea soup. It's sooo gooooood!!!!!\nBut yeah basically:\n- food- can't go wrong with sea soup (bun rieu)\n- free tea in cute teapots! WIN!\n- clean, love the fish tank with colorful bubbles \n- there's ALWAYS SEATS! I love that there's no wait\n- prices are probably one of the most affordable now for Vietnamese food in", "author": "Ruth Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-03", "description": "This is a lovely restaurant in inner sunset :) My friend and I wanted to grab dinner nearby UCSF  campus, and decided to come to Sunflower Garden. It wasn't terribly crowded so we got seated right away. \n\nThis is a Vietnamese restaurant with a fusion flavor. There are rice bowls, vermicilli bowls, and soup bowls. The soup bowls are unique as it's not the typical pho style, but a mix of different ingredients, again with a fusion flavor. There are also vegetarian dishes, and some yummy look appetizers. \n\nMy friend ordered a vermicilli bowl, and I ordered the the Sea Bowl. It was delicious! There was egg, tomatos, fried tofu, and bean sprouts, and basil in the soup, along with noodles. The broth was delicious and it felt very clean :) The serving size is huge, so you'll have plenty to take home for another meal. \n\nIt's also very cost affordable! It was only $10 for a huge soup! The service is great as well! I will definitely come here again when I'm close to campus :)", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "First time here! Great taste in flavors ordered the eggplant & shrimp. It was delicious! Definitely returning to try other dishes! Clean environment.", "author": "Arlene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "I'm usually at Yummy Yummy if I want pho, but after walking by this place a few times (and it's always consistently busy) decided to try it out. Seated immediately and served hot tea in a cast iron pot. Ordered chicken pho w the steamed vegetables. Took about 10 minutes to get the order but it was piping hot. I don't normally care for red onion in pho, I prefer green, but I didn't mind as much as I thought. Next time, I would skip spending the extra $2 for the veggies - they were in large pieces and were difficult to eat with chopsticks. My only other complaint was I was kind of on my own once the soup came - no one came back to check on how things were going & once I was finished I had to walk up to the front to get my own check. Regardless, the soup was great and I would definitely go back.", "author": "Alexa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-21", "description": "Combo sampler - 3.5/5\nBun Bo Hue - 2/5\n\nThe combo sampler consists of imperial rolls, shrimp spring rolls, fried golden shrimp and papaya salad. I thought it was decent, considering they gave all the various dipping sauces for each appetizer. The golden shrimp was really breaded with not much shrimp.. Imperial rolls were yummy! Nothing stood out, but then again it's kind of tough to mess up a spring roll lol. Overall it was a good item to order if you are craving a little of everything!\n\nI've been looking for a restaurant in SF that has really authentic bun bo hue, so I came here specifically for that but was pretty disappointed. The broth was just missing something, I can't exactly put my finger on it... but it actually tasted a tiny bit like Bo Kho, a different Vietnamese dish. The broth just didn't taste like BBH to me, but they were very generous with the meat though! I guess if you're used to the BBH from San Jose like Bun Bo Hue An Nam or BBH Noodle, this place may leave you a bit disappointed.\n\nSide note, the interior of this restaurant is sooo modern and beautiful!! Definitely one of the nicest Vietnamese restaurants I've ever been to.", "author": "Cassie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Get the Sea noodles!!  If you like seafood, the broth is great.  The 5 spice chicken today was tender, juicy and tasty.  Lot of meat in the combination Pho.  Broth could be a touch better, but the meat makes up for it.  The BBQ chicken was also very good.  \n\nWould come back again.", "author": "Carlo W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "I really enjoyed their rare beef salad and vermicelli noodles (grilled pork with egg rolls). I'm not too big of a fan of their bun bo hue though. However, one of the best vermicelli dishes I've ever had. \n\nService was good and the staff were very nice. Very homie.", "author": "Mandy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "I had such high hopes for this place with all the reviews. I ordered combo beef pho and fish sauce fried chicken wings. \n\nSigh....this is probably more of a hit or miss in good Vietnamese food. I miss my friends' parents' home cooking and my original hometown. \n\nBeef bone broth tastes like water with some flavor, even with the added sauce, lime, jalapeño, Vietnamese basil/perilla, etc. it tasted like diluted beef broth. Not even sure it was bone broth at all.\n\nPro: lots of meat and noodles\nCon: broth was very light in flavor, had 1 tripe and 1 beef tendon. 1 of each only! So sad. \n\nChicken wings tasted like normal fried chicken wings. Where's the fish sauce? Oh well for normal fried wings, it's good. At least the sticky rice with fried garlic and mixed greens with it were yummy. Anything with sweet Thai chili sauce from the bottle is always good. Lol.", "author": "Linda C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "The pho broth was bland.  Imperial rolls were so-so. There were flies that kept disturbing our meal. Food and service was slow when there weren't that many customers.", "author": "Steven H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "Good pho, clean restaurant, decent prices and great service. Would also recommend the garlic noodles too.", "author": "Kristine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "This is one of my favorite spot. I will definitely recommend this place. It my first eating here cause Yummy Yummy is close & Perilla don't have Bon bu hue lol! Staffs are very friendly, nice & good customer service. And food is way better order Bon bu hue & Calamari taste great!!", "author": "Quiachon L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "I've eaten here mostly solo and have had very good experiences. The servers arrive with hot tea and menu. I usually see familiar faces when ordering, and often come in for steaming hot pho on chilly, foggy Inner Sunset days. I'm not Vietnamese so I don't know about authenticity here, but I like the broth flavors and lightness (if I want heavier broths I go for tonkatsu ramen).\nThe vermicelli bowls and mango salads were very tasty. Appetizer combo and rice dishes were good. I would prefer more flavor and less salt in the latter.", "author": "Ken U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "If your're on the fence about Sun Flower Garden common down, pull up a chair and have a bite. The restaurant is inexpensive, clean, service is good and the food seems fresh and tastes pretty good to me.\n\nAt $6.95 I have not had a better Spring Roll. And, at $10.00 the Chicken Vermicelli just can't be beat and for an additional $2 they offer three Prawns.\n\nFor $10.00 the Sea Soup over a rice vermicelli is prepared with a crab paste - chicken broth base and is a bit sweet with more tofu than shrimp yet very good.\n\nAt $10.00 the Vermicelli Noodle Beef Soup seems authentic. Its lightly spiced beef broth (a hint of lemongrass) with sliced beef, pork and pork blood cubes really hit the spot.\n\nAt $21.50 the Grilled Rack of (4) Lambs came on a bed of lettuce atop a dollop of sticky rice. I found the lamb over marinated taking away its lambness and a bit tuff and chewy.", "author": "Caesar A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Awesome food, neat and clean kitchen, restaurant and great price!\nVegetarian /vegan friendly. Sorry we found this place late in our visit to the city. I got a crepe with tofu that was bomb! My husband and daughter loved what they got-rice included. Eat here!", "author": "Christina F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "I have been wanting to try this place out for a long time.  This used to be a Chinese grocery store for the longest time. They've done a fantastic job renovating the pace.  The ambience is very nice and you could definitely come here for a date or dinner with friends. They have 2 big booths and a large side booth seat with multiple tables across in addition to chairs which seat couples or can be combined to accommodate 10+ people.\n\nThere is a 60 inch plasma screen TV and they're very nice about putting on the game if you ask. As soon as we were seated (without a wait on 6 pm on a Saturday) they brought us hot tea and water. The menu is very extensive with your traditional Vietnamese pho and vermicelli bowls,  in addition to appetizers. \n\nWe got the chicken spring rolls as an appetizer.  The peanut sauce was really good and you get 4 large rolls,  so it is definitely worth the $6.95. For the main course ee gotwonton soup with extra noodles and the chicken Vermicelli bowl.   With the Vermicelli,  It comes with an egg roll and i didn't realize it had pork in it,  so be sure to ask for a vegetarian before hand. The wonton soup is humongous. Honestly,  it could easily feed 3 people.  It was pretty good too. If you're hungry,  you can't go wrong. \n\nSo,  overall,  this place is pretty good and the prices are decent,  but i wasn't blown away.  I will probably come back again,  but it's more of a \"safe\" option, as opposed to a place I'll be dying to come back to.", "author": "Arman J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-11", "description": "Good pho here!  We tried a bunch of other entrees and appetizers as well.  Just a little greasy to merit higher scores.  Nice family restaurant.", "author": "Molly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-05", "description": "What I ate: Pho, appetizer combo.\nVisit date: December 4, 2016\nFirst time? Yes.\n\nCold and hungry? Noodle soup to the rescue! We visited Sunflower Garden after an event across the street. I ordered the pho with rare beef and meatballs, and the appetizer combo to share. The pho comes customizable; you can also get tripe, flank, and tendon in your soup. The broth was full bodied, but definitely needed the added hoisin and sriracha sauces. A bowl is good for two. The appetizer combo comes with imperial rolls, papaya salad, golden shrimp, and shrimp summer rolls. The imperial rolls were my favorite -- deep fried, but light and crispy. The platter came with three dipping sauces. I could easily eat the whole order on my own. Yum!\n\nParking is street and it gets busier after 6pm. This is a family friendly place with clean bathrooms and friendly staff.", "author": "Erin G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-09", "description": "Very poor experience. The server took a while to hand us our menus, and then we sat with them closed on our table for 5 minutes while there was only one other person in the restaurant. The server got our order incorrect, even though it was an easy order and we specified several times what we wanted while ordering. When we told the server that our order was wrong, he tried to argue and looked upset at us. Then, on top of it all, we sat with empty plates on our table for 10 minutes and HAD TO GO UP TO THE REGISTER TO ASK TO PAY. We will never, ever be back and I'm sure they don't care.", "author": "Zack S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-22", "description": "This place has a really beautiful atmosphere and A+ for food presentation!\n\nSeriously, I loved the tables, vibe, and some serious gorden ramsey style plating! My boyfriend and I ordered bun bo hue & bun rieu. The best out of the two was the bun bo hue forsure! They were both really sweet and a bit salty~ Maybe next time it will be less sweet/salty? It's a bit pricey for Vietnamese food but not bad, I would come again because it was really a nice environment and very clean as well.", "author": "Melanie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "We ordered for delivery the beef soup, the vegetable soup, and the mango sticky rice. I especially appreciated that there was a vegetable pho because it's difficult to find. It was very tasty, well salted. \nWhen the soups were delivered the broth part was still really hot. The noodles were separate and there wasn't really enough space in the broth container so an extra bowl from your kitchen is required. \nThey were super tasty and the sticky rice was a great ending. The mango wasn't the ripest but the rice was amazing.", "author": "Valentina G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "I was in the mood for Vietnamese food and found this place on Yelp. It had good Yelp reviews so I thought I'd give it a try, I'm so glad I did. The food was delivered fast (free delivery!) and I live at least 15-20 mins. away, it was delicious, fresh and packed beautifully. I will DEFINITELY be ordering from this place again!", "author": "Maxie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-15", "description": "When you can barely taste anything due to pesky congestion - food just isn't very exciting or satisfying....unless it's spicy hot pho. \n\nSunflower Garden has been a dream these past couple of sick days. Their food is made with care and their broth is fresh. I love that they package all of the ingredients separately so you can add in everything yourself. Personally - I love just the chicken broth - sprinkled with jalapeno peppers, fresh basil, cilantro, and then loaded up with sriracha sauce. \n\nEverything is better with a little pho in your life.\n\nTrust", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "One of my favorite Vietnamese noodle soup places. From time to time I always order the sea soup come with   4 whole shrimps, bean curds ,  also on the side with bean sprouts, 1 slice of lime, jalapeño and a complimentary tea pot for the price of 10$ . It is pretty inexpensive compare other places. Personal suggestion gotta ask the servers for their house made chili sauce.  They offer free wifi and cable tv that can watch warriors game highly recommend this place.", "author": "Rongbo T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "Service is extremely slow, and food wasn't all that good.\n\nWe got seated straight away, but waited forever to get menus and place our order. Then, we waited about half an hour before our food came, and we ordered pho, which can be cooked really quickly. \n\nThe soup base had little flavor, except for all the salt they put. The noodles were overcooked; it was hard to eat with chopsticks because the noodles kept breaking.\n\nThey seem to take a lot of delivery orders because the staff would approach our table with a phone in hand, taking orders over the phone, and I saw DoorDash delivery folks come in as well.\n\nThey don't bus the tables until they need to seat new customers. There were dirty dishes at every empty table. There was one table that hadn't been bused for at least 45 minutes.\n\nThey have high volume, but are not appropriately staffed to handle it. You're better off going to Perilla or Yummy Yummy in the area.", "author": "Rachelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-27", "description": "The food is pretty good.  If my only experience of this place were takeout--and it was for a few months--then this would be a four-star review, but I've actually eaten here a few times, and those few times have dropped Sunflower Garden a star.\n\nI like that the vegetarian options are clearly indicated on the menu.  Not enough restaurants do that these days, especially in the Bay Area, and it's especially nice at a Vietnamese place, where broth questions always seem to linger, if not confound.\n\nThe service is pretty inconsistent.  That's my biggest gripe with the place.\n\nThe restaurant is usually clean, but sometimes, the unbussed tables can pile up, and I just don't understand that because the place is never so busy that the many servers on hand don't have time to clear tables.  When I was a busser, the rule was that you didn't stand around if there were dirty tables.\n\nSunflower Garden is a solid choice on 9th Avenue, and I don't want to steer anyone away from it.  There's a lot of variety on the menu, and the prices are pretty decent, especially as everything else seems to be getting really expensive really quickly.", "author": "John S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "My friend introduced me this restaurant, so this was my first time eating here. I amazed by how comfortable this place was. In addition, it was very clean. I'm Vietnamese, therefore I could relate to the Vietnamese tradition in this restaurant. The foods were cheap but very tasty. The service was great, foods came out fast. Overall, I had a really good time here and I'm absolutely welcome everyone to come and enjoy...", "author": "Anh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-28", "description": "I have to say.. The pho dish I had wasn't that great. :/ there aren't that many great Vietnamese restaurants in San Francisco to begin with, and this place's pho was definitely not up there with some other Vietnamese restaurants around the neighborhood. Came around 7pm on a Wednesday night and was surprised to find that it wasn't too packed. Parking around here can be difficult on a weekend too. Clean interior, mediocre food. \n\nThe bun rieu is apparently pretty good here according to someone I was with that ordered that dish.", "author": "Meagan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "This restaurant is the best place to go if I want to eat Vietnamese foods .The foods was great .I always enjoy it whenever I come here .My favorite dish was Garlic  Noodles with Five Spice Chicken . It was only $12.25 for this dish , totally worth the pric", "author": "Tai N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-09", "description": "service was less than decent, but the food was delicious. lots of vegetarian & vegan options in fact there is an entire menu section. if not for the fact that we had to wave our server over or request something as simple as water, my review would easily be five stars.", "author": "Courtney W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Wow! The food was delivered, arrived early. It was nice and hot and super delicious! I will be ordering from this place a lot. I tried to order again on Saturday for lunch, it wasn't open :( \nBut I definitely will order from this place when it is open. It is so worth the wait!!!!!!!!!!!!!!!", "author": "Carmen O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "Pho is meant to be a hearty, often a little good greasy, to feel the comfort pho brings. \nThis place doesn't do that. The broth also lacked so much flavor I have never put so much hoisin to get something out of it. \nService is also very slow, so if you're in a hurry, don't come in.", "author": "Catarina Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "After a cool day exploring the Inner Sunset, Sunflower Garden was a warm, inviting, and delicious treat. My hubby raved about the make-your-own style Pho and I enjoyed the best basil chicken I've ever had! The ambiance is modern with all the feng shui elements: mesmerizing moving water in an enclosed fountain, fun wood sculpture wrapped one wall, vibrant plants, toasty candles, and heavy iron teapots to name a few pieces. The service was quick and correct and, though the restaurant was full of a patrons seemingly all ages and backgrounds, it still felt intimate and cozy.", "author": "Jessica D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-04", "description": "I lived in San Jose my whole life and grew up with Vietnamese friends and ate at local pho joints with either family or friends. I even visited Vietnam last year so I guess I pretty much have a good taste of what is good or not. I now live in SF and work in the peninsula. And if you're like me, it's pretty hard to find a family owned restaurant that isn't owned by Koreans or Chinese. Well anyways, the Banh Xeo, Pho, Bun Bo Hue are top notch and taste better than most Viet places in SF and the peninsula. For now, I'll leave it at 4 stars and it's definitely going to be my go to place now.\n\nI'm aware of the down ratings on here. Let me tell you this, never ever order Pho or any other Viet soup for take out. And if you dine and can't finish it, never take your leftovers.", "author": "Russell R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "I've dined in and gotten delivery several times and never let me down!\n\nMust get: Imperial rolls and Banh Xeo (vietnamese crepe)", "author": "Elouise D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-19", "description": "Friendly and clean (for Inner sunset area).  It was weird to have pho ga and it had romaine lettuce in the pho. I dont think it's really \"authentic\" Vietnamese.  The price was high too at $10/bowl. \n\nThe bun rieu (seafood noodle) was also different from the authentic bun rieu that I am use to having. This bun rieu at shrimp in it and no cha lua (pork roll).", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-11", "description": "Sunflower Garden delivers! They offer a wide variety of menu items. \nOrdered:\nCombo Pho\nShrimp Spring Rolls\nMango with Sticky Rice\nTea\n\nThey don't start delivery till around 430-5pm. But, you can order early via the YELP website. \nAwesome flavors, fast delivery and great customer service. I recommend this to anyone who loves pho.", "author": "Ryan P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-01", "description": "Basic viet food.  Bun rieu could be better with more tomatoes.  Beef pho was bland however.  Its lack of flavor and meat.  Combo appetizer was mediocre with good sauces and papaya salad but spring rolls aren't made to order.   Five spice chicken was fairly good.  Portion wise is decent.  Service was friendly but with almost an empty restaurant it still took a while to get food on table.  The hot tea in pot is a nice touch.  Will be back if in the area but wouldn't worth to come particularly for their food", "author": "Janita s."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-22", "description": "Quaint little place near 9th and Irving. Relatively new, just opened a few months ago. Great ambience and very contemporary interior. Awesome vibe!\n\nWhat I ordered:\n\nBeef Combination Noodle Soup (~$10)\nThai Iced Tea (~$4)\n\nTbh I feel this is a little pricey for the food I'm getting. Walk 10 blocks down to 19th and Irving, and all the Pho places there are so much cheaper and better. \nThe beef pho I got here is mediocre at best, it's nothing special. The soup tasted actually a little bland compared to the other pho places I've been around the neighborhood. The thai iced tea was good though! I just wish it was cheaper though.\n\nI really want to like this place. Maybe I ordered the wrong item from the menu?", "author": "Xin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Absolutely delicious meal! My husband and I ordered the chicken noodle soup, Mongolian beef rice plate, combo appetizer, and Thai iced tea that were all incredible. Very unique and delicious!", "author": "Estee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-23", "description": "Absolutely disgusting.  We threw entire order out (had delivered).  Basil for pho was BROWN and lettuce in chicken noodle soup was almost brown.  Noodles completely stuck together even after adding hot broth and stirring a lot. Imperial rolls tasted like they were made a few days before and heated up - one bite and we threw away.  Soggy, salty and disgusting.\n\nFood was at least a day old if not more.", "author": "Kelly B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-04", "description": "Pretty and a very clean interior!\n\nWanted to try a new pho place, so I came by on a Wednesday afternoon and was seated right away. My boyfriend and I ordered the appetizer combo, bun bo hue, and beef combination noodle soup. \n\nAppetizer combo: I was very surprised that it was good! Each and every one was very fresh, unlike other restaurants that can taste a bit stale. It is a bit pricey ($14) but I would definitely order it again.\n\nBun Bo Hue & Beef combination noodle soup: Do you ever eat food and think to yourself there's just that ONE ingredient missing? and if that ONE ingredient was in it, it'd taste way better but you just don't quite know what it is? My boyfriend and I came to an agreement that both of the soup was missing that one ingredient and we couldn't find out what it was. My bun bo hue was pretty watery and bland and my boyfriend's pho was just bland. HOWEVER, I give them props for giving us lots of meat!\n\nI'm honestly the type of person to never go back to a place if it doesn't make me satisfied, but I really liked the appetizer combo so I'd come back, but I'll just make sure to order a rice place instead of soup.", "author": "Elaine C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-28", "description": "Food was not great at all. Small portions (togo) over priced. Go to perilla on Irving if you want decent food plus you get more bang for you buck.", "author": "Alden C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Delicious food, quick service, free tea, plenty of vegetarian options, nice decor and friendly staff. We come here regularly.", "author": "Maria S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "This place is a God send! Pho for delivery when you're hungover is the best thing ever. Not just that but their pho is so good! I'm not vegetarian but I love ordering their vegetarian pho. I normally get their vegetarian hot and sour noodle soup or vegetarian bun no hue. They're both delicious but their vikon chicken and bun rieu is bomb too. I'm planning to try each one of their noodle soups over time and will probably post updated likes on those as well.", "author": "Jennifer D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "Food is good but just learned they use PORK BONES IN THEIR CHICKEN BROTH. My wife is Jewish and we were informed of this tonight after years of specifying NO PORK, we have been loyal customers since the opened. VERY DISAPPOINTING!!! When in doubt order vegetarian broth. shame... shame... shame...", "author": "David S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "Came here because I was craving Bun Rieu. It was quite a disappointment. Somewhat Blan and not much meat in the soup. Too much noodles and tofu. \n\nService was kind of slow although I was the few people of 3-4 tables that was in there.", "author": "Monica N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-29", "description": "Beef tastes like rubber. Disgusting! Ordered UberEATS and had several missing or falsely advertised items. Likely fake reviews. Try another place!", "author": "Rachael F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "-Bún riêu craving satisfied!! Very yummy! \n-Fried chicken wing was tasty but a bit too salty, but the coconut flavored sticky rice patty hidden underneath the salad was surprisingly good! \n \n\nVery clean and nicely remodeled restaurant! \nI will return!!", "author": "Jasmin Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-25", "description": "This review is for food only, since I ordered delivery. I ordered Imperial Rolls, Sunflower Vermicelli Bowl (Bun Cha Gio Thit Nuong), and Sauteed Curry Chicken.\n\nImperial Rolls: 4/5. These were good, although not special or exceptional. But they were good. I appreciate that they provided vermicelli, but I wish they provided more than just one lettuce leaf. However, that's not a big deal and is only a nitpick.\n\nBun Cha Gio Thit Nuong: 1/5. The meat (pork) was dry and tough, and the sauce was too strong and had an unbalanced flavor. It was a chore to finish eating the meat.\n\nSauteed Curry Chicken: 2/5. Again, the meat (chicken) was dry, and the sauce tasted somewhat overseasoned.\n\nOverall: Dry meat is a deal-breaker for me, especially when the sauce and seasoning are not great, which was my experience. I'm not sure why the meat was overcooked this much. I probably won't order delivery from here again, although I would be open to stopping in, so I can at least ask the staff about the food.", "author": "Thuan N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Wed June 8th 2016\nSo this place just opened a few days ago by the people that manage New Sandy's just a few doors down.\nThe atmosphere feels very modern and intimate and the food (we got the $10 Sunflower Vermicelli Bowl) was really good.\nI only gave it a 4/5 because I'm cheap and feel like $10 is a little steep when other nearby places go for $7-$9, but the service and food was nice. Glad to have a good Vietnamese place near Parnassus so that we don't have to walk all the way to Perilla haha.", "author": "Nathan D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-13", "description": "I tried to like this place. Did 3 lunches , but its just too bland. Had seafood pho today and the broth was almost tasteless.   Also had shrimp appetized which was breaded and fried.  Again limited flavor. The pancake was good tho with very fresh and crispy veggies.and hot.", "author": "Lamb C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "The servers at this restaurant are super friendly and helpful if you can't decide what you want to get. They were very attentive and I was impressed at how frequently they came to refill our water cups. My only objection is that I think their pho ga is a little on the salty side, but I appreciate that it's a large portion size. I will be coming back here whenever I want pho! It's good value for your money and I like how it's a spacious restaurant.", "author": "Lynn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "I went back today and the noodles had an excellent texture al dente which has been lacking in the past, in fact I don't think I've ever had Pho that didn't have soft to limp noodles. I hope this isn't an exception!!!\n\nThe salad and appetizer combo are good but nothing that stood out from other restaurants. I would order those again and will try other items, but imo the pho is outstanding and as ErinG noted, customizable.", "author": "YearOf M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Meat is tender, soup is flavorful, and veggies are fresh. Quiet inside and clean. Kind staff. Try it out! Reasonably priced too! We cleaned our bowls nicely", "author": "Ernest C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "Delicate interior design and decors, cozy and quite enough, good place for friends get together or family dinner. Of course, its food matches with the look.", "author": "Leo P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "I had the vermicelli dish, it was okay, but the BBQ pork made it great. Whatever, you get i highly recommend adding the BBQ pork. Also, it was clean.", "author": "Francis M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "I was skeptical but they can actually perform magic. They deliver starting at 1030 am (great for the local hospital UCSF and gets them the 5th star) and are nice and well spoken over the phone. The magic comes into play with their chicken. The BBQ chicken Pho is the best I've ever had. They could actually put the BBQ on a desert and it would be magical. We have ordered out and eaten in and every time it's great. As some of the neighborhood places fell from grace this is a gem that should not be overlooked. They have a great Vegan and Vegetarian menu as well.", "author": "jody T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "We love this place!  Great viet food with a little fusion. Polite staff and clean dining and bathroom. The sea soup is excellent and something we always get. Same for the taro pan fried appetizer and fried imperial rolls also with taro. We are definitely repeat customers and this is where we bring friends when they are visiting from out of town.", "author": "wendy w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "I come here all the time - food arrives very quickly, good service, and food is pretty good (not the best Pho I've ever head, but good value especially for San Francisco). Take out is also very fast.", "author": "Erika H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-05", "description": "(Ordered delivery via Yelp Eat24) - I ordered on a cold rainy night and received a delivery confirmation of 1 hour. Totally reasonable and expected. Food arrived 15 min early! Always a fun surprise. Looks like I have a new go-to Pho delivery spot.\n\nPho Xe Lua - Beef Combination Noodle Soup - delicious broth, generous portions of all meats, plus the tendon was super thick and juicy  \n\nBun Ga Cari - Curry Chicken Rice Vermicelli Soup - nice curry, not too heavy. Good amount of chicken. Had plenty for leftovers the next day. Bonus!\n\nImperial Rolls didn't come with mint, but that was the only downside.", "author": "Patty J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Good place to have some decent Vietnamese food.  We stayed with the basic stuff like rice plates and vermicelli bowls.  They hit the spot.  I'd recommend eating in or just picking up as delivery took over an hour and food was cold by the time it arrived.", "author": "K W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-16", "description": "The imperial rolls here are like no other.  It is very lightly crispy on the outside yet very hot and tasty with taro on the inside.  If you order their combo appetizer, you can choose from different sauces for their spring rolls, imperial rolls and battered shrimp.  This is simply the favorite dish I must have every time I come here.  Their pho and bun bo hue are also very delicious.  Overall, the quality of food here surpasses those of other local Vietnamese restaurants in the bay area.  The atmosphere is also more relaxing here.  Would definitely eat here more often if I come to the city.", "author": "Linda W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "OH DANG.\n\nThis place has... UNBEATABLE prices. \nIt's modern and a little fancy inside. A good date spot. Nice window seats to watch the town go by.\n\nI'd park on Irving(?) street if you can.\n\nMy only gripe was the the server brought out my food about 5 minutes before my date's food. We elected to wait. \n\nThe Pho was.. literally the best Pho I've ever tasted. Great quality ingredients. Warm and inviting and rich with flavor. \n\nThe grilled pork vermicelli was perfect too. Noodles cooked just right. So soft. And I'm a little picky about my fish sauce being too vinegar-y but they did good. \n\nI would definitely recommend this place for a date spot, a lunch meet, a family occasion too. Looked like they hard large tables are tables bunched together to accommodate bigger groups. \n\nThanks for an awesome experience.", "author": "Nora N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "The Sunset District took us about 5 to 10 minutes fine parking not too bad nice little restaurant the food is kind of mix any kind of  food that you want in there nice and they have it even Lamb Chop dessert was pretty good service an the food came out fast and hot try it out you might like it to all of you have a good evening and take care", "author": "Miko A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-30", "description": "Delicious! We stopped by for a late lunch/early dinner around 4:30 on a Saturday. The restaurant was cute, clean, and refreshingly, mostly empty. We started with the Lemon Rare Beef (delicious!) and then moved into the vermicelli, beef pho, and clay pot entrees. All were delicious! We'll definitely be back!", "author": "Lesley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-24", "description": "Hands down, new favorite Vietnamese restaurant in the city. Granted, I've only been to The Slanted Door and Vietnamese restaurants in SoMa, but Sunflower Garden makes the trek out to the Sunset worth it.\n\nFirst of all, the restaurant is very clean, and there's enough space to spread out, which is super rare for a Vietnamese restaurant, much less a restaurant in SF. The staff is friendly and the tea they serve is delicious. My friend ordered the pho and I had bun bo hue and both were extremely tasty and the portions are decent for the price you pay! The broth of the bun bo hue, in particular, had a good balance of sweet, salty, and savory flavors.\n\nI am definitely coming back again when I'm in the mood for some great bun bo hue!", "author": "Trisha V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-21", "description": "Happy to find a place that's close to home. The portions are a tad on the small side, but we've already been here twice and will definitely be coming back for more. Great service, too. Quality of food is much better than Perilla around the corner, in my opinion.", "author": "Caitlin M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-27", "description": "This would not be my go to pho place let's just say. The broth was so watery and tasteless. I didn't feel it tasted authentic at all. As for other items my friend got a clay pot with chicken and rice but it wasn't that flavorful either. It's also hard to find parking around this area. Not the friendliest or fastest service either. Won't be coming back anytime soon.", "author": "Vicky C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-09", "description": "This place was a delight! Would definitely be back. It's not your typical hole-in-the-wall pho place. The interior is spacious, nicely decorated, and clean. Plenty of seating and great service. The prices aren't as low as the more basic Vietnamese places but portions were generous and the food was so good. I had the Vermicelli bowl with imperial rolls and chicken. My tablemate had the wonton soup. We were both really impressed and would love to come back!", "author": "Susan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-24", "description": "I'll give this spot a solid four stars (A minus) because the 5 star rating (A plus) is reserved for outstanding, life changing establishments. We went to yummy yummy, our go to pho place, but it was closed, so we yelped pho in the area and found this place. I really liked the interior and was looking forward to trying the food. I ordered the typical chicken pho bowl and was not disappointed. Solid flavor and ideal for those cold and rainy days. In fact, pho was so good that next time I crave it I'll pick this place over yummy yummy.  I recommend this place for the pho. Try it for yourselves and let me know what you think.", "author": "Herman R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Ordered the chicken garlic noodles to go. The noodles were fine- not the best I've had but not terrible. The chicken however was pretty gross. It was basically all cartilage and I ended up throwing it away. Definitely not worth the 13 dollars I paid for it. Will not be returning.\n\nI did think the interior of the restaurant was quite nice however- very clean and cute.", "author": "Tony G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "This is some of the best imperial rolls I've had. Ever. The noodle soup is delicious as well. It's a new Vietnamese spot I hope they stick around.", "author": "Victor T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-07", "description": "This was our favorite Vietnamese delivery place.   The food is usually fairly good.   The reason for two stars is that they have been late on our last three deliveries.   It takes about 2 hours now to receive the delivery.   They will quote a delivery time of 60 minutes, after your order is confirmed it becomes 90 minutes, and add another 30 minutes for \"traffic\".   The woman who answers the phone is apologetic but they have never attempted to correct their tardiness!   In fact, at 2+ hours (on a 60 minute quote) we have still not received our current order...", "author": "Aceman C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "I highly recommend the beef stew pho here. It's consistently great - the beef is always extremely tender and the broth is perfectly seasoned every time. I've been to quite a few Vietnamese restaurants in SF, but Sunflower Garden is definitely my favorite!", "author": "Codi F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Came for lunch on a Saturday, no wait but the food took a while. We ordered the seafood noodle soup and the clay pot. The seafood noodle soup was the best in SF. The tofu was nice and crispy. There was a good portion of noodles and shrimp. The soup was nice and flavorful. The claypot tasted good but had so much more rice than toppings. There were only maybe 5 pcs of chicken but I guess it was because there was also some shrimp and sausage. Overall, everything tasted good. Would come back for the seafood noodle but not the claypot.", "author": "Christine L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-21", "description": "If you are a fan of MSG, then Sunflower Garden is the perfect restaurant for you!\nUnfortunately for me, I am not a fan of MSG, so I was not even able to finish a quarter of my noodle soup. The amount of MSG used in their food is exceptionally high. A fair warning to my fellow MSG dislikers.", "author": "Lauren C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-08", "description": "Worse pho ever had!!!\nI ordered vegetarian spicy hue soup with extra veggies. It only had bok choy and a very few mushrooms. Normally vegetarian pho is chock full of veggies. Also noodles really tasted soggy and not fresh. My friends pho.was a beef one and she also said it was bad.", "author": "Julie V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "I was originally going to Perilla, but I decided to check this place out instead. The interior is really modern, and just by that I know it isn't a regular pho place. I ordered a Thai iced tea and a Mongolian Beef which came with rice. The plate was okay, nothing outstanding. It had more mushrooms than beef, and the sauce was a bit off. Although the food is average, I think the restaurant really stands out with their presentation. I do want to come again and try their other menu items.", "author": "Jeanne C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "I gave two stars this time, because our order was wrong. We ordered a vegetarian salad, and we got the chicken version instead.", "author": "Ashley H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Been eating here since it was named Sandy's (something) and located down the block a few stores.  I always loved this place because the people are so nice and the food was good and affordable.  This new store is fancier and they upped the prices a little but still, my go-to Vietnamese pho place.  If I get a pho and the cabbage salad, I feel I've gotten all of my daily nutrients plus I'm merrily satisfied without feeling full.  They also deliver now which I haven't tried but will since I'm often too lazy to walk the 4 blocks.  I've had people tell me the pho down on Larkin is much better but since I've never eaten there, Sunflower will do just fine.  I like Sunflower better then Perilla, and Yummy Yummy is either closed or too full of people whenever I want pho (but I have gotten take away from Yummy and it was good).  I hope Sunflower and I grow old together.", "author": "Kai T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-07", "description": "Best Pho in the sunset! The broth is so rich and full of flavor. I like Vietnamese food in general but this place really stands out. The staff is friendly the place is clean and newly remodeled but it's all about the food.", "author": "Jessey A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "This place took 1 hour 39 minutes just to deliver 2 bun boa hue. I don't know how you guys feel about waiting that long but I think that was just wrong in so many ways plus they didn't even notify be about the wait. I would definitely not recommend this place at all.", "author": "Honest O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Very good! I had the seafood pho and Imperial Rolls and everything was so delicious! Great Service! Good food! Recommended! I will be returning for lunch!", "author": "Valerie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "Been here a few times, it's our favorite Vietnamese restaurant in SF (and we go to a lot). The fried taro flour cake is delicious and unique. Everything else we've gotten has been unusually good. Highly recommend!", "author": "John K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-24", "description": "They're going out of business soon. 25 mins wait for a bowl of noodle when there are only 3 other parties in the restaurant. Unacceptable.", "author": "Andy B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "I ordered Bun Bo Hue.  It is okay.  They put pho beef inside the noodle to substitute.  The veggies are for Pho.  The restaurant looks nice but not clean.  The floor is dirty with napkins on the floor and sauce bottles are dusty.  Overall, the menu has everything I want to eat but the restaurant is not clean.", "author": "Ngan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "This place is great. I accidentally ordered for \"pick up\" instead of delivery because I was sick and they still made the drive to deliver my food although it was out of their driving range. What great customer service. \n\nI ordered the vegetarian pho soup and spring rolls. Amazing food to top of the night. Will definitely be ordering from this place again.", "author": "K M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-28", "description": "Great value and food, clean restaurant, friendly staff, Giants game on the TV. Can't go wrong.  Highly recommend!", "author": "Louis L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-03", "description": "I ordered a chicken won ton soup. It got delivered and when I opened it up there were 2 won tons and a few tiny pieces of chewy over cooked chicken. I was so disappointed and will not be ordering from this place again. The only reason I gave 2 stars was because the broth was good.", "author": "Emily H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-15", "description": "This place is such an awesome addition to the sunset! I grew up eating allot of Vietnamese food down in South Bay and this place is just as good as my favorite spots back home! Their ingredients are super fresh and their meat is very flavorful. They have a great Vegetarian menu as well :) I've been here about 5 times now and have tried new things each time and have impressed each time.", "author": "Jasmine P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "Yum... my favorite Vietnamese noodle spot! Love their sweet and sour veggie noodles. In fact, this place has the best vegetarian options I've seen at a Vietnamese restaurant. Place is also clean and staff is friendly.", "author": "Linda L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-20", "description": "Caution: Their Pho is an MSG bomb! I'm particularly sensitive to MSG and I gave up on eating it after one spoonful of their broth. Even my wife, who is Vietnamese and used to eating Pho with MSG, got really thirsty and dry-mouthed shortly after eating it- and she didn't even really drink much of the broth.\n\nThe rice noodles were also slightly overcooked. The portion of herbs and beansprouts was the smallest I've ever had at any Vietnamese restaurant.\n\nWe also ordered their Pork Chop combination plate for $13.00. This is usually an indulgent feast at most Vietnamese restaurants. Here however, it was just one wafer thin pork chop, three thin slices of cucumber, and two bites of egg cake. Nice presentation, but a total rip off for the price. This was maybe $6 worth of food, at most.\n\nMy wife and I will not be returning. Such a disappointment as we were excited to see a new Vietnamese restaurant in our neighborhood.", "author": "Gene G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Sunflower Garden most definitely have satisfied my Bun Bo Hue cravings!!! I usually order my Bun Bo Hue extra spicy, so many restaurants overload it with chili oil and it becomes too oily to eat. But at Sunflower Garden, I asked for extra spicy, and it was perfect!! The broth was sooooo clear and clean, you can taste how much effort they put into their broth. It was almost home made like. I also loved how the meat seemed fresher than other places. Usually the pork blood at other restaurants are sad and cold, but here it was juicy and warm. The meat was really tender. Also what I really liked was that everyone got their own personal veggie (bean sprouts + mint leaves + jalapenos + lime) plate. I most certainly enjoyed my meal.\nWhat really stood out to me at this restaurant was their service. The male server was super nice and accommodating. Always making sure we are ok and have everything we need. Ironically, on my walk out of the restaurant while praising how great the service was, the server ran after me to give me the hat that I had forgot at the restaurant. \nThank you so much Sunflower Garden for becoming my favorite vietnamese spot for Bun Bo Hue!!", "author": "Ariunaa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "Food is decent- garlic noodles are little bland and eggplant had good flavor but was a little soggy. Portions are big enough but on the smaller side considering perilla is right around the corner and is very good.", "author": "J A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "I've come here 3 times since they've opened and love everything so far! I've tried the Sunflower vermicelli bowl (meat + imperial rolls), Mongolian Beef, and my favorite - Shaking Beef with Tomato fried rice. Really nice and tender pieces of meat and the fried rice uses a tomato paste not chunks of tomato, which gives it a unique flavor. I also tried the Mango smoothie which was a huge portion, perfect thickness, and great ingredients.", "author": "Nick L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-14", "description": "Not good. The food tasted good but then we had a little surprise at the end...a little bug (looked like a maggot) crawling on our plate. We have photos and video as proof. Way too embarrassed and shocked to even say anything, we're just never, ever going back.", "author": "Sam P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "This is the same owner as New Sandy Deli Cafe, that closed up the street. I ordered food for a catered party, and as always, it was delicious!  My guests raved about it. Living in the neighborhood, I've enjoyed the prior restaurant for years and was a regular. I'm so happy for this family that they have a larger and modern space. I don't mind paying a little more as the prices are still reasonable. They are a hard working family, making consistently great food with fresh ingredients!", "author": "M M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "I've eaten several times here these two weeks and everything has been delicious! The pho has the delicious light broth that is savory but not salty. And the beef balls are so good! The vermicelli is also great, especially with the imperial rolls! The chef is really good, as you can taste the power of the wok in the stir fry dishes. I prefer this place to the other ones around in the neighbourhood for Asian food. Oh they have amazing young coconut juice! Bit small but so fresh and you can eat the flesh! Service is also very friendly. Pretty much hits all the checkmarks for me!", "author": "Zoe E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "This is my favorite spot for vietnamese in the inner sunset. Satisfaction is guaranteed with the vegetarian imperial rolls and any pho from the menu.", "author": "Obi O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-09", "description": "My favorite casual cafe is now upscale!  The ambiance is \"date\" worthy and they upped the level and added to the dishes from their New Sandy's menu.  My staff and I tried the sea bass (excellent), rack of lamb (was well done but if you like medium rare... tell them when you order) and lemon grass spicy soup (top level).  Our favorite waitress/manager Jo-Jo and her crew has been there lunch time.  \n\nGreat, normally priced food, upscale ambiance and Jo-Jo with her friendly staff...... Great!", "author": "Bruce D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Hands down the best imperial rolls I've had!!! I order BBQ pho, and the chicken and pho came as separate dishes. The broth of pho was light and yet aromatic. Great place, will order again!", "author": "Lillian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Curry chicken soup was so heartwarming and satisfying!  Bbq pork was suuuuper tasty as well!", "author": "Cici D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Went here for dinner a couple of nights a go. There are several Vietnamese places within 2 blocks of Sunflower Garden, and I've been to them all and actually like them all, but this one definitely has a more stylish atmosphere than the others nearby and prices weren't that much different. The service was good and the food was great.  \nThe only complaints I have are that the Bun Cha with grilled pork that we ordered, was pretty light on the pork, and while we were there, there was a large TV with nothing playing....only a Netflix menu. I would prefer to have it off and just play music. No need to watch TV while at the restaurant.\nWill definitely be going back though.", "author": "Desmond G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Great new addition to the neighborhood. Clay pot rice and wonton soup were both excellent. \n\nClean place, friendly staff. In the rotation!\n\nIt's byob, by the way!", "author": "jason e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Pretty legit vietnamese, and great veggie options. A little pricey for vietnamese but worth it overall. Service wasnt great, but I don't expect much from most asian restaurants.", "author": "Nicole N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "There are just some days that require garlic noodles. On those days come to Sunflower. Nice new location. Portion was definitely smaller than Potrero but still sufficient. Nice ambiance and near the park.", "author": "Sandi E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Clean modern space with above average pho. I had the five spice chicken pho ($10). Soup was light but flavorful, good amount of noodles. Only downside was the chicken was a little on the salty side, seemed like it was marinated in fish sauce too long.", "author": "Brendan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-07", "description": "Wow!! It's a great restaurant. Always good service and fresh food to eat. I love it!!", "author": "Aki H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "The papaya salad and spring rolls are delicious.  This restaurant had some unique soups, Bun Rieu and Canh Chua Ca which are much more fragrant and exotic in comparison to a traditional pho.  The wait is a bit longer if you are ordering something exotic but it is worth it. Great background music too!", "author": "Alan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-09", "description": "Their Beef Combination Noodle Soup and BBQ dishes are good! For the Beef Combination Noodle Soup, you can even customize the meat!", "author": "Janet C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "Unreliable hours. Stopped by around 10:40 and the restaurant was closed. The sign on the door says they open at 10:30, except Tuesdays. This was the second time it happened. I recommend calling them ahead of time to save your trip.", "author": "Joy K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "The New New Sandy's! I miss the old dive location 2 doors down (which is apparently going to be their Banh-Mi take-away branch),  but this place is very nice. Food is just the same as New Sandy's maybe on fancier plates. The shaking beef on red rice is still amazing for $14, given that Slanted Door charges $40 for the same thing.", "author": "W D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-31", "description": "This place looks nice, but that is all.  The service is slow and mediocre even when the restaurant is empty. The servers don't say \"hello\" or \"welcome\", they just take your order, and they bring it and don't return until you wave at them.  Despite what yelp says, they do not have beer or wine. We had Spring Rolls, a BBQ Pork Vermicelli Bowl, and the Five Spice Chicken Rice Plate. It was all bland and uninteresting.", "author": "Harold W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Sunflower Garden just opened and they have the same menu from their New Sandy store, minus the sandwiches. Fortunately, I was informed by the waitress that New Sandy's will still be serving their legendary BBQ Pork Banh Mi. I had their rice dish (#15) with bbq pork. The pork was perfectly marinated (same meat as their bbq pork banh mi), a nice dash of onion oil, shredded pickled carrots, and fish sauce. I'm glad this new store front is open, New Sandy's is truly a gem and I'm glad they are finally getting an upgrade to their restaurant.", "author": "country g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "Finally a place where they would make you spicy food as you requested. I ordered from Caviar and the food came spicy along with extra spicy sauce per requested. They definitely got extra point there. I got the seafood noodle soup and rice clay pot. would definitely order again!", "author": "Drew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Good honest Vietnamese food.  Good variety on the menu, nothing too fancy. Their sandwiches are delicious, just like their smaller previous restaurant Sandy. My \"go to\" Vietnamese neighborhood restaurant.", "author": "Mit T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "i love ts aċ! t  staat s at a t  s ċ! i' tt t bbq saċ, ċ i  a  sa faċsċ ċ i  t, a ts aċ as t st  a! never s t at att!!! \net s ċs a t  a as i s u 't hq ċ", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "Same excellent food and service in a larger, more comfortable, nicer space.", "author": "E G."}
