{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "So last night I was hungry but not super hungry. Which meant I didn't want something super heavy. As I'm trying to think if something to eat sushi pops up in my head. I think to myself that sounds bomb.com right now. Its about 10pm mind you so I start looking for sushi places on yelp thinking I would be out of luck. I came upon sushi raw and. saw that they were open till midnight which is rare and I was pretty excited about that! I start looking at the review and to be quite honest they're a mix of reviews however the good out-weighed the bad. Mind you I'm not a huge fan of sushi but everyone in a while I like to have some.\n\nNow on to the good part..... the food!\nMy friend and I got the Deep fried spicy tuna roll= my favorite of the night! not too spicy either\nMiso soup = pretty good not too salty\nCalifornia hand roll= interesting concept think of it like an ice cream come but with sushi in it? and the \"cone\" is wrapped in seaweed. It was good your basic California roll \nSpicy scallop roll= good not great  \n\nOverall the service was good and so was the food. I definitely would come back again and its a bonus that they're open late!", "author": "Eva B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "First off, I love that this place is open late. Perfect for after a baseball game or NBA game! \n\nSecond, this place has GREAT sashimi. It's super fresh, not chewy (which I've had bad experiences with other places before), and just tastes really good! I've had their chirashi bowl once and it was so delicious. The fish is very fresh and the rice they serve with it complements the fish very well, it's like sushi rice. \n\nI also love their bento boxes. It comes with a good amount of food. The tempura is really delicious, especially the vegetable tempura. The chicken is slightly crispy, and the teriyaki sauce is not overwhelming, which is good. \n\nMy boyfriend and I always go here if we need a late dinner, because it's the only place open that sells good Japanese food. Parking is not too bad, all street parking. Service is good, I've never had issues with the service here.", "author": "Nikki P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Time for another 3.5 star grab bag! You never know what you'll get with 3.5ers, and it seems like the complaints for Sushiraw are a pretty good mix of slow service, sushi quality, and cleanliness. I'd say in terms of quality, don't come here if you're looking for a fancy, expensive sushi experience. Come here if you're just craving sushi or you're hungry. So keep that in mind.\n\nI personally loved Sushiraw. I came here with my SO after a long day at work, on a cold, misty night. It was quiet and laid-back, and the server seemed friendly enough. \n\nWe ordered the sashimi combo, the chicken udon, the devil mountain roll, and the shrimp tempura roll. The sashimi combo was alright and I loved the chicken udon. The broth was flavorful and the chicken was tender, although I did wish there was another fish cake (there was only one). We loved the devil mountain and the shrimp tempura rolls! They were super tasty. Also, the presentation is pretty cool--the sashimi plate came on a light up tray! And the other rolls we ordered were pretty neatly arranged.\n\nI'd say the only downsides were that the sashimi combo wasn't the freshest, and I did think the chicken udon was a little heavy on the vegetables and could've used more chicken and fish cake.\n\nOverall though, this place is pretty good for being a sushi place in the sunset at these prices. Some people come in expecting Jiro Dreams of Sushi, and this just isn't that kind of place. So, you get what you pay for and if you want the best sushi in the world, of course you're going to be disappointed.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I usually order takeout here. Staff is nice and welcoming. They always offer water/tea while I'm waiting. I usually get the spicy salmon roll (no deep fried) which is pretty awesome. Udon and ramen are decent. I love the whole grilled squid, too!!\nGreat spot for late night snack!", "author": "Krystal P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Have you ever passed by a place so often that you kind of forget about them?  More than a little nonsensical to say, but pretty true for me and SushiRaw.  It's nothing against them; they just happened to blur into the background as I would pass by every day on my way to my old job.  As we aimlessly drove around in search of a late dinner though?  They sure did stand out, especially since we had a hankering for some sushi!\n\nStepping inside, the first thing that struck me was how much nicer this location was compared to their old spot in San Bruno.  Granted, it was a low bar to clear (the other one still reminded me of the Taco Bell that used to be there), but I like the dark decor and tinted windows.  More importantly though, the menu here looks a whole lot better.  Not only does it cover a wider range (sushi, sashimi, bento boxes, starters, udon, etc.), but it seems like there are more choices than I remember the other location have, especially with their rolls.\n\n-- FUJI MOUNTAIN ROLL - Lobster Salad, Avocado, Mango Baked with Crab Meat, Scallop Spicy Sauce, and Tobiko...$16.95\n(https://www.yelp.com/biz_photos/sushiraw-san-francisco-6?select=bQtXHd_UXDk7bChNeo7Mgw)\nIt may not have added to the dish, but it was pretty cool to see them set the dish on fire.  In any case, this was pretty solid.  Despite not being able to taste the mango, I liked the mix of flavors from the lobster salad, avocado, and crab meat.\n\n-- ROMEO & JULIET ROLL - Salmon and Avocado topped with Fresh Scallops, Tobiko, and Mayo and wrapped with a Soy Paper Wrap...$13.95\n-- HOTATEGAI - Scallop Nigiri...$6.95\n(https://www.yelp.com/biz_photos/sushiraw-san-francisco-6?select=r9GyFlqPoEtvyGmVyFmR_Q)\nI was looking for a roll that was relatively light and the Romeo & Juliet did the trick!  Both the scallops and salmon were really fresh and there wasn't a ton of sauce.  As for the Hotategai, I didn't plan on more scallops, but I'm glad I did.  Not only was the cut pretty large, but it was really tasty!\n\n-- HAMACHI NIGIRI...$6.25\n-- ROMEO & JULIET ROLL...$13.95\n(https://www.yelp.com/biz_photos/sushiraw-san-francisco-6?select=M_A-TTfdTtJoLH8DVkfMuw)\nHaving already tried their hotate and sake sashimi/nigiri, I only had the hamachi left to try.  All in all...not bad.  The cut was both generous and fresh, but this wasn't the most flavorful one I've had.  As for the Romeo & Juliet roll, it was just about as good as the first time around.\n\n-- SESAME CHICKEN - Deep Fried Chicken Japanese Style with Spicy Sauce...$6.50\n(https://www.yelp.com/biz_photos/sushiraw-san-francisco-6?select=Enps7aCSuLliCEoaNXkycA)\nHonestly, this just wasn't very good.  Not only did every piece have more batter than chicken, but they weren't all that flavorful either.  Had I known the \"sesame\" was just a ton of seeds dumped into the aioli, I wouldn't have bothered with this.\n\n-- SAKE SASHIMI...$11.95 (or $6 if you order $25 or more)\n(https://www.yelp.com/biz_photos/sushiraw-san-francisco-6?select=ADVTNp_0JpMII-8M1P_JlQ)\nWhile they may not have been the prettiest of slices (a little uneven and a couple looked a little \"torn\"), this certainly tasted the part!  As with the scallops and the hamachi, the salmon was both fresh and tasty.\n\nConsidering all of the restaurants that have passed through this space in the years since the old ZIm's closed, it's great how SushiRaw has found continued success over the years.  Whether it's day or not, it seems like there are always at least a handful of folks grabbing a bite here whenever I pass by.  What's more, it seems like they do a steady amount of to-go business as well, as I saw a ton of people stop in to pick up orders.\n\nAll in all, despite some of the things I tried not amazing, SushiRaw isn't too shabby.  The food is decent, prices are fair, service is fine, parking isn't hard, seating isn't tough, and they're one of the few Japanese joints around that's open late (until midnight).  It may not be the type of place you make a point of going to, but they sure are handy to have around!", "author": "Mike L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "I used to frequent their excelsior location on mission street very often when I lived in the area, but since I moved they shut down and this is the closest Raw to me. I had only been to this location one time before and enjoyed it but with so many other options wasn't compelled to come back. In the last 5 years they've remodeled their inside and definitely upped their game because this place is solid. \n\nAll the nigiri i had was incredibly fresh, highlighted t the always stunning sake belly. The fish was perfectly presented and lush in color with a great ratio of plump meat to soft rice. \n\nBoth rolls I tried were also knockouts. The City Roll was a complex play on texture with crispy soft shell crab, succulent yellow tail, and fatty avocado. It towed the line between over the top American and more traditional in a way that really spoke to me. \n\nThe Mexican Desert Roll was more rich and absolutely awesome. Perfectly presented with little slides of jalapeño and dabs of hot sauce atop squishy imitation crab and seared smoky albacore. It legit tasted like sushi nachos and I would order it again in a second. \n\nService was great and they even brought out a big bowl of mango ice cream for my brothers birthday. Highly recommend and will return when in the area!", "author": "Sean S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Just moved here and I'm looking for a great sushi restaurant. And I finally found one, top to bottom best sushi experience I've ever had", "author": "Abdallah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Date night.\n\nSushi? Why not! \n\nUsually Ozumo is my choice for date night. For everyday sushi you can find me at Amami sushi.\n\nI decided to pick somewhere different. Somewhat familiar but different. I'm glad I did! \n\nWe had \n\nHirame Carpaccio\n\nJapanese Uni\n\nFuji Mountain Roll (If you like the theatrics of flambé get this)\n\nChefs choice sashimi \n\nUnagi sushi \n\nAmaebi - they fried the heads for us to enjoy after we finished the sweet raw shrimps\n\nSapporo \n\nSake \n\nService was excellent, the sushi was impossibly fresh, and the sake was delicious. \n\nNo fuss date night perfection in the Sunset. Glad I said yes to that! \n\nFive stars for perfection.\n\n**then we slipped out to the dive bar next door to drink whiskey before the \"date date\" part of the night", "author": "Jennifer C P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "We after-partied here on a whim.  We had just stuffed ourselves to the gills on Octoberfest food- brats, pulled pork, hard boiled eggs (not sure that's German...) potato salad, did I forget to mention that OMG pulled pork? So really we were not looking for more food just wanted to car pool some peops home...  We were at the right light when someone said hey there's a sushi place there? Sooo....  And hey there's always room for sushi, right? We ordered rolls only.  My favorites were Cherry Blossom, Romeo and Juliet and 49'er.  Everything was delicious. The service was very attentive.  We will definitely keep this place on our list.", "author": "Keeping It Real K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-29", "description": "My friend found a black hair in her miso soup and it was kindof a weird experience thereafter. She went to go tell the waitress and the waitress kept insisting to bring her a new one. She even came back to the table and asked again, after my friend told her many times that she was not interested. I'm assuming they make the miso in a large pot, so if there was a hair in one soup, it was from that main pot of miso...\n\nOrdered some regular rolls: Crunchy and Rock n Roll. \nNothing special, you could buy same quality from Safeway.", "author": "Olivia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "Save your money - find another place\nFood orders sent incorrect and when they called Reevy came back an hour and a half later.", "author": "A. Marie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-12", "description": "Fish was flavorless and mushy. Lacks any real flavor in the sushi. Plus the wait time is insane. Took twice as long as other sushi restaurants to get our food. High noise level in establishment. Try another place.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "Despite the fact that it is ON 19th and has huge windows out onto 19th, it's not actually loud in there.  \n\nRelatively small place, had to wait a few minutes to get a seat at the bar at 8pm, on Saturday, but they do take reservations, so that could be avoided.\n\nIt's actually pretty fun to sit at the bar because you see the sushi guys doing their thing and it's impressive how fast they move and how hard they work!\n\nMy favorite of the night was the vegetarian roll with mango, cucumber, avo, and seaweed salad on top.  The mango was a good addition and the seaweed salad was really crunchy and delicious.  The Shrimp Tempura and Chicken Teriyaki Roll were both also quite good. I like the Swamp Roll the least - I think because it only had the sweet potato in it and just wasn't complex enough.\n\nIf you purchase $20 off the menu then they have a special menu which you can order something else off of for cheaper which is cool (a small beer for example is only $2).\n\nIt looked like they had some really fun specials too - like a LIVE urchin, and other sashimi platters served on ice with lights (advantage of sitting at the bar - sight seeing). \n\nThe way they managed the making of sushi was interesting. They made some of ours and then they paused, made other peoples, and then made more of ours. Not a bad model - maybe this is what everyone does, but noticed it here particularly.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "We love this place .  Fresh and fast serving !!!! Best delivery . Everyone are super friendly and hey already know what we like and  what we may forgot to order !!! \n\nFish is so fresh , and juicy .", "author": "Tetyana G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Tl;dr Parking was kinda rough, but the food was good.\n\nSushi Raw wasent busy when we arrived and immediately got sat. Our server was nice and quick to take our order. We did have to remind her that we ordered tea but that was no big deal.\n\nWe ordered the 3 item bento box (Tonkatsu, Short Ribs, and mixed Tempura), Philly Roll, and Seaweed Salad. The bento box was good. The tempura and Tonkatsu were nice and crispy, not burnt. The short ribs were tender and not drenched in sauce. The philly roll had a good ratio of cream cheese to salmon. Seaweed salad was good as well.\n\nBathroom is very narrow though so some people might have to squeeze.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Surprise surprise - some of the best sushi and customer service we have ever had. Delicious, fresh (they fly it in daily) and offer several gluten free options. My son is allergic to seafood and they made sure he was safe. (Yes, I realize we are in a sushi place with seafood allergies, but he loves he other fish!)", "author": "B C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "This review is just for delivery. \n\nOfficially--best delivery for sushi in the neighborhood! Fish is fresh, and the orders are consistent. I'm happy with their bentos as well. \n\nThey deliver quickly, and I appreciate that they're open late. \n\nI only wish they had more variety in rolls with solely raw fish, as in their name. \n\nFrom people calling me about my order, and the delivery guy, service has been great. Thank you for making my evenings easier after a long day!", "author": "jolie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "I love it all the food. I asked for delivery and was really tasty, was very fast. It was the fast delivered I have had :)", "author": "Nayara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "We ordered delivery at 10:45 p.m. after a long day of traveling. The food arrived on the early end of the 45-60 minute delivery window (thank goodness) and everything was fresh and tasty. We ordered tempura udon with clear broth, gyoza, and the sushi raw veggie roll. \n\nUdon: The broth was light and not too salty. My husband doctored it up with some of the tempura dipping sauce, but I thought it was tasty as served. Nice ratio of noodles to broth. The tempura was a little soggy (not to self: delivery tempura, not the best idea), but the vegetables were perfectly tender and everything tasted good.\n\nGyoza: Yum! Well seasoned and well cooked.\n\nSushi raw veggie roll: This was like a swamp roll without the meat. I loved the combination of seaweed salad and sweet mango. It was a little hard to eat because each piece was on the large side, but I was willing to cope. I would definitely order this roll again.\n\nOverall, we were very happy with Sushiraw and grateful that we had it as a late night delivery option!", "author": "Ali S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-08", "description": "For years now I wanted to stop at the sushi bar on my way to SFO and back. Tonight was that night and I am so glad we did. Our server named Quinn was a delight and an excellent waitress. She made several suggestions that were phenomenal. Waitresses like her get well over 20% in a well deserved tip. Our food was delicious. I encourage everyone to check this place out.", "author": "Rachele K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-16", "description": "The quality of the sushi is just okay. They are Chinese establishment. Do yourself a favor and go to Japan Town for good sushi. They charge for extra ginger that supposed to come with each roll. They don't care for business and don't do catering. If you plan on driving, there is no street parking", "author": "Vlad V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "This is the best sushi I've had delivered. Haven't had anything else delivered, though.\nWe ordered enough to get a free roll. So they gave us a duplicate of the eel roll we ordered, instead of the other option.\nBoth were good, but redundant, and certainly, variety would have been appreciated.\nThe ikura sushi should be called rice with some orange eggs. Some is the operative word. One layer that did not even cover the rice.\nWeak.\nThe sunomono was cucumber pickle, sure, there were 2 slices of fish, just as this as the cucumber slices, but, nearly invisible.\nThe rest of it 50 dollar order was unremarkable.\nBut, they did deliver.", "author": "Hal S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "If you're looking for bang for your buck, sushiraw is the place. Very good (not amazing) sushi for a great deal. Hot sake is good too!", "author": "Lillian W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "This place was actually amazing. The place my boyfriend and I usually go to is closed on mondays and I don't usually like new things but we tried this place and I don't regret it. Service was fast, everyone was super nice, and the food was terrific. Would definitely come back.", "author": "Oshion J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Sushi raw .\nWhat can you say , once you have found parking.  We came on a Friday night around 6:45 we found the place not crowded. I figure that  this is because of parking. \nWe ordered the sushi deluxe meal. My wife wanted to order the lobster roll, the\nWaitress with purple hair suggested to order the whole lobster for a couple of dollars more, so I said why not , wow the wow factor was worth it. It taste was good not knock your socks off , but still worth the money. \nThe sushi deluxe version, came with lots of food and California rolls. Soup and salad. Nothing special, but worth the price for what you get. \nWe also ordered an appetizer of grilled\nSquid. This item takes time to cook right so it came after we had our main dishes, no big deal because I know it take a while to cook. \nAlso they have a special menu if you order something like $30 off the regular menu you can order one item from the special menu at a reduced price.  So I got a small sake. For a dollar . \nI was so stuffed, we had a Togo container. \nWe where also given a nut cracker for the lobster claws, it was funny when the waitress came up to me an said to be careful with them, I guess some\nPeople don't know how to crack lobster. But it was cute. \nFor the money it was well worth the money.\nNot authentic but decently price for what you get.", "author": "Jesse S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Open late with quality nigiri.\nPerfect after a late night workout or airport pickup. Ramen is good and the sushi is definitely worth the trip.  $16 for 8 pieces is a great deal in this city and the quality and freshness of the fish is spot on.  Also there is a $1 menu if your order is $15 or more which gives you the choice of sushi, oysters, or beer/sake for one dollar.  Come on man!  Better than the $1 menu at McDonald's!!!!\nJYW recommends!", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Fastest delivery I have ever had. Food was great, rainbow roll was just what I needed.", "author": "Myk V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Great place if you're looking for a bite to eat pass 9p. First time in Cali so this was our first meal. Their entrees can be made into an ala cart or bento which includes rice and miso soup. Their beer is a great price and this place is worth it!", "author": "Kristal Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "The quality isn't the best, but the location is convenient for sushi. The service isn't super consistent either - sometimes one will be very attentive and another will disappear for like 10 minutes when you're trying to get some help. Last time I went, we ordered the sea bass appetizer and it wasn't until I flagged someone down for help because we didn't receive it yet and we were all done eating basically...wasn't it listed as an appetizer?\n\nI do think one of the nice things offered is when you spend at least $15, you get a discount on a few items (good for groups) - $1 small sake or beer / $2 for large, $5 5 pc sashimi, etc.", "author": "Cheri C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "So for a long time I've been craving a lobster roll and I finally got one while going here. I expected what anyone else would have expected a sushi roll to look like. However, this lobster roll replaced the rice and seaweed wrap with a cucumber wrap. I was mind blown. At first I saw it and was disappointed because it seemed so small for $14-$15. Then I tasted it and it was amazing! One of the best rolls I've had. Wish I had more but it was definitely worth getting.", "author": "Isaac H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "Yep, still like this place. \nI love ordering for pick-up on Eat24. Instructions were followed wonderfully. If you are ordering for a vegetarian make sure to ask that they put those rolls together, or else they might put a vegetarian roll next to a meat roll. \nSwamp Roll is my husband's favorite, and if you like seaweed salad it might be your new favorite too. Sushi Raw doesn't skimp on the fancy vegetarian rolls. They even have a rice less roll for the low carbers. \nI wouldn't call Sushi Raw the finest sushi establishment, but they are still a great addition to the neighborhood.", "author": "Heather F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-14", "description": "Food was delicious but it took WAY TOO LONG TO COME OUT. For a rice plate had to wait 40 min and now one is even here.. they need to work on deliver and making the food faster and the portion is a bit small and over priced. The dishes are super dirty, especially the cups I always drink out of a straw and I'm glad I did because their glasses still have residue like they haven't washed it, and I can feel the residue and it's gross. But they were nice and friendly and good service besides food taking way too long.", "author": "Melanie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-07", "description": "I'd consider myself a regular here.  It's consistently good and filling.  Not knock-your-socks-off good, but so far the best Japanese I've found on this part of the Taraval corridor.  Might suffer a bit from the loud road noise being right on the corner of 19th Ave, but the bonus discount price menu is a good incentive to dine-in.  Wait staff are all very friendly.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-23", "description": "Overpriced for the quality you get. I was not impressed with anything I ordered. The only thing that hit the spot was the complimentary green tea cause it was cold and raining outside. \n\nIt really annoys me when a sushi bar cuts your roll so thick that it becomes difficult to fit the entire thing in your mouth and successfully chew. Alternative is to bite the thing in half and then have the roll fall apart. That's how my philly roll came and it was annoying. I also ordered the cherry blossom and didn't care for it. I definitely would not order that again even though it looks good in the menu picture. Added the $5 albacore sashimi for the $15 purchase and that was probably best part of the meal. \n\nDefinitely an option for late night eats in this part of town, but you could do better.", "author": "Taryn S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "Rating: 3.5 stars\n\nI must say I was pleasantly surprised by the quality of sushi at Sushi Raw. This place has been on the corner of Taraval and 19th for as long as I can remember. With so many other sushi options around, I never thought to try out Sushi Raw. The other night the bf wanted a lighter meal for dinner, so he suggested Sushi Raw. Apparently he'd gone with a friend not too long ago, and it wasn't bad in terms of price and quality. \n\nWe came by on a Friday night around...9? It was late and way past a typical dinner time, but the place was pretty busy. We got seated at the bar right away and served up menus and tea. They have like 3 menus, and they're quite extensive. Nigiri, rolls, appetizers, udon (I think), donburi and some other Japanese dishes. \n\nWe ordered some nigiri (hamachi belly, hotate, tai and maguro) and two rolls (I don't remember exactly which two, but I think one was the tuna lover's). We also ordered 2 eel hand rolls and 1 spicy tuna hand roll from their special \"if you spend over $30, you get these items for $1-2\" menu (dine-in only). Our total was somewhere in the $45 range, which isn't bad for sushi.\n\nThe nigiri wasn't half bad! They give you pretty big slices of fish and the rice is passable. They do put some sauces on the nigiri and also put wasabi IN the nigiri, so that's another nice surprise. The quality of fish for the nigiri is decent for what you're paying, though I feel like the pieces of fish are a bit too big. That's just my preference -- It kind of makes me want to gag when it's just a huge piece of raw fish (especially if it's not the fresher fish out there). Rolls and nigiri came out quickly and presented nicely (I'm sorry for the overuse of \"nice\"). \n\nOverall service wasn't bad, though we never got our tea refilled (even after asking) and it took forever to wave down someone to get us the check =/\n\nDecent nigiri and good selection of rolls makes Sushi Raw a viable option for sushi. It wouldn't be my first choice, but at least it's on my radar now.", "author": "Doris K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-19", "description": "After Mission closed this is my go to place. Got a bento last Saturday I will definitely come back for my order to go :)", "author": "Erika E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "My to go to when I'm craving sushi!\nIt's good and never have to wait so long when ordering food.", "author": "Tania M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "One of our go-to places in the neighborhood. Sushi rolls are good and dinners too. Good portions and delivery is timely. Thumbs up!", "author": "Susan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-28", "description": "Our choices came down to 3 Japanese restaurants for delivery.  Sushiraw is a place we had never tried so we gave it a go.  The prices were average to high, but through the Yelp reviews, I gathered that they had a reputation for good taste and quality.  We ordered a variety of 8 sushi rolls, ranging from the lower priced California Roll to the pricier Dragon Roll and an order of Chicken Udon.  For a Tuesday evening, delivery was fairly quick (35-40 mins).  The sushi looked great and tasted very fresh.  It wasn't soggy or overly sauced, the rolls that had a crunchy element, such as the Salmon Skin Roll, were actually crunchy.  The only average item seemed to be the udon.  There was nothing special about it.  If you want really good sushi for delivery, I would highly recommend Sushiraw.  We will definitely be ordering from them again.", "author": "Mel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Aw shit, I just discovered this place around the corner from my house that's open late and has a pretty sizable vegetarian/vegan roll selection. They also deliver if you're nearby so call them instead of using Uber Eats or Postmates or whatever!", "author": "Danica N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-16", "description": "Service is the worst. Can't speak to the food bc it hasn't come yet. My husband has finished his meal already (bento box) while I'm still waiting for my roll (not even a baked roll).", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "I have been ordering take-out from this place once a week for the past month since I live just around the corner and always feel sushi is a suitable + healthy dinner when I don't feel like cooking (every Monday basically).\n\nLast night, I ate here in-house for the first time. Mainly because the place is a Poke-Gym and I was really down to battle while I waited for my food, but also because I didn't feel like I could accurately review this place unless I actually sat in the establishment and experienced all it's glory. \n\nThe food is good. Standard sushi for a standard price with delicious miso to match. I ordered the Taraval Street Roll ($9.25), which I think is delicious with tempura, mango and cilantro all working your tastebuds in perfect harmony. I also have tried the Philly Roll (standard) and the Dragon Roll (good, but not fantastic for $12.25). The food gets a thumbs up.\n\nHowever, the service was less-than-to-be-desired. Our waitress was brusque and all my food arrived about 10 minutes later than my friend's. I was hungry and even pokemon couldn't distract me from the long, unnecessary wait.\n\nNeedless to say, next time I will skip the dine-in experience and looking presentable, and just order take-out again where I can stay home and watch Netflix in peace.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-16", "description": "I use to love this place when Simon was the Owner .. since he sold the place it went down the hill . Rolls are huge and have tooo much rice . Selection of fish is simple and not what it use to be\nService also not the best at this point . Today was my last day eat there", "author": "Al S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "The prices are just okay but the food is nice. My friend really like the veggie rolls they had, while I enjoyed the larger portion of chicken and rice teriyaki. I will definitely come back to his place again, but there's other Asian food places on Taraval that I'll choose first.", "author": "Davey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-10", "description": "This is one of the best in town. Got some really cool combo discount deals. And the fish is really fresh. The sushi is good. The rolls are great. And it's relatively cheap. \n\nGreat meal with nice ambience. Also the service is on point. Never saw the bottom of my tea cup. \n\nDid I mention how good the food is.", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "Use to be my go to for my Japanese need..use to live close by and come here for dinner, the owner here is real helpful and give real good recommendations of what to get. I normally get the bento box, and I love everything on the menu. Sushi roll is good...my favorite is the Godzilla roll and the dragon roll.", "author": "Calvin T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Great goma ae (spinach salad) and veggie rolls. Wish their Tempura batter n miso soup were vegan friendly. Overall good service, comfy setting, but kinda pricey.", "author": "Nova J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "This is my favorite Japanese restaurant in San Francisco and I love that they have so many delicious vegetarians options. The place is nice and the service is amazing!", "author": "Priscila C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "This is definitely our go to spot. I'm from the neighborhood I stopped looking for other Japanese food delivery once I found this place years ago. They always deliver my order accurately and on time or early with few exceptions over the years and I can count on the quality. I like the ambiance of the restaurant and one of these days we'll actually go sit and eat there, but the speedy delivery makes it a no brainer. My favorite is the Taraval Street roll and Jalapeño roll. I also really like that they offer free items if you spend so much. It's hard to find a place that values its customers in such a way.", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-23", "description": "I love this place I really do !! The hours suck I went in 3 mins before they closed to eat and they said sorry we are closed why are your door open?? Sad to give this place these stars but that was not okay.", "author": "Karina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-22", "description": "Came here in the afternoon last Sunday (7/20) and the place was empty! There was literally only one table who arrived just before us and then later two more parties joined. \n\nMy friends decided to eat here because apparently one of them never had sushi before! We didn't know where else to go that was close by and I'm not too familiar with the restaurants in the area so we just ducked into the first sushi place we saw. \n\nWe ordered simple rolls - spicy tuna, a cali roll, a rock 'n roll, and a negi hama maki. They were very basic, not bad but not in any way extraordinary. At least the cali rolls were kinda big. \n\nBecause we had an older over $15, we added an unagi hand roll for $1 (special deal). \n\nThere were two waitresses working. Hard to tell them apart, but whoever was going to our table always had a displeased look on their face. \n\nSushi Raw might have potential, but that will need another visit before I can give them a higher rating.", "author": "Adrienne L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-21", "description": "We've been ordering takeout from here for years, but after a decline in the food and timeliness over the past year or so I think tonight was the last chance.. \n\nThe last order we made a couple weeks ago they hadn't updated their online ordering and so we got our bento boxes and the order was missing the \"free\" California roll as well as the sushi my receipt said each bento box came with, which has been the case for years. I guess they changed their menu without notifying the online ordering place, which we found out after we got the food. I would've been less irritated if they had remembered our \"free\" roll and hadn't taken over an hour to deliver the food. \n\nThis time we decided to try them one more time and we ordered rolls instead of the bento box we used to get that no longer comes with sushi. The food was alright, the order took over an hour and fifteen minutes to get here. Our one hot item was cold. I always pre-tip 20-25% too!\n\nSo after about a year of second chances I think we have to say bye to sushi raw and try someone new. Two stars instead of one because the sushi is ok.", "author": "Christina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Came here after work for a bite to eat and the ambiance of it was delightful. What a way to relax with fresh sashimi n sake being placed right in front with you.", "author": "Mikayla R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "My go to sushi in the sunset district. Casual ambiance, good sushi, pretty cheap. Four seasons roll is as delicious as it looks!", "author": "Raisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "First off, this place is conveniently open late until midnight, which is great because a lot of restaurants close early in the city.\n\nA pretty decent place to grab a late dinner. I usually go for their ramen- house special, beef, or tonkatsu are all pretty good- ranging from $9-$11. Not bad at all. I have yet to try their sushi though.\n\nAs for their service, they're really nice. They check up on you and ask how the food is, and they consistently refill your waters(which I love because I need lots of water while I eat). \n\nI love the ambiance here as well, somewhat of a dark setting and really clean and modern looking. Never too loud here either.\n\nGood tasting food, reasonably priced, and great service!", "author": "Janica V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-09", "description": "Satisfying a late-night sushi craving is not an easy feat. At Sushi Raw? A doable task. They're open until midnight on weekdays, which is pretty darn late for a sushi place! \n\nPleasant decor with dark wooden tables, hanging lantern style lights, and a mixture of booth, table, and sushi bar seating. The windows are tinted to help shield you from the bright car lights on 19th Ave. and maintain the dim lighting and warm ambiance of the restaurant. \n\nAll the rolls are very Americanized, on the larger side, and heavy on the rice. The fish didn't taste super fresh and I felt like the quality wasn't there. No clean and distinct flavors stood out to me. I found the Lion King Roll particularly disappointing because it didn't taste fully baked through or creamy like most other places. It only had cooked salmon on top. \n\nOur server wasn't pushy about getting us out of the restaurant even though we were there 15 mins past closing, but she wasn't exactly attentive with refilling our waters or punctual about asking if we wanted the check later either. \n\nPrices are pretty good and the rolls aren't bad, but if you're looking for authentic, fresh tasting sushi, this is not it. I personally don't mind paying more for higher quality sushi and won't be back here unless nothing else is open. Not a bad experience, but nothing was memorable.", "author": "Deanna Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Honestly, I'm really impressed with this place. Affordable and some of the best sushi I've ever eaten. The sashimi is super great quality and thick pieces.", "author": "Amanda C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-22", "description": "I used to only order take-out from here, and felt it was as good as any, and definitely reliable.  Only recently I started to go and dine-in.  Totally worth going inside!!  The service is a little spotty-- they are SUPER NICE-- but they will leave you alone at your table for over 10 min. at a time-- that said-- whenever flagged, they are quick to come ask!  \nI order something not on the menu.. but was suggested while dining-- it's called PokeMon salad ( a combo of poke and delicious crispy things)-- so fresh and delicious.\nThe 49ers roll, and Fuji Mtn. Lion King roll (something like that!) -- it comes table side with a flame beneath!  So cool.. \nOh-- only reason it's not 5 stars?  LOUD PLACE!!!!  get ready to NOT HEAR the person sitting across from you-- romance??  Not so much-- but GREAT SUSHI?? Yes!", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-08", "description": "While the service was great, the food was just average and definitely forgettable. The only thing I really recommend is the salmon kama. I probably won't be coming back.", "author": "Tran N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "This is currently my go to sushi place in the city. Prices are decent, but they offer a cheaper menu with every $15 dollar you spend (ex. $5 for 5 thick slices of salmon). I personally don't like the rolls as much and I would stay away from the lion king. It's not baked in an oven and doesn't even come out in foil so it doesn't taste the same as the other places I'm used to. The raw oysters are also always super tiny; on my recent trip I got one that was a size of a quarter. \nI do recommend ordering the sashimi and nigiri, they offer generous cuts and they're always fresh. Uni nigiri is priced at $8, unfortunately they don't pile on the uni, but it's enough to satisfy my cravings. \n\nAlthough the place is fairly small, there's usually barely any wait for two people even during the prime dinner time at 7pm. The servers are pretty attentive and the place kept clean. Definitely recommend trying this place!", "author": "Renee Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-26", "description": "This place is not as good as I expected. Was better when I had it years ago, I think it was a different name then maybe... I wanted to try them again so I decided to get some delivery one night. Anyway, I enjoyed the cooked rolls fine but I was not impressed with the raw fish sushi rolls that I ordered. I got a hamachi roll that was darker colored and fishy tasting. Also in the Philadelphia roll, the smoked salmon was pretty nasty (and I love lox). Also the walu on another roll that I had was not terribly fishy but not great, kind of mushy, no firmness to it. I ended up throwing these away. So ya, good cooked sushi but in the end of the day, you gotta have really quality raw fish to be a good sushi restaurant. Unfortunately, I didn't get that on the night I ordered delivery.", "author": "David S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-12", "description": "I love how they give free food when you've spent a certain amount on top of free deliveries!\n\nI also love the deals they give you when you get sushi, which they design creatively. It's a great sushi place with great deals. One of my all time favorites!", "author": "Nichole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "My cousin and I got there a little bit before 10 and there was a decent amount of parking around restaurant. The service was nice, our server was easy to talk to and made sure we're okay. We got 4 different rolls, the niagara roll, lobster roll, deep fried California roll, and shrimp tempura roll. It did not taste bad, it was actually good. We really liked the lobster roll especially. We also got the beef tongue which was also good but we thought it was too over priced for one skewer, although we still ordered it because we were craving it. \n\nI like how they're open late for those who are looking for a place to dine in. The workers were nice and very creative when it comes time to plating their sushi, mostly the special sushi's. I wouldn't mind coming back with some friends to enjoy their food.", "author": "Ina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "This is my favorite sushi place. I always get the hot summer roll or the four seasons roll. Both are very good. Also the garlic edamame is delicious. The wait staff are very nice and the wait is not often long (for food or for a table).", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "this place has a nice ambiance to it and the food comes out pretty fast. i enjoyed eating here but the only thing is their ramen was suuuper salty. i had to add a bunch of water secretly.", "author": "Carla E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "My friend and i came here after work around 10pm on a week night. It wasn't busy at all. We ordered the four seasons roll, philly roll, and fresh oysters. the fresh oysters were madddd tiny! i don't think they're worth the price, $2 each. but they were good i guess. My favorite was the four seasons roll. it was delicious! \n\none thing i would like to note though is that you can only order ONE item off of the special dine in menu, which you can order off of when you spend $15 or more. to order a second item your bill must be over $30. I didn't know that, so i wish they would have put that on that menu. \n\noverall i would come back. sashimi and rolls are very good and very reasonably priced.", "author": "Maggie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-22", "description": "I've been wanting to come to this place for awhile now since I pass by it from time to time, and I also thought this place was 24hrs but it's actually open until midnight. \n\nFrom the street view, the outside makes the restaurant look like it's going to be big, but it's actually a bit small on the inside, spacious, but small. The interior is all black with spots of wood, which was nice because it gives an intimate feel. I really liked the soy sauce container that they had because it wasn't something tacky like another kikkoman glass and also the little dish that held the soy sauce was cute (it's all about the details, loved!) \n\nWe ordered their large sake and a large sapporo so we can do sake bombs, wasn't a big fan of the shot glasses that they provided but we worked with it anyways. We also ordered their 49er roll, lion king roll, rock n' roll,plum roll and their chicken teriyaki roll. \nLion king roll & rock n' roll: always good. \nPlum roll: presentation was pretty and tasted delicious. \nChicken teriyaki roll: the chicken itself was flavorful, not dry, and crispy from the skin: delicious! \nPrices for their sushi are typical, $5-14(?) of course their special rolls are $10+ but I think they were worth it.\n\nService: nice, speedy and filled our waters constantly which is a BIG plus for me. \n\nI will definitely be coming back here. :)", "author": "Grace Anne D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "Teriyaki chicken was gross don't get it. More like slimy chicken skin with teriyaki barley glazed on it for $7!", "author": "Julia P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-23", "description": "** PLEASE NOTE  --  this is a review of the customer service we experienced.\n\nI have never experienced such terrible and disrespectful attitude coming from a wait staff in my life, and I do not mean this to be an exaggeration.\n\nMy family and I had not dined here in over a year and we have always had a positive experience (read my 4 previous reviews). Upon arrival, our normal waitress who had always been there was not present; and the chefs we knew who worked behind the sushi bar were also missing. That's alright, restaurants have high turnover rates.\n\nAt some point during the meal, my father asked the waiter whether there is any yakisoba type noodle dish on the menu. We've been coming here on-and-off for 2 years and I knew the answer to that question was more than likely going to be no; but hey, there is no harm in asking right? What if the menu was changed? The waiter rolled his eyes, said a curt \"no\", and walked away. I thought that was going to be the end of it. My glance followed the waiter and this is what I witnessed next. He walked over to the other waitress on the floor, shot a sideway glance towards my father, scoffed, and said in Cantonese: \"what an ignorant man\" at a volume loud enough for me - which means also for my father, mother, Boyfriend, and the next table - to hear.\n\nI have scoffed and mocked people n my life so I am not trying to come off as holier-than-thou. However, I have never ever done it in public and I definitely have never done it while I was working or in a professional environment. And regardless, my father did nothing to deserve this blatant display of disrespect; he asked a very simple question that any Joe Schmoe could just as easily have asked in that situation. So let me ask, mr. waiter, what about my father's question irritated you so much so that you had to react this way? And mr. waiter, even though I don't work in the food industry, let me offer you a piece of advice, the next time you feel the need to disrespect a person who pays your salary and your tip (20% in this case), don't.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-13", "description": "Funnily, we went here unintentionally. After the 2013 Color Run, our party of 5 was craving something light for lunch (or so we thought). We had planned on dining at Sushi Zen, but our hunger got the best of us--the more convenient, eye-catching Sushi Raw got our business.\n\nDespite the affordable lunch specials, we decided to go family style with 4 rolls and some Big Discount items (described below).\n\nWe first chose the ISLAND ROLL with tuna, salmon, and yellow tail wrapped with cucumber, 6 pieces for $12.99 (http://s3-media3.ak.yelpcdn.com/bphoto/VoBBC_Z9yH2uIaZQhzsexQ/l.jpg). The combination was refreshing, although the cucumber was not that crisp and the fish were not markedly fresh. Since this is a light roll, eat this first because its flavor can be easily overpowered!\n\nNext was the FOUR SEASONS ROLL with eel, imitation crab, and avocado topped with tuna and avocado, 8 pieces for $12.99 (http://s3-media4.ak.yelpcdn.com/bphoto/d71TaWul4vjL-oIbw2uc3w/l.jpg). This was my favorite by far...EXCEPT FOR THE WASABI SAUCE. AUGH. They drizzle it on top with the other sauces, but because I have an aversion to wasabi, it totally killed my palate :(\n\nThird was the TARAVAL STREET ROLL with eel, shrimp tempura, imitation crab meat, cilantro, and mango, topped with tobiko, 6 pieces for $8.99 (http://s3-media2.ak.yelpcdn.com/bphoto/5fGG2OQ6tgVzHbvU6WNoiQ/l.jpg). This is a good, reliable roll, though the mango is not very noticeable. Gotta love that shrimp tempura though!\n\nLast was the HOT SUMMER ROLL with spicy tuna topped with crab meat, salmon, and baked with spicy sauce and tobiko, 8 pieces for $12.99 (http://s3-media3.ak.yelpcdn.com/bphoto/chB1j_Q8rzFnGwu7a_iVxA/l.jpg). The stringy red things on top were very interesting texture-wise, but the crab meat and spicy tuna overpowered the subtlety of the salmon.\n\nFor every $15 ordered off the regular menu, you get the option to choose an item off the Big Discount menu (borrowing Jessica C's picture: http://www.yelp.com/biz_photos/sushi-raw-san-francisco-3?select=GbuCLrQRKTIfUm9ue_ZgzQ#93Snh8xG0eUMkiLS4qRc9w). Since we had ordered over $45, we chose 3 items: UNAGI HAND ROLL for $1 (http://s3-media1.ak.yelpcdn.com/bphoto/MzsP_bAr1K-0v-IZyN005g/l.jpg), SPICY TUNA HAND ROLL for $1 (http://s3-media2.ak.yelpcdn.com/bphoto/OEtkgaDNi7yYFJ8muZH78g/l.jpg), and SEAWEED SALAD for $2, normally $4.99. The spicy tuna was fantastic.\n\nOur total bill was $52, which came out to $13 per person. After a morning of colorrific running that cost each of us $50, having a decent lunch at less than a third of that price was pretty good. The rolls aren't mind-blowing, but I would recommend the TARAVAL STREET ROLL, $8.99, and the FOUR SEASONS ROLL, $12.99, as long as you don't mind the overpowering wasabi sauce (or ask for it on the side).", "author": "Adele F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Awesome sushi! Sashimi and rolls are well priced. Come here time to time with my family. Take out ready really fast and efficient.", "author": "Sherali Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "The sushi and udon was OK, but I give this place a higher rating for being open until midnight on a Saturday night. That's hard to find in SF.", "author": "Flora B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Came in on a Tuesday night around 10pm,not crowded,but got full once we got seated. Sashimi was great,but it just took TOO long to get our food. \nNot a lot of sushi spots are open late,so this place was convenient for me.\nParking was easy since it was late, I would still come back here to get my sushi fix!", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-10", "description": "This place rocks! The service is great, they are very attentive and nice. The food is awesome! The rolls are tasty and made to perfection and the ingredients taste fresh. Highly recommend this one!", "author": "Iara O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "We were coming here about once a week. Initially, we were impressed with the attentive and friendly service, tastiness of the entrees and the good value.  Unfortunately, the restaurant has gone downhill until the final straw when we felt they no longer valued our business and walked out of the restaurant (more about that later).  As stated, our initial experiences were very positive.  Portions were generous and the service was attentive and friendly.  However, we slowly noticed a deterioration of the service, friendliness and the food.  For example, when we ordered the tonkatsu bento, we would receive two cutlets.  But more recently, it has been reduced to a single cutlet.  Although probably  better for us in the long run, we felt that we were treated inconsistently.  The final straw was when we (party of 4) arrived around 6 pm on a Friday evening.  There were 3 people in the whole restaurant but they tried to seat us by the front door next to a table with a young baby.  I wanted to avoid the draft coming in the front door whenever people entered and didn't want to sit that close to a young baby and asked if we could sit at one of the open tables by the window.  The waitress said they could not do that because they would not be able to split the tables IF 2 groups of 2 came in.  There was no reservations, but they were planning for the possible contingency.  Ok, we are not ones to linger - we eat and run.  Yet, they would rather have us leave than to try to accommodate us.  No apology or anything.  This was surprising given that we have been visiting every week.  In view of their attitude, we will accommodate them and won't be back.", "author": "Will L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Stopped in late on a Sunday night around 10:30. The place was nearly empty. The boyfriend and I took our seats at the bar area. \n\nWe were greeted immediately and offered warm tea, which we accepted happily on this chilly San Francisco night. But we were both disappointed that the \"hot tea\" was more like Lukewarm (and that's being generous..). It tasted great, but could have really used some heat.\n\nLooking over the menu there are so many options, we settled on a special that came with California Sushi Roll, Sashimi, Miso and Salad. \n\nThe Miso and Salad came to us very quickly. Soup was tastey but nothing unusual. The salad however was a little disappointing. The lettuce was either old or had been frozen, the leaves were basically translucent and limp. The dressing did taste good, peanut-y but the lettuce just ruined it for us.\n\nCalifornia Roll was well put together, slightly over-sized, but smaller then others I've had. I prefer the smaller size as they fit better into the mouth.\n\nSashimi was fresh and beautiful, just as it should be. Cut wonderfully and laid over slightly sweet sticky rice it was a beautiful addition to the meal. All the fish had a soft texture, some event buttery. Each carried their own unique flavor and needed little to no soy sauce.\n\nThis is a nice little spot for late-night sushi and I would happily return.", "author": "Meghan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-13", "description": "Yay for the food!  Boo at the service.  I don't know why it was so slow, but for some reason it was.  It wasn't crazy busy, but my food took longer compared to the rest of my party.  I had ordered sushi whereas most of the table had ordered ramen.  However, some still had rolls too.  Anyways, the service is pretty meh, but I really enjoyed the food.  They had a really good special that offered cheaper items for every $15 you spent as a party.  There were some great deals like $1 handrolls, $2 beers, or $5 sashimi.  I had the Double Hamachi maki as my main.  It was really good combining fried and seared hamachi.  Really nice combo.  My only complaint was how small the filling inside the roll was.  It was pretty much a pen-size in filling.  But the top still had some fish on it, and it was sure tasty.  The handrolls were pretty good too, I liked their spicy tuna hand roll, and the unagi was not bad too.  Overall, I wouldn't mind coming back, the sushi was pretty good compared to similar Japanese restaurants I've had in SF.", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-19", "description": "best sushi place I have been to on Taraval for sure. The place is really nice inside and could almost be a high end restaurant. The only weird thing is the music they play is Dream and it is on repeat. I have been coming here for almost a year now and not once have they played something else. I kind of wonder why that is.", "author": "Tanya S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-01", "description": "I've been here many times now because it's close to my house and it's open kind of late. Overall, this place is just alright.\n\nI like to get the chicken teriyaki bento because the chicken still comes with the skin on it. My favorite roll here (and almost every sushi restaurant) is the Romeo & Juliet roll. It's salmon, avocado, and soy paper rolled with rice and topped with scallop. I usually skip the soy paper and ask them to use seaweed.\n\nI like this place only because it's pretty cheap. The sushi is not super fresh or anything, but worth the price. And If you dine in, for every $15 you spend, you can get special deals like $1 hand rolls or $1 oysters.", "author": "Derek T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "The food here is definelty fresh and awesome. \n\nI have got the daily special live amebi (the shrimp) and I have an allergic reaction on crustaceans and this place actually have fresh ones and it's delicious. I also got the live clam and it was soft and the texture just melted in my mouth. \n\nThe service was great also very friendly and very welcoming when u get it. The atmosphere is more than a casual feel and its a great place for a dinner date out.", "author": "Edward T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "High quality sushi, good service. And always check specials!", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-17", "description": "I love going here. I took my GF here for her birthday a year ago and we have kept coming back at least once a month ever since. Great food and prices and a nice set-up to dine at", "author": "James W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "Tried ordering take-out, ordered online only to get a call 15 min later that they can't deliver. Highly disappointing. \n\nI have eaten here before and thought the ramen was good.", "author": "Angelito R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "Very nice sushi restaurant. Great service, execution and ambience. Fresh and reasonably priced", "author": "Vlad K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-21", "description": "The restaurant is nice, quiet and clean. Service was good, probably because we were the only one dinning in. It seems like a take out restaurant since most people we saw coming in were doing take outs. \n\nFor some reason I wasn't a big fan of their food. It seems kind of bland too me and water down in a way. Not flavorful enough. Even the wasabi I had to eat a lot to get the flavor when generally a little bit can last me through the whole meal. \n\nIt's not a bad restaurant to go from time to time but most definitely not a must go.", "author": "Sury C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "This is by far one of my favorite sushi spots in the area! Their walnut prawn shrimp roll is to die for. If you like walnut shrimp this roll will be your favorite. The place is cozy and friendly. I spend a lot of time around this area so it's great to have my favorite sushi place near by.", "author": "Erika S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "I m not living in the neighborhood but is absolutely my favorite sushi restaurant in town, I'm going there twice a month, always setting at the bar and asking to the chef to make something for me! Nice and friendly service, great food, small place as I like.", "author": "Davide T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "This place is pretty good. I really enjoyed the Mexican roll. While the fish is pretty good, my spicy tuna in the spicy tuna roll was so fishy I couldn't eat it. Bummer!", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "We get this place almost weekly and it's delicious! All their sushi is good and their ramen is killer.", "author": "Mariah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-04", "description": "Service was quite nice. We ordered the amaebi, bento box with short ribs and 3 pieces of nigiri, lobster roll wrapped in cucumber, and the assorted sashimi 9 piece. In addition, we purchased 6 oysters for 2$ each order. Next time we will stick to the raw sashimi and rolls. Bento box was mediocre. \n\nTotal cost was $64. Reasonable price.", "author": "Jensine D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-21", "description": "Good but definitely not the best. Since they are open late, it's a good spot to get your late night sushi cravings satisfied. \n\nMy cousin, sister and I ordered crunch California roll, hot summer roll, and four seasons roll. We also ordered the Fuji mountain roll, which came out with fire. Really amazing and quite unique! All of the sushi are pretty good but nothing spectacular. As a matter of fact, all of them are pricey and come in small portion. We also ordered spicy tuna hand roll and sashimi. They're only 1$ for every 15$ order so might as well.\n \nCustomer service was mediocre. There were two waitresses. One was very attentive. She refills our water and asks us often if we need anything while the other one is rude af. She took our soy sauce and gave it to other table. she also took our plates away without even asking if we're done. No smile,excuse,thank you, nothing. She seems miserable. \n\nI'll probably come back BUT only if I don't have any other choice to satisfy my sushi cravings. Otherwise, i would rather be in other sushi spots!", "author": "Mary U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "*review is specifically on the sushi, will mention about the service but it does not affect my star rating. \n\nThis place is actually not that bad, it's actually better than the Excelsior location. I am extremely picky with my sushi, and this place is definitely a place i am willing to go back when i'm having my sushi cravings while on a budget. \n\nI just came back from Japan and was having some sushi withdrawal symptoms, so I had to get some sushi. I had some nigiri's and the oyster and shockingly it tasted fine. Didn't smell or taste fishy at all. \n\nordered nigiri's: \nHotate\nIkura\nUni\nSalmon\nWalu\n \nand they turned out not bad, I wasn't disappointed. And again, the oysters were not bad all. \n\nother orders:\nseaweed salad (nothing special)\nsoft shell crab (again, nothing special)\ngyutan skewers (not bad, flavorful but a little tough for my taste)\ngreen tea cheese cake (i think it's frozen cheesecake)\n\n\nThe service here is okay, a little sloppy \nie.\n- server was confusing on explaining the menu (there's this menu where certain items becomes $1-$2 if you order a certain amount), food and drink menu. \n- server seemed to lack knowledge of the liquor selection. \n- attentiveness was BAD (had to ask for water so many times)\n- they kept forgetting our order when it was not that busy at all (the server even had the time to check her phone)\n\n\nOver all this place is really not bad, and the great part is they open late. \nI definitely recommend this place if you want sushi on a budget, will definitely come back here again.", "author": "Toni Rose M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "My go to sushi place since it's near and it opens late. I always get shrimp tempura roll and the lion king roll. I also like how they have their $1 specials if you spend $15 or more. I'm only knocking down one star because the service can sometimes be bad.", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Good experience with late night sushi! Had the mango tango roll and miso. Tasted fresh and friendly service. What more do you need? Right in the corner of 19th and Taraval. Walked from a friend's house, so very easy. Might be a bit harder to find parking.", "author": "Kandis P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "Sushi and service was just OK! \n\nPros:\nNice décor and ambience\nFriendly waitresses\nWide variety of menu items\nSpecial items less than $5 for every $15 spent\nFood comes out quick\nPresentable rolls\nDecent portions and prices\nOpen until midnight every night\n\nCons:\nDifficult parking\nService slightly slow\nFood is mediocre\nForgot our $2 oysters\nHad to ask 3 times for water with lemon -then finally got it but without the lemon!\n\nMeh, I'd come back if I was only around the area!", "author": "Theresa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "When we have dined in we've always had Excellent service. Very attentive and quick. My partner and I have only ordered speciality rolls so unsure about the rest of menu, but always delicious, nice presentation, and fresh.", "author": "Hilari V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-31", "description": "Maybe I've just been spoiled by Yuki Sushi in Willow Glen, but I was just not impressed. I suppose for the price maybe it's worth it. \n\nMy negihama roll had not one but two fish bones in it, and tasted so fishy. I never use wasabi and I had to in order to even consider eating it (and I gave up after bone #2).\n\nThe spicy tuna was mushy and I'm not sure if I'm imagining it but the rice was super salty. \n\nI got halfway through my food, got nauseous and gave up. :( I'm really sad, this place is super close to my new house and I thought it had potential.", "author": "Becky H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "My favorite sushi spot in sunset district! \nLove the rock and roll eel rolls and fried avacado rolls! \n\nGreat bento box deals and add a beer for 2$ when your bill is over 15$!\n\nUsually do pick up, always fast and on time", "author": "Hunter H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-31", "description": "So I have been wanting to update this. When I wrote the last review my friend didn't tell me how she felt until after I posted this. She hated it. My roll was alright. Not the best but I liked it. Hers though, they took it back when she realized they had drizzled wasabi or something. They fixed it and brought it back real quick. What upset my friend was that they just put straight up mayonnaise as a replacement drizzle all over the roll. MAYONNAISE. She was grossed out and I told her about the scene in the movie Undercover Brother and the mayonnaise sandwich. She said that's how she felt with that roll. lol. Never going back. Not risking it.", "author": "Ruby S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "My mom and I love this place! The staff here is so great and accommodating to all of our needs. I actually don't eat raw fish and love their ramen and udon soups. However, my mom loves their Chef Special sashimi and has never once gotten sick. The chef is so sweet and always knows what fish to cut for her (she's super picky). \n\nIf you come here, get their garden salad. The dressing is so good! Also, they have a \"spend $15 and your large hot sake is $2\" deal.  I mean... AMAZING! There are other spend $15 and get something cheaper deals on the menu but the sake one is the best. \n\nAll in all, great place. Great vibe, service and food! Oh, they deliver if you're feeling a little lazy.", "author": "Anastasia N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-17", "description": "This place tastes very good, friendly staff, nice atmosphere, but after returning to my car, than returning to the Sushi Raw bathroom to take care of some Sushi Raw aftermath, I saw the SUSHI CHEF not wash his hands after coming out of the bathroom. Pretty impressive. I left from here and started driving to Santa Cruz. About 30 minutes along the way I felt a rumbling in my stomach that got exponentially excruciating. It was a close call, but I made it to Santa Cruz. Three stars.", "author": "Dylan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-18", "description": "This was some of the worst sushi i've ever had.. It didn't give me food poisoning, so it's getting a star for that, but that's about it. The best part of the meal was the miso soup... The rest was barely edible, and even though mine was the first delivery order (or close to it) of the evening, the food tasted like it was been prepared days ago. Everything was dry, lumpy and did not taste fresh.. From the sushi menu - toro and Albacore Belly were inedible. Salmon and yellowtail were alright. Salmon Lovers roll and fire dragon roll were barely edible.", "author": "Adelie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "Lunch time came around and I was craving some sushi. \n\nWhile it looks like they deliver if you're calling BEFORE 5:00pm you are out of luck. Delivery doesn't happen during lunch.\n\nI ended up going anyway because...bento box.\n\nI like the prices & the special dine in offers that they give. To my knowledge they've been doing it for a while now & I'm glad they do. It's a great incentive and shows customers that their patronage is appreciated. \n\nI got the Teriyaki Chicken bento box. Described on their website and on their menu: Chicken Teriyaki $10.99\nChicken broiled and basted with teriyaki sauce. Served with green salad, miso soup, tempura, and three pieces of sushi.\n\nPros: \n-The meal was served it on a platter with 4 compartments, not the traditional \"box\". I get it...it's a bento box. I get what I asked for. The platter however just made it more enjoyable. None of my food was hiding in the shadows. I like when it's displayed and yelling \"EAT ME FIRST!\"\n-We were seated immediately (duh...always a pro).\n-The food came quickly.\n-They didn't make a big deal about splitting the check.\n\nCons:\n-No salad like the description said.\n-My chicken was dry...then drenched in teriyaki sauce that was more on the watery side.\n-One server for the entire space...get the girl some help.\n\nI'll be back!", "author": "Tam T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "Arrived today around 9pm. About 5-6 tables available so my friend and i sat down right away. 15 minuted later we signal one of the waitress since no one ever came to our table. Then received  menus and waters. Another 15-20 go by and we signal another waitress and ask if we can order our food. I ordered summer roll and my friend ordered a bento boxSo we another 20+ minutes then my friends bento box arrives. Then im not sure how much more time goes by but my friend ended up finishing her meal. I called over a waitress and ask how much longer for my order and she stated she was going to check. 15 minutes later i receive my roll. Im sure she forgot to put in my order. Food was great, service was bad. I dont think ive ever called over a waitress/waiter that many times.", "author": "Avelyn A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-27", "description": "Came here one night since its conveniently located right on the big 19th avenue. I've seen this place many times, and packed too, so foodie buddy and I decided to give it a try. My friend has been here quite a few times, but certainly not his favorite place. Lots of bars are conveniently located around the corner so I noticed alot of customers were from that too. \n\nWe ordered the tempura udon each, and a sushi roll. they do have this cheaper secret menu that you can order from once you order a certain amount of money for food, so we got the sake. \n\nTempura udon: Super plain broth, just simply noodle and soup, they didnt even give us two slices of fish cakes like what other places do. The tempura came on the side with its dipping sauce...again, nothing special. I've had better. \n\nSushi roll: plain as well. Very mediocre, heavy on the rice. I wasn't pleased, so I didn't order any other sushi rolls. \n\nOverall, very ordinary place, service is slow. I wasn't very content with the food, and given if I'm in San Francisco, I would just go elsewhere for better food. The decor is really nice inside, but I think this is an Americanized Japanese Restaurant.", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "I came in here last week with my roommate and our 2 friends. First and foremost the service we got was AMAZING. Our water was never less than half full, we had a server's full attention at a glance, we were given descriptive and enticing recommendations by several of the staff... \n\nThe food was excellent; I had the spicy tuna roll and the crunch roll as well as some Nigori sake. The sake was served chilled and was the perfect temperature and the rolls were above and beyond my expectations. \n\nIt was my first time coming here and I'm very excited to say that it has become one of my favorite sushi spots in the city. I'm already planning a second trip!", "author": "Jacob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-30", "description": "Have been coming here for years.\nThe prices are amazing, for every $15 spent you can get a large beer, hot sake or sashimi for $2.\nEvery time we go we get so much food and drink, the bill is at least 25% cheaper than any other sushi restaurant.\nThe food is great, always bring friends who  want to return.\nThe staff is very friendly the decor is nice as well.", "author": "diane d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-14", "description": "Came here on a random Saturday afternoon for lunch. This place is hard to find parking here since it's on 19th and Taraval. I guess we came here for a late lunch (1pm almost 2) so the place wasn't so crowded. Gotta love how quiet the restaurant is despite the fact that it's at the intersection of two busy streets in the Sunset.\n\nOrdered a variety of nigiri:  otoro, uni, aji, sake, waru, hotate, hamachi, and ika; also ordered two oysters for $2 from their HH menu. The oysters wasn't anything special, I believe it was the miyagi oysters from the look of the size. For such cheap pricing, I'm very happy to not find any sand in them. Bravo on the prep. Their sushi was average, with some tasting fresh and some are so-so. Their otoro that day was on point, the fattiness just melts in my mouth instantly.  Uni and sake were fresh too, no weird after taste, the colors were bright and welcoming. Maybe a bit too welcoming, I feel like I enjoyed them a bit too quickly. The others were just so-so for the quality. I've only been here once, so I can't really tell you how consistent are their sushi.\n\nOverall, the pricing isn't that bad. Certain items are going to be market price like otoro, otherwise the nigiri are priced around $5-7 per two pieces. Not a bad price for what they serve.  Service is a bit slow, maybe the cashier area is too far from where we were seated. All in all, not bad, not bad at all.", "author": "Connie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Great Place,good pricing.\nSpicy Raw Tuna dish,and Hamachi Kama ere great. \nNot too crowded.\nWill recommend them.", "author": "Katy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "We were seated right away when we got there at 7pm. Customer Service was top notch because whatever we need they would bring it to us immediately. I loved their whole squid it was so juicy and chewy. Everything was really fresh, my personal favorite was their volcano roll and four seasons roll. I would definitely come back next time when I'm in the neighborhood.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "I met a few friends here a few weekends ago. The service was amazing. We had a group of 10 and everything we ordered came out quickly and without error. \n\nI always order the same thing: chirashi bowl and seaweed salad with unagi. The chirashi bowl was surprisingly full and even a few dollars cheaper than other sushi restaurants in SF.\n\nMy friend ordered the Dynamite roll and it was absolutely amazing, presentation and taste. \n\nI would definitely recommend this place if you're looking for a good sushi place that's great for groups and excellent service.", "author": "Leona G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "I don't know why there are so many bad reviews for this place. The staff is super friendly, it's cute inside and the food is yummy!\n\nThe staff always checks on you and you get your food fast. We love going here!:)", "author": "Em O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "The food is alot better.. service is better...  and it coo they are open late  for them late night cravings !..", "author": "jeannette L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-03", "description": "Came in today with my friend. We sat down, looked through the menu and the male waiter that was taking our order was really rude. He did not look too happy doing his job. We asked him a couple questions regarding the menu prices, (market price)and he replied with such rude attitude.\n\nWe ordered spicy tuna roll, hot summer roll, double hamachi roll, 8 raw oysters, uni and couple other sides. The food was great, except I wish the uni tasted more fresh, that being said they do have specials. I'm not sure what day they serve the live uni, but it's to DIE FOR! It literally melts in your mouth! \n\nI may come back if I'm in need of some quick sushi. Other than that probably not. Our sever today (male, tall asian) was really rude, disrespectful. Unfortunately, BAD SERVICE.", "author": "Lena .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "Giving this place 4 stars because of the amazing food! Their fish is one of the freshest  fish I've ever had. Ordered the tiger roll and the salmon lover's roll. If your table buys at least 15$ worth of food you can choose to buy from a special menu that has some sweet deals. We added the 5 pieces of sake sashimi for 5$. The pieces were so fat and they melted in your mouth! The other rolls we got were also yummy. Service is kinda slow and our food took some time to come out but the staff is nice. I also liked the atmosphere. Lots of comfy seating and decorated very modern. Didn't have to wait to grab a seat. Would come here again.", "author": "Sami T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Love this place! Great service!\nThe chefs assortment on the sushi boat was amazing!!!", "author": "Julio S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-29", "description": "We three had the orders: house special ramen, Fuji roll, four season rolls, hand rolls, and fried chicken and tofu. I have to say it was the worst I have had in SF. No taste for all food, the roll is loosen and the fish and vege are not fresh. And there is no flavor of the ramen, how can it be called special!!!! We won't go there again:(", "author": "Zhi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-26", "description": "I love coming here. I was really sad to see the one in San Bruno go.\n\nThe fish is always fresh, their menu changed and has way more options. Their ramen and broth is delicious as well. I don't think I have ever had a bad experience with them. This particular location is open late. I believe until midnight. Staff is friendly and prices are great. Always a fan of Sushi Raw!", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-09", "description": "The service is mediocre to none. Like everyone said the menus are thrown at you without a greet. My server didn't know what to suggest on the menu and recommend me \"everything\". \nThe restaurant it self is clean and neat. But it take forever for your rolls to come out. \nAll in all, I came to this place because it opened late, if you aren't dying to have sushi at 11pm go somewhere else and save you money.", "author": "Jimmy P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-26", "description": "I just ordered delivery through EAT24 and specifically wrote to NOT ring the doorbell and to call my cell instead. The driver rang the doorbell. For various reasons, many people cannot have the doorbell be rung sometimes....sleeping baby, sleeping elderly person, dog that goes crazy, many reasons.... this was not cool.\n\nUpdate: Placing another order from them. This time, I'm not gonna ask them to call my number since everyone's awake. I will admit their food is good.\n\nUpdate #2: Maybe it was a mistake to order from them. 1 hour and 20 minutes in, and my delivery order is still not here. How much longer is it gonna take? For reference, I live 1.0 miles away. Ok, it took 1 hour and 30 minutes for the food to arrive on a Tuesday evening and I had to microwave the hot food because it was no longer hot.\n\nUpdate #3: I placed another order on a Thursday evening. I forgot about how long the last order took, until right after I pressed the submit order button. To my pleasant surprise, my order arrived in 20 minutes this time! Food was still hot. Yay.", "author": "Wendy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-05", "description": "SOOOO GOOOD. My friends took me here for my birthday and it was amazing! Every roll we ordered was great!!!! It's quaint and clean. My favorite was the lover's roll ( i wish I ordered two) and we ordered a roll that we wanted jalapenos added to it and they grilled them! GENIUS! My new favorite sushi spot!", "author": "Ashley O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "Classic menu with great presentation  and very comfortable surroundings.", "author": "Bruce B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-03", "description": "Updated review, after continuing to eat in and get delivery I still adore Sushi Raw!!  \n\nGreat fish every time, the chicken udon noodle soup is now my favorite and I crave it!\n\nThe delivery is consistently on time and even arrives earlier sometimes than the estimate!", "author": "Ali S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "Ive ordered from this place for a while a let a few things go, but my most recent experience really just set me off to advise other people to never visit this place.\n\nI consider myself a loyal and valued customer, who unfortunately is allergic to a few things that seem to be prevalent in sushi.\n\nI have ordered my rolls multiple times with no tobiko and no avocado(that im seriously) allergic to, and every time they have messed up wheat i requested. This would be understandable if i was ordering over the phone and there was room for misinterpretation, but over the internet via plain text, is simply unacceptable. To top this off, when we called to confirm that the got our order via phone, they were plain rude over the phone and started to insult our intelligence when began attempting to confirm what we ordered.  As an employee of a restaurant, I would actually appreciate someone calling to confirm a special order, but this establishment takes it as an insult and is rude to its customers, and then intentionally messed up the special order. \n\nLong story short, I used to come to this place very often, given its great reviews, but recently have taken my business elsewhere due to their vast lack of professionalism and respect for their customers.  As a repeated paying customer I deserver more thjan to be cussed at over the phone and called \"stupid\" for not \"knowing the difference between cucumber and avocado\". \n\nAccording to Sushi Raw, I \"don't know the difference between soft cucumber and avocado\".  If you're avocado and cucumber are interchangeable, then we definitly will not be returning.\n\nWe left Ninki due to bad service, but at least they respected our allergies.  Back to Nink iwe go.", "author": "Stephen W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-10", "description": "Bad experience here, service was terrible, workers seemed unhappy. Didn't understand as it wasn't that busy.\n\nHad Chicken Teriyaki and Tempura - Chicken was dry and tempura was soggy. Miso soup was too salty.", "author": "Kathryn Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "The Golden Scallop roll was absolutely delicious, and great for those who don't like avocado on their rolls.", "author": "Madeline R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Sushi was fresh and tasted fantastic. The chef takes his time making everyone, which is just fine. Every thing we ordered was awesome.", "author": "Paul R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "This place is pretty good. My friends and I attend SFSU so this place is close by Muni. The food is decently priced and good. Also, if you spend more than $20 you get a free California roll. I would recommend this place to a friend.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Another Grubhub find for myself and it takes a lot to order sushi to go and they get it right.  I am a vegetarian and they have some great rolls and really good sushi salad. The order is always before the scheduled time and has never been late. \n\ngood find for myself.", "author": "Debey G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-28", "description": "I'm going to start off by saying service is so CRAPPY. And that's being nice. \n\nWent here over the summer with a friend of mine. Dinner time just started so there were probably 2 other parties with us. I ordered miso soup and a roll while he ordered two rolls. Both of his came out first before I even got my soup. Uhm. Really? Soup is supposed to be the first thing that comes out. Anyway, I wait. Thinking it'll come out soon. I keep sitting there and the waitresses are just chatting with each other so I ask one of them for my soup and I said I also ordered a roll.\n\nShe said she would bring the soup out and did so, but 20 mins later the roll NEVER CAME. I got fed up and didn't want to wait any longer even after I reminded them so we paid the bill and left a dollar tip, which was more than they deserved.\n\nHow the hell do you completely forget someone's order? Your restaurant was not even busy. Reevaluate your customer service. Never again will I eat here.", "author": "Cathy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-27", "description": "Great for delivery! Always quick! Usually comes in half the time grubhub gives you. Order is always correct and everything is awesome! We love their deep fried rolls - both the eclipse roll and the Devils mountain are great. Fresh ingredients. Great costumer service - friendly delivery people. My boyfriend loves the miso soup.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-06", "description": "delivered within window surprisingly good for delivery, let alone sushi. Nice work!", "author": "Gwen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-11", "description": "Was walking by this place and was starving so we ate in, forgetting my previous experience with them. I have to say, the sushi tasted much better in the restaurant! Maybe they send out old stuff or don't care about delivery? They had a deal for albacore sashimi and the pieces were huge and fresh. The gyoza was cooked perfectly. Someone at our table ordered the chicken katsu/teriyaki chicken and was later sick - not sure if it can be attributed to that though, but thought it was worth mentioning. \n\nThe restaurant itself was clean, as was the bathroom which I always use as an indicator. \n\nAnyway, I'd go back here to eat in.", "author": "Emma M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "I was very impressed w the rolls & the presentation was great! We had about 7 or 8 rolls and they were all amazing.. One after another.. The four seasons roll was off the hook! .. The hot summer roll too. \n\nI like my rolls big, fresh, and meaty.. \n\nAtmosphere: trendy, chill, quiet, modern. The place is well put together. \n\nService: the waitress was very knowledgable of the menu and was great at helping us pick put some things we'd like. ... One thing I found odd was she stopped us at 4 or 5 rolls and said that would be enough.. (wtf?) .. There were 3 of us and we had just flown in from Maui and hadn't eaten in like 12 hours! We were starved. We did end up ordering 3 more rolls, but I found that to be a bit odd. ... \n\nThe beer is ice cold and served in a frosty mug! .. Great place!! I'll definitely be back as soon as I'm in that neighborhood again", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "was there waiting my table last night, it's not that busy but nobody come to us . They only have 2 waitress and 1 chef at sushi bar, what a strange thing, have such good business, don't even want to hire more .", "author": "秀"}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "Never seems to have a bad experience in this restaurant.  One thing always appeal to me is if you spend $15 dollar they will sell you one item in their special item for $1.  So the fact that I ended just a little more to get full without wanting to spend 5-7 bucks more, this is perfect.\n\nAnyway always enjoy the sashimi plates here and bento.  I, myself, never seems to care about rolls because they are just filler item.  I do enjoy their spicy tuna and other hand rolls.\n\nOverall for the Sunset (under Chinese management) I truly consider this to be one of the best.  There's Okaza ya on taraval down the block and there's Fujiyama on Noriega but every place has its pros and cons.  I'm a late person and if I want to eat sushi at 11pm this place is available for me.\n\nGive it a try next time you are feeling sushi at late hours", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "Surprised by some of the low reviews.  This place has some of my favorite sashimi in the bay area.  The sashimi platter is always fresh, large and delicious.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "I really like sushi raw for a number of reasons. \n\nThe service is always fast for lunch and late night, the two times I always end up at Sushi Raw.  What's better to eat at close to midnight than sushi? The only other places open late are McDonalds, diners or 7 eleven. \n\nAlthough the sushi isn't spectacular or out of this world, it does do the job and do it well. Elegant  presentation, decent portions, decent prices, complimentary green tea, its hard to complain. The bathrooms are clean and the servers are friendly. Sushi raw is successful at being a convenient sushi spot that serves fresh sushi.  \n\nPersonally, I love the salmon sashimi, the soft shell crab roll, double hamachi just to name a few.", "author": "Aeri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-21", "description": "I came here on a weekday with a few of my friends.  The waitress was nice and seated us immediately. I've been to the location in the Mission before so i have an idea of what their menu consists of. However, i prefer this location more because parking is easier and the ambiance is better here. Their plates are so cute! \n\nOK let me talk about the food. I ordered the Tempura Udon. the portion was pretty big. They gave me so much tempura I barely finished it. My friends ordered sushi and they all loved it. They ordered the Hot Summer Roll, lion King, and 4 other sushi rolls. Overall the food here is pretty good. Especially their presentation.  Another great sushi place in SF!", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-03", "description": "They don't serve lunch on weekdays anymore; they need to update their Yelp hours.", "author": "Luisa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "Sushi Raw has some of the most delicious oysters I've ever had. Their spicy tuna is perfectly spiced. The tuna poki is sensational! I highly recommend this restaurant if you like fresh seafood.", "author": "Vicky M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "This review will be based on my take-out order. \n\nCraving for sushi, I overslept during my nap for normal sushi hours (normally before 9 pm). Woke up at 10:30 pm starving. Nothing else was on my mind but sushi, so I decided to turn to Yelp in hopes of finding a place still open! Most late-night sushi places that were 4 stars were still open were located in downtown. Not wanting to travel so far, I opted for Sushi Raw. \n\nLocated on the corner/busy streets of 19th Ave and Taraval, I always avoided this place. Maybe cause the place seemed big outside and the sign made it seem janky. Entering, I was quite surprised. The interior looked very modern-chick with a black and red theme to it. The size of the place is quite small, so I wouldn't recommend bringing parties of 5 or more. The sign outside does no justice! Seriously, change the font, Sushi Raw. \n\nThe service was okay, but don't expect it to be authentic sushi. I heard the chef behind the sushi counter speak Chinese. No, not rumors or reviews, like I literally heard them speak! Haha. It was nice of the server to give us water as we waited for our food. My bf and I ordered 3 sushi rolls (Taraval Street Roll, Lion King Roll, Unagi), and we ended up getting an order of California rolls for free!...or so they say. According to one yelper, for every $15 you spend, they will sell you one special item for $1. Not so bad, at least it isn't the regular price. I find it quite interesting, cause it's like you get more than what you paid for! In a way.. \n\nThe food itself was mediocre. My bf ordered the Taraval Street Roll ($9), and he enjoyed it. He thought the rice was good, compared to other sushi restaurants; like the rice was just the right amount of stickyness. I tasted one of his rolls and it was good. I ordered (2) Unagi ($4.50 ea) and it was nothing special. Tasted like any other Unagi but it did satisfy my cravings for it. I also ordered the Lion King Roll (typical; $12), and it was good. I think out of all the LKR's I've tried, this one would be a little on the better side. I think for the quality of the food, the price is a bit pricey. \n\nOverall, I think this place would make a good late night place to eat if you're craving for sushi. Keep in mind, they close at midnight! They're mediocre but pricey.", "author": "Mandy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-23", "description": "I love how the quality is inversely proportional to their prices, which are rock bottom.", "author": "Caleb O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "The only initiative that brought me here was because a friend purchased a coupon from Yelp. I have passed by this place many times without giving it a second glance. I must admit that the location and outer appearance definitely knock off a point. I was surprised by the sushi though. I am in love with sushi and that is all we ate here. I love every roll we ordered. (Lion King, Dragon, Four Seasons, & Double Himachi) They also have this cool menu where you get certain things for $1-4 for every $15 you spend on food from the regular menu. \n\nThe service was good. It was at an odd hour, like a late lunch. There were only two other parties there and we were well taken care of. I'll be back soon.", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "This place is GREAT! Their happy hour is glorious and the Mexican Desert Roll is fab. Highly recommend!!!", "author": "Danielle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "Nice small place (9 table) with young traditional staff. Food is all the same as you would expect for Japanese food. My waiter was simi attentive, just enough to not bother me and my Bento box.", "author": "Lawrence F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-18", "description": "Came here because I was craving some late night sushi.  I was not impressed.  All the food was just mediocre.  The service and atmosphere was fast and trendy, but I could not get over the food.  The sashimi looked like cubes of fish, not slices.  The sauce was overdone on most of the rolls.  There was only one roll I truly enjoyed.  It had lobster, crab meat, and the waitress set the plate on fire while serving it to us.  \n\nThey have pretty decent specials for every $15 you spend.", "author": "Edward N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-22", "description": "Finally went to this local Sushi Raw Restaurant. And it was surprisingly good. The fish was fresh and the cut was thick.\n\nWe ordered:\n*Maguro (Sashimi) 9 Pcs.: $13.95 Fresh and thick slice\n*Hamachi (Sashimi) 9 Pcs.: $13.95 Fresh and thick slice\n*Sushi Raw Bento Special $13.95 Choice of any 3 items listed below, served with rice, miso soup and salad. We chose Beef Teriyaki, Tonkatsu, and Short Ribs. \n\nEverything was fairly decent. On top of the menu, there was a special price menu. For EVERY $15 you order, you can pick one item from the Special Menu.\nSpecial Menu had $1-2 piece raw oyster\nSpecial Menu had $5-5 pieces of White Albacore Sashimi\n\nThose are the two items we ordered, but there was more on the list. I am not sure when does this Special menu happen, but it made the place a better deal. And as I said again. I thought the sashimi was fairly decent.", "author": "Janice T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "This place is amazing, I will warn you it's pretty pricey but if you like good sushi then you  will love it here.  \n\nI recommend getting the Sunset strip roll and the Hot summer roll...all I can say is wow I can't wait to go back! \n\nOn top of the amazing sushi was our waitress she was very attentive and when I was trying to figure out which roll I wanted to order next she offered some suggestions. I couldn't believe how fast our sushi was prepared the wait was less than 5 minutes.\n\nAnd they deliver so really what are you waiting for? Ok seriously go try it now!", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-25", "description": "The food here is decent but the customer service was terrible. My friend was halfway through her large bento before I got either part of my meal. It took about 45 minutes. All I ordered was a seafood salad and one sushi roll. Her meal included sushi, plus five other items, yet that still came out MUCH earlier than mine. Someone clearly had forgotten to put in the order. There were only three other tables and two waiters, yet neither of those waiters checked in on us for the entire duration of the meal. Our water was only filled when they took our plates after we finished. I'd understand all of this happening on a busy, understaffed night, but that was not the case here.", "author": "Adriana N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-20", "description": "Came here last night and ordered the spicy scallop and spicy salmon hand roll. Woke up today with food poisoning and threw up twice.", "author": "Sergei A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-12", "description": "Sunday, it was my privilege to attend Hiromi Fujita's acting debut on Broadway in the Lowell High School Production of \"Crazy For You.\"  Okay so it was at Lowell High School, not on Broadway in New York but I think it was right up there with other inspired stage productions I have attended over the years.  Hiromi's song and dance in the pivotal role of \"Eugene\" (Hiromi was also \"Pete\" in The Thursday and Saturday production) was quite impressive.  Given that Hiromi is also All-City in football and the choice as MC for school events ... Did Hiromi turn out great or what?\n\nSo, proud father Yoshi, quite the accomplished sushi chef in his own right, invited me to join the family in the after play dinner.  Given that he was scheduled to drive his other daughter to Santa Cruz later, the gang opted for \"Sushi Raw,\" and I bet you were all wondering when I was going to get to that.\n\nWonder no more.  Given that Fujita-san (who is opening at a new restaurant in SSF in the next month or so, details when it opens of course) is Sushi Chef All-Pro, I thought it was somewhat of a curious selection but I think it was location driven.  When we arrived, there was rock star parking across the street and this feed the  meter on Sundays thing has got to go.  It was mid to late afternoon, there was just one other couple there and yes it's quite the lengthy menu with little bonuses driven by the purchase amounts.  How so?\n\nWell I ordered a ton katsu and tempura combination which entitled you to some tuna sashimi for a couple of bucks extra.  Then since it passed the $15 threshold, I had the option of an unagi hand roll for $1.  Service was slightly stilted but reasonably attentive.  Food was attractively presented, ton katsu was quite tender and well-fried, tempura was okay, the shrimp was kind of limp but they are good at frying foods and tempura-izing here.  The maguro sashimi was quite good, very fresh and the texture was perfect.  $20 for all of that, the rice was well-prepared and I would eat at \"Sushi Raw\" again.\n\nBut I am waiting for Yoshihiko Fujita's new restaurant to open ...", "author": "Terry A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-24", "description": "FOOD POISONING!!\nI have eaten here several times with no problems, but I am just getting over a bout of food poisoning courtesy of Sushi Raw. Any place that handles raw fish has to be super clean to avoid cross contamination of the fish and veggies with bacteria, and sushi raw is a fail. \nYes, I am quite sure it was food poisoning and not a random virus. I've had food poisoning before and know its signs well. Buyer beware.", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "there are slightly mixed reviews here but i have been here twice in the past month and have loved it. i came the first time because it was close by and brought a party of 9 the next time i came. everyone was very happy with their food, great variety, and prices are not bad at all. i was here both times on week nights and it was rather empty, i also had the same waitress both times and she was fantastic. I do recommend this place!", "author": "Michelle H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-02", "description": "We are always welcomed with efficient service when dining in, much better than for delivery. This summer we got to enjoy the Boston Roll, which was lobster heaven. Anything we've tried at this spot has been delicious.", "author": "Caroline L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-16", "description": "Mediocre. Eel still had bones in it. California rolls use imitation crab meat, and a whole lot of mayonnaise (disgusting). Sesame chicken was decent, but i wasn't here for deep fried chinese food. I'm a food enthusiast and this place is cheap quality food at the price of what decent should be. I will not embarrass this place any further. I've come here twice now... Not going to give it another chance", "author": "Moe D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-11", "description": "The service was really slow and there wasn't even many people there. The double hamachi roll was good but we also ordered the sashimi lunch special and TMI now I've been running the bathroom. I won't be eating raw sushi from Sushi Raw anymore!", "author": "Jen J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-22", "description": "Saw this place pop up where the old Hawaiian diner used to be.  Showed up on a Friday  night, and there weren't that many people in the restaurant.\n\nWe ordered too much food again as usual:\n~Toro Nigiri\n~Chicken Katsu, Tempura & Salmon Bento Box\n~Hamachi Kama\n~Live Uni\n~Fuji Mountain Roll\n\nThe food was ok.  The Fuji Mountain Roll started to fall apart because there was too much sauce.  The one thing that stood out for me was the live uni.  It was my first time having live uni and it was quite delicious.\n\nThe prices are average and service was a little on the slow side.  I probably wouldn't come back for the bento box, but maybe the sushi.", "author": "Patra I."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-11", "description": "I had just finished my maternity photo shoot and we decided to have an early dinner here since it was nearby. Good thing I wasn't super hungry because there was only one waitress and the restaurant was half full. The waitress sat us down and gave us the menus, then she came back about 5 minutes later and gave us waters. I waited for her to come back to ask her for some straws for the waters, but she did not come back for another 10minutes. The waitress kept on speed walking and dragging her feet back and forth between tables and from the back, it was a little weird. She finally came over and took our orders, and brought our straws. It took about another 20 minutes for our food to come out, and I was a bit disappointed. I ordered the salmon teriyaki rice plate ($10), and I swear when I first looked at it I thought it looked like an appetizer. The portion was tiny with a small serving of rice, two small salmon strips and salad. We were about to start eating until we realized the waitress didn't give us any forks. I understand that it's a sushi restaurant, but not everyone eats with only chopsticks, and I know that it's even harder to eat salmon with chopsticks. My boyfriend actually ended up going up to the waitress and having to ask for forks because we were just sick of sitting there and waiting for her to come back. The food was okay, I think the service just killed my whole experience there. Our bill came up to about $50 for three people (no appetizers). I'd say it wasn't worth it considering the fact that our portions were small, and I walked out still feeling a bit hungry so we ended up grabbing something else to eat.", "author": "Rachelle C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-27", "description": "The atmosphere was relaxing and the sushi was fresh and tasty! I had salmon and it just melted in my mouth! It was soooooo good!", "author": "Crystal R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-19", "description": "I am not too fond, my best friend and I came when they were about to close shop but fortunately they let us eat. The reason why Sushi Raw's name is so bold is because the food isn't what it is.", "author": "Shan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-19", "description": "Although I'm a big sushi fan, I'm not a sushi snob, which makes it very easy for Japanese restaurants to please me and get a good review out of me.\n\nAll in all, this place was decent. It's not fancy enough for a date, not cheap enough to be a feel-good, no-frills joint, and it doesn't have anything incredibly unique that would make me want to go back. The people working were nice, so I had to give them 3 stars. (I'm a sucker.)\n\n+Atmosphere is somewhat nice for a small restaurant\n+ Servers have a good understanding of the sushi making process, including what's fresh, what their restaurant specialties are, and they are good in terms of suggesting rolls\n+ Open late!\n= Prices are moderate. Not too exorbitant, but definitely not a super bargain.\n- Rolls are very small\n- Service is friendly and professional but super lax: water and tea weren't refilled often, and the rolls came out really slow for what we ordered.", "author": "Stephen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "I do not know why this place has an average rating of only 3 stars. In my opinion it should be AT LEAST 3.5\n\nI have come here pretty often, both dine in, take out and delivery. Never have they gotten a delivery order wrong and I have probably ordered around 10 times. Once I came in to pick up a take out order and they had not started it yet although it was fairly dead inside but they did give me hot tea while I waited and finished it pretty promptly. \n\nWhen I have dined it they have always been fairly quick. I have never seen it very packed inside. \n\nThe decor is nice, feels fairly classy (though I do appreciate hole in the wall establishments also) \n\nThe fish has always been pretty fresh.\nIt is not the best sushi I have ever had but I would recommend it still! \n\nMy go-to rolls are the California with thinly sliced lemon on top (YUM)\nThe 49er roll\nand the Alaskan roll\n\nFree hot tea is always a plus too!", "author": "Emily F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "I always get the 3 item bento box. It comes with rice, salad and miso soup. My choices were salmon teriyaki, spicy tuna roll and tempura. Other items I've tried are:\n\nassorted sashimi- very fresh\nrainbow roll- california roll topped with fresh assorted fish\nisland roll- different, light and refreshing-It was wrapped with cucumber instead of seaweed and rice\ncalifornia roll\ngoma ae- spinach in sesame sauce", "author": "Jo S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Yum! Tempura roll, cucumber lobster roll and deep fried California roll. Tasty and fast service. We had no problems and devoured our rolls. Really surprised by all the negative reviews, definitely give this place a shot...there's also one in the Excelsior that I haven't been to recently, but enjoyed the last time I was there.", "author": "Kasa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "Quick friendly service. Great sushi / teriyaki. Clean. Affordable. I got a lunch special bento box. Fantastic deal. 10.99 for ribeye teriyaki, tempura, miso, and a California roll.", "author": "Tyler S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Honestly, I pass by this place all the time while driving down 19th, and never thought to give it a second look because it's pretty meh on the outside...I assumed it was another sushi place in the city run by non-Japanese, but this place is legit. \n\nFirst, when you walk in, the swanky restaurant design instantly transforms you to a place that feels much cooler than the corner of Taraval street. There's bamboo paneling on the walls, a display of sake bottles on the wall by the sushi bar, and corrugated \"made to look like metal\" siding on the ceiling to give it a contemporary feel. Even the plating is artistic. \n\nThe special rolls were so good: we had the double hamachi and the Texas \"something\" roll (which was wrapped in meat instead of seaweed). The menu is extensive, with offerings of everything from sushi to udon, and your standard cutlets to fresh oysters and sea urchin. They also have a special menu of happy-hour-priced small bites that you can order from each time you hit the $15 mark from the regular menu. There's a decent beer and sake selection too.", "author": "Lisa N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-22", "description": "By far my favorite spot for sushi in San Francisco; I truly appreciate the food decor, price, and portions, all is too close to perfection. The service sometimes a little slow but I can deal with it because of their food.", "author": "Natalia E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-18", "description": "I've tried sushi all of the country and sushi raw offers the best mix of expertly crafted rolls and perfectly blended dishes. I have tried about half their menu so far, and all are excellent. If you're in the area you should definitely stop by!", "author": "Chaid C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Good udon and ramen! Service was fast and polite, dining area is clean and well maintained.", "author": "Tina W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-30", "description": "our server was nice but the other staff were rude. I ordered the cheesecake dessert and it was LITERALLY 5 bites worth of cheesecake! It was so small that i  almost thought they were kidding!!! The sushi was ok but unimpressive", "author": "Dilan F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Woohoo! Another nocturnal spot for Ninja!! =)\n\nThe sushi chef here is awesome! He loves to chat if you're seated at the counter which is the only way we dine here.  The food is good, and the service is incredible! \n\nWe've even seen the patience the staff has for people who've come in and got completely blitzed!! Now those are probably the morons that screw us up because this establishment only serves alcohol until like 10p or 11p...BOOO!!\n\nBut Iove that they're open late and glad they are surviving the 19th and Taraval cursed spot they've taken over.  I'll continue to come support their restaurant!! =)", "author": "Ninja H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "F*CK YOU HATERS! This place is so good to me!\n\nLol, I'm not one to say what's really authentic or not though, but it's good enough for me :)\n\nMy friends and I came here last night, last minute, for our friend's 24th Birthday. Our first times here.. and mmm, were we impressed!\n\nThe prices are reasonable (to me) and everything was delicious. From the salmon, to the spicy tuna, to the Philadelphia rolls. Apparently the Beef Tongue was amazing as well because the person who was sitting next to me couldn't stop talking about it!\n\nSo good! The waiters were great as well. Idk what everyone's complaining about...\n\nI WOULD come back :)", "author": "Mimi N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "I just went to another sushi place (wont name it), and was terribly disappointed. I went to Sushi Raw multiple times and I never realized until now how much quality there was in their food preparation. They are affordable; their staff is kind and helpful. and their chef is well-experienced.", "author": "Remi D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-09", "description": "Not sure what happened with the quality of food, was a bit disappointed. \n\nDidn't have the food dining in again this time, rather I ordered delivery. Yes, I have those lazy days, but so greatful they delivered! \n\nOrder came in 45 minutes. Food was still warm. Received complimentary California Roll, since that's their promo when you order over a $ amount. California rolls were eh. Prices for Bento are kinda high, that's why it's more beneficial if you get the 3 item bento instead.\n\nI guess this place is great when you order varieties of sushi rolls rather than the plates.", "author": "Christine F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-10", "description": "This review is purely on the takeout of Chirashi that I had last night.  I have no idea what the food is like in the restaurant, but it did look pretty good.\n\nI had always wanted to eat here and I saw the living social deal last night for 10 bucks off so I decided to try it.  It says 16 pieces of assorted sashimi on sushi rice on their menu.\n\nI'm thinking wow, 13.99 sounds like a steal!  And it was, they literally stole my money with this!  I guess it didn't say how big the pieces were going to be, but I expected more than quarter sized pieces of fish.  On top of that the snapper was extremely fishy, I\"m not even sure I should of eaten it.\n\nI've had better quality fish from sushi bought from Raleys.  Thanks for ruining my night!", "author": "Eddie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "Raw is my favorite japanese restaurant in SF. Everything is pretty fresh and so yummy!! Also, Island roll is divine!!", "author": "Aline A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-12", "description": "This is the special place my mom and I go when she comes up to SF to visit. This place is great because whenever we go for lunch, no one else is really there! Its also pretty quiet, no super loud music. It seems like so many trendy sushi places nowadays sound like a club. \nBut with this place, we get peace and amazing sushi.\nTheir specialty rolls are super good. \nthe service is really good, too. We have never had a problem with anyone being rude or anything.\nOverall, this is a great place for a quiet date or a nice meal with friends.", "author": "Marie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-29", "description": "This used to be my favorite place to get sushi.  Unfortunately this is the THIRD strike.  They get the takeout order wrong EVERY TIME.\n\nMy friend is allergic to avocado.  We order asking no avocado & no tobiko on anything...we specifically ask them for NO AVOCADO/NO TABIKO..what do they put?  Both! ... Every time.\n\nHow hard is it to make sushi?  Apparently they have incompetent people working the kitchen therefore we will stay away and recommend everyone who likes to get their food how they ordered it to do the same.  \n\nGuess other places will be getting our business now!", "author": "Jane B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-11", "description": "Okay, so maybe I was glamored by the opening day theatrics, but since then, I have returned multiple times and it isn't as great as I once thought.\n\nThe sushi is subpar at best and really isn't anything I would actually go to the restaurant for. The prices, if you think about it, are kind of high - $12-13 for a bento special, but you really don't get THAT much food for what you pay for... it just seems like a lot because there's a larger variety than normal on your plate. \n\nThe only reason I would come here again is for ramen or udon. It's hard to mess those dishes up. During my most recent trip here, they've hired a great waitress (which is why the review isn't 2 stars now). She was very attentive and friendly, which is an A+ in my book.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "Got the hot summer roll, raw oysters, edamame and a large bottle of hot sake with my table. Everything was delicious and the presentation of the food--especially the hot summer roll, was beautiful. My boyfriend and I will definitely return when craving sushi cause he lives just down the street!", "author": "Ally T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "I have been wanting to try Sushi Raw of Taraval... I finally did I came here last week just to try the Lobster Roll and the Beef Short Rib and it wasnt that bad... It was the first time for me that I have eaten the Beef Short Rib at Sushi Raw although I have eaten it before but its a first at this Sushi Raw... Also one more thing most of my yelp reviews I have described how are the restrooms... Well the restroom that I used at the Sushi Raw of Taraval was super clean although it was just for a one person but it was really clean!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-19", "description": "Food = I love sushi. the 49er roll is the best for me. Sushi is fresh. Flavorful bursts of yumminess with every bite.\n\nQuantity = average size rolls. Not skimpy on the seafood. \n\nCustomer service = waiters are attentive. They fill my water. Check in on me. One time I got there when they were closing (empty) cleaning up, and they served me and my company. The sushi was made with the sane attention to detail as if they weren't in a hurry to go home. Nice guys always say thank you and good bye in unison when I leave.\n\nAtmosphere = nice. But it gets really cold and drafty. \n\nBathroom = clean\n\nParking = street parking. It's usually available at night. \n\nMy go to place for sushi in SF.", "author": "One S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-14", "description": "Might be a 2.5 star. We've done delivery here twice and they cut up the sashimi in large cubes which isn't that appetizing. I always believe in giving two chances to restaurants but I'm over this place. Decent prices. Maybe just stick with the bentos and no raw fish", "author": "Elisa M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-25", "description": "Not the freshest fish. Doesnt smell or taste fresh. Seems to be pricey, which I wouldnt mind if it was great. Sushi Raw does have some redeeming qualities for me though, which keep me coming back.\n1. They are close\n2. They are open late and I tend to eat late. \n3. They deliver.", "author": "Lauren N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-03", "description": "Look this place isnt bad but its not my first place of choice for sushi, there is just something about this place that just doesnt sit well with me. \n\nThe service is good, the servers are all very nice and attentive. The sushi chefs know what they are doing and are also very nice. But it just might be the food, something I just can't put my finger on.\n\nIve been here a couple times and I've had fun, drinking and eating but the food was never GREAT, to me at least. Its a good place to fix a craving and their fish is fresh. Rolls are the usual with flares of interesting combinations but I'll add the cucumber lobster is something we have ordered almost every time.\n\nI'll be back, I'm sure of it.", "author": "phillip w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "Late at night this is definitely worth checking out. Open until midnite and the sushi still tasted surprisingly fresh. The downside is that it's a little overpriced. \n\nPlace is nice and even though 19th is just outside, the atmosphere was nice and quiet inside. The sushi tasted pretty good but for the prices I kinda expected a little better. They have fatty tuna but it wasn't worth the price.\n\nFor the food alone I would probably give this place a three but the service was really quick, friendly and helpful. Our server constantly filled our tea and helped our experience. Definitely earned Sushi Raw another star.", "author": "James D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-26", "description": "Average price for average sushi. The good thing? They're open until midnight... so if you have that craving for sushi late at night, this is the place to go.\n\nThe service was okay. There really wasn't anybody else in the restaurant and the waitresses kept talking to this one man. We had to flag them down for everything. There are better sushi places in the city... I would avoid this one if you can.", "author": "Sara K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-01", "description": "Sushi Raw!\n\nOne Saturday night, my boyfriend and I were lazy as shit and didn't want to do anything but catch up on compilation of: 30 rock, The Office, Parks and Recreation, and Breaking Bad. After doing that, we decided that it would be an awesome idea to rewatch ALL of the Simpsons episodes.... EVER!! When we rewatched the episode with the clip \"Poison Blowfish Sushi\"... we knew it was a message from above.\n\n+ Ordered togo; Orders of $25=free california roll , or $35=free dragon roll\n\n+Seaweed salad\n\n+Dragon roll was deliciously spicy\n\n-/+ I think the lady on the phone misinterpreted what we wanted with our Spicy Tuna roll. Since the dragon roll already had spicy tuna, she recommended that we switch out Salmon for one of the rolls. So instead of it being Spicy Tuna roll, it was spicy salmon roll? O well, I still ate it though....\n\n+I was poppin' the salmon roll with a thinly sliced lemon wedge on top (sorry I forgot what its called) like candy\n\n+Open til 12am \n\nConclusion: I've had better, and I've had worse. No complaints, it's the only place in the area at 11pm when hunger stikes. My belly was satisfied.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-08", "description": "Looks pricey from the outside and Yes, It's also pricey in the inside.\n\nFood is tasty and good. Only problem to me is having to spend approximately 60-80 bucks just to get close to full for 2. Sigh\n\nLet's put it this way...After eating here. I'm still hungry so i go to Seniore's Pizza...\n\nThat's just sad. This place simply does not impress me as much as i was hoping for.", "author": "Julie B C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-27", "description": "I am currently sitting here starving. Placed order for sushi at 6:18. I do not live far. They said 45-60min ok.. Now it's almost two hours later and they took their phones off the hook. My husband and I called over and over again. Last time I will order from here:(", "author": "Toni C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-30", "description": "Hmmmmmm I'm a little torn about this place. The food is delicious but the service is kinda crappy! First when we walked in nobody greeted us or seated us. After standing there being ignored for a while we seated ourselves. Actually it's not just the service that's crappy, the chef didn't do such a great job either. \nWe ordered the sake nigiri (salmon) which is usually delicious there. This time it came with parts of the skin on it...that's just lazy. We also ordered the red dragon roll which comes with spicy tuna, shrimp tempura, and avocado. The spicy tuna had bits of white chunks in it (not normal) and instead of avocado it had lettuce. what? The chef did offer to make us another one (after he tried to say that the avocado was in there) which was really nice but we didn't want to be wasteful so we declined. \nUsually when we go to Sushi Raw we really enjoy our experience, but this time not so much. We'll for sure go again but maybe I'll bring my own tea refills.", "author": "Janu A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "Very fresh sushi! just a little bit overpriced.\n\nFour Seasons roll is my favorite roll here. All the other ones are amazing and fun too. They really try to create special designs for presentation. COOL.\n\nI've gotten the sushi boat twice so far. It's really good, but I just wish they'd switch out the california rolls. and.... its not even A BOAT!! lol it's just on a loong plate. how can you call it a sushi BOAT? =.=\" \n\nAlso had raw oysters from their special appetizer menu. really good. oysters are small and sweet. \n\nTried their Udon, I rarely like udon from anywhere and this place was pretty good. I liked the clear broth and the noodles were very soft and chewy. \n\nService is good.\n\n\nDon't get me wrong, this is NOT my FAVORITE sushi restaurant. I would give 4.5 stars if I could.  I just really like it for a fancy night out that wont KILL your pocket like some other sushi restaurants in SF.", "author": "Erica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "I had a splendid time today at Sushi Raw with my family. Id like to start this review off by saying how happy I was with the customer service. The waitress earned a 10 out of 10 in my book. She was very personable and friendly to us. I know yelp reviews are geared towards food most importantly but that was some of the best service I've ever received. Moreover, I ordered the sushi boat, Unagi (My favorite), and a few other very nice rolls they offered. Everything was fresh and made my taste buds go crazy! Can't wait to go back!", "author": "Osa A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "SUSHI IN THE SUNSET!\n\nOkay, so I have only tried a handful of places in the Sunset since moving back to SF and Sushi Raw is definitely a go.\n\nIs it the most amazing and creative sushi joint I've been to?  No, but in that respect my heart still goes to places in LA.  But it does have fresh fish, tasty selection, and totally reasonable prices.  That alone is 4 stars in my book.\n\nOne thing I have to point out is that they have this bonus menu where you get some items for $1-$4 bucks ($5 large beer, $1 hand rolls, etc.) if you spend $15 bucks.  Kind of nice.\n\nDowners:  \n- TERRIBLE PARKING\n- We happened to have drunk, high college kids (God, I sound old...) next to us who had to make everyone at the restaurant aware of their presence... suddenly you realized how small this place was AND how close our tables were.  So be aware of the crowd it draws...\n\nNot too crowded on a Sunday night.  Good service and nice vibe overall.  Would definitely come back.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-19", "description": "this is our favorite sushi place. the sushis are perfect and they offer 2$ large hot sake, which makes life better. I totally recommend this place. the sushi and assorted sashimi taste delicious. the service is great when the restaurant is not very busy but it can lame when it is busy.\noverall, Raw sushi is our spot and we hang out there, whenever we want good sushi and good service.", "author": "Sherry B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-19", "description": "THE RAMEN. I've been to exclusive Ramen places who didn't make Ramen as good as here! The Tonkatsu Ramen is flavorful with perfectly cooked pork tonkatsu on top. *Salivation alert!* \n\nThe restaurant is super clean and the service is sweet and quick. I still kind of miss the 24 hour Hawaiian drive in though :( But this will do :)", "author": "Adlyn S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-18", "description": "FOOD:\n1.) Mt Fuji - holy cow. It come out flaming. Great presentation. Annnnd it was pretty yummy!\n2.) Rock n Roll - Basic unagi n avocado\n3.) Spicy Tuna roll - yummy. but basic.\n\n\nSERVICE:\nTwas ok. Fail to see empty glasses or hard to make eye contact to ask for something.\n\n\nATMOSPHERE:\nAlways had an appealing storefront passing by on 19th. Just never wanted to stop by bc it's in the outer side of town. But it's a nice, simple atmosphere inside.", "author": "Angela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-22", "description": "I came here with my friend on a Thursday evening promptly at 5:00 p.m. (when they reopen for dinner).  The waitress was attentive, and because there was only one other family that came in to eat while we were there, even the sushi chefs at the sushi bar were able to assist us if we needed anything.  \n\nMy complaint with this place is the dirty dishes.  The first plate brought out to me had dried food stuck on it, so I promptly requested a new one.  The tea cup I was given was also not the cleanest, and I would definitely check the dishes before eating or drinking from them.  \n\nBut on to the food!  We ordered miso soup, Fuji Mountain Roll and Hot Summer Roll.  Both rolls were delicious, and I would definitely order them again.  The presentation of the rolls really makes it feel like you're eating something special.  \n\nI would come here again, but it would not be my first choice of sushi restaurants.", "author": "Lydia H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-12", "description": "Eh.. Nothing special... Overpriced... Slow service...\n\nI hate writing poor/bad reviews... But save your money and go somewhere else... (somewhere with good food)...", "author": "Tiffany Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Can't wait for my favorite Texas roll. Words can not describe this place i love it all the way.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "The atmosphere in Sushi Raw is really nice, the setting is very modern and is great for date nights with friends and family. They have a wide variety of sushi and different sized entrees. The prices were very reasonable and a good deal! The best part is that they're open till midnight for a late night bite! Would definitely go back again for sushi!", "author": "Lola M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-27", "description": "Well... I almost thought this place was going to be the first delivery I've ever gotten in the city that was great till they arrived so quick with the wrong order. That is why I am giving 1 star. I feel like that is the most important thing to have down before even driving out to deliver anything! I ordered 20 pieces of sushi rolls: 5 teriyaki, 5 shrimp tempura, 5 crunch roll, 5 California roll, but instead they gave me 15 California rolls and the 5 that were left were Teriyaki. Can you imagine! I was so stuffed with California rolls and plus it was my least favorite out of all the ones I ordered. I was so sad by the end of the night. But besides that their sushi is good. I recommend checking your order before that man leaves your door!", "author": "Yaritza F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "This is one of my newest favorite place for Japanese. I believe this is a Chinese-owned Japanese restaurant, like most, but presentation is very good. I have been coming here for the past 8 months, and I am finally getting around to writing a review for this restaurant.\n\nI usually just come here for lunches, with my coworkers, friends, and even clients at times. The place has a quiet and never packed. Everything inside looks brand new and nothing broken or worn. I have been to restaurants where it looks like the owners don't care about their interior, but this place keeps it all classy. \n\nThe special rolls are so great. I have tried many of the rolls such as the Texas Roll, Eclipse Roll, and the Lion King Roll. The presentation of these rolls are great. I always am so amazed on how each of the rolls look when it comes to the table. \n\nThe waitstaff is friendly and nice. Service is usually fast. I have an hour lunch, and I am never late getting back to work.", "author": "Jason H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-03", "description": "I went here the other night because I had gotten home from work at 9:45  and didn't feel like eating pizza. The previous times I had been to Sushi Raw were decent enough. It didn't blow my mind and it didn't bother me at all.\n\nMy and my girlfriend walk in and sit down. 15 minutes later the server comes to greet us for the first time. Somehow I hadn't chosen what I wanted yet so we asked for a few more minutes. Much longer later (after she helped the large group next to us that just came in) she comes to us and takes our order. Oddly enough they don't sell anything alcoholic after 10 PM. This was interesting because she had just got done serving beer to two other parties in the restaurant and the sushi chef at the bar was swigging down shot after shot of weird sake concoctions with his college bros. \n\nWhen the food came it was as I remember it being, decent.\n\nPerhaps not going here again for a while.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-12", "description": "The convenience of Sushi Raw caught my attention. I decided to place an order online from their website, pay, and pick-up. They gave me an estimate time of picking up our food at 7:05pm. I arrived at 7:20pm and the waitress took my debit card again, swiped it, and had me pay... Little did I know I was then charged TWICE!! Why does this always happen to me?? I called back a few days later and the man on the other side wanted me to give him my debit card number again (NOONONO) and to just receive a gift card to come back and eat again for the inconvenience (NONONONO AGAIN). Sigh.\n\nAnyways, I waited another 15 minutes to find out that my order was ready on their counter the entire time from 7:05, so the food was not fresh and my sashimi was lukewarm from the containers by 7:35. -_________- Fail.\n\nThere wasn't anything special about this place and I wasn't as satisfied as I wish I could be. The nigiri that comes with the bento box wasn't too fresh either (or it was just warmed up by the hot food it shared a container with).\n\nOverall 2 stars and I won't be returning to this location.", "author": "Rosanne L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Best Beef teriyaki also the walnut prawns role and the sushi boat all amazing must go take a visit again!!!", "author": "Ahmad O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "My buddy took me out for my birthday and he decided to take me here.\n\nWe were the first ones there, the servers weren't even all there yet! Just one very sweet waitress.  She went over all the specials for the day.  We ordered every one of them.  We also ordered the sushi boat and oysters.\n\nOne of the specials we ordered was live fresh Uni. It was disgusting! It tasted like plastic and the after taste was even worse.  We thought that maybe it was just the piece we tried, so we tried another one. It was the same.  My friend told the waitress, and the head chef was so accommodating. They brought another order out and asked us to try, and if it's the same, they would not charge us.  Apparently, he knows that some uni come out tasting like that.  Thank goodness!\n\nThe oysters were kumamoto oysters...and they were perfect! Super sweet and juicy. \n\nService was excellent through and through. \n\nFood was fresh and fresh can be. \n\nI will definitely come back.", "author": "TM O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-27", "description": "Can there be too many sushi places in the city?\n\nI think not.  Because apparently they just pop up non stop on each block.  Its like the next raid of Starbucks coffee shops except this time its actually food.  In any case, me and Pb had a dinner here and ordered some amazing food.  Not super great, but it definitely keeps me wanting to come back some time. \n\n-Fresh Uni - yUM $15 for 5 pieces \n-Toro - it ok\n-Bento box - a nicely upscaled display \n-Fuji Mt - roll with lobster but overcooked.  It seemed more for show.  not worth it.\n-Hamachi kama - I've been a sucker for this lately, but it was good and meaty", "author": "Vincent K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-08", "description": "I dont like sushi, but my wife and kids do, and they said the sushi was good.  This is the first time we went and it was sunday evening.  We were the only ones there and we were treated well.  The udon soup was very good and portion was large.  The family all said their sushi was good, and my chicken teriyaki was as good as anywhere else.  We ordered the karokke, which I had never had before, but was very good.  The family says the sushi options were also pretty extensive.  We were all happy.", "author": "Steven B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-31", "description": "Right when I walked in, a table with two older men called my name \"Carrie!..Carrie!\" and said to each other that's Carrie and looked over to the waitress and said to her \"That looks like Carrie.\"  I walked in clarifying that my name is Kelly... Anyways, after the confusion I was seated far away from them which is a good thing. I quickly scanned the place and it was pretty decent although once the sushi chef opened the raw fish fridge at the sushi table, I immediately smelled a stench of dead fish. \n\nMy party arrived and we ordered like crazy. My favorite part is the unfiltered sake, Nigori. Yumm..my favorite sake. The sushi was alright..nothing special..just filling. We have the four seasons roll (presented beautifully), dynamite roll, 3 spicy tuna hand rolls (okay) , and the double hamachi roll (alright) to fill three bellies. \n\nSomething to note.. for every $15 you spend, you can order 1 item from the dollar menu which we did (the 3 handrolls). We originally thought we could order unlimited items from the dollar menu IF you spent $15 total but it's actually 1 item every $15. \n\nOverall, it was a good time but would probably never come here again.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Pleasantly surprised. I am one of those weird ones that wants sushi for breakfast on Sunday's. Sunday's are one of the hard days to find a good sushi place open for lunch. Sushi raw was open when my all other regular's were closed. \n\nThey have great lunch special prices. For every $15 you spend you get cool items for $1-2 like oysters or beer or nigiri. \n\nThey had O-Toro and Live scallop. \n\nI will be back :)", "author": "Andrey P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "It seems I have judged this place too soon, I wrote my first review on my very first visit and seem to become more disappointed every following visit.", "author": "Sapna S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "I've ordered delivery from here since it's couple blocks away, really good sushi rolls I love the ones they have like the four seasons roll it's amaze balls try it you won't regret it.  Went in for pickup really nice place to dine in as well.", "author": "Nirea S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-26", "description": "I wish I could love this place, it's so convenient, but alas.\n\nNot great quality fish, definitely frozen. Service isn't great. Meh.", "author": "Kari G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-03", "description": "Sushi rolls looked tasty, but I ended up going with a Bento box and was not disappointed! \n\nMy friend and I both agreed that the 9.95 Bento was a steal, it was delicious and presented beautifully. My chicken teriyaki was perfectly cooked, the tempura was good as always and with soup, salad, a few mystery sushi bites and my $3 sake I left full AND happy. \n\nOur server was pleasant and helpful, although we did wait a bit for the check. \n\nGreat location, right off the L line, windows all around. I'll be back!", "author": "Alyssa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Okay, so here's the deal, this is the best sushi you will ever have delivered to your house.  Period.  I have yet to ever eat better delivery sushi.  \n\nI crave sushi, A LOT.  And its not always a good time to be going out.  So I call sushi raw.  And I am always satisfied.  \n\nNow, is this the best sushi you will eat in your life?  Is it particularly special?  No.  But it tastes damn good, it comes to my door and if you spend $25 you get a free California roll.\n\nEnough said.", "author": "Justine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-08", "description": "Decent rolls and sake, perfect after having a few drinks at nearby bars.  The waru was very good!", "author": "Kate Marie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-24", "description": "came around 8pm on a sunday, not too busy and parked a block away. interior was smaller than I thought it would be but it was nice and cozy.\n\nwe ordered\nspicy tuna roll- basic but good\ntonkatsu rice plate- meh, kinda dry\ntaraval street roll- this i actually liked, maybe it was the cilantro but i enjoyed this one\nhamachi kama- it was smushy....wasn't soft and melting...but smushy, and bf didnt like their sauce.\nchirashi- decent\n\noverall very meh, service was good though, the waitress was quick with refilling and taking away our plates.", "author": "Christine M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-07", "description": "ehhhhh.... this place was pretty decent... but man, the customer service was so sucky!! i swear they almost forgot to take our order. and finally after about 20 mins, the girl realized our entire group was staring at her. cool thing are the specials. if you spend $15, you can choose a special priced item off the specials menu. anyway, i'd rather go elsewhere for better service and better sushi.", "author": "Ann T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-03", "description": "OK, second time around we came in with out nifty yelp coupon. And while the sushi was ok we were sooooo turned off by the \"four seasons roll\" having so much mayo that we had to send it back (we NEVER send food back). They were nice enough to give us another roll and take the previous off the bill. But i gotta say it left a \"MEH\" taste in my mouth for now..", "author": "Michelle I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "We actually seen them on grubhub.com and ordered them for delievery I was a little worried, I mean Sushi for delievery? But we tried and we have did it 3 times since then! Amazing fresh and never ever had to wait longer tthen they said fro delievery. \n\nWere a fan, not we just need to GO THERE one time and try it :)", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "Sushi Raw is always a great idea if you want quick and delicious Japanese food, and they deliver pretty late! They have a good amount of vegetarian options and specialty vegetarian rolls. I almost always get the bento box special- it comes with good amount of food for only $14.99. Their tofu teriyaki is pretty good, and their avocado roll is the best I've ever tried. It is so fresh and tastes AMAZING!", "author": "Rebecca H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "Decent sushi at a decent price. Isn't that what we all are looking for! Oh, it is just me?   Sushi Raw did the trick for me. They had good quality sushi and the portions were good for the price. The service was pretty good in my opinion, my glass was always full and they checked in periodically. \n\nThe only problem I had was the location, just because it made it a little difficult to find parking if you were not lucky. But in a time where mediocre sushi is being sold at the price of gold, I will hunt out a parking spot in order to return to this gem.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-15", "description": "Apparently this restaurant closes at 2:45, not 3:00pm as stated in their information. If this is the case, you might want to turn off your neon sign outside that also indicates you are open for business. We went inside and we're only planning on getting one sushi roll with edamame for a quick bite but they turned us away. Well, you lost a customer before you even had one. Now we're eating across the street at the Vietnamese restaurant and the food is great!", "author": "Anon A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "Never really ordered sushi for delivery!\n\nI'm not feeling well and hungry on a Friday night.  I have not idea which restaurants around my neighborhood delivers.  I did a search and came across grubhub.com.  Pretty cool site.  You enter your addy and it give you a list of restaurants that deliver.  I random choose Sushi Raw.\n\nI ordered a House Ramen, Dragon Roll, and Salmon Sashimi.  Some how I got an extra roll of some sort, like Calif. Roll or something (I had no idea).  Nice huh!!  :)\n\nAny how, it wasn't bad.  Delivery arrived earlier than quoted time and thats a plus.\n\nI would probably dine in next time to really taste a lot of there items on the menu.  Sushi is always better when you dine in.", "author": "Jessica P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-19", "description": "For this place we have been going for years and normally they would deserve 4 stars but today really made me completely change my mind (completely).  This evening we ordered online for pickup and was impressed by how quick my order had been completed.  Another reason is they are not busy at all and after my interaction with them today it explains everything.  When I got home we noticed that we are missing an item from our order.  I quickly called them and they kept speaking Chinese and said it is in the other box but nothing in the two boxes had unagi.  They kept speaking Chinese and even said come back and get it then (very rude).  In the background as I was talking to the person on the phone she kept asking the person in Chinese what can we do and they said it is in the box.  How hard is it to just credit my card and they just don't want to do so...worst customer service ever.  If the sushi or rolls was a bit better maybe I will give them an extra star but it wasn't...quality has been going downhill.", "author": "Philip W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-02", "description": "Service is good. Been here a few times. On to the recommendations:\n\nThe lunch special: Sashimi combo is my safe bet. There's always 3 pieces of Salmon, usually 3 pieces of Tuna, and if lucky you get 3 peices of Hamachi. Other times I have gotten what looked and tasted like Albacore and it was good too. It's 9 pieces total.\n\nWhat I did not care for much was the ramen and the bento box. Both were very ordinary and nothing to rave about. If you crave ramen, go to Japantown. And most places will have better bento box with larger portions and better tasting mackerel. \n\nI'm giving 4 stars because the fish is fresh and better than the other Japanese restaurants near my house. I'm glad Sushi Raw replaced what was once a Taqueria, and before that, it was an American Breakfast/lunch joint similar to Denny's.", "author": "Daniel W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-08", "description": "Typical Chinese run Sushi joint. There's a certain characteristic with this type, and it is the opposite of authenticity, and quality. This is not to say this place severely lacks in these two areas, but if you ever had good sushi from a Japanese owned bar, you will note differences.\n\nI love Chinese food, when it is prepared by Chinese. I love Japanese food, when it is prepared Japanese. This place (turning into a chain) is run by Chinese, and as such lacks the skill in rolling sushi (there's no demand to roll it perfect), specialty rolls are drenched in heavy sauces that masks the level of freshness of the fish, and mediocre quality sliced sashimi.  We ordered a variety of rolls, sashimi, hamachi kama, and their ramen to give a thorough test-run.\n\nRolls were not neatly rolled, and contained too much rice. Nothing special about any of them.\n\nSashimi selection were maguro, sake, and yellow tail. My issue was the maguro, as it was veiny, and therefore chewy. Sake was good, as was the yellow tail.\n\nHamachi kama were small, and lacked the tender freshness that I come to expect after having it so often. Later, I saw the sushi chef repack what looked to be frozen hamachi kama. Could be, or not, but it would explain why it was just okay.\n\nThe ramen. After being spoiled by Santa Ramen, and Ramen Dojo, I thought I'd have difficult time liking any other restaurant's ramen. This one just plain sucked. Broth was too sweet, ramen too soft, and the pork was just meh.\n\nThis leads me to my low expectations, and general disdain for these types of restaurants. Japanese cuisine itself commands a higher premium in cost, and therefore a higher profit margin. I just feel that Sushi Raw, and others like it are serving sushi to make the money. There is no inherent art form to sushi prep, ramen, and insistence for fresh fish. Service by the two Chinese waitresses uttering a few Japanese phrases were okay, but not great service. We decided not to come back again, and would rather walk up a block to Shi Mo for the real deal. It costs a little more, but is well worth it. \n\nIf you are the buffet-loving type, you may give this a 4 star, since high quality isn't in your expectations. I give this place a 2.5, as the food was just meh, service was okay, and ambiance was nice, but trendy.", "author": "Bor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Stopped in late after a concert... Wow! Great decision. Food was so fresh and so tasty. Excellent sushi! And the house sake was amazing!", "author": "Amie F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "we've been driving by this place for a while..I love the face that they're open late!, all sushi should be open late ya know? My boyfriend picked me up from work and took me out to sushi. \nWe ordered four rolls, a bit expensive of course but they were pretty fresh and yummy.\nEdemame was good and so was the miso. I don't like that face that they stand near you and stare, a little disturbing.\ni'm definitely pickin this place for late night.", "author": "Lana K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-27", "description": "Sushi Raw landed a good location since a lot of people travel on 19th Avenue but on the flip side, parking can be terrible for patrons.\n\nThere is nothing that really stood out to me about Sushi Raw.  The fish didn't taste fresh but it was decent.  One thing that I've been starting to appreciate is nicely cooked Japanese rice.  This place didn't have that.  The rice was a tad hard but edible. But hey, that's just my palate being picky.  The hamachi kama was a generous sized portion with lots of moist meat.  I think this was probably my favorite item that was ordered.\n\nIt's always good to try something new since you never know when you might find your next favorite joint.  It was good to try Sushi Raw but it did not leave that warm and fuzzy feeling inside that says \"I can't wait to go back again.\"", "author": "Suzi K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-18", "description": "I came to Sushi Raw for the first time when a former roomie of mine wanted to meet up here. I was skeptical at first, because the sushi selection on Taraval is not the most stellar... but she insisted that we go, and she was right!\n\nI've been here a couple of times since then, and it's been consistently good. I've only had the rolls, and I recommend the Lion King Roll, Lover's Roll, and Four Seasons Roll. The waitresses have always been nice as well, quick to refill the tea or water and check in once in a while.", "author": "Min H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "This place has definitely changed over the last year. Whether new ownership or supply, not sure, but it is my new go-to spot. The fish is very fresh,and it's never too crowded. The seafood salad is delicious (they do it like no one else), spicy scallop role and Romeo & Juliet are my faves.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Sushi was okay, but fish were all really fresh, and good service always gets me; even though they forgot my chirashi. they made my parents happy :]\n\ngreen tea cheese cake *heart*", "author": "kim w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-26", "description": "It turns out that this place JUST opened up so I decided to try it since I was in the area. First off, the windows are covered in a black film that makes it nearly impossible to see inside. Don't go staring into it because everyone on the inside can clearly see you. \n\nThe restaurant has a modern theme and music to fit a lounge-like ambiance. I thought the food was about average-price for a Japanese restaurant and the service was pretty good; the waitresses - very nice.\n\nI think the 3 selection bento boxes are worth $13.95 since there are over ten choices to choose from. The beef, beef short ribs, and sushi are all good. The tempura batter is one of the best in my opinion, I like my tempura cooked where the fried parts are flaky not the ones that are jagged and hurt when you take a bite into it. The bass was alright, I personally wouldn't order it again. The rolls are a little more expensive (around $10 each) so I didn't order any, but the next time I come, I'll try some of those.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-25", "description": "The worst service!! Our menus were tossed at us, with no hello. It was nowhere near closing, so I'm not sure why we were being treated as an inconvenience. This is the first \"bad\" review I've given, and it's because I feel that strongly about their poor behavior! The guy had a chip on his shoulder and made us feel uncomfortable the entire time. I will never return and I highly suggest going to another sushi spot. Their sushi is fine (defintley had better) but not at all worth the horrible service!", "author": "Mandy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-17", "description": "Ok, so I guess its only fair that I give a separate review on the service and on the food.\n\nMy girlfriends and I  had origianlly planned on going to Okazuya which was right down the street, but decided to go to Sushi Raw instead to check out the new opening. I was starving and was happy that we were immediately seated and the waitress took our order right away.\n\nWe ordered the tuna poki, which was delicious, but tuna poki is kind of hard to screw up. The hamachi kama came out next, the sauce was amazing. Our first two dishes came out in a very timely manner, however, everything else took ridiculously long. We had to wait an hour before the waitress came out with our seaweed salad. YES, AN HOUR! Seaweed salad comes already made!! All they had to do was put it on a place and bring it to our table!! Absolutely inexcuseable! When I asked the waitress about our orders, she ran to the back and checked. She came back and apologized and told us that the rest of our food would have a high priority with the chef. She was very nice and apologized many times for the mistake.\n\nAlthough the food was very good (not OUTSTANDING, but still, very good) and the service would have been excellent if it wasnt for our server's error, I have to give it 2 stars because bad service at a restaurant is one of my biggest pet peeves. \n\nTo be honest, I was iffy about whether or not Sushi Raw deserved a 2 or 3 star rating, but I decided to go with 2 starts because \"Meh. I've experienced better.\" better suits my review.", "author": "Linh P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-29", "description": "This place is ok. I came here the first time because I was excited to see a sushi restaurant on my way to Serramonte so I made a mental note to come by. \n\nI like rolls and the rolls that I got the first time I was here were the Four Season and Hot Summer Roll. Both were delicious. If they were only a few bucks cheaper, I'd probably come here for them more often. $12.99 for a roll... questionable... VERY questionable! \n\nI've come here for a few follow up visits. Service has been ok. Sitting at the bar gets you the attention you need... otherwise, start waving those arms constantly. Their lunch menu is much cheaper and it's not a bad deal. \n\nI'll come back when I have a craving for either the Four Season or the Hot Summer Roll but the other reviews from Yelp make me really question anything else.", "author": "Jeannie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-27", "description": "The sushi is not mind-blowing. But the service is decent and their delivery is quite fast. It's good when you're in a pinch and wanting some sushi late at night.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-26", "description": "This place is great! The rolls and sashimi are wonderful. The four seasons is definitely a great roll. It's taste amazing and the plating is beautifully done. I've recommended and taken people here before and they've all loved it. Must try at least once.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-27", "description": "Sushi is great! And they have great deals. The service is horrible! 4 people in your restaurant and it takes me 20 minutes to place an order. Tisk tisk", "author": "Oliver K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "Love this place .. Been going to there original place in San Bruno. Love the food and good fair price", "author": "Scott L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-17", "description": "We came on a Sunday night and the place was packed. This joint is new modern cozy and getting more popular every week. Being packed, the service was overwhelmed and we had to wait more than usual for our food. \n\nAt first glance I thought the prices were cheap but I changed my mind when I realized the portions are very small. So for 3 rolls, 1 sushi order and 2 beers we paid 46 dollars. Not bad but not cheap.\n\nWhat we ordered, Spicy Salmon roll good 4.95 very small portion. Shrimp tempura roll was small too and very yummy, The avocado and fried shrimp go great together. \n\nThe most unique item was the red tuna sushi. The sushi is flame kissed so that it kills the fresh fishy flavor and gives it a very unque taste.\n\nThe best was last, the four seasons special roll. The presentation on this roll was high class and original. The special sauce was the perfect ying yang balance of spicy sweet flavors. The mix of crab, fish, and eel balanced the roll into a hearty dish. This special roll was $12 and definitaly a must have.", "author": "R J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-31", "description": "Came here with my boyfriend for dinner. The service here was great and the food here is pretty good too.\n\nWe had the Lovers Roll, Rainbow Roll, Salmon Skin Roll and Saba Nigiri. The quality of the fish here are really good, so this place being pricier than other japanese restaurant is totally understandable. I think my favorite roll was the Lovers Roll, because the spicy tuna was actually spicy (some places only makes it a lil spicy). The rainbow roll was really good too because the fish was really fresh. Salmon Skin Roll was a bit too bland... and normally other places leave a lil bit of salmon meat so you can taste the salmon, but there wasnt any for this one.\n\nThis place is good, but four stars because my boyfriend can make the same thing and it will taste the same.", "author": "Alicia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-19", "description": "Just like the review. Meh.. I've experienced better. The prices wasn't bad, but that's as far as it went.", "author": "Tommy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I went for dinner and they had some specials where you get discounted items for spending a certain amount. We decided to try the live scallop and it was fresh but quite expensive. The quality was great and ambiance was nice. Staff was attentive and made sure to take away plates when approporate and fill our tea. I would definately come back", "author": "Shirley Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-20", "description": "I give them 3.5 stars. I think this place might stick around for a while. Everything that opens in thus location seems to fail, like the spot is cursed. This is the second sushi raw location I've been to now and I like both of them. The fish boat we ordered was big and good variety. The four seasons roll is the best there. The atmosphere is really nice at this location and the one on lower Haight. I will come back.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "The problem with many a mid-level sushi spot...\nCONSISTENCY.\nI went to this location once when they first opened.  V e r y  mediocre.\nThen, Yelp had the $20 for $40 deal.\nBeen sitting on that deal for almost a year.\nStopped in today.  Had one of the most pleasantly surprising meals in a long time!\nHad:\nThe 'live' uni.  Couldn't be better.  Sweet, creamy, briny, nutty ambrosia.\n7 pc. maguro.  I was  a l m o s t  floored by the quality.  Deep, rich red.  Almost perfect firmness and elasticity.  It was very fresh, and a quality cut.\nOne order ikura nigiri.  High quality also.  the roe were bright, full, crisp, and not salty.\nThe 'live' ama ebi.  Honestly, I was hoping more for the deep fried shrimp heads, which arrived with the tobiko-topped nigiri.  Only downside to this was the tempura dashi, which was weak and served sans daikon.\nIronically enough, worst part of the meal was bowl of rice I had with the maguro and shrimp heads.  It was sitting in the cooker too long.  (i still cleaned my bowl)\nA three-star overall rating...  but on this visit, at least for this guy,  five-stars all the way live!", "author": "Barry A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Sooooooo bomb. Not only is their decor on point but the sushi is amazing ! Get the lion king roll! You'll die of how great it is! Didn't wait that long for my food either. Servers are straight to the point too ! Love that !", "author": "Gabriella R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-31", "description": "It is very nice when the delivery service is exceptional so a rating can be placed just on the food.\nMy Ramen arrived hot, 4 stars for that alone.\nI had Tonkatsu Ramen. For those of you that know ramen, YES, they serve the broth separately from the noodle and veg when delivering. The broth is creamy with some pork flavour but not overwhelming. I only had to add a touch of soy sauce. The ramen are tender, buttery and fresh. The tonkatsu was very good and crispy. A tad oily for me on normal occasion but perfect once blended with broth.\nI also had the Texas Roll. I liked this roll. I am not a fan of sweet sauces and the sauce on the roll was a bit sweet for my tastes. My only other issue was the beef was not as rare as I would have liked it. Overall however, the flavours are well matched and I think you will enjoy this roll if you like beef and avocado together with a semi-sweet glaze that was not drowning the roll.\nI will definitely order from Sushi Raw again.", "author": "emma g."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-12", "description": "Sushi is ok nothing spectacular.  They offer the typical sushi varieties including maguro and salmon.  You do sometimes find some varieties like toro.  This restaurant is very similar to KiKi Sushi and Kitaro Sushi.  Also the restaurant can be pretty loud on the weekends.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-15", "description": "This was the worst customer service I've ever experienced, but it wasn't entirely the waitresses fault. The food would have been mediocre if it had been brought out on time. The restaurant was staffed with one non-English speaking waitress per 50 fuming customers. Do. Not. Go. Here.", "author": "Henry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "I've eaten here several times now and they have not disappointed me (only when they are out of uni).\n\nThe price is reasonable for sushi - the quality is fresh.\n\nThe food is ok - I could do with just the sushi and be happy.  \n\nsome items that are good are:\n\nUni - the sea urchin has always been fresh!  These delicately sweet, yet taste of the ocean are pure yumminess!\n\nAmaebi - these sweet shrimp served nigiri style comes with crunchy tempura battered head and dipping sauce to make complete!\n\nTaraval Roll - the sweetness of the mango gives this typical shrimp tempura and imitation crab meat and eel roll a lift.\n\nIsland Roll - tuna, salmon, yellow tail wrapped in cucumber is a very refreshing take on sushi\n\nLobster roll - a lobster salad with mango wrapped with cucumber \n\nEclipse Roll - a spicy tuna roll deep fried with cream cheese.  Beautifully presented to you in an arch with tasty artistically plated sauce\n\nIf you're in the mood for just sushi - this is the place to go to get your fill!", "author": "JJAMZ C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-30", "description": "I wasn't in charge of ordering, so I can't give you the full rundown of everything that we had. Items I do remember:\n\n-Edamame (Normal edamame--it's hard to screw up edamame after all)\n-Grilled lamb chop with house sauce (Didn't have any; I don't eat lamb)\n-Agedashi tofu (Not bad, not the best)\n-Grilled whole squid (I like the dipping sauces that come with it)\n-Tuna poki (Really good, tuna was fresh)\n-Sake sashimi (My fave!)\n-Red dragon roll (Not memorable)\n-Lion king roll (Not as good as Sushi House's)\n-Lover's roll (Not memorable)\n-Hot summer roll (The only thing I remember is that it was spicy)\n-Fresh uni (No offense, but it was like licking the sea floor, guh-ross! Not my thing!)\n-Amaebi \n-Warm sake (Good for washing out the taste of uni)\n\nThe best was definitely the sake sashimi though our second plate was a bit frostbitten, which means it's fresh, right? Yes, service is on the slow side, but we ordered a lot of food and the place was pretty packed, so it was expected.\n\nOh yeah, they accidentally gave us this random roll, we ate it all before we realized it, and the waitresses never figured it out. Oops, sorry to whoever didn't get their roll!", "author": "Audrey T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "the Prince of Taiwan's caravan has passed by this place many a times driving down 19th Ave. but i have never bothered to go inside, thinking it was just another unauthentic Japanese joint in the Sunset Area run by Chinese folk who don't know the difference between a fatty tuna and a fatty date. (Here's a hint..only one tastes good...)\n\nMy father, the King of Taiwan, decided to take the troupe here on a banging Sunday night to taste their flavors, and at first I was hesitant, but since he was paying, I thought o why not. Boy am I glad that I was wrong about this place. They are still a Chinese run operation, but these Chinese at least know what they were doing, and the food i had tonight was truly a solid, memorable experience that will have me going back for more in the near future.\n\nGreat bits:\n\nThe fresh small oysters had a great tangy, not -too -briny taste\nthe sashimi was pretty good and not tired.\nthe beef udon was really good- their broth is pretty killer.\nthe grilled lab chops were surprisingly good as well.", "author": "Jerry C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-08", "description": "First of all, this location/place has changed businesses 3x in the past 2 years. Makes me unsure if Sushi Raw will be here much longer either after my experience...\n\nThe decision - My wife and I had vowed to continue to goto our favorite neighborhood sushi place further down the street on Taraval but this past weekend we decided to order some sushi for delivery from Sushi Raw. It was raining and we were pooped out from a long weekend of snowboarding in Tahoe. We had received a flyer in our mailbox for some specials and free delivery since we live very close so we went for it.\n\nThe order experience - I'm a big fan of technology so I went to order online, but their online menu/ordering system is painfully slow. I could have gone to the store and made my own sushi faster than ordering online. Don't do it. We decided to call in and order and pay with CC over the phone. It took my wife about 10 minutes to get the order correct, relay our CC info, and give them our address. That wasn't comforting and I wouldn't have been surprised if they got something wrong w/ the order. They quoted us 45 minutes on a Sunday night at 7:30pm for delivery. I felt that was a bit long especially since I could throw a rock and hit the place, plus I've never seen this place full/extremely busy whenever I walk by.\n\n45 minutes came and went. I was about to call and check then there was a knock at the door, 60 minutes after placing the order. Seemed a bit long, and if that kind of time has any relation to the time it would take if we were dining in, then I will never go back.\n\nThe food - We ordered the following; Red Dragon Roll, Shrimp Tempura Roll, Lobster Roll, Tempura Appetizer, and received a free Spicy Tuna Roll. The Tempura was good, not great, and it definitely didn't help that it probably sat for several minutes getting soggy before it was sent out for delivery. The Red Dragon, Shrimp Tempura and Spicy Tuna rolls were okay, not the best I've ever had. The Lobster Roll was okay, mango and lobster don't really go together, and the cucumber wrap was so-so.  Overall the rolls were tiny, and definitely not worth the price in my opinion. Our order was over $40 for 3 rolls and an app w/ an hour wait.\n\nThe vote - I definitely won't be going back unless all my other choices for sushi are closed.  I would recommend going to get sushi from the happy people down the street at Sushi Zen if you live in the area.", "author": "Ryan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-15", "description": "Left this place feeling a bit unsatisfied. Service was nice enough, but I definitely agree it's somewhat slow and hard to get the attention of the waitstaff. Plus we waited ages for the check (partly because our plates were removed so swiftly we would have had to call after her to ask for it). The food itself was pretty delicious, and we thought it was evenly priced with other sushi places in the city, but... turned out the rolls usually had six instead of the more standard eight pieces - not all of them, but most of them. So we would have ended up ordering more rolls than we normally would - but instead we went somewhere else afterward.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-03", "description": "Great! The Menu was easy to read, good sake selection, and good pictures. \n Nice cozy atmosphere and attentive service. \n\n I had the chef choice Sashimi. It was excellent, probably the freshest sushi i have had in the area. The Spicy Tuna roll was good and all the Nigiri that i tried was also delicious. \n\n It was a little pricey, but i suppose i expect sushi to be pricey. \n\nAll and all a great place to eat.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "We had been here before it became Sushi Raw and was a little Mexican/Hawaii restaurant, and we were interested to see what type of change the place went under.\n\nUpon entering we were instantly impressed. The location has always been very small, but they made the space look larger than it is and not at all crowded as it felt before. The decor is also nice and neat, while the best aspect is that, despite waiters and cooks being so close, you never feel like you are constantly \"under their watching eye\" while eating.\n\nAs for the food itself, it was good. We came quite hungry, so ordered a California roll and a bento special (tempura, chicken katsu and avocado rolls). The California rolls were good, although we were slightly disappointed that there wasn't eight as there was in the other sushi plates on that page. The tempura was very good. It had been awhile since we last had it, and were both impressed... in fact it kind of stole the show.\n\nAll in all, we were sold. The only drawback for us were the prices, which may or may not keep us from coming back. It wasn't expensive, to be clear, but there are cheaper sushi alternatives all through out SF. Still, we would be open to coming again someday.", "author": "Sami R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-14", "description": "Four Seasons Roll is really good, the rest is forgetable. It hits the spot but I have had way better.", "author": "David N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-09", "description": "The food and the service were outstanding. Regarding the food, the flavor, texture, and presentation of each piece of nigiri, sashimi, and roll that we had were all deliciously beautiful.\n\nThe service was spot-on --- not compulsively attentive, but we were never in want for anything. This is a gem of the Sunset.", "author": "E. F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "Good food, decent price.\n\nThe server recommended some good dishes.  Came in with a group of friends and we got a bit drunk and loud and they were real nice about it.\n\nThe sake that we had was cheap and good.  No hangover the next day! woohoo!", "author": "AhLin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "I noticed that a new sushi restaurant opened up on Taraval last Friday, so my friends and I ate lunch here the following day.  Because it was new, the whole place still smelled like the finishing they paint on wood to protect it.  After we were seated and got our menus, they gave us some complimentary edamane and miso soup.  \n\nI ordered the chicken teriyaki entree/bento box for $9.95.  It came with chicken teriyaki, tempura, and 3 pieces of sushi along with rice and a bowl of salad on the side. I thought the chicken teriyaki was great - very tender and juicy as well as flavorful.  Also, the sushi tasted very fresh, it was good quality salmon, tuna, and yellowtail.  The service was responsive and I thought my meal was a good value for the quality of the food.  \n\nMy friends ordered a spicy tuna roll and tempura udon, a salmon teriyaki entree/bento, and a 49ers roll.  I got to try a piece of the spicy tuna, and it was very good.  The tempura udon was a big bowl of udon and soup, but it didn't look very appealing because it was just noodles and soup with tempura on the side.  I think they need to add some veggies or fishcake in the udon to make it more appetizing.  The 49ers roll was 8 pieces of salmon over avocado and tobiko, but the pieces were tiny.  I didn't think it was a good deal since the roll was $9.95. \n\nMy conclusion is that the sushi is fresh and really good here, but some rolls are overpriced.  I'll probably stick with the entree/bento boxes.  Keep in mind that if you order the bento box option from the entrees menu page, it may save you a few dollars over ordering it from the bento box page.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-13", "description": "After the whole 24 hr Fitness Pacdebacle, my homie treated me out here \n\nPretty decent Japanese joint that has replaced the many restaurants near Seniores. I hope this one sticks through. This is one of the only late night sushi places around. Also this is one of the few healthy late night options.\n\nThe sushi here is decent. A bit overpriced (I'd opt to go Shimo or Okazu Ya since one has bigger cuts for the same price while the other is cheaper), but hell, its open late... \n\nThe tuna rolls were pretty normal, but good. The fish was of good quality and the rice texture was decent. Looking at the fish in the display, those were of also good quality. My gripe is on the price of their fish, which is kind of expensive for what you're getting \n\nI ordered the Salmon Teriyaki rice plate while my friend ordered the Saba Shioyaki. Both are pretty much grilled fish with some rice, salad and miso.\n\nThe miso was your standard miso soup... didn't have any green onions which was sad for me, but it tasted pretty normal. Nothing amazing, but then again I've never had amazing miso soup.\n\nThe salad was whatever. Didn't care so much for the dressing on it. Tasted almost like an Italian dressing or something\n\nThe salmon and saba portions were perfect for a post work out meal or just for any person who's trying to eat right. They both were grilled nicely and lightly seasoned. The saba also did not have as fishy a flavor as other saba that I've tried, which gets plus points in my book.\n\nThe rice is also of perfect portion control.  We opted for the sushi rice because it tastes better.\n\nOverall this place is ok. A bit overpriced for what you're getting but its an awesome late night spot to eat at for  the health conscious plus the portion control is good. I only wish they had brown rice. Since it is a healthy late night spot, I'll probably come back. However, there are better options for sushi around town if you're looking for lunch/dinner", "author": "Marc T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-27", "description": "I was so surprised to see how much the place has changed since the taqueria and even the hawaiian bbq days... It's got a great ambience inside, classy and clean. Charles was the sushi chef and not only was he very knowledgeable, but very skilled! The entire staff was very welcoming and attentive. \n\nI'll be going back for sure!!!!!", "author": "B K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-30", "description": "I was quoted that delivery would be an hour cuz they had a ton of orders to fill. They came in about 30 mins. A plus in my book.\n\nMaybe I ordered the wrong rolls but I wasn't happy with any of them. They left out one of my orders and we tried like 10 times calling them but no one picked up. When we did get a hold of someone she didn't apologize for our missing order. She just asked if we wanted credit or for them to redeliver it. We asked for it to be redelivered and she said that we would get it when they had time. \n\nWhen I ordered sesame chicken, I was thinking of the one at Sanraku. It was nothing like that. It was breaded chicken pieces. There was a cup of spicy sauce with sesame seeds on top. Eh....it was ok.\n\nI must say that the cod is delish! Although small in size (open palm size) it was very tasty. I think it was $7 or $9.\n\nWill give them one more chance.", "author": "? ?."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-03", "description": "They hired my friend as a waiter and didn't even pay her for training. So she served her own tables on her own and didn't get paid tips either. Is that even legal? That just goes to show the management is hella shady. And Sushi tastes like paper. If you wsntegood Japanese food go elsewhere. This chain, especially this location is a joke.", "author": "Ross D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-28", "description": "Sushi is not the best but not the worst. One of the rolls I ordered i asked for no tobiko and it was covered in it. Than when taking a plate away they knocked a whole glass of water on me and didn't offer a discount or free dessert or anything, just a quick apology.", "author": "Jesse D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-25", "description": "Many a time I have driven up 19th Ave, rushing out to the freeway or rushing back home from the freeway, and passed this place by.  19th Ave is just a thoroughfare not really a commercial street so Sushi Raw is a bit of an anomaly. It's also close to my home so on my most recent birthday I decided to try this place out, you know eat local and whatnot.  In a nutshell, I was very pleasantly surprised by this local business. The ambiance immediately drew me in. It's got a warm sort of glow to it, the wood theme gives it a mellow vibe but with a clean Japanese aesthetic. The menu then really won me over when I saw the selection of ramen!! A sushi place which also offers ramen yay! happy dance happy dance! And not just one or two different types of ramen, but several. And boy was it good! I ended up having one special roll and ramen and it hit the spot just right. The ramen portion is also quite generous so you could share it with someone or take the rest home for another meal. AND the service was good too. What more can be said?", "author": "Andrea A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-26", "description": "This place is an \"A-OK\" in my book.  Been here a number of times with my aunt and cousins.  It's tricky to find a place with decent sushi options and cooked meat options (because my aunt doesn't eat fish) for a decent price.  I can't say it's the first place I think of for a raw fish craving, but it's good enough as a compromise.\n\nI've had the chirashi and their rolls, and they are all quite good.  My aunt really likes their multi-item bento, which allows her to taste multiple entrees/meats for a very reasonable price.  The one thing I wouldn't order again is their grilled squid.  It looks amazing in the picture, but is rather dry and rubbery in the version that comes to your table.", "author": "Fontane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "amazing fresh cheap sushi, and everyone is always really nice who works there. the atmosphere is calm and cozy, love this place!", "author": "Chelsea V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "Great place. I used to live a few blocks away from this place but I had never gotten a chance to try it. Came here with a friend, we attempted to go to Sushi Bistro but that was an epic fail due to no parking. Anyways, I had a Spicy Dragon Roll. It was great! Very tasty. The cool thing about this place is the fact that they have a special menu. Every $15 that you spend , you get to select something off  their special menu which consists of $1 oysters and $2 Saki... their oysters were amazing by the way. Extremely fresh, very delicious. I would return here for sure.", "author": "Mariangeles C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "Sashimi is fresh enough but definitely a tad overpriced.   I suppose the food is \"authentic\" in being Japanese by being teeny tiny and cute...  ?!\n\nHurray for the one parking spot in front that somehow doesn't have a meter.", "author": "Tokki M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-02", "description": "Not really impressed. Prices were kind of high and the sushi wasn't anything to write home about. I think I spent like $10 on a lunch special, which I guess is standard, except that the sushi they give you for that price is pretty boring/plain -- California roll type stuff. If you want to eat anything that actually swam in the sea at one point, you've got to fork out even more, and to be honest, it's just not worth it here. \n\nNice decor though.", "author": "Ty B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-15", "description": "I was hungry, tired, and lazy so decided to order food to pick up. I always passed by sushi raw but never ate there. Decided to try it out and ordered a red dragon roll and the bento box with beef, shrimp tempura, and salmon . It was expensive ..$34 but I was looking forward to eating it since the place looks so nice on the outside ! However, when I got home the food looked like I could have gotten it from Safeway.. Or even worse. The red dragon roll and ca roll they added looked old and not appetizing at all. The taste was worse than that. It was horrible. I feel like If I continued eating it, id get food poisoning . The salmon from the bento box was dry. The beef was gross! I only ate a bite of that. The shrimp tempura was decent. The miso soup was the only thing that kept me somewhat satisfied.  This place was really horrible ... And for someone who is not picky at all about food or any sushi and who was starving.. That means a lot. First time eating here and this will be my last. Waste of $34 .", "author": "Samantha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "I came here with a friend not to long ago. He had been there before n had suggested it. So figured why not. I wanted to try something different although I wasnt too adventerous....I still managed a new roll to try. The Texas roll. Can I honestly say holy cow!! Sushi wrapped in thinly sliced meat. It was so surprisingly good I ate mine faster than my friend did with his own meal. Def going back. Staff was friendly n location was convenient.", "author": "Monica D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-10", "description": "On tuesday July 5th Damon F. and William C. went to sushi raw. We had just finished working out at the gym and were craving japanese food. When we ordered the sushi, the meat did not look fresh. The lobster roll was nothing special either as the waiter suggested. The price was also more expensive then we anticipated for 3 rolls of sushi.The fuji Mountain roll was actually enjoyable. All in all, like the movie with paris with love, when you are seeking food (or thrill) it fills your needs, but if you were to have an enjoyable dinner, I would suggest you seek elsewhere.", "author": "Casey N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-09", "description": "I like it RAW.\n\n\"SUSHI RAW\" that is..\n\nLet me go on yelp, ah and it's true, Sushi Raw is OPEN for business and opened til 12am for a Sunday. I'm use to going to the larger one on Mission St.  That's what she said!! (harhar) From the outside it looks big, but once you walk in, there is a small sushi bar tucked straight ahead chairs and bench/booth along the side of the walls.  \n\nWe ordered all 3 specials they had:  \n\n1 - raw scallop - thinly sliced scallop with lemon wedges in between with a side of deep-fried (something). yum.\n2 - fresh oyster (2 pieces per order) - small but fresh. i guess size doesn't matter in this case.\n3 - ahi (2 pieces per order) - cream on the inside/clean on the outside :p\n\nWe also ordered a spider roll and the famous 4 seasons roll.  Both looked good and tasted good.  The only gripe I have with the 4 seasons roll is that they use immitation crab meat. wtf?!\n\nAlso, very cramped bathroom in the back; 2 doors 1 to the front (woman) and 1 to the side (man).  Too bad there were no LED tvs and no special menu board. And boo for no alcohol after 10pm.\n\nPlus stars for our servers!\n\nbtw: be careful of scaffolding.", "author": "Elliot Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "I came there with my boyfriend this week.I  found the place was nice and the service was very good. However, one thing I don't like was that the Udon soup had a lot of MSG, so after my boyfriend and I went home, both of us felt so thirsty.\nOther dishes looked nice and delicious.", "author": "Olive S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-20", "description": "worst japanese food experience ever.\n\ni came here for udon on a cold night and wished to get some hot soupy udon. but they didn't have the bowl for my udon (and the place was barely filled with people), when my udon finally arrived after a 40 min wait (ridiculous), it tasted like hot salt water to me. there's not very much stuff in the udon and broth was salty beyond belief. \n\nmy friend also got their ramen, but they didn't have 2 out of all 3 meats for the ramen my friends wanted to order. how sad.\n\nfor a restaurant to run out of meat and bowls while not having nearly enough people to occupy 1/3 of the restaurant, this is just sad", "author": "Joyce C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-11", "description": "09.09.12 with 1 other\n\nWe ordered three rolls.. the lion king roll, four seasons roll and the walnut prawn roll. all of the food was very well made. i recommend them all.\nalso for every $15 you spend, you can get a cheap deal.. like a hand roll for $1 \n\nthe rolls were on the pricey side around $11-$13 a roll\nbut last year i bought a Yelp deal $20 for $40 worth of food, so of course we had to take advantage of the deal before it was expired. \n\nexcellent service at this location. the staff were all very friendly and attentive.\n\na great expeience for my first time here, if i am in the area and craving sushi i would go back.", "author": "Jay R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-11", "description": "Small portions and expensive! Did not tell us the price on recommendations. $22 for five pieces of UNI?? Fresh but not worth $22!!\nVery slow service. Entrees came out and completed before appetizers come out! Left the restaurant not satisfied. \nPlus!!\nNice atmosphere.\nFresh food.\nminus!\nExpensive\nSmall Portions\nSlow services\ninexperience waitresses\n\nWill not be going back!!", "author": "Michael L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "This corner of 19th and Taraval felt like it has been cursed. Ever since JT's closed down, businesses that came after didn't fare very well. Now that Sushi Raw is in, perhaps this will break the spell of the cursed corner? I like to think so!\n\nFirst off, Sushi Raw did one thing right. They spruced up this lot both inside and out. Looking from the outside, it's hard to tell if business is going through well with those tinted windows. Step inside and it's miles away from previous businesses. Modern look takes over and you feel like you're not in the Parkside district. Everything seem to be influenced by modern design as bento boxes are replaced by clean squared ceramic plates. \n\nI've tried the Bento Boxes a couple times prior to this review and I say it's a good value for the quality of the food. At around $8, you get yourself miso soup, California rolls, Shrimp and Veggie Tempura and a variety of entree options to fill in. I have to bring up an observation though. If good value to you is measured by quantity, this might be a target for the opposite. It's not the same portions as Kitaro, but this meal will fill you up. \n\nI've also tried the Toro, or fatty tuna, in its Niigiri form. Freshness and creamy is all that you taste and that's all you need. Or maybe it's $10 for it that you really need...\n\nOverall, Sushi Raw is another Japanese restaurant among many that does almost the same thing as the one next door. The Bento boxes are quite a decent choice for anyone, but for the real Japanese fare, this isn't the place.", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-31", "description": "We have been going to this place at least twice a month.  Service and food has always been pretty good. Today we went there for lunch (usually we had gone there for dinner). The service was good,  but the food...  Sushimi pieces where frozen with wither frost bites or just dried up areas. My son's favorite California roll - the crab,  the rice...  He did not even finish it.  Even edamame was overcooked. It was a $56 bill and when I told them about all this,  they took a $1! off.  Needless to say we are not going there anymore. I realize that sometimes things happen,  but to take a $1 off...  Shimo has been my favorite for years as well as a couple of others that close by.", "author": "Igor O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-23", "description": "Pluses are: very new modern looking interior, extraordinarily friendly sushi chefs (very outgoing Chinese group), quite reasonable prices, good selection, accomodating to special requests.\n\nNegatives: sushi quality and presentation are better at Shimo, salad dressing is too sweet, sushi pieces are a bit on the small side, grilling needs to be done just a bit longer.\n\nThe proprietors are nice and enthusiastic, and I really like that it's open late, and it seems like it attracts a young crowd and would be a more fun place to drink, but for food alone I agree with other yelpers, I'd probably go to Shimo even though Shimo is pretty plain and standoffish.", "author": "p v."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-19", "description": "i'm not one to write bad reviews, but i have to say my experience at sushi raw on taraval last night really pushed me over the top.\n\nfor starters, if you like fish, DON'T eat here. the fish is NOT fresh. the tuna came out a dark dark red and was tasteless.\n\nblah.\n\ni feel bad because i could tell that the waitress was nice and was really trying, but i think we must have walked in during a busy time because service was held up quite a bit.\n\nanyhow, that's all. i'm not going to sit and write a long review. i wouldn't recommend this place if you like high quality food.", "author": "Kyle L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-30", "description": "This place is weak . The best thing they got therewas their lamb chops. And even that wasn't cooked right. The lion king brings disappointment. It brings shame to it's name. The lion king at sushi house in alameda remains the king.I was desperate. The specialty rolls is as small as a normal roll. In addition, it did not taste that good. I was totally disappointed from this place. I will not come back to this place. If you are looking for a sushi place, you should look elsewhere. Somewhere far from here.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-25", "description": "Best sushi ever!!! They used to have a location in san Bruno but they closed it!! Was way easier for me and my husband to go to that location. Excellent customer service, fresh sushi, great oysters!!", "author": "Anna S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-14", "description": "Happy hour oysters were great.  Happy hour saki got me feelin' right.  Although the presentations were beautiful, our sushi left something to be desired.  It was good (especially being drunk), but it was not 4 star sushi (and that is what I'm reviewing).  Even without dipping my rolls in the beautiful sauces, they were already drenched in other flavors and sauces (possibly to mask the flavor of shitty fish?)  When I eat sushi, I like the delicate yet complex flavors of the fish predominating, followed by the fresh veggies rolled inside.  When it is only the sauce I taste, I question the quality of what it is masking.  Overall, not bad, but not 4 or 5 (yelp review wise) sushi spot (especially with so many in the city, and close by, that are cheaper, and better).", "author": "Mitchell W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-27", "description": "The Chirashi is fresh, sushi rice had a nice balance to it (slightly sweet, no hint of vinegar).  The shiso that I asked to be included in my Chirashi was fresh, not wilted.  The Eclipse and Taraval rolls were a good size with a nice combination of ingredients.  I ordered take out, so, this review is based solely on food.  I'm totally up for the full dining experience!", "author": "Chloe G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "Simply delicious!\n\nGood services, nice atmosphere and fresh sushi.  It is a cute place to bring friends there for dinner. I am glad they turn it into a sushi place because it is hard to find moderate price and big serving sushi in sunset.  I eat a lot so if I have to paid $20 for small pieces of sushi, it won't be worthwhile for me.  I actually got full there- two of us ordered 4 rolls for about $20 each.   \n\nI wish they can repaint their sign.  The orange just does not fit the quality of the restaurant.", "author": "Yau L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-07", "description": "A casual neighborhood Japanese restaurant. Food quality is pretty good for the price they charge. I like their nabe udoon and tonkazu ramen and my husband likes their assorted sashimi.", "author": "L K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-30", "description": "After living in Tokyo for 4 years I've enjoyed a lot of great sushi... As far as traditional sushi goes Tokyo wins hands down every time.  However, when it comes to \"American sushi\" Sushi Raw is putting together some great flavor combinations in there speacility rolls. I highly recommend the Pink Lady (vegetarian) or the Walnut Prawn roll. I'm yet to try a speacility roll I don't love!", "author": "Tyson S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-21", "description": "From the outside and location, it doesn't look like it will be a good restaurant.  Looks like a cafeteria.  But the waitress are nice.  The sashimi was fresh.  The rolls are not bad.  SF doesn't have that many good Japanese restaurants.  This is not bad at all and the surprising thing is the waitresses are Chinese!  It gets drafty if you sit near the door.  Don't sit there!", "author": "Byron L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-27", "description": "I'm sitting here right now.  My water glass is empty and the waitress is wiping the door down.  Its lunchtime.  At no point did the waitress or the chef smile at me.  I like smiles.  Its like a graveyard here.  Perhaps its the lunch shift.  I don't know. Food was fine, nothing spectacular.  I'm just getting my car smogged across the street.   Service gets a 2 star deduction, food 1.  Shoulda gone to the pizza place.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-02", "description": "Just got finished throwing out the meal I had delivered.  I spent almost $50 on two ramen soups and three sushi rolls.  The soup was the worst I have ever had, bar none.  Absolutuly tasteless and inedible.  It went straight into the disposall.\n\nThe sushi was passable but barely..  Shame as this place delivers and got the order right, even if the food was soooooo wrong.", "author": "D C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-01", "description": "Taravel? More like \"terrible!\" We got there at 10:00 pm on a friday night and they wouldn't serve us any alcohol! I nearly died of thirst! I felt like Tom Cruise in the beginning of \"The Last Samurai.\" SAKE!!!! SAAAAAAKKEEEEEEE!!!!! The service was slow and the food mediocre, but being unable to wash down raw fish with delicious, sweet, nectar of the gods, rice wine and Asahi made it so much worse. Get your ish together Sushi Raw.", "author": "Misha M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-17", "description": "First off, you will be surprise when you walk in because you don't expect it to look the way it looks on the inside. VERY nicely decorated and furnished. \nCame here for lunch today and it was EMPTY when we walked in for lunch. wierd because theres alot of walking traffic on that corner. Maybe its because its a sushi store chain and people are iffy about trying chains because they think of fast food joints.\nWe mostly had bento boxes which was 3 items for $9.95. Which is a pretty reasonable price for bento boxes. I had the beef teriyaki, chicken katsu and tempura. It tasted okay. Nothing really special. Pretty small portions though. We also had the tuna poki, pretty spicy but pretty good. It has cucumbers, white radish, raw tuna and black tobiko on top in a spicy sauce. We also had the squid leg katsu, which is basically squid legs in batter. the batter was pretty plain and not even crunchy.\nFor 6 people, the total was around $97. Pretty pricey for the amount of food we had! I would only come back here if it was for another lunch with work or if I really had nothing to eat because seriously, its nothing special.", "author": "Linda N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-03", "description": "This location on 19th Ave has never done well with restaurants but this one looked promising.\n\nI must start off by saying the food here is absolutely delicious! We got the bento box with teriyaki salmon, saba mackerel, yellow tail sashimi ($13.95 + $2 extra for sashimi) and a Four Seasons roll ($13) and a small Kirin beer. \n\nThe fish is top tier. The sashimi was tender, juicy, and fresh but about 1/3 smaller cuts than your average sushi place. The salmon was grilled very well but they kinda smothered it with too much teriyaki. Still very good though. Their saba mackerel was better than I expected. \n\nThe Four Seasons roll was to die for. The decoration of the plate was beautiful and truly art. \n\nAgain, I thoroughly enjoyed our meal but I knocked down 1 star for the price. $36 for 2 people before tip and we didn't really get that much food. My gf was still hungry and was debating to ordered another roll but decided not to. \n\nI knocked down another half star because of the small cuts for their sashimi. Any legit sushi place needs to have legit sashimi. yes it tasted good but no one deserves cuts that small, especially for the price I paid. \n\nThe place has been opened for 12 days they said and it was pretty empty for a Sat night at 8pm. It was only 2 other tables and very quiet, almost uncomfortable eating when you have 3 waitresses and 2 sushi chefs congregated talking 10 ft from you. \n\nDefinitely glad I tried it but I probably won't be coming back due getting better value for your money at other nearby sushi spots.", "author": "Eddie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-14", "description": "Decided to go here with my roomie since there was a Yelp special of $20 for $40 worth of food.  First time here and not bad.  The waitress was really attentive and the wait for the food was great (then again we went when they just opened so that makes sense). \n\nAmong a lot of other things, I got the Hot Summer Roll and that was pretty good although I've had bigger rolls for the same price.  There's a \"discounted\" menu you could order from after spending $15 or something so we got a Seaweed Salad for $2 and then a Spicy Tuna Roll for $1.\n\nOverall, good experience here.  Can't complain since I got $20 worth of free food. :)", "author": "Hwan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "It was better than I thought. They have the thickest sashimi I have ever seen. Very fresh.", "author": "Shirley Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "Great tempura! Friendly staff! Convenient and open late for a late meal! Love the jalapeño roll!", "author": "Chanel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-07", "description": "came here with friends to have dinner and we got seated right away. we notice their decor was dim and well organized. \n\ni really like their special roll especially their all season roll cus its big and tasty however their other rolls such as, dragon roll were like bite size (very small) \n\nservice was average. \n\noverall, their non special rolls sure need improvement and also all of us had to use the restroom right away after our dinner.. hmm?!", "author": "Valerie N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-25", "description": "came here after work with my uncle,aunt and cousin. i'm not a big fan of sushi nor a expert so its was ok. we ordered a cali. roll and something else. \n\n\ni ordered a beef ramen. it was ok, the description of it was a little off, i could of sworn i saw it said it came with bean sprouts, and it didnt have any.didnt say anything about cabbage, which i dont like.\n\nthey dont serve alcohol after 10, luckily we came in a little before 10 to order some hot sake.", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-03", "description": "I used to pass by this place a lot when it was still a diner at this location. But Sushi Raw has done a great job in the interior. It looked modern and the ambience was good. I came with a friend and we ordered the sashimi combo, a dragon roll and a another roll (I can't remember the name). For every $15 we ordered, we can pick 1 item off the bonus menu consisiting of $1 -$5 items. The waiter said we can pick 3, so we had 2 unagi handrolls($1ea) and 1 sake sashimi ($5), which was such a good deal! The sashimi was ok fresh, not too bad. Everything else was also OK. I can't say i loved their sushi but it was not bad. Service was friendly .", "author": "Megum I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "So I finally got the chance to try this place on Saturday. It was a sushi day for my boyfriend and I before we start school. We went to masu for lunch and came here for dinner. It's a nice place and I like the setting. It felt really warm and casual. My boyfriend and I had the salmon sashimi, the taraval street roll, four season roll and the lion king. Let me tell you. These rolls are deelicious!! Oh my god! I was in heaven. :) to top that off we were still hungry so I ordered a beef udon and another four season roll for my boyfriend. Okay I know this is. Lot of food but we went with our friends so we shared some with them. Haha. The reason why I'm not giving it a 5 star (even though the food was deelish) was because they took forever on the udon and the rice plate that our friends ordered. We finished our food before the udon even came out and after. Ordered mine, it probably took another 20-30 mins to come. I understand there was a big party that night with 10+ ppl but other than that there were only our table and 2 other small ones with 3 ppl max. But overall food was good and the waitress was very deligent and apologized about the long wait and checked on the ordered very often. Thanks for the great service. :) will definitely come back!", "author": "Shirley Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-12", "description": "When they first opened, my honey and I went in for dinner and we were pleasantly surprised.  The sashimi was pretty good and cheap and the beef tongue was really really tasty!   So we ordered another beef tongue.\n  \nFast forward:  What a big mistake!!!\nWe decided to have my boyfriend's bday party there, since we were pleasantly surprise the first time.   When we ordered some rolls for the party, they came out soggy (ewww soggy sushi rolls???  wth??)  all the flavors didn't combine well with each other, and the bill came out to be way over priced.  If we knew were going to spend that much money we would've gone somewhere else that tasted better.    One of the biggest reasons we came here was their beef tongue was a huge hit when we first came to try this place out and the sashimi wasn't too bad for the buck.  Well  the night of the bday dinner, the beef tongue was not the same nor did it taste remotely the same as before.  Did they switch chefs already?\nOver all, I don't think we'll be back, I love love love sushi,  so quality and consistency is very important to me..  Hope they make it the location where they're at; a lot of business' have come and gone.", "author": "Paige L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-13", "description": "Okay, let me start off by saying \"dont ever come here' .....I can't say the other locations are bad, but this one for sure wasn't satisfying at all. I ordered the dinner bento box with three items: spicy tuna, cali roll and beef teriyaki. They never asked me how well I wanted the meat cooked, so I assumed they were going to cook it at LEAST medium rare. When my food came out, my meat was LITERALLY RARE. WTF, am I a dog or some type of animal? What do I look like eating RARE meat? Im a little paranoid when eating anything rare, especially beef cuz my stomach is really sensitive. When I told the waitress about my meat she gave me this strange look and kind of had some attitutde. Uh...YOU WORK HERE, and I am the customer. If i'm going to be paying whatever amount at least make my food taste a little better. Don't give me a hard time for asking to cook my meat a little more. On top of that ordered a roll., and the roll was GROSS. It wasn't fresh at all, even my spicy tuna was disgusting. How hard is it to make a decent roll? Really..........I dont think i'll be coming here (at this location) ever..again.", "author": "Colette P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "I came here the other day with my GF because we had driven past this place numerous times always saying we should try it someday.  It's been so many different restaurants we were sort of hesitant to try it due to the high turnover and the many different restaurants that have came and went, but we decided to give it a go.  It's a very cozy, modern and relaxing restaurant.  Since it's located one the busy intersection of Taraval and 19th, you'd expect to hear the traffic and be bothered but what they did was add tinted glass so no one can see inside which gives the restaurant a much better and relaxing atmosphere.  \n\nAs for the food, we received our food very promptly and the waitress came over numerous times in order to make sure we were fine and everything was to our liking.  The food was really good.  We had a couple of rolls but the one that really stood out was the Lobster Roll which was wrapped in cucumber instead of rice.  It was absolutely delicious as well as the other rolls but that was the one that really stood out.  We began with a soft shell crab and finished with a Green Tea cheesecake which was all very good.  The only reason I didn't give it 5 stars was that the location at times can be a little hard to find parking which is a minor fault but I could see some getting frustrated.  Other than that I'm probably just nit-picking but maybe the next time I go and have the same attentive service, good food and enjoyable time my rating will probably be a 5 star.  Certainly worth a look if you like Japanese and live in the area.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "I was very excited when I first saw the signs go up that this restaurant was going to be Sushi Raw!!!  My boyfriend and I love their restaurant on Mission and this location is even closer to my house!  I only went to this location once though since they opened and that was the night before my birthday last August ...  The food was just as wonderful as their Mission location... oysters and all!   The only drawback was their liquor license only allows them to serve until 10pm ..(this was last year, so it may have changed since).  No sake bombs for us ):  Many people came in just for drinks and were turned away... There's a bar 2 doors down... but we wanted some sake lol!   I would still definitely recommend this restaurant and their location on Mission ... Haven't tried Haight location yet, but Iam sure its delicious too!", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-30", "description": "While their sushi is good, it's not good enough to justify the unusually high prices. I took my best friend here for sushi when they first opened, and the bill for the two of us was around $60 (for two set meals and 3 rolls). As stated before, the food is good, but not THAT good. I will say that the atmosphere and aesthetic of this place are really impressive though (which helps to justify the cost if you are out on a date).\n\nIf you have a hankering for sushi, and you are not out on a date or trying to impress someone, I suggest you mosey down the block to Ninki.", "author": "Charlie P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-19", "description": "Although the food was good, and I thank them for being open on Christmas Eve when my friend and I went, we were told that they would not serve us alcohol. This was a little upsetting since that was in part why we went there. Later on during our dinner, to our surprise, the people that worked there pulled out a large bottle of Grey Goose, and commenced celebrating. The least they cold have done was wait 10 minutes for us to leave.Overall, good food, not too happy about them drinking in front of us, and they need to get their door fixed because it wouldn't close and it was freezing.", "author": "Michelle V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "I wish this place was closer. Parking is easy to find. Sushi is amazing. Service is great. Love their Lionking Roll.Oh and they deliver too....Hands down 5 stars. =)", "author": "Jasmine A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "This is an update on delivery time. The woman answering the phone will tell you 45 minutes, but in reality it takes about 25 to get to me.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-14", "description": "A friend and I ordered delivery from them last night.  It took two and a half hours for them to deliver 10 blocks!  We finally gave up in frustration and called to cancelled our order - not to mention that having raw fish wait around for 2.5 hours just creeps me out.  I refused the food at the door but they still charged my credit card.", "author": "Shura K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-19", "description": "Review is not about sushi.... I have been there three times for lunch.    The bento box and ramen has nothing special and the plate they use make bento look like modern fusion however nothing out of ordinary.  I didn't like the service, the waitress was rushing me to order,  I thought they should respect clients and be patient... She couldn't explain some dishes.  They did not have much client and it was a Sunday, I am done with this place.", "author": "Z G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-18", "description": "My boyfriend and I decided to try Sushi Raw since the other sushi place (that had 4 stars) down the street had a very long wait. Luckily we were sat immediately here! Being the salmon addicts we are, we both ordered teriyaki salmon bento boxes, salmon sashimi, and salmon nigiri. We definitely overdosed on salmon that night! Anyway, the raw salmon was very fresh and delicious and so was the teriyaki salmon. However, the portions were very small for the price we paid. I only gave 2 stars because the service was HORRIBLE! We constantly had to keep flagging down a server if we needed something. No one ever checked up on us to see how we were doing or to refill our waters. We were dying of thirst! Being ignored and forgotten, we could have easily walked out on the tab and they wouldn't have even noticed, but my boyfriend and I aren't like that. When we finally got our check after asking for it twice, we tipped them very little and walked out hoping to never return again.", "author": "Kylie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-16", "description": "Went here for lunch because another Sushi restaurant down the block was closed. Price was reasonable, and sushi was pretty fresh.", "author": "Care B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "I went there at 6pm on a weekday. The food was FRESH. For two of us, we ordered an order of sushi boat and a bento box. We thought the sushi boat wasn't going to make us full. It turned out we were wrong. The boat itself was good enough. I'll be back.", "author": "Alex S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-31", "description": "The sushi here is decent and fresh.  The agedashi tofu wasn't so great, and neither was the ramen, but if you stick to sushi and beer, you'll do just fine here! \n\nHey, that rhymes...", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-02", "description": "I have been here a few times before my night at my bar, Grandma's.   The service has been fast and efficient.  I get beef tongue for the app, and a happy nigri for my main course. (it comes with mi so soup and a nice salad with creamy dressing.   The fish is very fresh and delicious and the tongue is pretty scrumptious dinner.  A  great, great place for dinner before I get my drink on! n  Pretty good for folks in wheelchairs. I think a group with two or  three people in wheelchairs would work in this place.", "author": "Sascha B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-03", "description": "I know this place just opened but I feel that this restaurant is a wannabe sushi place. Everything seems forced and I think I heard Chinese profanity in the chaotic background.", "author": "Billy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-31", "description": "Don't eat there if you have a weak stomach. I ate there with two friends who supposedly know one of the sushi chef. We got great service but if is authentic sushi you look for, this is not the place. They serve creative fresh quality grubs at slightly over price tabs but the thing that threw me over was the stomach ache those oysters gave me. Ahhh, it pains me to say I will not visit those tasty oysters at Sushi Raw ever again.", "author": "Sandy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "I had passed by this place for years, and was pleasantly surprised when I finally tried it out.  My girlfriend and I had a great time. The specialty rolls were unique and delicious.  Also, prices were decent.  It is sooooo much nicer inside than it looks from the outside.", "author": "Joe L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-31", "description": "Having a Sushi restaurant in the Bay Area means having competition all around you, and that being the case, you really need to have something that stands out from the other places. When a friend suggested that we have dinner at Sushi Raw, I was thinking, \"Oh crap... another chain sushi wanna-be place.\" With construction outside, it didn't look too promising. However, I was pleasantly surprised when I walked in, as there was somewhat modern decor and the place was very clean (including the restroom - VERY important). It was 5 plus a kid, and we ordered a few things; Tempura Udon, 2 2-Item Bentos, Soft-Shell Crab app, 1 live Uni, 1 5-Piece order of Toro, and a app order of lamb chops(2 pieces). Nothing too extravagant, nothing too much.... Here is where the problems began... The uni was HUGE, and yes, still moving since it was a live uni, yet, as huge as the uni was, we only got 6 pieces??? Everywhere else, they give you everything inside the thing! At the market, live uni? $6, so when you pay $16 for one, you expect to get the whole thing. Second, our Toro? Not soft, stringy, and DID NOT TASTE ANYTHING LIKE TORO. The cost you ask? 5 pieces for $47!!! $25-35 depending on quality, and they charged me what?! For GARBAGE?! Sure, it can be Toro, but the grade was REALLY LOW. The lamb wasn't that good and the bentos were borderline (chicken was over cooked, and beef wasn't good even)\n\nAll in all, will not come back again. If it wasn't for the great service, I would have blown a gasket when the bill came. $198+tip was our bill for that amount of food. Over priced garbage. for what we got, I could have gone to other places for much better and fresher food for the price.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-08", "description": "came here with the boyfriend yesterday...the place is lightly dimmed and there aren't that many tables. the price is ok\n\ngot the chicken karrage-good, but nothing special\ni got the summer love roll-the tuna in it was really good, but everything kept falling apart.\nmy bf for the fried vege roll with soy bean paper and they made it into heart shapes, but it was hard to eat b/c one u pick it up it falls apart.\n(Plating is really nice)\n\ni got the bento box-salad, miso soup, rice, tempera, seabass (looks super plain, but was so moist), and 3 pieces of nigari (the fish was super fresh, but the rice kept falling apart)\nthe bf got the combo bento box-short ribs, beef, and tonkasu-he said it was good, but his rice was not even sticky like how japanese rice should be\n\nover all i'm glad i tried it, but i wouldn't come back here. the waitresses are nice, but we had alot of empty plates and they wouldn't take it away and till i asked them to. don't just stand there and look bored....do something!", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-15", "description": "Had two meals delivered last night, it arrived 5 minutes after the promised delivery time but not bad for a Friday night.  Both Bento boxes were as good as it gets.\nWill be using Sushi Raw again.", "author": "Dewi D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-01", "description": "Yea the sushi is nice and fresh, But never have i ever been treated so rudely. The site they are listed on said they would deliver to me so i made my order. Then they called me 20 minutes later saying that i lived to far and they wont deliver to me and that I had to come pick it up or they will cancel it. I ask the woman on the phone to hold on while i figure out if i want to or not and she hung up on me and i KNOW she herd me ask for her to wait. Then i tried to call back and they did not pick up the phone. I was not rude to her or short so there was no reason for her rudeness. I will never eat here again i rather spend my money were i will be treated with respect. There are plenty of better sushi places out there were you get more for your money and RESPECT. Madfish is amazing check it out!", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "was craving for good sushi and MOUTHWATERING UNI last week and tried this place since we live few blocks away. I love the hip atmosphere. the place is nice and the servers are very friendly. I had a LIVE UNI and it was HEAVEN. Couldn't get enough of that so I ordered more. I will definitely come back.. A little on the pricey side though. But it's OK for good sushi.", "author": "Patty P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-20", "description": "From the outside you can't really tell if they are open at night since they have this really dark window tint. \n\nThe decor inside is nice and contemporary. When we went inside, there was only one other table of people. This place is pretty small since it is on 19th ave. \n\nThe food was alright. I wasn't wow-ed by the sushi. The thing I didn't like was how much sauce they put into every dish starting from the salad! The sushi and then my beef teriyaki. They put way too much.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-26", "description": "food decent. customer service is horrible. takes me 5 mins waving em down to get more tea. I was about to call em on my phone to get service.  they were too busy chit chatting it up. didn't check on us once during our meal. im still sittin here and pretty sure they will be quick about around check time  I'd order to go but will never eat inside this joint again.  I got better service at mcd!", "author": "buddy p."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-03", "description": "Wow, it's amazing how shitty service can completely change my mind about what used to be, an amazing restaurant. What a shame. They've hired new waitresses and new chefs who are EXTREMELY unfriendly and unwelcoming and very rude and obnoxious. I am a regular customer and literally go there every two nights and usually have our sushi rolls with slices of lemon (they're tastier this way), and the chefs somehow decided that they were sick of doing us that \"favor\" and started charging us an extra DOLLAR for every roll with slices of lemon! like seriously? this usually means extra $3-$4 for a whole lemon!!! Wow, talk about being greedy. Not one sushi restaurant has ever done this with me!The new chefs are always frowning and the waitresses are super snobby. NOT going back there again until their staff is changed!! VERY RUDE!", "author": "Sarah A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-14", "description": "Visiting my friend in sunset, I went  to this Sushi Raw with my friend. I was surprised that  the waitress(with lovely dimples) recognized me because I have dined in Sushi Raw at mission for several  times. We were recommended to have  live uni and others. My friend and I loved it. I'd  definitely order it next time. The waitress also had the soybeans on the house for us because I am their regular. SWEET!!!", "author": "STUSSY Dude E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-07-07", "description": "We got here at 7 and it was not busy at all. It's now 7:35 and we have been waiting so long for the food decided to do the review on my iPhone. There were 4 customers and 7 people working here. The workers were yapping in Chinese  and drinking Saki. The waitresses where nice but not paying attention. OK just finished eating. We thought the food was blah. I can't recommend this place but then again all the restaurants on this corner never last.  I've lived her 7 years and seen about 6 come and go.", "author": "Rich S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "Ordered a few rolls, delivery. One of them tasted really strange- maybe kind of smoky? But not like smoked salmon smoky. Just really, really off. I couldn't finish it and had to throw it out. The rest of my food was really bland. I definitely won't eat here again.", "author": "Brandi C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "I'm a sushi lover. This place.. Mmm mm mmm. Yum. =P Always busy, but never a long wait. Waitresses are polite. What not to like?", "author": "JUDY H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "This place gets a solid 4 stars for having good, fresh sush and great deals. You can order online for pickup or delivery which is super convenient but the sit down restaurant is nice as well. They have some good deals when you spend a certain amount you get a choice of free items. Would definately recommend this place to anyone looking for sushi in the area!", "author": "Linnea B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-22", "description": "Let's be honest.  I only came here because it was one of the few places open past 10 pm on this side of town and I was starving.  It seemed nice enough upon first glance; there was a handful of people eating (all couples).  So Dinner Date and I grabbed a table and perused the menu, settling on both getting Bento Boxes.  When the waitress brought out DD's Bento Box, she asked me, \"what did you order?\"  I repeated my order to her and she disappeared for 15 minutes, finally coming back with my Box in hand.  The waitress didn't even acknowledge that I'd been sitting there watching someone else eat while I waited for my food.  And I didn't get the substitution I'd asked for, but at that point I didn't want to push my luck.  The meal itself was just ok; the portions were really small and not worth the price.  Also, they stop serving alcohol here at 10pm, even though they don't close until midnight.", "author": "Denise K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-21", "description": "Ok here is a message to the owner. I am in the food business and know how a restaurant needs to be run. The food was good this is the most important part. Here is the catch, why spend all this money on a place and not put in heaters, the place was freezing last night and the waitresses were walking around in parkas. Just get some placement heaters for the time being. I mean DAMMNNN really no one wants to eat in an ice box. That is truly unacceptable I will be back and if you have heat i will change from 3 to 5 stars. Get it together dont put all this money into construction and then slack on the heat people want to be comfortable when they eat, now that some good free advice.", "author": "d m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "Good food and good service.  If you are a sushi fan, Sushi Raw is the place to go....", "author": "Breneen T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-15", "description": "The atmoshere was ok.  The food was kind of bland.  Very small portions.  I found a door hanger at my house which offered a free california roll if I spent over a certain amount so I thought I go check out the place.  Me and my wife ordered alot to make sure we went over the amount so I showed them the coupon.  To my surprise they wouldn't honor it saying that was only good for deliveries.  WTF??? DELIVER IT TO MY TABLE!  It truly boggles my mind that a place spend hundreds of dollars advertising and when it works to bring in the customer, then they treat them like shit?  Apparently I only qualified if they delivered it to my house, so we didn't get it.  I felt dumb ordering so much food just to qualify, I thought that was very foolish of them to do that to me since I'm never going back there.  They might have saved a whole buck, but they lost all my future business.  I'm a local so they really lost ALOT of potential business from me.  I would pass on this place if I were you.   It's rare for me to leave a place still hungry after dropping $40 for two people. (No booze)   I'm going back to Noriega Teriyaki, it's only 5 mins away, better service, better food, better prices, better parking.", "author": "Nicholas W."}
