{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "Loved it!\n\nThe sushi was delivered on little conveyer boats on water.  So cute!  The dishes were actually pretty reasonably priced but they pile up fast!  Sushi is priced by the dish and they do have a lot of variety.\n\nWas it the best sushi I've ever had?  No.  Was it decent?  Yeah.  Would I come again?  Probably not.  The service wasn't the best but it was definitely great for a one time visit.", "author": "Lindsey P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Honestly really mediocre tasting sushi. I've had cheaper sushi that's tasted better. It made me feel sick, the shrimp tempura didn't taste like shrimp, the roll wasn't rolled tightly enough, and my roll just had too much fried tempura flakes on it. It tasted so dry and bland that I threw the rest away after eating a couple pieces of it. Not coming here again.", "author": "Katarina L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-21", "description": "I ordered MealPal lunch from here (curry beef). The inside of beef is still red and raw!! I didn't notice at beginning since I ate the whole chunk but then I felt it tasted weird. Then I separated the left beef chunks and found all of them were red and raw inside. So gross.  I had a similar experience when I ordered their curry chicken. The inside was really raw. Will never order from here.", "author": "Susie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-06", "description": "I am so glad I did not look this place up on Yelp before trying it. This is one of my coworker's go-to spots and I trusted her judgment. My family used to go to a similar sushi spot in Mountain View called Sono Sushi and it might be due to nostalgia that I am being extremely lenient for Sushi Umi.\n\nNo, this is not the best quality sushi. No, it's not made to order. But it is quick, affordable (for sushi), across the street from work, doesn't have a line during prime lunch hour, and is delicious. I really don't know what else I could ask for. And yes, I've waited over 24 hours to write this review and I did not have any issues with my stomach.\n\nI think I'll be back.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "Great first impression. I will see how I feel in 24 hours haha but I'm glad I gave this spot a chance! I don't understand why there are so many negative reviews.", "author": "Jatinder J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "i've eaten at this restaurant a lot before and usually the lunch is good.  but today i almost ate a bug in their salad,  it was awful.  it blended right in since it was green, but something didnt taste right so i spit it right back out and saw it was a bug.  looked up the species and found it was a stink bug.", "author": "Richard M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-22", "description": "I don't write reviews very often but I have to write for this place. There were about 3-4 customers at the place during lunch hour, so this place wasn't that busy. However, the waitress managed to forget my order. I thought okay, maybe she's just having an off day and decided that I'll help myself with some sushi off the sushi boat. Bad idea, I had the worst food poisoning that day. Go anywhere else for sushi. This place is a health hazard.", "author": "Ayu D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "I ordered a MealPal meal from here, but when I went to pick it up the woman at the counter claimed they had received no notice of my order. She rudely refused to provide me with my meal, as if I'd just made up an order to score a spicy tuna roll. I've cancelled my MealPal, too.", "author": "Adam Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-14", "description": "SO BAD. Just had lunch there at the sushi counter and took sushi off of the sushi boats. I was skeptical, so I chose the most basic of options: Spicy Tuna, Cali Roll, Shrimp Tempura, etc. Without a doubt, worst sushi I've had. Plus, it was really expensive. I definitely will not go back to this spot.", "author": "Joel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-12", "description": "This review is only for the sushi boat. I should have known better. Sushi boat places are notorious for bad sushi - the sushi here was inedible. I work in the area and this place is always full for lunch. I was craving sushi and made a mistake hopping into a quick spot vs walking a few blocks and eating at a half dozen really good sushi restaurants. \n\nI don't know about their rolls but rolls are for rookies. The sushi tastes like it's old and the portions are tiny. \n\nIf you want cheap but decent sushi in FiDi go to Tenmatsu, Sushi Taka or Tokyo Express. \n\nDon't eat the sushi off this restaurants boats.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-11", "description": "The idea of boats filled with sushi was enticing so I tried it. The quality was average for tako, toro, and some rolls. The hamachi had an off putting taste which I found repulsive and couldn't finish it. I told the waitress and she responded with, \"I don't what fish that is\". She charged me for it anyway which was disappointing.", "author": "Fernando S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Another week, another order from Sushi Umi. This is our office's go to place for our weekly lunch meeting. I got good feedback from my team about the veggie rolls and the veggie tempura. Been ordering at least 2x a month, sometime more. Keep it up Sushi Umi!", "author": "Jamie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-05", "description": "Great for meal pal lunch. Really good value for the amount of food they give you, but not a fan of the salad dressing.", "author": "Michelle B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "Found this place through Meal Pal and picked up a \"spicy tuna roll\". They had stacks of rolls sitting in to-go containers at the cash register (not sure how long they have been sitting out). Also, the tuna was cooked? It felt like I was eating canned tuna mixed with sriracha. Definitely crossing this place off my list for Meal Pal.", "author": "Kim H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "My go to spot after a rough day at work. Love the sushi boats. This is the kind of place you get quantity over quality but I am a sushi snob. This place is good though. \n\nQuick lunch and a beer- and upstairs seating w menu options. I come here once a month.\n\nNice staff- okay sushi from boats. Happy hour must be wild.", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-09", "description": "Had the Lobster roll. \nThough the combination was a good idea, the execution was not satisfying. The Lobster meat was chewy and walnut had a smell from what I guess was storing it for long. \n\nFor 11$ this was a poor experience.", "author": "Avinash G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "Chose this from MealPal and I think I experienced food poisoning from eating their Spicy Tuna Rolls. Tummy upset all day and next, but at least I haven't been admitted to emergency yet. \n\nThis place is banned in my books. \n\nOn a side note, taste was OK.", "author": "John N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-17", "description": "I tried this place again about 6 weeks ago and said never again.  Then today, don't ask why, I went back as I was craving sushi, and it's still a convenient location.  NEVER AGAIN!  The boats were filled with items that had been around the bin several times, most notably due to the color (or lack thereof), texture and little black bugs flying all around.  The prices hare higher, the quality is lower and they just don't seem to care about serving decent food.  This time I mean it NEVER AGAIN!", "author": "Kerrie R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-23", "description": "I can't blame anyone but myself. I saw the poor reviews and still went here since I did not have a lot of time and was craving sushi.  I was optimistic initially since it was fairly crowded. They do the boat thingy downstairs and have regular seating up stairs. \n\nI got the sushi combo with a few substitutes. I got the tuna roll with soy paper and double ngiri salmon which came out to $18.50. The sushi was very fishy, I was able to eat the ngiri but the rolls were way too fishy and i junked it. $18.50 for a few below average salmon ngiri...next", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-24", "description": "I assume this place must be housed in San Francisco's skinniest office building. At least it looks like it from across the street, and this nondescript Japanese spot takes up the first two floors like some Ginza-style eatery where it would be surrounded by identical sushi establishments. But this is not the Ginza, and there isn't a geisha waitress in sight ready to walk on your back. No, this business couldn't survive in Tokyo, and frankly, I'm surprised it's been able to survive here since it's just so unequivocally mediocre in a city filled with great sushi places. Only not in the FiDi and therein lies the conundrum for any office worker looking for a little fresh hamaichi to get him through a long work day.\n\nI bypassed the sushi boats on the main floor (photo: http://bit.ly/191DOaH). I'm not a fan of the concept as it turns an artistic cuisine into a carnival sideshow. I'll tolerate it if it's good like at Warakubune on Church (review: http://bit.ly/1i6lve8), but otherwise I prefer just a clean counter between me and the master. So I trundled up to the second floor which a lot of people don't even know exists (photo: http://bit.ly/1hbw9yF) unless you happen to read the reviews here.  The menu is sushi-focused with a tempura bar and a few combination plates (photo: http://bit.ly/1i6sEeo). Since the sushi on the first floor looked like it has been on cruise control since Capt. Merrill Stubing took to the high seas, I decided upon the $12.50 Hamaichi Kama Deluxe Lunch (photo: http://bit.ly/18zE4RP).\n\nFirst came the miso in a decorative square bowl straight from the Crate & Barrel outlet store (photo: http://bit.ly/1c3cfCl). Somewhat lukewarm...and the broth was not cloudy all day. Then came the lunch plate. The hamaichi was a collarbone which had been grilled and marinated in ponzu and lemon juice (photo: http://bit.ly/IaDkIB). The result was on the meh side since the edible portion around the collarbone is rather paltry no matter how well decorated it is with chopped scallions. The obligatory scoop of rice and mixed green salad were there, and then the saddest quartet of California Rolls I had ever seen. It looked like a prison guard had slapped them hard with a clubstick (photo: http://bit.ly/18zEhoa). Lunch was a miss for me, and a repeat visit is not likely unless amnesia kicks in.\n\nFOOD - 3 stars...the grilled carcass of a yellowtail is what you get if you bypass their sushi\nAMBIANCE - 2.5 stars...shopping mallish, food courtish\nSERVICE - 3.5 stars...probably the best part of the experience\nTOTAL - 3 stars...maybe back to J-Town for me", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "WHY?! WHY didn't I read the Yelp reviews first?\n\nFirst mistake. I work across the street and walk by this place all of the time so I figured I'd try it for lunch.\n\nBAD IDEA. I ordered ONE 49er's roll and ONE small seaweed salad. With a $1 tip my bill came out to almost $18!!\n\nSeriously? My first thought was that the sushi must have been great but when I opened my order I noticed two things, the portions were TINY... (only HALF of a small cup of seaweed salad) and the raw salmon on my roll looked funny. Bummer. Not only did my salmon look funny but it was pure mush when I got it in my mouth. Gross! The seaweed salad was unlike any I've ever had before. Tasted like I was drinking pure ocean-salt water.\n\nI will never go back here again and will never recommend it to anyone. I'm not a picky eater but when it comes to eating raw food, I do not play around. Especially for $18!", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-23", "description": "Ehhh.... the quality does not match the price. If you sit at the sushi boat/train, the prices for the different dishes are actually high. The cheapest dish is $2.50 and those are the usual veggie rolls or edamame. Actual fish or more \"specialty\" rolls are approx. $4.50-$7. Each plate has about 2 pieces on them. So think about it, a regular roll would mean 3 plates and at $4.50/ea, that's $13.50..... for mediocre grade sushi. Nice try, me thinks not.", "author": "Thao T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-12", "description": "This place surprisingly isn't bad. I ate upstairs a few weeks ago and recently ordered to go. When I ate there, it was about noon on a Monday and it was half full. Our server recommended the Seafood Ramen and my friend had her usual, the Chicken Bento Box. I should have gone with the Bento Box because the chicken skewers looked good and it came with a big fresh green salad, rice, tempura and miso soup. It was probably healthier than my noodles soup and at the time, I bet it tasted better. The ramen was OK but I thought the spicy broth was rather boring and the ramen noodles was more like Chinese ramen noodles rather than Japanese ramen noodles. On my to go visit, I got the Beef Skewers Bento Box. It came with a fresh green salad, rice, tempura and miso soup. There were a few big pieces of tempura and there was even a shrimp one. I didn't care for the dressing because it was too sweet and the sauce for the tempura lacked flavor. The beef was tough to eat but was seasoned and grilled fine. For a Tuesday a little past noon, the sushi boat area was almost full. It seemed like a fun place to grab some sushi and sake with friends. I might give that a try next. The food was OK and the service is friendly and quick.", "author": "Jen L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-12", "description": "Went with a friend who goes here frequently and was immediately concerned as I am not a fan of sushi boats. I like the idea...the quick food, variety, etc. but prefer food made to order and fresh. As I was hungry I dove right in and the food tasted ok. It was surprisingly expensive but that's to be expected in the financial district. About 20 minutes after getting back to my office my stockman started feeling queasy. Even after relieving myself it still felt sick. So I decided to walk the 8 blocks back down there to talk to the manager. One of the owners greeted me and when I explained what was going on she said she \"stands by her food and no one has ever gotten sick. That \"everyone loves her food.\" So I come in Yelp to check it out and see they have 2.5 stars. Pretty tough to have that rating on Yelp if you aren't crappy fast food. Worst of all she seemed totally unapologetic. I wasn't looking for anything, more just wanted to ask how long the food sat out, but she refused to take any responsibility. It was literally the only thing I ate all day. Oh well. Never again. \n\nIn short, if you want extremely overpriced food that will make you feel terrible, and insensitive, rude owners, this is your spot!", "author": "J P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Went here on a Friday lunch. I checked in on Yelp and presto I had a free miso soup! Soup is deliciously genuine Japanese taste. We ordered beef skewer and tonkatsu bento lunches. The beef is tender and delicious. The spicy and crunchy sushi is also great. Their salad is fresh. The service is fast. Recommended if you're craving for Japanese food.", "author": "FJ D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "what a cute sushi place; you pick up your selection on floating boats.  Miso was good; seaweed salad good and had the specialty roll:  YUM.  I'll post a pic of it later but i think its called crunchy amigo.  Good spot; i'll be back.", "author": "Neveen B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-14", "description": "Had the poke bowl and their warning that they use a selection of fish in it is absolutely true. It felt like they put everything in it that was left over and believe me, the fish didn't smell or taste fresh. The presentation of the bowl at first looked nice, but I didn't feel like eating most of the fish as it was fishy and the pieces didn't look to be of good quality and were simply drowned in spicy sauce to hide it. Will not go back, even if the other food I saw otherwise looked fine", "author": "Kathrin F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-16", "description": "I still like this place, but doesn't go very often anymore, the reason?  Price has gone up too much.  The same Hamachi kama set lunch is now $17, it was $12.50, then $15 & now $17.  After tax and tips you're looking at $20 for lunch.  I tried the salmon kama hoping to save a few bucks but it's still at $14.50.", "author": "Sasa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-26", "description": "Avoid like the plague!  The sushi going around the sushi boat totally didn't look fresh at all.  The chicken teriyaki bento you can't order a la carte just the teriyaki, and it's yakitori not chicken breast or thighs.  The main focus here is the sushi not menu items.  The service wasn't very helpful at all either.  I guess this place gets busy only due to its cheap prices.  \n\nI hate Kamakura, but sad to say, I think I'd rather have a meal at nearby Kamakura then here.", "author": "Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "A perfectly adequate Sushi joint and Japanese restaurant in the FiDi. Although the place has a very small, cramped feel to it, Sushi Umi has two floors. The lower floor is dedicated to the sushi \"bar\" where conveyor belt driven boats float around a track and carry a wide variety of sushi and sushi inspired dishes to your seat.\n\nThe second floor is the proper restaurant, with tables and wait service. They're connected by a stairwell towards the back of the establishment. On the second floor you're given a proper menu, polite, regular service.\n\nI often dine here at just the sushi bar/conveyor area, where I can get a considerable variety of basic sushi rolls, chef's specialty rolls, sashimi, nigiri and other crafts, each priced per plate. Although the cheapest plates are rare, so are the most expensive ones, so you end up with a lot of \"middle of the road\" cost sushi plates. My drink is refilled frequently, and I'm usually not left long if I need something from the wait staff.\n\nSometimes however, I treat myself further and go to the restaurant side - here you can order sushi, bento box lunches, soups and other full meal items you'd expect in a Japanese restaurant, and they're all fairly decent quality. Likewise on the ground floor, the service is pretty expedient.\n\nSpeedy service, acceptable prices (a lil pricey, but it IS sushi in SF,) and decent food, this place *gets* business lunches. Given that their hours are almost entirely around the business work day, and it's in the FiDi, I'm pleased.", "author": "Kyle J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "Bad and overpriced food! Their ramen doesn't look and taste like ramen at all. Their sushi looks and tastes like it was from the previous night. Won't come back ever again.", "author": "Ron L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-31", "description": "This is the worst sushi place I have ever gone in SF fidi. We had waited for over one hour and did not get our order ready. The noodles tasted terrible. The whole service needs to be improved. Please please please treat yourself better, put your money in better place, and not go to this place.", "author": "Julie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "There are two places to sit here: upstairs (the full dining room) and downstairs (sushi boats). I have now eaten in both areas.\nWhen I ate upstairs a couple months ago, the service was reasonably good; the food was good. I had two rolls, both of which I enjoyed. I particularly liked that they have rolls of various sizes (this is probably pretty common, but I don't notice it a lot), so I had an 8 piece complex roll but then a 4 piece small veggie roll.\nToday I ate downstairs at the sushi boats, and it was awesome! My friend and I went and each had one piece of every roll we tried then split the cost at the end (definitely recommend this as the way to go). Every roll was tried was delicious. Some of the rolls on the boats had clearly been out for a little while, but the chefs were actively adding fresh rolls to the boats, so all of the sushi we ate was fresh. My favorites were a roll with unagi, mango, and fish and a seared salmon nigiri which was simply fantastic. I definitely will return for more sushi boats!", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-30", "description": "Hmm what to say about Sushi Umi? Not exactly the best sushi in downtown SF, but not the worst. It has its hits and misses, but it's a quick and reasonable place to get your sushi fix. I tend to avoid the sushi boat of any place, let alone here, so your best bet is to go upstairs and order from the menu. Their sashimi is actually not too bad, and the nigiri are decent also. I don't tend to get too many rolls, but they're OK for the most part. Can't eat Akiko everyday folks (unless you've got it like that).", "author": "Laura G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-01", "description": "This place is garbage.  I dont know why I've gone here more than once.\n\nThe fish rolling around on the boats looks OLD.  Like slimy nasty old.  All the portions are tiny and expensive.  \n\nI tried their chicken teriyaki once and it tasted burned and nasty.  The teriyaki sauce they gave me tasted funky and was so bad that I couldn't eat the rice onto which I had poured it. \n\nI've resolved never to go here again despite it being so close to where I work.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-09", "description": "This is one of my go-to lunch places. The service here is consistently very speedy and they are always friendly. The fish is good quality, and although I wish they had a bigger selection of rolls sometimes, they do have the usual suspects. My biggest complaint is that they are on the pricey side.\n\nI've been a few times to sit downstairs at the sushi boat bar. This is the most fun and cost effective way to eat here. Unfortunately, I rarely have time for a sit down lunch so I order take out. Usually I get straight sashimi, but the other day I was feeling like hot food so I ordered the udon. Not their strong point. The salmon terriyaki on the other hand was a nice surprise! \n\nIt's best to go on the early side to get the freshly made sushi, but you can always ask them to make you something special if you don't see it floating by you :-)", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "Had 3 rolls and 1 sashimi for $15. Smaller portions that I expected, but quality of the fish was good.", "author": "A L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "OMFG! Another 100% Chinese BS -Kaiten Su-shit!\nI hope it is not the same people who opened Ten-roku at J-town.\nIt has been round and round for a long long time, but their in standard, it's OK, they not gonna change to new one, keep it until some one pick who doesn't mind eating charlie the tuna that has been on the track too long.\n\nI have a song for you.\n\nRaw, raw, raw fish on the boat,\nGoing down the stream.\nfilthy, filthy, filthy, filthy,\nThe fish is too old to eat.\n\nOld, old, old sushi on the boat,\nGoing down the stream.\nSmelly, smelly, smelly, smelly,\nThe sushi is nothing but a shit.", "author": "Nobu K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-28", "description": "I just left the restaurant about not long ago. First, I will say the sushi boats are okay, not good but serviceable. The problem is the service. I was overcharged for the plates; they mistook the cheaper 'white plate' for a more expensive 'speckled plate'. Honest mistake, until I spent 10 minutes waiting for someone to come back to fix the problem, When they finally did they did not take off the speckled plate just ADDED another plate. I tried to tell them again but after another 10 minutes, I needed to return to work. I do not recommend the place, if you must go just make sure you are diligent about counting your plates and have the time to wait around when they overcharge you. I for one will never return, to many great options in the city to eat mediocre sushi and deal with being overcharged.", "author": "Thomi V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-08", "description": "I was still hungry and somehow craving for sashimi after downing a burger (it was a small burger, don't judge), and wandered into Sushi Umi. It was 2:30pm and the first floor was pretty empty except for some late lunch goers around the sushi boat counter. I was quickly greeted by 2 waitresses, handed a menu, and informed of their lunch specials. \n\nAfter looking through the whole menu, I ordered the 9pc sashimi (salmon, tuna, albacore) to go for $13. Yes, it was $13 for 9pc so I did not have high expectations. Similar to a previous review on the sashimi, the pieces were tiny, but the perfect portion to get me full (after that small burger, of course ;D). I was pleased that all the pieces were decently fresh, not bad for a hole-in-the-wall-looking place. Overall, I enjoyed my meal because it was exactly what I was looking for, and I will return to try the rolls.", "author": "Joy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-22", "description": "Umm.... No.\n\nIts really great that they have FREE delivery for a minimum purchase of $35, and it was really great that they had so many lunch boxed options. So I thought it would be great to order an office lunch from here, but oi, oi, oi... I think that was not the smartest move.\n\nThe taste hit all the wrong spots. The fish wasn't fresh, you can tell that the sashimi has been out for a while, its a little shiny, and the sliver of fish flesh was falling apart (this tends to mean, thats its been out for a while) and the taste was not fresh at all. Another disappointment is the RICE!! It wasn't even sushi rice and the rice has been out for a while as well... I know its supposed to be served chill, but this rice was hard.\n\nNot too sure if this was just sheer bad luck, but don't think I'll be visiting for a while.", "author": "Catherine N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "The chicken teriyaki skewers were different. I enjoyed the Hawaii tuna rolls more. Prices were pretty decent for sushi. Right in the heart of the financial district.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-07", "description": "Came here few months ago with a coworker. Sat down for the a-la-carte sushi. As soon as I sat down I knew this was a bad idea. If you've had any kind of decent sushi before you could tell some of them have been sitting there for quite awhile. It was really gross. \n\nIt was honestly the worse sushi experience I've had. Nothing worse than unfresh sushi / sashimi.\n\nNever coming back and I hope this review will others in the future from an awful dining experience.", "author": "Cheung L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-12", "description": "I was craving for sushi so BB&me decided to go there cuz it was on our way. Didn't eat much but our lunch end up 70$,,, Sad face... :-( I told my self once a while it's k to spend 70$ for lunch... BUT fish were so old and too dried up to be worth$70+ \nWhatever...", "author": "Namuna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-05", "description": "All around a fan of the place in terms of sushi, udon, and service!  I guess delivery isn't the best from reading the other reviews, but eating in sure wasn't disappointing.\n\nThere are always seats upstairs according to one of my dining buddies, even at the noon hour.  The best tables are those closer to the window although be sure to look at the menu boards near the top of the stairs before heading to the other side -- the handwriting can be tough to see!  \n\nI get udon with veggie tempura quite often for those that eat out with me at Japanese restaurants (yes, you can request only veggie otherwise this place gives ~4-5 veggies and ~2 shrimps).  So, I can say that this place has an udon + veggie tempura combo that makes me pretty happy.  The udon itself is chewy (although it's not homemade for all you noodle aficionados, but for the price, I didn't expect that) and the broth is savory.  The tempura was really crunchy (double battered?) with very fresh veggies inside.\n\nI must say that my co-workers ordered a good variety of dishes so I'm able to comment on those as well.  One ordered a hand roll (menu page 2, top right) plus a regular roll (menu page 2, top left) and was happy & full.  Another ordered the salmon plate which they said was a really good bento 'box' (although it did come on a large square plate).  And, another ordered one specialty roll and some nigiri.  Be sure to ask how long the specialty roll you're ordering takes -- that can vary depending on complexity, so if you're in a rush to get back to work, be aware.\n\nWill be back to get my udon + veggie tempura fix when I've got an excuse to go out for lunch! :)", "author": "Jennifer Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-28", "description": "I go here all the time on my lunch because it's near my office and the sushi boats make for a quick lunch.  The staff is friendly and quick and the sushi is good.  Some other people on here have complained about the food not being fresh or making them sick, but I have never had any issues and have been here upwards of 10 times.  If you sit at the sushi bar closer to the chefs, you will be close to where they put the sushi on the boat to go around, so you can snag it first.  They stop making sushi for the boats at like 1:30, so if you go after that you'll see the same stuff going around and round. \n\nAll in all, definitely not the best sushi in SF, but it is good for what it is - a quick lunch at a sushi boat restaurant.  Gotta love that instant gratification!", "author": "C. G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "I really liked their chicken skewers. Meat was cooked perfectly! It was very savory. \nSushi boat was ok. I found some items being on an expensive side, and did not have enough toppings. Food seemed to be fresh.", "author": "nozima t."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-14", "description": "Sushi is decent and it's fun to do the whole sushi boat thing, but service from the menu or ordering takeout is slow. If you do did by the sushi boat, go towards the back to avoid the cold air coming in from the front door.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-18", "description": "My friend and I decided to come check it out for lunch. We sat at the sushi boat area and mainly just ate from it. They do a few things fairly well, such as seared salmon and their sashimi cuts, but I was not impressed with any of their rolls. \n\nMy biggest complaint is that it is quite expensive. The bill came to be $80 dollars (including tax and tip) and this is for lunch! I don't think I'd come back again.", "author": "Aleck L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "Maybe in the past this place was bad, but I didn't find anything wrong with it.  The sushi boat experience is excellent if you want fresh variety quickly.  Price was OK.  Maybe a bit high, but didn't feel it was too extreme for what I got.  Plan on $15 minimum with no drink.  Also, the prices are listed by plate type.  It's not as easy as if they just used colors because it's by sort of designs, but it's pretty straightforward once you figure it out.", "author": "Marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "Boyfriend and I went here pretty late one evening. It's usually a lunch place so it was absolutely dead. But we had good service and the food was super tasty. I would go back for lunch but I'm sure they're packed!\n\nGood sushi. Good teriyaki bento box. Our waiter was really knowledgeable about the menu and helped us pick out a sake to try.", "author": "Kiersten B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Love the sushi boats. Been here twice - near my work so I will be eating here often. Delicious - nicely made sushi comes by for your choice. Pay attention, though, because it may not come back by a second time! Attentive staff will bring your tea and miso soup if you like.", "author": "Laurie Anne B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "Yum! Looking for some good fresh sushi in the FiDi?  This is the place.  Sit down at the bar and watch the boats spin by.  A roll for everyone.  grab a plate have one, two or even 20 rolls! \n\nI am picky about Sushi (although the best I ever had was at a 7-11 in Tokyo, you be the judge).\n\nYou'll sit super close to anyone next to you, so shower up!\n\n$13 for 4 plates.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-15", "description": "Although this place is convenient for quick sushi lunch, it's not my favorite. It's inexpensive, but the selection is not as great as other Sushi Boat places. I come here if I'm in a rush or craving sushi bad, I'll stick to the miso soup, sake sashimi and spicy tuna rolls. \n\nUsually at a good sushi boat restaurant you see a selection of nigiri, custom rolls and sashimi.  This sushi boat often has rolls that are covered in sauces, which just hides the flavor of the fish. I've seen cooked salmon, egg, unagi and other items look like they've taken too many laps. If people are not selecting it, you probably shouldn't keep it on there. \n\nThey do have nice quick service, so if you literally have under 30 minutes - you can be in and out and on your way.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "Their upstairs sitting area is great.  I would recommend ordering vs the sushi boat which is less than appetizing.  It's definitely my go to sushi place in the area and their staff is always friendly and consistently making sure you are satisfied.  Word of caution: please make sure you have time if you go during 12-1pm as it is on the longer side of waiting time.  I would definitely recommend for the neighborhood and lunch time crowd.", "author": "Diana V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-17", "description": "I would give them zero star if there was a option. I went for lunch and got take out sushi combo. Sushi didn't seemed to be made the same day. It was so hard to bite and chew that it was the worst sushi I ever had.", "author": "Talwinder S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "This is for the boats ONLY (that is, the rotating boats of small platters that you can choose from downstairs). Amazing, delicious, and lots of variety. Too easy to spend too much money trying everything I wanted.", "author": "Mikah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "Excellent service! Really appreciate how they handled a situation of missing food :)", "author": "An B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-24", "description": "Here's the deal.  It is decent food.  The Udon is darn good, maybe the best I have had in SF, for sure in FiDi.  The sushi is just fine, but not the best sushi you have ever had.\n\nIt is quick and the waitstaff are great, especially since they are hammered when they are open.\n\nDuring lunch (which is basically the only time they are open), you feel comfortable grabbing something off the sushi boat because there are so many people around, you figure it can't have been sitting long.  There is another large seating area upstairs so if you come in, don't be afraid there are no seats because there may be some tables upstairs.\n\nGood portions.  Decent food.  Nice staff.  In and out quickly...that is more than you get at a lot of FiDi lunch joints.", "author": "Stacey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-30", "description": "It's like your a hungry bear waiting on your bait to float by.... In my opinion I like", "author": "Eli A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-23", "description": "I used to enjoy this establishment despite its exorbitant prices, but after a recent incident I don't intend on returning. A friend and I came in to be seated at the sushi bar. We were told seats were filled and were asked to wait at the front while the waitress closed out some other customers. We had no issue waiting; we had been there 10x before and we knew how busy it could get during the lunch rush. Five minutes later, with no guests having left from the sushi bar, two gentlemen entered and approach the hostess/waitress asking for two seats at the bar. The waitress looks me dead in the eye and brings the gentlemen right on over to be seated! Afterwards, she completely disregarded my friend and I as if we were invisible (small space, impossible to \"overlook\" us). Not only were we told to wait although there was indeed space for 2 at the bar, our spots were given up to two walks-in customers without reservation. We left immediately but that incident has really left a bad taste in my mouth. Really poor customer service and I've advised all my colleagues to stay away from this place. You can spend $30pp on lunch elsewhere.", "author": "Anna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-03", "description": "This review relates to a bad DELIVERY experience, which is completely my fault. I didn't realize that it was a financial district sushi place until after I ordered and ate.\n\nSo it's not surprising that I felt pretty ripped off after ordering from here. But that said, I probably wouldn't eat here for lunch either. It was:\n\n1. Over priced\n2. very small portions\n3. mediocre taste/quality\n4. 80 minute delivery\n\n-Nigiri was just ok except for the Ikura which I thought was good. \n-Special roll was terrible.\n-Teriyaki was three tiny skewers of chicken on a stick. weird, no sauce, and not much taste. Just ended up putting tapatio on it,\n-Tiny Miso tasted like from powder.\n-Tiny salad was ok.\n\nHave to remember not to order from here again. I wish there was an app that would alert you when you forget and order from a bad place again.", "author": "Casey D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-07", "description": "Womp womp. \n\nI'm giving them two stars because I've had a few enjoyable lunches here, but I won't be going back. \n\nI started going here because they are less than a block from my office and the boats make for a fast lunch. The staff is nice and some of the food is pretty good, however, they don't keep very close watch on how long the sushi has been on the boats, so if you're in there after noon, a lot of the sushi is dry and weird. \n\nlast time I was in, I grabbed two plates off the boats, and ordered three handrolls. They were getting ready to close, so I paid my bill before eating so they could close the register. My handrolls turned out to be full rolls, not what I'd ordered, but fine. I had three pieces of my $45 lunch, got a bad piece of fish and had to run back to my office before I started throwing up. My waiter asked if I wanted to take the rest to go, I croaked \"bad fish\" and he just said \"ok.\"\n\nThey might want to invest in some boat covers. It will keep their food fresh and tasty, and hopefully prevent future gut doom.", "author": "Fiona F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-10", "description": "Best place for fresh sushi. Very friendly staff, and service is quick, even if you sit at the sushi bar, and order from the kitchen", "author": "R M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Okay guys... it's not THAT bad....\n\nI was taken here by a co-worker who knew I like Japanese and was looking for a place nearby (SOMA Fidi) that was better than Sushi (not so) Fantastic or Tokyo Express.  \n\nYes, it's small and cramped but the sushi is definitely decent and for what you get, very decently priced.  The boats go by fast so for those of you with immediate gratification or regret issues (like me), you might tend to over-order.  I ate like a champ and stayed for awhile and the total tab was only $20!\n\nWould definitely go back!  Remember to try and go early to avoid the wait.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "This place is consistently good. Not the best sushi ever, but good. I sometimes go by myself and eat at the sushi boat counter, but you really have to go when it's busy, or the sushi gets a little \"stale\" and the selection is limited since there are not enough customers helping to rotate the selection. It's clean, the wait staff varies is friendly but sometimes a little slow to get what you need (at the sushi boat end). Upstairs, the wait staff is pretty good. \nI wish sushi places offered half rolls (maki) at lunch time, for people who want a variety of specific rolls without eating a ton of food. I would pay a little extra for this option.", "author": "Monica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "When food arrived it was pleasantly early. Deliverer kneeled down to floor level to hand me the bag (I have knee problems, and a cat who darts out and runs all over the halls unless I open door a thin crack and sit on floor.) and I passed him his money. Then, I saw there was no wasabi or ginger. I called, reported error-- in less than 10 minutes.he returned with the items. \n\nClass act. Will eat from there again. They even deliver until 11:30pm, on Sundays! \n\nPlus, what arrived was such good quality nigiri and at amazing prices. Upped to 5 from 4 stars after eating it - was REALLY fresh, thick slabs of salmon and maguro tuna. The unagi was perfect, too, not crumbling apart like a badly-folded burrito as crappy places make it.\n\nI notice people who go to Umi to eat have more bad reports than those who use GrubHub or call them for delivery. Noticed comments about it 'not being authentic Japanese' who made it. Who cares if it's 'authentic Japanese' - I'm not dating the chef, I am eating his work, and if he or she learned to do it and isn't from Japan I will never know the difference. I only care if it's authentic ahi, authentic salmon, etc. and caught sometime in the past day or two, not sitting around for three months.  \n\nI've been to places where \"authentic Japanese\" chefs served me exactly that, ironically; others are excellent, but would have given me a third the product I was delivered today.\n\nLoved that I got an amazingly fast, polite response to a picky complaint about a minor mistake.  I have had some sushi bars hang up on me when I told them they forgot the soy sauce and since I need to eat very low sodium diet, I asked them to please bring it. (Kikkoman's red bottle Chinese food soy sauce, sold in stores, is far too salty for my liver.)\n\nAll you need now, Umi people, is to lose the white ginger and go pink, even if it costs a bit more - it is classier and more importantly, tastes better. Without exception, until tonight, every place I've gone to which served white ginger in its condiment tray instead of pink ended up disappointing in  other ways, too: white ginger is found in Safeway shelf sushi, and in every fly-by-night sushi joint: it fails.\n\nI know this sounds picky and ridiculous to make a meghilla about, but the different things on a sushi plate complement each other's tastes and involve the flavour called 'umami', which is oft found in Japanese food: not sweet, sour, bitter or salty.  (Tapioca is supposed to be another example of umami.) The pink ginger is either umami itself, or complements umami fish tastes.  Miso soup also interacts pleasantly with it. as does green tea...along with the ginger, wasabi and fish, it completes a true authentic sushi experience!\n\nTake away any of these and it detracts from the whole shmeer.", "author": "Demimonde Mesila Thraam X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "I see there are a lot of mixed reviews. I thoroughly enjoyed my visit.  Looking around downstairs I saw the \" sushi boat conveyor belt\" at the sushi bar and immediately headed upstairs to sit at my own table next to the window.  It was a beautiful, sunny, but hot day and a window seat was nice because there was no a/c.  The service was great, everyone was anxious the please.  The sushi was outstanding, every bite tasted better than the next.  The soft shell crab was the only fried appetizer we had.  It was good.  Every sushi roll we had was visually appealing and bursting with flavor.  If there is more than three or four of you this place would be cramped and the atmosphere would be considered lacking for those folks that look for more than food when they go out to eat.  I enjoyed the food and the view from the second story window seat on spectacularly sunny and gorgeous day.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-08", "description": "I'm already not a big fan of sushi places in the FD, but since some of my coworkers said this place wasn't too bad the last time they came, I figured they can't go wrong with salmon teriyaki and california rolls.  \n\nWithin 5 minutes after we sat down at our table upstairs, the server came over to us and whispered that someone had complained about us being too loud.  Our immediate reaction was to shut up.  Afterwards, we're like wth?? This ain't no fine dining!  If you're looking to have a quiet lunch, go to the cafe or library! \n\nThe place got packed in another 5 minutes, which made the place even louder!  I can't believe the server even told us someone else had complained.  It's a restaurant...during LUNCH rush!  What do they expect?!?\n\nOn another note, we all ordered the hot lunch combo - 2 salmon teriyakis, beef teriyaki and chicken teriyaki with california rolls.  For some reason, one of the salmon teriyakis came out first, another 10 minutes and comes the beef....then chicken.  Weird?  Shouldn't they all arrive at the same time?  The beef was cold by the time it got to our table.  \n\nFood took really long, along with the complaint?  I don't think any of us will want to come back again!", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-26", "description": "Man, what a refreshing and tasty place to pop into in the smack-dab middle of the Financial District. I'm not a fan of the bustle of downtown, not to mention the thick of identical restaurants and cafes. It's great to have a family owned business in the FiDi amidst all the chains. It's pretty amazing to know that the people serving you at Sushi Umi, unlike many businesses around in the area, don't treat you like a head - instead, you're a friend. Most places in the Financial District get this wrong...Sushi Umi gets it right.", "author": "Aaron C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Basic rolls and sashimi are delightful. Me and some coworkers went for lunch on a Friday upstairs. Service was quick and attentive. Food was delicious and came to table after 5 min. I highly recommend the Garden Roll with fried asparagus. I don't ordinarily like fried food, but this added the perfect crunch.", "author": "Chanel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "Meh. Not the best sushi I've had, or even the best sushi boat, but for the fact that I can be in and out in under 15 minutes if need-be, that boosts my overall score a bit. Definitely some downsides to point out, though.\n\nI got there early, around 11:30, jonesing for some salmon sashimi and was pleased to have a plate float by pretty quick. Three good-sized pieces, definitely fresh - yes please! Next one I grabbed wasn't as good - texture told me it'd made a few laps. Not terrible, though, and I'm not sick yet, so that counts for something, right? I payed more attention to what kept making laps after that.\n\nI had a few of the rather generic roll pieces, about as good as any other place, no great advantages or disadvantages. However, they did have something I've not seen before - an avocado cut in half widthwise filled with fake-crap and topped with spicy mayo. Simple but awesome, I wish every place had this. \n\nGiant and #1 complaint - no posted boat prices. That's just ridiculous. How the hell else do I know what things cost?! I wondered where the list was when I sat down, but gave them the benefit of the doubt that maybe they'd cleaned the bar and forgotten to put them back. But Yelp tells me this isn't true. Rubbish! Putting the prices where I can see them when making choices is really not optional! \n\nOverall, this is a place I'll hit if I'm not too hungry at work and I need the food fast. But that's about it.", "author": "Marie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-31", "description": "Poor quality sushi when you dine in unless you order straight from the sushi chef. I feel like they leave that sushi rotating on their the whole day until someone picks it up, which of course causes it to dry up and lose it's freshness. The take out is not so impressive either. I ordered the $13 3 amigos roll and the portion was small and though the quality was better than on the sushi boat, it still wasn't great. Just overall not a good sushi place.", "author": "Junel S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "Its pretty good for lunch in downtown SF. The crowd gets going around 11:30am. I wouldn't go out of my way but its a decent place. The prices are fair. The service is good. The guy would always refill my tea. The hostess is nice. I would come here again but its not my go to sushi.", "author": "X X."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-03", "description": "Quick and easy financial district lunch.  If I have a colleague, friend, or business contact that I want to have a simple lunch with, this is my go to place.  Not really sure why the string of super negative reviews... the Sushi here isn't anything to write home about, but it's generally pretty decent and the service is fast (their lunch business is all about turning tables).  Environment is casual and I always like the ability to grab items of interest as they float on by.", "author": "Peter H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-04", "description": "Never going here again. Just paid $17 for the TINIEST 12 piece sashimi combo in the history of the world. I know this is the Financial District and everything including the air you breathe here is expensive, but 3 1/2 bites worth of meh quality fish is a crime.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Best spot for sushi in FiDi.  I don't know how anyone can complain.  Better than anywhere else in SF.  Fish is very fresh.  Prices totally reasonable!!!!", "author": "J K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-02", "description": "You can't expect the highest quality fish at places like this. Think about it, the sushi is revolving on the boat, for all you know, it's been going around and around for hours. \n\nGranted, for a place that offers revolving sushi, it was just sufficient for a quick lunch and a craving for sushi. It was very inexpensive and you can really sit, eat and get out within 20 minutes since you aren't waiting for any orders. The generic sushi and rolls (salmon, tuna, albacore, eel) all tasted good. You can't really go wrong with those, unless they are just super un-fresh. \n\nThe only thing negative I found was the uni. If you're a sea urchin fan, don't be swayed by the $5 uni plate. It has absolutely no flavor and I can definitely tell it was not very fresh. Save the fancy fish for fancy restaurants.", "author": "Yunah R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "It's a small place that's not too busy, but they do have some really nice sushis to select from on a rotating boat platform thing. Its yummy and the service was amazing! Come here to see your sushi past by your eyes on mini boats drifting before your eyes! Don't forget to checkin into Yelp on your mobile device through the app and you could get a coupon. I got one for a free Miso soup :D", "author": "Kevin C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-10", "description": "The lunch specials are a great value. Service was good and my friend got several refills on her soda. I will definitely be back.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "Thought I had ordered enough food for a bunch of us, but when they delivered it, it was so not enough. The delivery guy ran right back to the restaurant, and within 20 mins was back with a huge platter of sushi. Great service.", "author": "Rebecca S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-08", "description": "Here for lunch with my mom. Nigiri not very good. The sushi is ok.\n\nService was poor. Was told to choose any table so we did, but no one brought us menus so we got our own. Told waitress we were ready and she said she'd be right with us but took 10 minutes. I got the Sushi combo A and my mom got the chicken terriyaki. Food took about 20 minutes. 2 tables of 5+ got there after us and was served before us. Took about 10 minutes for them to bring our check back when we gave them the card. \n\nThey were nice, but service was poor.", "author": "Arthur C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "It is better than decent sushi, is fairly priced for the FiDi, and has fast and friendly service.\n\nThat's more than I can say about most restaurants near the Embarcadero BART station.", "author": "Jane D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "I eat here all the time.  Come early (right before 12 p.m.) if you want to get a seat at the sushi boat counter.  One of my favorite selections is spicy tuna in a one-half avocado.  YUM!  Usually costs me about $20-$25 per person for a really big sushi lunch.  I have eaten at some of the fancier sushi counters and spent about $80 or so.  I would much rather eat at Sushi Umi!", "author": "Marty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "There a few tricks to a successful sushi boat experience:\n\n1. Do not immediately start plucking sushi off the boat the minute you sit down. That sashimi might look like what you were craving but if it has a slightly glassy sheen, let it float on by.\n\n2. Check your neighbors to see if they have recently picked something, if it looks fresh, and they look like they can be trusted, pluck some of that from the stream. If not, wait until the chef puts something new down and begin.\n\n3. Proximity to the chef is only useful if you are on the side where he puts plates down, not at the end of the loop. In most cases this means siting near him in a counter clockwise position. A good sushi chef will try to rotate his placement, but sometimes design doesn't allow for it. \n\n4. When frequenting a downtown lunch establishment you must decide what is more important, ease of seating or a more diverse sushi selection. Getting there at noon means lots of sushi but also lots of people. A late lunch means easy seating but not nearly the selection. \n\nOnce you have these tricks down Sushi Umi is great. It is incredibly inexpensive for a downtown sushi lunch. It happens to be the exact mid point between my husband's office and mine, and we can get out of here full and happy for about 35 bucks, and he is the Godzilla of sushi eaters -instead of destroying cities, he builds them with tiny plates.", "author": "Stephanie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-28", "description": "***Good***\nQuick. Inexpensive. \n\n***Bad***\nQuality is questionable. Once got a seaweed salad that was half frozen. Mmmm.\n\n***Recommendation***\nGo here if you are craving sushi, aren't picky, and in a hurry.", "author": "Nick K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-28", "description": "Sad. Old lookin' fish on boats. I had an overpriced salmon lunch special. The fish tasted too fishy and old. Miso soup was WAY SALTY.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "I think this place must get their ingredients delivered on Sundays. I often order delivery from Sushi Umi on Sunday evenings and the fish is some of the freshest and most delicious I have ever tasted. The rolls are flavorful and the nigiri melts in your mouth. However, I've also ordered a couple of times on other nights of the week with more mediocre results. Besides that, the prices are decent, and the delivery service is prompt. Order early in the week and you won't be disappointed!", "author": "Simone L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-05", "description": "OOF!!\n\nCame here for lunch during the week and I have to say the 2nd star would be for the cute waitresses otherwise its 1 star.\n\nMy co-workers and attempted the sushi boat but after a few minutes waiting for our selections we noticed a funky smell.  Because I'm such a jerk =)  I pointed the finger at my female co-worker who then punched me repeated until a nice welt was formed on my left shoulder *ouch* LoL!\n\nWell, it was the water the boats were traveling in. I guess it wasn't changed for god knows how long.  So we asked to be seated upstairs.  That was somewhat better.  Now the food...\n\nEveryone ordered a lunch bento which was just ok.  I had the chicken teriyaki and it was horrible.  So f*cking dry!  It was like having cotton balls in my mouth!  I had food left over but didnt want to take it to-go.  This never happens.  I ALWAYS take leftovers home but it was just inedible.  I ate everything but the chicken.  \n\nCute waitresses though...  but if I wanted eye candy I would head to Centerfolds...  hmmm ..... gotta go!!", "author": "Sun T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-26", "description": "3.56 stars for reasonably priced and quality-ed sushi in Financial District. Good selection of nigiri and sashimi, and there were even a couple of uni options (yum). Short wait time since most patrons are salary-men/women on their lunch break.\n\nDo not stare at the sushi-boats for too long. You WILL become dizzy.", "author": "Julia C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-11", "description": "I go to this place for the sushi boat lunch at least once a week.  It's good although I would say a little on the expensive side if you're not paying attention to what you grab.  They fill your tea as soon as you take a sip out of the glass.  Fish is always fresh - never had a problem.", "author": "Betty D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-30", "description": "Eh, its sushi that's good for a quick lunch. Nothing to write home about. The selection on the sushi boats actually became sparse, they weren't very efficient about re-filling it and I started to watch the same pieces circulate again and again. \n\nThey also need to get a little more creative with their sauces. Yes mayo is good. Yes sriracha is delicious, but taking a California roll and topping it with those two sauces and then trying to be innovative by topping another California roll with sriracha and an avocado don't provide the most groundbreaking selection.", "author": "Analisa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-16", "description": "At Sushi Umi, you have the option of sitting at the boat downstairs or getting table service upstairs. I've tried a bento box off of their menu which was nothing memorable. More recently, I sat at the sushi boat downstairs and was excited to get my sushi fix. Unfortunately, nothing looked that appealing and I started getting dizzy from watching the same rolls pass by me over and over again.  While I tried 7 different items, I can't say that I would want try them again. The price of sushi is designated by the color of the plate it sits on. The wait staff tallies up your bill according to # and colors of your stacked plates but as I've just experienced, they may add up your plates incorrectly, give you an incorrect bill to which you may question the total, then they'll correct your total and not apologize. Feel free to float on to another sushi boat.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-06", "description": "Meh. Ugh. Why?\n\nThe sushi boat is MEH. Selection is very limited, repetitive, and all seem to taste the same. I don't like how they don't list the different plates with the corresponding price.. Especially for the \"special\" rolls, that end up costing me $5 for 2 little things they call sushi..\n\nSitting upstairs because the boat downstairs was packed... UGH. Crappy service, forgotten food (even after 2 attempts in reminding them), crappier food, and more $$ then waiting in que for the boat....\n\nWHY do I keep coming back? Well, I'm stuck is this crap of a lunch area called the FiDi.  And sometimes I want  sushi for lunch, so this is really the only place that's reasonably in price. \n\nIF you must come here, sit at the boat area, and AVOID the upstairs. If I have a minor sushi craving I rather go to Julie's Kitchen up the block and grab some over there.  YES, Julie's Kitchen has better tasting rolls,  fresher fish, and MUCH cheaper prices..   That's saying ALOT when a pay-by-the-pound-buffet has better sushi then a sushi joint...", "author": "Deanna T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-03", "description": "I'd never been to a sushi boat place before today.  My friend suggested Sushi Umi for lunch so I could try something new and I cheerfully agreed.  We got the last two seats available and ordered some tea.  I was overwhelmed by the selection of sushi quickly moving past us. Although I was more worried about freshness and quality.\n\nThe sushi was filling and cheap (I had 6 plates for $16.50), but it wasn't very good. Also, other than the eel nigiri, I had no idea what I was eating.  I tried picking out rolls I recognized, but to no avail.  It's kind of a guessing game. Luckily, there was only one item I didn't like (I still can't figure out  what the heck it was though).\n\nWhile it was a fun place to try, I don't think I'd go back.  \n\nBonus Tip #1: The lighter colored plates are cheaper than the grayish, brown plates ($2.75 each).\n\nBonus Tip #2:  Stay away from any fish that looks waxy/ shiny.  It's not the freshest fish in the boat.", "author": "Lara O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-11", "description": "Our group came here for lunch... Food came 45 minutes after ordering... They forgot 2 orders and proceed to ask if everything is alright... After reordering our order it was already an hour and we had to go... So we packed it to go... They had the nerve to include a 20% tip... I took it off and gave no tip because guess what, if you don't work for your tip don't have the audacity to ask for it... The waitress even reminded me that I gave no tips... I had to emphasize to her the reason... Avoid this place there's better around...", "author": "Nathan D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-24", "description": "This is only for their sushi boat!\n\nI've been wanting to try this place out for awhile just because of the decent-priced sushi boat and the fact that it's the closest sushi place to work.  The selection is better than I'm used to...they put some of their more special roles/sashimi out instead of the normal California Rolls that other places do.  The nigiri and sashimi always look and taste yummy and fresh (at least the ones I've tried).  However, the rolls are a hit and miss.  Sometimes they taste VERY fishy and it's not great.  Others are pretty good...you just have to figure out which ones.\n\nOverall, I'll keep coming back because it's quick.  You don't have to wait for anything unless ordering from the menu and it fills me up with sushi without putting a dent in my wallet.", "author": "Jane N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-15", "description": "I was happy to call an order in and pick it up for lunch. I work in Soma so there are very few sushi options out there... I drove over and the hungry me decided to park in the loading zone. I paid the meter thinking that maybe I'm lucky? Anyway, I came in, paid for it, it still wasn't ready so I hopped over to the walgreens next door. When I came back, my car was gone! Towed! So I went in to the sushi place to pick up my lunch and asked them if they had seen a car out front get towed. They looked at me in astonishment saying they asked their customers if that was their car as they called to have it towed.... What? Wow...  I'm not sure if they get money for every time they act like DPT but they will never get money from me again. And I hope this means for you reading this, too!", "author": "Danielly A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-11", "description": "My company orders from this place all the time. Yesterday I actually ordered in.\nWe got there around 12:45. There was no wait for the upstairs dining room and our service was quick! If you want to sit at the sushi boat there is only a 5 minute wait.The prices are definitely reasonable and it's always packed...which is a good thing. \nI recommend this place if anyone wants some good sushi and a quick lunch!", "author": "Lana K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-18", "description": "So when it comes to quality of food it is more towards the 2 scale, but it is more like a 2.5 because of convenience for me at lunch time.  The fact I can walk there in less than 5 minutes and my food is ready in 10 minutes is nice.  I have ordered food to go about 3 times and afterwards I am always disappointed in myself for trying it again.  The sushi is meh, even the seaweed salad is sad.  I think the most disappointing thing would have to be the teryiaki chicken, which is almost impossible to eat.  I really do want to like this place, maybe the fourth time around it could be a little bit better?", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "Kind of like the MacDonald's of Sushi.....\n\nHave to make up for that one star.  I have been working by this place for years and finally went in.  I am Snob when it comes to Sushi and usually make my own; the quality of fish when I went was good.  Ahi was fresh, not frozen. Unagi was good, Tempura rolls were warm and flavorful, I would probably only go when they are jumping and have a lot of stuff rolling out.  I can see how it would be kind of spooky with nobody in there.  I did notice they tend to sauce it up , with the mayo, Sriracha and ponzu.  \n\nFor what it is, a little Sushi boat place smack in the middle of downtown.  I got in and out of there in 20 minutes.  Did NOT see any things that made me go EWWWWWW!!!!!  Heck! You can see right back into the back of the shop where they wash the dishes, even the dishwasher smiled when I caught his eye.\n\nThey were extremely friendly and attentive; the chef even passed me a few dishes that looked good to me on the fly that never touched the boat.  We said our pleasantries and I was back to work.\n\n6 good sized plates & free Tea $14.68, will most likely be back...", "author": "Mitch F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-28", "description": "I have worked next to this sushi place for over two years and haven't stepped a foot inside, until last week. The image of floating sushi that hasn't been eaten in over an hour entering my mouth isn't a very pleasant one, but much to my surprise I was wrong. My co-worker tricked me into eating here by offering to buy my lunch but after my cheap amazing meal I will no longer need a trick to eat that sushi. It is nice to have the food ready when your hungry, it is fresh and the chef watches old sushi and swaps it out for new plates. I enjoyed everything I ate there and I will definitely be back for a quick bite! \n\nWe ate 10 dishes and a edamame plate for only $24.  Not too bad and I am feeling full.", "author": "Ashley M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "Disclaimer: This is the EXACT same review as Sushi Bune. I just moved my review from Bune to Umi. They had a name change and new management. It's only fair to give them the same review and star rating in their new name. They were under new management when I went there to eat. See http://www.yelp.com/biz/sushi-bune-restaurant-san-francisco-2#hrid:OsH1NwKzqAYckDdsskDpWg\n\n\"Their correct address is actually 132 Bush Street, not 130 (which is just 2 feet away). When you first walk in, it looks very small. But they actually have a 2nd floor for tables. The first floor is for the sushi bar. \n\nI went here with a friend for lunch yesterday (April 24, 2009) after the fidi lunch crowd (1:30pm).  We decided to sit at a table, so we went upstairs. As we walked pass the sushi bar, there were still quite a lot (and different) kinds of food, even though the crowd has died down. \n\nI ordered the Sashimi 9pc and a salamon skin hand roll. My friend ordered a vegetarian udon and a vegetarian roll (egg plant I think). The food came surprisingly fast (well, not that surprisingly since the fidi lunch crowd was mostly gone). The food was delicious. My sashimi plate was fresh and nicely arranged. Pricing is comparable to other fidi restaurants. Their sushi rolls are quite huge, which is a plus! The staff was very friendly and attentive. Towards the end of our meal, one of the waiter struck a conversation with us. We talked about the change of ownership there and his bike-route home. We had to cut the conversation short, because we need to go back to work. But he was a nice humble fellow. \n\nI would come back and recommend this place to others!\"", "author": "Sam W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-30", "description": "The line at Hi-Tea was too long, so I went to Sushi Umi for lunch today. I paid $17.50 pre-tax for 5 small plates and a Coke. For that price for a sushi lunch, I'm expecting something better. \n\nThe fish was of acceptable quality, in that it didn't make me sick, but it wasn't that great, either. I went during the lunch rush, so there was a lot to choose from. The nigiri was the best of all the stuff I ate (I had hamachi and mackeral). The skinny egg rolls were not very good, but the sauce they came with was yummy. \n\nAs other Yelpers have said, it's very quick and you can get in-and-out as soon as you need to. I was back in my office (3 blocks away) in exactly 30 minutes. \n\nThis won't be making it in to my regular lunch rotation because there are other, better spots in the area.", "author": "Anne M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-13", "description": "Sloooooooowwwwwwwwww.\n\nSlow.\n\nSlowwwwww.\n\nRepeat that for 26 minutes while waiting for a spicy tuna roll to go and you've re-lived my experience here.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-22", "description": "This should have been 1.5 stars, but waiters and waitresses were polite and prompt.\n\nI was going to Hi-Tea next door but it was closed.  Now I look back I should've gone to Noah's bagel instead.\n\nMost of the plates looked waxy, must have been floating around for a while.  I grabbed 2 plates from their sushi boat without knowing the price of each because it's not listed anywhere.  The waitress told me they don't have the prices listed, but said they go from $1.5 in increments of $0.5 (yeah, like that helps).  I don't understand why they don't list them out.  I still took 2 plates though, just to try them out.  A 3-piece salmon sashimi is $3, it was ok tasting, but definitely not fresh.  A 2-piece California Roll is $2, the rice was dry and it had a sweet taste that doesn't belong on a CA roll, maybe the chef cut the sweet egg roll before cutting the CA roll.  The seafood udon ($8.95) was ok (2 pieces each of salmon, shrimp, squid and other veggies).  Ended up paying $18 including tips, could've had better food, damn it.\n\nAfter going back to work my tongue still tasted funny, must have been the MSGs in my udon.  \n\nDefinitely and absolutely not going back again.", "author": "Peggy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "This place used to be called Sushi Bune, but now it's under new ownership and the menu changed - not much else changed. You can still use the old menu, but why? The new one is definitely more creative with their special rolls and the combinations are less confusing. I feel like the old menu had some bad japanese-to-english translations, but this is much more legible.\n\nI had a new roll: asparagus tempura roll covered in spicy tuna, mango, and candied walnuts. The spicy/sweet combo was awesome. Also, their sashimi seems like much better quality now. \n\nThe bad reviews for Sushi Bune were all about eating there, but I always take-out, which is super quick and easy. They just don't have good atmosphere for dining in.\n\nWith such a lack of good, inexpensive sushi in the financial district - I'll keep returning.", "author": "Sarah P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-19", "description": "We hopped in the place coz I didn't want to have a big lunch, I saw there was a floating boat sushi bar but the sushi is not covered, I kept skeptical about that, anyway, I ordered flied yam and I shared the CA rolls with my friend, yam was a lttle oily and rolls taste not bad. My friend's beef udon was ok. I found the dishes and the place were not clean, felt uncomfortsble afterward, I don't think I would take a risk again.", "author": "Rabbit C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-02", "description": "Their food is never that great, slow series, miss order, and food never served at the timely manner for group people. Most of us almost finished our food, and some people didn't even get their order yet.\n \nToday, the waitress was cleaning up the table, and knocked over hot tea cup and put the water all over my phone and my cloth. None of us blame her or yell at her. We were busy to see if my phone was okay and not damaged. No apology from her at all and just walked away. After that, she was trying to avoid me the whole time 'til we left. Even though, no one came to apologize to us for any of those lousy services. I will NEVER GO BACK TO THIS HORRIBLE RESTAURANT AT ALL.", "author": "Ginny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-07", "description": "Sushi boats!\n\nThey're fun, they're fast, and they whisk past your seat with cargo that ranges from surprisingly good fish (tataki is great) to the usual carb-heavy rolls (avoid rolls with fried stuff).\n\nIf quality is your thing, choose the simple nigiri plates or order off the fairly large menu. If you want fast and filling, your ship has set sail here. I'm a big guy and I can stuff myself for about $20 here, which is not possible in most FiDi sushi joints.", "author": "Raoul U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-08", "description": "The sashimi are fresh.  The service is attentive. The price is reasonable.  Nice place to get your quick sushi/sashimi fix.", "author": "D D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-02", "description": "A business contact shared this find with me earlier this week. The rolls were inventive and tasty. A bit too much rice on the rolls, but the fish portions were fair to generous. A good lunch place for a weekday sushi craving.", "author": "jeannie l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-16", "description": "I give it a 1.5 - Their service was mediocre. The prices are too high for the quality of food they serve.  And don't get their salmon teriyaki.  It was covered in some kind of salty seasoning probably to mask the fishy taste from it not being fresh enough.  The only thing good I had was the fried tempura but how can you really go wrong with that?  Needless to say, I won't be going here again.", "author": "Eva D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-19", "description": "dumpy place\nmarginal sushi\ncheap prices.\n$1.50-$2.50 per order!!!\nsushi on small plates floating on boats.\nquick meal, but buyer beware \ngo when it is busy otherwise you're eating charlie the tuna that has been spinning around the track way too many times.", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-07", "description": "Mediocre at best. Lunch at 1:30 and sushi on the boats looked like it was put out before breakfast. We split 3 rolls and decided to have the rest of lunch somewhere else. Yuck.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-05", "description": "I've only ordered to go from Sushi Umi. The prices are pretty reasonable for FiDi sushi, but the quality is not great. The last roll I got with unagi was so tough and chewy. The rolls will sometimes fall apart on you and some bites of sushi will smell really fishy. I'll go there in a pinch when I'm craving sushi, but will always regret it afterward when I remember the quality.", "author": "Tara D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "this isnt the most fanciest place but the food was worth the wait. I ordered a crazy horse and double sake and i was with some of my friends. The bottom has sushi boats with upstairs seating. The waitress were friendly and seemed to come to me whenever we needed something. The place was pretty packed and you can see the chef making sushi for the boats. So service=good. Overall this place is nice the waitresses are friendly, music playing, fresh sushi and not expensive. I recommend this place, they have delivery at night time too.", "author": "Jasmine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-28", "description": "My co-workers and I like to come to this place to get away from work and catch up. The ambiance is cute, but it's a revolving sushi joint.. you can't expect much of the sushi. The service is okay, the waiters/waitress fill your water cup often enough but when your'e looking for your bill.. they vanish.. LOL.. (it's happened to us twice anyway). We like enough to come back for a quick easy get away, that's far enough from our work place to let loose a little.", "author": "Penelope V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-07", "description": "Wow...I never thought I'd find a sushi place in SF that would make me happy to work in SF...again...thanks Sushi Umi!", "author": "Teri B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-08", "description": "When I go to new sushi places i like to try their sashimi to see what quality fish they use. The results from Sushi Umi: Poor partially frozen sashimi. I should have known. \n\nI'm giving it one star because my co-worker said their udon is decent.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "I really like this place. I haven't had a bad roll, and all of the fish is always fresh tasting. I basically work across the street and my office orders from them all the time. It's always good. Pretty simple, quality, reliable spot for some good sushi. It's San Francisco, of course there is better. If you work downtown and are looking for a quick sushi fix on your lunch break, stop in. I don't think you'll be disappointed.", "author": "Jeanie G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-16", "description": "Sorry babe, I know you love this place, but I can't say the same for myself.\n\nYuck.\n\nOk. Maybe it was because we came a half hour prior to closing but it shouldn't affect the quality of food or service. It wasn't the fact that there wasn't a lot of food out on the boats or the fact that the waitresses were busily trying to clean up for closing...\n\nThe food here I can't say was mediokre. I've had mediokre, I've had great, but this place falls pretty low on the scale. The sushi on the boats looked old and dry, so I asked to order a roll through the chef (we were hurried to order because the chef was about to leave). I got my norm a tempura roll and it was pretty blah. \n\nI really am not too crazy about this place, the lighting and decor in there didn't help. It wasn't \"warm\" nor \"trendy\" nor nice in general. It just felt like a bland room with dull flourecent lighting which made the food look dull and gross. Made my mood feel dull and gross.\n\nI was quite embarrassed to take my bf here for his birthday since I was planning on taking him to Tadich Grill which is a complete opposite from Sushi Umi (at least from what I read from the reviews of both places), but my bf insisted on Sushi Umi because he really liked this place and it is cheaper.\n\nAnyways, never again, at least for me.\n\nI hope to experience a better sushi boat place in the future.", "author": "Kat S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "Sub par sushi, slow delivery, and they forgot miso, chop sticks, napkins, spicy mayo, AND A SPICY TUNA ROLL!. We got the money back for that roll but the rest of the food wasn't even that good. Avoid this place!", "author": "Brandon J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-02", "description": "my stars are based in comparison to other sushi boat places, I have been.  For it being a sushi boat place, I must say this place is rather good.  It's cheap and the fish is fresh.  The salmon, tuna, and super white tuna (butter fish) are my favorite.  This place definetly satisfied my sushi craving.  I would suggest going on Friday, they have the most variety.", "author": "Deanna H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-17", "description": "This is not good a good sushi place.\n\nI sat down with a few coworkers at the sushi boat bar a few days ago. The sushi chef is creative, which I cannot fault him for, but people picking off the standard fare quickly (such as any sort of nigiri) leaves a lot of the more esoteric stuff circling the bar forever. This was during lunch hour too, when you would expect a lot of refresh. The sushi also had a noticable fishy smell, as if it wasn't quite fresh.\n\nWhat really killed it for me is when a coworker pointed out the grime (and possibly mold) that had collected under a refrigeration unit on the bar. He had accidentally bumped it while lifting a tray off a boat. This is something that every boat passes under. I have to wonder when their next health inspection is.\n\nNeedless to say, I didn't eat a whole lot, and had an early dinner elsewhere.", "author": "Higgins D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-01", "description": "Good cheap, fresh sushi. Really liked the uni with fresh quail egg inside an avocado half. Didn't try the rolls. Stuck with the nigiri.", "author": "Gary W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-08", "description": "I work downtown and go here about once a month. The sushi boat is good to sit down and pick at as they float by. Sit closest to where the chef puts the goodies out or you'll get stuck with the leftovers. \n\nI usually order some hamachi, maguro and sake to go. I think they raised their prices for 2009 cause I spent over $11 on these 6 pieces of nigiri which used to be about $9 not too long ago. I always feel the fish is just a tad cooler than room temp, and kind of slimy. Not the best, but it's ok. \n\nI think I'll stick to the boat, but may cut down on visits. Not too many choices for quick sushi in downtown though.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-17", "description": "This place sucks on many levels.  Don't do it. Even if the line for High Tea is too long.", "author": "patricia b."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-15", "description": "I will keep this simple. Stay away from the chicken!!! THE most disgusting food I have ever had! And, it is $8.75! 90% fat, 10% undercooked thigh meat. Absolutely horrible! I made the mistake of trying it a 2nd time thinking maybe the first time they just had a bad day. Even worse the 2nd time! Ewe!", "author": "Jessica E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-12", "description": "It is what it is, it's not the best sushi in the world but if you are looking for a fast and decent sushi lunch in the FiDi this place is perfect. It's a sushi boat restaurant so you can sit down and start eating right away so it's great if you only have an hour for lunch but are craving something better than a pre packaged California roll. They have pretty good nigiri and some decent rolls and it's super fast. I will be coming here often for lunch. I got pretty full for about $15.", "author": "Cathy T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-14", "description": "Still on my quest to find decent sushi in the Financial District. I guess I should just give up on trying to find a place that will give you your money's worth because that ideal doesn't exist in the Financial District. Unless you hop on that 5 for $10 frozen food deal at Safeway. Anyhoo...\nI thought I'd give Tokyo Express a break from my face and try out Sushi Umi, a place I always walk by but never drop in. It was empty at 11:10. The sushi rolls looked lonely as they drifted in their little boats. I ordered the: Lobster, Spicy Tuna, and Hotate nigiri. Lobster roll is one of their specialty rolls with lobster meat. Lobster usually gets me excited but not their's. It was real dry but at least the pieces weren't modest. The tuna in the spicy tuna wasn't too bad but the roll itself didn't taste right. The scallop nigiri was on point. It saved me from feeling less angry about spending $18.08 on small portions. That sushi boat is still beckoning though...", "author": "Tatiana D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-13", "description": "I just recently went here not knowing that a new owner had taken over.. I was expecting the food not to be all too great..but, it came out good..I had the chicken lunch deluxe..it's 3 chicken skewers, salad, miso soup and 4 california rolls.. overall, I liked it..would go back..\n\npreviously, under the other owner (the name was sushi bune I believe)..I had the beef bento and the beef was not good at all..", "author": "Linda Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-17", "description": "Avoid this place as much as possible. Being stuck downtown with nothing good, I thought I'd give this a shot (since it's so close to my office.) Bad idea, I went in, sat down for their boat thing and selection was very meek. Let alone most of the workers were sitting across from me eating as well. When I needed something, I had to flag one down, she would wash her hands, then come to me. Service was not the greatest. The workers were talking extreamly loud (really sounded as if they were yelling at eachother). But all in all food was not good, service was blah, and over all, just avoid it if you can.", "author": "Dave Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-25", "description": "I've gone here twice. Once, it was probably 4 star worthy: good sushi, good selection. Today, I went again, and it really was a 1 star experience. \nThe only good time to come here it seems is before 1:30pm on M-F. I went here once at 12:30pm, when it was nice but crappy service, and today around 1:45pm. Well, the prices are reasonable, but the sushi is neither fresh nor consistent. Just looking at the sashimi made me sick: dry, discolored, left out to circulate on the boats for quite a while. And today, there really wasn't anything to pick out from either. I ordered a few rolls and it took nearly 15 minutes to make them (3 total: caterpillar, philly, and rock n' roll). Neither me nor  my husband liked it too much, and were extremely disappointed. \nBottom line is: if you're going to go, go during rush hour lunch (12-1pm), or don't go at all. I'd rather recommend Sawaii sushi a few blocks over, or Miyabi sushi express which is about to reopen in april underneath the Mckesson building.", "author": "Katia T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-05", "description": "don't go there...........\nno service .............\nThe food quality is the worst. that i have never been...........", "author": "Leon c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-05", "description": "this spot used to be sushi bune, think they changed owners/name about a year or so ago. not as great as it used to be. not much variety as far as sushi boats. the one plus is that they have walnut prawn tempura roll. sooo good! today wasn't a good experience.  i ordered a side of gyoza while eating at the bar but after 20 minutes, i flagged down a server and asked him that if my order is not ready, please cancel it.  he proceeds to the kitchen, talks to the cook and comes out but instead of telling me what happened, he continues helping other customers.  i flagged him down again after waiting 5 more minutes and asked him the same thing.  he said that he already cancelled the order....um..where you planning on letting me know? jeez. i'd rather walk the extra four blocks and eat at toyko express, its sooo yummy there.  thought i'd save some walking time...guess that was a bad idea.", "author": "Yien S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-02", "description": "I went here with a group of people from work and from the moment we sat down it wasn't good. It took a while for them to take our order, bring out our food and to top it off, they missed one of our orders. It took the whole entire lunch hour for them to have her food prepared. They didn't even comp her for her meal. The service and food was not good. Just avoid.", "author": "Phuong P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-13", "description": "i just had the tempura udon...thinking you couldn't go wrong with tempura, but was a bit surprise that they boiled/cooked the vegetables and shrimps before frying them...the shrimps don't taste fresh either.", "author": "stella h."}
