{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Not sure what's with the recent negative reviews. I've ordered from Sushi Fantastic on numerous occasions and their fish was always fresh. I've been picking up Meal Pal here recently and have been quite happy with the food. \n\nPrice wise they are in line with most other FiDi places which is $15+ if you want fresh sushi. I usually get a Chirashi bowl which comes with a salad/soup if I want a variety of fish. Otherwise I'll get one of the rolls when it's offered on Meal Pal. Skip the cashier and pick up your meal towards the back of the restaurant. There's no wait as they have all of the food ready to go.", "author": "Tim G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-14", "description": "I only came here with a friend because we felt like having sushi, didn't want to walk far from my office and BART which he took, and most other places nearby were closed. \n\nThey were out of all sushi a little before 8pm on a Thursday night, so he ordered unagi don and I ordered chicken teriyaki don. I got so much chicken teriyaki and my friend got so little unagi even though his bowl was pricier! They both came with lettuce and broccoli.  \n\nService wasn't great, could've been friendlier. \n\nHonestly the interior is rather dirty and not welcoming and I'm surprised they haven't been further inspected by the health department. I can't imagine people wanting to come in just because it looks so unattractive inside, but I guess they have a good takeout business. \n\nI may be back just because the location is so convenient, but will try not to eat inside again.", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-12", "description": "The sushi here is vile, greasy filth, barely fit to be fertilizer for my plants, let alone to be food for humans. \n\nI got takeout from here (sushi A, a six-piece nigiri sampler and a spicy tuna roll, which I got instead of the standard California) and will never return.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "The ordering-to-eating process is relatively quick. You can order individual items but they also have combos and meals. Photos and clear descriptions also remove the guesswork. Loved the efficiency!\n\nUsually, I'd go for the sashimi meal or the bento box. They have most of everything a Japanese spot does - and even ramen.\n\nThe front door is in the middle of a block on Howard St (unsure why yelp says it's on Fremont St); metered parking all around helps but it's walkable from FiDi and Market St.", "author": "Peter L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Good food, decent prices, cozy casual environment, great for lunch. Always call ahead if want to order out...or eat in ...otherwise the wait can be pretty long in the afternoons. Best time to go is a 11am for early lunch or 1pm for late to avoid the crowd in between. No expectations to be wowed out of your mind...but its cool enough. Definetly get a Dragon roll, thier litely Fried Potstickers or Hot and Spicy Ramen. My favs....", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "I ordered the Chicken Katsu with Tempura ($10.50) to go. This dish came with rice, cabbage, and miso soup.\n\nThe 4 pieces of tempura and Chicken Katsu had a thick outside bread layer which made them very crunchy and flaky. I liked the tempura a lot even though it was very oily. Although the outside layer of the chicken was crunchy, I thought some parts of the chicken were chewy. Not too sure why, but the chicken tasted fine. \n\nThe Chicken Katsu sat on top of the bitter and raw cabbage slices. I ended up dumping tons of cabbage pieces into my miso soup, but I realized it was a bad idea since the soup didn't add much flavor to the cabbage. My friend bought the chicken teriyaki combination, so I ended up dipping the cabbage into the teriyaki sauce.  The cabbage tasted 1000x better after this. If I had Katsu sauce, the cabbage would have probably tasted even better.\n\nThe miso soup did not have a lot of seaweed and tofu. Then again, I dumped a lot of cabbage into the soup, so the cabbage may have overpowered the soup and the toppings too much. I did like how the miso soup was not salty!\n\nThis place has good value and I can picture myself coming back in the future.", "author": "Kristina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-13", "description": "I had their sushi when using meal pal (it also came with miso) and it was great! I definitely will be ordering again to try some of their other rolls. Good portion size too.", "author": "Emily M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Can't believe you won't give me a small plastic bag for my 2 boxes of take-out from you.  I didn't have 10 cents to buy a damn bag since I didn't bring my wallet to pick up my stuff.  Thanks for your generous customer service, you RBF waitress.", "author": "Lola L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "I use to go to you guys specifically for your tasty ramen, but you changed your ramen recipe in the past month and it's...not good. I'm sorry. Please change it back, pls. I'm desperate.", "author": "Lindsey C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "Not the freshest fish or rice in the area for the price... and the miso is particularly salty. Not a long wait given the lunch rush!", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-13", "description": "Seems like a popular choice for lunch for those working in the area. I use to work on the other side of Market so i'm used to Tokyo Express but this place is basically the same concept. We came after the lunch rush so we got our meal in about 15 minutes. \n\nI got the chicken katsu bento box. The bento box gives you tons of items, but I felt like the katsu was dry and hard to bite. The chicken and the tempura were bland imo so I'll probably get something else on the menu next time.", "author": "Keizzel C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "Decent food delivered fast.\n\nSushi Fantastic, located near the heart of corporate San Francisco, offers a wide variety of to-go Japanese dishes as well as a sit down area.  Choices of sushi, ramen, bento boxes, and katsu are on the menu, and I tried their Chicken Katsu with veggie tempura.  The Katsu was standard, a tad over breaded and partially bland.  There wasn't any Katsu sauce provided, a huge misstep when serving up the otherwise dry dish.  The tempura was equally overbreaded and while it did come with some dipping sauce to go, the sauce was minuscule and only provided enough moisture to cover half of the tempura order.\n\nService was relatively fast and cheap, as I placed my order and received it in under 10 minutes for around $10.  If I go to Sushi Fantastic again, I'd steer away from the Katsu.\n\nGood food if you're in a pinch for time and need some Japanese cuisine.", "author": "Nadav P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-28", "description": "I got food poisoning from here after having one of their sushi combos to go.\n\nThey should re brand themselves as Sushi Horrible.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Pretty great sushi! The service can be spotty but the food itself is pretty solid. You're definitely going to find better sushi in less touristy areas or in Japantown, but if you're in the area and looking for a quick bite, you can't go wrong here.", "author": "Jake B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "It's time I update my review. After reluctantly trying this place again I've got to say I'm impressed. \n\nSushiritto is way down on my list now and Sushi Fantastic is coming back up!!!\n\nWhat's changed. The freshness and quality of their sushi. Their rice game has improved greatly. Sushiritto is so disappointing at the Market street location. They gave me so little fish the sushiritto was gross!!!\n\nI recommend going to Sushi Fantastic now. It wasn't worth going there before but I've changed my mind after a coworker recommended I go try again. \n\nOk so what should you order... I'd recommend the Alaska roll because I'm a big salmon fan and it's only like $6. If that's not enough for you, like me, I'd order the crunch roll also about $5-$6, it has tempura shrimp in it. I've order those two plus a crunch cal roll before for a total of about $17. \n\nOf course if I'm lazy and I'm looking for a variety I'd go across the street to Sushi Fantastic again and again. But if I'm looking for fresh raw sashimi with rice for about the same price I'd go to Grubbies. That's my kind of place :) but I'm glad this restaurant listened and improved their rice. Way to go! I'd definitely come back. In fact, I'll probably go once a week because I love sushi and there aren't many decent places around.", "author": "Kimberly W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-08", "description": "Meeeeh. There's not a lot of Japanese to-go places close to the financial district where I work, so when I'm in the mood for sushi, I settle for this place. Sushi fantastic isn't fantastic, but it gets the job done for the most part.\n\nMy usual order from here is miso soup, salmon sashimi (5 pieces) and an avocado roll which comes out to be a little over $13. Be warned, portions are on the smaller side and it won't fill you up unless you order more (and by that point your lunch might be closer to $20). \n\nAtmosphere is gross, hence the low rating. It's like stepping into a dim, window-less (the only natural light you'll get is through the door) and dingy basement - not the most appetizing, especially when you're serving raw fish. It honestly feels pretty humid/stuffy in here too (again, not the best combination for serving raw fish), but I haven't gotten sick from this place yet (um yay?).", "author": "Rebecca L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Sushi is delicious and it makes an excellent meal alternative. After walking by this place several times, I decided to dig into sushi for lunch. I looked through the menu and ordered the Philly Roll. I tried this item at Tokyo Express Stonestown Galleria before - it was good. Overall, fresh ingredients and delicious sushi. I enjoyed it and will come back again.\n\nThere are cups available for water. If you are thirsty while waiting to retrieve your order, feel free to help yourself to a cup of water.\n\nProps to prompt service, good food and friendly staff. Pricing is reasonable and facility is kept clean - bonus points to that. Good first experience here!\n\nChairs and tables are available for customers eating in.\n\nThis is certainly a good restaurant to go and get lunch at. If you work in a nearby office looking to get sushi for lunch, come on in to Sushi Fantastic.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "The worst ramen...ever.  Grossly bitter and salty \"spicy miso\" soup base with nasty noodles -- no, just no.  $13.13 down the disposal.", "author": "Dynamic D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-19", "description": "Not really what I would call fantastic. Has too much of a store bought taste to all of its dishes. Can't compete with so many other options in the area.", "author": "Nick J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-14", "description": "This is a great sushi spot for the price and speed. Order ahead online and enjoy fresh delicious sushi in no time. No complaints about this spot.\n\nUpdate: my order today the rice was terrible and hard and old or something. Downgraded to 3 stars. Quality control guys!", "author": "Penguin P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-24", "description": "$12 for lunch -- chicken soba with 2 pieces of tamago nigiri.\n\n- chicken soba ($8.95): typical of what you'd expect from the broth/noodles. mixed dark/white meat chicken, comes with sarku/sorabol style veggies: cabbage, broccoli and sliced carrots - is this what costco sells?\n- tamago nigiri ($2): wow did these two pieces of tamago come straight out of the fridge? they were freezing cold, and really sweet. the rice here is also not sushi rice jam packed -- so missed on both fronts\n\nthe food wasn't great, but the quantity was pretty hefty for the price", "author": "Kristie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "Came here for lunch, ordered 3 sushi rolls for $17. They were standard, regular rolls. I guess this is standard pricing for SF. Did not include any miso soup or salad. It was just OK. Nothing great, not good value. I would probably come back only if I was really craving sushi, otherwise, I won't be returning.", "author": "Marie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-07", "description": "I continue to give this place chances just based on convenience but i cant spend anymore money here. You can get the same quality sushi at grocery stores and to go service has only been ready when they stated it would be 2 out of 10 times.", "author": "Ross C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "It's been a couple years, and things have changed. I'm older, wiser, and have a few more laugh lines, and I still love bento boxes. \n\nPrices have gone up about 9% in the last 2 years, which is tolerable considering how much SOMA has exploded. Came in today for the Chicken Teriyaki & Tempura Bento Box ($9.50), and am pleased to see that nothing's changed - not even the tempura distribution (one shrimp, one broccoli, one sweet potato, one bell pepper). I have photographic evidence, I'm not Rain Man. \n\nThere's still free green tea and prompt service. The chilly wind still blows in because they leave the doors open, and people still spill drinks on themselves by tripping up and down the awkward staircase in the middle of the restaurant. \n \nAnd I'm still into it, all of it. I'll be back.", "author": "Laura B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-18", "description": "The food here is decent, I've tried there bento lunches and it's very very basic not a lot of flavor. There gyoza is also lacking flavor but are fried, and the California rolls are good.", "author": "Kayla S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "Yesterday's take out Tonkatsu ramen contain a fly-like bug. Yes... BUG! \n\nExtremely grossed out. Since I work somewhat further away, there was no point in me going back to the restaurant and complaining. So here I am. :P\n\nPicture here (Tonkatsu Ramen with a side of BUG):\nhttps://s3-media2.fl.yelpcdn.com/bphoto/4DkxK75Q9h9zRERuzGNONQ/o.jpg", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "To be accurate, this restaurant is a 3 and a half stars - YELP should allow a half star increment rating, currently it does not! :) Anyway back to the review, overall , it was an \"ok\" experience, but several small adjustments can lead to big improvements!\n\nWhat I liked:\n- The Salmon Sushi and sashimi, were tasty and really fresh!! \n- While waiting for yo, you can serve yourself (self service) some green tea, and water\n- Seating overall is acceptable - outside seating area is limited to 1 or 2 small tables\n\nWhat needs improvement:\n- The soup was almost cold... On the Sushi and Sashimi side, everything else than the \"Salmon\" tasted average (or below).\n- What you get might be slightly different than what you ordered: I ordered the Sushi and Sashimi combo, that includes 2 shrimp nigiri. Though (I imagine they were out of shrimp) the shrimp nigiri was not there... it was substituted! It would have been nice to ask the customer before choosing the substitution!\n- I do not like \"SNEAKINESS\", and i felt this was \"sneaky\": for to go orders, they automatically charge you for a bag... it is nothing much, though they do not even ask you, they charge you without telling you.", "author": "Gilbert B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "Accessibility - they have a wheelchair lift to get you to the counter (it's up 6 or so steps). Can't review the food because it was out of order when I tried to visit.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-14", "description": "Best deal is a bento box imo. Fast and affordable overall. Would not order sushi here.", "author": "Geoff U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "Review for the Spicy Miso Ramen\n\nThe ramen isn't as bad as I was led to believe by previous reviews but it also isn't amazing. The soup is flavorful and the pork tastes good. The noodles are pretty bland though and seem very similar to spaghetti noodles. I think I could make a bag of Shin ramen taste better for much less $$ though so probably won't be coming back.\n\nI ordered it online for pick-up before going. The wait for pick-up for Thursday lunch was only ~10 minutes and it wasn't too busy when I went in to pick it up either. The ramen was $10.", "author": "Rica Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-07", "description": "I've give them a three point five\ncontrary to belief, I'm still alive\nReviews said their ramen was flavorless and bland\nSpaghetti noodles and broth from a can\n\nBut I retort, all those reviews had some deception\nBecause some were straight up lies to get attention\nTheir ramen wasn't bad, a little steep for about nine dollars\nBut it's not so outrageous that to eat here you have to be a baller\n\nTheir ramen spicy miso I'd get it again\nTheir right next door, so they'll be my japanese restaurant friend\n\nOK, so the reviews said 3-4 stars and I'd agree.  But one thing is that their food must be decent because when I went there, they were really busy.  Ordered through Yelp (Eat 24) and took about 15 minutes.  Note you have to pick it up at the register.  The spicy ramen miso wasn't bad at all.  Wasn't awesome, but was decent.  I'd come here again on a rainy day.  The price is indeed slightly steep, but nothing ridiculous.", "author": "Dennis K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "Sushi Fantastic is one of my regular lunch spots. A bit pricey for the quality and quantity available, the food is consistent with each visit. The rolls are simple, and even their premium rolls are somewhat small.The sushi tastes fresh and their bento boxes are super filling (for maximum cost effectiveness I'd recommend these over the sushi and rolls). Many of the menu options come with miso soup which is nice.\n\nThis is a good place to grab a quick lunch or dinner if you work downtown. There is a good amount of seating and free, self-serve green tea for all guests.", "author": "Irina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-25", "description": "Shame on me for not reading previous reviews BEFORE going to this place.  First, I rarely leave my office for lunch.  Today I had to run an errand.  This place was on the way back so I stopped in to grab something to go.  Hands down the WORST chicken udon soup I have EVER had.  Maybe five pieces of chicken that were so incredibly dry I wouldn't feed it to my dog.  Tasteless broth and two pieces of broccoli.  This probably wouldn't  bug me so much if I paid $5.00.  It's not even worth that.  But they have the nerve to charge $10.50!!  This place is a serious rip off.  And, to add insult to injury, the lights above where the food is being prepared are filthy.  If you're desperate for sushi go here.  If you care about what you eat, stay away.", "author": "Jane F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-10", "description": "Do not go here. 25 mins for a to go order of two rolls. That's insane. It's the equivalent to going to subway and making you wait for 25 mins.\n\nIts also not remotely authentic tasting. Again would you go to subway for a really good sandwich? Probably not.", "author": "Pick P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-27", "description": "NOTHING FANTASTIC AT SUSHI FANTASTIC\n(2.75 stars)\n\nBoring FiDi lunch review, skip if you please....\n\nIt's ideal to keep expectations low when it comes to random lunch venues in FiDi. Didn't have much expectations and that's that. Japanese? No. These people are Chinese. \n\nThe yelp plaque on their wall clearly shows 3 stars (out of 5). That is ALL I'm going to say because it's self explanatory. \n\nHAWAIIAN SUSHI ROLL ($5) - ahi and mango. Barely tasted the mango. Bland. All I could taste was the soy sauce, ginger, and wasabi AFTER dipping the roll. I don't get it, what's \"hawaiian\" about this roll. It didn't have a hint taste of ahi poke or the tropics in any way. \n\nMISO SOUP ($1.50) - it was decent. Did not have much tofu. I could get larger portion and put as much green onion and tofu at Julie's Kitchen down the street. \n\nWill I be back? No thanks. \n\nUntil the next review...", "author": "Jane A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-18", "description": "Sushi Fantastic is one of those Japanese restaurants where you can get basically any Japanese food item you can think of. Nothing is particularly good, but nothings terrible either. I usually get the combo deluxe or the curry. Both are just fine and they're pretty quick to push food out of the kitchen. A good spot to pick up and go.", "author": "John P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-03", "description": "I think the place is under rated using the standard of a $$$ type. I have came here twice and both time satisfied with what I got. Ordered curry once and ramen once.\n\nFor $12 in this area, the portion is good and taste is better than average.\n\nAlso, so many people wait in line to pick up the food or order during lunch.\n\nCan't expect much service giving the price point. I would recommend this place for a good lunch option.", "author": "Cindy J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-21", "description": "rainbow roll was very skinny it was like a miniature roll. the fish wasn't good compared to a lot of other rainbow rolls I've had. I asked for spicy mayo and another sauce on the side and it was $1 each. pretty presentation and fast service was the only good thing about this place. the chicken teriyaki box was very good but nothing special.", "author": "Dash J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-05", "description": "Not \"Fantastic\" at all. In fact, the absolute worst Chicken Don I've ever had. It was grilled chicken, flavorless boiled veggies, plus an egg made in the microwave. Why is anyone even selling this? Never again.", "author": "Kristen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-07", "description": "Fish was not fresh and salmon roll was tiny.  Miso was super salty and 2 very very tiny pieces of tofu and 3 slivers of seaweed in it.  Special bento meals and cooked food are probably much better options here.", "author": "Priscilla C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-28", "description": "This is a rip off. Look how tiny that piece of sashimi is. I ordered the $20 sashimi and felt like I got 2 pieces of sashimi you would get anywhere else, cut into 20 pieces. \n\nI would stay away from this restaurant of you enjoy sushi. The only fantastic thing is the tennis streams on tv.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-02", "description": "Easily the worst sushi we ever had. Sushi was basically the microwaved out-of-the-box sushi you get at safeway. Store itself was hot and stuffy, no AC.", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-12", "description": "It's not as bad as some other reviewers have said. That being said, when you walk across the sticky floors and sit down in a stuffy noizy room it should be no surprise when your nigiri arrives luke warm and the salad is sort of brownish.", "author": "Tim T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-27", "description": "not the greatest sushi in the world but this place is reasonably priced for the area which make it popular during lunch. Suggest ordering ahead to avoid the long lines.", "author": "Rod M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "I rate this place high as a daily meal option while working in the FIDI area.  This is not a fine-dining sushi joint. I wouldn't drive across town for this restaurant or use it to entertain clients but I believe it is a GREAT option for someone who wants a quick, affordable lunch.  In fact, this is one of my FAVORITE lunch spots in the FiDi area.\n\nI'm usually not a tempura fan but the tempura (along with the sauce to dip the tempura in) is especially delicious here.  I also love the teriyaki combos and the individual sushi rolls.  \n\nThis place uses Yamasa Soy Sauce.  Yamasa Soy Sauce is a LIGHT soy sauce  (ie has a thinner texture and is brown in color) than the DARK soy sauce most Americans are used to (think Kikkoman's near black soy sauce as an example of dark soy sauces).  Light soy sauces are saltier and stronger tasting than dark soy sauces (since \"light\" refers to the color and not the taste), so make sure to use less soy sauce than you normally would.  Otherwise, you might over sauce.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-11", "description": "For a kind of fast food sushi place, it delivers. I would recommend it for lunch.\nDelivery time is sometimes too long, so I always pre-order online.", "author": "Carlos L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-16", "description": "I had some ramen here earlier today since I got the flu. \n\nI have to say I haven't had Ramen that was more bland! And the pork was more fat than meat!\n\nI'm not sure how the rest of the food is on the menu but skip the ramen like others have said!", "author": "Norbert D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-04", "description": "I would give this place a zero star if it was possible. Awful service. She didn't even know how to take our order and then our  beef terriyaki came and the meat tasted like Mac Donald's hamburger meat. So disgusting. We asked for an exchange or refund and she refused to do anything. We had to just walk out. Never go in here.", "author": "Zee J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-10", "description": "My coworker brought us here for lunch last week since the weather was perfect for going out. \n\nI decided to try their Pork Cutlet Don (lunch) that comes with miso soup and salad. \n\nI was expecting something similar to Katsudon but sadly it was not what I received. I thought it was going to be tender golden pieces of juicy pork lightly covered in a egg batter topped with a sweet/salty sauce. \n\nI ended up with a limp colored pieces of pork that was cooked relatively well but lacked flavor. Didn't care for their coating but for the portion and price, it was certainly a fair deal. \n\nIf you want fried pork over rice with katsu sauce on the side than their Pork Cutlet Don is perfect for you. \n\nOverall Thoughts\n\nNot what I had expected so I am left a little confused on how should review...", "author": "Eddie W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-11", "description": "Raw Chicken Terriyaki!\n\nJust got part way through my first ever meal from Sushi Fantastic, but I had to stop.  Apparently the owners are unclear on the concept of Japanese cuisine.  The fish is raw, not the chicken.  \n\nAppalling that a business would serve chicken so poorly cooked that a portion of it is completely raw.\n\nGuess I'll have to wait and see if I get sick from it or not.", "author": "Philip O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-18", "description": "Ramen? No. The place is pleasant the ramen is not. Try other things if you eat here. \n\nIt was by definition edible but not good. Noodles we like bad spaghetti. The broth resemble cloudy water. My (half) egg was cold in the middle. \n\nSeveral people came in after I did so other items might be better, but skip the ramen.", "author": "Reed J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-11", "description": "The sushi and sashimi is pretty good. Good price. Efficient service. \nGreat for lunchtime. Im a regular because i live nearby n its always my pick of close japanese place thats inexpensive.", "author": "Anudari K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-17", "description": "Best place in San Fransisco. Order the Bento combo.  You get everything great! And the owners are sooooo nice :)", "author": "Shane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "This place is fantastic!! I was skeptical by the appearance and staff. It didn't seem very authentic and I was expecting Safeway quality sushi. But wow! It blew my expectations away!! \n\nI had the sushi combo b which includes Nigiri, a California roll, a soup and a salad. I also got a seaweed salad (that was ok). But that combo for $11.95 was SOO good. The fish was soft and melted in your mouth. The California roll was moist and flavorful. I didn't even need soy sauce! This is definitely going to be one of my go to spots for lunch now in the financial district. It's great because you go to the counter to order so you don't have to wait to pay the bill at the end of your meal. Get it and go! \n\nCan't wait to try everything else there.", "author": "Joanna S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-15", "description": "I'm not sure if I've ordered the wrong things or it was not so \"fantastic\" as it sounds.\nBare in mind I came to this spot with absolutely no expectations.\nI live just a few blocks away and thought to have a quick lunch before my meeting.\n\nI ordered: \nUni Nigiri - Around 8 dollars or so\nAn Unagi Don - Around 13 Dollars\nSalmon Sashimi - god knows\n\nAs i mentioned i went in there with no expectation other than to have a quick bite, fill my belly and go.\n\nWell the lady came back telling me that they actually don't have any Uni. \nSo I changed my order to Ikura and hamachi.\n\nLong story short. \n\nThe Unagi Don had a fried egg on it. \nWhich i didn't mind, Also a lot of vegetables underneath the Unagi slices.\nWhich i didn't mind either. \n\nIt tasted like cardboard. It was dry, tasteless. THAT I DO mind.\nI mean...\nHonestly speaking.. Its really hard to screw up on an Unagi bowl... You can go to to Nijiya supermarket. Get the whole eel that comes with the sauce itself, heat it up and serve it and it wouldn't even cost 13 bucks.\nTheres also only a few tiny slices of Unagi On top of the gross vegetables.\n\n\nThe salmon sashimi was great! I think i paid 3 times of what i'm suppose to receive. I think they sliced 2 pieces of salmon sashimi into tiny pieces and serve them as a whole order!\nThe substitute hamachi also tasted a little dry.\nI'm glad the Ikura was okay.\n\nIf you work near 1st and 2nd street while craving for sushi. \nJust order grub hub, post mate it. At least get the money's worth.\nSpare your change for a homeless on this one.", "author": "Alui L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-02", "description": "Friendly staff and a clean atmosphere, the food here is great and the sushi is way under rated. Fresh hamachi, ahi, and salmon, tasty ramen and the bento lunch boxes are a great deal. Highly recommended!", "author": "Alex R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "This was my first time eating here.  I'm an avid sushi fan.  I lived in Japan for 4 years and ate my fill.I went for dinner so I don't know what lunch is like so my review is based on this.  I was surprised by some of the negative reviews complaining about the quality.  If you want high end sushi with a full dining experience then this isn't the place. I think some failed to recognize that this is a FAST FOOD sushi joint! I was pleased with the freshness of the fish, the diversity of the menu and the friendliness of the staff. If you want sushi fast and on the run, then this is the place!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-20", "description": "Seriously a fan! I do not understand the low reviews. It was delicious and tasted fresh! They even have amazing lunch specials and the staff is super friendly and accommodating! My favorite item was the dressing on the salad, sooo good!\nThe only flaw is the rice, it was a bit hard and overcooked.", "author": "Adela A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "I ordered to go but waited for a very long time. Food here is good, but expensive. There are bunch of similar restaurant in SF, and i don't think this one is a good choice.", "author": "Jenny Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "Their chicken cutlet with tempura is really yummm. They pile on the chicken, the tempura is just right and the salad is the good kind. Oh and their rice is tasty. \n\nI'm really not sure what all the complaining is about. First, you can't go to an almost-dive restaurant and order sushi. Hello people. Second, who cares if the woman isn't overly nice.  It's sad that this place is getting rated down for that.  Update:  I don't think she is there anymore. A friendly guy always takes my order. \n\nOne thing is that I don't think they are Japanese. Maybe one of the servers. But the majority of the guys in the kitchen don't look, talk and act like they are Japanese. I haven't verified. But I guess it doesn't matter much for a great, inexpensive lunch in the city.", "author": "AnneMarie W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-13", "description": "Long wait, sushi quality is soso.", "author": "Don L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-04", "description": "Awful rubbery teriyaki that I suspect was not real beef. How do you mess up beef teriyaki? And the miso soup was oily and gross. I complained to the manager and she just argued with me and refused a refund. Horrible experience all around", "author": "NY Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "If you want bad customer service, and terrible sushi, than this is the place for you!", "author": "Erwin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-04", "description": "Ordered food and it took 25 minutes to come out. Had to be back at work so they packed it to go with no utensils. Don't go here.", "author": "Ron P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-26", "description": "Revising to 2 stars after they served me some choke-worthy mushy (old/improperly stored!) shrimp.\n\nGag.", "author": "Nicole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Decent sushi. I recommend the Super dynamite if you are into tempura rolls. Affordable", "author": "Juan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Hey, after 12:45 PM, the customer line dies out a bit.  For a bento box, just to think I was a big eater, leftover for home plate.  I like the air fan while waiting and standing.", "author": "BanBan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-14", "description": "Avoid.\n\nRamen was MSG-ish and hard-cooked egg sulfurous. Oshinko in maki was not crunchy. Saba nigiri had bad texture. My friend couldn't eat his tonkatsu--he said it was unpalatably dry.\n\nIn some cities, this might have gotten two stars, but in SF there is no excuse.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "We came here for a late lunch about 3:30 (maybe early dinner?) and had the chicken bento box and the salmon bento box.\n\nShe brought us a bowl of miso soup to start.\n\nThe portions were very generous and all was very good.\n\nI wish they had mentioned the free tea. I didn't notice it until I went back to ask for a to-go box.\n\nThis place is fine, if it's on your way to where you are going anyway, but I wouldn't go out of my way to come back here.\n\nTonight we are going to the Eureka Theater to see  \"The Cable Car Nymphomaniac\"", "author": "Foodlover B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-15", "description": "Cool sushis, the place is nice too and at the heart of the city. Great choice in the menu, and you'll be served fast so it's good for a mid-day escape to Japan and back to your next meeting in the Piers area.", "author": "Boehm B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-06", "description": "I don't get the point in ordering ahead of time and spend thirty minutes waiting for your order when you arrive to pick it up. This has happened too many times. I'm done with this place.", "author": "Terrence P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-19", "description": "A-OK for Sushi Fantastic.\n\nI had just gotten off the bus as I was making my way to The Contemporary Jewish Museum when I decided to stop for a quick bite to eat for lunch. As usual, I was craving Japanese food and as usual, pork tonkatsu. I knew I better eat ASAP as I was getting a hunger headache. I walked on Fremont Street and saw Sushi Fantastic. Great, this will hit the hunger headache spot.\n\nWhen I walked in, it kind of reminded me of a now defunct Japanese restaurant called Oiishi. One can either get takeout/take-away food or eat on the premises. I wisely chose to eat on the premises. If one is eating in, s/he orders at the counter/till and receives a number. The food is brought to the table. \n\nI ordered the tonkatsu lunch and an order of tamago. The tamago was okay, it tasted semi-fresh. Tamago should taste fresh and moist; this one was kind of dry . The tonkatsu was A-OK, it was served with miso soup, rice, and salad. All in all, it hit the spot and killed my hunger headache. My one regret was not taking a photo for the yelp post.\n\nSushi Fantastic shares the restrooms with the other tenants at this location and requires a key. I got lost trying to find the bathrooms in the back of the building before eating. A delivery person I encountered was kind enough to guide me. Now going back was kind of a challenge, it was like being in a labyrinth. Fortunately, I remembered a few signage postings and was able to find my way back.\n\nSushi Fantastic killed the hunger headache. I would return only if I was in the area and another case of the hunger headache strikes. A-OK for and from moi.\n\nFresh Review #4 of 100 Yelps! for 2013.", "author": "Chiara A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-11", "description": "This location is close to work, convenient, and pricey, but it is SOMA. I always get the beef bento box which is my favorite and superb. The bento box is a lunch box, but it looks like they can serve the boxes after 3pm which is after their specified time, but not sure and maybe just an exception. There gift certificate is a good deal if they still offer it. Buy $100 gift certificate and get extra $20 for free for a total of $120. But in case that is incorrect, ask the restaurant for more details.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-30", "description": "Narrowly better than fast food level.", "author": "Jianfei H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-24", "description": "When I worked in the office at Howard & Beale this was my go-to lunch spot.  I would pick up takeout from Sushi Fantastic about 2-3 times per week.\n\nMy standard orders were the Hawaii roll, New York roll, and/or Negihama roll.\n\nThe restaurant accepts LevelUp so that was a huge bonus.  I've received a number of $5 credits for my patronage of Sushi Fantastic.\n\nI definitely recommend stopping by for lunch if you work in the area.", "author": "Brian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-08", "description": "I had a Chirashi that was pretty good. The order also came with a salad and miso. The sushi was average but the price was reasonable. I  might have given 4 stars but the chirashi was fairly small.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-14", "description": "I want to support Sushi Fantastic, which has quite good sushi and a friendly staff, but it's been harder lately.  A standard sushi combo takes 20 minutes, and twice - last week and today - they've neglected to include ginger, wasabi or soy sauce with my to-go order.  Not sure whether the issue is training or staffing, but I hope they get back up to par soon!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-16", "description": "Bento box to go took a good fifteen minutes.  Meat was dry and not great tasting, sashimi did not taste fresh or good.  Expected better for the price.  2nd star only because tempura was actually pretty good", "author": "Erik S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "I came here and I must say, it's made to order and pretty fast on my lunch hour. Pretty good but kind of bland and wish it had some seasoning in the broth. Overall, it's good.", "author": "Larry F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "Spaghetti noodles aren't ramen. That's not okay. I ordered this to go and was very sad when I got home and opened it. Regrets. They were friendly and prompt and the place was clean, but that hardly matters when what you call ramen is actually spaghetti!", "author": "Laura H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-18", "description": "Good. Fast. Reasonably Priced. I really like that they have mugs of tea for while you're waiting for pick up orders. There's also a no-nonsense attitude exuded by the staff that I appreciate. The bento boxes are good sizes, and I was pleasantly surprised today by the fish curry box.", "author": "Marcel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-01", "description": "Fast food not cuisine. It's cheap and relatively fast. I had the ramen and it seemed thin, salty and like inexpensive noodles.", "author": "Will D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-14", "description": "Where do I start?  \n\nThis place is lucky since its one of few sushi places in the SOMA area.  I went here for lunch one day with a friend.  We were both excited to try some \"fantastic\" sushi.  As I approached the cash register to place my order the cashier took a call on the phone and put her hand in my face so I could stop talking....gave me a dirty look and turned her back to me......excuse me??? What the f kind of customer service is that?  She had a bad attitude and was RUDE RUDE RUDE!  The dirty look completely threw me off and I wanted to walk out but my friend was starving and convinced me to stay.  And her 10 pounds of make up couldn't hide how ugly she was on the inside.  Clearly miserable and unhappy and really left a bad taste in my mouth before even trying the food.\n\nThe food was below average.  The chicken teriyaki tasted like it was cooked a week in advance.  Food was blah.\n\nI will NEVER come back thanks to the attitude I got....NO THANKS!!! You just lost another customer.", "author": "Samantha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "First off..your sushi is not fantastic.  It's about a step above the sushi you can buy pre-made at Safeway.\n\nSecondly I don't appreciate the nasty attitude you gave me when i placed my order today...I wont be back.", "author": "Ripley B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-21", "description": "Better than Tokyo Express. \n\nService was mediocre.\n\nGood proportions for the price, though! Also speedy service. Would recommend for a quick, on the cheaper side, sit down lunch. I ordered the combo of California rolls and sashimi which came with salad and soup. Was definitely full towards the end and even able to bring some back to my desk at work.", "author": "Stephanie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-16", "description": "The Sushi here is not Fantastic, but it is not terrible either.  It is probably the best price for sushi  you will get in the Financial District.\nThis is my go to lunch spot when I feel like Sushi, but only because it is close and the price is affordable (by FiDi standards).\nOrder a Chirashi Bowl, Fantastic Bowl, or a Sushi Combo B or D (ironically there is no such thing as a Sushi Combo C).", "author": "Solomon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-05", "description": "Good food, nothing amazing but a really great spot for lunch and a quick Bento Box. I've tried the Chicken and Sashimi both of which were good but no different than other place. Location is convenient though and service is fast so definitely worth coming to if you feel like a quick sushi lunch in SOMA!", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-12", "description": "I think this place deserves a 3.5, but I\"m not going to give them a 3 and hurt their score. I think they are getting a bad rap from sushi snobs. \n\nI went here 2 times so far. One time I ate in and the other time I got take out. \n\nThe place is very busy at lunch. That alone should tell you that they have a large client base that loves them. You don't go to a sushi place if it's just okay and keep going back. Typically a \"just okay\" sushi place leaves you with a bad taste of fishy fish and you never want to eat it from there again. \n\nToday I had the Sushi Combo D and a Spicy Tuna Roll side. All of the fish tasted very fresh and had no unpleasant fishy vibes. The spicy tuna roll was done very well and the California roll was good too. \n\nI used to be very critical about Miso soup when I went to sushi restaurants, and this miso was pretty good, even as takeout back at my desk. \n\nThey are busy, so you have to wait a few minutes to get your food. Expect that. That is not a minus star. \n\nMy only negative from my experience was that I got 1 small thing of soy sauce when I could have used probably 2. \n\nI am looking forward to going back. This is way better than USushi on Market.", "author": "Mack L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-08", "description": "I wouldn't say that the sushi here is fantastic, but it's not that bad! I'm surprised to see such a low average rating when this place is always so packed for lunch.\n\nI go here quite often as it's the best sushi place around the SOMA area for sure and it's decently priced. I usually go with a salmon bento box and the portion is very generous. Their seafood tempura udon is a good choice if you're in the mood for some soup. I recently tried their sashimi and was also pleasantly surprised! Until a better sushi spot opens in SOMA, it's safe to say that I'll keep coming back here.", "author": "V L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "No, no, no. I really want to like this place, as it's very close to work. The one star is for the friendly wait staff, & the portions are generous. The sushi is far, far away from being edible for the most part. I've been here several times & they always serve at least one or two disgusting pieces of fish! Today, I the culprit was hamachi. Two pieces were foul-smelling & I had to spit it out right away. The mgmt would be wise to look at serving better quality fish. Even if the portions are smaller, the fish is not something that a \"real\" sushi chef would be proud to serve. I worked at a sushi restaurant for years, & I would recommend that you stay away from this place until mgmt team gets some integrity.", "author": "Aaron L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "Sushi Fantastic, meet Appetite Humongous!\n\nA new lunchtime sushi place has opened in the FiDi near the Transbay Terminal with the rather bold name of Sushi Fantastic. In fact, it opened today, so I was able to try their still nascent menu. Although they offer udon dishes, rice bowls and bento boxes, the only things they could offer on their grand opening is the sashimi and sushi. They certainly have their priorities right, as it was a joy to have such fresh fish at lunch.\n\nI had their $10.50 Fantastic Bowl, which seemed a bit steep until I saw that I got five fresh, good-sized slices of maguro and five of the salmon over a rice bowl with a few alfalfa sprouts and plenty of tobiko scooped onto the top. It comes with a small salad, which they unfortunately doused with their soy-based dressing (I would have preferred it separately), and a cup of edamame. That's actually quite a bit for lunch.\n\nIt's an industrial-looking space where you climb some steps to get to the actual counter. There are small tables on the ground floor, though I took mine to go. For a first day of business, the service was pretty efficient, even though they had to disappoint many prospects with their limited options. With all the buildings quickly sprouting around this area, I can see this place getting popular with the office crowds. Moreover, they're obviously emphasizing their catering abilities for groups and parties.\n\nBTW...despite the address on their menu, the entrance is on Howard between Fremont and Beale.\n\nFOOD - 4 stars...fresh sashimi...I need to come by to test the rest\nAMBIANCE - 3.5 stars...industrial-looking but a lunch crowd is not likely to be picky\nSERVICE - 3.5 stars...surprisingly sunny for a first day\nTOTAL - 4 stars...fresh sashimi is always worthwhile and if the rest of the menu delivers, it looks like a real lunchtime contender for workers in the immediate vicinity.", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "Place is always packed but California rolls are delicious, portions are nice and shrimp tempura was great!", "author": "Aisha H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-02", "description": "I'm writing this review at work, where Sushi Fantastic just catered our monthly all staff meeting. I'm an admin, and generally am in charge of catering these meetings, so I know what kind of service to expect from restaurants in SOMA. They're generally very accommodating, punctual, and great.\n\nSushi Fantastic is NOT so. They were 45 minutes late with our delivery, which means my colleagues are sitting in their lunch meeting without lunch. The coworker who ordered lunch called Sushi Fantastic three times before they showed up, and they were incredibly rude over the phone--a very \"What do you want us to do about it?\" vibe. \n\nThe food arrived, and while the presentation was great, they forgot our gyoza order and instead sent three orders of teryiaki chicken. The delivery person was out the door before we even got everything on the table. When my coworker called to complain, the person at the restaurant said they were \"very busy\" and that they would do what they can.\n\nHowever, the food itself was mediocre at best. The tempura was cold and kind of stale tasting--probably because it sat somewhere on the road for 45 minutes before it got to us. \n\nA horrible, horrible experience with Fantastic Sushi. We will definitely not be ordering from them again, and as an admin I would advise anyone interested in catering to find an alternative, as there are plenty of places in SOMA that are truly \"fantastic\".", "author": "Ginamarie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-27", "description": "Had a quick dinner here of spicy tuna roll and rock n roll.  Thought it was excellent.  I am not an expert on sushi but I've had it enought to know this was fresh and good quality.  Great for a stop before hitting the bus home.  $9.75.  Not sure why the subpar ratings, maybe new ownership recently?", "author": "Marc S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-01", "description": "Good value for the area. The owner is really nice and friendly. The specials are decent with 2 rolls, soup, and salad for ~$11. Overall the pricing is as low as it gets for sushi. The fish is fresh although the ambiance is really basic. I would recommend the gift certificate as you get $120 for $100 and can use it right away. The rolls are good as well. They close a bit early (8pm) and are not open on weekends but are by far the best sushi place in SOMA as far a decent fresh sushi that is not too expensive.", "author": "G L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "Solid sushi place in the SOMA area, where there aren't a lot of choices.  Definitely gets pretty crowded around lunch, but there's a nice open space across the street.  It's perfect if it's sunny and nice out in the city.  \n\nI've been told that a good way to judge a sushi place is by the chirashi bowl, so that's what I got.  It was a little bit pricey, about $13 for the bowl.  It comes with a pretty simple salad and a bowl of miso soup.  Don't be surprised by the size of the chirashi bowl.  It looks small, but it's pretty deep.  The fish itself was above average.  Very good texture and consistency.  There was a lot of rice in the chirashi bowl, but it was good quality as wall.\n\nService-wise it was okay, nothing remarkable positive or negative.\n\nOverall, this may become my go-to sushi lunch spot when I'm not feeling fancy.", "author": "Erwin V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-24", "description": "Food was OK but what I am most disturbed is that Sushi Fantastic decided to help themselves with a $2 tip from my credit card pick-up.  Anyone experience this too?  I ask because if it happened to me, more than likely, it has happened to others as well.  Consider this a fair warning.  I've escalated this theft to my credit card company Chase and I will no longer step foot in their establishment again.", "author": "K L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-16", "description": "Wait for 30 minutes for one ramen. And everyone behind me got their food. And no one apologize for this. Unbelievable.", "author": "Elva C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-15", "description": "totally decent lunch place. It's 4 stars as far as lunch goes. 3 stars in terms of general sushi-ness.\n\nI got the Chirashi and it was a good amount of fish for the price (actually cheap compared to better restaurants chirashi prices) about 14 bucks.\n\nI'd def come here next time I have a lunch hankering for quick no frills sushi. Tip: Make sure you come in at noon or before. The line explodes after that.", "author": "Shanee B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "Decent food coupled with unpleasant lady taking orders. It is what it is. Surprised that our thirty second conversation actually irked me enough to write this.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-25", "description": "Not good.\nThe food tastes so cheap, and not fresh at all.\nThe service is even worse, the lady who took my order looked like she hated her job. She mumbled the price to me, and I couldn't hear so I asked again what she said. She kinda rolled her eyes at me and said 'what do you think I just said?'\nNot cool!", "author": "Hyewon C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-01", "description": "Sushi Fantastic just lost a long time customer.\n\nTo be honest, the good here is not great at all, but it's across the road from my building, so I go regularly when I need to grab lunch in 5 minutes.  Today, I went over and ordered a donburi bowl, which I've had in the past.  It's not great, pretty bland, and usually I put a few packets of soy in to give it some more flavor.  So, when there was nobody at the takeout counter where the soy sauce is located, I grabbed 4.  I repeat, FOUR packets of soy sauce.  I did not grab a fistful, I didn't load my pockets, I grabbed 4 little packets.  Somehow, this gave the b*&ch who works there (who always looks pissed off and has a bad attitude) the right for chastising me.  Loudly, and inappropriately.  I am not exaggerating when I say she grabbed the soy sauce out of my hand and demanded that I was only allowed one packet.  I was embarrassed, shocked, and most of all, just pissed off.  That level of customer service is deplorable, and I will never, ever find myself here again.", "author": "Jenna H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Look. It is what it is. If you work in the area and have a hankering for fresh fish with seasoned rice (and you don't have time to GO to take in a sushi experience) this place is better than most. You're not going to plan a trip around coming to this place. But on balance this place is maybe just short of the expectation set by the name. \n\nA huge plus for this place is they make your sushi to order. So you're not pulling it from a refrigerated case or having something that was otherwise previously made. The rice was still a bit warm (or maybe just not cold), if maybe a bit gummy. In fairness, I took it to go - so let's assume the rice would have been perfect if I had more time for a proper lunch.  The fish was tasty and of good consistency. \n\nAnother plus is the price. Two hosomaki and a spicy salmon roll ~ $11. Don't judge me on the latter, purists. I'm trying to branch out. \n\nOverall. I'd walk the five blocks it takes to get to Fantastic rather than eat at the food court in my building.", "author": "Damon T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "Pretty standard and safe sushi and bento boxes. Bento boxes Come to about $10. They also have curry bowls that are decent. There is some seating, but it gets pretty full during lunch on on weekdays. I come back here because the service is pretty fast and portions are quite sizable.", "author": "Foo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "Cheesy name. That's for sure.\n\nQuick sushi spot that attracts many SOMA workers during the day time I'm sure. I'd consider it a quick bite sushi joint, or a place to order togo. We were the only ones here at around 5:00pm on a Tuesday night.\n\nPrices were fairly cheap. My friend ordered 3 maki rolls, a handroll, and miso soup for under $19. I ordered an avocado roll, philly roll, and water for under $9 which isn't bad.\n\nThe sushi was average. I had my rolls and tried a piece of my friends'. Another said that his roll was salty. Service was good. Bathroom was a journey to find.\n\nConclusion: quick sushi fix for cheap.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-24", "description": "This is just a quick and convenient lunch place, nothing more. The quality and taste of food are only worth of 2 stars. I won't be back unless I am super desperate.", "author": "Lydia L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "I got a chicken don bowl. This is not a chicken donburi bowl! This is more like a cheesy teriyaki chicken with rice bowl. Yuck!!!", "author": "Sammi V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-15", "description": "If you keep the order simple and make detailed notations in your online order it will come out correctly.\nSometimes subpar sushi is better than no sushi... unless it's raw.", "author": "Edi B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-12", "description": "Food is mleh. Have tried chicken katsu, sushi rolls and ramen.  Pretty much was what I expected for a Japanese/sushi place in FiDi. Just not many places to choose from in this area.\n\nThe katsu from the Japacurry truck is much better. The ramen noodles are very mushy, which makes me question if they are instant noodles, and the broth is not flavorful at all. How does spicy miso ramen broth taste neither spicy nor like miso?", "author": "Perle D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "Tried the Sushi Combo for lunch and it was decent. Quick service.", "author": "Raghav A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "Took out once, Ate here once, Catered from once. All wasn't bad. I do have to admit that I was a bit hesitant on testing this place out because of the reviews. Both staff persona and food reviews had me guessing. But I gave in being that its literally less than a block from the new office. First round was take out through a colleage. Had the Umekyu & Spicy Sake rolls for about $7.50 all together. Good sized rolls and made for a nice light lunch. Second try was dine in. Prepared to be so rudely treated I was greeted by a very friendly woman with an endless smile. I was instantly put at ease. This time I went for the Fantastic Bowl (minus the tobiko). It was a perfect combo of my two favorite...salmon and tuna. Although a little on the thin side the 10-12 pieces atop sushi rice made for another perfect lunch. It also was accompanied by miso soup & a salad for $13.85. Last but not least we catered in for lunch yesterday & boy was I blown away by the spread! It was so popular by the time I got around to grabbing a plate there wasn't much. Just slim pickins. The sushi was a hit. The gyoza was gooooone. I was lucky enough to come across less than half a try of the teriyaki beef and chicken. I lucked out. I wouldn't normally order these items at a japanese restaurant since I'm a sushier all the way but their teriyakis made me think of it as an option next time. I'm really content with the food this place offers. Prices a buck or 2 more than usual but hey I'm in the FiDi once again. The service and staff from MY experiences couldn't have been any more pleasing. Fresh & generous portions at a Japanese place steps away from me? I'll take it!", "author": "Stephanie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "Probably one of the places that actually has a pretty good california roll. That says a lot about a sushi place. So my coworkers and I didn't want to wait in the line at Cafe Venue, so we walked a few more steps to this place instead. I ended up getting the sushi combo B, which has 8 pieces of california roll and 6pieces of nigiri. Oh, they also include miso soup and a salad, which most places don't give if you're getting take out. So for the price, it seemed reasonable for lunch. The only thing is, they're all in different packages, so it makes it pretty cumbersome to eat outdoors. \n\nAnyways, I guess about the food. The california roll was actually enjoyable to eat. The fake crabmeat was soft and drenched in some sauce. The sushi was also fresh, unfortunately, since I was sitting in the sun, I think the fish got warm. Although the fish didn't get slimy, it's still weird to eat warm sushi. This place has a potential for me to go back again.", "author": "Stephanie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-07", "description": "Chicken bento box - chicken tasted slightly burnt. Nothing remarkable but not bad for $10. Decent rice, but that's about it. Didn't touch the salad that came with it because the dressing looked odd; the miso soup was OK but also not good.", "author": "Gleb P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-15", "description": "Opinions opinions! I read other reviews and most are just opinions about a specific taste, not necessarily a bad experience: One person said too much sauce and too sweet another said too bland. LOL \n\n Variety: \nThis place totally fine. its conveniently located across the street from my office and has decent sushi and a wide variety of bowls, boxes and sushi. \n\nWait time: \nThis place gets very busy at lunch and they're not incredibly fast. Since I'm not a fan of waiting that took one star away. (also they don't have a lot of room for people waiting. I always seem to get in the way of waitresses or other customers. No matter where I stand, I'm constantly getting shoved up or down the stairs) \n\nService: \nThey've never messed up on an order (to go orders are the worst, when you have a screw up!) They always package everything nicely and give you chopsticks, forks, napkins, soy sauce, ginger, and wasabi. And they they're very friendly and speak fluent English! \n\n\nQuality/ Taste:\nI wouldn't call this Fantastic, but its ok. For a quick bite to eat, close to work, no gag reflex and no food poisoning you're good, so I'd come here again. However as I was eating my lunch I was reading another review about the freshness of their sushi and I realized that it was true and not incredibly fresh.....this knocked off one star. I definitely would NOT ORDER PLAIN SASHIMI. I had a Hawaiian roll which I believed masked some of the not so fresh flavor but it was still edible and didn't have a fish smell or taste to it. \nI am a major fan of the miso soup though! So yummy, I can totally taste the soy paste in it and its not just hot water like other places. \n\n\nValue: \nThe bowls are great. The amount of food you get for $8 is fine..... for San Francisco standards.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "If you are looking for a quick lunch under $10 that will be ready in less than 10 minutes and have you back in the office before the boss notices you are gone, then Sushi Fantastic is a good option. If you are looking for high quality sushi, teriyaki chicken, and mouthwatering tempura, you might want to head over to Japan Town instead. \n\nI ordered the Bento Box Lunch special with teriyaki chicken and found myself adding whatever I could find on the table to cover up the less than savory sauces on my plate.\n\nI will probably wind up there again at some point, mainly due to peer pressure from co-workers, but will absolutely steer clear of their lunch special and go straight for what I hope will be fresh sushi.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-10", "description": "This is it--this is the bento box lunch place I've been looking for!\n\nI'd give it three stars as a sushi spot, but four stars as a lunch spot.  It was super quick, totally decent, filling, and came with free hot tea.  It's definitely going in the regular lunch rotation.", "author": "Dana S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "I usually go to here for lunch. There are many choices and I like bento box, such as salmon  or tuna. Soup and some vegetables are served too. I want to try some sushi and sashimi in future.", "author": "Jia Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-11", "description": "I think there is a SF city ordinance that there must be a sushi place every two blocks.  Sushi Fantastic opened in the spring of 2007 in what used to be Dogzilla (http://www.yelp.com/biz/6gZSyFUA_f-odUOwm73AGg).  This is a partly fast food Japanese (?) restaurant where you walk up to the upper level, order, pay, grab a number, and find a seat in the lower level.  Sushi started in old Japan as a fast food, so I guess this is fitting.  \n\n100% non-Japanese.\n\nHow could I tell?  Here are the clues:\n- A bottle of spicy hot pepper sauce on each table.\n- American mushrooms in the miso soup.\n- Miso soup comes with a spoon.\n\nFOOD:  Sushi was not Fantastic, but also not deadly.  At their price point, it is unfair to compare them to any of the upscale sushi bars like Ino Sushi or Murasaki.  However, my preference is to eat non-sushi lunch, like $2.50 corn dog at What's Up Dog (http://www.yelp.com/biz/RBFRQwL5lkv6hPCaIP1d0w), rather than eating questionable sushi.  \n\nAs you may know, Sushi in Japan could often get more expensive than sushi in the U.S., so you may wonder how Japanese people deal with sushi cravings without breaking the bank.  \n\nThere are several answers. \n1. Homemade chirashi (bara) sushi.  Often has no raw fish.\n2. Kaiten sushi (boat sushi).\n3. Sushi at grocery stores (like Ito-Yokado or Daiei)\n4. Kozo Sushi (http://www.kozosushi.co.jp/).  \n\nMy favorite inexpensive sushi option in SF is Maruya (http://www.yelp.com/biz/rKxTgHUs7mJwbeVth-rPIg), where I could get Futomaki and Inari sushi (both items do not contain raw fish).\n\np.s. Further to sushi, Sushi Fantastic has cooked food, offered as bento box.  I've tried their chicken teriyaki, which was decent.", "author": "トモ T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "I'm always hesitant trying new sushi places because I have high standards for sashimi. My friend suggested this place for lunch since she frequents because it's so close to her office. I was feeling daring and chose something from the lunch menu  with sashimi so I ended up with the Fantastic Bowl for $13. It was so much better than I expected! The sashimi slices were fresh tasting and a good size, the sushi rice was delicious, and the big gooey roe (I don't know the name) was a nice kick to the dish. Definitely will return to try other dishes when I'm in town again.", "author": "Joy N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-13", "description": "This place is decent!\n\nThat's the high mark I'd give for Sushi Fantastic.  For a M-F lunch spot, it does the trick.  Fresh fish, fast service... I know it ain't Nobu or anything even remotely close, but when I am looking to spend only $10 and fix my sushi craving in less than an hour.\n\nWill go again.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-24", "description": "Sushi: terrible\nDonburi: ok\nAttitude of the owner: awful, pathetic. You are not the only one serving food in the area and your food is not worth the terrible attitude. So I will take my business somewhere else.", "author": "The Y s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Great Udon soup! Also, I recommend calling in your order ahead of time if you plan to come during the lunch rush. Always fast and efficient service.", "author": "Jo E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "average tasting sushi. \nhuge portions. \nfairly cheaply priced. \nquick service. \n\ngreat spot for a quick lunch if you're in the area. will be back....", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-22", "description": "I got a salmon bento for lunch. Service was very quick. I thought the food was mediocore. Salmon was lukewarm and a very small slice. The bento box also came with vegetable tempura. The texture of that was more doughy than I'd like for tempura and it tasted a little funky. This place is a very convenient for lunch. Perhaps there are other things on the menu worth trying for next time.", "author": "Diana U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-26", "description": "I usually order one of the sashimi bowls. The Fantastic Bowl for instance - Tuna + Salmon sashimi (5 each) over rice, miso soup + small mixed salad. This will cost you about $13. Would be great except for the fact that the sashimi slices are so thinly cut that you are just getting RIPPED OFF. Add to that the fact that the salmon has at times been so chewy that it was nearly inedible and you may as well be throwing your money out of a window. \n\nI've spent hundreds of dollars here but I'm pretty much over feeling like I'm getting ripped off every time.\n\nIf they would just cut the sashimi to be decent slices, they'd keep my business.", "author": "A S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-06", "description": "I'm a regular at this sushi spot not only because it's across the street from my office, but because they are friendly, fast, and the food is really good! \n\nWhen dining in, get there a little before the lunch time rush, like 11:30am, because it can get pretty packed.\n\nThe daily bento box special with chicken terriyaki, shrimp & vegetable tempura, and sashimi or california roll is pretty popular. They give you a HUGE portion of tender terriyaki chicken. It's enough to take home and eat for lunch the next day. \n\nTheir sushi is pretty good and fresh. I've tried the sashimi, california roll, spicy tuna hand roll (one of my spicy faves), dragon roll, and rainbow roll. Lucky for me it's close by and hits the spot when I am craving it at work.\n\nThe real winner is the chicken/tempura udon. I love soup, so this would definitely be the case as my favorite! The soup portion is hearty, enough for 2 days worth of a meal. The udon noodles are thick, long, and complement the veggies that are in the broth. This dish is wonderful and quite comforting, especially on days that it is cold or rainy out.\n\nThere's not much competition in this area besides Tokyo Express and Ozuma. I consider Tokyo Express to be it's comparable other, but it's pretty hidden and the line gets crazy long during lunch hour. Ozuma's is good, but ridiculously expensive, even at happy hour. No wonder people always come back to Sushi Fantastic.\n\nAs for the location, it's right on Howard, between Beale and Fremont St. Metered parking is available... if you're lucky!!", "author": "Joy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "I work in SOMA, and although usually I bring my own lunch, on occasion I like to eat out to change it up a bit. I invariably go to this place when I am craving japanese. The place is rather small and the spaces fill up quick, particularly around the noon lunch rush. So, I typically take out. \n\nThe menu is quite diverse. I have mainly tried the sashimi, tempura, and terriyaki combos. The food always comes out piping hot. The chicken and beef tempura lunch combos are quite good. The meats are grilled to perfection and have the right amount of sauce to flavor the meats. The Terriyaki is a little on the sweeter side than I am personally used to though. The Tempura is good, well seasoned and the batter is flaky and delicate; I only wish there was more variety in the vegetables used. The portions are BIG; sometimes I feel overly full with the soup, salad, tempura, meat, rice. But it is great VALUE for the AMOUNT OF FOOD.\n\nThe sashimi is rather expensive, and of an OK quality. I have had much better sashimi, for a much more reasonable price, at other establishments around the city and in the 'burbs. I would recommend the lunch combos over sashimi as a matter of quality and value for your money.\n\nOverall this place is a fairly excellent establishment, and the long lines around lunchtime attest to its quality and success.\n\nOH BE FOREWARNED: THEY DO NOT ACCEPT AMERICAN EXPRESS CARDS", "author": "J E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-18", "description": "I spent close to $10 and got a sushi roll. Very disappointed in the quality of their sushi, and how small it was. My friend ordered a lunch special for about the same price and that seems like a slight better deal. I will not go back!", "author": "Shin H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-17", "description": "I stumbled upon this place for lunch and will not be going back there again.  The price is reasonable, but the quality of the fish and the cut of the sashimi were not worth it and wished I didn't waste my $12 here.  Well, you get what you pay for, I guess.  IMO, you are better off going next door to Cafe Venue, where you are guaranteed to have a decent meal.", "author": "Catherine H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-13", "description": "Tried this hole in the wall for lunch on a cold windy day. Ordered the soba ramen with beef and it sure helped with the chill in my bones. No wow factor but decent considering the area. Checked out the sushi that the people next to us ordered and it did look appetizing and fresh. Prices are a little high though but I'll be back when I'm craving some hot noodle soup.", "author": "T L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Finally, some very good Japanese food in the downtown area! OK, maybe \"Sushi Fantastic\" is overstating it, but certainly, \"Bento Box Very Good\" would be appropriate.\n\nThe place is comfortable and slightly away from the downtown bustle, South of Market. I didnt try the sushi - but I did get a very tasty Tuna Bento Box, served with a good miso soup, and a salad with a huge dollop of dressing on top. Big portions, and a good, not-too-crowded Friday lunchtime ambiance made for a very satisfying lunch. Next time, the sushi...", "author": "donal c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-02", "description": "Fairly good sushi that comes out fast. You order upstairs and take a number. I had a bento box which was pretty good for what it was. I would return.", "author": "Leily P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-08", "description": "There is little fantastic about Sushi Fantastic. My wife and I decided to go hear over a lunch hour since it was close and it is was sushi after all. The restaurant takes a minimalist cafe approach with ordering done at the counter (upstairs) with the food delivered to the lower portion which is just a bunch of cafe tables and chairs. Although there are huge billboards that have the menu, they didn't have descriptions (e.g. What really is a Volcano roll?), and we had to look a printed menu which we could get at the counter and then felt rushed. The people taking orders didn't have a good mastery of the menu and could answer a simple question like \"What spicy rolls do you have?\" with out asking others. On a positive note the servers (delivering the sushi) were very nice, quick and helpful. \n\nWe primarily focused on the sushi rolls (not the bento, sashimi, etc.) for which they have a huge selection. Off the top of my head we tried the Kamikaze, Volcano, Rainbow and California rolls and steamed gyoza. First of all each of the rolls is a generous portion with with 8 pieces that are pretty hefty but the higher prices reflect that. Unfortunately the Volcano roll was the only one with any real flavor (and it does pack a kick). I was especially disappointed with the texture of the fish used which was on the soft side and lacked flavor even though in the case of the Rainbow roll it had huge pieces of sashimi on the roll. The gyoza also lacked flavor. \n\nSince I prefer to relax and enjoy fresh flavorful sushi, I will have to pass on Sushi Fantastic in the future, thus my review of two stars.", "author": "Darrin J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-05", "description": "You have got to be kidding me... are there really no restaurants in SOMA that this kind of place can rate a 3 stars?\n:( quite sad... I had sushi here twice for lunch and I have to say.  after the second time... shame on me!  sushi tasted old and really really fishy. you can taste that it was not fresh fish, about to go bad... both times.  i had to give it one more try to make sure.. afterall, sometimes, restaurants can have bad days too... but i dont think so....\ni will never go back.  I prefer Tokyo Express as the place is a little better quality in sushi.", "author": "Katelyn M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-22", "description": "Place is gross... I mean its clean and stuff inside but the food is gross. The previous poster said that there roll was warm due to being in the sun. My raw tuna roll was warm too (not from the sun) It was new york roll, which has tuna, avocado and cucumber. supposed to be cool and refreshing. NOPE  it was warm like tey just defrosted it in the microwave or something. Tasted like doggy doo doo. \n\nI also tried the pork cutlet curry. The pork was fine, Rice was fine. The curry sauce was gross. No flavor what so ever and just was gross. \n\nDont waste your time or money.", "author": "Blake H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-06", "description": "Order at the top of the stairs, then take a table below.  Its pretty small, so if you are eating in peak hours, you may think about take out.  I got the chirashi $13.  The fish was fresh, came with soup and salad.  The guy at the counter was nice and cheerful.  I would return.", "author": "Jaime O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-01", "description": "It's not fantastic but it's not terrible... Good things:\n- food runners are really friendly\n- quick service\n- soup/salad with combos\n\nNot so good things:\n- Cashier woman is always REALLY rude\n- Sashimi is cut so small\n- Fish doesn't always taste mega fresh\n- Charge for small changes in combos\n\nNot too many great Sushi lunch places close to my office so I go here, hoping something else will move in soon!", "author": "Seema M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-23", "description": "Holy fast to-go order.  I went with a chicken teriyaki bento box w/ sashimi, and seriously the thing was ready in 90 seconds.  \n\nThis naturally made me suspicious, and indeed they had bungled my order and given me tempora rather than sashimi.  Being tempora hater I was initially pissed off, but after reading the reviews here, I don't think I wanted to risk their sashimi anyway.\n\nPlenty of good quality chicken, crab and veggie tempora, miso, salad, and rice for $9, so not a bad deal.  Tokyo Express offers higher quality, but also with a wait, so pick your poison.", "author": "John H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-12", "description": "This place was ok.  I came here on recommendation from a friend when I asked for another sushi spot in the FiDi since I wanted to try something different from Tokyo Express.  I ordered two maki rolls but I don't remember which.  Both had tempura in them though.  They were pretty good, but they were pretty much the same quality and a little more expensive than Tokyo Express, so that kind of disappointed me since I made a long walk to get there.  Come by here only if you're nearby, but I don't suggest taking a 20 min walk to get here.", "author": "Rodney H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-15", "description": "Very good great food fast service well worth the 45min drive I took to get there will go back soon highly recommend it for people on the go.", "author": "Fernando J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-10", "description": "Small spot for a quick sit-down lunch, but the sushi is definitely not fantastic.  Prices are reasonable, and portions are just right.  Whatever you order, it usually comes with miso soup and a side salad.\n\nTheir sushi is better than their udon dishes.  My chicken udon came out dried and overcooked, which resulted in me not finishing the bowl (rare occasion indeed).  Stick with their daily specials to avoid food that might be not so fresh.\n\nGood tea though.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-10", "description": "Very convenient. Right near where I work. Not the cheapest lunch, but not bad for Sushi. \n\nI like the daily specials that saves me from having to make a decision from their vast menu. \n\nYou will get full if you order one of the specials. Especially the Bento Deluxe. That has to be like over 1/2 lb of chicken, rice, sashimi, tempura, salad, and miso soup. The thing weighs almost 2 lbs in total.", "author": "Kien L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-20", "description": "This place isn't all that terrible; it's convenient, it's fast, and it's reasonably cheap for what it is. The daily specials are generally around $10 and include a roll, some nigiri, and a salad. Cup of tea's included.\n\nThat said, the sushi is always luke-warm which is a bit of a turnoff for me, and I never get the impression that it's super fresh. Plus, this is one of the two sushi places I've been to where I had the pleasant surprise of biting into a toothpick in the middle of a piece. That grossed me out pretty bad, so I haven't been back recently.", "author": "Andrew B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-24", "description": "When you put \"fantastic\" in your name, you set the bar pretty high for yourself.  It takes a good run and a strong leap to reach the mat without seeing the bar on the ground next to you.  \n\nThis place turned out to be a good place for lunch, about par with a mall restaurant (I'm thinking of the Crocker Galleria).  They did have lots and lots of sushi on the menu.  While I was studying it, a man came up to me and asked me if I had any questions.  \n\nI ordered a bento box, which included miso, four pieces of sushi, iceberg salad with Thousand Island dressing, and green tea.  The deep fryer was out, so I ordered salmon instead of tonkatsu.  Since they couldn't give me tempura, they doubled up on the salmon.  The plate was larger than I expected, more than fair for $8.14.  \n\nI noticed that the \"fantastic bowl\" featured a huge roll.  I don't know what was on the inside, but it was a foot long and had salmon roe over its entire length.  \n\nThey were doing a hot, hot take-out business, but they had seating for 33 people.  While I was there, a waitress checked on me about four times.  The 90s music gave me a brief twinge of nostalgia.  \n\nSo, if I lower the bar a little bit, and don't quite expect \"fantastic,\" I believe it will be worthwhile to let them give it another try once in a while.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "Prepare yourself for two reviews for the click of one!  Since it opened, I have eaten at Sushi Fantastic 6-7 times, to give a thorough sampling.\n\nSOUTH OF MARKET FiDi REVIEW:\nWhen I first saw that the willfully mediocre Dogzilla was going out of business, I never could have dreamed that it would be replaced with a -sushi- restaurant; a Unicorn Shop or Starport would have been more likely.  There are few options for eating down near Howard St. or beyond, and there are exactly ZERO sushi places. (Mention T.E. to me and I'll hatchet you in the face.)\n\nSo when Sushi Fantastic opened, I went in right away to see whether or not my dreams would come true.  I ordered sashimi, chef's choice, and the old stand-bys Spicy Tuna and California Roll.  It costs me $20, but hey, that's sushi.  People who want cheap sushi deserve the meditation time they get on the Porcelain Throne of Regret.\n\nHow was it?  Dream-come-true accomplished.  Their fish is excellent.  The bland rice, the weak wasabi, the terrible salad that came with it - all forgotten in the face of fresh fish.  Hamachi is my easy litmus test for a sushi place, and it was tender and delicious.  Bravo, Sushi Fantastic!  The salmon (sake) is great, the tuna (maguro) is always fresh and tasty, and their spicy tuna has good tuna-scraps in it (unlike most places who just throw in whatever).\n\nThe order was prepared quickly, came in excellent to-go packaging, and the entire serving line was friendly and efficient.  Their sign needs to be replaced, as it's nearly impossible to read as it is brushed steel with glass over it - directly under bright lights - so you cannot read any of it through the glare.  Menus are at the counter, so it's not that big a deal.\n\nAll in all, for this area and for a FiDi luncheon spot - 5 stars!\n\nSUSHI SNOB REVIEW:\nI was really looking forward to a good sushi joint, and found myself satisfied - but not thrilled.  Their ordering system is geared towards the feeding-trough system prevalent all over the FiDi - everything is \"order A, order B, order C.\"  There is a menu, but I had difficulty communicating an ala carte selection, as my order was continually communicated back to me as \"Oh, you want order A?\"  No.  I want hamachi, sake, unagi, and 2 Maguro nigiri orders.  \"Order B?\"  No, just the things I asked for.  \"Order A, then.\"  *sigh* Sure.  Order A.\n\nThe fish is fresh - critical to any good sushi restaurant - but it's maintained in a haphazard way.  I noted fish falling out of the cooler, draped and dangling between the cooler and the counter.  In the hot environment of the kitchen - that's not good.  The fish is pre-cut, clearly to save time and get orders out quickly, but that's going to age the fish as well.  One time I went, the sashimi had clearly been sitting a while and had the sheen that comes with that.  It was still good to eat, but it shouldn't have gotten that far - the cooler must contain the fish and keep it fresh, period.\n\nTheir sushi rice is fine, if a bit bland, but the main chef - friendly, outgoing, and very helpful - is sloppy with making rolls.  I know it's the FiDi lunch crowd and speed is of the essence, but the rolls are haphazard at best and a few seconds of tightening them up would help presentation bigtime.  The salad is baseline, and the dressing is ... equally uninspired.  I often just toss the salad.  The wasabi is white-person grade, so it's about as strong as Spicy Nacho Doritos.\n\nOne oddity is that I get a side of hot rice with my order.  For what?  I don't know.  Rice zen garden perhaps.\n\nAll in all, it's an ok sushi place when compared with other sushi places in the city.  As a big fan of Ino, Blowfish, and Godzilla, all of which I'd give 5 stars, I would have to give Sushi Fantastic 3 stars.\n\nGood, fresh fish is the soul of good sushi - and Sushi Fantastic has it.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-03", "description": "**********************WARNING: THE FOLLOWING REVIEW CONTAINS PRETENTIOUS OPINIONS OF A MAN WHO RECENTLY LIVED IN JAPAN, READ AT YOUR OWN RISK*************************************** \n\nWhatever happened to truth in advertising? If Sushi Fantastic is any indication, it's gone the way of the dinosaur. I wish this was something we could resurrect (both truth in advertising and dinosaurs, I'd love to mount a T-Rex with cannons like in Dino Riders.)\n\nSushi Fantastic is by no means a bad restaurant, but the sushi is the worst thing on the menu. The rolls are so-so, and the nigiri isn't fresh. Freshness is the basis of good sushi. I'm not expecting cuts straight out of the Tsukiji Fish market or anything but it shouldn't seem like they've been laying around for a while either. If you want good sushi, there are plenty of other places to go in the city.\n\nThe soba was a sad disappointment. Just because it' is a noodle does not mean it is served the same way as ramen. Serving the soba in a ramen broth base is akin to travesty. It's an entirely different soup type altogether. TO be fair though, I've yet to find anywhere in the States that can make decent soba, which is a shame because it's not very difficult. What I would give to be able to get a box of noodles with dipping soba soup/sauce on the side again.\n\nMisgivings aside, there are some things done very well here. The katsudon (pork cutlet) and tempura are very good. Well cooked and crisp while not being dry, the way it should be. The udon is also pretty good too, and I usually don't like udon (I heard good things so I had to try it, and I'm glad I did.) The service also deserves mention, as they're generally very fast, friendly and clean. Like some of my favorite women.\n\nFood is three stars. Service four. Name two.\n\nSo word to the wise, if you go to Sushi Fantastic, don't go for the sushi. Get a bento box, try a bowl of Udon or some donburi. There's a lot of good to be had by trying more of the menu.", "author": "Keith M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-15", "description": "Sushi Not-So-Fantastic so far....\n\nMy coworkers and I have been 3 times and tried a wide sampling of rolls which were fair, but not a deal for the price.   I think there is a better value in the nigiri.  \n\nThere is something really weird with the rice.  It tastes... too plain.  I think they neglect to add enough vinegar or any at all.   If anyone in my family forgot the vinegar in the sushi rice, you might as well toss it all into the garbage and then kill yourself. \n\nThe salad has an odd dressing that isn't very tasty and it is garnished with a sad thin slice of tomato and an even sadder dried up slice of carrot.  My coworker said, \"Dang, I just want plain ol' thousand island.  Maybe that would make this edible.  You want it?\"   The miso soup was pretty good.\n\nThey are also still working out the kinks with the service.  Just so's ya know, when you walk in you have to go upstairs and pay. They will give you a number to take down to your table where they will drop off your food.  There is free hot green tea that is self serve.  That is awesome except for the fact that the tea is upstairs while all the tables are DOWN stairs.  Carrying two steaming hot mugs of tea downstairs through a crowd of people waiting to order is pretty sketchy.  They should really move the tea downstairs.  \n\nSushi is ok.  Donburi bowls ok.  I would classify their portions as generous since you do get salad and rice with most of the lunch meals.  It's a nice addition to the area.\n\nHopefully this place will improve once they are producing their full menu.  As of 3/15/07 they are still not serving any noodle dishes or lunch bento boxes.  The only items you can order are sashimi, nigiri, sushi rolls, and donburi.\n\nUPDATE 3/20/07:  Alex the head chef confirmed today that they do have alternative salad dressings, you just need to ask.  He also mentioned that once their kitchen is fully operational in a couple of weeks, they will be having promotions and deals.  I'll definitely check back again and see how the rest of their menu fares.", "author": "Courtney Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-21", "description": "Went back here and ordered the spicy tuna roll and tempura roll with miso soup and salad. The spicy tuna roll was almost WARM. Like room temperature. Blech. The tempura roll was soggy. Blech. The miso soup was just OFF - no miso, no broth, and the seaweed was off so it tasted rancid (or like ass). Standards are slipping, dudes!", "author": "Mi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-29", "description": "I dont know what some of the high expectations are for? I mean if you work in the SOMA slash lower Market/FD area then this is probably the best sushi you can find in a 1.5 mile radius within a $10 - 15 budget. The only other place to get seriously above fantastic sushi is Ozumo but that takes some overtime at work  and drug dealer tactics to afford the bill after a couple of rounds of sashimi, rolls, bento boxes and sake.\n\nAsk the ladies in front when you walk up whats the better lunch special - A, B or C and they'll honestly tell you which one based on what they got that's fresh. I mean A is always the Chicken teriyaki bento box (which in my opinion if you're gonna eat that go to fuckin Jack-in-the-Box on 1st and get your fill). B is usually a special roll with some sashimi and California roll included in. C is the last minute special that always changes every other day.\n\nIf you work in the SOMA, or across the street like me, then this place will be exactly what its name is, Sushi Fantastic. But if you expect great sushi, save yourself the dissapointment, save more of that lunch money and go to other gems in the city like....(I aint gonna tell you cuz then you'll potentially take my reservation the next time I might be there)", "author": "Nick V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-21", "description": "My first review ever.  Unfortunately, its for Sushi Fantastic.  After being a sideline member for 2 yrs, I thought I should or needed to warn SF of this place.  Its bad, oh so bad.\n\nI ordered the tempura udon:\n\nGood - Its close to where I work and ummm, and, well, I think that's it.  No wait, they did have the fork, spoon and napkin all rolled up, ready to go so that's a plus.\n\nBad - Everything else.  One of the tempura had uncooked batter inside of it.  I tried to ignore it and fight through but there is only so much tempura batter a man can eat before giving up.\n\nI realize there is only so much you can do with packaged udon.  But come on, you have a deep fryer, use it.  Cook that sucker all the way through.", "author": "Chad N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "When I was in college, I dreamed of eating sushi or crepes every day. This dream may seem humble to you, but it was dashed for years because these things tend to be expensive and far from work.\n\nSushi Fantastic may not be worthy of Nobu's endorsement, but they serve affordable and healthy sushi right across the street from my office.  I especially like the ladies who run the place, they are super cute and funny and they barely give me the abuse I deserve for ordering the same thing every day.", "author": "Cassio P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-23", "description": "I would give Sushi Fantastic five stars for convenience if I could- but that wouldn't really serve a broader audience.  However, for those of you who work in SOMA, you know what I'm talking about when I say there's a real scarcity of places to grab lunch.  Those folks on the other side of Market don't know how good they have it, what with Chinatown and Northbeach at their backdoor and the convenience of what I like to call the Kearny food fair.  \n\nSushi Fantastic is a relatively new establishment (opened in March).  For a long time they've had tempura listed on the menu, but they don't actually serve it yet (or maybe they do now? Please correct me if I'm wrong).  But that's okay because the sushi and the udon is decent and modestly priced, and, much better than the prepack stuff out there.  However, this is not \"fantastic\" sushi.  Or \"fantastic\" Japanese food.  But it's solid, and I wouldn't expect mind-blowing sushi fare at these prices.  \n\nOne of my favorite things about this place is the Sapporo on tap (surprise, surprise that I seek out the booze!).  The beer always seems to taste like it came out of a fresh keg- aromatic and effervescent with a nice flower on top.  Also, the beef udon is really a star dish here, with beef that is tender and flavorful.\n\nLast but certainly not least, I would also give the staff five stars for their kind, welcoming spirit and good service.  I truly value an eatery that doesn't serve up portions of rude.", "author": "Chalk A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-18", "description": "I'm not looking for authenticity, I'm only looking for the best quality relative to the price being charged. \n\nThis place, was definately overpriced, and very skimpy non-japanese food. Every mediocre or bad review on here, pretty much covers my sentiments - including the under cooked batter on the tempura. I\"m wondering if the rolls are any better - since I had a tuna bento lunch. I would be brave and try to come back again for something else, but I highly doubt that right now.\n\nWell, if I'm going to compare apples to apples and oranges to oranges, I would really recommend you going to Teriyaki Express in the food court  on Spear and Mission, instead. Much better quality and porportions for about the same price or cheaper.", "author": "Mai T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-14", "description": "This place sells premade sushi and bento boxes.  I'll say, it is perfectly suitable for lunch-time sushi.  Fast, good portions, reasonable prices.  I typically get the Sushi combo B which gives me 10 total pieces along with salad and soup...all for $10.95...and it's perfectly packaged to go.  Also, you get hot tea for free.  \n\nWith all that being said, I don't think I'd come here for dinner sushi.  When I go to get sushi for dinner, I want quality fish, made to order.  This is not one of those types of places.  \n\nEnjoy it for your mid-day sushi hankering but for that alone.", "author": "Susan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-02", "description": "Japanese fast food at the price of a quality lunch. Wilted vegetables, non-fresh fish, and lackluster flavors are inexcusable when so many better lunch options are nearby. I will not return.", "author": "Corry F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-25", "description": "Overall 3.5 Stars\nIt's so hard to find an affordable sushi place around work.  My co-worker and I went to this place for lunch today.  Not the freshest sushi around, but for the price and location it's a good place to satisfy your sushi craving while in the area.\n\nLocation: 5 Stars\nIt's close to my work and close to Market.  The restaurant is modern, clean and nice.\n\nFood: 3.5 Stars\nThey have a decent size menu from bento boxes, to sushi.  The sushi was okay.  Not the greatest, but when you're craving sushi at an affordable price this is a good place to go.  Many lunch box, and combo plate specials to choose from.  The speciality rolls seem better than the combos.  Unlimited hot tea is a treat.\n\nService: 4 Stars\nIt's a grab and find your seat type of place, but the check-out process was easy and the staff were SUPER Nice.  The food came out quick and the clean-up was fast enough to keep people in and out and a constant rate.", "author": "Manohak S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-17", "description": "DO NOT GET SASHIMI HERE.  PLEASE AVOID IT LIKE THE BUBONIC PLAGUE.\n\nThe donburi is okay.  I got the unagi donburi the first time and it was decent.  Unagi to rice proportion was off, though - way too much rice for the amount of unagi you get.  This was about $8.\n\nGot the chirashi bowl the next time and I felt the need to thoroughly soak each sashimi piece in my soy sauce-wasabi mix before eating.  The fish is not fresh and not tasty.  Even the rice lacked :[  The chirashi bowl was a waste of $11.\n\nPeople seem to be generally nice, though.  They were attentive to getting a table ready for us.", "author": "L Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-19", "description": "Everyone here has made the same obvious Sushi \"Fantastic\" joke so I'll spare you.\n\nthis place : sushi :: walmart : fashion\n\nThat is, this place has sushi that will not kill you, is cheap, and is close to work.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-04", "description": "Ok. Nice ambiance when it's not jam packed (it gets packed for lunch around 12 = no seats) \n\nThe california rolls are ok - the avocado can only be found with a microscope. \n\nThis place is definitely NOT fantastic - it's more like completely mediocre.\n\nThe lady at the cash register gave me major attitude when I wanted to use my credit card (- 1 star). The food runners are quick and friendly.", "author": "Chili B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-12", "description": "Pretty good, if you take it for what it is: a lunch spot for all us FiDi workers.\n\nThe service: I only go there once every couple of weeks, but the employees recognize me. Even the owner, Alex! The friendly service is  what keeps me coming back, even though Tokyo Express on Spear and Howard is closer and more convenient to me. Come to think of it though, I recognize a few of the employees as former Tokyo Express workers...\n\nThe food: The sushi is fresher than TE, but be careful of the spicy tuna and spicy hamachi rolls. They mean it when they say spicy! I agree with the other reviews about the miso soup. Mushrooms? Really? No thanks. The items on the cooked food menu are all pretty standard. Haven't tried most of it though, since I'm usually there for the fish.", "author": "Amy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-19", "description": "a sushi \"restaurant\" that closes at 5pm, nuff said.\n\ni ordered a sushi lunch combination B, 8 piece california roll, 6 piece nigiri, with miso soup and salad.\n\nthe nigiri looked a little filmy and not super fresh, but it was hard to tell how fresh it actually was because the slices were almost deli-thin. the california roll was not super chintzy, but not abundant with filling either.\n\nthe sides, salad and miso soup, would have been totally acceptable if i weren't hung up on what i came for: the rolls.\n\ni know a lot of people put the most weight in judging a sushi place on the freshness of the fish, but it's hard for me to weigh in on that because there was a fundamental flaw in all of the rolls i ordered: the rice.\n\nsushi rice preparation is probably the most important consideration for a sushi restaurant as it's present in any unagi, ebi, toro (not offered here btw) or other nigiri or custom roll... and their rice was just bad in my opinion. sushi rice should be prepared that it tastes and feels fresh, the rice on their rolls was way too soft (old), not at all sticky, and tasted pretty much like it was pulled out of a rice cooker that was made for filling sides of rice bowls... you need rice vinegar, sugar, and salt, owners; not a huge expense on your pocketbook! if they improve the preparation of their sushi rice, i'd bump them up a few stars.\n\nmy experience was that the food was mostly bland. the fish wasn't particularly flavorful, and the california roll was nothing memorable, but the only thing i thought about while eating it was that the rice the cooks make is so bad it negates any good that might be offered by them.\n\n2 stars given because of the location if you work at a nearby company and there aren't other sushi places in the area, and also because of the portion ($9.50 pre-tax sushi combo B) to food ratio; it's not that expensive.\n\ntl;dr: inexpensive, but don't expect good sushi... the rice sucks", "author": "bob s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-08", "description": "HORRIBLE! Everything from the food to the customer service is sub sub par. I just took one bite of the tempura and it was disgusting. terriyaki chicken was also flooded in sugary sauce. I took one bite and I couldn't even swallow it, it was so bad. The only thing edible was the miso soup . Worst of all my horrible lunch, which I didn't eat, cost almost $10. not worth it at all. i want my money and time back.", "author": "Jessica N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "I just went there for lunch yesterday, and was so stoked to find a sushi place near my work!\n\nI didn't think this place was bad at all.\n\nIt's a great lunchtime place. It's fast. It's convenient, all in a hip little cafe setting. It's just as expensive as cold sushi from Safeway, but I think it's way better. I don't think this place is meant to be a gourmet sushi restaurant, so I'm not going to pretend that it is.\n\nThe menu was pretty decent-sized and I didn't know what to order. So, I just ordered the special: Volcano Roll + 1/2 Cali Roll with Soup and Salad for $9.50.\n\nI sat down, and before I could even take my coat off, the waiter had brought me my soup and salad which I thought were fantastic. The salad tasted fresh to me, and the mayo-dressing was good. The soup was also very yummy. There's also all these sauces and spices to play with. Well, like 4, but still...\n\nI'm a pretty fast eater, but before I could even finish my soup and salad, the waiter had brought my Volcano and Cali rolls. They were pretty good. They tasted like Volcano and Cali rolls. It was good, and it satisfied me.\n\nAnd the staff is Thai, not Chinese. I heard them speaking Thai to one another.", "author": "Paweena P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-13", "description": "As sushi places go, it's so-so. \n\nIt's in a very convenient location if you work south of market. They have fast service for when you must have a taste of seaweed during a brief lunch break.\n\nI was pleased enough with them after 9 visits, but the 10th visit was a bad one. While their lunch specials and bento boxes are good enough, stay away from the a la carte sushi menu. My spicy tuna roll was inedible.", "author": "Rue M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-26", "description": "Should be called \"Sushi OK\". \n\nNot great, not terrible. Ok for a quick lunch. If you go, the rice bowls are your best bet.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-18", "description": "Pretty good lunch option in the area! I like their bento boxes and the don options. The bento boxes (my personal favorite is salmon) include soup, salad, tempura and is very good value for money! I have also tried the garlic shrimp which is pretty good too. I ordered that once with rice and it was pretty good for lunch. \n\nI haven't ordered a lot of their items but I would say it is certainly worth giving a shot.", "author": "Rita R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-26", "description": "i just got lunch take out from this sushi place and it was SOOOO GROSSSSS. they must save the janky meat for the to-go orders cuz you're not going to walk back from your office and ask them to re-make the order.  UGH.\n\nbefore i would have given this place 3 stars cuz it was my go-to when i felt like japanese food (which is often since i get palate fatigue from the weekly salad, soup, sandwich routine).  I have had the sushi (ate in) and it was passable.  I also like the veggie udon, cuz it has a lot of veggies going on in it that I can justify the starchy noodle consumption.\n\nbut my order today just threw that out the door.  \nmy sashimi slices had VEINS in it.  I know fish HAVE veins but I HAVE NEVER see them poking out of my maguro. \n\ni feel so violated. i think i need to take a half day.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-31", "description": "Am I a sushi gourmet ? I am not.\n\nThe ladies at the counter are nice.\n\nThe sushi is good, is it mind boggling good ? I don't know, who the fuck cares ? Is everything you eat mind boggling good ? It isn't. You won't admit it but you could probably eat cold ravioli out of a can in a pinch and be very happy.\n\nIt's fast and I like that, I am generally out in under 5 mins from the time I step foot in the door.\n\nSo they're nice, it's fast, the prices are reasonable and for that I like it.\n\nYou want more ? I'm sure you do and that is because you are a spoiled overindulged brat who has an opinion of yourself that is waaaaaay over inflated.\n\nRelax, go have some sushi, and try not to take yourself so seriously, cause trust me, no one else does.", "author": "red c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-07", "description": "A Monday - Friday office lunch favorite!  I've converted many Tokyo Express goers to this sushi joint.  Not only is it an elevator ride down for my lunch crew, the fish is fresh and you can actually SEE the fish unlike Tokyo Express.  \n\nI highly recommend the 49er roll.  Only 6bucks which includes a california roll with pieces of tobiko and salmon on top.  The best part?  The lil slices of lemon on each piece that gives the roll an extra zing & zap in your mouth at lunchtime.\n\nSo why only 2.5 Stars?\n-  If you've read my Okina Sushi review, you'll understand why.  I just can't give a faux-sushi place 5Stars.  Minus 1 Star.\n-  No HOT food!  The previous owners broke the stove before they left because they couldn't make it.  Just kidding.  That's our theory.  Once they get this fixed, I'll bump up it up.  Minus 1 Star.\n-  If you decide to eat there, they're number system (or lack of) is just WHACK!  Pay attention to your order. Minus 0.5 Star.", "author": "Yoko H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-02", "description": "I appreciate how they include the soup as well since a majority of the Japanese places don't want to give you soup when you do take out.  They also pack up the salad and anything else you need very neatly for those togo orders.  One of the better tasting sushi places around.  Other places that are more expensive are not as good.  $9.03 after tax for a chicken teriyaki with rice, kali roll or tempura, miso soup and salad.", "author": "Davey L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-15", "description": "This place is definitely NOT \"fantastic\".  The fish is stale and the portions are small.  At this point, I am just hoping that I do not get sick off what I ate.  Even the Miso soup was watered down.  I did not think anyone could mess up Miso soup, but apparently it is possible.  I will not return.", "author": "Dan O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-14", "description": "A solid 3-star lunch joint. Really, my favorite thing about this place are the two delightful cashiers that always bring a smile to my face. I work in the same building so I will come here again and again and always leave with a smile. I would never go here for dinner, but in SOMA, there are still very limited options these days, and this place is one of the better picks.", "author": "Brian J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "My co-workers and I come here since it is right around the corner from our work. I always get the veggie udon soup. It comes with a small green salad too.  There are not a ton of veggie options here, but hey, it is Japanese. The tempura udon is also good.\n\nThe ladies at the register are always very nice.", "author": "Janet B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "I use this place often for lunch. It is good for a quick Bento box or sushi roll. The place is too crowded for me between 12-1 so either come before or after.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-23", "description": "No no no no no! Definitely NOT a place you want to go for Sushi. I am eating a take-out order that I got from there for lunch, and felt compelled to write a review mid-meal. \n\nI ordered a Rainbow Roll and a Double Salmon Roll - both favorites from nearby Tokyo express (which raised their prices because they got greedy). \n\nRule # 1 of Sushi - the fish must be fresh. From the taste and look of it, this fish isn't fresh. In fact, I'm really hoping that I don't get sick, as I've read other reviewers say they have fallen ill after eating here.  (Strike 1)\n\nRule # 2 of Sushi - well made sticky rice. I wish I had read the reviews of this place before I went there. I totally agree with the one reviewer who had clumps of rice falling off his sushi. Now people, I've been eating sushi for many many years, and can expertly pick up any roll, dip it in the soy sauce / wasabi mixture, and get it in my mouth without having it disintegrate. So my chopstick skills are not to blame. There were literally clumps of rice that were almost separated from the rest that fell off. Unbelievable!\n(Strike 2)\n\nTo top it off, the not-so-fresh fish and the clumpy rice cost me $20. I don't mind paying for quality, but as we've established, this was no Fantastic Sushi, so $20 for 2 rolls....no way! \n(Strike 3)\n\nSafe to say, I'm never going back. In fact, I just tossed the remainder of the sushi.", "author": "Samir P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-13", "description": "Fantastic? I think not. Tolerably adequate? Maybe.  Decent prices for downtown are more than balanced out by mediocre fish (think stringy tuna), blackening avocado, and overcooked and mushed rice.\n\nMy brother's udon looked good though...so maybe this isn't a great place for sushi, but alright for the other stuff.", "author": "Eugene F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-15", "description": "Great lunch spot. Fast and cheap. Order upstairs and they deliver. Th combos could be considered small by some people, but I thought it was reasonable for the price. \n\nPeak lunch-time may have trouble finding a seat!", "author": "Joe L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-17", "description": "This is not so much Sushi Fantastic as Sushi Mediocre. In a nutshell, while I avoid cold (like out of the refrigerator cold) sushi, neither should sushi be WARM. Yes, the avocado and California rolls I am currently consuming could veritably be deemed WARM. At least I'm not eating warm sashimi. \n\nAlso, as I've noted previously, cucumber does not belong in California rolls. Perhaps they think the California roll is a better deal when you get some extra cucumber in it, but I think it's just a rude interruption to the creaminess of the avocado and crab (in this case, artificial crab rather than the real stuff).\n\nAnd finally, I don't think I've ever actually seen rice falling off sushi, but I'm taking it as a bad sign from now on... putting whole sushi rolls in your mouth is not exactly glamorous as it is -- who needs the extra humiliation of little rice globs dropping off mid-plate-to-mouth trajectory?", "author": "J C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-17", "description": "So far, when I'm looking for a sushi indulgence during my work-lunch-hour, I make the trek out to this fine establishment. That alone, says, \"this place is decent enough for this guy to travel what he describes as a 'trek' for some sushi.\"\n\nYes, the place is good. Not AMAZING...but good. I always leave satisfied. The times I've come, I've only gotten rolls, which haven't disappointed. I am interested in getting their bento boxes. They seem like a lot of food for not a lot of money. The last I saw, their special of the day included: rice, teriyaki chicken, miso soup, salad and 4 CA rolls...all for $8. Not bad.\n\nConclusion, I'll come here to fill that craving on occasion....but I won't come here \"regularly.\"", "author": "Jon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-06", "description": "There are not a lot of sushi places in this part of SOMA. It's the closest sushi place to my work, so I was ecstatic when it opened. The prices are pretty reasonable ($3.50 for 8 piece CA roll, $4 for 6 piece Rock & Roll, bento boxes are between $7-10). It's pretty similar to Tokyo Express near the Rincon Center (which is the next closest place for cheap sushi). Their rolls are kind of sloppy, but it's fresh, and it's a pretty good size. I always get the Rock & roll, and you can actually taste all of the ingredients in there. \n\nIt's not too crowded at lunch. I've been lucky and only had to wait about 5 minutes for my food. The staff is pretty friendly, which is a plus, especially when it gets busy. They also have hot tea there while you wait. They also deliver, but I'm not sure if there's a charge for it.", "author": "Ring K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-23", "description": "It's close to work, pretty fast, and lots of food.  I have yet to try the sushi - but the teriyaki chicken bento box, with tempura, rice and salad was great.  For a quick, hot meal - the donburi chicken bowl was perfect.  I don't think I'll ever be totally cool with paying $10 for lunch, however, its the norm in the financial district, so I'll just suck it up when I'm too lazy to bring lunch...couple things, the donburi bowls come with soup and salad, which they pre-pack for efficiency....resutling in warm salad and cold soup. \n\nIll definitely go there again, and eventually try the sushi!", "author": "Fräulein J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-18", "description": "Sad that this is the only sushi restaurant around this area because the food is not so tasty and the customer service is awful. I'm sure not coming back to this place.", "author": "Cita M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "Lots of reasonably good food for a fair price. Quick, friendly service. Decently fresh fish. I've never had warm fish here, by the way.\n\nI've been to Sushi Fantastic at least a dozen times (mainly because it's a block away form where I work) and never had a bad bite. It's not off the charts great but definitely worth a try.\n\nBack last spring when construction was going on down the street, the construction workers used to have their lunch here. Seeing construction workers eating sushi - definitely one of those great only in San Francisco moments.", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "Hmmmm, I'm surprised by the poor reviews. This place is close to work and I wish I had found it sooner. Rolls are fresh and good! They also have spicy sauce on the table which is awesome as I always like some extra KICK! Good, cheap, casual lunch place!", "author": "Kadie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "It definitely depends on what you order. I suggest the sushi combos, but really did not like the tempura. It tasted old and bland to me. \n\nPositives: \n-Some of the best prices for the amount of food you get. \n-Service is quick, waiters are attentive and friendly. \n-Personally really like their sushi lunch combos. Comes with miso soup, salad, and more than enough sushi to be full. Never had a bad experience with it so far, and whereas it may not be as amazing as more expensive places, it hasn't been terrible. \n\nNegatives: \n-If you have trouble with loud, crowded places, this might not be the one for you, as the lunch rush can be intense and a few times friends and I have had to share tables with another party. \n-Really did not like their tempura. It tasted bland and not too fresh.", "author": "Sally O."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-01", "description": "As my former boss used to say:  \"Good, fast and cheap.  Pick two.\"  This never seemed more true than when I sought out good, inexpensive sushi in the FiDi.\nI ordered sushi box \"B\" for lunch, and it was blech.  The Cali roll was pretty good, but all the nigiri was pretty icky and had that less-then-fresh flavor.  The accompanying salad was pretty sad, and the miso soup was just like the instant stuff from a packet.  You can't expect much from a $9 sushi bento box, but I think they could have done a little bit better.  Maybe they could just leave out the soup and salad and use slightly better fish.   \nIt's in a convenient location for us in the SoMa/Fidi no-man's-land, and it's cheap, thus the two stars.", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-21", "description": "Solid lunch spot. Quick service. Decent selection. Nothing mind-blowing,  but a good spot for takeout or a quick sushi lunch in the area.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-19", "description": "Another place close enough for me to hit for lunch.. it's OK, the bento boxes seem to be around $11. I don't find the fish (sashimi) to be to terribly wonderful but I've had worse and I have had some that is better as well it's \"just OK\". This is decent middle ground when I'm craving sushi. The bento box does come with salad, soup and steamed rice which I greatly enjoy :-) I've only ever had take out so I don't know how table service is but everyone is very friendly and my food comes up pretty fast.", "author": "Abby S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-24", "description": "BEWARE! 4 people in my office have been made sick by this place! Take one whiff at the top of the stairs and you should listen to your better judgment when your mind tells you it stinks! And what the hell are they doing advertising tempura???? they don't have it, haven't ever had it, and when asked, say \" we get fryer next week\".\n\nAlthough a limited selection, Sushi next door at Spazio is MUCH better.", "author": "Luke P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "probably ordered sushi combo b from here a few dozen times. it's not bad.\n\ni stopped going recently when the unagi went missing from sushi b.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-10", "description": "Pretty decent place to get my sushi/japanese fix for lunch. The sushi is pretty good & the udon or soba noodle soups are pretty flavorful. I also LOVE how quick they're service is. This place can get really crowded w/ people waiting for their orders, but dont worry you will be out of there w/in 5 minutes!!!", "author": "Krystel M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-02", "description": "you won't find nobu here...\n\nnobu (the resident yelp sushi jedi) will probably never approve sushi fantastic, but i'm not nobu.......and for slightly more than what you would pay for trader joe's sushi, you can get yourself a decent california roll or spicy tuna that's better than whole food's sushi for lunch at this new location in soma. hence my days of lugging a week worth of trader joe's sushi and having wild dogs barking at me like i'm a giant sashimi on my way to the mission bart station is officially over. amen and hallelujah! solid three stars!", "author": "frisco j."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-08", "description": "Maintains its 3-star status in my book.  Very fast to-go service.  I ordered 2 chicken teriyaki bentos for my coworkers.  Very moderately priced for the amount of food you get (comes with soup and salad). For myself I ordered a spicy tuna roll and a spicy salmon roll.  The salmon roll was not spicy enough.  Tuna roll was too spicy.  Too much sriracha I think?  Overall still tasty.  Rice was a little too sticky but that's what happens when they have to produce large quantities.  Quality of rice suffers a bit.  I like that they give you a litle sauce container with the wasabi and pickled ginger inside.  Makes for easy mixing when you add the soy sauce.  Except, I wish the pickld ginger was packed separately.  Some of the pieces had too much waasabi on it and made for a very unpleasant, unexpected  burn.", "author": "Jade K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-30", "description": "hmmm, bold use of adjectives, i thought! but sushi fantastic IS fairly fantastic! the sushi is fresh and yummy and the service is friendly, but the fantastickest part about it is the location. we have LITTLE TO NO OPTIONS in our little corner of SOMA for lunchtime sushi; and not only is this an option, it is a good one! \n\nthe avocado rolls are fabulous\nthe seaweed salad is phenomenal\nthe prices are magnificent\nthe location is perfection\n \nfantastic idea.", "author": "tina s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "if you want udon, go to tokyo express, if you want bento/teriyaki/grill go to imakura on beale st... but if you want sushi go here. \n\noh, if you want to pay hellza money go to ozumo.\n\np.s. yelp has the wrong address. this place is on howard, not fremont.", "author": "Greg D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-29", "description": "Not really fresh sometimes fast but portions are big so for hungry people its a great place to go but not so much for good quality and not very authentic.", "author": "Joiera C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "I come here about once a week. The service is fast and responsive for such a high volume lunchtime destination. The food is good, but Japanese cuisine is not at the top of my list, so I can't rate that too much. The Don bowls are pretty good, as well as the boxes. The sushi seems hit or miss depending on the guy making it.", "author": "Mike P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-17", "description": "You have to lower your expectations when looking for Japanese food on your lunch break in this part of the South Beach district.  Sushi Fantastic is far from it's namesake, but it does have a decent California roll.  I was disappointed in the salmon don.  It's 3 slivers of grilled salmon that has barely any flavor on top of flavorless veggies and then topped with sparse amounts of I believe is Teriyaki sauce.  None of the fried items are available at the moment.  Overall, its good variety that is needed around this area.", "author": "Jason A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "we had a private party last night, it was very good. very amazing just like it's name FANTASTIC...I would like to thank my boss to bring us there. we all had a very good time and we all loved the foods..i would like to go again, again and again for my dinner.! thanks Alex for making us the good and fresh foods.", "author": "Sa Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-06", "description": "Not so fantastic Sushi.  An insult to call it Japanese.  \n\nAfter walking past this place for several weeks now I decided to give it a go yesterday and well let's just say that I won't be going back.  First, you have to stand in a very hot, and lacking fan or A/C room.  Second, the iced tea that I purchased for what I would consider a ridiculously inflated price for a snapple was... get this- tepid at best.  Third my spicy california roll came with rice granules falling pathetically all over the plate making it impossible to eat without a spoon.  Hmmm sushi with a spoon?!  Lastly, my Zaru Soba (buckwheat noodles) was overcooked and the \"tsuyu\" or dipping sauce was so salty and no where near what it should have tasted like.  This is what happens when you get people who have no clue about what good Japanese food should taste like!  Folks... other than the great location for all of us who live in SOMA, this food is definitely not a \"bang for your buck\" and leaves one unsatisfied.  In closing I have to mention how upset I was to find the \"La Choy\" soy sauce or whatever that cheap quality garbage was filled in the \"Kikkoman\" Lite soy sauce bottles.  Definitely not Kikkoman.", "author": "Alicia W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-18", "description": "do not ever get their donburi...i got the katsu donburi and all it was was katsu with a few pieces of steamed veggies over rice...no sauce, no egg...way too dry\n\ntheir bento boxes are ok though...it fulfills my teriyaki chicken / rice cravings when i'm at work", "author": "Alice K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-17", "description": "Hit or Miss.  I've been here 10 times and only gotten sick once.  I do go back although I only order items that don't include fish.", "author": "Jeremy P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-29", "description": "Been here twice and twice it's the same: Big rolls with  A LOT of rice and VERY LITTLE meat and no flavor. If you are in a pinch and need to satisfy hunger on a low budget this place works. If you have time to walk to Toyko Express go to Tokyo.", "author": "Jennifer And Uri W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-20", "description": "After reading these reviews I had to sign up and help defend this great little lunch place. \n\nFirst, it's basically homemade \"to order\" fast food. You walk up to a counter to order. There are over 50 items on the menu not including all the sushi options, and also including terriyaki snapper, udon/s, soba, and more. A full lunch is about $11. They serve you at comforable tables or bar tables, they give you free hot tea, and keep a very clean and friendly environment. Sushi Fantastic serves great lunches from an open kitchen. It's very clean. \n\nWhat Sushi Fantastic did most of you go to? Did you imagine you were at Nobu? Reality check: it's lunch time in the city and you have $10-$20/ 30-60 minutes and you want fresh Japanese. Seriously, the last time I read such whiney reviews was when some lady couldn't wait to leave an ethnic restaurant to get a triple dab dipped frappucino at Starbucks.", "author": "M M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-29", "description": "Two stars notwithstanding, I will still come back to this place. I mean, it's in my building, so it's quick and the price is on par with other restaurants around me. But in future I will just be careful...very careful...about what I order.\n\nI usually come here when I have a sushi craving, and while the Sushi A combo promises value and speed, it really is not worth it. Today the California roll was tasty and seemed to be reasonably fresh, but the nigiri pieces it came with smelled bad, and had discolorations on the fish where they had been nestled snugly against each other for who knows how long. I threw them away. The soup is good and hot, but the salad is worthless. So the value of the combo is sort of lost when you throw half of it in the garbage.\n\nI would come back here for just the California roll, or for something cooked. But no more sushi combos for me, thank you very much.", "author": "Marie C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-23", "description": "Yeah, not sure \"fantastic\" is the best descriptor for this place. The selection was good, the prices reasonable, but was not too happy when my sushi fell apart, and some random avocado that was not a part of the sushi description appeared. Inspect your eats before you chow down.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "I wouldn't say this place is fantastic, but it's a decent Japanese place considering the other alternatives in the area.  I'd prefer Sushi Fantastic's actual rolls and sushi to their bento boxes.  I've had their chicken teriyaki bento and the meat was dry and a few sliced carrots were considered the veggies.  Nothing to rave about.  The dragon roll is really good and the California rolls are decent.  It's definitely good, but not fantastic.", "author": "Claire H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-23", "description": "When usual cheapo lunch spot \"Dirty Sushi\" closed (ok it wasn't called dirty sushi, I just called it that 'cause it's in the SOMA and I call everything in SOMA dirty) I thought half-way decent sushi was gone forever. Then Sushi Fantastic opened and it's much better. Sashimi lunch w/ miso and salad - money! And I don't have to battle the ferry plaza crowd to get my lunch on. 3 stars cause I can't call food served to me in a little plastic tray anything but 3 stars worthy - sorry kids it just ain't gonna happen.", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-27", "description": "Great place that is fast.  I have only had the sushi which is pretty good.  It's like a sushi place that I remember seeing in the Japan subway.", "author": "Ginny M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-06", "description": "It's the only decent take-out Japanese place close to my work. *Sigh* I haven't gotten disgusted or sick from the food yet, so I will continue to give them business when I simply can't wait until after work to get Japanese food. If my dad saw me eating their food, he might faint though. A real Japanese dad won't let his little girl eat food from here.", "author": "Su K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-18", "description": "So it's not authentic Japanese. And the ambience is kinda shabby. And warm. But you know what? It's still healthy food. And inexpensive. And made fresh for you, not sitting in bento boxes for hours already. I had much worse for $10, really.", "author": "Roland A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-29", "description": "I am sure they have other good stuff on the menu. I just can't help not ordering udon every time I pop in this restaurant. Occasionally, I will add an order of sashimi, of coz' together with my udon to go. They are really busy during lunch time, if you are thinking of getting take out, you should call to put in your order.", "author": "Ervinna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "I work right by Sushi Fantastic, but didn't discover that fact until I was Yelp-ing the other day at work. (SHH!)\n\nSushi is my favorite food, and during lunch, I don't experience ambiance or service much. I grab my food to-go and get back to work to make those dolla dolla bills, ya'll.\n\nSo I am basing my review purely on takeout standards (I would give the place 5 stars in that category)\n\nSuper fresh fish.\nGreat prices.\nQuickly made.\nSuper friendly staff.\nYummy.\nI love it -- I'm going back every workday.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-15", "description": "gross. i went against my better judgement and just tried to cover the fishy taste of my rolls with as much soy sauce as i could get my hands on (since i did pay $13 after all). couldn't finish the strangely just above room temperature edamame, even after i picked out the brown shrively ones. left me feeling generally icky and regretting that decision.", "author": "Anne C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-19", "description": "I can only judge the sushi/sashimi, I have not tried the bento or udon. If you like your sashimi luke warm and room temp then please by all means, enjoy. The tuna tastes like its been sitting in the sun for a couple hours. I gave them several tries due to the fact it is one block from my office, but my stomach could not allow me to return after I saw them gutting a fish behind the ordering counter. That coupled with my previous warm fish experience was enough to make me want to throw up everytime I walk passed on my way to Soup co.", "author": "Lizzie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-11", "description": "While the sushi here leaves much to be desired, I really like the udon. The udon here is nothing special, but it is consistently decent, and at a good price point for Fidi lunch time fare. When I'm too lazy to walk to Chinatown for a bowl of pho, a bowl of udon will partially satisfy my noodle soup craving.", "author": "Erin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "considering this is basically a FiDi lunchtime 'fast food' joint, it delivers quite nicely.  i got a couple of rolls and miso soup.  it was delivered to my table within 5 minutes despite the line out the door.  not the best sushi ever, but def not the worst.  i am looking forward to trying an array of their japanese offerings, including the udon on cold days.  to avoid standing in the ling line, suggest going in at 1pm, it is cleared out by then.", "author": "e w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-12", "description": "One star for being open after 3pm on a weekday in these parts. Lost 4 stars because as I stood at the cashier for 5 minutes, nobody behind the counter even acknowledged me. The cook looked at me, but didn't say anything to anyone, the cashier was nowhere to be seen and the bus-person looked at me but totally ignored me while they ate their own food but clearly saw me. Come on...if you are open, you need to provide service. This place isn't even all that great the other times I have been there either. No wonder all the spots around this place have closed down...I think it might be next.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-05", "description": "Typical Japanese fast food place.  Sushi is not great, but eatible. The best on the menu is the Chicken Katsu with Tempura Bento box.   Happy hour is suppositely pretty cheap, but they close so early I doubt anyone is able to take advantage of it.", "author": "grace C."}
