{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-04", "description": "Great omakase, high quality sushi, fairly large venue, and upscale ambiance. This is the first time I had the opportunity to sit at the sushi bar during an omakase where the sushi chef actually explains what he is making for you as he prepares each piece. We were assigned to the head chef, who was clearly knowledgeable, friendly, but not overly talkative. Each of sushi was beautifully crafted, and the non-sushi items were also delicious. \n\nRecommendations: Exclusive Omakase with the Supplement (pricey, but worth it!)\n\nPros: Sushi, set-up, takes reservations, quick service\n\nOkays: Not much street parking\n\nCons: N/a", "author": "Perry H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Wow! I had an amazing omakase experience here.\n\nHad a reservation at 7:00PM, greeted my the entire staff when we walked in and seated immediately. \n1. Omakase $79/person was good! \n-Our starter was cooked octopus with bbq seasoning (tasted like chai siu but on octopus). \n-My favorite piece was the fish skin mixed nigiri piece because it was very unique and flavorful. 2nd favorite was the crab nigiri, extremely fresh! \n-Fried uni tempura was a bit different, didn't taste like uni anymore, felt like eating batter with a hint of mint, a bit disappointed with this dish \n\n2. Supplement: $39/person was definitely worth getting!\n-Monk fish liver, this was sooo good! So soft and savory. \n-additional 4 piece nigiri: 1. medium fatty toro tuna (i usually do not like the super fatty) 2. Uni (YES much better than the fried uni). 3. Salmon roe 4. Scallop (soo tender with a hint of sweetness) \n\n3. Wagyu beef- too fatty and chewy\n\n4. Sake pairing $45/person must get if you plan to drink sake anyways. Comes with 5 generously poured tastings. Champagne, 3 sakes, and a dinner sake that went very well with the match pudding dessert. \n\nOverall, 5 stars because of the extraordinary service. We were definitely taken care of!", "author": "Jenny Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "This is a sort of hidden, unassuming place from the outside, and nice enough but not hugely memorable on the inside. \n\nOn the Omakase, the chef's choice nigiri is truly excellent, absolutely stunning, and the sake pairings are diverse and unique. The rest of the omakase was very good, but not as memorable. For example, tempura uni in a shiso leaf; when you fry such a delicate flavor, all you taste is tempura. It looks cool, but it's kind of a waste, and doesn't do anything to highlight the uni.\n\nOverall, I will absolutely return for the chef's choice nigiri, many times over.", "author": "Ryan W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "I wanted to treat my friends for letting me stay in their guest room for the better part of a week, and I'm very lucky they chose this spot. We were able to get a reservation without too much difficulty on a Thursday evening.\n\nThe ambiance is a mildly dim place with gray and earth tones. The vibe is chatty but not so loud that it would prevent you from talking to your friends. Service is polite and friendly but with a reserved Japanese feel.\n\nWe went for the exclusive omakase and they kindly asked if there were any foods we would prefer not to eat. The food came out at a good pace, and it was fun to sit at the bar and watch the chef make our food. Everything was really delicious and fresh. The fish was very clean with great texture.\n\nWe also had the sake pairings. The regular one gets you more variety, but the junmai daiginjo felt cleaner and more crisp, if that is your preference.\n\nOverall we really enjoyed the food and drinks and would not hesitate to come back if we were in a spendy mood!", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "I've been twice and it's definitely a bang for your buck. $60 omakase and you get good quality fish without the crazy frills of an overpriced/super fancy joint. I really enjoy that this restaurant is not super well-known  either, because it makes coming here SO easy. It can be a really intimate spot for a date. \n\nThe chefs here are really nice and they're always ready to talk about anything. We always end up talking  about the food, though (origin, preparation techniques, etc).\n\nI haven't had a disappointing experience yet. I just might have to keep coming until then.", "author": "Lyra C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-18", "description": "Came to Sushi Hon for my birthday last weekend and to my surprised, not bad... \n\nAfter being exposed to New York standard omakases, it's hard to find anything good (or even decent) in the Bay Area, so my boyfriend and I vowed not to eat omakases in the Bay moving forward. He didn't keep his words for long... \n\nThe restaurant itself is not very big, sits about 40-45 people max? There are two separate sections, the bar seating and the regular dining seats. I can't remember exactly how many are there on the bar (maybe around 8-10 people?) and the rest is dining table. There are two chefs serving the bar area, and the one that served us that night was Chef Jason. \n\nThere are two options for omakases, we opted for the Exclusive omakase (go big or go home, right?!). The price is surprisingly reasonable, $108 for 14 pieces of nigiri plus 5 other sides?!?! No f-ing way... I'm used to seeing $150+ in New York so this was a good sight for me. \n\nEverything on the menu was pretty impressive, a few items I can do without but in general, very satisfying. There was a piece of mackerel that was extremely fishy to me and I told Chef Jason, he immediately switched to something else after the next round. Also want to mentioned how nice the fish and rice ratio is, the fish perfectly covers the rice and the texture of the rice is nicely vinegar. \n\nAfter talking to Chef Jason a bit more, we learned that he is actually from New York!! Omg... no wonder!!! My boyfriend and I went on and on about which Japanese restaurants we been to in New York and he would tell us whether he liked it or not and how he also worked there before or not. Lastly, Sushi Hon was definitely a nice surprised to me. The food was fresh and the quality was on par. Chef Jason is bringing the Japanese omakases from New York to the Bay, I like it!", "author": "Stacey T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Omg definitely BEST omakase place that gets you bang for your buck!\n\nThe prices here have risen (probably due to increasing popularity), but the chef and service are awesome, humble, and friendly. \n\nWe got the upgraded menu ($40ish more) but it was definitely worth it. I shared a sake flight with my girl friend and we were both glad we did that because the flight is pretty big (and plus we drank a bit beforehand already haha). The total came to $175 per person after tax and tips. I won't talk about the actual dishes here because you haveeee to try it yourself ;)", "author": "Maggie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "I love this place! It's not a fancy omakase place, but good server with good knowledge.\nEverything is fresh, but I was okay with the sake pairing.\nMy favorite is the salmon and the dessert! The deep fried uni.. oh boy. And I don't usually like uni at all.\nI would recommend this place to everyone. Parking a bit hard, that's why we took uber there.", "author": "Candice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-23", "description": "I thought this place was reasonable but there wasn't enough uniqueness in the various dishes, one or two minor ones that were interesting but not my favorite omakase", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "I love Sushi Hon! What a refreshing experience and such delicious food. It's one of my favorite places to enjoy omakase in San Francisco. \n\nI had reservations for a earlier seating but ended up falling asleep through my nap alarm and missed it. They called me a few times and when I woke up panicking I called them back, they were so kind as to accommodate me that night with a later reservation. \n\nThe chef was so amazing and friendly. We had great conversation and the food was exemplary. \n\nThe omakase is $108 and the additional supplement is $39, I chose both! I also decided to do the Junmai experiment and it was one of the best selections I've had. \n\nThe aura of the establishment, kind and informative staff and amazing food won me over. \n\nThey play awesome music too, my head was bobbing from the tunes to yummy sushi the whole night.", "author": "Mone J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "Amazing find!! My boyfriend and I stumbled across this place searching through Yelp on a Saturday night and surprisingly we were able to make reservations for a few hours later! I requested bar seating and they were very nice to call me to let me know that the sushi bar is not available at the time we reserved and asked if another time would work. Thumbs up for actually looking at the notes/special requests and being accommodating!! Some restaurants don't do that... When we got there, a carnival was going on so we had to park kinda far and walk through it (probably why there were so many open reservations) and it's also in a bad area. When we arrived, we did have to wait for people to leave and waited quite long actually... but they were so nice and offered complimentary sake!\n\nOn to the omakase! Their omakases are decently priced. $79 for the regular one is a steal! That's the one we ordered, along with the supplement. The supplement was very worth it! Chef Jason made the experience 10x better! I always say we get lucky with our sushi chefs. The whole meal probably lasted 2 hours but that's the norm. This place really surprised us for something we weren't planning on eating at!", "author": "Kristie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Located in the Mission, Sushi Hon is a hidden gem--unsuspecting exterior with a sleek & cozy interior--waiting to delight you with their impressive Omakase options. We came here on a Wednesday evening with reservations and were seated at the bar, where there were 2 sushi chefs preparing the goods. \n\nThere are two options available for the Omakase, either the Tasting Menu Omakase ($79) or the Exclusive Omakase ($108). Adding a supplement for either one is $39. We went for the Tasting Menu Omakase and was in for a real treat! \n\nFor starters, we were presented with a chef's special \"seasonal\", which was tako tonight. Tako is notoriously difficult to prepare and our chef told us he massaged the tako himself prior to preparing it in order to ensure tenderness. It sure did the job because the tako was absolutely tender when we bit into it--very enjoyable and tasty! After the starters, we had 4 different types of nigiri.\n\nMadai (red snapper from Japan) - the red snapper had a hint of citrus which really elevated the flavor of the fish. Botan ebi (spot prawn from Japan) - a sweet shrimp with a a softer texture. Kanpachi (amberjack from Japan) - firm texture with a flavor that holds its own, didn't need any garnishes. Sake (wild king salmon from New Zealand) - this one was my absolute favorite! The salmon was so rich and buttery, had a hint of soy sauce and completely melted in my mouth! \n\nAfter having those 4 nigiri, we were served some Deep Fried Uni with Shiso Leaf. I've never had uni deep fried before so this was a unique experience. The shiso leaf was the most memorable part of the dish, with its distinct flavor that perfectly complemented the uni. I noticed that uni isn't as flavorful cooked as it is raw but it was still delicious. The deep fried uni was then followed by a second round of nigiri, once again with 4 more different types.\n\nMuki hotate (shucked scallop from Japan) - delicious sweet and soft scallop with a hint of citrus that melted in my mouth. Kinmedai (golden eye snapper from Japan) - our chef seared this with a torch and oh my goodness, it made me want to believe that maybe if I seared everything I cooked with a torch, all of it would magically taste amazing! There's a very unique taste when fish is seared and I love it! Akami (wild bluefin tuna from Boston) - this is a very red fatty tuna with a great texture and smooth taste. Shima aji (striped jack from Japan) - beautifully presented, the striped jack tasted very fresh and meaty.\n\nAfter these 4 nigiri, we had a little break and were treated with a dish that included Hokkaido Scallops, Foie Gras, and plum wine gel. Whoever came up with the idea of putting all of these ingredients together was genius! The flavors complement each other so well, despite how uncommonly they're seen together. Loved this dish! After this, we had one more round of nigiri, this time with 3 different kinds. \n\nKurodai (black snapper from Japan) - our chef brought out the torch once again to sear this one and boy was I excited about it! Chu toro (medium fatty tuna from Boston) - I love love love toro in general, this is no secret, so it was no surprise when I closed my eyes and hummed with joy as this toro melted in my mouth. After this last round of nigiri, we opted to add on the A5 Wagyu Beef nigiri and I'm so glad we did because it was amazing! The wagyu is seared with the torch and radish is added on top to balance out the flavors. So good! After that, we were served Shiro Dashi, a soup with shiitake mushrooms and scallions. Very simple and very light way to bring the meal to a close.\n\nLast but not least, we had dessert! The house made daily special was match panna cotta and oh my gosh, it was the best panna cotta I've ever had in my entire life! I am a dessert fiend and this is definitely one of my favorite desserts of all time. Can't say enough good things about it!", "author": "Bellina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "Yass, you do your thing out here, Sushi Hon! The BFF apparently made ressies at Omakase, but was told morning of, that bar seating was out. I meannn what's the pt of going if you can't get bar seating, amirite?! So a SUPER day-of, last min omakase scramble led her to finding available bar seating ressies at Sushi Hon. The best part? Bar seating isn't a traditional two seating times like other omakase spots are (ie 5:30 and 8:30)...this spot works for you and has bar seating ressies for every 15mins available! Idk if it'll stay that way, but I'm all about this now. \n\nService was good overall. The waitstaff was a bit more distracted and inattentive than I would've liked (had to wave them down for hot tea at least three times), but nothing to get upset over. \n\nIf you're doing bar seating, there's two omakase options available - $118 and $79. The higher priced one had 3 additional nigiris than the lower priced option. That's the only diff I noticed. And then you have an additional $39 supplemental option of adding 5 pieces of nigiri to your meal. One additional caveat is that your entire party has to choose the same omakase meal. Calculating it out, the BFF and I opted for the $79 option + $39 supplemental. \n\nThe nigiri was superb (minus this one mushy fish scallion nigiri situation - see pic for reference). I was impressed. The craftsmanship for each piece served was impressive. What I was less impressed by was the cooked foods. There were four non-nigiri dishes, and I didn't like any of them. The squid starter was bitter and cold. The miso soup was extremely bland. The squash blossom was only okay. And the scallop uni caviar dish was goodish, but served with a side spoon and not explained on how to consume. Reviewing yelp photos later, noticed that it was a deconstructed dish and weren't told we needed to reconstruct it and eat in one bite. \n\nOverall, a very good last min option. The BFF also mentioned in the ressie that we were celebrating a bday and they provided an extra dessert! BUT wish the non-nigiri dishes were better. And the tea was hotter and more flavorful. For now, 4 stars!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "$79 omakase tasting menu (the $108 one was not available on the night we went).\n\n12 nigiris with a mulberry salad starter, tempura, mushroom dashi broth and a desert. The fish were all very fresh although I wish there were more unique preparations for each nigiri. It seemed they use the same sauce for each piece, which didn't accentuate the different types of fish.\n\nThe ambience is more hip and noiser compared to omakase restaurants, since they serve a regular dinner menu as well.", "author": "K. N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "I think this is my favorite Omakase restaurant in San Francisco. Ok, ok, I've only been to two restaurants really, but this was the first one my boyfriend and I tried and we loved it so much we had to come back again! The first time we went we just did the regular Omakase menu which was $79/person, and we added the supplemental which I believe is an additional four pieces for an extra $39/person. The second time we went, we went for the Exclusive Menu, at $108/person and added the supplemental too. Seriously though, SO WORTH IT.\n\nI'm horrible at remembering the kinds of pieces we ate, but there wasn't anything that I didn't like. Every piece was so good, flavorful, and just melted in my mouth. It makes all the other sushi restaurants/buffets I've been to just whatevaaaa. The chefs we had were great! The last time we went we had Jason, and he went above and beyond! Can't wait to go back and see him again! \n\nI recommend making reservations if you plan on going, especially if you want to do Omakase at the bar for the full experience. You can make reservations via Yelp, so it's super convenient! I feel like they're becoming more known and popular, so go before they get super busy!", "author": "Michele L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "I have been to most of the top omakase places in SF (Sasaki, Kusakabe, Kinjo, Omakase, etc.) and Sushi Hon is among the very best. The fish is excellent - extremely fresh and delicious, particularly the chu toro (massaged for 8 days), the king salmon, and the snow crab. Jack in particular is an excellent sushi chef - extremely friendly and warm and talented. It was a very memorable evening.", "author": "Patrick E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-31", "description": "I would like to say they have the highest​ value of sushi omakase menu, its really affordable price, but the service feels little bit rush, can not enjoy the meal so well, especially on the table seat( miss the chance to seat the sushi bar table) The end, we finish all the course, but still enjoy the drink, and​ they asked us to move to bar because they have next reservation...‍‍‍‍‍what?! Well...I don't feel good about the service, but the food is okay.", "author": "Faye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Nicely marinated and cut sushi. No other sauce needed. In fact, they don't even have the bottles of sauce available.  Very fresh and tasty. Tried fishes that I've never had before. But then again, I am not a foodie that pays attention to my food and ingredients. Nice ambience. Professional Japanese chef.", "author": "Gloria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Googled 'sushi' near me and Sushi Hon was the first to come up, and I'm so glad it was! We came for lunch and sat at the bar for omakase. $55 omakase is pretty unheard of these days, so I think the price range for this restaurant should actually be $$$. \n\nThe sushi chef was sweet and personable while demonstrating his artful technique. He explained each nigiri and told us about the origins - some fish were from Japan, Spain, etc. The fish was fresh, although not the best I've ever had. A couple pieces were semi-torched which I adore.\n\nThe miso soup finisher has an unmistakeable foie gras scent that I couldn't get over! Decadent af.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "Took my dad here for an omakase dinner at the sushi bar. The fish is very fresh and the service is great. It was especially thoughtful of our chef to ask if the wasabi was alright after the first bite (since I'm not a huge fan of wasabi, I do like them to be light on the wasabi in the nigiri). Everything was delicious, though I wouldn't say the sushi selection was special in the exclusive menu. That said, my dad and I enjoyed every bite and I would recommend this place for those looking for a well priced omakase experience. \n\nThe only thing that was really disappointing was the dessert. Though it was tasty, I thought it was rather simple: panna cotta with banana puree and a raspberry on top.", "author": "Rachelle T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "Overview:\nMake a resy\nOmakase is avail at the bar\nOrdering the supplements is worth it\n20% automatically included \nGreat service\n\nI've been to Japan three times and Sushi Hon's quality rivals the quality in Japan. The service is fantastic and the staff is very knowledgeable about their sake and sushi. Sushi Hon has easily become my favorite place for omakase in the states.", "author": "Nichole K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "I had been really excited to try this place for a while-- omakase under $100? Count me in! Unfortunately my boyfriend had a fairly negative experience. First, we made a reservation for 7:30pm on a Friday. They called and told us to come at 8:00pm instead. After we were seated, it took more than 15 minutes for someone to come by to welcome us and take our drink orders. When we were finally served food, we were really underwhelmed. Most courses were flavorless, and we can get better nigiri at our neighborhood sushi spot for less than half the price. That might've gotten this place 2-3 stars (I'll give them credit for the atmosphere and the panna cotta), but to top it all off, my boyfriend and I started feeling sick to our stomachs at exactly the same time this afternoon. We're now stuck at home on a Saturday night, having paid $240 for food poisoning.", "author": "Casey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Sushi Hon, welcome to the neighborhood.\n\nIf you like \"Japan designy\" high end sushi, this is your place.  I noticed the striking decor when walking by here a few months ago, especially since the previous tenant was a \"cheap and cheerful deli\" kind of place.  When my wife and I were in the neighborhood again we stopped in - grabbed a table for early dinner without a reservation.\n\nWe ordered a la carte, and thoroughly enjoyed the fact that they specialize in the ultra premium cuts that not every sushi place has: O toro, Chu toro, and A5 Wagyu nigiri among them.  All of those were winners, as was the \"king sake\" nigiri which we both found more flavorful than the \"zuke sake\" fatty salmon nigiri.  We also enjoyed the seared black cod (again, no surprise there) though it was the savory mushrooms in the dish that really sold it.\n\nWe got the \"sashimi salad\" which seemed to be a random variety of fish and differed from the one the couple next to us got.\n\nWill come here again the next time we need a toro fix.", "author": "Aaron M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Highly recommend for the amazing omakase! $75 per person for an 8-course meal (3 of which are sushi plates)! The scallop with the foie gras was sooo good-- that one really stood out to me. \n\nService was attentive, and so prompt whenever we finished each course. The atmosphere is perfect for an intimate date or a group gathering, since there were long communal tables. The seats are not very close together, so it works well for intimate dates. \n\nOverall, I had one of the best sushi dinners ever over here and I'm glad my boyfriend and I discovered this gem! Definitely will be back.", "author": "Christina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "Great omakase deal! The fish was fresh and flavorful. We had 12 pieces total but most of them were snappers, mackerel or amberjacks. I wished there were more variety such as fatty salmon, scallop, eel, wagyu, etc. The special dishes were okay - octopus, fried uni, miso, and scallop with foie gras. Nothing was strikingly spectacular. The service was impeccable, staff and chef were very kind and friendly. Overall a great experience!", "author": "Anh N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "This was my first omakase experience and this definitely set the bar for all future Omakase dinners. We decided on omakase dinner priced at $79 per person and added on the supplement for $39/person. The omakase dinner alone was enough to satisfy, but we were feeling gluttonous. Every piece of nigiri was a feast for the eyes and the belly! \n\nOur sushi chef was super nice. We sat at the bar and got to watch our chef make piece after piece of nigiri and learn a little bit about sushi and himself! What an intimate experience! I especially liked how our sushi chef was very attentive. He made my nigiri pieces ever so slightly smaller than my boyfriend's and would only start making the next piece of sushi after I finished my current bite. \n\nFish quality itself was great. It felt like the theme of the night was mackerel because we had a handful of different types of mackerel that night. But that's definitely not a complaint because it was all delicious! I didn't know there could be so many different types of mackerel! Highlight definitely was the Spanish mackerel. Super fresh and melt in your mouth type of feel. Oily without being overtly fishy tasting. \n\nUni was also a big highlight of the night. Chef called it ice cream of the sea! And it really did kinda taste like ice cream. Really creamy and cool on the palate. \n\nThe star of the show was surprisingly the waygu nigiri. I don't usually think of beef when I think of sushi but this experience left me dumbfounded (in a good way)! The waygu beef nigiri was melt in your mouth, slap me silly type of delicious. One small bite offered a powerful punch of meaty, buttery deliciousness. \n\nAnd the rice quality--oh man, the rice quality. Perfectly seasoned, perfectly cooked. You can feel the grains of rice in your mouth without it being dry or tasting too strong of vinegar. The rice tasted like it had really light hints of soy sauce in it. \n\nMan, I could keep going on and on about how amazing this dinner was but I'll stop here. Instead, here are some pictures of this amazing dinner. Shout out to our sushi chef who let us take pics of him while making us a feast!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-02", "description": "Dined at Sushi Hon on Valentine's Day with my galentine (and fellow omakase lover) Jennifer K. \n\nI'm torn because the food itself was 4 stars, there were a few things I really liked (1. maguro with truffle salt and 2. anago). BUT.. I left feeling jipped instead of the lovey dovey feeling you're supposed to be feeling. \n\nThe omakase on Valentine's day was $109 (regularly $78) - totallllly fine and understand it's a special menu for a special day - I get that. However, I don't even know if we got anything special? For $31 extra, we basically got one extra nigiri, a fancier cooked dish as opposed to tempura, and some foie gras on the zensai. Worth $31? Hmm.. for ~$100, I could have gone to KUSAKABE, which I remembered being a mind blowing experience.\n\nOn a normal day, Sushi Hon would be a great place to go for a decently priced, good quality omakase, but I wasn't feelin' the love on Valentine's.", "author": "Laverne N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Wonderful dining experience at Sushi Hon; Omakase is a must have because the price is way cheaper than other high end Japanese restaurants in town (normally it is $110 -$150) for a 18 items course through out the dinner. Fish is extremely fresh and high quality (salmon and toro are my favorites now at Sushi Hon); and OMG, scallop paring with fois gras is heaven! Definitely an awesome place worth the visit.", "author": "Jenny N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-13", "description": "I wanted to update my review after personally receiving a message to reach out to the establishment on email.  After I had emailed back to them accordingly, the conversation died and there was absolutely  no response.  There was no follow-up or any offer to re-establish a reservation for dinner omakase.  Still appalled by the clear absence of patron respect.", "author": "Vera L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-24", "description": "This place is a circus!! Came here last night on a Tuesday because they had lots of last minute reservations and had an insane dining experience.\n\n1. There was a HUGE sharp bone in my first piece of nigiri wtf?!!!!! One of the worst offenses a sushi chef can make and it made me paranoid of every nigiri after I got stabbed in the tongue by the bone. \n\n2. BF asked for water and the waiter straight up ignored him\n\n3. Waitress was poorly trained, told the entire table it was time for the last miso soup course and asked if we wanted to add any a la carte orders and had us scrambling and confused because we had only received our third dish (out of nine). She came over to apologize after \n\n4. They gave my bf the wrong dish and we didn't realize and he had straight up stuck his finger and slobber all over the plate and was one second away from eating it WHEN THE WAITRESS TOOK IT AWAY AND SERVED IT TO THE GUY NEXT TO ME OH MY GODDDDDDD who does this?!!!! I thought she was taking it back to the kitchen to dispose of it not to serve something she saw someone else start to eat already!!!!!! What!!!!!!\n\nDo not go here!!!!!!! $300 for this shitshow. Sad.", "author": "Tiffany V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-07", "description": "We now live in a magical time where an array of high end omakase restaurants exists in the Bay Area for our eating pleasure.  Where does Sushi Hon fit into the mix?  \n\nLocated in the Mission, this restaurant had its soft opening in 2016.  Overall I'm a fan and it's definitely worth visiting more than once.\n\nEase of finding a table: Plenty of open seating on weekends and weekdays.  Simply make an online reservation and they should have no problem accommodating you.  Not sure if that's a good thing for the restaurant, but it's great for customers who don't want to wait.\n\nAmbience: dark, moderately nice, but not high end.  The sushi bar is about average, however I was seated at a corner next to another patron and we were nearly bumping elbows throughout the dinner.  A simple oversight but one that can make a difference for a customer who is there for an intimate experience.  Everything was quite clean as would be expected.\n\nService: Our service was good but not great.  Both the server and the bar chef mistakenly presented us with dishes that we requested not be included.  We had to ask that they be returned and another dish was promptly brought to us.\n\nFood Quality: Very good!  Some standouts include a very tender and delicious octopus and nicely flavored fatty tuna.  There is a minimalist approach here with subtle use of flavor enhancement for the fish (citrus juice, soy sauce, wasabi)  This is standard practice at the high end omakase restaurants in the area and here is no exception.  Anago did have some bones which detracted a bit from that nigiri.  Also, the rice tended to fall apart with many of the nigiri.\n\nValue: This is where things are outstanding.  The price to quality ratio is simply the best you can find in the city.  Doesn't quite get the restaurant to a 5 star level in my book, but pretty close!\n\nOverall if you take into consideration the value and ease of getting a table this place is quite good.  Will definitely be coming back.", "author": "Better F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "tip: always always BYOS\n\nGreat experience with chef jason.  Really knows his stuff.  For example, wife asked for no skin on all her fish served.  Past omakase experiences would simply oblige but not Jason.  He stood ground explaining that beneath the skin has a layer of fat which makes the fish as a whole more tasty.  He was absolutely right.  \n\nExecutive omakase is a better deal for a total of 14 pieces of nigirl.  Why?  Because it already includes chutoro (otoro too fatty, no taste) and Hokkaido uni.  If you were to order the regular omakase then the supplement, you would be paying more.  14 pieces along with a few cooked dishes is just right where as regular omakase with supplement is a little much.  Also executive omakase serves different variety of fish compared to the regular omakase.\n\nAfter the meal, you can always request to your heart's content such as engawa or santa barbara uni.  1 minor gripe was that we didn't get any on the house nigiri since it was my wife's birthday.  We even shared our sake with Jason! and also he forgot 1 of the 14 nigiri!  It was hard and akward reminding him but we felt we had to.  The missing nigiri was quail egg with caviar and gold flakes!!!!!", "author": "Jacky K C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-20", "description": "I've read back on some of the reviews, and it seems the reviews are quite similar.  For those who are new to Omakase, are very impressed. \n For those who are familiar and have dined at a generous amount of Japanese restaurants, especially Japanese owned sushi restaurants, we are not so impressed.  Yelp Reviewer Doris K from 9/2017 said it best in her second paragraph.  This is a wonderfully decorated and serviced Japanese restaurant, but is trying to be something it is actually not.  \n\nAfter being seated, you immediately recognize that the entire service staff is Korean concluding that the establishment is Korean owned as well.  Kitchen staff and sushi bar didn't appear to be Japanese.  I was prepared to have a formula omakase, without the flare and purity from a Japanese chef.  In some sense, I was wrong.  The presentation, the style, seemed to have a French touch.  As I read the reviews here, one mentioned the kitchen chef has a French background which would explain my experience.  The Uni tempura was served in a large bowl with a small cavity, tempura cut on a bias and propped up.  A Japanese chef might have simply served this Uni on a piece of crisp tempura paper - purity.  I WAS impressed by the Anago - deliciously prepared.  \n\nWhile the food was excellent for what it was, I think many of us more experienced foodies feel as though the experience was a bit artificial.  It was about how many times they could turn the dining room by the end of the night vs truly impressing guest with new experiences.", "author": "Lawrence L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "Wonderful experience! \nMy friend booked a reservation for 5 people to celebrate my birthday. It was a little hard to find the place because it was in an area where we were not too familiar (it's below an apartment complex??). \nThe waiter and waitress were nice to start off by explaining the menu to us. \nWe ended up doing the monthly omakase set. Each items came out in a very nice order and timing. From beginning to the end, I enjoyed the flavors of each dish and my goodness, the umami flavors are enjoyable! \nI would come back here again to celebrate or just cus. I am definitely interested in sitting at the sushi counter my next visit.", "author": "Kiyomi K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-10", "description": "Sushi Hon was amazing! Delicious and fresh fish, modern ambiance, and excellent service. \n\nThe interior is modern. There are a few tables for people ordering entrees or a la carte, and a bar for those who opt to do the omakase menu. I have only gone for the omakase, but I would come again to try the main entrees! \n\nThe omakase is $78/person, with 11 pieces. You can add a supplement (additional $36/person, 5 pieces) and sake pairing (additional $40/person). The standard omakase alone was enough to fill us. They gave us a menu to track the progression of our meal, which listed some highlights like the scallop with foie gras, the wagyu tempura, and dessert. The supplement includes more higher quality ingredients (e.g. ootoro, uni, wagyu, etc.) However, the standard omakase is more than enough, and it might be better to order a la carte especially if you can't finish 5 more pieces. We decided to try the ootoro ($9) and it was so worth it! \n\nOverall, I highly recommend Sushi Hon. Their omakase is affordable without compromising the quality and the experience.", "author": "Poy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "We came here for our anniversary dinner and the food was pretty unforgettable. We made an appointment at 7 to sit at the bar but two patrons took way longer to leave so we waited at the bar for 30 minutes before we were seated. The host was apologetic, wish they would comp us for at least one drink while we waited at the bar but alas, no dice. Oh well. \n\nAfter we were seated, we decided on the premium omakase and my husband got the sake paring. The pairing doesn't come with every course but they were full pours. My husband actually couldn't finish the drinks because of the big pours.\n\nI don't remember the names of all the nigiri pieces but the majority of them were really good. It wasn't the run of the mill type of fishes and everything tasted so fresh. They also used little garnishes like lemon zest to punch up the flavor of the fish a bit or blow torch the fish a bit for textural contrast. The pieces of the fish that I remember were yellowtail, Spanish mackerel, flounder, firefly squid, uni/scallop, tuna and salmon. \n\nWe also had two cooked courses, foie gras with scallop and beef. The foie gras was overcooked a bit and the flavor of it overwhelmed the scallop but it was a tasty bite. The beef was super delicious, melt in your mouth beef and a crispy wrapper to give it some texture. There was also a salad with a lot of fruit, a miso soup and the panna cotta. \n\nAll in all, I thought we had a great experience at the restaurant. It was a pricy meal but it was well worth it. Many times, you pay $100/head or more and the food was just meh. Definitely worth the splurge.", "author": "Alice W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-17", "description": "Came here for my birthday and this place does NOT disappoint! Customer service was great and we were even treated to a glass of champagne since we had to wait for our seat. Chef Jason was amazing - I was so full and happy by the end of our Omakase + Supplement! The experience was soooo worth it!", "author": "Erika D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Fantastic intimate omakase experience! We sat at the counter and got the regular omakase, which was about 14 pieces, and then also did the supplement of 5 pieces. The quality of the fish was top notch, it was super fresh. Our favorites were the otoro and cured salmon. Our sushi chef for the night was great and clearly an expert. \n\nFor drinks, we opted for one sake pairing which they allowed us to share since we didn't want to drink that much (very nice of them).\n\nThe service here was amazing, everyone was very attentive. They even came out with some delicious green tea cheesecake and candle and sang happy birthday to my boyfriend without me even asking! \n\nThis place is definitely pricey but the experience felt so intimate and personal that you won't regret it.", "author": "Shabnam E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "WOW!! Just had dinner here and I am surprised that this place isn't more popular! We just had an amazing omakase here today for a super reasonable price! All of the sushi was super fresh and the seasoning was amazingly well balanced... a little ginger here and dab of salt there. The dishes were delicately smoked, marinade, or just left alone. There was nothing that overpowered the fish or felt like it was masking the flavor. Also, all of the fishes in the omakase menu were very unoffensive... not overly fishy at all. Boyfriend was absolutely blown away. Also the scallop was one of the sweetest I have ever had. \n\nMy boyfriend and I have eaten our way though every Michelin Star sushi restaurant (and many of the non star restaurants) and my boyfriend thought this place was better than the majority of them.  I have to agree that this one really left a great impression with me as well. Chef Jason really was thoughtful in creating great flavor profiles... plus the value can NOT be beat! The regular omakase is around $79, which is a huge steal. If you orders the regular omakase you would be pretty full and have had an absolutely wonderful experience. The fishes included in the regular omakase were great (especially the kurodai, the sea perch, the scallop, and the Chu toro.) The cooked dishes were SO GOOD! Excellently prepared. THEN if you top that off with the supplement, you are getting the absolute most decadent uni and wagyu sushi. We even got tuna fish CHEEK sushi... whatttt???? The cheek of the fish is often considered the most rare and decadent... and this was the first time I have ever seen it in a sushi restaurant like that (rather than just giving us regular otoro.) \n\nIf you get the omakase and the supplement, you are paying like $118 for 16 pieces of sushi plus amazing side dishes. That is WAY cheaper than at a lot of these high end restaurants (where you only get like 12 pieces and no cooked dishes.)\n\nService was great and you could tell this place had a lot of regulars. On both sides of us, the group of people wanted to chit chat with us about the sushi and stated they had been there multiple times. The chefs were super friendly too. I would TOTALLY recommend this place asap!", "author": "Jocelyn K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "There aren't a lot of places in San Francisco where you could get a quality omakase for under $80. Sushi Hon is one of those gems. \nIf you are looking for an extravagant dinner to celebrate the most special occasions, this restaurant will disappoint you. Service is attentive and all but the vibe speaks casual affairs. Seating arrangement are either sushi bar or communal table. It is a great choice for a date night that would satisfying most sushi craving but nothing more.\nFood is a bargain for the price. I enjoyed my dinner and dinner I bet you would too.", "author": "Mona W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "To me, this is the best place. Highly recommended.\nThe chief put a lot of different materials on the sushi which results in a lot of different flavor.", "author": "Nathan M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "Was expecting more after I went to hinata sushi. The fish did not taste fresh. I was sort of underwhelmed. I wanted to like this place, but with all the omakase places popping up in the city, I'll probably not be coming back any time soon.", "author": "Ben C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-19", "description": "Solid omakase meal. I took my friend out here as a welcome to San Francisco meal (because omakase in SF combines class, fresh seafood, and just enough trendiness) and it was great! Made a 7PM Saturday reservation for 2, but when we arrived, it was not crowded at all. I'm sure it's busier for their very affordable lunch omakase.\n\nWe opted to sit at the bar to be able to watch them do their thing and our chef seemed a little shy, but really nice! It was a really reasonable meal - $79 for an omakase dinner. Next time, I would spend a little more to add the extra.\n\nLocation wise, it's tucked away in a quieter side of the Mission, but an easy walk to the bars. Noise level was perfect for soft conversation, and this is 100% a date spot.", "author": "Colleen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-03", "description": "Came here for the omakase and added some other nigiris. \n\nThe omakase has a lot of seafood so I was quite excited. The non seafood items seemed hastily put together. Got this salad thing...and it was just bland. Nothing gelled together. The scallop with foi gras was quite good and exceed expectations.\n\nYou get 11 pieces of fish and most of them were white fish and I thought I was eating the same thing again and again. Got two different kinds of mackerels. You do get some salmon (only one I can remember part of the omakase that wasn't white fish)\n\nThere is also a lot of blowtorching. I was not a fan of that. Takes away from the fish flavor.\n\nOrdered the sweat shrimp (amaebi) and they didn't deep fry the head . The chutoro was my favorite and was very fatty.\n\nOverall, seemed a little bland. What is nice is that place is a bit empty and that means you might be able to walk in", "author": "Victor D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-04", "description": "The best sushi in San Francisco !!! Such an amazing  food. Everything is delicious!!! I can't wait to come back !!!", "author": "Stephanny D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Updated: second visit we sat in front of Jason at the sushi bar and had another great experience. I've learned some new tips on how to eat sushi and some very interesting tips on what is consider sushi and what isn't. Amazing food time.", "author": "Shane C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Delicious Omakase. Amazing Chefs. High quality fresh fish. The detail to their craft is simply the best. Service is great. Friendly staff. Definitely commend and will go back.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "3.5 stars but rounding up!\n\nThe bf surprised me with dinner at Sushi Hon for our anniversary this year. We swung by on a Wednesday night 6-6:30 p.m., and the place was empty -- I wasn't sure if that was a good or bad thing, given that it *was* Wednesday night. On the outside, Sushi Hon is very unassuming -- you wouldn't know that Sushi Hon was there anymore than you would've guessed it was a sushi spot. \n\nOn walking in, I got the vibe of a restaurant trying hard to be something that it maybe wasn't. I don't think Sushi Hon bills itself as a \"upscale\" omakase spot like Kusakabe or ju-ni, but I think it might be trying to be? I'm not sure, but it's definitely a casual dinner spot. And if this matters to anyone, Sushi Hon seems to be Korean-owned and none of the chef were Japanese as far as I could tell. I don't think you need to be Japanese or from Japan to make good sushi, but just saying. \n\nWe were a bit early for our reservation, so we hung out at their little bar area and I ordered a drink (rosé, I think?). Once the chef was ready, they seated us at the bar (they have a sushi bar and then long, communal tables) and we pretty much had Chef Minh to ourselves our entire meal. He was very easy going and fun to talk to, which always makes it a better experience. It's nice to be able to talk to the chef, hear about their journey, learn about the fish and all that jazz. Overall, service was attentive and everyone was nice. They gave us a slice of cake since we were celebrating our anniversary, which I thought was sweet. \n\nAt $78 per person, Sushi Hon's omakase is very affordable and I think worth the price/experience for those who are new to omakase. The fish that night was very basic -- generic even -- but of good quality and well prepared. I think the mostIf I didn't look back at my pictures and notes (yes, I take notes...), I really wouldn't remember much. It wasn't a bad meal by any means, it just wasn't all that memorable. \n\nHighlights:\n- Squash blossom tempura: SO GOOD. If you like kabocha, you will love how sweet and crispy this is. \n- Muke hotate: I watched as Chef Minh cut a slice off the scallop and it was HUGE. Well, the scallop itself was huge to being with. But I was skeptical because giant pieces of neta are bleh. But the scallop was SO sweet and not overly mushy that I was glad it was a big piece :P\n- Wild King Salmon: I'm usually okay on salmon, but this was super buttery\n\nI didn't care too much for the salad appetizer or the Hokkaido scallop with foie. They weren't bad, but again it had that feeling of trying to be something more? Same with the desserts. \n\nFor anyone who considers themselves an omakase aficionado, I would say pass on Sushi Hon. For those who are new to omakase, looking for a more affordable option or like a more basic fish selection, check it out.", "author": "Doris K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "I came here with my 6 friends. We all had the Omakase $79 set here, it is the 11 piece sushi, a special soup and a dessert. The fishes here are so rare that you can barely find in other Japanese restaurants. Like Black Snapper, Red Snapper, Aji, kanpachi......It comes with the fois gras with scallop and salmon roe. It's the high quality ones. It tastes so good with everything and later freshened my mouth with plum wine jelly. Chef Jason already put the sauce on all sushi, we don't even need soy sauce. He asked us to use our finger to grab it to have the authentic taste of it. It taste sooo..... delicious! Yummy! Every fish is different and amazingly delicious. The flavor is just prefect. Trust me, you gotta try all these here in Sushi Hon. \n\nI sat at the sushi bar to watch the head chef Jason cut the fish and serve it to us. It's very enjoyable to watch and Chef Jason also gave me some knowledge of where the fish were coming from and some interesting facts about Sakura Salmon. He showed great skill in cutting them and took out the bones from a sardine fish. The waitress is attentive and pleasant. She explained me what I'm about to enjoy.  I had a pleasant conversation about Japan with Kent, the Japanese manager. The service is awesome! Me and my family enjoyed it so much. The value of the fish is higher than the price, I would definitely come back again soon! I already want to have it again while I'm writing this review. Slobbering.....", "author": "Betsy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-19", "description": "Drove across town to eat here, showed up at 9:54 and was told we could not get any food even though the hours are until 10:30. Super lame. Super bummed and won't ever be back", "author": "Emily E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-11", "description": "I'm beyond picky for what they call \"omakase\".  I'm a sushi sob especially if you been to Japan. When a high end restaurant offers omakase, I do expect nothing but the best. There are so many high end omakase in the city and many of them with michelin stars. My favorite is juni but the other places I only gave it a 3 star like Kusakabe. Sushi Hon falls right in the middle. If you are paying $250 dollars, shouldn't you be getting the best? My meal at sushi hon was $160, with the supplement, a drink and 20% tip. It's what you call a steal. Some of you might be rolling your eyes, I don't blame you. \n\n$78 omakase - 11 course \n$36 supplement - 5 pieces of sushi \n\nLast night I sat with Chef Lee. He was great! Very friendly and pretty knowledgeable. Don't judge me but I find myself more knowledgeable than most chefs (when it comes to sushi, ha!).\n\nMy omakase experience was fun. The sushi was fresh, pretty and yummy. I'm open minded and since its chef choice, I let the chef serve me. I'm not the biggest fan of sardine or mackerel. I had a lot of that in my standard 11 course. It's not the reason for the minus star. Not every piece blew my mind. I felt it should even with things you do not love. I was pretty contend with the 11 course but I really wanted to see what they would bring if I ordered the supplement. Because the supplement should be their signature pieces. So bummed that they didn't have waygu as the finale or at all. Well I guess I will just have to wait till my trip in Japan later this year. \n\nMy favorite piece was the *toro, topped with uni with caviar. Best piece of the night.", "author": "Sandy B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "I made reservations for Thurs., 9/13/18 for 7pm.  I then modified it to Sat 9/15/18.  On Fri, 9/14/18, a hostess called to see if they can move me to 8pm and another hostess called me to confirm 7pm.  On Sat, our 17th year anniversary, we were really looking forward to this place because a friend had recommended it, they called and said that our reservation was at 830 pm.  I was so fed up with the miscommunication of the staff that I just cancelled the reservation.  Maybe the food is awesome, my husband and I were really looking forward to our dinner but we ended up having an awesome time in San Mateo with epic sushi!  I hope the service here gets better for me to want to even try it.", "author": "Ann I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-21", "description": "Came to Sushi Hon as a late Valentine's Day dinner with my SO. Sushi Hon is a hip Japanese restaurant with traditional vibes. It has both a  comfortable and relaxed atmosphere, which is always a plus.\n\nFor an omakase of $80, it's not ridiculously expensive compared to other spots in the city. However, I felt that the food wasn't that great. The first dish was a salad, which was very meh. The foie gras was all right and the fish was decent. My SO loved the panna cotta, but I feel like they could've done so much more. It also didn't help that our waitress was constantly hovering over us...made me feel like I was constantly being watched.\n\nWouldn't come back, but I don't regret coming here. 3/5 stars", "author": "Nicholas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "One of our favorite omakase sushi restaurant in SF. For $79 you get a variety of sushi and cooked dishes. Such an amazing value when other places are at least double this price. I also like that each type of fish is perfectly prepared by aging, smoking, curing or something else. It's not just a piece of fish on a sushi rice. They also make their own blend of soy sauce and oils. Each topping of sauce, squeeze of lemon juice or different salt topping is added to accentuate the flavor of the fish. Nothing is done without a purpose to enhance the flavor of the fish, instead of masking it on other places. If you have a choice of sushi chef, sit at Min's counter. His perfect knife skills adds to the perfect ratio of rice and fish.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-17", "description": "I was going to be attending a New Year's Eve party in the Mission and with that in mind, searched for dinner options nearby. As expected, many restaurant jack up the price for New Year's Eve with special prix fixe menus. I made a reservation online at Sushi Hon 2 weeks in advance for 8pm on New Year's Eve and then immediately called to ask if they would be serving anything different for New Year's. They said they would be serving the regular menu at the regular price. I was relieved.\n\nThen two days before the reservation, I received a call asking me to move the reservation to 8:30pm. I said no that wouldn't work since my friend's party started at 9pm and I didn't want to be too late. The person on the phone also asked me if I preferred a table or the sushi bar and that only omakase is served at the sushi bar. I said I'd like to sit at the sushi bar.\n\nOne day before the reservation, I got a text telling me that there are only 3 seatings for dinner and it was 5:30pm, 7:00pm, and 8:30pm. I had to choose one and went with 8:30pm but felt that it's rather last minute to force these fixed seating times on people when I made a reservation 2 weeks in advance.\n\n8:30pm on 12/31/17 comes and we walk in about 5 minutes after our reservation time. They were very sweet and gave each of us a glass of sparkling sake on the house to celebrate (and wait). We waited another 30 minutes before we were seated. At this point, it's past 9pm and I was getting anxious about our schedule.\n\nWe were presented a lovely menu that showed a price of $108, which was more than the $78 I was expecting. I asked the server why there is a price discrepancy and was told that there is a regular omakase menu and an executive omakase menu and for New Year's, the sushi bar was only serving the executive omakase (but usually they serve both there). They said they had told me over the phone; I don't recall anyone distinguishing two versions of omakase for me but whatever, I let it go.\n\nWe took the menu and tried to follow along as courses came out. However, it was wrong and the meal was almost over before the correct menu was finally brought out. From the two versions, it appeared that what we got were served not as extensive as the \"wrong\" version. It makes me wonder if the \"wrong\" version is what they serve on other days but the \"right\" version is the marked-up New Year's version even though I was told over the phone that there would be no special New Year's menu. \n\nI realize this review is long and I haven't even mentioned the food and that's because these service/booking issues really hurt our experience. I had to ask them to rush our meal service because we were now running an hour behind our original schedule. The sushi was, after all, fantastic. I really enjoyed the artistry of the chef. If you're going on a regular night, you're in for a treat. I just hope Sushi Hon figures out the logistics before the next big holiday dinner rush.", "author": "Yi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "One of my favorite go-to sushi places in SF. The price of the omakase is unbeatable for what you're served. Whatever the sushi chef puts in front of you is always a delicious surprise! Everything is super fresh and has well balanced flavors.\n\nI get beyond stuffed from just the regular omakase, but treat yourself with the supplement if your belly still has room!", "author": "Yanni C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "The restaurant: clean, fancy, quiet, and empty on weekdays(we basically had the whole restaurant to ourselves from 5-6:30)\n\nStaff: very friendly, but they made me feel awkward by watching me eat every piece of sushi \n\nPrice: I got the executive omakase for $108 plus a supplemental add on for $39 more, which has 5 more pieces of sushi. \n\nFood: everything was fresh and delicious from Japan\n\nParking: parking is free around that block, but it's very hard to find parking. \n\nOverall I have nothing bad to say about this place-good food at the right prices served by nice people  in a nice restaurant with ok parking if you're lucky.", "author": "Irene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "Dined at the sushi bar for husband's bday a couple weeks back. The fish was fresh, octopus (their appetizer special) was extremely tensor, and chefs were super friendly. We choose the more elaborate omakase and all courses were great. The fish is a little thin but fresh and good quality.  $119 price was not bad - given SF omakase prices have gone up dramatically the last few years. They get much of their fish from tsukiji market flown in also. \n\nWe didn't have any sake but one can enjoy the many optionsthey offer. For my husband's birthday, we for a slice of blueberry cheesecake for free. Very nice staff and attentive. Will return.", "author": "grace C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Unique sushi dining experience.\n\nMy co-workers and I came here a few nights ago for a team dinner and had a great experience. The venue is located in a sketchy neighborhood and can be hard to spot. But the restaurant itself is small, intimate and clean.\n\nWe opted for the pre fixe menu which comes with seven courses and dessert. All of the non-sushi dishes, although relatively small, were intricate and beautifully crafted. My personal favorite was the zensai (Hokkaido scallop, Hudson valley foie gras and corn pudding). As part of the pre fixe we also got to try 3 plates (4-5 pieces of sushi at a time) of sushi from all around the world. Everything was fresh and delicious. If you're not a fan of wasabi (which comes with each piece of sushi), I recommend you ask the chef to use less...a lot of my coworkers were struggling with the amount of wasabi being used. If it's in your budget, I highly recommend the supplement which includes uni and wagyu beef. It was definitely my favorite of the night.\n\nService, overall, was great. All of the servers were very attentive and intent on ensuring we had a great experience.\n\nI'll definitely be back!", "author": "Claudia C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "3.5 rounding up!\n\nVisited Sushi Hon just last week with my group of girlfriends. We ended up here because we were unable to grab some last minute reservations for Hinata. They are both similarly priced with the Omakase starting at $78 pp and an optional supplement for $36. ($2 more expensive than Hinata)\n\nWe all opted for the Omakase AND the supplement. We had the bar seating but we were actually really disappointed with the way that the bar was designed. We were unable to see anything that the chef was preparing and we felt really short sitting at the bar. For all of my past Omakase restaurant experiences, I was able to witness the chef in action, but at Sushi Hon, I was not. :( So that took away from some of the experience for all of us. \n\nFood: I enjoyed majority of the sushi pieces from the Omakase selection but a good 1/3 of them did not \"wow\" me. A few pieces were meh. And only 1 of them impressed all of us (Hokkaido scallop + foie gras was the winner). \n\nService was really good and attentive. All the staff were really nice and did a swell job attending to us throughout our entire dinner. Dinner costed $160 pp including tip for the omakase + supplement + a bottle of wine...all in all, Sushi Hon was decent but not a restaurant I would care to visit again.", "author": "Sunia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Affordable price! \nAnd everything there was just so good! \nI love quiet vibe  \nEvery single courses were just delicious \nNice and kindly servers\nThanks for being good part of my omakase experience !", "author": "Noah P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Fantastic experience for our second anniversary a couple of weeks ago. We tried omakase for the first time! Came on a Tuesday, so it wasn't too busy. We were each welcomed with a complimentary glass of bubbly while we waited for our seats to be ready. \n\nThe staff helpfully explained all the little things we were wondering but hadn't gotten a chance to ask-- such as whether to use the chopsticks or our fingers (like we saw others do) for the sushi, what the towels were for, and how the sake pairing worked (three full glasses, not one small one per course). \n\nIt seemed like they either hadn't updated the December 2017 menu or were out of some of the items-- we still received the same number of courses but several dishes were different. \n\nThe only thing that gave me pause about choosing omakase at this restaurant in the future was the extremely dusty glass shelf directly overhead this area, with what appeared to be some bug carcasses. For how pristine everything else looked, I wondered if this was one of the reasons their health score isn't perfect.", "author": "Krista L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-22", "description": "First off, they were super accommodating even though we had a large party and we kept changing the number of people and the time. \n\nHowever, the sushi was just ok.... We did the omasake and while the fish was fresh, it didn't amaze me. I love salmon, but even the salmon didn't amaze me as much as I thought it would. The salad was super small, but refreshing. I'd say one of my favorite dishes was the Hokkaido scallop with foie gras. Now this one really blew me away!! The flavors paired SO well with each other. We were all pretty disappointed with the A5 wagyu roll because it tasted like just a regular fried beef egg roll...Also, the last plate of sushi they brought out was super disappointing. There were 2 types of mackerel and another fish, but literally none of us liked the last plate. The panna cotta dessert was bomb though and it was a perfect ending. \n\nService was great because they kept coming back to make sure our waters were full. We ended up paying about $135 per person because we ordered sake and Sapporo, but we all agreed that the meal wasn't worth it overall oops.", "author": "Selina H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "A perfect spot for omakase in SF.  After doing a lot of digging into the most worth it omakase restaurants for my budget, I decided on Sushi Hon, and couldn't have asked for a better experience.\n\nFirstly, the food was incredible.  Being my third omakase experience, I had an idea of what to expect, but was blown away by the creativity and elegance of the tasting menu.  My boyfriend and I both decided to do the regular tasting menu (11 pieces plus three small plates and a dessert for $79) and added on the supplemental menu, which was four more pieces for $39 a person.  I enjoyed the variety of fish and presentations they had; one of our pieces was barracuda, which I'd never seen at another sushi restaurant before.  Each of the pieces were unique, flavorful, and a delight when the sushi chef presented it to us.  While the tasting menu had some delicious pieces, I recommend adding the additional four pieces, which included uni, scallop, and wagyu beef, some of the more premier pieces.  \n\nAs amazing as the food was, I was blown away by the service.  The staff was incredibly attentive throughout the meal, and would promptly bring each course without feeling like they were breathing down our necks the entire time.  I mentioned that it was my boyfriend's birthday, and they surprised him (and me) with a slice of green tea cheesecake at the end of the meal, which I didn't even need to ask them to do.  Overall very friendly and warm vibe from the staff in addition to the intimate setting of the restaurant.\n\nOverall, we had an amazing experience.  Although many places say that Sushi Hon is one of the more affordable omakase restaurants in SF, with the supplement, drinks, and tax and tip, the final bill was around $160 a person.  It's definitely a lot, but the experience was definitely worth it for special occasions!", "author": "Kelsey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "TL;DR\n- Phenomenal sushi; highly recommend the scallop with foie gras (from Omakase main menu) as well as the uni nigiri and the wagyu beef nigiri (both from the Omakase supplement menu)\n- Pricey ($200/Person for the Omakase courses, Omakase supplement, 2 items from A La Carte menu, and drinks)\n- Good service (20% tip automatically included in bill) \n\nI came here on a Sunday night with my boyfriend and a good friend. We made a reservation ahead of time because it was a special occasion and we wanted to make sure we'd have a table. However, turned out that we didn't really need a reservation because the tables were relatively available. The place was low key with a relaxed and elegant ambiance.\n\nOnce we were seated, they asked us which menu we wanted - either the Omakase or the A La Carte. The Omakase is a set menu with courses selected by the chef, and the A La Carte is a regular menu from which guests can choose dishes for themselves. However, note that the two menus are not mutually exclusive - we ended up having the Omakase set courses and ordering a couple items from the A La Carte menu. \n\nThe Omakase ($78/person) included 11 courses. My favorite from the Omakase was the scallop with foie gras. The supplement (an extra $36/person) was an additional course with 5 pieces of sushi. My favorites from the Omakase supplement were the uni nigiri and the wagyu beef nigiri. When each course was served, our server explained to us what it was, how it was made, etc. The quality of the food was definitely top notch - phenomenal taste and distinctly fresh. I'd say it's one of the very best sushi I've ever had, and I LOVE sushi :)", "author": "Queris A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-05", "description": "My party came here for my roommate's birthday and we left with an empty wallet. I give this place three stars because it was an average experience, there were some goods and bads, but nothing spectacular. \n\nLet's talk about location and ambience - location is in the middle of the neighborhoods and a bit sketchy, we drove here and was able to find parking almost immediately, but I wouldn't want to walk too far to this place in fancy clothes. Ambience was very nice, the decor and style of the restaurant is very stylish and sleek. Three of us ordered the omakase and one person ordered 6 piece nigiri + sashimi platter. We all shared a nice bottle of sake that was $100 - it was really clean and light, can't remember the name, but it was in a blue bottle with white label.\n\nPros:\nSashimi platter for $40 was the best deal in the house - we ordered another platter after seeing the great selection and large portion\nSalmon nigiri from New Zealand: probably the best thing from our meal, it was so buttery and light\nToro sashimi - always amazing, this was another highlight of our meal\nUni - I'm usually indifferent about uni, but this one had a ton of flavor and very silky\nAnago - this was an interesting piece, it was all white and lightly seared and puffed up, first time i've had anago prepared this way - but it was also pricey at $9/piece\nMatcha cheesecake - so decadent, so moist and smooth\n\nCons:\nAnkimo appetizer was just meh.\nOmakase - they switched out a few items from the original menu so I was a little annoyed at that. Instead of waygu beef they gave us duck breast and instead of the house cheesecake they gave us panna cotta. Other than the switch outs - the first two platters were not very buttery fishes, we were pretty surprised to keep getting chewier fishes like amberjack (i forget the name of the rest). \nWe didn't get any toro and only one type of salmon. In hindsight, we would've gotten a sashimi platter each and few select nigiri instead. Our total bill was $640 for the four of us - minus birthday boy.", "author": "Anh Thu P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "Great sushi at a decent price!  Came here on a Wednesday date night with a reservation at the sushi counter.  \n\nVenue / Service: the restaurant was a little dark inside with the exception of the bar area and the sushi counter, which were very bright.  More of a modern vibe inside the restaurant with metal and stone accents (vs. traditional Japanese wood accents).  Luckily, it wasn't too busy when we came so service was pretty quick, especially since we sat at the sushi counter.  They move quickly but keep watch on pacing to make sure dishes don't come out too quickly.\n\nFood: being at the sushi. counter, we went with the omakaze ($78 per person), which consisted of a November salad, 4 pieces of sushi chosen by the chef, tempura in a dashi broth, zensai (hokkaido scallop, foie gras, hachiya persimmon, rose wine gel), 3 more pieces of sushi, owan spicy shiro miso (duck, which beach mushroom, scallion), and dessert (house made cheese cake w/ raspberries, pinapple mint).  There is also a supplement ($39 extra) of 5 sushi of the chef's choice or you can order pieces a la carte after.\nMy favorite nigiri pieces were the Kurodai (black sea bream; lighter fish with an interesting texture), Kamasu (barracuda; firm fish with a strong meaty flavor), and Saba (wild Japanese mackeral).  Of the prepared dishes, our favorites were the zensai and the dessert.  The Zensai had one of the most interesting surf-turf combos I've ever seen (scallop and foie gras), which worked with the persimmon so that the dish wasn't heavy overall.  We both were surprised with how light and fluffy the cheesecake was- reminded you more of something between a panna cota and a mousse.  The miso was also a highlight- it had an amazing earthy aroma and rich flavor for a miso (plus soup on a cold day always makes you feel better)!\n\nConsidering the quality of the fish and the number of dishes provided, I'd say this is a decent bang-for-your-buck place sushi-wise if you don't want to spend all of the $$$$ on sushi.  Won't be as fancy as your ju-ni / other Michelin restaurants, but you won't be super unsatisfied with Sushi Hon.", "author": "Audrey H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "10/10. The best omakase I have had and strongly recommended.\n\nI have had multiple high end omakase experiences in Hong Kong and this is definitely the one that I love the most and also super amazing value as compared to those in Hong Kong or other omakase restaurants in general.\n\nI was visiting San Francisco and was waiting for my friends to arrive from LA. I crave sushi so much so decided to give it a go myself. Was thinking of going to omakase however it's fully booked. And I was lucky enough to have visited Sushi Hon.\n\nSushi chef and also the servers are super friendly and they explain the details of every piece and courses that are being served. As the standard set is too good and not enough to satisfy my appetite I went with the supplement which was defo the right decision.\n\nThe sushi and the uni r so fresh, and the salmon roe r frankly the best I have had - understood from the chef that they marinated the fish roe with soy sauce which leaves them solid in form, and the salmon roe juice has a stronger taste than normal which lingers in your mouth for a bit of time.\n\nThe non sushi dish r amazing as well - I love the foie gras with scallop, and also the Dick breast role is super creative as well.\n\nI would definitely come again next time when I visit SF and recommend my friends to come too.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "For a $79 per person omakase, it was really good. This regular omakase comes with: starter-4 nigiri- tempura- 4nigiri- zensai- 3 nigiri-dashi-dessert in this order in the span of ~1.5hrs (total of 11 nigiri of chef choice; premium is 14nigiri $109pp). Amount is good, you do get full at the end, especially if you get a drink. Sushi rice is delicious and just about the right size. Chef recommends eating with our fingers instead of chapstick, no need to dip in soy sauce either, it was fun experience. Because I am a big fan of fatty parts, we ordered ottoro ($9.5) and chef gave us chutoro on the house, which was a plus. I recommend reserving seats at the counter near the chef. It's just fun watching how each nigiri is made so delicately and chef's explanation while serving. Service is generally excellent- they serve sake in a small wine glass. Good collection of beers, wines, and sake to go well with sushi. Cozy, modern, chill vibes in the restaurant. Since chef's choice changes every season and with ingredients at the time, I would definitely want to go back some other time and try more variety. (Note: this restaurant is reservation only*)", "author": "Adel A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "went here on saturday. easy to find parking here. It's not on the main mission area so it's not that crowded. service is really good. They are very fast and efficient. The food is ok. The fish tastes good but the rice is a little bit too much for nigiri. We ordered fried oyster, chicken karaage and scallop with fresh fish as appetizer. \nFried oyster is good. don't really like the chicken karaage and scallop with fresh fish. the karaage is not authentic at all. It came with cheese on top which is kind of weird. also, it doesn't have a lot of meat. It comes in small pieces...\n\nUni, scallop , a5 beef and otoro nigiri are ok.", "author": "Tina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "I was craving sushi and couldn't find any place that opened for lunch, then I remembered Sushi Hon just introduced their lunch menu. Made a reservation at the bar but then I realized one wasn't necessary as the restaurant was almost empty. To be fair, it was a Monday. I came here not expecting much but I was blown away. The quality of fish was amazing, service was friendly, and the chef was very knowledgeable. Among all the nigiris I got, my favorite were the A5 wagyu with truffle salt, amaebi, chutoro, and hokkaido uni - one of the best uni I've had in the city! Definitely worth the price tag. This place deserves much more attention than it is receiving.", "author": "Whan T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "One of the beselat sushi bars I have tried in SF. The service is impeccable. The omakase is delicious and relatively cheap. Definitely make a reservation beforehand.", "author": "Sara-Fleur S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "High expectation but disappointed. Great hospitality but the environment was noisy. Omakase sushi selection was fresh but not amazing. Didn't notify us for course change on the menu until the dish was delivered.", "author": "Weiyu H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-16", "description": "I had a reservation for four at a table and we all the omakase. I was disappointed at the quality of the different dishes of the omakase. Each dish looked like it was dried out like it had been prepped prior and left out for a few hours. \n\nMy salad was wilted and dried out. The sushi definitely seemed dried out on the tops. And by the dessert, I just didn't care enough to really bother eating it.\n\nPeople seemed to have a better time at the bar so maybe that's where you should get the omakase. \n\nThe beers and sake were high quality. I kind of wish that they had small bottles of sake as they either only had a glass or a large wine bottle's worth of sake. I find that small bottles are better for sharing between two people. \n\nQuality of the fish seemed good, even though dried out, and on par with an $80 omakase. But we didn't get the supplements because were so disappointed with the quality of the dishes.", "author": "Nathan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "This review is long overdue. Sushi Hon offers the best value for delicious omakase in the city. The place is still somewhat a hidden gem so we've been lucky enough to get sushi bar seating each time. Every chef that we've had serve us omakase had their own distinct personalities, but all were personable and attentive to our needs. The service staff is exceptionally friendly, and have even given us premium bottles at lower price when the bottle we wanted wasn't available. Overall, I'd highly recommend this place!", "author": "Le D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "A relaxed, unpretentious omakase joint that competes with sushi bars 1.5x its price. \n\nSushi Hon is now tied with Kiss Seafood as my favorite average date night omakase in town. I leave this place 100% satisfied with every cent that I paid. It may lack obvious gimmicks, and it won't be fawned over by status-obsessed name droppers on Eater, but every piece of fish was A+, and the light but creative treatment -- especially the yuzu zest on their internationally sourced white fish -- made me feel like I was in assured, authentic professional hands. Honestly I feel like places like Akiko's Sushi and Pabu *wished* they were so unassumingly good.\n\nOther pluses: I could score same-day reservations with extreme ease, and the service was prompt, warm, and attentive. The dishes came out at an efficient but unhurried speed. The non-sushi dishes (duck miso soup, butter squash tempura, foie gras bite, cheesecake mousse) were also exceedingly good.\n\nBe forewarned that the omakase in August was extremely fish-centric, with only scallop as a non-fish crudo dish. So for shellfish / roe lovers, you may want to order a la carte for your fix.\n\nI see myself coming back on relaxed weekdays when I just want to spoil myself and don't want to compete with people for a seat.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Literally the best omasake I had ever taste. The sushi literally melts in your mouth and it was so flavorful. Literally Unami explosion in your mouth. LITERALLY. The waiters were so cute that they brought us green tea cheesecake to celebrate our friend-aversay! Would highly recommend to check this affordable omasake out!", "author": "Julie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "I specifically chose Sushi Hon as my first Yelp review. Not only was the staff extremely accommodating, but the omakase was incredible! When deciding on our bottle of sake, the waiter allowed us to try several different bottles before we chose one. Once we got seated for omakase, we met the chef who took the precaution to ask us about our allergies, preferences, and non-preferences. Since I'm allergic to raw shrimp, I find it really nice that the restaurant is so attentive. Every dish presented was meticulously flavored and plated. The chef and waiter provided excellent service! They were even down enough to drink some sake with us! At the end of the meal, they even brought out matcha cheesecake for my big sis' birthday (on top of the panna cotta dessert.) I highly recommend Sushi Hon for all your omakase needs. It's great sushi, great service, and great value.\n\nTip: If you plan on getting a bottle of sake, you should share with your chef and waiter. It's polite and shows your appreciation for their hospitality.", "author": "Chanel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Great omakase! If you love sushi this is definitely a place to indulge. My wife and I decided to try Sushi Hon and were pleasantly surprised. It was about $81 per person for the omakase menu and another $40-60 for the sake pairing, but if enjoy sushi it's well worth it.", "author": "Billy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "As a sushi snob, I am very picky with my Omakases. So for me to tell you that Sushi Hon is good, that means a lot a lot. Under $80 Omakase in the city? What more can you ask for. I had my birthday dinner here because 3 of my best friends really liked this place, so I trusted their judgement and agreed to try their Omakase.\n\nI am usually very good at taking photos of the whole experience, but once they started serving the first course, I just went for it. I even lost count how many total courses were served. The food just keeps coming and I was just enjoying every single bite of it. My favorites: Uni, Horse mackerel and wagyu. \n\nAmbiance is cozy. Service, definitely fast and excellent. I would definitely go back. Thank you for the wonderful experience Chef Min and Jeffrey!", "author": "Gwen M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "This was my first omakase experience so I didn't know what to expect. I did however watch tons of videos and had some idea. It was a good experience but the menu to me was very limited, items seemed too similar, felt like eating the same thing over and over again. I wasn't a huge fan of the duck and also didn't like the dessert that much. But the nigiri was AMAZING! Unfortunately I didn't feel full in the end and I was expecting more of a variety. \n\nWe got the sake pairing too, and when the waitress left the bottle on the table I helped myself for another glass, and apparently it was a HUGE mistake. The waitress panicked and grabbed the bottle from my hands as if I stole it or something, and said \"this was only for picture\" and that I wasn't supposed to get another glass of sake. Well if you leave the bottle on my table I will assume it's left for me to drink it how am I supposed to know that it's only for pictures? To me the way they reacted was super weird, rude and unprofessional, but anyways, lesson learned, won't be touching the bottle!\n\nI still do recommend trying this place, cause it's affordable compared to other omakase places, the nigiri melted in mouth and it's a good start. This will be my to go place until I discover an alternative for the same price.", "author": "Selen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "We are sushi lovers and wanted to explore sushi spots in the SF Bay Area.  We had reservations and sat at the bar.  We weren't sure what to expect, as we noticed the chef was Chinese from China.  We ordered their premier Omakase because we enjoy trying fresh pieces of fish we haven't had before.  This place far exceeded our expectations, the fish was fresh and cut well.  The rice was perfect in ratio and held up to the fish.  We also got to try a few unique pieces of fish that were new to our repertoire, great experience.  We would be happy to dine there again.", "author": "Jolie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "I was brought here with friends who love the place, which is the best way to experience a new restaurant.\n\n!!!\n\nThis place is awesome. \n\nWe did the Omakase menu at the sushi bar, which was great. My personal favorites were the the barracuda, tuna, and salmon and (surprisingly to me) both Mackerel pieces. Everything was extremely flavorful, and each dish complemented the next.\n\nSushi Hon does not disappoint. Can't wait to hit this place up again this weekend!", "author": "Rebecca M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-04", "description": "This was one of the best dining experiences I've had in SF.  I took my fiancee here for her birthday and from start to finish this place absolutely delivered.\n\nWe booked a reservation at the sushi counter for an omakase experience.  If you sit at the counter you can only order omakase so if you want a la carte sushi then you should get a table.\n\nFor omakase they have two options and we went with the $79/person experience along with the sushi supplement for ~$36/person.\n\nFor drinks I got the sake pairing for $40 while my fiancee ordered glasses wine from the menu.\n\nThe food itself is perfection.  Each piece is hand made in front of you with a really nice pacing.  Any sauces, wasabi or other add-ons are placed with purpose so there's no need for you to do anything but eat.\n\nThe sake pairing is also amazing.  You end up getting 4-5 glasses of sake which definitely can get you drunk, so be careful.  The person in charge of the pairing is super knowledgeable and by the end he was giving me an extra tasting because of my interest and excitement for the pairing.  Make friends with him/her and they will take care of you!\n\nFinally, the service is impeccable.  Sit back, relax and they will take care of everything for you.  They called me the day of the reservation to confirm it but also to ask for my fiancee's name since it was her birthday.  I thought it was odd initially but it turned out that when dessert came out they brought her a small slice of matcha cheesecake with a candle and sang her \"Happy Birthday\" with her name in it!  It's a small detail but shows the level of attention you get.\n\nI can't recommend this place enough.  We are still talking about it to this day and will definitely be back!", "author": "Janos M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-21", "description": "This is now my fave sushi place in SF.  It's very reasonably priced and good portions for the omakase. Delicious, fresh, and strongly recommended;", "author": "Wendi Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-13", "description": "Loved the restaurant/decor.. the sushi itself was okay (although for the price, it was pretty good).. Very reasonably priced omakase.", "author": "Kim I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "This place is absolutely fantastic. I can finally say that I've found my favorite sushi restaurant in San Francisco. The quality is well worth the price. I've ordered both their omakase and a combination of their small dishes, and I've never been disappointed. You can make a reservation online and it usually doesn't get extremely crowded (at least, not yet), so I can usually make a day-of or day-before reservation. Best of all, everyone who works at Sushi Hon is friendly, kind, and generally wonderful. It's a great dining experience every time I come!\n\nTip #1: The omakase is delicious. It comes with a combination of about 11 nigiri and 4 small dishes. The nigiri pieces seems to be a little wasabi-heavy, so if you aren't a fan of wasabi let them know in advance. The omakase is ~$80, and you can add a nigiri supplement for $37 or a sake pairing (I don't remember the exact price). \n\nTip #2: You can usually find street parking in the area, but you might have to go out a few blocks. There are also a smattering of bars within a few blocks, so if you do happen to drop by without a reservation and there's a wait, you can grab some drinks while you wait (I recommend Asiento). \n\nOverall, I can't say enough good things about Sushi Hon! I got here way more than is healthy for my wallet. I would definitely recommend this place to anyone looking for quality sushi, great service, and a decent price.", "author": "Sarah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "Seems to still be a well kept secret but the food is amazing. I highly recommend sitting at the bar and enjoy each wonderfully crafted piece of fish. The menu is fixed but they are pretty flexible if you have preferences or types of fish you don't enjoy. I cannot recommend them highly enough, they have become a staple in my rotation.", "author": "Scott G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "I honestly don't even know where to start. I been to Sushi Hon twice and both times were amazing!!!! Chef Min took great care of us both times and I had the most wonderful time eating as well as drinking different Junmai Daiginjos with him. He told me he picked out the sake list and it included his faves. I was not disappointed. \n\nWhat I love about Sushi Hon is that even though its moderately priced... the food you get exceeds my expectations. I especially love the appetizers/side courses from kitchen chef Jang... she is super talented and my personal favorite is the foie gras with scallop dish. The flavors and seasonal ingredients she uses work so perfectly well together. \n\nChef Min went above and beyond with his superb knife skills and presentation. I told him that my favorite fish is saba but he did not have fresh saba that day so he declined to even serve it to me. Instead he served me another piece of fish on the house!!! To TOP IT OFF... the second time I went, he remembers that I love saba and he saved the best piece for me! I do not call that customer service...but instead customer connection. I can not appreciate Sushi Hon's staff enough. From the front of the house to the back.... Sushi Hon exceeds all of my expectations. \n\nI will be back a third time... but hopefully this time... I dont end up leaving too drunk! LOL.", "author": "Hubert H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "I would give this place 6/5 stars if I could because it was just THAT good! The moment we stepped foot into the restaurant, they were so inviting, friendly & so attentive. They seated us in the dining area & I was quite skeptical at first because we were sitting at a large table shared with two other parties next to us & I was worried that my boyfriend and I wouldn't be comfortable & we would much rather sit at the bar, but it was totally fine. The staff was so friendly and attentive. We went with the omakase for my boyfriend's birthday & it was soooo good and worth it. We also had some of their alcoholic drinks, & those were amazing. My boyfriend tried various sake drinks, while I had the dessert plum wine & I HIGHLY recommend getting that drink for those who love sweet things. It was soooo good that I had 3 full glasses of it! They were so knowledgeable and I appreciated that they explained each dish and piece of sushi. As we were nearing the end of the omakase, they brought out the desserts as well as a complimentary slice of cake for my boyfriend since it was his birthday. Overall it was the most amazing dining experience we've ever had!", "author": "Carelaine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "This place was fantastic. We have been to multiple high-end omakase restaurants(e.g. Omakase, Kusakabe, Ju-ni, Harshiri...etc) and wanted to try the new place. Sushi Hon is a great Omakase restaurant for a reasonable price! We enjoyed the Omakase - an amazing assortment of exquisitely prepared small dishes and fresh fish. The service and atmosphere were excellent. Thank you Kent, Chef Li and the manager for such a lovely evening !", "author": "Katie E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "The sushi is sooooo good! Now their omakase offers a wide comprehensive tasting spectrum that the restaurant serve, besides good and fresh sashimi slices(one particular nigiri was soooo creamy, I die), we were served food such as scallop topped with foie gras though I did think that the foie gras was a little overcooked(rubbery texture compared to melting one), cute tamago that had tasted like creme brûlée, great delicious pomegranate-raspberries jam paired with romaine lettuce(?) and their special dressing, ending the omakase with a spicy duck miso soup! I love my duck and this was so pretty good! The place does the omakase accordingly to our own taste bud, eg if we want our nigiri to be better seasoned with soy sauce or rice quantity of it. I think the omakase menu is yummy and will defo recommend it but I doubt I'll do a solid 3rd round of it! \n\nThe dessert was BOMB, it was their homemade cheesecake with strawberry purée something. The cheesecake tasted like as though it was hand-whipped to softness then had that added sweetness of honey(perhaps?) with tangy strawberry purée. \n\nI would want to come back and try their ala carte menu! A really nice place for a date night with friends or SO!", "author": "Caroline H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-11", "description": "It's sad that not many people seem to come to the place because it's absolutely great sushi! Everything is delicately prepared and the staff is very friendly. \nWe ordered fried squid and a salad for appetizers. I'm a fan of the squid. They are small, crunchy, and go well with the onion sauce.\nWe ordered the duck and the smaller sushi set (7 pieces) for entrees. Both are delightful. Duck was crispy on the outside and went well with the blueberry jam. Yellow rice and small mushrooms were served on the side. \nSushi: 7 pcs all different, they walk you through which kind of fish is on which piece. Note that soy sauce and wasabi are already applied to the sushis. If you can't eat wasabi, let them know early!", "author": "Alex L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "A great place that serves a mix of omakase and izakaya! \n\nCame in with my boyfriend and we ordered an omakase and some a la carte dishes. The omakase fish were all very fresh, and it came with some small dishes, soup, and dessert too (strawberry cheesecake, Japanese style, sooo good!)\n\nDishes we enjoyed most\n- Squid filled with squid ink rice\n- strawberry cheesecake (diff from the American cheesecake, this is lighter and softer)\n- king salmon nigiri\n- duck soup (part of omakase)\n- sautéed Shishito peppers\n\nThe seafood fettuccine was a bit bland and didn't stand out. \n\nService was awesome! The staff was super friendly and attentive!", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-22", "description": "This is all I can give --- three stars (honestly only two)\nService was ok, but I feel disappointed that I celebrated my birthday with my frds here and did not receive any special from the chef. (I mentioned it on my reservation notes, and the waitress knew when we were there) \n-Atmosphere was super loud! I can't imagine that I can't even hear what my frd talked abt..... Restaurant space isn't big, but then I don't except that loud during the dinner time. I would rating the noisy level when I was in the clubbing with no kidding. \n-Omakase was just ok. One of the fish was totally make me sick that want to throw it out cause it was too fishy? However, I can't even finish the whole piece.... I don't expect a high price Omakase be like that all at or maybe only me do not enjoy this type?. Anyway, I don't feel satisfy and enjoyable when I was eating them comparing to the other Omakase restaurant in SF.\n\nHonestly, I won't come back because there are another good price, and tasty Omakase in the corner, so then I won't stick on here.", "author": "Rainy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Sushi Hon was good but it wasn't amazing. I had the regular Omakase and didn't opt for the more expensive seasonal one though I feel like I doubt it would have made that much of a difference. The fish was good but there was nothing amazing that was added on top of the fish to enhance the flavor. Because of that I think I would have been more satisfied choosing my own pieces then what the chef had chosen as a set. The only item that was the best was the foie gras on top of the scallop but I'm not sure if I really want to go to a high end sushi place just to eat foie gras. I'm giving this place 4 stars because the fish is good quality, the servers seemed attentive, and I enjoyed the sake.\n\nIf you end up going here maybe go for the more expensive one and it might make a difference, else just order which nigiri you enjoy and just treat it like you're paying for good quality fish. I probably will move on to another Omakase restaurant where I hope the chef will really wow me.", "author": "Wesley C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "Not what I had expected at all. Maybe my expectation was too high?\n\nI've been to quite a bit of omakase styled restaurants. I think they are reading too much into the yelp reviews to the point where they go to the extreme. One review had mentioned that there was not enough \"sauce\" for flavoring. Guess what? EVERY SINGLE piece I had was drizzled with, what I assume, unagi sauce. Honestly? Every single piece? Another yelper had stated, \"too much wasbi,\" so at one point in the night, our chef asked, \"Too much wasbi?\" Do what you think is best for that piece? You're the chef.\n\nMy favorite dish from last night was their Japanese eggplant with mushroom and truffle sauce. That was unique! The flavoring was there. \n\nAlso, the fire squid dish was amazing! The blend of the seaweed, asparagus and the fire squid was tasty. Not sure if I liked the daisy on top. \n\nOverall, I think it was over priced for an omakase. I might give this another try in the far future.\n\nFood: 3/5\nService: 4/5\nAmbiance: 3/5\nPrice: 3/5", "author": "Tiana C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Recommended by my friend as one of the best sushi place in SF. Worth the comments. Impressive service and wonderful food. We have one original omakase menu and one supplemental one with five additional pieces. The chef is really nice.", "author": "Jiahui J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "I was pretty impressed with their service and food. Quality food and great value. I walked away with a full stomach which you usually don't at other restaurants that do omakese. \n\nI'm curious if other people are able to even try the supplement after finishing omakase. Must be big eaters!\n\nThanks for the great experience and delicious food. Looking forward to visiting again.", "author": "Lyman C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-24", "description": "Good sushi is expensive, and San Francisco definitely has a growing list of great omakase restaurants. I was disappointed to learn Sushi Hon had raised its prices since the last time I went, but would still recommend this place to any sushi lover looking for an underrated restaurant for a reasonably priced experience.\n\n[Omakase]\nI had the Omakase here. For the price at around ~70, I felt that the amount of nigiri I received in the meal was worth the price. Most Omakase's in SF will set you back around 100 dollars and leave you wanting to order more, but Sushi Hon gives you the right amount. I do feel that the chef could go lighter on the wasabi as that sometimes did overpower the taste of the fish. The fish was great quality. However, if you order a-la-carte, the prices can get pretty expensive. \n\n[Service]\nOur server explained each piece of nigiri and the flow of the course extremely well! Super friendly guys. \n\n[Decor]\nThe restaurant is still not that well known, but I liked that they played the Jiro Dreams of Sushi documentary when I was there. Otherwise, the restaurant was pretty open and dimly lit. \n\nIf you're in the Mission and are looking for a decent omakase experience, i would recommend checking out Sushi Hon! It is still relatively undiscovered and you can get a reservation day of.", "author": "Alice Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "I think sushi hon is a hidden little gem of an omakase place in the city. I kind of didn't want to write this review so I wouldn't add to the fuel for its growing popularity, I like being able to make last minute reservations! Ha! \n\nThe quality of ingredients is high, the flavors are really really on point, and there's creativity in the dishes. I tend to always order extra of my favorite pieces from the omakase set after it's done. \n\nThe staff is friendly and attentive. The ambiance is chill and chic. \n\nThey're always playing Jiro Dreams of Sushi on the TV and I think that's cute.", "author": "Anna P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "The omakase menu was delicious! Great mix and flavors, good timing, nicely served. \n\nI could have eaten a little bit more, but that may just be because it was delicious. A couple of the sushi pieces were a bit too spicy for me, but that's mainly because my tolerance to spicy food is basically zero. All that considered, I still think it deserves five stars.", "author": "Marta F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "I stumbled upon this place since it was one of the few options by my house that was actually open on January 1st. I did the $80 omakase menu with the $40 sake/wine pairing. The first dish was a microscopic winter salad that was composed of some greens, a slice of Cara Cara orange, a slice of mango, and a touch of dressing. Even simply doubling or tripling the size of this salad would've set a better tone to the overall meal without affecting the costs of the restaurant.\n\nThe tempura A5 wagyu roll was perhaps the main reason I decided to try the tasting menu. It was a small portion however, and could've been offset with another vegetable roll. \n\nThere were 3 courses of nigiri with 11 pieces in total which were flavored by the chefs. These were all quite good. Lots of different fish from around the world, and the plating was beautiful. \n\nThe scallop with foie gras was a bit of a miss since everything tasted great on its own merits; however, there wasn't quite anything pulling all the flavors together. \n\nThe sake pairing featured: \nSolid sparkling Pinot Noir rose\nA good junmai sake\nA spectacular Black rice sake(perhaps my favorite part of the meal actually)\nAn amazing unfiltered sake\n\nThe dessert was a house made cheesecake which was somehow the size I wish a few of the previous dishes had been. \n\nI recognize my tone is not necessarily that of a good review, but I think my criticism towards continued refinement in balance you'd be able to execute a better experience at each stage without really adding more cost. I think you could tack on an extra $10 and make the meal slightly more substantial while adding nuance of flavor. You could also add a glass of plum wine to pair with dessert. \n\nI will probably try this place again in the future, so I hope they can tighten up the experience, which could turn them into a Michelin contender.", "author": "Zachary T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "I can be super naive and tend to believe everything I read. Like when Elite Daily suggested women to wear a strap-on for a week to feel liberated. The sadist in me was intrigued but my then boyfriend wasn't having it. \n\nPrude.\n\nI'm kidding - why pay $100 for a strap-on when I can feel liberated for free: slinging off my bra at the end of a long work day. BEST feeling ever.  \n\nA yelp friend gave me a heads up about Sushi Hon's opening but I was apprehensive about going (sister restaurant to Tamashisoul in The Marina: https://www.yelp.com/biz/tamashisoul-sushi-bar-san-francisco). Mediocre Japanese restaurants in the San Francisco Bay Area are a dime a dozen. However, Sushi Hon was featured in a Eater and Hoodline article. They advertised offering an affordable \"premium\" omakase since the owner owns the building and doesn't pay astronomical rent. In the article, they name dropped high-end sushi bars like jū-ni and Kusakabe which I hope they weren't trying to compare Sushi Hon to because it's not. \n\nMy friend and I visited over the weekend for their omakase at the sushi bar. Reservations are highly recommended (but they didn't seem to have mine on file). \n\nNo printed food menu (only drink menu). There's a blackboard menu in the dining area: http://bit.ly/2abXlQs so the ordering process was confusing since this wasn't communicated and you couldn't see the menu from the sushi bar. We opted for the Omakase for $65 which we were told includes miso soup, edamame, several small plates, and 7 pieces of nigiri. \n\nO M A K A S E (\"11 courses\")\n(1) Hamachi Ceviche: http://bit.ly/29V3C4l\nTwo slices of semi-fresh hamachi sashimi with orange segments. The dish was too sweet and desperately needed acid. \n\n(2) Rainbow Trout: http://bit.ly/2a0IEgy\nThis was oddly a shared dish for two but the tiny piece of trout was cooked well and tender.\n\n(3) Geso Karaage: http://bit.ly/2a63FeX\nAnother shared dish, the squid tentacles were chewy.\n\n(4) Black Cod & Japanese Sticky: http://bit.ly/2ae1HYe\nOne of the better dishes of the night, the black cod was light, flaky, and tender but again...not sure why this is served as a shared dish. \n\n(5-11) Nigiri - Bluefin Tuna, Aji, Hirame, Madai, Shima Aji, Saba, Chutoro: http://bit.ly/2ae2k4a\nNigiri is only good as the shari (sushi rice) and these ones were seriously lacking the proper seasoning. Like other omakase focused restaurants, they don't offer soy or wasabi as they sauce and garnish each piece. \n\nHowever, most of the nigiri weren't properly sauced and garnished. I'm not into saucy sushi but several of the pieces were completely flavorless and dry. The fish was also not the greatest quality. The chutoro, for example was oddly dry when it should melt in your mouth. The madai was the best of the bunch (rich and buttery) but the hirame had intact sinew that I had to spit out. Also, ordered anago a la carte which was fishy and chewy. \n\nThe staff were all very friendly and hospitable. Since it's a soft opening, kinks are expected with service and I'm usually very understanding about that. However, food service was unreasonably and frustratingly slow. It took 20 minutes to receive the first pre-course: miso soup. A couple arrived one hour AFTER us and they received their third course the same time as us. Expect large time gaps between courses. \n\nTo make matters worse, they only have 1 sushi chef for the entire restaurant that seats 49 (I counted 35 customers when we were at dinner). Usually sushi bars have 2-4 sushi chefs so that really puts an undue burden for their one lone sushi chef to deliver volume versus quality pieces. He was so overwhelmed so I felt badly for him. \n\nThe ambiance is contemporary and trendy. There's 12 seats at the sushi bar, three communal tables, and sake bar seating. No two or four top tables. \n\nBoth my friend were able to find street parking separately within minutes so it's not a huge issue if you dine early at 6 pmish. \n\nI appreciate what Sushi Hon is trying to offer: affordable \"premium\" omakase but the articles were misleading. Yes, it's a fraction of the cost but the quality is not \"premium\" and is similar to your run-of-the-mill sushi bars in The Sunset, SoMa, Noe Valley, Castro, etc. You're better off spending an extra $30 bucks to dine at the sushi bars they mentioned like jū-ni or Kusakabe where you get more nigiri, the quality is infinitely better, and you're getting a real omakase experience with refined service. \n\nIn the end, I felt like we were overpaying for mediocrity: $100 pp omakase, one drink, tax and tip. \n\n*Le sigh*", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Really amazing fish quality and service and very well priced for omakase. We came for my boyfriend's birthday, and ordered the omakase with the supplement. After the first nigiri, the chef checked with us to cater to our taste, and asked us frequently if we wanted any adjustments. The meal was great from start to finish, and I defintely want to come back again!", "author": "Cynthia M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "Great service. Modern vibe. Beautiful contemporary food, of which some are creative and delicious. \n\nOrdered omakase $79 (saw reviews and learned.it was $65 last year which would be a more reasonable price for the good). Portion is small. Fish taste not bad but not top class of this kind of sushi. Also the fish are all very similar kinds. Nothing special or fancy. Fish is too small on a sushi. Or let's say there's too much rice. The problem of this is that after all sushi, all we remember is the taste of the rice. Omakase doesn't include Toros. We ordered them separately. 9$ per piece, which is a regular price. And they are pretty good.\n\nWe were 75% full. Guess it's heathy that way:)", "author": "Oscar L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Been meaning to write a review here. I brought my 1 year old and the staff couldn't have been more accommodating and sweet. We had omakase and the food was great. And awesome value for omakase I might add!", "author": "Jean L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "VIBE: Cool ambiance, trendy\nWHY: The Omakase\n\nWe have been waiting to try this place since they opened, and finally walked in on a Friday night after work. Luckily it wasn't too busy and there were seats available at the sushi bar. However, we were told that in order to sit there, we had to order the Omakase.\n\nFor the price & how NICE everyone was, we decided to just do it, and boy did we make the right decision! It was delicious & beautifully coursed out. The flavors that they combined with some of the dishes were out of this world (scallops and foie gras?!) and the way the meal was served (sushi, cooked food, tempura, soup, etc) was really nice too.\n\nWe also went for the supplement courses, which were fantastic. Dessert was amazing too! We'll definitely be back soon to taste the rest of the menu, and are so happy to have this addition in our neighborhood :)", "author": "Eve D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "This is hands down the best Omakase restaurant I have ever been to (my fiancé and I are New Yorkers, so that says a lot)! Part of me wants to tell everyone I know about it, while the other wants to keep this spot our little secret - but they certainly deserve the praise on Yelp!\n\nWe came here a week ago for a celebratory date night, with zero expectations. As we live in the neighborhood, we have exhausted the local sushi spots (Blow Fish, Live Sushi) so we were excited to try something new. So glad we did.\n\nUpon arrival we were greeted by the sincerely friendly staff and welcoming ambiance. The restaurant itself is beautiful, perfect for a date or a dinner with friends. Since we were celebrating, we decided to try the tasting menu, and were lucky enough to get our own chef, Chef Kyle, who is the MAN!\n\nHe delicately crafted each roll, walking us through the magic that went into making them, describing what made each unique. My favorite by far was the barracuda (images attached)- but the whole thing was such an experience. We also did the addition and each tried the Wagu Beef rolls - amazing. Chef Kyle is a talented, fun and personable guy who made our experience even better. We even got to meet and chat with the Head Chef, commenting on the delicious menu and wonderful experience. They just launched brunch + lunch, we cannot wait to be back. \n\nThe staff here is seriously the cherry on top. They are all young, fun and make it a priority to ensure you leave happy and full. I am thrilled SuhiHon is a few blocks away, cannot wait to be back (maybe tonight?). Run here, don't walk.", "author": "Becky S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-23", "description": "Wow, really not good. The omakase menu adds up costing less if you order one by one, they give you the absolute cheapest things on the menu and the fish is ok. Did not include ameabi, uni, belly, it was basically a normal sushi dinner. Service is really annoying, they interrupt you all the time when you're trying to talk at dinner, not only that they kept messing up out orders. Def would not go back.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "I have been to many Sushi restaurants in SF, and this was one of the best!  We sat at the Sushi bar for Omakase, and it was well worth it.  Don't forget to get the supplement, it's great, and not too much food.\n\nAtmosphere: 5/5 Well decorated, spacious interior, well lit with a great sized sushi bar.\n\nCost: 5/5 Omakase was $79/person and $39 for the supplement.  The number of nigiri that you get for this price was very cost effective, and the other dishes (salad, soup, tempura) were small, but worth the cost.\n\nFood: 5/5 Be prepared for a tour of fish types from all over the world.  There was a citrus chili seasoning, otoro with white truffle salt, and A5 wagu.  A very nice mix of different fish, seasonings, and other accompaniments.\n\nScalability: 4/5 Sushi is meant to be enjoyed, so I can see how there might be a decent wait on a busy night.  If you make a reservation, you shouldn't have an issue.  Tables are either sushi bar or communal, I would recommend sitting at the sushi bar so that you get to interact with the chefs.\n\nOverall: 5/5 again, some of the best sushi I have had.  All of the fish, seasoning, drinks, accompaniments, and even the dessert were excellent.  I would be back here in a heartbeat (for special occasions since it is pricey, but worth the cost).", "author": "Paul P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-02", "description": "Mediocre sushi. Don't be fooled by the high yelp ranking. Gorgeous but tasteless food", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "I went there on a Friday night for a first date. Let's just say I got lucky that night.  \n\nWe were seated at the bar and tried the Omasake tasting menu with the sake pairing. Our waitress, Jessica, was upbeat, friendly, and interested in our lives.  Chef Lee made the meal feel like we were two fish in love in a big blue ocean. My date got annoyed that I asked so many questions!  What can I say, Chef Lee was enchanting. His smile launched a thousand ships, as they say.\n\nThe food was delicious, each piece of sushi felt like a tiny kiss on my tongue. Overall, the meal was an absolute delight, thanks sushi hon!", "author": "Squid R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "First time trying omakase and we loved every piece. Great experience at Sushi hon. Staff and chef were all great. Not much else to say or compare to other sushi joints, but as others said, it's a perfect gateway to omakase at a reasonable price.", "author": "Bobby a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Great food, and music! We were actually full after the omakase. That's means the portion is fair! Fresh fish and ingredients, I recommend!", "author": "Derek W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "I should preface this by saying I've been to Sushi Hon 4 other times and sat at the bar for omakase. I've always really liked it here and believed that the quality and technical ability of the chefs were great. \n\nLast night we got a table instead for 5 people and had the omakase there. We raved about this place to our friends who came for the first time. 3 of us got regular omakase and the other 2 got the supplement on top. \n\nIt was a relatively busy night and we were seated at around 8:30 and ordered by 8:45. We left the restaurant at 11:30 because that's how long it took for the food to come out. It was painfully, painfully slow. The fish was not as fresh (some pieces were bland and fishy), and the rice was falling all over the place. It wasn't the same as I was used to - good sushi always means rice cooked to perfection- not too soft, not too hard, and consistent amount of rice between each piece. Last night this was not the case and for a $150 meal I would have expected way more in both fish and rice quality. We also waited for a looooong in between servings; all of us were craning our necks looking at the kitchen. \n\nWhat bothered me as well was I felt 0 sense of urgency from the servers and chefs. We could see them cleaning up in the kitchen, wiping items down, all the while a bunch of the tables were waiting for food. Even after the 3 of us finished the regular omakase, we waited another 10 minutes to get the supplement. \n\nAt the end of the meal, the bill came with a 20% tip already included. This wasn't written on the menu anywhere, so we pointed this out to the server. She said that was their restaurant policy, but talked to her manager and they took it off. For a night with slow food and low quality items I was surprised they would do that. \n\nAll in all I felt embarrassed for raving about this place to my friends who left disliking the spot. I hope Sushi Hon can be better about managing the time and the quality.", "author": "A Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "So happy that a new omakase restaurant has opened! \n\nI believe the owner also manages another Japanese restaurant located in the Marina - Tamashi Soul. Knowing how good the food is at their sister restaurant, I just had to give this place a try!\n\nAfter reading some of the other reviews here, I just had to try their omakase ($75 per person). All I have to say is OMG! Each single fish was so fresh and melts in your mouth. There was so much flavor in each fish. Perfection in simplicity! We sat at the sushi bar and the chef was super nice and knowledgable. Also, before each fish comes out, you're given a wet napkin to wipe your fingers because you have to eat the nigiri with your fingers. Hehe. \n\nService is also top notch. Special mention to our server Jeffrey! He was super helpful when we had questions with the menu, and consistently came to check up on us to make sure we were doing okay. Thanks Jeffrey!\n\nI'll def. be coming back to try to their hot food soon! Squid ink rice with squid and uni... mmm.", "author": "Ava F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "One of the best sushi place I have tried in bay area.  The quality of the fish is excellent.  Kudos to Chef Jason!", "author": "W C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Hands down my favorite dining experience on my first trip to San Francisco. Omakase! Every bit of food was perfectly prepared, and the server did an excellent job describing each course. She was very attentive but not intrusive. This place was amazing- I highly recommend it & I will definitely make a point to go there again the next time I'm in SF.", "author": "L M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "It sounds like Sushi Hon was not up to standard for some of the omakase aficionados, but for me it was tasty as it should be. Also omakase is more bang for the buck whereas other places provide like 7 pieces. I think Sushi Hon's omakase were over 10 pieces.  There were lot of empty sits when I arrived but it worked out better for me with sleeping child in a stroller.\n\nParking was a bit hectic but great place for omakase in my opinion.  My wife told me chef was contestant in Master Chef Korea I think. Not sure but that's what I recall.  Sushi Hon is definitely worth a try.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-27", "description": "Super place. The most delicious and unforgettable sushi dinner of the year. Service is pleasant. I spilled salad on my dress, the boss boy brought a wet fabric napkin right away. My favorite dish was scallop fraguea", "author": "Diana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "Service here was attentive down to the tiniest detail. Settled for the omakase and they went out of the way to accommodate my dates dairy restriction. The omakase starts off light and supple before easing into the heavier options. Although the use of yuzu seemed to accompany each piece, it wasn't overpowering at all. Of all the other omakase spots, sushi hon stands out by incorporating the contemporary with the traditional. Oh and by the way, I highly recommend the supplemental.\nThat's all folks", "author": "Jeff L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Good expensive sushi in the Mission district. Will return again once I sell enough drugs on 20th and Capp Street.", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "We had ordered their Omasake, added the Supplement, and wasn't full, so we added their 10 pieces Sashimi Moriwase.\n\nDon't bother adding the Supplement because it will cost you an additional $2 more than ordering those 5 individual sushi ($9wagyu, $9uni, $9otoro, $6snow crab, and $4tomago = $37) by itself, UNLESSssss the snow crab costed more than the $6 somewhere NOT printed on their menu. \n\nIn my opinion, adding that $4 tomago to the high roller selection was disappointing and cheap!  If we're willing to pay the additional supplement, wow us with another expensive choice/cut, so I know it was a saving and worth adding; just saying....SMH \n\nI was disappointed with their hard sushi rice and two of their fish selections: Aji horse mackerel -  Thankfully, I had ordered a delish sake to cleanse that typical super fishy mackerel taste.  This fish was meant to be grilled, fried, and/or pan-fried please!\n\nThe second disappointing fish was, uhmm...I forgot the name, but it came out in the 3rd sushi selection with this tart thin strip on top.  The tart thin strip was an interesting flavor which we both enjoyed, but too bad it could not hide that funkiness of the fish, so again had to discreetly spit it out into a napkin. \n\nThey had this 'Duck Roll' on their printed menu, instead they served fried zucchini blossom stuffed with butternut squash puree with this broth poured into it; not bad.   They didn't 'volunteered' to tell you the menu had changed until I asked.\n\n10 pieces Sashimi - Fresh, but not worth the price when some regular cheap fish was added to the selection.  \n\n2 Stars - Great service especially the Japanese lady that had  'ASKED', 'OFFERED', and 'did NOT' charged the additional $2.50 fresh and much needed wasabi!!!\n\n1 Star - OMG, the SAKE bottle we had ordered! Soooooo good, easy to drink, clean, no after taste, and cleanse the palette fast, if you had bitten into a funky fish \n\nMUST TRY:  'Hatsumago Sake Kimoto Junmai'", "author": "Katy N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "This place is currently my favorite sushi spot in SF.  It has the right combination of excellent sushi, professional sushi chef (Lee) and affordable omakase at $80.  Chef Lee is an innovative chef delivering a very authentic Japanese approach to sushi.  The fresh fish and respect for the rice is well presented.  If you sit at the sushi bar, you can enjoy the preparation and story of each fish from chef Lee.  Incredible value given the amount of fresh fish you get.  I think you get about 12 pieces of nigiri and 3 hot courses plus salad and soup... and desert.  There is wagyu beef in there as well.  You won't be disappointed.", "author": "Frank M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Great legit sushi spot in the Mission. Green tea and service were great. We made our own omakase of sorts and it worked out great. Good quality stuff. Chicken kaarage and shishito peppers rocked.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-02", "description": "Over. Rated. How did this place get the same rating as Saru?! Disregard the egregious over-pricing of the nigiri/sashimi. One would be happy paying those numbers for quality service and legit sushi fish. That's just not what you get here. Service is slow (also excusable when the value is solid) and the cuts just aren't top notch -- as they should be when laying these prices. That's really all that matters when finding your sushi spot. \n\nPros:\n1. Miso was lovely \n2. Edemame has a nice little truffle touch. Not authentic, but nice, I suppose. \n3. The cooked entrees (ordered by the party next to us) seemed fine\n4. The space is pretty neat \n\nCons:\n1. Not the highest quality cuts (or even close)-- some of the fish was actually chewy\n2. Well over-priced\nJust two... but isn't #1 paramount?\n\nIt's worth waiting for your table at Saru. Trust me.", "author": "AK H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "What a fun night at Sushi Hon! The beautiful decor, lively ambiance, friendly staff, delicious food all at an extremely approachable price made for a wonderful experience. Chef Min's skills were top knotch at crafting nigiri garnished with a plethora of seasonings. His partner in crime was the talented chef named Sunny. Sunny was the head of the kitchen, preparing all of the non-sushi items on the menu with a range of Asian inspired French cuisine as per her culinary training. Both chefs were exceedingly friendly and interacting with them through the night made for lots of fun. Definitely an amazing meal; an insane value for the price!", "author": "Ye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "You just need to experience sushi hone. The best sushi ive had in life and i have some pretty good sushis! It's a must", "author": "Jenny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "This place is very modern and Americanized. The first course should change to a more traditional dish rather than an everyday salad. They have a lot of white fish which I love. They have sushi bar and tables. But all tables are large. You have to share with other people. Overall, the sushi and service are both very good.  But it's not something that's memorable. Two of us had the Omakase and Sake paring, spent a bit over $300. Not worth that much.", "author": "Momo W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "We were looking for a new omakase place to add to our rotation and tried Sushi Hon based on a recommendation from a friend.  We were cautiously optimistic as the friend who recommended has been to multiple high-end omakase restaurants (e.g. Kusakabe, Harshiri, etc.).  I say cautiously optimistic since there has been a boom of new sushi restaurants offering omakase and I'd say 75% are subpar.  \n\nWe made a reservation and promptly arrived 5 minutes prior.  Upon arriving we were told the previous group had not finished and would be a few minutes.  The meal got off to a ominous start when we were seated about 20 minutes later.  However, all was cured once the omakase started.  Each course was interesting and the fish was fresh and well made.  Additionally, we ordered 1 sake pairing to be split between my girlfriend and I.  Our waiter Jeff \"apologized\" for his poor counting skills and poured us 2 portions every course.  That was an amazing touch.  If I had anything to nitpick it'd be that I prefer the rice for nigiri to be slightly on the vinegary side to balance out the fish.  \n\nOverall, this is a great omakase option for a really reasonable cost.  Factoring in price ($78 for omakase + $36 supplement which gets you toro, uni, and a few more pieces), it's a pretty good value.", "author": "Alex M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Quality sushi with creative courses in between makes this omakase a good spot for higher end Japanese. Fortunately it comes at a rather reasonable price for omakase which is what makes this a decent value. The sushi isn't anything innovative though well executed. It's the other courses that show some creativity. \n\nService was a little uneven. They made some rather awkward jokes and did forget a good aversion in the party but was nice enough to add another nigiri after they realized their mistake.\n\nIt was on the quieter side of restaurants which isn't bad for Japanese but because it is so dimly lit it feels like it should be more bustling and trendy.\n\nOverall it's worth trying if you want quality omakase in the city but for a reasonable price for high end Japanese.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "$78 omakase is quite cheap in SF. 5 stars, fish quality was good & customer service was great. We also added the supplement for another $30 or so. Sadly, our supplement didn't include wagyu. Only negative here is the pot they provide for the hot tea. I ordered hot tea so they gave me a pot which doesn't have a lid. My tea got cold super fast, so I had to ask for a new pot every time. They had no problem changing it though and was very nice about it. Other than that, no complaints! Definitely will be coming back!", "author": "Cat F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "The quality of the fish here is on point. Super easy to get in without a wait relative to other restaurants nearby, which is surprising because this place is really really good. I always get the nigiri rather than the omakase because I prefer to order exactly what I want, but most people seem to do the omakase here. I also appreciate that they expect you to eat nigiri with your hands just as it's done in Japan. This place is definitely now in my regular restaurant rotation.", "author": "Julie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "such a great dining experience and easy to get a reservation for bar seats compared to other omakase restaurants. made a res about 4 days out, and called the day before to request bar seating which they easily accommodated. the day of, I got a call to confirm the reservation and they mentioned it being my anniversary dinner, so was happy to know they read my note about celebrating an anniversary with my bf. we got to the restaurant about 10 mins before our res but were seated right away. staff was great! we opted for the regular omakase with supplement and there was not one fish I didn't like. it's hard for me to choose a fave, but I will say I was most blown away by the foie gras and scallop cooked dish only because I haven't really had anything like it before. we were served by chef Lee who was so kind and always had a smile on his face. highly recommend and can't wait to go back! what's great too is that you don't have to do omakase at this restaurant so looking forward to trying the regular menu.", "author": "Ashley S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "I rarely write review but I am doing one today for this spot because it deserve it!\nI visited this place after reading article from SF Chronicle. Omakase for this low price? That's already a plus! The atmosphere and design of this place was very charming and fashionable. When I needed to impress my special girl, Sushi Hon did the magic and made my date night perfect.\n\nI ordered Omakase and guess what? It appeared the chef knew exactly what my preferred tasted was after few conversation in the beginning. It was not like I told him what kind of style I like or dislike. \nI have tried numerous sushi omakase restaurant not only in America but also in Korea and Japan. Comparing this place to all the omakase restaurant I visited, Sushi Hon is going to rank Top 3 but their price was lowest of them all. Quality of the fish and service is so awesome that you gotta see with your eyes and taste with mouth. \n\nIf you are used to cheap rolls and sashimi, this is place to come to cleanse out those waste taste and feel what REAL sushi is all about. Out of all the food I had, my most memorable dish were stuffed squid black ink risotto and aged blue fin tuna. Honestly, I wanted ask for more blue fin tuna because as soon as I putted it into my mouth, it melted away and against my will, I was making happy face.\n\nBottom line is : \n- Place is awesome for date night or to impress special others\n- Food quality is superior, even matching up to high-high-end sushi restaurant \n- Service was great. Not so invasive but always there to assist when needed\n- Superior food and outstanding service for fraction of price comparing with other high end sushi restaurant\n- All the hype and mention from media and gourmet food hunters were legit. Go read article from SF Chronicle", "author": "Kwang Hee Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "I tried my first time sushi in SF! Amazing place! Wow .. the omakase is no kidding ! Our sushi chef is really good ! Even he is Chinese ! I will come here again ..", "author": "Vivienne H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "We arrived on Sunday before Valentine's at 5:30pm and thought we had a reservation that ended up being cancelled in error by the system. The staff was super polite about what technically was my fault, and quickly accommodated us to seats at the chef's table, with a gentle reminder that I have 1 hour until the next round of reservations.\n\nThe prices seemed to have increased slightly: $79 (11-course standard omakase), $109 (14-choose exclusive omakase) and option of $39 for 5 supplements. We both opted for the standard, with me adding supplements (chu toro, snow crab leg, uni, A5 wagyu, tamago). Each course was paced well, and we appreciated a good mix of cooked food in between. The only thing I was taken aback about was there were 3 kind of mackerel nigiris which seemed like an overkill, but each of them tasted uniquely different from one another. I've had better sushi elsewhere, but I've also paid a lot more for what I was served here. We enjoyed the overall quality, the order the fish was served and the dimensions each paired garnish provided.\n\nContrary to some reviews, the service we received was impeccable. For a date night that we weren't looking to be super dressed up or be too mindful of table etiquette, Sushi Hon is relaxed but still special enough for an occasion. We'll definitely be back!", "author": "Allison K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-07", "description": "This is a new restaurant that opened fairly recently, so maybe they are still working out the kinks. I got all excited when I read articles online touting that this was of the same caliber as Kusakabe and Ju-ni, but at a much lower price point but to me, it was like comparing apples and oranges. I'd rather spend the extra $30-50 for a true omakase, Michelin-star experience at Kusakabe, instead of the $65 for the omakase here. Maybe your results will vary. You can do just a $65 tasting at the sushi bar of just nigiri or a slightly more expensive option (I think $73-75) for a mixture of hot food from the kitchen and some sashimi. \n\nI came here with my boyfriend to celebrate our an anniversary, and maybe it was gamble to come somewhere that had just opened, but we were both underwhelmed and it left me wishing I had picked somewhere tried & true.\n\nIf you want to make a reservation, you can do it on the phone or OpenTable. I was able to make one for Sunday evening just a few hours prior. When we showed up at 7:45 to eat at the sushi bar, we had to wait 20-25 min to be seated. At least they gave us some deep fried squid to make up for the delay, which was nice. When we finally got seated at the sushi bar, we basically had to wait another 10-15 to get our first course. At one point I was wondering if I was just going to sit there and watch the sushi chef make food, or if I was going to be able to eat. Maybe I was just a bit hangry or impatient.\n\nWhen the food finally started to come out, I wasn't particularly impressed with the fish. It was good but nothing mind-blowing and the proportion of wasabi was too much for the sushi. Several times we had wasabi brain freeze which was painful and overshadowed any taste of the fish. They may need to hire another sushi chef to make the nigiri faster - I don't need it one after the other but I felt like we spent a good portion of our dinner just waiting. I felt like a seal sitting there just waiting for another piece of fish to be placed in front of me.\n\nWe ended up getting an extra piece of Hokkaido uni which was not cheap ($10 per person), so when all was said and done, we each ended up paying around $100 per person. To be honest, I would have preferred to have a much nicer and better timed experience at Kusakabe or one of the fancier places. If you're looking for something nice but not as expensive, try Tsubasa sushi (Hayes) or Delage (Oakland). You'll get a much better bang for your buck.", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-16", "description": "Very good fish and friendly staff. Probably one of the better sushi places in SF. Only problem I had was the sushi chef at the sushi bar. He was not that friendly, very soft spoken and should have been more interested in the customers he served as opposed to his buddy behind the bar. He was also not very familiar with the menu and had no recommendations for us. I do have to say their salmon was one of the best I've had in SF.", "author": "Dana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-23", "description": "The duck with curried sushi rice is really good. The kitchen chef, who also singlehandedly does the other non-sushi items such as the foie gras, starter fruit salad and chasiu for the ramen is an unrecognized hero (heroine, actually) and deserves kudos.", "author": "H S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "I love this place!!!!! We did the omakase with wine pairing at the bar. I would recommend eating at the bar. It's a better experience and at a slower pace so you can listen to the chef explain what you're eating next. Only $80 for omakase ($40 for wine/sake pairing) which is a great deal and they always do something different. We also added on the wagyu and fatty tuna at the end. Yes to the fatty tuna but I'd pass on the wagyu next time. The customer service was also amazing.", "author": "Lucy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "We had a group of 8 here on Mother's Day (5/14/17).  I made the reservation a few weeks in advance because we wanted a better sushi experience without too much concern about cost.  I was contacted by the restaurant just once, on the day of the meal, to confirm whether we were coming (we were) and if we wanted the omakase option.\n\nWe arrived at 6pm and were greeted very warmly by several Sushi Hon employees.  I liked that they were expecting us, but they weren't overwhelming.  The restaurant has a typically minimalist, clean, calm appearance.  The person who waited on us was polite and explained the menu in detail.  We all opted for the omakase option.  There were a few small substitutions that they easily accommodated.\n\nThe fish here is spectacular.  No qualifications are needed.  I've eaten at many excellent sushi restaurants, including Yoshizumi in San Mateo, and Sushi Hon holds up to all of them.  The food here is a bargain, in my opinion.  I'd tell you how good the barracuda is, but unless you taste it, I don't have adequate words.\n\nA few of us splurged on the sake flights and supplemental dishes.  The sakes were terrific.  If you're here, don't skimp, I'd say.\n\nGreat food and service and a very memorable meal.  No, it's not cheap, but if you walk in the door, you only need to glance at the beautiful chalkboard to learn that.  We had 8 people who eat out all the time and we all loved it.", "author": "Bill C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Awesome! Sushi Hon is my new favorite sushi spot in SF. There is usually never a wait and the food quality is the best I've had. Highly recommend!", "author": "Brian H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "I came here last week during their soft opening phase and was pleasantly surprised by the quality as well as the price of the sushi. We were the only ones for a solid hour so we got a really personalized taste of the sushi, where the food was lovingly prepared and explained to us. The sushi chef hails from Gintei in San Mateo and he knows what he's doing with the fish. The sashimi is flown in from Tsukiji Market in Tokyo and the rice is perfectly cooked with the perfect temperature (so important).\n\nWe opted for the 12 course omakase for $85, although there's a very affordable 10 course for $65, and I believe 6-8 course omakase for $45. There's also some vegetable and minor courses before the fish, although I would say that's rather forgettable. \n\nFrankly I thought the sushi was delicious, and even though the chef doesn't \"experiment\" or expand the boundaries of sushi, it's simple, traditional, and more importantly, high in quality. I would recommend Sushi Hon over some of the more innovative edomae sushi places that have been popping up in SF lately. \n\nThe restaurant is fairly big, and they have a full wine, beer, and cocktail list. The environment is pleasant but not a super traditional sushi atmosphere. I'll let the pictures speak for themselves...", "author": "Kate M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "Came during their soft opening. The \"11 course tasting\" means each piece of shashimi is 1 course. That was a little disappointing and wasn't explained clearly. They have a large menu on the wall of things on their pre fixe but fail to indicate not everything on the wall will be brought out-- it's chefs choice. And as it was explained at the end, \"two items per category would come out,\" not everything written on the wall. So 2 from appetizers, 2 from hot plates (all very small), and 7 pieces of shashimi give you 11 \"courses\". \n\nSo for $65 I felt the price wasn't worth it. Shashimi is about $4 a piece, and the apps we got were one portion split for two. We came here on recommendation by SF Eater that called this an \"affordable omakase\" but for a $80 meal (after tip and tax) there are much better options throughout the city. \n\nDuring their soft opening, service was painfully slow. Their kitchen and wait staff did not communicate; at one point it was 30 minutes between our miso soup opener and the appetizer course. The overall experience was 2 hrs with a lot of waiting in between--I realize some tasting menus take 2 hrs but they are always giving you food. \n\nOverall, there is potential but a lot of kinks to work out; the menu needs to be more clear and service really needs to be fixed. I don't think I'm going to come back based on other options that have better, attentive, service and more food for the price or slightly more. I realize it's soft opening; food was great not amazing so all things considered, I think 3 stars is fair. \n\nSome tips:\n-Check your check. The draft is $4 on the menu and $5 on check---they were kind enough to comp it. \n-don't come hungry. Small portions and the slow service made it painful for me to sit for \n-bring a jacket. Their airflow solution is to open the front doors", "author": "Eddie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "One of the best sushi experience I have ever had. The chef completely caters to your likings and everything is top quality. Will be returning. Love it here. :)", "author": "Jennie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "My husband arrived at 6pm for our reservation & were the only party in the restaurant (it hasn't gotten too much hype just yet). They were very welcoming & showed us wonderful hospitality. It's a pretty large restaurant for San Francisco. They have sushi bar seating, 3 larger tables, & sake bar seating with a tv that was on silent. \nThey have an extensive drink list, bigger than most sushi places we have be to in the city. When we were trying to decide which sake to try, they were really accommodating & while they didn't list sake flights, they offered to spilt my glass order with 2 different sakes. Their pours our VERY generous! \nWe ordered the omakase which is less expensive than most places like this in the city but yet still not cheap. The sushi chef was very heavy handed in the wasabi. We asked him to do less & unfortunately it took 4 pieces of sushi for him to understand that we really did not want our fish to be overpowered. After that, the sushi was great! We ended with uni which my husband loves & I usually don't like at all but it my husband & I agreed, it was really good, it came in from Japan!\nWe ended our meal with a grilled fish which was out of this world! The seared scallops which were perfectly balanced with roe, fennel, celery purée, eggplant & squid ink, and a few other things. So good!\nIn summary, I would definitely like to go back for more grilled items & sake. Parking is not too hard to find. It pretty pricy but a good deal for the quality of food you are getting in a really nice atmosphere. \nI gave it 4 stars because of too much wasabi.", "author": "Ashley G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Great choice for a birthday dinner, babe. From start to finish, we felt cared for and welcome. We opted for the exclusive omakase, which comes with higher-quality fish. Our sushi chef was friendly, explaining what each type of fish was as he placed it in front of us. Pace was perfect - not rushed, but each dish/fish arrived a few minutes after we finished the one prior. I like how they alternate sushi with other dishes to keep it interesting. Each dish was subtle and elegant. We opted for glasses of sake instead of the sake pairing. Our server recommended two excellent choices based on our individual preferences. The atmosphere is clean and a little industrial, but low-lighting keeps it sexy. A very memorable, special meal.", "author": "Tanya K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "What a great find!  We've been twice now and we will keep coming back.\n\n$78 for Omakase ($36 supplement/$40 sake pairing) is a great deal.  Service was awesome from the time we stepped in the door until we left.    We sat at the sushi bar and opted for omakase with supplement both times and had a great time.  Thanks Chef Lee and Jeff.  \n\nHighly recommend Sushi Hon.", "author": "Leslie Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "A for effort? The omakase was mediocre.\nThe sushi chef seems to have added too much ingredients within our nigiri fish.\nWe could barely taste the fish and was hoping that every bite would be different but nothing out standing.\nThe atmosphere was very romantic and modern I would say.\nUnfortunately the quality and the work put into making the sushi didn't match up to the price.", "author": "Alui L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "Super surprised about the quality of sushi w the omakase meal given the lack of hype. Chef Min was incredibly friendly, welcoming and eager to share his knowledge. The highlight of the meal was definitely the fish, but I also found the sushi rice to be excellent. The warm dishes were a wonderful contrast to the raw items. Qpr was incredible compared to the ridiculous price points of all these new omakase spots opening up in SF. My only complaint would be the chunky wine glasses. Will definitely be back soon!", "author": "Manj G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "WOWOWEWA!!\n\nWent here with a group of 7 for my coworker's farewell dinner. We had a reservation but there were only a few other parties there on a Tuesday night. Note Sushi Hon is certainly not your average neighborhood sushi spot. There is no maki on the menu, just nigiri, small plates and entrees. The focus is clearly on bringing out the freshness and quality of the fish.\n\nWe started with edamame and shishito peppers. The pepps had a really good sauce on them and were perfectly blistered - highly recommend for a starter.\n\nI started with the chef's choice of nigiri. I got 6 pieces, including fatty salmon, tuna, halibut, and 3 other white fishes I didn't catch the names of. They were slightly smaller than the nigiri at your average sushi place, but the quality of the fish made up for it. \n\nNext I got the TUNA TARTARE!!! which I have to put in caps so that you see it and order it and it never goes off the menu. It was SOOOO GOOOOOOOD.... a lot of very fresh tuna layered between an equal amount of avocado, topped with mint, caviar and a quail egg yolk and served with homemade chips... I am blanking on the name of the root vegetable they were made from but they were perfect spoons for the tuna goodness. \n\nI also tried the miso glazed salmon which was so tender, it almost seemed like it was smoked, the poached egg with sesame paste and an unagi nigiri. All very good as well. \n\nThe service was great - quick, attentive and really accommodating to the gluten free among our group. They do need bigger water glasses - our waiter and I had a running joke about how many times he refilled my water (we ended at 16). \n\nI will definitely be back here for dinner and/or 5 servings of the tuna tartare.", "author": "Camille E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "After once again getting gypped by a certain place in Alameda unexpectedly closing, I was left searching to salvage my party's dinner plans for sushi that night. Somehow this place had almost the entire night open on OpenTable, with an omakase menu if you request the bar. $65 is super reasonable, I was sold!\n\nSake menu wasn't too shabby. I'm not the best judge, but the two wine glasses we got were pretty good. As for the course itself, it was 12 pieces for $68.\n\nI've been to some of the most hyped omakase joints in the Bay, so my bar's pretty high. I think for the price, I was definitely satisfied and enjoyed my meal. Somehow tuna from Boston isn't completely terrible compared to what I was expecting. I was surprised they didn't end on maguro, which was okay, but the uni they did use from Hokkaido was solid - not the best I've had, but very good. \n\nMy favorite piece was the sanma/pacific saury/pike mackerel. Definitely had that super rich, fatty texture I love at the end but came closer to the second third. And as one of the cheapest pieces a la carte ($5), I totally got a second one afterwards!\n\nWith a glass of sake at $18 and the extra piece, the bill came out to about $100 before tip. Note that while both this omakase and their prix fixe menus are nice, they're by no means necessary. You can get all the nigiri and a decent selection of apps/entrees a la carte to save some dimes.\n\nI'm not sure I'd come back to do the full on course, but I'd definitely be game to return for my favorites.", "author": "Dave N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-22", "description": "The fish here is very very good and the price for the omakase is ridiculously good. I don't normally up a rating based on a good deal but this was really noticeable. \n\nThe only downside is that the sake pairing isn't really a pairing (not very aligned with food) and more importantly the service wasn't very attentive with it (glasses seemed to come randomly and unrelated to where we were in the meal or where we were with our drinks) so you would be much better off just ordering glasses on your own from what i expect is a decent sake menu.   So the lack of attention here made what could have been an amazing meal a bit frustrating.", "author": "Amjad S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "Simply excellent. My friends who live in Oakland took us here as my boyfriend and I were visiting for the week from Chicago. We decided to accept the splurge and hit the jackpot with their Omakase. Our chef was attentive to our needs, (my boyfriend is gluten free so he made sure things were prepared properly) answered our questions about the fish and fed our happy bellies. I have never had sushi the way I did here and now that I'm back home and go to a sushi restaurant, it'll never be the same as this place! The servers were attentive as well, always checking in on us which is nice. A pricy bill for 4 happy dinners, but every single frickin' penny worth it. Will go back if we venture back to the Bay!", "author": "Vita P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "I didn't know I could eat raw fish until today!!!\nI loved every single dish from their tasting menu. \nSuper fresh & high quality fish + brilliantly harmonizing sauces\n= Pure happiness melting in my mouth. \nService and atmosphere were excellent, too.", "author": "Yejin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Great fish, beautiful dining room, and polished/attentive staff. Beautiful plating and inventive ingredients. Two thumbs up!", "author": "Jacob W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-28", "description": "This is a rare 5 star review .  The sushi here is delicate, meticulously prepared and superbly tasty.  Decor inside is simple and minimalist.   We had the Omakase menu and it was the perfect temperature, serving size and cadence in the delivery and presentation.  Service was subtle and never instrusive.  Warning - this locarion has the most difficult parking I've ever experienced so make sure to use ride share or public transport.", "author": "MJ J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Celebrated my friends birthday here.\nSeveral of us got the omakase, one of the best I've ever had, everything was so fresh, REALLY good flavors.\nImpeccable service, everyone was so friendly, ESP Jeffrey!  \nTHANK YOU for being attentive to my allergies and changing up the omakase menu for me.\nThey also cut and serve my friend's birthday cake.  I would give them 10 stars if I could\nWould def def come back !  THANK YOu sushi hon for such a great experience!!", "author": "adrienne l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "This place was fantastic.  The omakase was super legit and a lot of food.  It was awesome getting to eat with your hands too...would definitely recommend this spot and to sit at the bar.", "author": "christopher h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "Overall great omakase, quality of fish and selection. I'd recommend going with the omakase at the bar here rather than the entrees. I ordered the black cod the first time I came, it took a lot longer than other dishes and the portions were teeny! Service was pretty slow too.", "author": "Chelsea W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-08", "description": "Visited this place last night. I wanted to stop the service after the first bite of the sushi in an Omakase course.\n\nIt's unbelievable how positive the reviews for this place are. This was one of the worst omakase experience I had in the recent time.\n\nThey didn't cook the rice right. It was undercooked (al dente for sushi rice? what?), and waaaaay under seasoned. The rice couldn't stick together, and fell apart when I picked up the sushi (even with hand!) I couldn't taste any vinegar at all. Most of the fish seemed to be high quality (except a few at the end, where it was way too mushy for that type of fish I wanted to spit it out but didn't to be polite), but they didn't do a good job at curing the fish at all. All the flavor came from the sauce (like i said, they didn't season their rice).\n\nI never looked forwards to the last bite of an omakase meal like this before. After the first piece of sushi they served, I already knew i wouldn't enjoy the rest of the course. Because they messed up the rice so badly, and this rice was going to accompany all the fish of the entire course.\n\nWe didn't ask them to end the meal right there out of politeness. We sat at the sushi bar, right in front of the chef, and the restaurant was NOT busy at all. I did make some faces, and paused every time my sushi rice fell apart. Yet, the chef never cared to make a conversation or asked how everything was going. He just explained what the fish was. What's the seasoning he used, and that's it. I wouldn't recommend anyone going even if the meal was 1/5 of the price.", "author": "Pantry B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "Probably the best sushi I've ever had. Attentive staff, and great sake pairings to boot!", "author": "Shannon K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-03", "description": "Totally underwhelmed...worst of all still hungry after paying $108 each for the \"exclusive omakase\" dinner.  Very small portion, very ordinary nigiri selection, nothing \"wow\" worthy.  I'll go back to Wako or Kusanabe if I want something special.", "author": "Parker Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "We enjoyed the omakase- an amazing assortment of exquisitely prepared small dishes and really fresh fish. They served a tuna from Boston that was divine and a Santa Barbara uni with scallop dish that was excellent. The sake list is solid and the pours were generous. \nWhile the fish and small plates were delicious, one of the best things was the super friendly staff. Such a nice treat these days.", "author": "Dan k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Hands down, one of the most unbelievable culinary sushi experiences I have had!  You must make a reservation here.  \n\nSushi Hon is all about the fish, and not just your average sushi restaurant fish.  Each morsel was perfectly balanced and absolutely delicious. The artistry of the chefs and attentiveness of the staff were exemplary. The three of us sat at the sushi bar and, to start, ordered the octopus sunomono with a truffle ponzu and followed it by the Omasake with the black cod and tuna tar tar with caviar. I cannot begin to describe my favorites since each was equal to the last. The whole step of the way, Min took amazing care walking us through each fish as we tasted. \n\nI always get a bit nervous when trying a new restaurant, since I am Celiac, but the chef took preeminent care of me.  Many of the dishes on the tasting menu were modified, and for once, I did not feel like I was missing out.  \n\nMy only regret is now I won't be able to bring myself to eat sushi elsewhere because I know it just will not compare.", "author": "Becky P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-05", "description": "Was there last night with my family. The food was good except that we found hair in our sushi, in two occasions!  Was a bit disappointed and the restaurant should stress more on their sanitation process  as opposed to where they procured their fish first.  Sushi chefs should wear hats.", "author": "Harrison W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-05", "description": "This review is for single order and not for omakase, and we gave it a try as it has good reviews. It turns out the quality is fine but not worth the money and extremely over priced. For example, 1 single king salmon nigiri is priced at $5, whereas in other fine sushi places you can get 2 nigiri same quality at the same price or slightly more. The hand roll was priced at $9 on the menu, but we weren't told that the price depends on what sashimi you're requesting until we saw the receipt. Service was horrible: we requested a missing nigiri for 3 times without wasabi while it came with it, and our server never checked on us. In the end, they made a mistake to charge extra on the receipt, and the waitress claimed it was correct until I explained slowly to another waiter. Sadly there was no greeting when we walked out either. It was truly disappointing and will not recommend this place.", "author": "Alison L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-17", "description": "Everything is very tasty, especially the non sushi dishes of the omakase menu. I felt that while the sushi were composed of high quality fish, the fact that they're dressed with similar tasting, if not the same sauces and garnishes, all the fish tasted very similar, differing mostly in texture. Decor is modern, spare; service friendly, and we enjoyed chatting with our sushi chef.", "author": "Bruce C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "We had a great second experience at Sushi Hon. I ordered the omakase but my boyfriend chose dishes from the a la carte menu (which, by the way, has an amazing assortment and range of options). Typically their policy is that only omakase diners may sit at the sushi bar, but because it was a quiet evening, and only one of us was ordering from the a la carte menu, they made an exception for us. We were able to enjoy the company of Chef Lee, who was friendly and knowledgable about each fish we were served. He even managed to coordinate our two orders so we finished at about the same time. Omakase is not inexpensive anywhere, but I think the price at Sushi Hon is very reasonable. I'm seeing other Yelp reviews that are complaining about \"sauce\" on their nigiri. First of all, if there is a sauce on the nigiri, it's typical just gently brushed on. It's not slathered by any means. Secondly, none of the sauces are flavored strongly enough that you don't taste the fish. They're mostly only put on the \"fishier\" fish like mackerel (ex. wild Japanese mackerel with white sea kelp infused vinegar - as you can imagine, the acidity of the vinegar was beautiful with the oiliness of the mackerel). Each ingredient or preparation method (sometimes the fish skin is lightly toasted with a torch) is meant to elevate the fish. Keep in mind that preparing the pieces this way is in lieu of dunking that beautiful fish in soy sauce. That being said, if you're looking for completely naked, untouched nigiri, that's not typically what you will find here. \n\nThe full omakase also includes a few cooked dishes, which were all phenomenal. One, for example, was wagyu beef, accompanied by two stuffed morel mushrooms; one stuffed with potato and cod, and the other with Grade A5 Wagyu. What I absolutely love about Sushi Hon's food, is that all of it is incredibly well thought-out. Every ingredient in each dish had a reason for being there, which is a beautiful thing. \n\nI might also add that our waiter was attentive and knowledgable as well. He took care to describe each of the cooked dishes to us, and he was on the ball refilling our sake glasses from our bottle when he noticed them getting low.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "It's really hard to find high quality sushi in San Francisco and this is some of the best sushi I've had in the city, if not the best! Everything was so fresh and tasty and the Japanese wine selection was great. The only reason why I'm giving it 4 stars is because of the price and the portion sizes. We sadly walked a couple of blocks and got tacos after we spent $120 here. We left hungry so definitely come here with a large budget to spend. \n\nAdvice to the manager: \n\nI think the prices are a little too high for the area. Since there isn't a lot of foot traffic people are going to have to go out of their way to visit the restaurant. I think you'll do fine on a Friday or Saturday night but I think it's going to be difficult for you during the week. The place was empty on a Wednesday night and the staff looked bored. I'd suggest offering lower price menu options or at least a happy hour during the week to get my husband and I to come in more often as we only live a few blocks away. Right now it's going to be a special \"treat restaurant\" for us because of that. Spending $75/person for the tasting menu is definitely worth it for the quality of the sushi but we can't afford doing that every month. Delicious, delicious food though!", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "I'm very satisfied with the service. People were very nice and accommodating. Quality was very high yet the bill was very reasonable. My wife and I got the Omakase sashimi(I forget what it was called) plus two appetizers and she got something similar but nigiri style.\n\nWas very good.\n\nNext time I will try full Omakase.", "author": "E C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "One of the best Omakase in Bay Area. The nigiri was so fresh and yummy !!! Thank you Chef Lee ‍", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "We were originally going to have dinner at Saru Sushi but because there was a 2 hour waiting list, we found sushi hon on yelp with near perfect reviews. We found the place quiet on a Sunday night so the service was superb. And when we consider the Omakase that we tried, every single morsel was scrumptious...truly - it was superb as well. Sushi chef Mr Lee was attentive and open to fully explaining each element that was presented. I can't wait to share this place with my hubby.", "author": "Gillian Dawson Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Best sushi restaurant in the Mission. The Omakase is expensive but fantastically good. We sat at the sushi bar and had a conversation with Minh (sp?) and he handcrafted an Omakase specific to our preferences.\n\nThe warm foods chef is named \"Sonny\" who some people will recognize from Iron Chef. She is of Korean descent but trained classically in France. Her hybrid creations are out-of-this-world good.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "We've never paid more money from less food. It was delicious and beautifully presented. The service was excellent and attentive. We had the chef's choice sushi menu - $30 for 6 small nigiri pieces, two extra pieces of nigiri each. Two glasses of sake ($15-17) Dinner was over in about 30 minutes and we paid $170. On the way home we talked about making popcorn. Beautiful, brief experience that we won't be repeating.", "author": "Esther L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Wow! This place is amazing! Definitely returning to this place again! From starter to dessert, everything was so perfect and delicious! Price is reasonable for the quality and freshness of fish they offer. I love the atmosphere, and servers are very friendly and kind. Plus, nice sake and wine lists. I would recommend to anyone for any occasion. Must try! \n\nP.s. Don't for get to make a reservation especially if you want to have omakase at the sushi bar.", "author": "Ribbon F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "It had a good review in the Chronicle, so we decided to give it a try. It was pretty empty when we walked in. Not a good sign on a weekend. \nIt did have several tables when we left, but it never got that weekend buzz you would expect. \nUpon entering, we were asked if we wanted to do a la carte or omakase. Without knowing anything about the restaurant or the menu, that wasn't a decision we could make on the spot. We stood there confused, until they said we could decide later. \nWe were seated & ultimately decided to go a la carte. \nService was nice, sake was good, sushi was delicious, but the whole experience just felt... awkward.  \nWe really wanted to like it more, but the atmosphere was lacking. For the amount of money we spent, (over $200, before tip, for 2 people) it should have been more polished. \nThey also need major help with picking out better music. It was like KFog did \"The Worst of the 90's\" mix, with Third Eye Blind, Dave Matthews & Red Hot Chili Peppers.", "author": "Alisha A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Superb mushroom miso soup with apple bites. Loved the asparagus appetizer.  The black cod and veggies are excellent.  Will come again for fine Japanese dining.", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Can I say...wow. \n\nWe wanted to try out a new sushi place and ended up here. After hesitating for a sec before going in as we realized this place is quite pricey, we decided to still give it a whirl. \n\nI went \"all in\" with the omakase ($75) and the waiter informed me that all but 1 of the 11 nigiri are from Tsujiki fish market in Tokyo. The meal also came with 3 very small but awesome plates (scallop with fois gras on top was a highlight) in between the nigiri servings. Regardless, this was hands down the best sushi I've had outside of Japan and maybe ever. Every fish was prepared to perfection. Ridiculously flavorful and fresh. Everything was melting in my mouth. I casually asked whether soy sauce was an option and the waiter said the fish is \"pre-seasoned\" appropriately and should not need it. My husband asked politely to still have some and the guy did end up bringing it out for him to use. \n\nOthers at table got the nigiri sampler which was also very high quality fish honestly looked comprable to mine. The squid ink risotto was also well received. \n\nService was top notch and ambiance very nice. \n\nAll in all, I WILL DEFINITELY be coming back here!", "author": "Kristin T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Ahhhmazing sushi.  Freshest I've ever had.  Made with such distinction. And the miso soup was incredible!!!!", "author": "Judith K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "16.09.00       1st Accidental Visit & \n                       exploratory hit and run tasting\n\nSushi ------------------------------------------- 4 1/2 to 5 sushi alone\nEnvironment ------------------------------- 4 - 4 1/2\n\nLike the initial comment above ... purely accidental visit.\nHad to try at least some and research more in the future.\nKnew it was going to be very pricey and carry unique fishes \n      that 95% of the SF sushi restaurants does not carry when I stepped in.\nThe nigiri is posted on both paper and a mural size chalkboard.\nThe counter that surrounds the sushi chefs are reserved for omakase meal.\nThe price of the nigiri is for one piece.\n\nKohada   - Gizzard\nIsaki        - Grunt Fish\nAnago     - Sea Eel\nTachi Uo - Belt Fish\nUni ... one of the 2 from Japan ... will update when I check my pics\n\nThe 5 pieces cost me roughly $40 before tips\n\nNot something that I do on regular basis like the dot-commers. Sad Face Emoji ... here", "author": "S.K. Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Came here on a Sunday night from a recommendation that a friend gave and I thought why not right? Honestly I am so glad I did! The staff here were so nice and accommodating. And they really paid attention to us! Their restaurant is more of a fine dine cuisine with a mixture of BOTH sushi and French food! They also explained to us on where the fish came from and how the dishes were made! I'm going to say, THAT is AWESOME!! I want to encourage my friends and you guys whom I don't know to give this place a try! As you can see from my review I have too many exclamation marks but that is because I'm very excited for this restaurant!\nAside from that people, if you like omakase, you will love it here because \n\n1. It's pretty cheap for a real traditional omakase\n2. Their fish is fresh sent straight from Japan on a daily basis!\n3. The atmosphere of this place is really fancy\n4. Food is amazingly delicious\n5. Service is TOP notch \nAnd last of all they have a sushi bar and you can actually see them cook your food  (you guys should sit at the sushi bar, IMHO, if you're adventurous like me, sushi bar is way to go. Hehe)\n\nSushi Hon, you have taken my soul. I WILL come back for more! Thank you!\n\nP.S.\nParking isn't that great over here so try to carpool! I mean it's not bad like downtown but it's not easy like sunset if you know what I mean \nAnd yes, they accept cash and all credit cards but NO discover so be prepared!", "author": "Isaac K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "I went to so many sushi place in the world.  When i was in Japan i ate a lot of sushi. I can enjoy same taste of japanese sushi. Some of sushi was better than japan's one.", "author": "Sam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "First things first, this is not your ordinary sushi spot..its actually Omakase style, which means chef's pick. This was the first time I have ever experienced Omakase, which felt very much like an adventure, not knowing exactly what was coming, but as the dishes started to come out, I was eagerly waiting for the next rounds. My date and I felt like we were judges on Iron Chef and Morimoto was cooking! The plates were beautifully dressed and half the time I had to ask what exactly was being served, but it always tasted amazing! Since it was a soft opening, the only menu was actually written on the wall in chalk, which was different, but what else would you expect from a sushi spot in the mission... right!  \n\nSummary: DON'T- expect miso/california rolls or go for a quick bite. DO- expect delicate dishes that will guide you through a wide array of flavors and resulting in one great experience!", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Sushi Hon did not disappoint. My wife and I enjoyed the no-thrills but stylish and actually quite cozy ambiance. The omakase dinner was well prepared, the fish was fresh, and the amount of food was just right - we were neither left hungry and unsatisfied nor were we stuffed and sluggish. The sake pairing was generous and excellent. All in all, we had a great experience. We also liked the value - Sushi Hon is not cheap by any means (I think we were $300 in after tip for the two of us, with drinks and extras and such) but it's on the reasonable side when compared to restaurants in the area offering similar dining experiences and it never felt like a compromise. We'll certainly be back.", "author": "Alex F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "We did the regular omakase, and it was fantastic. Every piece of fish tasted incredibly fresh, and the non-sushi items were fantastic as well. The staff was pleasant and always on hand when needed. Only thing I'd note is that if you're going to do the omakase, definitely sit at the sushi bar, so you get the sushi straight from the chef.", "author": "Alex W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Lovely restaurant, fresh thoughtful sushi.  Ordering off the menu versus Omakase is just fine and just as beautifully prepared.  The vibe and space is ample but cozy and you can truly enjoy your meal easily.", "author": "HariShabd K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Definitely one of the best sushi restaurants I've been to! \n\nI had the omakase at the sushi bar, and the quality of the fish is amazing! The sushi chef took time to explain each of the nigiri and all the ingredients were used, and it was a very enlightening experience. We also had the cod dish, which was simply amazing!! I would definitely recommend any sushi lover to check this place out.", "author": "Steve L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "Don't walk run to this delicious restaurant! From the moment we walked in, the customer service was superior and we were well taken care of. At first, we were offered a table. However, we were interested in the entire omakase experience where you are tended to by a personal chef. For us, this made it a go-to and must return spot.\n\nEach piece of sushi presented did not disappoint. Melt in your mouth, flavorful, fresh and unique. We also enjoyed the additional courses including the BEST tempura ever! No exaggeration. For the curious it was a squash blossom filled with a mild melted cheese. \n\nLove the nigiri sake and kudos for an excellent menu to choose from.\n\nA complete 5 star evening from the moment we walked in to the time we left. A shout out to the man who greeted us at the door and I'm sorry the name escapes me, and the entire team that was there the night we went.\n\nGo!", "author": "Katia D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-29", "description": "Came here on a Sunday night. Maybe that was part of the problem. There were only six people in the restaurant. I could not believe how slow the service was. It took 15 minutes just to get hot water and hot tea.  And that was just the beginning.   The chairs look and feel like something out of a high school event center.   The black cod was excellent. But that was about it. The scallops were mediocre. The miso soup was lukewarm if that.   The dumplings were lousy.  It could be that the sushi bar is just fine. I don't know. But the entrées off the a la carte  menu are generally quite bad. This place should stick with sushi and get everything else off the menu. They're trying to do a French twist on the entrées and it really does not come off.   A sushi restaurant is not a French restaurant.", "author": "bill h."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "California meets Japanese. This modern take on hot and cold Japanese dishes along with a nigiri course for $65 is reasonable and filling, especially for fresh,  line caught fish from Tsukiji market and soft shell crab. My only complaints - dinner took 2.5 hours and the wasabi was a little heavy handed. More details here: http://bit.ly/2as2bH9", "author": "A L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "The first time I went here I was like wow the omakase here is pretty good ... this time we decided to order a la carte... the fish was very hit or miss (some pieces were yummy and others were meh). Service was also pretty bad...it took a long time for our food to come out. The worst part? After spending over $200 after tax and tip... the bf ended up getting diarrhea x3 ‍‍‍", "author": "Jewdee J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Service is to me, as important, if not more important than the food itself. The experience is a huge part of why I choose to dine out so often. The service here was phenomenal, especially considering it was their first night testing everything out. Very attentive, friendly, and quick to help with any requests our group had.\n\nAs for the food, we had the great fortune of trying a wide variety of different dishes. Some were more sushi focused, and some had more of the French influence their chef brings to the table. My favorite of the night was the miso butter poached black cod. It melted in your mouth and was cooked to perfection.\n\nI can't wait to go back and try the full omokase experience in the next week or two!", "author": "Jaron E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "The best sushi experience I've had in San Francisco. Amazing staff, great ambiance, excellent food. Chef Aiden treated us very well. Will definitely return!", "author": "Grace S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "You would he hard pressed to find a better omakase menu than what we had. The fish was plentiful and delicious, carefully prepared to all around perfection. The rice was well done, every piece of sushi, a distinct and wonderful flavor. The small plates that came between every few pieces of fish were nothing short of jaw dropping and full of delightful flavors. Nothing could have made this meal more delectable, other than a nice sake...oh wait, it just got better! I asked the manager for a recommendation to go with the nights preparation and he hit the nail on the head. All in all, fantastic experience all around. I would have, and unfortunately have paid double, even triple for less quantites, quality, and flavored food. My new favorite sushi spot in sf. Thank you chef aiden and chef sunny!", "author": "Tommy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "My first visit. It's in a strange location adjacent to a public elementary school a bit isolated for a restaurant. \n\nI ordered the set menu for $75 a person and received three sushi plates for a total of 11 nigiri interspersed with three special taste plates, the first was a two or three pieces of sashimi served ceviche style, the second was rice porridge and the last was a potato croquet. Final item was dessert which was a homemade panna cotta.\n\nOverall I thought it was a good value. Nigiri was of excellent quality. Croquet was wonderful. My main complaint was that the rice porridge was served lukewarm at best. I would prefer it hot. It also took quite a while for the first plate to arrive. Otherwise it was fairly well spaced with dinner completed in about an hour and the service was attentive. I'd go back for sure.", "author": "Jolene Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I love good sushi but I typically don't like to spend more than $50 per person.  This was the first sushi meal I've ever had thst was deserving of its $78 dollar cost. Top quality fish served with care and presentation that was the best I've ever had. Charming chef. Would love to come back again for a special occasion.", "author": "Sam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "one of hidden place near mission area.\nlooks like they have unique fish that others dont have .", "author": "Pahaha K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Great quality and finness., but support tiny portions. There plane is also very cute asked cozy but not great for groups.", "author": "Shirin E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "This place is amazing. If you're looking for mind-blowing Omakaze, this is it! My husband and I are so happy this place is in our neighborhood. We go here all the time now!", "author": "Rose R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Had the omakase here.  The owner and head chef prepared our meal at the sushi bar, which was fantastic and a very fun experience.  Both food and ambiance are well-executed.  Certainly deserving of the accolades it has gotten from the restaurant review battery in the Bay Area.  Will return again soon.", "author": "James T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "Omakase at the bar was a phenomenal experience.  The snapper was unbelievable.  Chef was great to talk to, and I really appreciated the level of service in general.  Best sushi I have had in San Francisco, no question.", "author": "T B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "The atmosphere and ambience of Sushi Hon was amazing, perfect for a business meal, with friends, or if you want to bring a date here.  The service was very professional and friendly.  I'll be coming back here often! We got the Prefix order that was the perfect size for me and I would recommend it to anyone.", "author": "Koa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "It's a new sushi restaurant recently opened in Mission district and their Omakase rocks!!! Me and my gf sat at the bar ordered Omakase sushi with cold sake (ginjo genshu something like that). They were fabulous combination to enjoy with. Waiter is indeed knowledgeable about sushi and cold sake so take their advices on what to order. You will experience the tastes of what it really fits you the best. I'd never had sushi like Hon in my entire life. \nThank you Hon! Will be back more often! ^^", "author": "J K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "This restaurant was amazing, and had such an intimate feel. I came here to have sushi on a whim, and I was not disappointed. We were provided an appetizer on the house and they were so nice. Definitely going to be returning.", "author": "Octavia L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "I like to keep this short. Jeffrey was a amazing host during our omakase. Chef Lee was great. I recommend coming here for sushi. The atmosphere was fantastic and I would come here again", "author": "Arlene T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-31", "description": "I came to Sushi Hon a week after their opening for my dad's birthday. I recently heard of Sushi Hon from an SF Eater article and thought $65 was an incredibly affordable price for 11 courses of omakase if the quality was really as good as they said it was. And to clarify, 6 of the 11 courses were individual pieces of nigiri, so that could be misleading. Turned out to be about $80+ after tax and tip with no add-ons.\n\nHard to complain about the small dishes - Edamame, asparagus and green beans in sesame paste, lightly fried hamachi, and bonito sashimi. All were delicious and refined.\n\nThe nigiri was also pretty impressive, with the chu toro and snapper being the highlights. The waitress also didn't know which pieces of nigiri were being served and I had to ask a couple times for clarification before she had to confirm with a supervisor. I recognize it was one week in, but memorizing 6 pieces of fish is highly important for the experience.\n\nHowever, the second critique we experienced was the following 6-piece maki course, which was labeled as \"chef's choice.\" Thinking we would get some type of fish, it was disappointing to be presented with cucumber instead. Upon asking and explaining our confusion, the waiters responded that the chefs wanted something lighter and refreshing to contrast with the oilier, fattier fish. Understandable explanation, but seems like all the other reviewers also had pretty fatty fish. If the maki was going to be cucumber all along, it was deceiving to title it \"chef's choice\" - just name it as it is.\n\nLastly, before we started our meal, I told the waiters it was my dad's birthday and asked if they did something special. They confirmed they would, but didn't actually do anything by the time we paid.\n\nThough these could be viewed as less significant criticisms, they were detractors from an experience that was intended to be a refined, high quality meal. Based on the quality and selection throughout SF, I likely wouldn't come back unless some changes were made and kinks were smoothed out.", "author": "Ashlie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-08", "description": "We came in for a special holiday dinner and Sushi Hon did not disappoint. Min and team were wonderful hosts, and the omakase menu showed both creativity and precision. Really as good as any omakase I've ever had. Make a rez, tell your friends, you won't be disappointed.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "My wife's choice for her birthday. By the end, we both agreed it was one of the top meals we've ever had -- and we've eaten at a lot of nice places over the years. The Omakase with the Sake pairing at the bar was just amazing. The chef did incredible work and the ingredients from the rice to the fish was very high quality. Excellent service as well, very attentive. My only complaint is this place kind of ruined me for eating sushi elsewhere.", "author": "Dan G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-02", "description": "Our chef was the best - shout out to Aiden (sp?) for a memorable experience! Came here for birthday just a few hours ago. This was me and my girlfriend's first Omakase experience, and we were not at all disappointed. Our chef had amazing dishes and a great personality. Each nigiri was like a new taste experience and the whole meal was like an adventure. The other side dishes and dessert were delicious especially the scallops and foie gras (one of the best scallop experiences I have had). The atmosphere was great except the music skipped a few times... but not enough for me to be bothered, just something I noticed. I would recommend this restaurant to anyone who wants a great Omakase experience or who likes sushi and wants to try a new restaurant.", "author": "Ken H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "The food and service are excellent!  The fish is the right temperature and individually seasoned.  The cooked food is amazing.  The staff is friendly and attentive.  It's Michelin star worthy.", "author": "Rachele F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-25", "description": "New sushi spot in the Mission.  Making reservations at the sushi bar was easy to make.  Love the interior design and decor but unfortunately the food did not match.  I ordered the Omakase menu which is set at a reasonable price for SF.  Typically, I enjoy the sushi pieces over the fushion-inspired cooked dishes.  However, I was not impressed with the nigiri as the sushi prep was subpar and taste was just ok.  The one dish I enjoyed (tremendously) was some truffle risotto plate.  Probably would pass on a second visit, but we shall see.", "author": "Joe P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "The food is good.  The service is really slow!!! If u want nigi omakase it's sushi bar only!!! Wish I knew that! Overall food was good service was super slow!!!!!!!!", "author": "Jason W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Love this place, I love sushi and this place met my requirement for freshness and quality with awesome welcoming management and ownership I will defiantly recommend this place for any occasion, specially if you have date!!!", "author": "HE S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-17", "description": "We tried the omakase at the bar and there was hardly any flavor distinction in the fish. It's clear this is a \"not-so-good\" omakase spot - you can't even tell the difference in taste between the fish!!! I agree with some of the reviewers in that some of the fish tasted bland and the quality of a few of the pieces were so-so (e.g. chutoro). A couple of the dishes I enjoyed...like the abalone porridge...but I would not come back for the omakase even if it's more on the \"affordable\" side.", "author": "Q C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Premier high-end Japanese restaurant with amazing nigiri, main and small dishes. We had a reservation and ordered off of the regular menu, but there is also another set menu option at the sushi bar only. The staff was more than helpful, attentive and knowledgeable about each menu item. The location is somewhat off the beaten path and new, so we were to make a reservation a week in advance.", "author": "Kari K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "I reserved dinner for five guests and myself. The staff could not have been more helpful through the process and during the meal. I had the omakase, and the others ordered al la Carte sushi and hot plates. All the food was awesome, tasty, and fresh. The Panna cotta dessert was awesome. Prices were less than many other sushi restaurants downtown. I highly recommend Sushi Hon.", "author": "David Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-03", "description": "This was my second omokase place ever and I thought it was really good. My boyfriend and I were the first customers for that evening, but soon enough the bar was filled. I thought the fish selection for that evening was great for the most part. However, I did wish they offered a little more variety. The uni was delicious and a personal favorite. Our chef was pleasant and smiled most of the time, however I wish he was a little more engaging as we found ourselves in slight, awkward silences. All in all, I'd love to return again.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "This place is awesome. Really low key, clean and modern. We didn't have trouble making reservations on Friday for Friday evening (lots of open spots). They had a solid selection of wine, beer, and sake and generous pours. We got the Omakase and everything was excellent and fresh; standouts for me included the Amberjack, Otoro w/ grated radish, and the ultra-fresh uni. Each piece of nigiri was meticulously hand crafted and had it's own unique combinations of sauces and garnishes. The experience also felt authentic and intimate, all sushi was eaten with the hands and the chefs at the counter were really personable and took time to explain the dishes and have 1:1 talks with all the diners. at $79pp the price is definitely on the low-end for a well-crafted well-sourced Omakase in San Francisco, but the dining experience was on par with any other high-end sushi restaurant in the city. We'll definitely be coming back!", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-04", "description": "it is a special occasion plan. food is good, but would i make a trip out just for it, may be not", "author": "Wailin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "I impressed by great sushi in here. I ordered Omakase and I received lots of fresh sushi. Whenever i ate the sushi, I can't  say anything. I really recommend this place.", "author": "Taehwan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Great food ! The dishes it's self were delicious,  the Japanese cuisine with French influences was to die for, also the Nigiris from Japan was bomb especially the barracuda from Japan !!!", "author": "Dannis D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-04", "description": "Decent enough. Ambiance pleasant and modern.  Menu interesting. Reality is that there is nothing special about this place and it has enough rough edges to make the experience somewhat deficient. Sparks of interesting dishes re inter mingled with mediocre plates. From a value for money perspective definitely not great. Overall wouldn't go back but cannot say that the place was bad.", "author": "Mo A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-25", "description": "Service, food, and ambience was great. Will definitely be back. The whole experience was delightful and splendid. Its omakase menu has a wonderful variety of a little everything to try. Also a good list of sake to choose from. The open kitchen makes it look very modern. Definitely recommend to my friends.", "author": "S N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-02", "description": "I'm glad this place is in the neighborhood, but what's up with all the Japanese options moving in? Bon Nene has opened on 21st and the old American Grilled Cheese place is going to be serving up Edomae sushi, apparently. Wow! But, regarding Sushi Hon, we thought it was pretty good overall. We dropped a fair amount of money on the sushi omakase plus a pair of otoro on top and two beers. Nice quality fish and options you don't see all the time. The sushi chef was sweet and very passionate. We sat at the bar, by the way, which means no a la carte ordering. We will probably go back to try to the regular omakase. Worth a try!", "author": "Missy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-11", "description": "I've been lucky to eat at some of the \"top\" sushi restaurants around SF... but honestly, I think I just accidentally found my favorite.  This place is new and has some rough edges, but the food itself is just absolutely incredible.  Omakase is 70 per person, which while fairly pricey, actually was better than almost any other that I've had that was more expensive. All their dishes are AMAZING, and their nigiri is just like butter - honestly some of the best I've had. What I loved was that they really took some risks with some clearly experimental dishes (mixed in some korean fusion) but they turned out just fantastic and delicious - every single one delivered, which is so rare. Though this place needs to improve a little bit more around ambiance (they had a broken set of lights that were distracting) and service (took a while for us to get seated and there was a used napkin on my seat), the food alone easily justifies the 5 stars.  We'll be back!", "author": "Seung N."}
