{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I always make a pit stop to Swirl on Castro whenever I'm in San Francisco. First of all, they almost always have Pliny the Elder in stock, and don't limit you to one or two bottles like other places do. The employees are all lovely and super helpful, and the wine bar in the back is amazing. I'm currently enjoying a brut rosé from Mirabelle that's making my whole week. Their selection is second to none; this city is so lucky to have Swirl!", "author": "Justine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Just moved from San Diego and needed to find a wine bar ASAP. This place was awesome and I decided to join the club. The servers are amazing and very knowledgeable and the owners are great they really care about their clients. The wine selection is great. We are making this our Date night spot for when we come to the city.", "author": "Cesar C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Just stopped in after walking by. It was Monday night so easy to find a seat. Had a lovely French syrah. Sat unmolested as I savored my glass. It was really nice, the relaxed atmosphere and the wine. I'd go back and welcome suggestions. But for that night it was perfect.", "author": "Ally G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "It really doesn't get much better than the combined knowledge of Max and Casey.  If you haven't been by this place, do so on a Friday in the early evening.  Such a nice and friendly mix of people and such a welcoming vibe -- due mainly to the hosts, Max and Casey.  \nWhen  it comes to wine shopping this Christmas, I am going to skip over the lackluster folks at the large chains and get me some amazing wine and knowledge, too.  These folks are thankful for your business and you will get what you pay for.  HIGHLY RECOMMEND!", "author": "Susie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Huge selection of wine. Great location right in the downtown Castro district area. Love the ambience - wine bottles decorate the place from top to bottom. It feels like you're in a wine library! It is a little bit of a small space so be prepared to stand at a cocktail table to sip your vino. The staff are extremely friendly and knowledgable. You can try all of the exotic wine country wine without leaving the city!", "author": "Annette K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "Great selection of wines and liquors with an excellent atmosphere and a very pleasurable experience. Come in an enjoy some unique blends! An experience you won't regret!", "author": "Richard P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-23", "description": "I met my friend here for a glass of wine before we headed out to a work Holiday party. I thought the staff was friendly, gave great recommendations. Even the customers around me were nice, good energy. I loved it. The tasting area is small but it is a wine store after all. I will definitely come back.", "author": "Liz D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-01", "description": "Lovely little wine bar / wine shop with pleasant owners and employees, a nice selection, and enough inexpensive wines that I can afford to actually make decisions!\n\nWine for the people; not for snobs.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-02", "description": "Dropped $200 here two weeks ago on 3 bottles of wine.  Opened the 2015 \"Here Be Monsters\" Nebbiolo Friday night to find an 1/8 of an inch of red sediment slime on the cork as well as around the neck and crown of the bottle.  Immediately recorked it.  On Sunday, returned the bottle to Swirl.  The man who sold us the bottle was there as well as, according to their website, the owner and winemaker.  We wanted our money back for this badly unfiltered wine.  We did not get it.  We were offered an exchange for another bottle of the same inferior product, with the owner's look of contempt.  We left the bottle on their counter and walked out.  We spoke to two Sommelier friends of ours and they both said the same thing, that the slime is indeed sediment, but that that is too much which means the bottler syphoned deep into the barrel to get more yield resulting in this unpleasant slime.  The Sommeliers also said however slimy it may be, it's perfectly harmless, though it can be unpleasant to swallow and taste a bit bitter.  So no thank you Swirl...you have lost two customers all over an inferior $35 Nebbiolo that you refused to refund.\n\n@Swirl...Your owner's customer service skills with unhappy customers are severely lacking.  the gentleman who originally sold us your inferior Nebbiolo, at least was smiling and kind.  The owner on the other hand showed nothing but contempt on his face.  As stated, you have lost two customers and further we want nothing from you for your horribly handled situation.", "author": "Stan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-08", "description": "This is the best neighborhood institution.  The whole staff is well versed on the wine, they are super friendly and welcoming, it's a great environment, and they care about and love what they are doing.  You can sit at the wine tasting bar all night if you want, talk with great neighborhood people, bring your well behaved dogs in with you, and have a great time.  Please save me a seat if you go!", "author": "John F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "My husband and I stopped in here for the first time this past weekend.  It's been on my bookmarks for quite a while, but we just never seemed to make a point of popping in. \n\nThis little wine store made my day this past Sunday.  Not only are the prices extremely reasonable, but the products they carry are the best.  We were particularly impressed by their wine selection - while not extensive, they offer a selective offering of quality wines at a range of prices.  You can definitely find a bottle under $40 that packs some bang for your buck.  \n\nThe found the people working there to be extremely helpful and knowledgeable.  We were trying to find something to bring with us to pair with our dinner at Flour & Water later that evening, and one of the gentlemen working there pointed out a range of bottles that would pair nicely.  \n\nAnother nice touch - we noticed that one of the wines we were considering for our dinner later that evening was open in their tasting area.  They were kind enough to pour a small sample to see if it was something we were interested in.  Well, it was delicious, so we ended up going with that one.  \n\nWe also were so excited to see wines we've \"had our eye on\" but have been extremely difficult to find.  We walked out with a few bottles in hand, and a mental note to make this \"the\" place to go for future wine purchases.  And also walked away with our eyes on a few particular suggestions they mentioned - next time (there will always be a next time for these wine-o's!!) :)", "author": "Rachael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "So glad I ventured out of my neighborhood to a new venue for a Monday night winemaker tasting - Swirl is a true gem.  I look forward to coming back often!", "author": "smegalandtootsie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Really welcoming and nice little liquor store.  You can find liquor here that's hard to find elsewhere.  It's a little more expensive but worth it.  The people that work here are very helpful.", "author": "Chelsea D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "The best wine store in SF. This is the wine store of choice for locals that welcomes visitors to San Francisco year round. \n\nYou can't beat the atmosphere, service, patrons, and selection. Swirl absolutely earned its top spot.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-13", "description": "LOVE this place! \n\nFantastic service, good selection of wines by the glass.  Friday night had a good crowd/scene.  \n\nGreat selection of wines for purchase.  The folks who work there really know their wines and know how to make good recommendations.", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-14", "description": "What a great spot...small gem right on Castro street that if you walk by too fast you think it's just like any other small wine shop.  It's not.  The wines they carry are fun and interesting and not the run-of-the mill stuff.  They carry wines that they themselves find interesting and intriguing, and can talk to you about the details of them.  But my favorite part is the wine tasting options--yes, they have wine tastings and little tables in the back where you can enjoy them.  You can do flights or choose glasses, and the guy that was there when we've always been there (KC) truly is knowledgeable but not an air of arrogance or snootyness at all.  \n\nI love how they have their wines arranged in \"boldness\" or by \"splurge\"...a new way of arranging wines, but also helpful to the wine novice as well I'm sure.  If you keep an eye out they have some really good finds for great prices as well.  We will continue to go back when we find ourselves in that area of SF.", "author": "Brad D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-31", "description": "Everyone is welcome here. You don't have to know a thing about wine to feel comfortable or welcomed. The bartenders are happy to educate you or simply pour and hear your story. There's not an ounce of pretension in this perfect wine spot. Check out the secret garden in the back during spring; magical!", "author": "Megan Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "Great place! My partner and I have been here many times over the years when we have been in the Castro.  They have a good wine and spirits selection.\n\nOur favorite part is actually the little wine bar at the back.  You can get wine by the glass, bottle, or one of their white or red tastings.  The staff is very friendly too which gives it a nice, friendly neighborhood vibe.", "author": "Jax B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-18", "description": "Super friendly. Wine bar is a fun way to learn more about wines with flights and/or small tastes. Friday nights get a regular crowd. It's the Castro's Cheers!", "author": "Josh F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Everything a great wine spot should be; inviting, comfortable space, solid selection and great service. \n\nWe sat at the little wine bar in the back on a Friday evening and enjoyed some bubbly and a glass of Syrah.  Both were delicious. And, we spoke to two of the gentlemen that were running the store as well as another patron or two. \n\nAwesome prices, delicious wine and overall great vibe! \n\nI watched a passerby come in and ask about a good bottle for dinner. The shop manager patiently went through all of the possible options, price points, etc with the woman without once rushing her.  What great karma!\n\nOh, side note; Outside of wine, they have some great liquor options too.", "author": "Dusty B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-22", "description": "This is a really nice little wine bar, much like my favorite of these combo store-and-drink type locales back in New York.\n\nUp front is the purchasing, with lots of wines and some liquors for you to choose from; you can find pretty much something from all over North California here along with some imports as well. Knowledgable staff will help you pick out exactly what you're looking for.\n\nPrice-wise it's competitive with the rest of the neighborhood.\n\nBut the back is where the party's at* because there are a few tables where you can buy a glass of wine and sit and chat with friends. Or, on a Friday night, get drunk with friends and raise a ruckus**.\n\nPatient staff, cozy backroom and it's perfectly fine to bring in some snacks (i.e., the requisite cheese and crackers) but I imagine they'd probably be a little upset if you brought in some Burger King.***\n\n* - insert appropriate mullet joke here.\n\n** - but not too much of a ruckus as to make things too difficult for the people working there.\n\n*** - no one would have a problem with Popeye's because, come on, Popeye's is awesome.", "author": "Danny P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-28", "description": "Swirl was great. Came here for a friend's bday...we created our own napa experience. by picking spots to wine taste.\nThis place is cute. Not super big but they have couple tables to sit at. \nThe staff is super sweet and attentive.\nThe really tall white guy that works there, is def not gay...he ended  up giving my friend his number. pretty slick if i will say.\nAside from that...cute spot. Great selection of wines and liquor. I would come here again.", "author": "francis c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "Max is tha maaaan! I had so much fun coming here with my friend Ashleigh P. and her cousin! We had a blast sippin' on delicious wines from Max's collection and talking about life. Yes...I talk about life a lot but man...so much happens in this world! Anyway, the reason why I give it 5 stars is because Max treated us like family. I LOVE great customer service and he was very knowledgeable about his wines. He poured our glasses and cheered us to some good times! \n\nIt is also a wine shop so you can purchase the bottles and some accessories. I wish they would open the patio to the customers but business regulations exist in life. Also, it's best to enjoy the ambiance that Max has created indoors because you may just end up with mosquito bites. \n\nCan't wait to come again!", "author": "Leena B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-30", "description": "I always love coming here.  I have probably been here 20 times in the last 6 months, in fact I will most likely be there on Sunday.  It's almost like an obligatory beginning to a night of shenanigans.  The staff is friendly and hey, I don't mind being ogled a bit.  They have a decent wine list and I am never disappointed to find something good to drink,\n\nThanks boys!", "author": "Shaun C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "It's probably good I live a 15 minute walk from this wine shop and tasting room, or I'd spend way too many evenings here chatting with Leslie, Max and their amazing patrons. Fantastic selection, but even better recommendations. They really want to help you find what you love. I'm nervous to give a five star review, as I want to keep it not crowded, but it's just not fair to the rest of you to keep such a mellow, knowledgable wine spot to myself. Also, if you have a small, mellow dog, they won't bat an eye if you bring it along for your wine tasting.", "author": "Leslie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-30", "description": "Great little spot!  Lots of choices.  Some wine bars can be intimidating, but they were very inviting.  We asked for advice on places to go to tonight and instead of getting a simple one word response our waiter went above and beyond!", "author": "Alejandra O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "Okay, who drank all my wine?!?\n\nSo, I'm all out of wine at home. What's a girl to do now?\n\n((Enter Swirl on Castro.))\n\nSwirl. What a captivating name. My gf & I had some time to kill before our massage appointment @Always Tan Skin & Body. We saw the cute little wine bar/shop and decided to come in for a quick look see.\n\nIt's a cute & cozy little spot located in the Castro, nestled between trendy restaurants, bars, & other miscellaneous shops.\n\nThey have a nice assortment of whites, reds, dessert wines, sake, & other spirits/liquor. They even served Absinthe- something I've never tried but always heard so much about. The nice fella behind the counter explained its acquired black licorice taste and 140 proof in alcohol content. Woah. That's pretty strong.\n\nThe back area holds a wine bar which offers tastings that average about $3 per taste. Nice.\n\nBottom line: Cute little wine bar/shop that has lots to offer, not to mention friendly & personable staff.\n\nTip: Exclusive wine tastings go down every other Thursday.", "author": "Joy A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "I love this place - everyone that works there is knowledgable, approachable and gives excellent service - Jerry the owner has hired an excellent staff. Josh, Tim, Stanley, and the others do such a great job - I love going by there and having a glass or 3 before heading out to dinner.\n\nThe wines and spirits there are unique - and most of the time  not offerered anywhere else in the city. And the wines by the glass are affordable and I swear, there is not a dud in the bunch!\n\nGreat Job Guys!!", "author": "Rew C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "EXCELLENT EXCELLENT EXCELLENT!  They have a great selection of high end wines...not the grocery store shelf swill.  Max is super helpful and very knowledgeable about the wines.  Tell him what you like and he's certain to have a recommendation.  They have a quaint little tasting area that holds about 12-15 people.  They also have an amazing selection of small batch liquors...unique and great for gifting.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "My boyfriend and I stopped in to ask whether Bailey's contains gluten. Instead of being annoyed that we didn't just Google it ourselves, Max was courteous and helpful- looking up the answer for us on the spot. Sadly Bailey's is not gluten free, but Max suggested a very tasty alternative.\n\nGreat, knowledgable service! Thanks!", "author": "Brandileigha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "Didn't realize this was even here until I walked in on my way to another wine shop around the corner, but glad I did.  \n\nFriendly service and a good (if a bit small) selection of interesting, well-priced wines.  Found a nice Gruner Veltliner and a Sancerre at less than $15 per bottle.  Similar to Safeway, they also offer a 10% off six bottles deal.\n\nFirst wine is good and assuming the second one doesn't bomb, I'll definitely be back here.", "author": "Jeff A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "Love Swirl! It's hip and trendy, but they've got some great finds if you spend time with one of their salespeople. I came in here on Christmas Eve and was shocked to find it open, let alone open with an awesome staff! My husband had to work late and it fell to me to buy wine, thanks to these guys I was celebrated for my choices! They are really great at listening to your tastes and making reccos.\n\nThey also have this rad barrel thing I'd never seen before that chills your wine in minutes while you wait! \n\nAs a tasting bar it can get pretty crowded, but it's a nice place to go for a glass.", "author": "Nikki M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-05", "description": "Very interesting place! \n\nWe were in the Castro today taking our elderly friend to lunch. After we dropped her off at the bus stop, we went to the edge for a drink. We were ready to to return home via muni/bart to the east bay,but I wanted some wine and some JW Red for my sweetie. And I remembered a little place up the road that had hand blown grappa bottles in the window.\n\nSo, I think we found it.\n\nWe entered. No one really greeted us. The staff was busy. We were looking at wines when some other patrons came in. Immediately recognized, they were greeted enthusiastically. We ended up getting some help after asking. Got 2 bottles of wine and the Johnny Walker plus a muddler for our friend Valerie. I think I'm just spoiled. Living in Alameda and frequenting the same places all the time, we usually get the vip treatment...", "author": "Nobbi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "Lots of great local tips on restaurants and wines.  Very friendly guys pouring our flights.  I'll go back!  (Thanks for the great tip on the oyster place across the street- I got there 3 minutes after they opened and it was already packed!  Got the last 2 seats in the place!)", "author": "Dave M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "SUCH A FUN LOCALS PLACE!!!! Really a fun time. Great owner. Max is a blast as well. Good pours and selection. Great people. Customizable flights. Much better deal than BLUSH.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-23", "description": "I absolutely love Swirl!  They have the best staff - knowledgeable, approachable, and charismatic; and a wonderful selection of wines, spirits, and beer.  I have been going to Swirl for 3+ years, and continue to be introduced to uniquely impeccable products by a wonderfully caring crew - Jerry, Josh, Stanley et al.  \n\nSwirl is a true San Francisco gem!", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-06", "description": "I went in there looking for a bottle and was browsing the bottles for about 10-15 minutes but the guy working there was too busy smoozing with the people drinking at the wine bar to notice that people were browsing the wine selection.  \n\nApparently if they know you there, they're nice to you and ackowledge you.  If they don't, well then you're on your own.  Years ago the people working there were much more helpful and engaging with everyone without the attitude they have now. They have a lot of wine but the customer service and friendliness was very much lacking.  \n\nI don't think I'll be going back there again.", "author": "Franklin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "Very neat store with just the perfect amount of wine to choose from! Conveniently located jut a a block from\nMy place it was awesome to run over grab a pretty good bottle of wine for a reasonable price. Nice service and I noticed that they do tasting in the store as well.", "author": "David H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-03", "description": "My favourite wine bar in SF. The staff is super friendly, knowledgeable and helpful. The clientele is fun and entertaining. Can highly recommend it, come here often with my boyfriend and we always have a good time.", "author": "Elena W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-20", "description": "Came in here to find some wine for a wine-tasting party....the day before the event.  You know how it goes.  \n\nThe staff were not only friendly but also helpful in finding the two bottles we needed!  \n\nI'm coming back for their wine bar (in the back), and special events on Thursdays.  :)\n\nPrices = depends on what you get, they have stuff that's fairly cheap and some stuff that's high-end.  Just hope you know what you're doing. :P\n\nParking is typical Castro but suck it up, yo and walk it!", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-30", "description": "This place - what to say.  I guess it really depends on what you drink.  For me, I drink Moet & Chandon Nectar Imperial, Dom Perignon, Veuve Clicquot La Grande Dame Rose, etc and this place does not serve any of them.  With that said, there's no reason for me to shop here or recommend this place.  I think their highest-end champagne is like $60.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "Celebrated birthday there - staff knowledgeable and helpful.  Wine was great.  No complaints.", "author": "Darren P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Jerry is amazing, they always take care of our Pomeranians Muffin and Cookie. classy, elegant. Great prices. see you soon, (Jon is the best also)", "author": "Captain Muffin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-31", "description": "This is actually a great little wine and liquor shop but given how busy they are and how they don't have prices on anything, it's become an annoyance almost every time to try and flag down someone to scan all the options I'm interested in.  Plus their prices are higher than my usual places for French liquor and Belgian beer.\n\nIt also seems to cater mostly to people who drink wine and mixed drinks.   I was annoyed that they only had Vya sweet vermouth in the small bottles because it \"sells better\".  C'mon peeps!  This is a great tasting vermouth that you can drink on the rocks and not just  a mixer for martinis!  Although they did say if I was a regular customer that they could order the normal bottles for me.\n\nMostly it's just too busy to let me browse and ask questions comfortably.  But a great place for wine tastings.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-26", "description": "Have I mentioned lately that I am a bad influence on my friends and I like to make them do things they don't want to do, know better than to do, and all out shouldn't be doing? I haven't? Here are some examples: after work pedicures always turn into out-til-2 drinking binges, complete with dancing on bars, coyote-ugly style. On weeknights. A couple of hours at a karaoke bar turns into an after party at a stranger's house til 5 a.m. On a weeknight. A \"quiet\", quaint Sunday brunch turns into a morning hike up and down Castro, solely for the purpose of drinking. And drinking more. Damn, I am good at making people bad. \n\nThis time, and the time before that, and the time before that, I have had a lot to thank my pushover friends for. Swirl consistently ends up being one of the best bad decisions I help them make! Sure they make excuses about how they need to get work done, clean their house, go to the gym. But instead I plant their asses comfortably in a stool at a darling mosaic mini bar at the back of this well-stocked and well appointed shop/wine bar. The owner is amazing, as are most of the employees, and the  tasting menu is pretty expansive, considering the size of the tasting area and the fact that the focus really seems to be on retail, space-wise, anyway. \n\nI'm a huge fan of the current white flight but whatever they have on the menu is generally good, too, and you can pick and choose from the tasting list to put your own flight together. Or just drink a glass. Or four. Or five. Or  a half glass or a bottle or a Belgian beer or any combination that will keep your friends drinking instead of being productive members of society. Whatever you do, call me on your way. I'll meet you there, with my friends, who should likely be doing something else.", "author": "Drue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "While I was waiting for Mudpuppies Tub n Scrub to finish grooming my dog, I wandered in to Swirl. Fantastic atmosphere and a great selection of beer, wine, and spirits. I had a Schneider Aventinus Weizen-Eisbock and loved every last drop as I always do. Very clean, the staff was extremely helpful and friendly. Can't wait to go back!", "author": "Jeremy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-06", "description": "I call this place Swill.\n\nLove the idea of a wine bar in the Castro, but I do NOT like the Rude McTude vibe if you don't fit the fashion paradigm of who ever is working there.   If you are a style faux pas you'll be snubbed worse than if you walked into Neiman's wearing a plastic trash bag.\n\nPS - the chairs are ultra uncomfortable, so I guess this is like the In and Out Burger of wine bars.", "author": "Cinnamon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "Love this place. I try and go every time I'm in the city...however, to my dismay, when i went here last Sunday around 1pm, they were CLOSED!!!!! I really wanted to pick up another couple of bottles of Oregon Pinot\n\nEvery time I go, we have a seat at the tasting bar, and every time I leave, I am bubbly, buzzed, and ready to shop!  They feature a wide variety of wines, from all over the world.\n\nSo worth stopping by if you're in the area.", "author": "Brit C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-08", "description": "Totally ignored when sitting at the table across from the bar.", "author": "Charles P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "Friendly expert staff comes across as knowledgeable without pretension. Came in here to buy a few gift bottles and the advice I got resulted in some very nice choices.", "author": "Mark H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-17", "description": "They have a great selection of wine. The downside is that it's a bit small, and they Do keep the same vendors (some of whom suck) for too long. Dump the crap- gasp have sales- and make more room for your awesome taste!", "author": "Chuck H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "The inside is beautiful with all an assortment of wine and spirits.\nAfter orphan Andy we decided to stroll the Castro and see what this place was all about and our way back to the car we stumbled upon this place.\nThe guy who helped us was really really knowledgable and was a great help.", "author": "James S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "This place is really great.  When I first moved to SF in the Castro, I remember coming here my first night and buying a bottle of wine.  The staff was very friendly personable and was one of the first to welcome me the neighborhood.  \n\nGreat selections, and a helpful staff who will recommend some great wines for any specific occasion.  Also a great place to stop in on a weekend afternoon to relax and enjoy some cava!", "author": "Brian M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-10", "description": "The staff here is always very nice and well informed.  The petit wine bar in the back is very cozy with good flight prices.", "author": "Elham A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-18", "description": "From the outside it's easy to get the impression that if Melissa Rivers married one of the Alitos and started a wine label to keep busy, this is where the launch would happen (or at least a prominent window display). \n\nBut on the inside Swirl On Castro (and they queen out if you miss that \"on Castro\" part) is a fairly nice little wine shop.   \n\nI'm more of a fan of Castro Village Wine, but I think if I got a hankering for a small batch wine not made in California, I would return to Swirl (if only I knew what street it was on).", "author": "Luke M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-16", "description": "In a word: overpriced! Seriously overpriced. A bottle of Viex Pontallier is $60 some odd bucks most places. There it was $75. I'd rather take my duckets and spend them at say Cask or even Blackwell's on Geary which has a far more interesting and eclectic selection. No Cochi Americano at Swirl? What is one to do?! I will have to revive my corpse through other means.", "author": "Len S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-30", "description": "Proponents of Prop 8 will tell you that gay marriage violates the \"sanctity of marriage.\"  \n\nI can tell you that growing up in my \"straight\" household, my parent's marriage didn't really look like a gift from God.  \n\nIn fact, at times, it was more like the plague.  If anyone should have had their marriage banned, it was those two.  \n\nAnyways...\n\nSwirl is my kind of place.  Filled with staffers and clientele that always make me smile.\n\nMy last visit there included getting told that my jeans were out of date, my t-zone is slightly dry and that my humor was best suited for a 13-16 year old.\n\nDamn I love this place and I will be back for sure.  \n\nEven if every woman in there is not interested in me.\n\nIf you haven't been, stop by, have a drink, and buy some good wines.\n\nOh, and no on that idiot prop 8.\n\nEqual.", "author": "Archie R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-21", "description": "Bartender (possibly owner) #1: This is a big wine, I don't think it shows as well as it could in this flight, I think of it as a food wine.  It's tight, so give it a few minutes to open up.\n\nMe: Ok, I'll just swish it around a bit\n\nBartender (possibly owner) #1: You can SWIRL it, but never swish.  We do not swish.\n\nBartender (possibly owner) #2: Honey, this is the Castro, we ALL swish!\n\nAnd that pretty much sums up why I love Swirl.  Unpretentious, irreverent and just plain fun.  One thing to note:  This place is about 3 parts wine shop to 1 part wine bar.  The space boasts a wine collection that just begs to be explored.  I can foresee significant chunks of my paycheck being sacrificed here in the name of building my wine collection.  \n\nIf you are in the mood to stay awhile, you should know that the seating area is not large (I'd guess there was room for about ten back there) so this wouldn't be a particularly good place for a group.  However, if you're traveling in twos or threes and find yourself in need of a tasty libation, by all means, check out Swirl, you won't be sorry.", "author": "Renae H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-22", "description": "Wine is good for you.  I had to keep that in mind as i started to slowly sip my 3rd and final glass of white wine.  Everything in moderation, I know, but the wine was so delicious, i couldn't help myself.  Robert P. and I decided we'd just chill out and have a glass of wine.  Robert had a the flight of white wines while i had a glass of the chardonnay Luli.  It was nice.  Gregor G. and Nick R. showed up a little later to join us as did my friends Calvin L., Kristin, and Marianne.  \n\nThey have a good selection of wine and a really great staff.  Tim (met Joan Rivers Tim, not the other one) was the best .  It's a cute space with little details that make it interesting and comfortable.  Their prices are pretty reasonable and they give you a good amount of wine.  I'll be back when i'm in the castro and need a little wine break, which will be soon probably.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-10", "description": "Things I love about Swirl:\n\n5.  That they categorize their wines in flavor groups like, \"Big Reds,\" so you can check out what you want according to the dish you are making or the mood you are in.  It's like a Dewey Decimal System for wines.\n\n4.  Jerry, the owner, is crazy knowledgeable about wine, but shows no pretentiousness.  He's friendly and helpful and sassy.\n\n3.  The casual level of customer service from all staff there.  I love walking in and telling the staff what I am cooking for dinner and having them pull out some options.  If I tell them, \"weeknight price ranges, please,\" they show NO attitude.  I was once shown 'the cheapest of our good sauvignon blancs' with actual pride.\n\n2.  The wine bar is small and often filled, which means that you will meet people very quickly.  Don't be afraid!  Squeeze your booty in there , smile, and request, \"what good reds are you showcasing right now?\"  You will soon have 4 new friends commenting on your wines and complimenting your new hairdo.\n\n1.  Timmyloo rocks my world!  He's the staffer with the sweet smile and shock of red hair.  Last night I went in there 5 minutes after closing... Oops!  But as Timmyloo was tipping back an amazing Zin with a lovely drunken drag queen, he invited me to stay and sip with them.  He's a wonderful conversationalist and every time I visit him he teaches me more about wine without coming across like a knowitall.  Beware!  Timmyloo will figure out your tastes and you will end up buying 4 bottles when you only came in for a glass!  Of course, onlyt after he has sipped a few glasses with you.  Salut to Timmyloo!  I only hope that your liver is as strong as your humor and grace.", "author": "wineporn S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-12", "description": "This place is such a rip-off, the prices are over retail in many instances, and the service, such as it is, is a sad joke. The selection of wines is second rate, at best, and most of what's on offer is way overpriced. And forget about being greeted and made welcome, the only thing these guys want is your money. Period. Shop elsewhere and have a better time, better wine, and customer service.\nUPDATE: Heard from the owner, Jerry, who threatened me in his emessage. He didn't bother to open dialogue, just displayed the source of the poor attitude I have encountered at Swirl, but this time it was very personal and explicit. And his use of vulgar language in his reply was pretty much what one would expect. I've had several interactions with business owners via Yelp, and this is the first time anyone has responded with such vile. Things must not be going so very well, and I think I know why. A  fish rots from the top...\nThe bottomline for me is this:\nhigh priced goods, questionable service, hostile owner. ZERO STARS\nThe star you see is because Yelp doesn't  let one remove it.", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-21", "description": "My new favorite place in the Castro is this lovely little wine shop and bar. The bar is really small, there's four or five stools along the serving area and two small tables in the back. But there's a lovely little garden out back with lots more room for wine-loving Castroites, their cute little doggies and their lush gal pals visiting for the weekend.\n\nWe did a flight of reds for $11.50 and I would have taken home a bottle of each if I hadn't just bought a case of wine the day before. The wine cabinet in the corner of my living room has expanded to a set of boxes piled in the corner. The madness must stop somewhere. But, anyway, back to the review. If you have some time to ponder your selection, why not take a seat and try some out? In addition to flights, they'll serve tastes and glasses, poured with a heavy hand, God bless them. \n\nThree favorite things about Swirl:\n\n1) Really nice staff, not pretentious at all. As much or as little attention as you want.\n\n2) I really liked the way the shop is organized. As you walk in, bubbly is the first thing on your right, and across from that is the booze. Wine occupies the whole right side of the shop. Most wine shops organize by origin or varietal, but Swirl is organized more by your personal taste in wine. One section is called something like \"robust reds.\" There's also a small section simply labeled \"Splurge.\" \n\n3) I don't know a lot about wine, I couldn't articulate a good description of what I'm drinking or explain why certain grapes do well in certain regions. However, I really know how to drink the stuff. I mean, I have that part DOWN. I didn't recognize many of the wines here and that's pretty unusual for me. I really like that you could wander into Swirl and have a pleasant natter with the staff and go home with some fun new find. \n\nIf I'm spending the weekend in the Castro, wine is probably the only tasty thing I'll be taking home with me, at least if I pick it up at Swirl I know I'll end up satisfied. Wow, when did I become a dirty old woman?", "author": "Pumpkin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-13", "description": "This is a wine shop with a small wine bar at the back.  I love this place.  The owners are so welcoming and pour wine at cost, so you can try out lots of wines before you go on to spend a small fortune in the store!\n\nYou can also bring in your own pupu platter (aka cheese and crackers) so that you don't get totally plowed on an empty stomach.\n\nGreat place to end a day shopping in the Castro (don't forget to drop by Citizen for great clothes) or before/after a movie at the historic Castro theater.  I highly recommend that you catch one of the silent  era movies with the whole film accompanied by the organ -- a sublime experience.", "author": "Lorraine F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-03", "description": "Jerry the owner is super nice, first of all!  I asked him about champagne options for an upcoming birthday for a friend and he made several recommendations after inquiring about her tastes, habits and the what not.\n\nBut even if he wasn't here I would love this place, it's adorable and cute and super welcoming.  I bought a bottle of the Veuve Cliquot and saw that they also have a rose version of the champagne which means I will be back.\n\nSmall space but filled with different unique options.  It's also really easy to navigate your way around the store if you are a newbie to the wine and champagne thing, as every section is clearly identified.  And beyond the typical reds, and whites and champagne sections, they also label their sections according to one's tastes.........\n\nI am told that they also do flights if you want to do a little tasting.  I am going to be back.  Swirl and I are destined for a great relationship.", "author": "Denise B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-12", "description": "Love these guys. I'm not (yet) as knowledgeable about wine as I'd like, so to find a wine club that consistently sends me selections I really enjoy is a boon. \n\nThe staff is always personable and friendly, without being up in my grill while I poke around lookin fer new hooch. \n\nI haven't been consistently wowed by their flights, so I often skip 'em. (That said, I've found some reasonably priced GEMS by trying their flights, so ya never know!) But I have made many AWESOME purchases of 20 buck chuck (or less) that are a phenomenal value for the $ based on their descriptions. \n\nEvery month's visit is a treat, and I wind up coming home with at least a couple of fantastic additional bottles when I pick up my club selections.\n\nYeah!", "author": "Beverage Appreciato R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-01", "description": "AT LAST. A liquor store I can endorse without reservation.\n\nAbsolutely unparalleled customer service. The staff displays the kind of hospitality you would expect when visiting a friend's home.  They know every bottle they sell inside and out, and are patient enough to make well-considered recommendations.\n\nIt is better than CATS, people! We will go there again and again!\n\nps. our dog is as welcome as we are.", "author": "G Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "Jon was an excellent host and my husband was happy he was able to have a beer instead of wine since he is not a wine fan.  I had the eight leg syrah which was very smooth.  Great customer service!", "author": "April M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-06", "description": "I stopped by Swirl for a glass of wine while waiting for my dinner companions last night.  As others have already pointed out, Swirl is a wine shop with a small tasting bar in the back.  However, unlike other similar establishments, most of the people in the shop were there to taste rather than shop for wine, so I did not feel out of place ordering a glass of wine.  \n\nI tried a glass of the TreViti pinot noir which I really enjoyed - it was fruit forward, and I did not detect much, if any, oak.  The bottle of wine retails for $30 at the store (and on the winery website), and they were charging $7 per glass, so the mark-up on the glass was relatively modest.  \n\nSwirl carries wines from boutique/smaller wineries, which I appreciate.  They also stock a variety of hard liquor (for example, Hangar One vodka).  The shop isn't big nor the selection vast, but I think that the wine buyer has made some excellent choices.  I will definitely return for my alcohol needs.\n\nI think that Swirl is a great place to stop by for a glass of wine before a meal (I'm sure that whatever they are pouring is better and more reasonably priced than your wine options at your average restaurant in the Castro).  Also, if you're like me and like to browse wines, then you might enjoy nursing a glass of wine while you peruse. I would not, however, recommend Swirl as a destination for a night out because the space is small and the atmosphere lacking (again, it's more of a store than a bar).", "author": "Grace W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-22", "description": "I went here to meet some friends who were well into 3 bottles by the time I had gotten there. Not a wine bar but it will do the staff was pretty friendly so I bought  2 bottles trying to catch up with my friends. But they managed to stay one ahead of me the whole time.\n\nAverage prices hardly any seating", "author": "Kim R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-11", "description": "Due to recent football *ahem* upsets, I am considering new colleges to claim as my own.  As such, I visited Swirl on Castro with the Dartmouth Alumni Association.\n\nGranted, I was the guest of my friend, a Dartmouth alum, but I could tell everyone knew I was considering joining, regardless of what my degree says.\n\nBut Swirl, Swirl was a great venue for the tasting/alumni gathering.  Staff was friendly and good with pouring.  \nI've stopped in before to wander, but haven't actually purchased, so I don't feel comfortable giving a full five stars.\n\nI will be back though, especially when my budget allows more wine purchases.", "author": "laura g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-24", "description": "When I first came here, it was because I was waiting for my glasses to be fixed and cleaned from down the street.\n\nI thought it was just a wine store, but they have champagne and a wine bar as well.\n\nThe owner is extremely knowledgeable and helpful in purchasing champagne. I purchased eight bottles for a wedding gift, the owner shipped, and they arrived the day the couple arrived home from there honeymoon, as I requested.\n\nI have gone back again and purchased more. The experience was the same, efficient, leaving me with some excellent champagne for more myself and other friends to enjoy.\n\nAlso, I did try the wine bar. My friends, Matt and Tommy both decided to get there over an hour late, so they were unable to enjoy Swirls, as it closes at 8:00. This is my one complaint, but I do understand that the employees want to have fun as well\n\nGive this place a try, as it truly is a gem in the Castro District.", "author": "Christopher W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-28", "description": "Finally the folks who owned Friendly Spirits caved in, sold out and moved on.  In their place we got the tounge-in-cheek \"Swirl on Castro\" which completed a total transformation of the space.\n\nWalk in to the Castro's only international wine store with phenomenal staff and a great tasting bar in the back.\n\nUnlike other stores, Swirl will ship single bottles, which can be tedious at other stores.  All said, a great new addition  to the neighborhood.", "author": "Aaron G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-24", "description": "When you need some lovely wine or want a sampling in the 'Stro, Swirl is the way to go.\n\nThey have gift bags to boot which I usually stockpile at home, so when you have to make a last minute grab and want it to seem like your gift was well planned out, they've got you covered. Suffice to say, the staff is really pleasant and ready to help you whatever your shopping experience might look like.", "author": "Sean S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "Beautiful selection of wines with diverse price points, super friendly staff and patrons and comfortable seating for tastings. Swirl is a wonderful place to share a glass of wine with a friend and catch up. The hidden backyard provides a nice occasional escape from the store for dogs and humans alike. The staff is knowledgeable and engaging. You won't find any sourpusses here.\n\nWhether you're just getting your night started or keeping it low key, Swirl provides the perfect setting. I definitely want to attend one of their events and hope to in the near future.", "author": "Corey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-02", "description": "Get your twirl on at Swirl! Got a bottle of ros for the in-laws there because it had a cool drawing of an octopus on it (yes I buy wine for the label art) AND it was fabulous. Then I got some high class booze there and it was very well recieved by whoever it was I drank it with. Swirl has buttplug shaped tequila and the staff totally jokes about it! Nothing worse then somber liquor merchants. Except maybe sober ones.\n\nWell lit, clean displays, friendly service, clubby little wine bar full of intriguing people to get drunk with- er \"taste\" wine with, open later then 7pm on weeknights and a dog! Yay alky dog! They want you to go to rehab and you bark \"No! No! No!\"", "author": "Krismet C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-16", "description": "Thank goodness for a respectable wine broker in the Castro. Wine tasting is commonplace here, as is a nice social gathering once in a while. Browse through some of the choicest bottles in the state, and wander through the sublime garden in the back. \n\nIn so far as their balance goes, they poured lead on the red and went light on the white, but if you're a worthy lover of deep reds like me, this place will do nicely.\n\nThe only annoyance that I could possibly think of would be that terrible noisy racket that starts playing as soon as you hit their website.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-19", "description": "Just because it's on the Castro makes it more chic.\n\nThey have really nice decantors, the kind that you stop for and say \"ooooh\" while fogging up the glass.\n\nThey sell a sparkling rose called \"Sex\" that isn't bad and $16 not painful.\n\nThey do have a small bar of sorts with four chairs where you can buy glasses of wine in preparation of mounting the enormous hill to your residence.", "author": "Susan C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-10", "description": "I am fighting rating inflation on my reviews right now, so I'm going to start with 3 stars, but let me immediately prefix that by saying this place is a prime candidate for going all the way to the top.\n\nNot only was the bartender extremely down-to-earth (very important qualification in the hyped and rarefied wine critic world,) but their flight selection was clearly varied and interesting. Yes, the Shiraz labeled \"Layer Cake\" was a monstrously chocolatey mix of gob-smacking Aussieness, but hey, excess is not a mark of poor taste. It was a good match with the slightly more austere Nero d'Avola and Corbieres that ran alongside it in the flight.\n\nThe one other patron there was also fairly knowledgeable, so I take it that this is a place that is good enough to attract an discerning audience.\n\nIf there's any fault, it could be that they close too early (8pm) and have far too few wines (I would estimate the shelf space held a total of fifty wines in the 20-50 dollar range.\n\nI will definitely be writing more. Watch this space!", "author": "Sameer S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-09", "description": "This is the \"Cheers\" of the neighborhood, but since it's in the Castro they know more than just your name...", "author": "P J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-08", "description": "Swirl we did!  Don and I were at the Castro street festival and really wanted a glass of good wine, Sunday October 7th.  Low and behold we found ourselves right outside of Swirl.  We had talked about coming here several times...it was kismet.  We bellied up to the tasting bar in the back and spent a great time tasting individual wines and flights.  We met a wonderful lady who lives in the area and stops in for bubbly.  \nThe staff was friendly and very attentive, even though the place was hopping.  They even accommodated a couple of furry four-legged companions.  Since my husband and I have two such companions, we were happy to see this.\nThe wine prices are very reasonable.  The staff very gracious.  They recommended Zadin restaurant for dinner and were spot on.  \nWe will definitely go back and spend more time at Swirl.", "author": "Carol H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-15", "description": "Great selection of wine as well as specialty liquor.   It's nice to pop in do a little shopping and have a glass of wine at the tasting bar in the back.\n\nStaff are friendly and knowledgable.", "author": "Matt O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "I needed to find a gift for a co-worker who was leaving our company and, after thinking of several more creative and personal gifts that would have required more time and effort than I had, I thought that everyone appreciates a good bottle of vino.\n\nThe problem is, I'm no oenophile so I felt a little lost when I walked into Swirl.  Well, the man who helped me put me at ease immediately.  He patiently showed me several bottles in my price range and explained to me the differences and gave me some tips to value wines.\n\nWhile there, I ran into a friend who was enjoying a flight of wines and I noticed that a little crowd in the back was thoroughly having fun with their evening tasting.  \n\nI'll definitely have to return to take advantage of all the fun stuff!", "author": "Marcus C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "Great wine tastings especially on Friday afternoons. Great crowd with a wonderful staff and people present. Easy to talk with other people. They are very knowledgeable on their wines. They offer by the glass or flights. Seating is pleasant and encourages conversation. Its over by 9 so get there early to get the full experience! They have a great selection of wines and spirits.", "author": "Pierce B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-18", "description": "Never fail to have a positive experience at Swirl - either in the recommendations for vino or in visiting their sweet little tasting bar in the back.  \n\nMy only criticism - a quibble, really, and one which is so minor that it won't detract from the 5 stars - is that I would love if they could switch their tasting selections a little more often. Occasionally we'll visit WEEKS later and the same wines we tasted earlier are still there.  Other than that, this is a great wine shop/tasting bar.", "author": "Moira D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-25", "description": "Have I mentioned lately that my friends are all bad influences who like to make me do things I don't want to do, know better than to do, and all out shouldn't be doing? I haven't? Here are some examples: after work mani-pedis always turn into out-til-2 drinking binges, complete with dancing on bars, coyote-ugly style. On weeknights. A couple of hours at a karaoke bar turns into an afterparty at a stranger's house til 5 a.m. On a weeknight. A \"quiet\", quaint Sunday brunch turns into a morning hike up and down Castro, solely for the purpose of drinking. And drinking more. \n\nThis time I have a lot to thank my persuasive friends for. Swirl ended up being the best bad decision I've made! Sure I needed to get work done. Damn right I needed to clean my house. Most certainly I should have been at the gym. But instead my ass was comfortably cupped in a stool at a darling mosaic mini bar at the back of this well-stocked and well appointed shop/wine bar. The owner is amazing (though the other guy working there was questionable or maybe just having a bad day) and the  tasting menu is pretty expansive, considering the size of the tasting area and the fact that the focus really seems to be on retail, space-wise, anyway. I'm a huge fan of the current white flight but I hear the red is good too and you can pick and choose from the tasting list to put your own flight together. Or just drink a glass. Or four. Or five. Whatever you do, call me on your way. I'll meet you there.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-09", "description": "LOVE this place! Great to go and have a glass. Super nice people who know what they are talking about. I always discover a new wine to love when I go there. Try the Pecorino and you will have a new favorite white wine.", "author": "marc S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "This is my favorite post brunch spot.  We usually plan on only having 1-2 glasses of wine, but end up staying for more.  The staff is awesome, they are very friendly and they can help you pick out the perfect bottle of wine.", "author": "Mike M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-23", "description": "Who knew this was more than just a vino shoppe? I certainly didn't. I got the 'come join us' text from Bobby P., Nick R., and Aaron G. on Sunday afternoon and while enroute started to wonder, \"Why do they want me to meet them at a liquor store?\" In addition to a vast selection of quality wines, tucked in the back quarter of the space is a cozy tasting section with an attentive staff and a devilishly delightful canine employee called Reggie. I'll definitely keep this fun little sipping spot in mind the next time I wander towards the 'Stro.", "author": "Gregor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "My last review was over a year ago, and I still feel the same- very helpful & friendly but not in-your-face-pushy service.  Interesting  and unique selection (right now they are featuring Absinthe- cool gift idea).   Definitely a good place to select a gift or interesting wine for a dinner party.", "author": "Sonia S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "Swirl is a rather small spirit, wine & beer store.\n\nWith that said, Swirl makes sure nothing but some of the finest spirits, wines, & beers fills the available space..  Nothing is \"low-end\" about this place or the selections it offers.\n\nMost surprising thing about the store is the beer refrigerators at the back of the store.  It has one of the finest collections of beers from around the word.  It also carries a lot of great & hard to find Russian River Brewery selections.  It's one of the few stores in the city (or nation or world) which always has \"Pliny the Elder\" in stock.\n\nThere's always a decent crowd at the wine bar.  It's a true neighborhood store.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-20", "description": "Here's an update since I went back last night - Thanks Jerry for a great time. You and your staff... Kelly, Josh and Kenny's Twin (sorry I forgot your name) are always so sweet, helpful and fun!!!! Thanks to Jerry too for letting me buy the last bottle of Linne Calado - Kenny, Richard and I will definitely enjoy it!!!! See you soon!!!", "author": "Jodi B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "I came here for dessert and wine when my friend came to visit. The atmosphere is quaint and gave me a peaceful feeling.", "author": "Tiff W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "The best wine selection in the city!  I showed up on a Thursday night to buy wine and ended up staying for the tasting!  We had an amazing Argentinian Malbec and ended up buying the fabulous Diamond Vodka!  It's 4 times filtered through DIAMONDS!  Amazing flavor!  Love the shop, love the selection, love the staff!!  Thanks again!", "author": "Allen V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "I've only really been here a few times, as a patron of the \"wine bar\"(as opposed to the wine shop).  They have nice wines, the staff is really nice, unpretentious, and its not some big overcrowded wine bar, b/c its really a wine shop.  i will do more sampling there in the near future for sure.", "author": "M K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-03", "description": "This is an absolutely wonderful place to spend a weekend afternoon...and I have spent many of them there. Try the Cava or the Leticia; you will be glad you did. The staff is wonderful and fun. You can't go wrong at Swirl!", "author": "Tom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-26", "description": "great place here!\nwhile i don't go in often (not a huge drinker) the few times i have been the staff has always been super helpful.\nand they carry sofia coppola's \"champagne in a can\", which i love!  i bought some this weekend and they guy working was nice enough to put it on ice for 30 minutes to chill.\ndefinitely worth the visit!", "author": "M. B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-06", "description": "This place is a real gem.  It is a great wine shop with plenty of well thought out selections.  But the real reason I like Swirl is that it's a civilized place to get a drink in the Castro.  I'm starting to dread happy hours at Badlands but I still want to meet the boys (and girls) for a drink in the hood sometimes.  Swirl is perfect.  Always laidback, friendly service and a good selection of wines by the glass.  And their Thursday tastings are fun.  Reserve early or they sell out!  A very welcome addition to the 'stro.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-21", "description": "good selection of wine, I went here with some friends, I was with some ladies who wanted good Wine around the area, we end up here, we tried the 3 wines taste, really good, and the atmosphere was excelent. and need to say was cheap.", "author": "Rafael G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-25", "description": "Friendly, easy to navigate, Swirl is the opposite of an intimidating wine store.", "author": "Kiri H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-02", "description": "I can't say enough about this place. I wandered in to buy some wine for a friends dinner party and wandered out with 2 bottles of wine, 2 bottles of liquor and a warm fuzzy feeling. The gentleman behind the counter was exceptionally friendly (and has been every time I have been back). This is a great place to stock your wine rack and liquor cabinet. Sure, its not the cheapest place to buy alcohol, but the service is great and you're supporting a local business. Check it out!", "author": "Jamie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "For a while they had Sofia in the little pink can, which was divine to sip on the way out for the evening.  Very pretty store and pleasant staff.", "author": "Dwayne A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Now that I'm back in the 'stro and my old fave wine shop Urban Cellar went out of business, I need a new place to get the pretty bottles of vino. Hey! That's right, there's Swirl! And while I can't afford 90% of what they have on sale, there are usually several nice selections under 10 bucks. Most importantly for me, Jerry the owner consistently donates to community and HIV/AIDS causes. And, um, that's socially responsible capitalism and we love that!", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "i am not a big wine drinker... but stopped in here to get some champagne for a quiet new year's toast (just being superstitious and want to start the year out right). everything is so well-labeled and explained, which is good for people who are ignorant of wine. there were people who worked there helping customers pick out what they needed for their new year's eve. i was just stopping in, so didnt wait for help. i also didnt try their wine bar at the back, but looks nice if you just want a glass of wine with a friend. :)", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-03", "description": "This is a terrific little wine shop with a great selection. The wines are organized in a very customer friendly way, which is appreciated by those of us who don't quite know all their is to know about wine yet, but are working on it. Though I have never attended one of their Thursday night tastings officially, I have stopped by to grab a bottle on Thursday nights and everyone seems to be having a good time. In fact, on one Thursday, one of the customers attending the wine tasting took me under his wing and talked me into trying a Spanish wine that turned out to be delightful. I will say that I haven't been overly impressed by the helpfulness of the staff, but that seems to not be the experience of other reviewers, so maybe it is just me.", "author": "Claire B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "Swirl is a cozy getaway from the crowded and loud Castro bars. It is also one of the few places I found Paddy's for St. Patrick's.  It's a great place to enjoy a bottle with friends or find a gift for a party.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-06", "description": "I love swirl!  The staff is knowledgeable and the selection of wine is awesome.", "author": "D-E F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-07", "description": "it was a beautiful sunday afternoon and i had high aspirations to finish my work and studies.\n\nwell, after lunch that is, with a couple of friends. but after lunch, i definitely was going to study.....\n\nwell......after a quick stroll of course on castro street. hey! i never make it back into my old hood now that i live in the inner sunset, i thought to myself. quick stroll for a couple minutes....and THEN i will be a study MACHINE!\n\nwhoa. is this wine store new? my friend and i both stop. i choose to ignore the \"WINE TASTING INSIDE\" sign. we both peek in...bottles of grapey wonders surround with a cute mosaic tasting bar in the back. \n\n**having mental anguish. my gre book and a bottle of wine are duking it out in my head**\n\n \"should we go in?\" says friend \n\n--3 flights and a glass of wine later--\n\nwine:coffee::sleeping:studying\n\nso much for vocab. You've ruined me Swirl.", "author": "bloopie s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "My favorite small wine/liquor store in San Francisco.  I have a wine refrigerator full of their stuff and a small table groaning under the weight of the liquor I've bought from this store.  The staff is friendly and knows their stuff.  And they've got a great little bar in the back if you had a hard day shopping and want to have a glass of wine or have them pop open any beer or wine in the shop.  I've done that quite a few times.  Their beer selection is good, but doesn't change very often.  There's a great discount wine section in the back and lower priced items up front for everyday consuption.  While the back has all the best stuff.  On some Thursdays they have a tasting party that you need a reservation for.  I've been to two.  I'm a bit phobic about crowds so being mashed in with a bunch of people I don't know while tasting wine or beer isn't for me, but it was a fun experience and opened my horizons to other types of beer and wine I hadn't tried before.  I took home a bottle of my favorite Kasteel beer brewed with cherries today for a little day off treat.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-28", "description": "Jerry does a great job selecting an eclectic mix of wines. One recent discovery that is extremely tasting is a Spanish red called November 4 - clearly a great wine to celebrate Election Day!", "author": "Michael D."}
