{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "My favorite is the 雪菜肉丝汤米。(shredded pork with snow cabbage rice noodle). One time I even finished the whole thing in literally 10 min. If you order before 11:30am, you get to order from the Breakfast Special which means drink included!!! If you want to add anything for $1, I recommend adding an egg or a pan fried turnip cake.\n\nIf you don't add anything, it will cost only $7.25 including tip! The best!!!", "author": "Andrea T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Love their set meals especially the one with the cream of corn soup. So good. Their curry beef over rice and Portuguese curry chicken over rice is so good. Love it all with the dessert also whether it be the mango pudding or the herbal jelly.", "author": "Wesley K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-15", "description": "This place is alright. Has all of your basic HK style cafe dishes. Came here for dinner and go their special baked pork chop over rice. Comes with soup and a drink for less than $10. Got corn soup mixed with something that made it strangely sour. Pork chop was not bad, the meat was a little more on the chewy side but gotta love the rice and the sauce. I think they're better known for their congee. Might get that next time I come.", "author": "Tatiana T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-27", "description": "The Service here is really bad. I've never been so angry at a service before in my life. I came here to eat and my family and I are regulars. We've been eating here for several years already. Recently they would always give us attitude when we order and they also purposely try to get us to leave. And this one day we came in, and we were raising our hand to order and you could see her go to another table in which they did not raise their hands. And then, I let that go and shewent back inside, that was fine too. She made eyecontact with me and then she purposely ignored us and went to the table behind us even though they didn't even had their hand raised to order either. By now, it was obvious that she was ignoring us on purpose. Then I waited again, and this time I purposely said \"we're ready to order\" and then she said WAIT with attitude. At that instant I left. I dont know what type of attitude that is give your customers , who is also a long time regular. Never coming here ever again.", "author": "N S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "This place is very good for breakfast and afternoon tea! Great food, but slow service. The food is filling and especially with the milk tea that is included for breakfast, it bloats your stomach with carbs so that you will not have enough room to eat lunch. This place is 4 stars because the service is ok, because it takes a while to make the food and the waitress works next door at the sushi place because no overtime here!", "author": "Kevin R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "Love love love this place. T-28 has become a staple of mine whenever I need some comfort food around Taraval.\n\nThe selection of food is very diverse so there's something for everyone. The meal comes with soup at the beginning and dessert at the end which is a nice touch.\n\nService here is fine, I honestly prefer when the waiter/waitress leaves me to my food, but they're very responsive if you need something. \n\nFood comes out FAST and piping hot, and you get a ton of food for a great price.\n\nIf you're coming to T-28, I recommend the black pepper beef.", "author": "George K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "the service is very bad, waitress have unhappy and unfriendly face,when we asked for the small bowl she was without looking ,no eye contect ,and you didnt  know do they heard or not, you are hard working we are customer will see it ,tips will be more .", "author": "Sukhing M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-20", "description": "The food here is cheap and meh. It reminds me a lot of a HK cafe. It's not special, although my bf raves about the fried milk dumplings, which were too coconutty for me, but may suite anyone else. I got a macaroni soup with spam which was salty but not that flavorful. My bf's fried rice was pretty good and I think his friend enjoyed his food?\nThe service sucks. Like we came in and half the tables were covered in dirty dishes, but only an older lady made any effort to clean them AT THE END of our meal. The lazy young waitress just kind of sat behind the cashier doing nothing. Also, the waitress is kind of out of it because she took one of our dessert orders and then came back to deliver it and asked what my bf wanted for dessert. Even after we ordered, she never came back with the dessert. Yeah, I think she's a dunce if anything", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "I first came here back in 2005 and stopped after cause I always thought the food was oily. I came on a Thursday night for dinner just recently. I'm super surprised the food here wasn't too bad after trying it out. Of course I wasn't really looking forward to it, but like I said: surprised! They take card now too! \n\nTheir menu is easy to read and they have pictures that made the food look good. I ordered the baked black pepper beef with spaghetti. It's good and edible, I finished the whole thing since the portion isn't too big, yet I was hungry too hmm. They gave me a lot of beef, and I thought the beef was soft to chew and easy to eat! Sauce was mildly bland, although some parts while eating I could taste it. My friend ordered the baked fish with corn sauce and rice. Fish was soft and I thought this entree was so-so, wouldn't eat it again if I do come here again. Since I ordered from the specials, I get a drink and dessert too! For the drink I ordered iced red bean drink, NO too watered down and tasteless. For dessert I ordered pumpkin with sago and I must admit, this was pretty yums, though very little. \n\nFood came out fast and service was quick. The waitress did keep rushing us to order even when we just sat down for 5 minutes, whatevs. My only complaint is for baked items, the temperature is super hot when eating. I burned my mouth and tongue.", "author": "Vanessa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "Cute family owned Chinese restaurant, easy to understand menu, friendly and helpful staff, good vegetarian option! Must visit!", "author": "Kailesh I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-08", "description": "Your average Chinese comfort food place. Cheap food and large portions. \nCame here with family and the place was packed. When seated we were swamped with menus. There is a large selection of food selections and specials. When you get the lunch special it comes with a bowl of soup and a free drink. We ordered a variety of options: 4 fried rices, 1 beef stir fry noodles, 1 tomato pork chop rice, 1 pork stew, and 1 curry plate. The soup of the day was corn soup and everyone got diff drinks (soy milk, milk teas, coffee, tea, etc). Food was decent, nothing spectacular, and came with large portion sizes. What was disappointing was a take out box cost 25 cents as well as the bag. Service was slow when it was packed. This place is decent for lunch and comes with large portions.", "author": "Jeanette Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-01", "description": "The food menu is very weird, its based according to times and days...and if ure eating at the restaurant or not. For example, hi tea is 2.30-6pm and porridges are $4.75 if u eat at the restaurant, but if you take it to go, it's $6, they dont tell u that.\n\nOther menu are also based on certain times and days so it makes ordering confusing cause I came at 5pm today and certain food such as the chef special is not avail until 6pm....but I would say they have a variety of food, including fried milk! Heh beat that!\n\nI got the baked chicken portuguese with spaghetti special with soup of the day, drink and dessert. For $9.75 is not bad especially the portion is huge but i dont know why they charge me $10.\n\nThe dessert I got was mango pudding. Sounds appetizing but DO NOT ORDER IT! I repeat, dont order it! Bc it tastes so fake, like room fragrance and also floor cleaning supply. Yuck.\n\nAs for customer service, the lady who served me was nice, she had her long hair in a ponytail. Everytime I say thank u to her she say you're welcome. For a chinese restaurant, thats very rare right?\n\nTo go boxes cost 30cents each. Bring your own!\n\nI came in on a Sunday at 5.30pm and the place was half empty (or half full). During the weekday it's pretty empty so I wont say there's a wait.\n\nThere's restroom and they accept credit card, except for discover. Lots of parking.", "author": "Inez J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Dishonest store owner/staff\n\nMy review is directing to a staff/owner name \"Ah Yee.\"  She was our server and cashier.\n\nWe had a large group dining there 1 night and our total was overcharged because they claimed they \"accidentally\" charged an extra item.  None of us could read the bill as it was handwritten in chinese squeezed on a small paper and not itemized (good luck if you can't read chinese), we really couldn't check the math until we compared to their in-store and to-go menu prices (which they are different by the way).  I know they say they can change prices without notice but none of the prices seem to match ANY of their printed menus, it is my first time seeing that.  Plus they charge for boxes for your leftover and the box prices are set on the fly as well, they put signs on the wall for box charge, that also didn't match what they charged us, they said they can charge different prices on different type of boxes.  Moreover, they tax you on the boxes.  Other restaurants box leftovers and for takeout free of charge in bay area.\n\nThere are plenty of chinese style cafe options in SF, don't go here.  I don't like dishonest owner that nickle and dime you, and changes prices on the fly.  They need to update their menu frequently then.", "author": "Christine H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "This place pretty good.  I like there curry chicken wings . And the sizzling black pepper beef over rice . That must try.", "author": "sean c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-23", "description": "From one human to another, do not get the red bean milk drink. The milk is water and the red bean tastes like grass.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-12", "description": "Normally I don't really want to write bad reviews because no one is perfect. However, this restaurant is the worse restaurant I have ever been. Utensils are not just dirty, but have germs. Noodles are still stick together. \nIf you don't want to get any germs or get sick, stay away from this restaurant. \nGiving this restaurant one star is already way too much.", "author": "Bun -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "So far , this is the one I like the most , this one Hong Kong food style is much better than others!", "author": "Bing L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "Came back after a couple months hiatus. Customer service has gotten worse - had to ask 3 times for 1 glass of water.\n\nMy friend ordered a Sunday lunch special - the Steak with Black Pepper Sauce with rice. The steak was RAW. Look at the picture. They didn't ask how well done he wanted it (which isn't the issue) but it should either be raw or well done, not a mixture of both. No idea how he was supposed to eat that. I wanted to shove it back at the chef and ask him what the hell that was and it wasn't even my lunch.\n\nLastly, I ordered the Rice Noodle Roll with Combination Sauce and it came after everything else - 3 steaks, a wonton noodle soup, and a spaghetti. Not sure what took them so long...", "author": "Athena C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-14", "description": "Brought some salted fish and fried rice. It came with a side of roach. Very disgusting. I had to spit back out all the rice I just ate. Never going back here again.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Got the afternoon tea special--the beef noodles with a free drink for 5 bucks.\n\nOverall the food quality was pretty good--the lemon tea was ok, as was the beef noodles. Pretty much the kind of food I would be able to cook myself. The prices was pretty cheap. The wait staff seems to be pretty bored though. The interior is ok--basic \"canteen\" style seats and decor, pretty much the \"eat and out\" type of restaurant.\n\nOverall, a place to have a quick, cheap meal if you are having a busy day!", "author": "Henry L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "The food is pretty good especially the Unagi rice dish I ordered. It comes with soup and a small salad a dessert and a drink. The salad is pretty small and only has lettuce and 3 slices of cucumber with thousand island dressing. The Unagi rice is good. The Unagi is very fresh and the rice is soft. There is also one broccoli in the middle but I wish they would put more than one broccoli. The dessert is really good but the portion is small but hey this dish is only $7.25. The service is nice and efficient. I would definitely come back for more!", "author": "Carissa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "I finally found my spot for Hainan chicken rice, my holy grail of Asian foods. Outside of Singapore, I have never had such authentic-tasting, tender, not-overly-seasoned Hainan chicken. I am SO happy I have found a place that serves it with al dente ginger rice. The ginger-oil sauce adds so much life to the dish, I almost had to ask for more just so I could douse the rice with it.\n\nTheir Iced Coffee and Iced Hong Kong Milk Tea drinks were also on par with hawker carts in Southeast and East Asia. Not sure why there are so many poor reviews. This place is legit.", "author": "Fiona Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-06", "description": "T-28 is your average Hong Kong style cafe-- cheap comfort Chinese food and poor service. Mr. Dubs and I came in on a Sunday morning and we were surprised to find this little restaurant completely packed. We were seated promptly, but waited 20 minutes to order and another 20 minutes for the food to come out. \n\nWhen the food finally came out, it was actually pretty decent-- you can't really go wrong with ham & egg macaroni and  dumpling and rice rolls. \n\nDespite the long wait, I'd probably still come back to take advantage of their awesome breakfast deal. However, if you're planning to stop in for a quick meal, I'd think again!", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "Truly unpleasant place to eat.  The service is terrible, and the food is tasteless, very oily, and overcooked.   Waitress spends a lot of time chatting with her friends, and can't be bothered to take an order.   When she is isn't chatting with her friends, she tries to look busy at the cash register but is not really doing anything.  When the order finally arrives, it has almost a half inch of oil all over it.     I will not eat at this place again.", "author": "Yang Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-07", "description": "Price raised...boo.\n\nIt's now $4.75 for a breakfast entree and your choice of hot milk tea, hot coffee, or hot/cold soymilk. Different temperate drinks may add another $1 to your meal. It's also $1 more for the additional sides now like the rice noodle rolls or chinese donuts, looked like there were a few other options as well...but I didn't pay attention.\n\nThat said, even at $4.75, it's a steal. I love having the nice big bowl of porridge for breakfast. It was especially good today because I was feeling a little stuffed up from a cold. It's piping hot and definitely heats the cold out of you.\n\nTotal came out to $5.20 with no sides.\n\nCash only!", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "Dishonest.ordered the lunch special.was overcharged they did not even bring the soup.that was ok.it was only $2.then ipaid with a $20 and she came back with $3 for what should have been under $10 meal with tax.so check your prices and count your change", "author": "cc c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-22", "description": "Too much oil in their food. My stomach doesn't sit well with that. \n\nthe menu said crab roe fried rice but it is fish eggs. misleading and need to rewrite menu. the turnip cake is not pan fried enough. it was soaking in oil and I had to blot it with napkins to get some of the oil off. so gross. the curry fish ball noodle soup was okay. I didn't like the texture of the hor fun/rice noodle. the lemon tea was too sweet and was weak in taste. \n\ncash only place. I'm never coming here again. had stomach pain after eating here.", "author": "Jules L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Cash only, but its good, cheap Macanese/Cantonese dishes. Good for lunch and afternoon tea, they have all the classic Hong Kong breakfast items, like the macaroni soup, french toast, etc. Good sized portions, not the highest quality but it;s still a good place to satisfy your cravings.", "author": "Larissa L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-01", "description": "I used to come to this place every Friday because of the great portions and yummy flavor. \n\nUnfortunately, I will probably never come back again. \n\nThe service is not bad. The waitress was attentive(kind of).\n\nHere comes the food. I ordered their lunch special which was a seafood fried rice. It was disgusting. My rice was dry and spoiled tasting. There was no seafood and the eggs in the rice tasted like dry flakes of rubber. My rice grains were burnt and hurt my teeth from chewing. \n\nMy boyfriend ordered the curry hot pot. Also, horrible. The curry flavor was way off. Almost like the taste of sour milk. The meat was very low quality. Like the leftovers of someone else's meal. Very disappointing. \n\nIt's sad because I used to go here all the time.", "author": "Julia Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-05", "description": "The food is not as good as it used to be. The porridge is one of the best in town but I would not order any dish that contains beef.", "author": "Greg K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "I love it here! My go-to place for cheap, decent food. I ALWAYS get the iced lemon tea! \n\nCame on a Friday night, and instead of getting the usual \"daily special\", I got the chef's special for 3 people. It comes with soup and rice. I was surprised the soup didn't taste like MSG!! \n\nThe food came in less than 10 minutes. Good thing, cause I was starving! I ordered two clay pots (fried tofu with bok choy and eggplant with salted fish) and the baked chicken steak. The food was sizzling hot the whole time. Even after 30 minutes?! What legit clay pots! \n\nChefs special doesn't come with dessert :(! It's $1 extra.", "author": "Fanny H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-18", "description": "After a week of illness - fever, shivering chills, coughing up blood, I needed a hot bowl of jook (rice porridge) to restore my body and soul.  This bowl came out piping hot with bits of beef and a raw egg which I stirred into the near boiling hot bowl of rice soup.   I keep telling myself that this broth was hot enough to kill anything bad and properly cook the raw egg.  Half way into the bowl I start to notice a black bit of beef that was different in shape and color than all the other bits of beef.  The egg was now cooked and the jook looked like egg drop soup.  But that dark bit of beef came up again and this time it had legs.\nOMG\nOMG\nOMG\nI nearly threw up\nLike the raven from Poe\nNever more .", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-08", "description": "Nothing great, but that's what makes this place one of a kind.\n\nYou have the train tracks right out front. Windows don't seem to do much, nor does the foundation, so hold onto that coffee mug before it vibrates off the table.\n\nFood is good, cheap, and satisfying. No frills, just your basic hits like beef or fish with jook. Get a combo and do the milk tea. It's excellent.\n\nCarry cash. You know the drill.\n\nAnd while you probably won't be bringing a date here any time soon, it's perfect for those looking to hang with the locals - a perfectly functional, cheap, and traditional Chinese Sunday breakfast kind of place.", "author": "Anthony N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-15", "description": "Business trip. Breakfast for two about $24 with black coffee, would not accept credit card and would not give a receipt for me to get reimbursed. My breakfast had no flavor, my partner's was a little better. McDonald would be better for next trip and they take plastic.", "author": "Frank W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-01", "description": "I loved this place. Loooved. This was my go-to cute little cafe. I knew I could count on T-28 for cheap, amazing food, huge portions and good service. But I came here a little while back and everything has gone downhill. \n\nI arrived on a Monday afternoon with two other people and it was relatively empty. Normally, this place is packed with a huge lunch crowd. What happened? \n\nWe were seated quickly and the first thing I noticed was that they renovated. Okay, cool, that's fine. They now have a jumbo flat screen television and nicer tables. The waitress was attentive and gave us time. She didn't check in frequently but came quickly when we flagged her down to order. I got one of their lunch specials - spaghetti with pork chop, which comes with a drink, soup, and dessert. The others in my party got Hainan chicken rice and beef noodle soup. \n\nOn an earlier visit, we had ordered a great, sautéed noodle dish. It was huge and flavorful and delicious. We asked the waitress what happened to it, and she informed us that they reduced the menu. We asked if they changed managers and she said no. I'm assuming the subsequent reduction is quality is because they changed chefs...\n\nThe food came relatively quickly. That's where I was concerned. My pork chop and spaghetti were a bake. Bakes take a long time. (If you've been to Man Kee cafe and VIP on Broadway in Chinatown, you know what I mean.) So I was surprised when it came out as quickly as it did. \n\nIt wasn't bad; it had flavor, it came with lots of spaghetti and two large pieces of pork. But the pork was chewy and definitely overcooked. The soup it came with was bland. I also got a coffee milk tea which tasted like overly sweetened tea with honey and some dark coffee aftertaste. Not pleasant. You could choose between mango pudding or some rice dessert. We got the rice dessert (it came hot), which was good. Not too sweet and very comforting. \n\nThe Hainan chicken was dry and underwhelming. The beef noodle soup was good; nicely cooked beef and flavorful broth. But the broth was definitely full of MSG. The noodles were chewy but not perfect - it would have been better with a flat or thicker type of noodle. \n\nService was great, as per usual. But it can't make up for what's lacking in food. \n\nAll in all, I most likely will only be back out of convenience. Personally, I think Smile House up the street is better than T-28. Farewell, no-longer-favorite cafe. I'll just make the trek to Chinatown to get my fill of baked spaghetti.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-20", "description": "You can't really expect much of this Hong Kong style cafe that's pretty similar to any other. The service isn't particularly great, the food is subpar, and the only reason many people come is for the cheap prices and the breakfast/afternoon specials.\n\nThe food isn't very great in my opinion, as I always seem to have an upset stomach after eating here...The food is bland, everything is drenched with oil, and service is pretty slow. The only real positives are the low prices and the large portions.\n\nIf you're looking for a better HK style cafe with cheap and quick food, my suggestion would be to head over to ABC, Tak Kee Lee, or Lychee Cafe.", "author": "Aaron W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Love cheap Chinese eats! Owner is friendly. \nStaff is as you would expect from a Chinese restaurant: efficient.\nFood comes quickly.\nHappy hour menu available.\nGet a milk tea to compliment your dish.\nComfort food.\nWish they were open later, I would be coming for late nite eats, much preferred over ABC.", "author": "Veranna N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-19", "description": "It is a very traditional Macau restaurant. The environment is nice and the waiters are so kind. There are various kinds of food, such as noodles, rice and sandwiches. I ordered spam& sausage macaroni soup and milk tea. They are delicious.", "author": "Nancy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-13", "description": "Similar to HK Bistro, T-28 features a unique menu of all kinds of cuisines that don't usually relate to Asian food.  I've always been a bit wary to try it, but after a quick look at the menu (which is enormous and spans three different menus), the price was right and the dishes looked pretty savory.\n\nIt took a while to finally choose, but we ordered the pork chops with cheese and cream sauce and vegetable clay pot.  Both dishes were pretty good though the cheesy pork chops were a bit unusual in an Asian restaurant, but balanced each other out.  The soup that it came with was soul warming but had a bit too many little bones.\n\nService here is really bad mostly because there's only one waitress serving the entire dining room.  Prices are great though it can be confusing to decide which menu to order off of.  In my opinion, I feel like there's way too many choices and I wish they'd simplify their menu a bit.  However, it's a good deal and I will probably be back.\n\nFood: 7/10\n\nService: 5/10\n\nPrice: $\n\nAtmosphere: 6/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-21", "description": "After reading many negative reviews from many of my favorite yelpers, I was daring enough and wanted to check this place out for myself. \n\nWell, for a Hong Kong Café, this tiny cornered café is a bit run down and continuously busy, especially on the weekends. \n\nPeople were raving about the Black Pepper Chow Fun. And I ordered the typical ABC (American-Born-Chinese) dish for $6.95. The dish is not much of a difference from the ordinary Dried Beef Chow Fun from anywhere else. Just a ton of black pepper is sprinkled all over the pasta dish. The overkill of the amount of the black peppers killed the taste. Chow fun: http://www.yelp.com/biz_photos/TU6xwYgB3g56rgqHWhYhFw?select=C-pOzwLd9fbQMguPVrXG1w\n\nI also had a dish of Pot stickers for $5.00. The side dish wasn't too exciting nor all that either. Pot stickers: http://www.yelp.com/biz_photos/TU6xwYgB3g56rgqHWhYhFw?select=oTb3XUBz6q8G9hnUbzQp1Q\n\nAs I was eating my meal, many of the Sunset crowd was giving me dirty looks too, which also felt uncomfortable causing me to somewhat lose my appetite. \n\n\"I know I'm fine and divine!\"\n\nMany of the yelpers were right. Lesson learned!", "author": "Matt G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-27", "description": "I am their old customer. After they have remodel their store, all the menus and the chef have been changed. \n\nFood is expensive and price is pricey and the foods come out do not meet your expectation. They need to cook very delicious food in order to maintain their old reputation.\n\nMy stomach hurts as well. They might use the ingredients that have not put in the refrigerator and put outside so long.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "A small cafe with HK style service (no smiles but quick and efficient). Great place to get your  粥粉麵 fix. Good value - $5.25 for lunch special that includes a drink (milk tea, soy milk). Food is decent too. I would come back again.", "author": "Tina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-09", "description": "4 stars for their breakfast specials. \n\nI've only been here for breakfast. This is a go to HK breakfast place for me. I love their porridges and pork with cabbage vermicelli noodle soup. All their breakfast combos come with coffee or HK milk tea. \n\nI generally prefer milk tea. You can add condensed milk for an extra $0.25\n\nBreakfast combos are about $4 so two people can have a yummy and light breakfast for under $10. It's a steal.", "author": "Milly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-21", "description": "T28 is a Hong Kong style cafe but with a Macau twist. You can find some Macau specialties here such as the Pork Chop Bun and also several variations of Portuguese Spaghetti. While the food here won't blow you away (especially if you're comparing it to the ones you find at Macau), the prices at T28 will surely keep your finance grounded. \n\nWithin the vicinity of 10 bucks, you can get their special, which includes a soup, an entree, a cold drink (lemon tea!), and a dessert! Portions are generous. I usually take a small box of leftovers home. \n\nThe non-stop Chinese pop music in the background can get a little annoying, but that's something I can live with. If you're within range of T-28, I'll strongly recommend this over ABC!", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-16", "description": "Really crappy customer service at this place. Negative stars for having to seat ourselves, grab our own menus, and ask for the waitress to remember to give us the dessert for our set menu. I would've understood if it was busy, but the place was half empty.\n\nCouple the service with very bland, bland food. The words used to describe the taste of the sliced fish with cream corn dish was \"rubber bands\", the porridge wasn't any better. Go somewhere else.", "author": "Kevy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-08", "description": "This place has really slipped off last couple years. A lot of the items that made this cafe unique from other Chinese cafes in the area are no longer on the menu.  This past saturday i came to try their  traditional hong kong breakfast... the price is good, but otherwise i was thoroughly disappointed.  I ordered siu mai chun fun, and every single siu mai came apart as soon as i tried to pick one up using my chopsticks, and the meat tastes nothing like siu mai.  The best thing about the plate is the sriacha sauce.  Long wait to get seated, long wait for the food, and my table remained sticky after the waitress casually wiped it... and i had nothing to stir my coffee with, so i used my fork.", "author": "gswfan .."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "Overall this is same as any other Hong Kong/Chinese cafe in the city. But the one thing they do well, is their fried rice. Every day of the week they have a different type of special fried rice that you can order. It comes with HK style milk tea and soup. I love fried rice and their unique fried rice just kept me going back for more. I probably wouldn't order anything else on the menu, just because I did it once and it didn't wow me at all. \n\nWhat I recommend:\n\n-- Salmon and cod fried rice (which has masago in it also)\n-- Beef sung fried rice with fried onions", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "I was craving some steak the other day, but apparently chicken steak is the closest thing to steak in the sunset!  I called in for a to-go order, and by the time I got here 10 minutes later it was already waiting for me.  \n\nAt first it was really good, but then it just got too saucy and too much... and $7 something for a chicken steak is an alright price, but I guess I just wasn't feeling it too much.\nhttp://www.yelp.com/biz_photos/TU6xwYgB3g56rgqHWhYhFw?select=UIcMbnYoLotFc7v2PhE8ag", "author": "Liz W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-19", "description": "I usually come here for a quick dinner or when I'm looking for a late night spot to hit \nup. The prices are decent, and service is pretty quick. Their prices have changed a little bit, but overall, the daily meals are an awesome deal. Soup, entree, dessert and drink for under $8. \n\nI suggest getting the chicken wings and the rice rolls. Their best deals are the happy hour items, though!", "author": "Steph W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "Cheap food and delicious milk tea. Get their specials which come with soup, entree, milk tea, and a dessert. \n\nOpen late.\n\nGet the baked pork chops or baked seafood. My usuals.", "author": "Cicely T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "Lunch special\nEach day different comes with soup, drink and dessert. Most of the time I would order to go so it doesn't come with dessert but the food is still good.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-29", "description": "A convenient place for a hot bowl of rice porridge.  They've got specials between 8 am - 11 am for $3.75.  Add another $0.75 for a side item such as a Chinese donut or pan fried turnip cake which can be shared.  I like the hot steamed rice roll which comes with a mixture of hoisin and soy sauce.\n\nService is very slow and you always have to flag them down for your check.\n\nNote: cash only.", "author": "Shirley N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-26", "description": "4.5 Stars\n\n+ Excellent Service\n+ Good Food\n+ Inexpensive\n+ Clean\n+ Extensive Menu\n\n- Cash Only\n\nMy little sister and I came here for a quick bite to eat before going Karaoke last week. She has been telling me all these great things about this place (especially their fried pig intestines, and fried milk) so that was the main reason we visited T-28 that night.\n\nWe arrived around 8pm. The owner of the café quickly greeted us and sat us down in the center of the cafe. Upon serving us tea, he also gave us 2 bowls of \"woon jai chee\" (imitation shark fin soup) on the house. Very nice of him! (Really pays off to have such a cute and pretty lil sis wahaha X3) We also ordered the Fried Pig Intestines, Fried Milk and a Cherng Fun.\n\nI've never been much of a fan of \"imitation shark fin\" soup http://www.yelp.com/biz_photos/TU6xwYgB3g56rgqHWhYhFw?select=VBENRIts1cMrdodl1F0XRQ because most places makes them hella watered down. T-28 is different. Theirs is actually thick and flavorful and you can see the chunks of meat in them too!\n\nThe Pig Intestines http://www.yelp.com/biz_photos/TU6xwYgB3g56rgqHWhYhFw?select=iLdkHn7-ZEvladof0A4NSg comes with a side of pineapples, onions, and dipping sauce. The intestines are dyed red so it kinda reminded me of BBQ Pork. It's good but a bit heavy for 2 people to share.\n\nThe Fried Milk http://www.yelp.com/biz_photos/TU6xwYgB3g56rgqHWhYhFw?select=TdaGEf_PjNuNiFA85j2BCw was without a doubt the interesting one. I was very skeptical about trying it at first but lil sis says it doesn't taste anything like milk. Being lactose intolerant I try to steer away from anything with milk in it as I can. To my surprise, she was right. The Fried Milk doesn't have any bit of milk taste in it whatsoever. \n\nThe Cherng Fun http://www.yelp.com/biz_photos/TU6xwYgB3g56rgqHWhYhFw?select=0Oo2-qE9NE9mbR7_IJDI5w was also very good. Comes with extra hot sauce, peanut butter, oyster sauce and sesame oil. My favorite dish of the night, and also the most filling one.\n\nOverall, everything I've tried there was very good and I wouldn't mind coming back again.", "author": "Mona C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-30", "description": "I came here a week ago with my bf, we had an appointment close by after work and decided to come here for dinner. He picked the place.....\n\nFirst off, we sat down and the lady gave us a STACK of menus. I mean literally there was like 4 different menus... kinda overwhelming for a small cafe like restaurant. If you came here with no type of dish in mind... you will be screwed and starving because you have no idea which menu to look at and what to choose from.\n\nI ended up picking the 3 items for $19.95 which comes with soup and rice. I find this deal much better than their daily specials, just that the daily specials come with a drink.\n\nWhat we ended up ordering:\n\nBaked pork chops in tomato sauce: I was actually disappointed in this dish. I expected it to be baked, just like those individual baked dishes where the plate is piping hot and there is a baked crust on top. This dish was not the case. If you want a baked item, I would get the individual dish with the rice/noodles underneath it. There was no crispness to the pork and it wasn't actual pork chops, it was just cut up pork slices with white onions and tomato sauce. No bones, no crispiness, no crusty top from baking... oh so sad.\n\nBlack pepper steak: This was good with rice, if you eat this by itself you would think it is way to salty. Also, they are not kidding when they said black pepper steak. There was TONS of black pepper, and I am not saying it as a bad thing... just be prepared if you order this dish and you're not used to that much pepper. BF says this dish is awesome if you stir fry udon noodles with the black pepper steak... I must try that one day.. just not sure if this place does it.\n\nVermicelli with mixed veggies: a bit on the salty and bland side. I mean it literally is vermicelli with mixed veggies in a clear sauce (which could just be salt, water, and corn starch). \n\nAll three dishes, the portions were HUGE! I still had left overs for lunch AND dinner! Just too bad the dishes didn't taste all that good. Service was so-so. We got one cup of tea 10 mins into sitting down... and didn't get a second one till our food came out... uhh did she just noticed there was two people?", "author": "Erica T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-22", "description": "T-28, Corner of Taraval and 28th..  Open til all hours of the night, great for that late night craving you have.  They have great deals!  I have only been here 2 times.\n\nThis was my first foray into Macau cuisine of any kind.  My niece took me here for some rice porridge and some \"Porky bun.\"  Priced right for the students or budget minded.  Porky bun is a pork chop in a bun!  And it's a type of traditional Macau food.  They have others.  I did notice rather interesting travel posters plastered in the dining room.  It had some nice half curtains in the window.\n\nOn my second try, it was the porky bun again!  I guess, I will have to try something new the next time, I am able to get up there!\n\nIf you have a some time, take a chance on T-28, instant classic Asian Diner...", "author": "Clayton J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "I saw a group of 4 come in here for their prom dinner, how cute =]\n\nThe first time I came, it was way back when it first opened...or around that time and that was my first/last time here until today that is.\n\nDaily Specials are such a good deal here for only $7.64, & the PORTIONS ARE GINORMOUS. 4 choices of entrees to choose each day.\n\n7 of us came in at 6PM on a Saturday for dinner after a long day exercising & playing at the park, we were all starving. Good thing we came in around 6, because by 630 it started to get crowded.\n\nI'm not sure what other people ordered...noodles, but I had the Saturday Pork Chop with tomato sauce special with spaghetti. For less than $8 it came with A LOT of stuff...a drink (choice of soybean, tea, coffee...), I had soy bean milk. It came with the daily soup, which was cream of chicken & it had bits of corn. Finally dessert, either mango pudding or sesame dessert (gee ma wu), I had the sesame dessert which was a lot bigger than I imagined. It was good but I actually prefer the kind I can buy in packets from Sunset Super, those are sweeter. I had some of someone else's mango pudding, it was a lot smaller but nonetheless still good.\n\nFor a total of $50+tip, we all left really full. I would definitely come back for another daily special and next time it wont take years.", "author": "Kylie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "I love coming here early on Sunday morning for breakfast. Up until 11am, they serve rice porridge, noodle soups, macaroni soup, and other kinds of Hong Kong style cafe breakfast (even though they are really a Macanese establishment) for $3.75. You have the option of adding Chinese donut, rice noodles with peanut and hoisin sauce, or white radish cake for about an extra $1 while hot/cold drinks are an extra 50 cents! \n\nMy favorite is the salted pork bone porridge. So flavorful you don't even need to add extra white pepper. And their milk tea is super strong!", "author": "Liana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-13", "description": "Cheap, Hong Kong style plates. Service is okay. Food is okay. It's a good place for a quick meal.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-28", "description": "I've been wanting to try this place and the day i finally try it was because the wait was too long at kingdom of dumpling\n\nI regret coming here now because\n1. Won ton rice noodle soup was SO BLAND. soup was super, super hot and didn't taste right. the soup was not flavorful and bland as hell. the rice noodles were not the good type. Ive had superb rice noodles and these were not good. wontons were good tho\n\n2. rice noodles with peanut sauce, sirarcha, hoi sin sauce was ok. It was really watery around the plate and i've never seen that before\n\n3. portugeuese noodle soup - nice flavors but there is no meat at all in it. the sauce got boring really quick and i didnt want to eat anymore of it. \n\n\nThe service was holding it up atleast. The food we ordered was terrible", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-19", "description": "Came here the other night and they even stayed open later for us cause we had several people and it took longer to decide, order and eat than usual. They have a weekday special that has a few dishes to choose from and a happy hour menu with several dishes for a good price. The portions are also on point with the price. I had an order of deep fried chicken wings which were good and came out piping hot and a bowl of pork and aged egg porridge (both on the happy hour menu - $4-$5) and both were tasty. I'd come back for their specials and happy hour menu again.", "author": "Tiff C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-15", "description": "Horrible horrible food. What happened?? I used to love this place The wonton noodles were cooked too long. We tried the bento box. Never had a bento box with spaghetti as a choice. But the meat was good. They should add at least some veggies. The drinks were tasteless. Shame on them, to put a quote on the wall.. saying:\" If you don't visit first time, it's your lost!\"  Really? Definitely will not return.", "author": "The Black Cat C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-20", "description": "Best time to come here is early on in the day. Get one of the breakfast/lunch sets that will include some rice porridge, Chinese donut, fried noodles, and a milk tea or regular tea.\n\nPorridge is piping hot, not too salty, or MSG-ey. Mix in the donut (which is pretty hot and still crunchy), noodles, etc and it will fill you up like the Michelin man. \n\nI've been here countless times during the lunch hour, partly because of the quite inexpensive sets, and also the spacious booths where I can grade papers. But more importantly the food does bring me back. And if you haven't already noticed, the name of the place is where it's located.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "Cheap,tasty and fast. We ordered 8 dishes , shared it amongst us and  our bill was only 85 dollars.  I like their crispy noodles and fried rice.  The fried milk was good according to my friends but you have to have an acquired taste for it.  I personally did not care for it.", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-20", "description": "I'm going to have to up this place to 5-Stars!!\n\nGreat food!! Great prices!! And is very clean for a chinese restaurant!!\n\nTheir meals include a drink & dessert. Get the Milk Tea w/ Sweet Milk Syrup. 25cents extra...but it's worth it. Last time...it wasn't sweet enough after the sweet milk syrup was added. Next time, I would ask for it again, and if they charge me a 2nd time, I'll just pay 25ct less haha I'm such a cheapo.\n\nI always get the Back Pork Chop over rice...but this time I got the Portuguese Style Baked Chicken Steak w/ Rice. Yum!!\n\nMilk Tea w/ Sweet Milk Syrup\nhttp://static.px.yelp.com/bphoto/XLEU67j1tBh4fUWgmREbFw/l\n\nPortuguese Style Baked Chicken Steak w/ Rice\nhttp://static.px.yelp.com/bphoto/lQW3QQI2AQUMuOUnFc8jzw/l\n\n(Sunday, September 6, 2009)", "author": "Kenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-13", "description": "Breakfast is CHEAP! How else can you get a bowl of jook or noodles, a drink and a side dish for less than $5!", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-15", "description": "Came here with my boyfriend last Saturday around 10:30pm.  Other than the two tables leaving, the place was empty so it was kind of weird having the whole place to ourselves.  I was very happy to see that they had a happy hour menu with jook on it (my boss had recommended this place to me but she said that they stop serving jook after 11am).  Everything on the happy hour menu was $4.50 or less, which is awesome.  My boyfriend and I ended up sharing a sampan jook, soy sauce noodles and turnip cake.\n\nI loved the consistency of the jook (very thin and smooth) but it boggled my mind that they called jook with a few pieces of fish cake, squid, and cha siu (BBQ pork) sampan style.  Sampan jook is supposed to be seafood jook.  However, it still tasted good.  I now have a new place to get jook if I can't get all the way to Chinatown for it ;)\n\nThe soy sauce noodles were pretty good...flavorful but not too oily.  The turnip cakes were loaded with big chunks of turnip and fried to a golden crisp on the outside.\n\nOverall, pretty good homestyle comfort food = 3 stars.  However, the awesome prices earn it an extra 0.5 star = 3.5 stars overall.", "author": "Katelynn L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-30", "description": "Pros: cheap price with various choices for breakfast, lunch, afternoon snacks and dinner; quantity is large and some selected menus go with soup, milk tea(if you are not originally from Hong Kong or Macau, you might not used to their not-sweet-at-all milk tea) and dessert; you don't have to wait too long when you're starving.\n\nCons: parking; taste and food quality are of average, maybe a little below average, but to be fair, you get what you paid for.", "author": "J C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-08", "description": "Just when I thought I couldn't go any lower....\n\nJust when I thought I struck A$N AM GOLD at Tak Kee Lee on Noriega SF for within a $fiver (where you can't quite find value like this in the Peninsula)\n\nT-28 Bakery & Cafe (in reality, short for Taraval at 28th Ave, but in Chinese reality, T-28's Chinese name is Siu Fei Jeung (Canto) Xiao Fei Hsiang (Mandarin) literally meaning Disney's DUMBO, aka Little Flying Elephant, no idea why they named this place as such) goes even LOWER. Nobu K thought this place had something to do with a new version of Terminator. So yeah, N-31, T-28, S-69, no name sushi, nothing makes sense. \n\nT-28 offers a mini combo Ho' Ko' style brekkie with a slightly wider range of choices than TKL at $3.75 including a drink!\n\nSeveral varieties of congee or fish soup noodles (supposedly) for the Chinese side of the brekkie menu\n\nand of course the typical fried eggs, bacon, sausage type western style breakfasts bladitty blah blah.\n\njust a little bit more variety than Tak Kee Lee.\n\nSo I opted for the most unique and representative of Macau Cantonese...\n\nand got the salted pork bone congee. It was actually small pieces of bone in pork rib, brined and preboiled (or pre-steamed).\n\nFor $0.25 more I could add either a fried dough stick (cruller) or steamed rice roll crepes (cheung fun).\n\nThe congee was on the watery side, but hell it's cheap can't complain. Had it been thicker and creamier, would've been great.\n\nThe steamed rice rolls/rollades/crepes weren't even from Hon's, but some other generic brand off the supermarket. They put very little effort into providing additional sauces (just hoi$in sauce....). I guess you really do get what you pay for (Tak Kee Lee gave me peanut sauce, soy sauce, splash of oil, and hoisin sauce).\n\nAnd now drum roll please.....\n\nthe hot Hong Kong milk tea\n\nI must say it was quite the disappointment. When T-28 first opened oh about 7 to 8 years ago, it was packed to the gills. The menu actually at the time listed this drink as pantyhose milk tea (using the original nomenclature of this drink). Of course they didn't use pantyhoses to strain the tea leave mixture, but some cheesecloth type thing that stained from the tea and water. Back then I remember this drink being real smooth doing down the pipes. \n\nYears later something was missing. I cannot put my finger on why. \n\nThe iced version was worse...could hardly taste any tea, and it was mostly condensed and evaporated milk flavors, with a hint of sour. This leads me to believe that whoever was doing the tea brewing slacked off, and didn't allow the tea mixture to properly cool down, or the tea \"pulling\" process (where the brew needs to be poured between pitchers back and forth to ensure an even mixing of tea and hot water) was shortened and/or not done enough or done right.\n\nConsidering the competition in the outer Sunset, I'm surprised this place isn't any better. But the locals still eat it up, like that father and daughter, this guy who appeared to be a regular, and this young Japanese married couple. Cheapne$$ and value does not discriminate. \n\nBut bottom line\n\n- T-28 is becoming less and less Macau style Cantonese and more like a typical HK style cafe with a few snacks found in Macau, but nothing in the way of brekkie fare (other than this salted pork bone congee which was a bit of a flop, but cheap)\n\n-Noriega seems to have it better for Ho' Ko' brekkie fare.", "author": "Ken K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-04", "description": "What can I say about this place, except that it's pretty darn cheap whenever you decide to go.\n\nBreakfast, about $5 gets you porridge, your choice of \"side\" (chinese doughnut, soy sauce noodle, pan fried turnip cake, etc.) and a drink. \n\nThere is a long list for lunch and \"tea time\" deals as well that runs around $5.\n\nAnd for dinner, they have specials like 3 entrees for $20 and other such things, comes with dessert too!\n\nThe food is pretty average and the service is whatever but for the price, I guess so!", "author": "Wilson T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-07", "description": "Some of the stuff on their menu is good, and some are so-so. I have tried some of their baked meet with rice dishes and they are pretty good overall. They come at a cheap price and the portion is huge. Something that a bit different is their deep fried milk. I was skeptical in this dish and wondered how they would deep fry milk. It came out looking like an asian twinkie. It's crispy on the outside and milky in the inside. \n\nSomething that disappointed me was their wonton soup. It is so easy to make yet the ones here contained a foul taste too it. \n\nI wouldnt mind coming back here for some of the dishes.", "author": "Benjamin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-11", "description": "The quality of food isn't that great but man do you get the bang for your buck. I suggest coming here with a chinese friend because it helps a lot. I spent more time trying to decipher what it was they were offering especially their daily specials. I suggest getting anything with the portguese sauce because you can get the others anywhere else. You definitely get more than you pay for. I came in hungry and came out 2 lbs heavier and in a massive food coma.", "author": "Nam T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-18", "description": "I used to frequent this place for a weekend lunch with family because the food is cheap and a bit unique, but the service attitude from the waitresses were consistently horrible. I have not made it there for several months. I live nearby so I drive by almost daily basis and the place hardly has any customer nowadays for last few months. Other eateries nearby have weekend crowd but not this one. I am afraid to go there now. If anyone has any recent info why there are hardly any customers, please share.", "author": "William L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-28", "description": "Food is cheap here, if u only want cheap food to get full, here is a good place! Their meal is only $8 including soup ($0.5 extra to sub with fin soup), main dish , and dessert! Food is okay with this price, what can you expect !!!!!\n\nEven cheaper from 3 to 5pm and after 9pm.\n\nDO NOT order ice milk tea here !!!!!! Taste no good !\n\nI will still come back for cheap food!", "author": "Lam K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "I love T-28 bakery and cafe. I go with my mom all the time and we always order their baked house portuguese porkchop with rice. Although it takes a bit of patience for their baked saucey dishes, it's worth the wait. In addition, their weekday specials offers drinks, soup, and dessert with your entree.(Their corn chowder is really good) It's so cheap here too! I highly recommend this restaurant!", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-23", "description": "Typically when I'm in the city, my sisters and I have breakfast at Noah's Bagels, but recently they found out that T-28 offers breakfast specials for $3.75 which includes a complimentary drink, so we went there this morning to enjoy some Hong Kong style breakfast. \n\nIt was quite difficult to select something on the menu since there's 10+ breakfast specials to choose from. Ultimately I ordered the cilantro fish porridge and a coffee milk tea. We were able to get our food within 10 minutes of ordering and it was quite tasty and the portions were just right! The fish was seasoned perfectly and the porridge wasn't too thin, just the way I like it. The cilantro is only a topping so it wasn't bursting with aromatics but it was a nice touch. \n\nWe were there around 9 and luckily we didn't have to wait. My sisters said it could get really packed, so I guess it varies. I wouldn't mind going back for good, cheap, filling breakfast again!", "author": "Diana C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-22", "description": "Not bad since the last time I was here which was since they first open, The food is a bit more decent, and now they have daily specials with more choices then just locking you into just one meal which is good, plenty of options is always great, and now you get to subsitute your soup with fake shark fin then their daily special soup which was today for me was cream of corn. Not bad. Had the baked pork chop, took awhile but definitely creamy and tasty as well. \n\nPrepare to eat in and finish because they do charge a small fee for the take out box. Cash only", "author": "Linh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-22", "description": "Do you know where Macau is?  Neither did I until recently.  I heard about it and the tasty sounding food that they are supposed to have there.  You know, Portuguese mixed with Chinese, etc etc.  How can you go wrong with Chorizo sauteed in soy sauce and hoisin?  Maybe a little chile oil to make it pop?\n\nGiven that I've never had Macanese food before I have very little to compared it to.  That being said, I wasn't too impressed.  It was tasty, but nothing amazing.  The Pork Chop sandwich was fair.  The roll was super dry and really didn't add anything.  The chop itself wasn't too fatty, but it did have a huge bone in it, which made eating it a little cumbersome.  \n\nThe Spaghetti with tomato sauce and chorizo and shrimp didn't taste like anything exotic.  Kind of like tomato beef chow mein from any variety of Chinese restaurants on Irving, Taraval or Clement.    The traditional rice noodles with mixed sauce was also disappointing.  Kind of gummy and totally relying on the taste of the soy sauce, peanut sauce, and plum sauce carefully portioned around the plate, surrounding a healthy helping of the noodles.  \n\nThe service was great though so they get a solid yelp for that. And there were a lot of people there, so maybe I didn't order the right thing.", "author": "Adam E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-20", "description": "Service: 3/5\nFood: 3/5\nWait: 3.5/5\nPrice: $\nPresentation of food: 3/5\nPresentation of restaurant: 3.5/5\nOverall: 3/5\n\nI always order the Cream of corn Pork Chop with Spaghetti, sometimes Rice. Their Lemon ice tea is pretty damn good, but its waaay over priced. But they are starting to do this \"Special Combos of the day\" type thing, which comes with soup, main dish, and dessert + drink for like $12 i think? So thats not too shabby.", "author": "Eva H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "This is another Hong Kong style food place, they're pretty cheap, especially during happy hours. I've gone here a couple times, I usually get like the Macaroni with spaghetti sauce, this time I went I changed it to noodles, which is still good! :) It's pretty cheap eats, nothing to complain about. The food came out FAST, like there weren't anyone to be served, but it was a full house!\n\nCustomer service is pretty good and they're clean!", "author": "Danny W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-17", "description": "The food was just ok at best. Ordered from their lunch special. This place used to be cheaper with better tasting food a few years ago. Now it's just meh. If you do come here, order from their lunch special, because the other dishes there just aren't worth it.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-11", "description": "Came here on a late afternoon for some food--it was quiet. There were only my family and another table seated. We ordered the afternoon tea special...sounded pretty decent for $4 to $5, you get food and drink (cold drink +$1)...typical and fair enough. \n\nThe food was just okay. I had the macaroni soup with sausage and spam. It was loaded with what felt like never ending macaroni, but geez, it was oh so salty. My siblings got eggs and sausages; man, those were filled with grease. \n\nAnyways, the service was terrible!!! First they messed up our order. Second, we asked for hot water and it never came. Third, when I try to get the waitress' attention for the hot water and bill, she was busy talking to the back staffs. Fourth, when we asked for the bill, they charged us more than what we had....continue on...\n\nWhen we got the bill, it was over-charged. We studied it before we asked her to come over and found that she charged us for the wrong order she gave us and that was more expensive than what we had ordered. We told her the bill was incorrect and was more expensive than what we ordered, and instead of looking at the bill first, the waitress just said because we had cold drinks. And then when my mom was trying to explain to her we actually only got 3 cold drinks and 1 hot drinks. The RUDE waitress grabbed the bill and started to explain how she calculated OUTLOUD in front of the other table of customers. After that, she ignored my mom and she asked me if I get it? I said yes, and then go on explaining why I think she calculated wrong, and then she straight up cut me off, made an annoying noise with her tongue and said  \"you don't get it\", and explained herself OUTLOUD again. WTH?? Uh...why won't you let me talk. Not only did she not look at the bill, she kept thinking we got it wrong instead and felt annoyed by it when we should be annoyed. It's not that hard, but the whole time she thinks she's right--and the way she handled the situation was super rude and unprofessional.\n\nI will never go back again.", "author": "Mandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "I come here all the time to pick up food after work. I always call in my order and it usually is ready within 10 minutes. I am absolutely addicted to their baked pork chop over rice! Yummy. I used to really like eating at ABC but over the years they've changed. T28's baked pork chop is way better. I also like their Macau porky bun, their pork is always really tender. \n\nThey also have a bunch of specials depending on the time/day you go. Usually comes with soup and dessert as well.", "author": "Cara N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "Fried Milk Dumplings FTW!", "author": "Joshua P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-17", "description": "Since this place is right around the block, I go here with my dad or friends whenever we don't feel like cooking. For the most part, I would say the food is pretty good, nothing to rave about, just your average americanized chinatown styled food. For being in the sunset district, I would say this place has pretty good deals. They also have really good portions. I've never finished a meal from here. Most of their noodles and rice plates are 7 - 10$ which is pretty cool considering the large amount. The only thing I dislike about this place is that even on a empty day, their meals are a  20-25 minute wait and you get the plates at different times. It really sucks when all your friends who ordered the same time as you are already eating and you still didn't get your plate, then after 20 minutes your plate finally arrives and everyone else is done....", "author": "Cindy L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-17", "description": "We found hair in our food oh and my Spam looked like it was moldy. That's enough for us to never come back here EVER!!!!!!!!!!!!!!!!", "author": "selina n."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "I came here for some rice noodle and pork and suet choi and it was okay. The pork was a little fat, but not too fat. I like the service. The hot noodles and the cold weather that day made it alot more merrier. The Beef chow fun is also good.", "author": "Selby C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-25", "description": "This place isn't that great. The food is OK and the price isn't that great. But then I can say the same about the tables. They wipe it down with a wet towel that never gets washed. \n\nThis place is good, when you are just feeling lazy to cook.", "author": "M C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "Not sure what people are expecting when they come here but there's at least two things they do better than most others - tomato sauce w/pork chop and/or chicken AND the black sesame dessert.\n\nTomato sauce with pork chop is a quintessial hk cafe dish. Every place does it slightly differently. These guys do it with a smoky sweet tomato sauce that just comes out perfect every time. It's also beautifully executed with pork that's never overlooked topped with just the right amount of sauce.\n\nAnd if ordering the combo, pick the black sesame dessert over the pudding. It's a better value and hits the spot every time.\n\nAnd the soy milk there are made on-site I think. Always a winner.", "author": "E L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "If I want cheap chinese cafe food, I'd go here!", "author": "Cynthia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "For a couple of days while I was in San Francisco, I went to T-28 for breakfast before heading out to explore the city.  T-28 is the quintessential neighbourhood Hong Kong style cafe, serving local residents in the mainly Chinese area.  This restaurant also serves some Macanese cafe dishes also, and I'm guessing by the pictures of Macau hanging on the walls, the owners may be from Macau.\n\nOne morning, I had toast with condensed milk, and the other morning, I had Pidan Shourou Zhou.  The toast with condensed milk is basically just that - toast lathered with condensed milk.  This is a Macanese specialty and is always delicious.  Pidan Shourou Zhou is congee with \"thousand-year egg\" and lean shredded pork.  This is a very very common Cantonese breakfast.  Both of these dishes were good, but when compared with other places I've had them, not exactly exceptional.  Three stars.\n\nFor those of you who don't know where Macau is - it is a smaller city just about an hour-long ferry ride from Hong Kong across the Pearl River Delta.  It is a big gambling city and it was a Portuguese colony for 400 years until 1999.  There is some unique architecture and also some unique cuisine, but the biggest attraction is still the gambling (and of course.... everything else that comes with a gambling city...  use your imagination).\n\nAnd now, Wikipedia links.  Because I always seek to educate.\nMacau:  http://en.wikipedia.org/wiki/Macau\nPidan, or thousand-year-old egg:  http://en.wikipedia.org/wiki/Century_egg", "author": "Radford T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-15", "description": "=T-28 Bakery/ Cafe=\n\nIt's a pretty small place. The food was so-so. The portion was huge on my order. I went here with my friends and two of us ordered the Pork Chop with spaghetti with tomato sauce. The sauce was a little thick and didn't have that sweetness that tomato sauce would have. Not sure what it was. The pork chop was fried and it was tasty however. It was a lot of food. The meal came with a minestrone soup type, which had the perfect flavors. Our desert was mango pudding. I wouldn't have the mango pudding again.. It just didn't taste right. The mixture wasn't mixed fully because the bottom had some powder texture.\n\nAll in All, I'm willing to come back again to try other dishes. Nice little place.\n\nPS: Their cold Lemon Tea is GOOOOOOOOOOOOOOOOOOOD!", "author": "Christopher J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Knowing that this cafe had some bad reviews and from my friends great experiences, I hooked myself up to this place and not regretful that I did. I ordered some Macau style food and some American sided food: dumplings, soup, chow mein, and some sweet and sour appetizers. Aside from being cheap, clean, and it's friendly services, it tastes unique. I have been coming here for over a month and my only negatives are: porridge can be sometimes bland, restrooms can use more light, and seats to sit when it's packed. Overall, very enjoyable and I hope to see some fellow yelpers enjoying.", "author": "John W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "It's average/good and cheap.  It's like any other asian cafe.  The food is average to above average.  Good place on a really busy night where everywhere else is packed.", "author": "Gilbert L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-28", "description": "Nice decor, pleasant service.\nThey specialize in H.K.and Macau food and snacks and it was tastey and a deal.\nafter 3pm , you can order various little snack specials. My friend and I ordered the pork chop and bun, comes with your choice of coffee, tea, or tea/milk. It came just like they said : a good sized thin pork chop, seasoned with garlic/salt and a decent sized sweetish bun/bread roll. \nWe just made a sandwich out of it and enjoyed. $3.95, how do they make money? \nDon't know what lunch hour is like, but this place is ok.\n \nSome of the other goodies on the menu are typical Hong Kong inspired versions of Euro/American fare. I like this place and will return often. Parking: ok, but you might have to walk a minute or two.\nModern looking decor, big screen T.V.'s.", "author": "Bert K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-22", "description": "I came in here one morning to have breakfast with mi madre. I was looking forward to some Hong Kong style breakfast, but I guess we came in too late (11AM) since they switched the menu to lunch already. They have different entree specials every day of the week, which comes with a hot drink of your choice, soup of the day, and dessert.\n\nI ordered the minced beef with egg over rice since I haven't had that in awhile and it happened to be a special that day. My soup came first and it was alright, nothing too special about their russian borscht. Then my entree came and it was a huge portion! I thought \"wow, definitely worth the money!\" so I start to stir it around to mix everything together. Lo and behold, there was a long strand of black hair running underneath everything! Disgusted, I told the server about it and she took it back. She brought me back another one in a bit and after losing half my appetite already, I couldn't really force myself to take more than a couple bites. It was kinda weird too because I don't ever remember the sauce for this rice plate to be .. sweet.\n\nI think I'll stick to Tak Kee on Noriega from now on.", "author": "Joye C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-24", "description": "The beef chow fun (dry style) here is soooo good.  And they give you a huge heaping portion of it.  I also come here for their rice porridge.  You get a good amount, and it's full of shredded pork and preserved duck egg.  They certainly don't skimp you on the portions or the ingredients.  I think T-28 is my restaurant of choice for those two dishes...they have the best beef chow fun and pork and preserved egg porridge in SF.  And to top it off, this place is cheap!\n\nThey also have daily specials, but I usually don't stray from my 2 dishes.  I've also gotten the chicken fried rice a few times, but i'd say that the chicken fried rice is average at best.", "author": "Tyler C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "Before I start my review I must tell you all to try their Fried Milk. I thought it was good and kinda orgasmic (that's right..I used that word)...ok maybe not THAT orgasmic, but still good.  It's delicious when its fresh & hot so don't wait too long to eat it cuz it gets soggy fast.\n\nANYWAYS, I've actually been to this cafe before long long time ago in a galaxy far far awa-- nah im not going that far.....when the name was like White Elephant or Flying Elephant or something that to do w/ Dumbo, but anyways this place has turned into T-28 Cafe where you can get bakeries, dessert and oh yes HK Style Cafe rice plates and even restaurant style dinner where you can pick 2-3 dishes. \n\nThe place is nice, but it annoys the hell out of me when flies start drag racing around the cafe like fast n the furious.  My friend commented on their variety of color coded menus which he thought it was confusing cuz he doesn't know which to choose, between the daily specials, regular menu or the happy hour menu.  All items are relatively cheap and serves decent portions.  Decent? what the hell am I saying?  It's big! (NOT what she said) Shoot I'm a big guy and I only finished half the plate.  Not to say the food is bad, but the portion is overloaded and packed with starchy rice.  (BTW I had their daily special Beef Curry)  The dish was good, can't say great, but its HK Style so its pretty much the same. Maybe my palate is screwed up? Who cares...it's filling.  Totally worth my dollar and dime and maybe pennies.  Definitely a good place to go back to once in a while, it's a good place to hang out w/ friends who's on a budget & craving for filling and not so traditional Chinese food.", "author": "Willis L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-29", "description": "This place is seemingly always crowded,  but I have no idea why.\n\nI came here previously on a lunch break from a former employer and was given only half an hour to eat. I was glad that they were speedy in making my won ton noodles. However, their food was only mediocre at best.\n\nI went back today and tried out the fookien fried rice, singapore noodles, minced beef with egg noodles and beef chow fun.\n\nThe fookien fried rice was tasteless and bland, a real disappointment. If you're looking for good fookien fried rice, I suggest sun tea restaurant in noriega. \n\nThe singapore noodles was alright, but nothing spectacular. It was a bit on the salty side.\n\nThe minced beef with noodles tasted like chef boyardee. No, really... It was runny tomato sauce and frozen veggies. They also decided to throw in hot dogs... Wtf! \n\nThe best dish on the table was the beef chow fun but the beef wasn't tender but rather chewy. The noodles weren't bad though.\n\nAll in all, I wouldn't go back because the food isn't worth the wait nor is it worth putting up with the annoying patrons and the rude waitstaff.\n\nThe waitstaff is even worse than your stereotypical chinese restaurant. She didn't even know her own menu and squawked at us while we tried to order. She never smiled once nor did she show any kind of decency. \n\nThis place just isn't worth it. Avoid and spend your money elsewhere.", "author": "Christina B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "The name T-28 just for their location (on Taraval and 28 Ave). But the Chinese name is something like \"Little flying elephant from Macau\". A typical Hong Kong - Western style cafe. The foods have the Portuguese mix since it's from Macau. It's always packed on Saturday and Sunday morning. Always like their daily special either on:  breakfast, lunch, late afternoon tea time, dinner or the after 9:30pm. You pick a set combo from the menu's list such as A, B, C, D, E...etc. Their shark fin soup is really delicious (of course it just imitation made from cellophane noodles, with mushrooms and pork).", "author": "Allen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-21", "description": "Honestly, if you're expecting five star quality food, you probably shouldn't be walking in the door.  It's a Hong Kong style place, your Macau dishes, baked dishes over spaghetti or rice, sprinkled in with your typical must-have in any Chinese restaurant staples like chow fun, chow mein and fried rice.  Late night and mid day specials make it cheap and it does the trick, just don't expect much.  Food is OK.  Service is sort of what you should expect.  The chicken wings used to have a lot more of the red fermented beancurd taste, now it's barely there, but the wings are hot and juicy, so there's that.   Again, nothing is going to blow you away but you'll go away full and your wallet won't be crying after.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-01", "description": "I gots me a lunch special with soup, entree, drink and dessert.\n\nIced Milk Tea. It was pretty good, but I wished it was more bitter and tea flavored than sweet. \n\nCreamy Corn Soup. Pretty good, it filled me up pretty quick though I think because it was so creamy and heavy. \n\nPortugese Chicken Curry. With side of spaghetti. WAY better than the one I had previously at Shooting Star Cafe. This one was definitely more flavorful and tasted even better as leftovers. Om nom nom. I actually ended up taking most of it home as leftovers because I ate my friend's crab and fish fried rice instead. One critic I must add though is that I think they used the frozen drumsticks to make it because the texture of the chicken meat was a little different. \n\nCrab and Fish Fried Rice. With Roe. Pretty good, you could actually see the roe in it. Although it is a bit on the salty side. \n\nI didn't end up eating the dessert that came with the set because I was too full but you get to choose between a mango pudding and something else I can't remember.\n\nOne of my other friends actually said that this place used to be even better, unfortunately I may never know how good it was before. SADFACE.", "author": "Constance C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-04", "description": "Looked on yelp to see what's opened late (10:00pm) around the sunset area and T-28 popped up. Drove all the way here to find out that they're closed, but on yelp it said that they're opened until 12:00am. I understand if a restaurant closes 15-30 minutes early but 2 hours?! Won't try to come back here.", "author": "Li Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-11", "description": "The food is ok, but the waitress had very bad service. \nOne of the waitress was so rude. She yelled at us when we tried to ask something politely!!! I can't believe people have bad attitude like that. No sevice at all.", "author": "DS T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-02", "description": "Great porridge, especially when it's raining and late!\n\nNi how ma, baby!", "author": "Fourty F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-16", "description": "Just because its crowded doesn't mean its necessarily good applies to this spot in the Sunset!!\n\nSo went to T-28 Bakery and Cafe recently and I have to tell you I had really high hopes for this place.  Whenever I have passed this place it is usually very crowded.  So when the craving for Chinese came I went.  It was not what I expected.  First the menu was confusing and huge.  Filled with lots of things I had either never heard of or a combo of American and Chinese foods which confused me.  I just wanted some good Chinese!  So I saw a curry beef hot pot on the menu and said yeah that sounds yummy.  The beef was so chewy I could not break it up in my mouth and the fat overpowered the meat.  I was not happy.  The flavor though was good and I wished there were more veggies in the hot pot for sure, but the beef experience left a really bad taste (literally) in my mouth!!\n\nI am not sure I will be going here again anytime soon.  I believe the reason people flock here is because of the jook and the fact that this place is cheap (which now I know why...), but just because its cheap doesn't make me want to go again.  I may give it another chance in a while, but for now I won't be flapping my wings in their direction.", "author": "Heidi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "I like this place. I will have to try the porridge everyone is raving about....\n\nI usually get the baked chicken steak w tomato sauce. Yummm! Though i NEVER finish it. The beef chow fun is good also (one plate is enough for 2 people. it is a large serving). The cold honey lemon is good (dong ling mutt). Service is OK, food is good, drinks are good, and they have a poster of my pageant in the front! Two thumbs up!!", "author": "Linda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-08", "description": "I went here for lunch on Sunday and noticed the imitation fin soup is now $3.75, up from the $3.50 which I quoted on a prior review.  It's still a good deal.  Though it may be a bit higher than getting it at a dessert place (notably Eggettes and 37 Degrees), I think it's better tasting.  There may even be edge as far as the size of the portion.  I've gotten to think that, since they open until midnight every day (except for Tuesday, the day they're closed), I can opt to come here for that as dessert than the other two nearby places mentioned (though since it's waitress-serviced I'd have to leave her a tip).", "author": "H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "No matter how mediocre the food might be sometimes... I just can't stop coming here. This has become my go-to stop for cheap, satisfying food, at almost any time of day (they are open late). Great deals here at almost any time of day.... and believe me, I love to come here late.\n\nMy favorites are: any of their baked dishes over rice (especially love the seafood bake), fried pork or chicken w/ tomato sauce over rice, salt & pepper tofu, fried chicken wings, their Russian borscht, the samosas, pork & century egg porridge, and their beef chow fun. There's a few others that are good too but I've come here so often that I can't remember all the things I've ever had.\n\nDown side is they are cash only and I survive mostly on plastic. :( At least I can hit up the BoA a few blocks down if I needed...", "author": "Melody S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-17", "description": "T-28 boasts of a menu full of cheap, low quality food that is really unimpressive. There are other restaurants that offer way better food at even lower prices (D&A Restaurant). I've been here a couple times and was disappointed on both occasion. I had the macaroni with spam the second time. I can't recall what I had the first time; I most likely blocked it from my memory. The spam was disgusting, and the macaroni was equally as disgusting.\n\nSave yourself from a stomachache and go somewhere else.", "author": "Kevin D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-29", "description": "I LOVE LOVE LOVE LOVE this place.\n\nCheap, delicious, Chinese food! \n\nI come here a lot, especially for those late night dinners when all the other Asian places are closed.  \n\nDaily specials are $7.95 for soup of the day, entree, dessert, and drink.  You have four choices for entrees each day - usually a variety of fried rice and meat with sauce.  My favorite is the Black Pepper Sauce - IT IS THE BEST SAUCE and trust me, they give you ALOT of sauce.  \n\nYou can also switch the soup of the day to their Imitation Fin Soup for $0.50 more, which is what I always do.\n\nOn the most recent trip, I got Salt and Pepper Tofu, Steamed Mussels, and a daily special = $19.45 + $2.55 tip = $22.\n\nSalt and Pepper Tofu was DELICIOUS, a YUMMY in my TUMMY! Crispy tofu with garnish.  It was cooked perfectly!!  \n\nSteamed mussels...was not good. It was okay but being a seafood lover, I should have known better than to order mussels here.  Very garlicky but the mussels are definitely not the fresh kind, probably the frozen pack. Still okay but I probably will not be ordering it again. I'll just order another Salt and Pepper Tofu instead.\n\nEntrees are huge; comes with rice or spaghetti; lots of sauce.  When getting the daily special with the entree, I usually save half for the next day - that's how huge it is. Meat is never overcooked, although there are some fatty parts but that's the part that taste the best right?\n\nAnother favorite of mine are their porridges, especially their late night special for $3.50 or something cheap like that.  BIG ASS DELICOUS bowl of porridge.  Need I say more?\n\nIf the restaurant is crowded, be prepared for a lack of customer service.  Usually it's only one waiter working so you may get impatient.  Food does come out quick though - usually 5-10 minutes.  If you do not speak the language, just wave your hands to get his attention.  Do not expect him to come over when you're about done.  \n\nBest of all, they are always playing HK music videos or concerts.  I love it when they play the Beyond concert. Brings back childhood memories.", "author": "Joanna W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-03", "description": "CASH ONLY\n\nI can't believe T-28 charged me more than $6 for won ton noodle soup. I could have went to Won Ton House and got it for under $4!\n\nOther than that T-28 is a pretty decent Hong Kong style cafe. Bf ordered their black pepper beef chow mien and he loved it. Ice lemon tea here isn't bad either. \n\nThey do deliveries after 6pm.\n\nOnly annoying thing was one time when I was ordering to-go, the cashier told me that the total was $7.85 or something. I handed him a $20 and while he was getting the change I was looking through their menu to see what other stuff they had. The cashier without saying anything just handed me my change WHILE I was still looking at the menu. At least say something to get my attention. When I looked at him he had a \"I've-been-standing-here-for-so-long-holding-your-change, I-want-to-murder-you\" look on his face.  I don't have eyes on the side of my head.", "author": "Tracy A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-12", "description": "Daily happy hours (ha mm cha) from 3-6.  Beware, the price on the menu is actually lower than the price they charge.  Maybe they should update their menu.\n\nGot the beef noodle soup with a combination coffee/tea.  Less than $7 out the door.\n\nRants:\nThere was hair in my food.  Not just one strand, but more than one.  Perhaps from two different sources, as well.  Um, I guess hairnets are not required back there?\nMy beef was all fatty.  It looked gross.  I didn't bother tasting.\n\nSorry, there's no bouncing back from hair in food.", "author": "Jenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-10", "description": "I've been coming here on and off ever since it opened a few years back.  I like their large selection of noodles, rice plates, jook, sandwiches, and good old old fashion Chinese plates.  Really priced for cheap eats but not too shabby in my book.", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "The specials are good. I prefer the fried rices. I like that they stay open late.", "author": "Mei-Fu L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-08", "description": "The decor screams Macau but the food screams bloody murder...Not exactly Macau and not exactly Hong Kong...Sorta like a both got mashed together...Not saying it's not good...But also not saying it not bad...Hence the three stars on my review.\n\nMost important thing you need to know. CASH ONLY!!! No money no talk. That said, let's talk about the food. Mediocre. Just in the middle. Not exactly WOW and full of pizazz and not exactly boring to the point of being plain. The food is decent. Like I've said before, it always depends on who the cook is that day and how he's feeling. Sometimes if the cook is angry and lost a ton of money on the ponies and the night before playing mah jong, you're in for a roller coaster of shitty food. If he's happy and made a buck, the food will sing off the plate. And then there are days when the cook takes a day off and the backup is there...Sometimes it's cool, sometimes it's not. If they could only manage to stay mediocre everyday...\n\nThe portions are perfect. Not too big and not too small. You're getting your money's worth here. And the times this place runs is cool, too. Almost to midnight. Which is perfect because there are no bars near here so they don't need to stay open past midnight. Now the wait staff...I'm not sure what is going on with them but one of them is always in a bitchy mood. And it's never the same one that's a bitch each time. It's like playing musical moods with them. If you hate working there then quit. Simple as that. But on the days they aren't soo bitchy, they're on top of their game.\n\nSo for mediocre food, this place is great for you. Not in the mood for WOW? Then you should give them a try. Trust me, your boring ass will enjoy every minute of it here.", "author": "Anthony L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-06-29", "description": "I had such high hopes for this place since it's a bakery (I love buns) and it has several kinds of congee/jook/porridge.  Unfortunately, they serve the worst congee I have ever had.  I did not know congee could be so bad.  They reached new depths.  I had the minced beef and egg congee.  I think they must have used a tablespoon of rice for 20 cups of water to make it.  I could not see rice - not even broken down rice.  It was so watery and goopy that it reminded me of what you'd get in a refugee camp or a Chinese construction site.  The minced beef tasted funny.  They put a raw egg in the congee.  I didn't realize it at first so when I started eating, I wondered what that thick, viscous substance was - it was raw egg white.  Yuck.  The best part of this goop was the fresh scallions.\n\nI had the $3.75 breakfast special.  Along with the congee, it came with rice rolls (these were okay; they probably didn't make them, they come with a hoisin sauce) or fried Chinese donut and beverage of your choice.  I had the soy milk which was too sweet.  Despite the low price, I felt dissatisfied.  Rice is cheap, so I don't see why they're so skimpy about using it in their congee.  \n\nIf this is what the Macau twist is, yuck.  I hope that this isn't true for the sake of Macau.  For better congee, go to Ming Tai or Hing Lung.  Well, actually, go anywhere but here.", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-19", "description": "Decent HK food for a decent price. There's probably nothing better for it's type of food along the Taraval. \n\nGreat place for snacking and drinking HK style foods. Service is alright, nothing noteworthy but not negative.", "author": "Dan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "I've been here twice, once to dine in, second to take out. Both times were disappointing. My first time was a long time ago when this place first opened. And it pissed me off so much because my dad and I were sitting near the window, and everytime the T-train came by, my seat shook. If i wanted my seat to shake while I have food in my stomach, I would ride a rollercoaster. \n\nMy takeout experience was a little more recent. I ordered the curry chicken with rice. The curry was good but the whole meal and presentation of it was crappy. The chicken was in this big patty they didnt even bother to cut. As I'm used to and as normal restaurants do it, but not here, there were no potatoes or even bell peppers! Just chicken, curry and rice. WTH do i have to order curry chicken, potatoes and rice next time to get some potatoes included? For my boyfriend, I ordered this bbq pork + chow fun dish that he always gets. He said the bbq pork was cut too thin, but the gravy on the chow fun was better than the stuff they use at ABC. Price was about normal, 15 bucks for both dishes. \n\nLast to mention, this place is supposed to be open late night. Not sure how late but my friend says it is. Oh and cash only. \n\n1 star because the food tastes decent and 1 star for open late night.", "author": "Karen C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-05", "description": "Affordable eating with a great selection. Let me start by saying they have food from all over Asia. Honk Kong, Burma, Macau, and China. They also have daily specials for each day of the week. Nice selection of drinks and they are open late. But the best part of this place is the Fried Milk! It's a milky, vanilla, coconut, soft inside that's deep-fried. C'mon deep-fried need I say more?", "author": "T L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-25", "description": "This place is OK. Me and my family/friends go here sometimes just to grab some quick food. I don't notice the waiters that much because they come and go a lot and hardly checked in on us. The food isn't that great or bad at all, but something is wrong. Sometimes you have to wait a while just to get a table, then ahold of a waiter. Since you have to park on the streets, sometimes you may have to go around for 15 minutes just to find parking.", "author": "Jeffy Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-08", "description": "The waitress with two rings on her right ear lope had a bad attitude.  Really bad.  She did her  \"job\" begrudgingly, doing you a favor, like a pouting teenage.\n\nAlso the sign on the wall says something idiotic in Chinese: \"The first time being ignored, your loss. The second time being ignored, it is because we did not do our job.\" What?\n\n\"From your patronage, we have our job.\"  Please explain this part of the sign to the waitress.  She shouldn't be here!", "author": "Eric L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-18", "description": "Small snacks and cafe drinks. I went with a bunch of friends and when our food arrived everyone's reaction was \"hm.\" \n\nI'll probably just not go there too often since it was....just alright.", "author": "Janelle H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-09", "description": "This place is so hit or miss!\n\nFood: So I've had some NASTY stuff here. I had some pork chop rice before and it just tasted gross. But then I tried the Portugese Chow Mein and Baked Chicken Steak with Tomato Sauce and they were really tasty. It's not bad if you get the meal when they have one you like! Comes with a corn chowder, milk tea, and mango dessert (which I have to mention tastes gross). But honestly, it isn't that bad... you just have to stick with the tried and true!\n\nService: Typical asian service. Very whatever. \"Hit and run\" style. To be expected.\n\nParking: On a busy street, where there aren't many spots. You probably have to park blocks away or hope and pray someone leaves right away when you get there lol.", "author": "Kimberly M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-02", "description": "Watch out for the bones.  My curry chicken had bone chips that were like mines ready to crack my teeth.  T-28 serves decent Hong Kong-style cafe food.  I came here with a couple of friends, and between us, we tried imitation shark's fin soup, Singaporean noodles, and Portuguese style curry chicken.\n\nDon't expect to eat healthy here.  Overall, the portions were big and the food was a bit rich.  The soup and the noodles were alright.  The curry, while tasty, was overloaded with coconut milk.  The food could have been better, but as a neighborhood dive with a lot of menu items, I want to give this joint another chance.", "author": "Tony L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-06", "description": "I went there around 11:00 AM on a Friday for brunch with my coworker.  The place wasn't crowded at all - quite the opposite in fact. Parking around Taravel is annoying. The name itself was pretty interesting, you won't be able to forget where it's located T -28, Taravel and 28th.  \n\nAnyway, food-wise and seating during brunch is pleasant.  They'll seat you right away.  They have a special everyday which is nice because of the deal it provides.\n\nI got the breakfast special - option E.  Preserved Egg & Salted Pork Porridge with Chinese Donut and coffee & milk tea w/ condensed milk all for around $6 (tip included).  \n\nThe porridge came piping hot and the coffee & milk tea was okay.  Overall, a good place to go for cheap, decent food.  However, nothing stood out to me.  If you go, I recommend the porridge during a non-busy time so the food comes hot and of good quantity & quality.", "author": "Nina M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-16", "description": "T28 is a fairly new restaurant in the vein of D&A Cafe (on Clement) - an extensive menu of Chinese dishes, strange macaroni combos, and delicious rice porridge - but much better food and a lot more sanitary as you'll see by their proudly displayed Health Inspection rating of 99.\r\n\r\nThe Breakfast Combos are the best deals at T28... for $3.75 you get a personal-sized bowl of rice porridge with either fish or sliced pork and a side of fresh rice rolls. Also try the Macau style pork buns. (The wall decor features framed photos of Macau.)\r\n\r\nOpen Daily from 7:30am to 12 Midnight. Free Delivery in the evening with orders over $20. T28 is Cash Only - Good food, Great prices. Enjoy! :)", "author": "Be N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-22", "description": "This restaurant has very good rice porridge (jook) which is the only thing I get.   From the looks of it, I think the rest of the food is just average but their rice porridge is bomb and the Chinese donuts are really good.  \n\nGo here for the rice porridge and maybe try something else.  The service is pretty average, nothing too great and the prices are good and cheap.\n\nAlso, I discovered they have Hi Tea everyday from 3-6pm, they have gret specials for $3-$4.  What I always get is the pork rice porridge w/preserved egg, all for $3.50... Yum!", "author": "Michi R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-01", "description": "Atmosphere is great, portion size is amazing and if you get the house special you get your choose of hot drinks and dessert. Mango pudding is delicious!!", "author": "Julie H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "The most terrible food I ever tried in Taraval st!! Bad service and rude attitude of the waitress! The fried beef dry noodle is even worse than I did. Will never come back again.", "author": "Ll L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-16", "description": "Nice little place off the corner of Taraval and 28th - I'm guessing that's what the T-28 stands for, since it's name in Chinese is totally out of left field. \n\nIt's going to be my new go-to place for a quick, fuss free meal, after 8:30pm. Why? Between 8:30pm to midnight (Mon-Sat) and 8:30pm - 11pm (Sun) they have this specials menu where appetizers go for under $4, and some mains like fried macaroni, chow fun and the instant noodle fair go for under $5. And the portions are decent!\n\nI decided to go with a Saturday special - Chicken Steak with Tomato Sauce on Rice, which comes with a soup (today it was Cream of Corn with Chicken, not bad), a hot drink (milk tea was decent, contrary to other reviews) and dessert (red bean + coconut cream + sago) - all for under $8. Not bad at all. The main dish was huge - would've fed 3 of me. \n\nService was decent too, so I'm guessing it's better to come off peak. Parking is a breeze at 8.30pm. Closed on Tuesdays.", "author": "v w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-22", "description": "This is a Macau Cafe, so you should try the Pork Bun Sandwich, which is what macau is known for. Its pretty good here and can compare to macau's.  AND CHEAP!\n\nHowever, the BEST time is to go for breakfast.\n\nTheir jook [congee or porridge] is the best in the Sunset, its not too gooey, not too watery, not too salty with msg, not too bland, its just right. but REALLY STEAMING HOT. so watch out.\n\nWith a jook, you can also pick a side order, of oil stick [chinese donut] OR Crazy Sauce churng fun[--noodle wrap--]with hoiseen sauce, peanut butter sauce and hot sauce ALL MIXED TOGETHER hence its called crazy sauce. THATS MY FAVE side btw.\n\nYour breakfast also comes with a complimentary drink.\n\n3 people, my mom leaves $15 thats INCLUDING tip!  what a deal and you leave with your tummy SO full!!\n\nThere are also happy hours when food is crazy cheap, but you cant pay that price if you want to take your food to-go.\n\nDaily Dinner specials are about $7.00, that includes:\n-drink \n-starter soup, if you add $.50 you can have shark fin soup\n-main entree\n-dessert\n\nid choose this place over ABC anytime, unless i have the munchies at 2am and this place is closed..", "author": "kim w."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-07", "description": "Jeeze what is up with all these hybrid restaurants these days? This place is exactly like other places I have wrote about earlier such as D&A Cafe, S&E Cafe and ABC Bakery... man what is up with all the names of these places anyway? I just noticed that. But anyway this place reminds me of the ever growing population of Asian Americans in San Francisco and how many people actually come here because of the decent prices. I guess every major street in the Sunset should have a place like this. Taraval, Noriega, and Irving just to name a few.\n\nComing here one day I just wanted something simple. An order of rice porridge which came out luke warm to my surprise and a side dish of chow mein. I wasn't too pleased with my experience as you can see due to the fact that the noodles were cold and greasy and tasted like they were made the day before. The same goes for the \"jook\" which was too watery and had no taste to it whatsoever. It was like I was drinking plain white rice. That isn't something that appeals to me very well so I can honestly say I shall try to avoid this place at all costs unless I'm dragged there by someone who really wants to eat here.", "author": "Jason Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "T-28, referring to its corner of Taraval and 28th Avenue location, is my favorite spot for Chinese Soul Food. \n\n\"Ummmm, what Soul food?\" you ask?\n\nIt is a term I coined that refers to good, cheap Chinese food that makes you feel very very VERY happy inside.  It should technically be called Hong Kong Soul Food but that does not have the same ring.\n\nI guess I am a creature of habit as I always get the same three things when I'm here: fried macaroni, turnip cake, and iced honey lemon tea.  The macaroni is stir-fried with small cubes of spam, veggies and seasonings that give the dish a glossy brown finish.  Hit it with some hot chill sauce and expect me to ignore you for the rest of the meal.  Just kidding. Not really.  Expect a pretty generous serving of the turnip cake appetizer.  Slightly crispy external, soft internal with a smattering of pork bits inside. YUM YUM.  I wash everything down with a tall glass of the honey lemon tea.  Make sure you crush the lemon rings into the bottom of the glass cup with the long spoon to release all the lemony juices.  Yes, there was a reason for the spoon.    \n\nI am sad that this place does not have better reviews.  I guess it will just be my gem to keep.  Mine.  My precious. :)", "author": "Rose J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "How do I love thee?  Let me count the ways...\nFor when you unfailingly serve up some good jook and chinese donut on weekend mornings (Asian version of \"brunch\")\nFor when you are open late at night (past 10 pm!) \nFor the consistency of quality that you serve (not the greatest, but consistently not the greatest!)\nFor the unpretentious service (seriously, no bs here, I come, I eat, I pay, I leave)\nFor the unbelievably low price, prices so low you can afford to order 2 entrees!\n\nI hope you'll stick around for a long time...", "author": "Yohanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-27", "description": "Ok went here on Saturday 10/25/08 we got there at 7pm , the restaurant\nholds about 50  people and the place was full, they have hk style of\ndinning much like DNA Cafe. I had the Chicken Steak with pepper sauce,\nvery good and tasty. looks like the noodle is a hot seller as many table\nordered various dishes of noodle. other news to know, parking is easy and\nservice is fast and friendly.\n\nMr. Peabody system\nfood            4\nvolume       4\nservice        4\nexperience 4\nparking        4 (easy )", "author": "Howard J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-08", "description": "Avoid this place like the plague.  I got food poisoning here.  I ordered the porkchop bun.  I don't know how the other items are, but I don't want to know.", "author": "A L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-09", "description": "I went here tonight after 9pm with my roomates for a late night dinner.\nI was impressed by how cheap everything was, especially their menu that is only offered from 9-12. Dishes and appetizers were priced very cheapy (under $4!). \nI ordered the macoroni soup with spam and the chicken chow mein. The chow mein was very good, not too salty and also came with thin noodles which was something that I am not used to. The macoroni soup was also not bad (probably something I could easily stir up at home but was satisfying). \nSo, by the end of our meal I was satisfied with my choices. However I do wish that the waiters would be a little more attentive. I had to literally flag them down for water, boxes, and our bill. And plus, they didn't understand anything I asked when I questioned about several things on the menu, but hey, thats ok as long as my food is good.", "author": "Miss H K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-05", "description": "Ewww!  Ok, I only tried the steak in the sizzling black iron plate and it was the worst steak I have ever had.  I knew beforehand they would probably overcook it because most Chinese restaurants do (I know because I frequent many of these cafes) and my instincts were spot on.  They didn't have the filet mignon but instead regular steak so I decided against my better judgement to try it.  I specify in great detail and in Chinese that I want it completely rare, noting that if I spoke English, they would not know what the heck I'm saying and I didn't want to take any chances.  They gave me this really weird look like \"are you sure you want it that rare\".  I nodded and said yes.  Well, about 15 minutes later my steak came and it was completely cooked and dried like a desert inside.  I bet if I threw it in the wall it would crack it.  I laughed because all this time the ladies looked at me weird and was shocked that I want a steak rare but WTF, it's not like its rare anyways and it's cooked completely.  So what is the difference if I said I want it medium rare, medium well or completely cooked?....NOTHING.  It would come out exactly looking the same.  That is just how Chinese cafes do it...LOL.  Seriously, I think they assume everyone must want it cooked well just because these prudes want it that way.  On top of that, the meat tasted disgusting.  I think it was not stored properly.  So I left most of it untouched and they looked at me like \"what happened\".  I gave them back this look like really, can you not see it's so cooked.  This confirms it.  Sorry but Chinese cafes can't cook a good steak.  They don't listen and they'll cook it that same no matter what you say.  And they use the cheapest meat available.", "author": "Hairy Potmaker C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-17", "description": "I often frequent T-28 whenever I visit my friend who lives 2 blocks away. I think we like coming here because we always leave feeling like we got a deal. The food is so cheap! It's not the best food, but it tastes okay and one order is usually two servings. They also have daily specials that include soup, drink, and dessert!", "author": "Eric L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "I like coming here because it's convenient and usually, pretty easy to find parking.  It's a little corner cafe that's supposed to be serving dishes from Macau, but honestly, it's just like any other typical HK Cafe.  They're pretty busy on the weekends, especially in the morning because they have a $3.75 special if you get there before 11:30.  Mmm...I must say, I'm pretty satisfied with their morning special!  You get a choice of porridge/noodles/sandwiches + drink and then an additional .75 if you want to add a side order.  Come on, it doesn't get any cheaper than this!  However, if you were to ask me if their other dishes are good...I would have to say they're only so-so.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-15", "description": "It's finals week and my friends and I have been studying for 8 hours straight, and its about 10 pm! What choices do we have to satisfy our appetite, on a small budget!? There's seniores but pizza wasn't hearty enough, there's lucky penny.. but ehhh.... and then bam T-28! What a great whole in the wall... from 9pm-11pm they have night special consisting of appetizers, noodles, congee, sandiwches... etc... and they range from $3.30 to $3.90! \n\nThe Baked Mussels with Garlic CHECK\nThe Steamed Mussels with Garlic are CHECK\nWonton Noodle Soup CHECK\nThousand Year old egg with pork congee CHECK\nBeef Chow fun CHECK\nFried wonton CHECK\nImitation Shark fin CHECK\nPork Chop Sandwich CHECK\n\nTHE BILL COMES AND ITS ONLY $31! hahaha CRAZY! all that food for $31! feeding 3 of us as well! where else can you get that!? NO WHERE!", "author": "Brian P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-03", "description": "This place serves cheap, quick Macau style food - although I don't think it's that authentic or nearly as good as the real thing.  Portions and prices are decent, but you're not going to find five star food here.\n\nHowever, my family likes coming here bc it's cheap and fills ya up.  \n\n- Beancurd Deep Fried Chicken Wings: 8 pieces... nice and crispy.  $5\n- Portuguese style mackerel fried rice ... flavorful, delicious, and part of the Sunday special\n- Baked Seafood with Cheese and Pineapple: very bland\n\nTheir noodles are usually very bland so I avoid them.  If you get their daily special for $7.15, you get a drink, soup, entree, and dessert.  Not too bad.\n\nCASH ONLY!\n\nThis place can't compare to Macau Cafe though! =D", "author": "Michelle W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-06", "description": "Service: They neglected our soup that came with the meal. assumed that since 2 people didn't order the set dinners that they did not want anything to drink either.  \n\nFood: Pros: my Portugese chicken cutlet was good. Dessert was good. Soup was good.\n          Cons:  my man's beef was undercooked. It was pink and chewy. He's usually one of those people who finishes everything off the plate and tears off the \"bad\" part of the veggie to not waste food. He left all the beeft on the plate this time.  I don't think eating raw meat like that was to his liking.\n\nNext time, please cook the meat a little better.....", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "Just came back to this wonderful place for lunch for the second time and treated myself to a yummmmmmmmy Abalone & Chicken Porridge!!!!!!!! First time for me that, I have ever tried a Abalone & Chicken Porridge at T28 Bakery & Cafe and it had a really good taste to it... I LOVE IT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "William B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-26", "description": "cheapp place for early breakfast. yummy jook and hot soy bean milk drink all for 3.45 whooopeee\n\ntried spam and egg macaroni also, was...interesting....salty....\n\ngot lunch take out once tooo, not bad, they give a lot too.\n\nnever tried other stuff but close by so will definitely try other things next time", "author": "Christine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-31", "description": "I've always drove by or walked by this cafe but have never stepped foot into it until today. Ate here for lunch with a group of friends. The cafe is quite small and decent looking. Not dirty or shabby either. Just like most hong kong style cafes, their menu offers daily specials. Today their special was  the Portuguese fried rice,  short ribs in pepper sauce or the pork and chicken steak in tomato sauce. Each entree is served with rice or spaghetti, a bowl of soup and a drink.\n\n A friend ordered the minced beef with egg rice plate, and it looked like chef boyardee poured over rice. It didn't taste very good- he didn't had an appetite to eat it either because there was a confusion/mix up with his order so he had to send his first order back which convinced him to think that the 2nd plate they brought out to him had spit in it. \n\nAnother friend ordered the salted fish and diced chicken fried rice and that was yummy! \n\nA friend and I both ordered the short rib w/ pepper sauce with rice and I must say that it was the best on our table. \n\nTheir lemon iced tea isn't bad either, but I've had better elsewhere.\n\nNot a bad place to dine at for lunch. Not sure if they open late....they might? Its definitely a better alternative if I had to choose between T-28 and  ABC.\n\nOh and the bill was really cheap. There were 6 of us, though not all of us ordered an entree, everyone DID order something.  The tab was only 41 dollars.\n\nCash Only.", "author": "Jenny K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "i remember coming here a long time ago, but i never knew the name was t-28. The first time i came to this place, i had a Fookeen fried rice. it was decent but nothing special when compared to other restaurants or places that served the same dish. \n\nthe other thing that i remembered is that they played the Jay Chou concert on their plasma. \n\nI've never tried anything else here, but if i do come and visit again, i'll update the review.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-23", "description": "T-28 Cafe gives you fond memories of eating in HK/Macau type places.\nRemember Firewood or Cafe de Coral?\nFast type food served to your table instead of waiting in line near the kitchen counter for pick-up.  Its cheap eats so don't expect too much.\nThe specials are decent but portions may be small if you order a la carte on the afternoon tea.  Rice plates or noodles are good choices.\nGood for late nights or odd ball times!", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "hong kong style food!\n\ni had the Portuguese pork chop w/ spaghetti as part of their daily special. the milk tea went down smoothly, the russian borscht soup was delicious and plentiful, the portuguese sauce was decent, pork chop was okay, and the mango pudding was good. my granny just had a red bean ice and it was huge! afternoon tea special 3-6pm was only $2.25 and most places offer it at $3 in a smaller cup. all in all, this place has cheap prices and big portions, and i would come again.", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-04", "description": "its bang for the bucks, ate here couple of times for happy hour... but sometimes little after i order something off there special... oh man i dunno what the hell was i eat, it was some noddle soup... guess i wont order that again, haha....", "author": "JessePanda C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-27", "description": "We ordered a baked fish dish and a baked seafood dish. The seafood dish was supposed to have pineapple in it. But we could only find tiny bits of it. The food was edible, that's all. Also, if you are giving out free pudding, everyone should get it, right? We didn't.", "author": "YM L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-30", "description": "Yays: I like this place. When I went with my mom, we had good & attentive service, great shark fin soup (only add $0.50 more to the daily special!) and a pretty yummy baked seafood dish!  Mmmmm...\n\nNays: I noticed that they add additional $ for take-out or something. Hmmm...", "author": "J T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-11", "description": "This is the place to be for cheap jook for breakfast. The breakfast special comes with your choice of jook, a drink, and either Chinese doughnut or rice noodle roll for only $3.95.\n\nI usually get the minced beef jook which comes with a raw egg, doughnut and the cofee tea. My boyfriend loves the salted pork bone jook with fresh soy milk.", "author": "Jennie N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-11", "description": "I don't really like cafe Chinese(-American) food.  But my fellowship group from school came here last night, so yea...\n\nI came here with my folks and brother about a month ago once prior to last night.  It's a pretty small place.  People say it's cheap here, but I don't really get a  \"OMG IT'S ONLY THAT MUCH?\" reaction.  The food is average.  Last night, I ordered their daily special for $7.95 - Chicken Steak w/ Spaghetti in Tomato sauce along with Corn w/ Chicken Soup and Hot Tea.    If i would of paid an extra 50 cents, I could of upgraded my soup to Imitation Shark Fin Soup.  \n\nBAD SERVICE!  I had to request my hot tea three times.  By the time I got it, I was nearly done with my meal and ready to go.  Therefore, making it hard to be able to relaxingly consume my hot tea since there was no time to let it cool down.\n\nThey're also not very articulate in describing what each item in their menu is, so you better be top notch in your Chinese.", "author": "Leslie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-06", "description": "Cheap and decent food in the Sunset district, they have all these HK and Macao style food.  The Pork chop bun is a bit flat, the fried chicken is bland, but all the noodles, rice dishes, porridge and all the other HK style snacks and drinks are all pretty good, we especially like the Burmese noodles, the broth is very tasty.  Service is quick and efficient,  decent place for cheap eats...", "author": "Raymond N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "I like this place. It's not super fantastic, but I mean, it's alright depending on what you choose. I remember coming here once for some sort of rice plate and it was super good. I don't remember what it was though. But last time I came, I ordered the pineapple fried rice cause I didn't know what else to eat. I was sad that there were only a few chunks of pineapple. =[ It came with cream of corn soup which was okay. My brother ordered the curry beef with rice which was SOOO GOOD!! At the end of the meal, you get dessert, I suggest getting the sesame paste thing. It was very yummy, unlike any other I've had. The sesame paste was smooth, not chunky like other places, and it was rich with teh sesame flavor. Good price for the amount of food you get.", "author": "Annie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-28", "description": "This is your typical Chinese-American cafe. There's nothing really special about it. I get food here once in a while and it's usually pretty okay. Their food is not awful nor is it very tasty. Their lunch specials are pretty worth it. For $7.95 you can get an entree, soup, and a drink. What more could you ask for with that price? If you eat in, make sure you have patience, especially if they are busy. I've been ignored here maybe twice and it isn't very great. I make eye contact with a waiter and he doesn't even bring me a menu. When you order take out like a sandwich with fries, they only give you a tiny container of ketchup, which is barely enough. But other then those couple of things, I'd say it's a quick and cheap lunch/ dinner.Oh yes, if you don't speak Chinese that may be a downside too!!", "author": "Rebecca T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "absolutely great. owner is very hardworking and very nice. nice people and pretty nice food.", "author": "Jean W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-07", "description": "I'm only giving this place 5 stars because of the experience I had eating this food once I'd taken it home.\n\nUnfortunately, my first visit to this little cafe was the one our of few days when I'd totally lost my sense of taste and smell (sick as a dog)... I went walking along Taraval with my boyfriend on our third anniversary, and we decided to drop by and grab a bite to eat.\n\nI ordered the lunch special, or whatever the menu was called for the food ordered around 2:30PM... We actually wanted to order from the Hi - tea time menus posted on the outside window, but after asking the server, she replied in a semi-angry tone \"THREE O CLOCK\"... I'll bet that if we spoke cantonese like every single other customer in the place, she'd have let us slide.. damnit. (Too bad my bf only speaks mandarin! ) \n\nAnyway, I ordered the beef curry dish over rice, can't remember the exact name, but it's the special for wednesday, and my bf ordered the chicken steak over rice. His chicken came out, at least 30 minutes before mine, because they forgot my order, but remembered every other part of my meal (drink/soup).. we asked the woman about it, and she actually apologized and said she'd get the dish out in 5 minutes! (Unexpected, considering the cold, dismissive way she'd treated us only a bit earlier)\n\nI admit, I could barely taste the milk tea, soup, or dessert I had while eating there, but when my beef came out, I could actually taste some of the spicyness, and the sauce looked INCREDIBLE. I've had curry at many other asian restaurants in my life, but it never looked nearly as fresh and not.. canned or bottled as I'd expect. (it didn't have a too-yellowish, fake looking color to it either, it looked homemade) My boyfriend tried some of it and said it was at least 25 times better than what he'd ordered (haha... the tomato sauce on his chicken steak looked like orange globular vomit). Anyway, I was impressed with the quality of my dish -- fantastic looking, and i was getting hints of savory, spicy flavor. I boxed up the extras, and took them home.\n\nAfter clearing my sinuses with some powerful medicine, I decided to heat up my leftovers that night. And.. that is where the 5 stars is coming from.. IT WAS INCREDIBLE~~... Almost too good for words, it had such amazing flavor for a dish that seemingly came from a mediocre quality place, and after this pleasant surprise, I decided we MUST go back!... \n\nAnyway.. order the beef and curry dish with rice!! Better than any I've EVER had.", "author": "Christine K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-13", "description": "3.5 stars - small restaurant situated in the sunset right on Taraval and 28th..thus T-28...ahhhh!  \n\nrice plates (baked pork chop in tomato sauce) and noodle dishes (black pepper beef chow mein is one of my favs), good portions, reasonable prices and open til midnight (hard to find in the area).  similar to cafe bakery....somewhat.  parking is rough as is most places on taraval.  now if they only delivered!!  \n\n......i'll be back \n\n(please tell me you got that)", "author": "Craig I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-07", "description": "Pretty new (recently renovated?) HK cafe, most people ate noodles, served on a plate with either meat curry or steak\n\nI ordered the chicken coconut noodle soup and was pretty spooked to find it laid flat on a plate with a bowl of curry (way coconut). Verdict: meat has been standing there so somewhat not warm (even kinda cold), it's been stewing a while, too much causing some of it to be tough, it wasn't all dark meat either\n\nI thought it was served with way too much noodles but I ended up eating almost the whole dish (gluttony), I found the noodles quite good, thick \n\nDish grade: b-, $6.80\n\nI would have to go back to try them steaks or what not, over noodle (just say it, it's spaghetti)", "author": "xo x."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "Portuguese sauce is D-LICIOUS!!!!!  It always makes my nancy happy!", "author": "Joseph C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-21", "description": "My Boyfriend and I went there after school, the waitress was so mean, seemed like dont even wanna serve us. and as we ordered our food, she was sitting at the corner table to chat with the other workers... we asked her to get check after eating ,she was not responding neither...", "author": "Annie H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-05", "description": "This is my 100th review at Yelp and I choose to use it on this restaurant.  I go to this place on Sundays to avoid the crowds.  There's never a a line.  There's always daily specials for $7.95 (?) which includes choice of 4 daily entrees, salty house soup, spaghetti or rice, choice of drink (I usually choose between Hong Kong tea or hot fresh soy milk-reminds me of childhood), and very nasty mango pudding.  You probably ask why I go here.  It's comfortable and homey food.  You sit next to the window and you watch the L-Taraval go by.  You see families eating together.  You can actually hear conversations.  The baked seafood has fake crab meat and calamari, one mussel or two.  It's not overpowering and not too much gravy.  The seafood rice is not so greasy.  The Portuguese curry chicken is really good.  It includes two cups of rice.  You have to take home; it's too much.  The shrimp rice noodle comes with both hoisin sauce and sesame sauce., which reminds me of Hong Kong.  The won ton lo-mein looked really good.  The service is typical Chinese.  You're in luck if they are friendly.  They are not there to make your day, just to give you your food.  This is hard work and long hours, so give them some understanding.  Did I mention, cheap!  Cash only, but you can afford it.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-07", "description": "I've only been here twice so far. \n\nFirst visit/dinner-- HK milk tea, pretty damn good. Ordered some fried rice off the day's special menu. Also pretty damn good. I think it had shrimp in it. Maybe it was a seafood fried rice. \n\nSecond visit/lunch, packed -- Got the HK milk tea, of course. Again, pretty damn good. Curry beef brisket rice noodle soup. I got the wide rice noodles. They were fresh and succulent. The curry at first tasted a bit odd, but once I stirred it more into the broth, it was quite good. The beef brisket was exactly right -- tender, a bit chewy, tendon-y, fatty in the right amount. \n\nNow I want to go back and try the normal beef brisket noodle soup, the fish ball noodle soup, and also the jook. I see mixed reviews of the jook on Yelp, but I know how subjective that can be. \n\nIn fact, I've had a cold for the past week. Perfect time to test the jook.", "author": "Lola X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "I like this place.  First of all, they give you a lot of food.  So, if I'm really hungry, this is a good place to go.  Secondly, the food they serve is different than most Chinese restaurants.  It's Macau style cuisine - now, I have never been to Macau, so I can't comment on its authenticity.  But, I like trying new dishes, and they have quite a few.  Some I liked a lot, some I wasn't too crazy about.  The place is pretty clean, and the service is pretty efficient.  Food always arrives hot, and seems freshly prepared.  Sometimes the worker's English isn't too great, but hey, if you are ordering ravioli and the chef only speaks Italian, that's a plus, right?", "author": "Marty C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-06", "description": "This place is open late (a very good and rare thing) and fairly trendy to the young Asian crowd. A strange and huge menu of things (at least to this white boy), a diner look, and a flat screen playing Japanese music videos. I really love the coconut-jelly-icee-drink-thing they have. Your bound to find something you like.. but could also trip onto something a bit weird if your experimenting. The servers aren't much help in deciding since they barely speak English. Some of the treatment there makes me thing they are a bit racist and don't want white people coming in, I don't know.\nMy number one complaint with this place is it is FREEEEZING! I'll come there at 11PM or so and it feels like they MUST have the air conditioning on. I literally am shivering whenever I leave that place. Dress like a snowboarder and it'll be an adventure.", "author": "Eric A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-25", "description": "Just went to this place with my family of 4 for dinner tonight.  We ordered the Friday specials with 4 choices to choose from.   For $7.95, we got a hot entree with choice of rice or spaghetti that came with soup of the day, a drink and dessert.  What a deal!!!  Food was good, price was great, service was good and the place was clean.  I prefer this place over Cafe and Bakery on Noriega.  By the way, this place accepts cash only, no credit card.", "author": "Avocadoagogo L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-22", "description": "We come here often Friday nights. Food is merely ok at worst and alright at best. But it's cheaper than say King of Thai up the street if you're in that neighborhood and are stuck out late. You'll want to just order off their specials menu though for the best value. If you insist enough, they'll even let you order special combos that are only for other days. Service is decent, but it can get a bit loud sometimes since its common for big groups to come in late.", "author": "Peter W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "First of all: the people who work here are so hard-working and friendly, and I really admire their commitment to good customer service.  Okay.  So this might not be the place for a nice, romantic, fancy candlelight dinner for two, but if you are looking for some good, hot Chinese food that is cheap and quick, this is definitely the place to go in outer sunset/parkside area.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-01", "description": "I went here with my best friend recently and got the Salt and Pepper Chicken Wings. Wow. A must try for everyone.", "author": "Melissa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-19", "description": "is it a strange coincidence that hk cafes/bistros make good chow fun?  their chow fun is pretty good too, with a lot of \"wok hay\" (although broadway bistro in millbrae is a tad bit better - for you chow fun lovers).  this is also a good place to come for porridge, i like the \"pei dan sow yuk\" - thousand year egg w/ pork meat.  i forgot what the prices were but if you come after 9 p.m. it's cheaper, but you have to eat in, no take outs (bummer!).\n\nps. \ntry to stay away from the spaghetti if you can.....", "author": "Paulina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "Very good food at  reasonable price.  They don't have MSG in the food but as with all Chinese and Asian food. They are greasy but this place is average on that part.", "author": "W. L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-01", "description": "Just browsing T-28's menu is an adventure.  The atmosphere is casual and comfortable, and the food is tasty.  Every sauce they make is delicious!  I highly recommend the chicken with black pepper sauce!  The portuguese style curry chicken is equally incredible... just watch for the bones.  Be sure to bring cash.", "author": "Christena T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "I ordered their Fried chicken steak and pork chops all with portuguese sauce and I love it.  They have a lot of variety there and prices are fair.", "author": "Nancy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-27", "description": "Been here multiple times, and it wasn't good. I remember the first and second time being quite horrible, and don't recall the third time with the won ton noodles. Their beef chow fun was basically burnt. Service is laid back, but I will say that the place is decent on its CLEAN scale. It looks a lot nicer than other diner type places. Tvs that plays Asian music videos. Overall, not my choice.", "author": "Elaine H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-25", "description": "I really like this place!  It is open pretty late (except Tuesdays) and has a large, authentic Hong Kong/ Macau menu.  I've tried the Bean Sprout Chow Mein, which is great, the Fried Milk Dumplings, also great, the porridge, really good, the shark fin soup is awesome, the garlic mussels, which are really good, but maybe a little too garlicky for me, and the chicken wings, which have a great texture, but maybe need to be a little more flavorful.   The wait staff is attentive, and the surroundings are really casual, but not dirty.  The flavors really remind me of my first time in China, and whenever I'm in Sunset, T-28 is an automatic choice.", "author": "Craig M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-11", "description": "When they first opened, the food was plentiful and good. However, after a while, the food plates didn't taste as good anymore, and it got a little skimpy. You can say this is supposed to be authentic hong kong style food, but It's far from it in my opinion. At least the place seemed clean and sanitory.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-06-01", "description": "The food here is alright but I could definitely see myself giving them 4-stars had I come here after a night of a drinking. HK style rice (or noodle) dishes that is decently priced and tastes pretty good. The huge portions are definitely a big plus. My suggestion would be to order one of the Specials since it includes a house soup, hot drink and dessert for a few cents more than most regular dishes. OR, the best is if you come after 9:00pm. Then you can order meals that are less than $4. Score!", "author": "James C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-18", "description": "If your into HK and Macou food this is a great place to visit. Food here is cheap and tasty, but very greasy, creamy, thick, etc.... I stop coming here only when i realized what I was eatting (ox tongue), which than scared me away. I use to love eatting ox tongue, until i began to realize i was eatting a tongue.", "author": "David M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-14", "description": "my gramps favorite place to get jook in the morning. and damn it is cheap. plus if you get the jook with salted egg and black egg (which is my fave), they give you a whole black egg. A WHOLE BLACK EGG!!\n\nunlike those cheap shysters who only give you small slivers of egg in their jook, yeah i'm looking at you our court on clement!\n\ncash only okay.", "author": "Melanie C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-06", "description": "OK, I've debated on how to start this review and I think I've come to a conclusion:\n\nWhat do you think when you hear (or read) \"shredded chicken\"?  Anyone?  Shredded, like small pieces right?  Shredded?  \n\nSo I ordered some instant noodle with \"shredded chicken\" and my food comes out one minute later.  What do I see?  I see a bowl of soup with instant noodles and a piece of chicken steak that's been cut up into 5 pieces.  WTF.  Tell me that's not \"shredded chicken\".  So I asked the person, what is this, I ordered shredded chicken.  And the person insists this is shredded chicken.  Um.. no it's not.  So we asked what they serve on the other noodle forms that have \"shredded chicken\" as the meat option, and surprisingly enough he says it's really shredded.  WTF again.  So why can't you put that meat in this soup because I ordered SHREDDED CHICKEN?  It costs extra apparently.  WTF!  Ok.. so I want to change my order because this menu is a SCAM (don't order from the night menu if you want shredded chicken).  I want porridge and I don't want this.  And what does this freaking waiter say,  but you already ordered it so I have to charge you.  WTF YOU ARE CHARGING ME UNDER THE FALSE PRETENSE THAT I WOULD BE GETTING SHREDDED CHICKEN!!  ARGH!!\n\nI was so pissed but I ate it since I was hungry.  I did not touch the damn chicken though because it was not shredded.  I was so pissed that sorry I had to leave no tip for crap service.  That is some half ass reason when your shredded chicken is different or not offered at all (and BTW this guy started talking about the lunch menu but how does that relate to this...).  I should have known going into an Asian restaurant.  No attempt of apologizing either.  Do these people know English.  Do they know the meaning of SHREDDED.  One bad experience is enough to  make me avoid this place, but kudos to you guys who enjoyed the food you ordered because it was what you ordered.  -______-", "author": "Yosie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-11", "description": "Sadly, they discontinued the dish that I wanted to try, but overall, I liked it here. I liked their \"Yin Yeung\" (mixture of coffee and Hong Kong-style milk tea). I got their \"homeless fried rice,\" which was pretty good. I made a checklist on their takeout menu before I came here to eat. I'm thinking about trying everything on that checklist, which means I going to have to come back.", "author": "Alex Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-06", "description": "I used to come to T-28 almost every weekend for breakfast before I had my daughter, which was about 3 years ago.  After going to Tak Kee Lee for breakfast last weekend and found out that they've raised the prices - yes, I'm cheap when it comes to HK style breakfast, I've decided to come back to T-28 to see what their breakfast is like.  For $3.75 you get to pick either a porridge, noodle soup, or macaroni soup and it comes with your choice of milk tea, milk tea/coffee, coffee or soy milk.  For an additional .75 cents, you can add porridge, turnip cake, steamed rice rolls, or egg.  We ordered three breakfast specials w/ two additional sides and it came up to $14.70!  I thought that was such a great deal!", "author": "Katniss B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-28", "description": "The best meal deals around the area hands down! The food is good, but their prices are even better! For about eight bucks, you get a huge bowl of imitation shark's fin soup, milk tea, a full-sized meal, and dessert. I like coming here for the shark's fin soup. Very well made and consistently tasty--a plus in my grade book. \n\nTheir milk tea is above average--a little too much evaporated milk for my liking. It makes the milk tea a bit sour tasting, but it was OK. I ordered the spaghetti with the pork chop and chicken steak. The pork chop and chicken were fried perfectly. The tomato sauce is always too sweet for my liking so I never touch it and get it boxed. At home I remake the sauce by adding different shit to it, which further validates my own opinion that I should open up my own Hong Kong cafe. \n\nMy sister's seafood spaghetti with pineapple and cream sauce was decent, though the pineapple in there is questionable. It doesn't make it delicious, so why even put it in the mix? The Portuguese Curried Mussels were OK, just baked mussels with yellow sauce on it. The mango pudding is awesome, though it tastes really processed. Still good, though. \n\nFinal Verdict: If you happen to be in the area, then stop on by! The yummy shark's fin soup will make you cry. Their pasta is good but some things seem off. Don't pineapples and seafood belong in a pig's trough?", "author": "Florence W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-17", "description": "Mussels, mussels, mussels. Portugese-style, garlic, any-which-way. The gai-don hom-jue jook is hella good, too. Open late+good prices+ fresh seafood=you_gotta_eat_here_dot_com", "author": "Dan S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-08", "description": "The waitress and the guy that seated us was rude and acted like they were saving a table for someone but nobody ever sat at the reserved table. The place had some tables full but overall it was empty and stayed that way. What's the point of saying seat yourself when we try to sit at a table they tell us we can't sit there and sit at a specific table instead? So stupid...the food was average. I would rather go to D&A or ABC over this place. The prices at this place are more expensive and there's not too many specials. The clumsy waitress even drops one of our drink orders and acts pissed of at us because she has to go back and get another drink. Only reason we came here was because one of our family members wanted to try it out...a decision we regret.", "author": "Mike W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-13", "description": "went there in a Friday late afternoon for tea time snack. \n\nyes, the price is cheaper, compared to the ones at East Bay (Fremont, Newark). The taste was so so. The milk tea. not good.  (Tak Kee is much better).\n\nHowever, the service was good and attentive.", "author": "Hyman W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-11", "description": "Came here due to the Yelp review.  The food was disgusting and the only reason for a one star is because the waitress was really nice.  So disappointed.", "author": "Eva Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-27", "description": "My star ratings for this place goes up after 9pm when you can get regular sized portions of food for about $3.50 per dish. The food is mediocre but the place is clean & cheap! This place reminds me of D & A Cafe with a smaller menu & better service", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-08", "description": "I stumbled upon this place late one night. Fortunately for me, they have specials from 9pm - 11pm that are like 3 bucks. My late dinner ended up being quite cheap and plentiful. The food is decent - nothing too spectacular. I always try to hit up this place when I'm forced to have a late dinner.", "author": "Barney M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-14", "description": "Monday afternoon(6/10) I came here with a friend to eat. We order 2 iced lemon tea, baked curry beef over rice and some kind of fried rice. When we got our drinks my friend said hey isnt the color kind of off ? The color was murky like they put milk in it. So I asked her if she wants to exchange her drink because it was worst color than mine. ( she tasted it and it didnt taste what we order ) so she got her exchanged to a new one with no words from that waitress. Her drink is now clear and not murky so I decided to exchange mine as well. This time it was another waitress and I asked her, why is the color like this ? And I couldnt finish my other sentence because she started saying oh well you know it cant be milk because its lemon iced tea. And how sometimes lemon and sugar will turn into another color when mixed. Well do you want a new drink? It will still be the same color and wont make a difference So my friend showed her drink to her and she ignored it. In the end I got the drink exchanged and it still sisnt taste like it. It was sour.  I doubt ill be coming back here to eat.", "author": "Jessica T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-28", "description": "So i had a pork chop! And it was SOO greasey! I didnt know i was at an auto body shop.... so unacceptable. When i cut the pork chop, it leaked grease. \n\nSo good luck.", "author": "Tane S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-22", "description": "Terrible Terrible place. I sat here once for 45 minutes with no service. Note, this was at 6 or 7pm on a saturday, and I saw people who came in after us getting served. Tables were sticky, and the waiters were ignorant and didn't care. I actually spoke to a guy and he literally walked away from me when I asked about service. I will never go back to this establishment again.", "author": "Clinton L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-27", "description": "This place was actually pretty good. Different from your average chinese place, cause it's more of a cafe. Haven't been there since it's grand opening. Probably got worst. Cooks are probably lazy now. Bleh.", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-24", "description": "Um why pay for food that I can make myself. Dinky menu.", "author": "Keit K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-12", "description": "I wanted to give them zero stars because of their poor service and unprofessional demeanor, I gave one star because yelp makes you give at least one to post.\nI recently ate at this cafe this past Saturday.  My first impression was that it seemed very clean and newly painted.  I was meeting my sister-in-law for a late lunch, I arrived shortly after her and when I went to place my order, the guy there told me that I couldn't sit with my own party and told me to sit at a table by myself.  Then after I agreed to this outrageous request, a waitress bumped into my baby's stroller while carrying a hot bowl of soup.  My sister-in-law asked the waitress to go around the other way and to not bump into our stroller again.  The entire wait staff refused to go around my stroller and continued to carry HOT food and liquids above my daughter's stroller and then had the nerve to complain about us blocking the walkway, where else was I supposed to put my daughter's stroller??? I had her right next to my table.  The people who worked there were very rude and unprofessional.  They insisted on bumping into my daughter's stroller (did I mention that my daughter is only 6 months old) and continued to be very rude to me and my sister-in-law each time they passed by.  I was so uncomfortable being at this cafe I couldn't even finish my food, which was very oily and had no taste, I asked for a take out box and the guy rolled his eyes at me and then just slammed an empty box on the counter and walked away.  Never in my life have I ever been treated with so much disrespect.  I do not recommend anyone going to eat at this cafe.  I read some of the other reviews and were surprised that I was treated so poorly.  \nTO sum it up, I do not recommend to eat at this place unless you want very bad service, want to put your child at risk of a burn injury due to lack of common sense and tasteless greasy food.", "author": "Sheree A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-27", "description": "I've eaten here quite often due to my mom. She loves it and can't beat a bargain. Depending on the time of the day they have random specials. An example would be their 4-6pm Tea time specials. Nice little meals just to tide you over to dinner. There breakfast menu is classic HK style with rice porridge and other Macau style food. It's very clean and well lit. Usually its easy to find parking. I like taking my mom just because it makes her happy and is close. I'm not that keen on Asian food. But this place does blow away establishments such as ABC which is NASTY!", "author": "Mike W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-15", "description": "I only come here for the porridge/jook/congee in the morning!  It's decent and they give you big bowl w/ fried chinese donut, and a drink of your choice. All for under $4.  In terms of value, you can't beat that.", "author": "Crosby C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "So I am told by my Chinese friend that this place is actually named \"The Little Flying Elephant\" but you wouldn't know it unless you read Chinese. I think this is a far superior name to T-28 though the latter has a very Blade Runner-esque quality. This place is awesome for the quintessential hangover food or the late night drunk  dining experience. The white fish rice porridge is pretty damn good especially when you add the homemade chili garlic sauce found at each table. May I also suggest the dried beef chow fun, the ho fun is good and rarely made too oily. I usually order these two dishes and end up taking half of each home. Everything on the menu, especially the late night menu, is super cheap!!! My bill never exceeds $7 if I'm eating alone. I also enjoy their Hong Kong style iced coffee. The service is always friendly and FAST!!", "author": "eric m."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-13", "description": "It's all about the late night specials baby.  \n\nWeeknights... between 9 and 12, they have really cheap late night specials.  when my pockets are hurting...  this is where i grab some macaroni soup and beef chow fun for about 10 bucks!!!  cheap eh?  \n\nfood is good price is cheap.  can't really beat that with the economy these days.", "author": "Don H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-26", "description": "This place gets extra points for being up the street from my house and having a late-night menu when I'm too lazy to cook.  The food is good.  I don't often venture into unknown food territory but I trust this place and have usually been pleasantly surprised.", "author": "Arthur K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-03", "description": "T28 is very similiar to the ABC Bakery cafes because of the Hong Style of food they offer. I usually order the daily specials with imitation shark fin soup (+.50 cent), drink, and dessert for about 7 dollars. The portions are big and the dishes are tasty. They have a variety of other dishes on their menu as well. I don't think any cost more than 6-7 dollars. Really good deal if you ask me.. especially now because we are in recession. Cash only!", "author": "Simon S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "This is a no frills type of place in the Sunset.  Their food is average but the jook (porridge) is excellent!  I've had jook in many places in the city and at T-28 it's consistent and creamy and not watery.  I've had their jook over 10+ and the quality is always the same.", "author": "Kenneth L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "yo this place is really really delicious go before 11:30am to get a mad deal it's ridiculous milk tea is really good porridge is good salted pork and 1000 year old egg is the one to get they keep it real you can watch the street cars go by if you're into street cars but you know i go here for food cause i'm usually hungry in the morning they are also open late so keep that in mind keep it trill99", "author": "Chin C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-24", "description": "I really think Yelp should modify their rating system because there are just some establishments that just don't deserve even ONE star!!! I don't know what's up with all of the restaurants on Taraval but they ALL seem to be consistently just plain bad!!!! Perhaps they have a \"terrible restaurants of Parkside Union\" or something.  \n\nThe only thing I like about this place was that the setting of the establishment is consistently clean.  The second only thing I like was that their menu was very vast so you can pretty much order ALMOST anything; except ORDERING FOR WHAT YOUR MONEY'S WORTH!!!!!\n\nI'm cook and I know cooking/running a restaurant is a tough business to run but there was NO EXCUSE for their poor services/poor food! I have been to PLENTY of Macao/HK style restaurants to know that there are plenty of restaurants out there that would put this establishment to shame! For example, if you order their \"baked\" plates, you expect to get your money's worth or at least be semi-filled even for your money, well not here.  Their baked beef w/tomato sauce and cheese on top was NO EXCUSE! The whole dish consisted about 90% rice and just a RIPE OFF stewed \"GROUND BEEF---SHOULD NOT BE GROUND IN THE FIRST PLACE\" in tomato sauce with just barely a sprinkle of cheese on top (not even melted and equivalent to a small packet of parmensan cheese you get when you buy a whole pizza).  Oh and here's the icing on top that makes this place the ultimate, \"scam establishment\", I would say for this dish, the only amount of nasty ground beef you got is equivalent to a TABLESPOON of meat.....So there you have it, NOT BAKED BEEF, IT'S BAKED RICE W/TOMATO SAUCE;NO VEGGIES TOO.\n\nSTAY FAR AWAY FROM THIS PLACE! IF YOU WANT A LATE NIGHT MEAL, BEST BET WOULD BE TO GO TO \"ABC restaurant and bakery\" on Irving and 32nd street than this dump.\n\nOh and here's what made my evening, the waiters did NOT CLEAR ANYTHING OFF OUR TABLES UNTIL WE LEFT!!!! Our table was so crowded with empty dishes (had to order several because of the ripe-off small portions here) we had a difficult time putting our left over \"dishes of rice\" in a container.  The staff just stood there, dumb founded! A friend and I had dinner at around 7pm and it wasn't even crowded (only one other table besides mine), so there was NO EXCUSE for them to just be standing around, looking in our direction knowing that we had a lot of EMPTY dishes around us and NOT PICKING THEM UP!!!!!\n\nFOR ALL THE PEOPLE WHO GAVE THIS PLACE HIGH MARKS:\n\nDo you even know what is \"Food\"? Do you even cook or are any of you Chefs???? Perhaps your lack of understanding of food and cooking is what's holding you back from giving an honest review (because you really don't know how to compare this place if you don't know how to cook or have never grown up in a cooking household).\n\nAs a chef, as a person who loves to see customers walk out of restaurants happy (because if you aren't cooking good food/providing good service then you aren't doing your job), and above all as a person willing to try ALL types of food be it game, strange, or foreign I URGE YOU FELLOW SAN FRANCISCANS, DO NOT COME HERE!!!!! THERE'S A REASON WHY SAN FRANCISCO HAS SOME OF THE BEST RESTAURANTS IN THE WORLD, EXPENSIVE OR CHEAP! THERE IS NO REASON WHY THIS PLACE SHOULD CONTINUE TO STAY IN BUSINESS, PLEASE DO NOT COME HERE, SO THAT IT CAN GO AWAY AND SOMETHING BETTER CAN REPLACE IT! \n\nPlease, don't be lazy, just because it's open late, does not mean they deserve to stay in business! There are plenty of establishments that open late, like ABC restaurant (similar to T-28 and just better; not by much but you get your money's worth), just keep looking and don't stop over here!", "author": "NeverFoodFull F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-26", "description": "This place has really good fried tofu. Yay for spicey fried tofu! and good drinks. Haha. I love the title. Very smart name for the place. T-28; Taraval & 28th street! Yay!", "author": "Danielle Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-22", "description": "southside southwest, gotta rename this section of the city, okay i will for now until someone does better, in honor of our brothers and sisters and bad driving, hk ... this smart cozy little hideaway for the hk style cafe is an oasis for hard studying asians, hk bangers, mom and dads for a quick bite; menu plans galore, so bring calculator and algebra textbook to get the best deal, also figure in when u go because that also determines the price ... oh the food, good decent, if  it is about the food, come and eat and dont trip!  out", "author": "tim y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-24", "description": "when i first went i thought hey the stuff isnt that bad. i mean its sortof like a chinese fusion with american food. after a few times. i was like ugh. i would say alot of my friends go there. they think its good. i mean for like 8 bucks you get big portions and drinks. ok.... i guess. its a decent place to go when your broke and you want something satisfying. but honestly you can go somewhere else. the food is just easy to make. then again i only order the specials they have for the weak. from what i heard they spit in your food.", "author": "Nicholas Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-28", "description": "Just came here today . They have many menus so it took me a while to look through all of them and order LOL . T-28 is like another D&A but better .  They have late night special which and another special which is 3pm-6pm . They have a variety of food . They offer a lot of interesting things other cafes in SF don't offer . This place is very clean . They have a flat screen where they play chinese karaoke songs but you can barely hear them because the volume is turned down so low . The HK milk tea was way too bitter . Seems like they put too much tea and didn't put any condensed milk or sugar . The wonton noodle soup was ehh .. mediocre . The wonton didn't look like wonton at all .. they were very big and tasted like sui-mai . The noodles that came with the wonton got tiring . The macau style pork chop bun was suprisingly good .The jook was very good too . It was too liquidy like the jook you get at ABC but it wasn't too thick either . It was just right and full of flavor . The porportion was just right . I love their hot sauce !! It's not the cheap hot sauce other restaurants and cafes use . The hot sauce is very flavorful . Dirty cheap prices for good food ! Two wonton noodle soups , a jook , a macau style pork chop bun , a jelly hk milk tea , and a ice cream float came out to be only $20 !! If you're thinking of going to ABC , consider this as an alternative .. cheaper , cleaner , and better food !!", "author": "Eileen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-18", "description": "It opens pretty late. I like ordering the pork bun. The congee is okay. The prices are cheap. I don't recall ever ordering a drink.", "author": "bob k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-07", "description": "I love their beef chow fun.  It's really cheap from 3-5 and after 9 p.m.  The bosses there are very friendly and you can tell that it's family owned and run.  I especially appreciate these establishments.  You must also try their fake shark fin soup.  Their portions are generous and filling.", "author": "Gina R."}
