{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "These are amazing tacos and guac, everything for my catering delivery could have gone wrong. I made an address mistake, but in order to get my food to me, management went above and beyond to make sure I had the food delivered, and it tasted amazing. \n\nThank you Tacolicious staff!", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "The food is delicious. Bartenders are always up for a great conversation. Would enjoy from time to time, if other shows were on the TV. Maybe something uplifting and funny after a long stressful day. Family Guy would be perfect. \n\nKeep up the good work and look forward to Family Guy Monday's.", "author": "Jeffrey F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "Somehow, Taco Tuesday made for a fun, casual birthday outing!\n\nGet a group of yelpers together, add in some $15 do-it-yourself-tacos and pour a couple of margarita pitchers ($29 on Taco Tuesday) and you're guaranteed a great catch up session with friends.\n\nSince Tacolicious doesn't take reservations, our group of 8 waited 30 mins. before getting seated. If you arrive before 6pm, you can catch some happy hour specials ($7 guac, $7 margaritas) at the bar while you wait. \n\nI'm surprised that each taco now sells for $5.50 so it's not a cheap date if you head here. But the group easily killed several huge taco plates and got a whole variety of tastes to choose from: baja style cod, pastrami tacos (add $1), house special chorizo/potato, carne asada, guajillo braised beef and carne asada. I ordered a side of beans and rice and their cauliflower \"al pastor\" to complete the meal. \n\nI prefer the NB location a bit more than the Marina one, as it is more spacious and the bar is just gorgeous! Supreme service and a vibrant atmosphere bumps up this review to a solid 4 stars.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "I've never been that blown away by the Tacolicious tacos, but my boyfriend and I stopped in for some snacks in between meals and were very impressed.\n\nThe albacore tuna tostadas contramar-style (chipotle mayo, avocado, crispy leeks) were my favorite - a thin layer of tuna on a crispy shell. Completely delicious.\n\nI would skip the tomato-watermelon salad (queso fresco, basil, sciabica olive oil), which was with yellow watermelon that was too watery and way too sweet. I added some salt, which helped to provide some contrast.\n\nThe habanero-tamarind glazed pork ribs were a great snack - not too hardy of a rib, but just enough to make you crave more.\n\nThe service was fairly light - we had to continuously wave down our waiter where we wanted a water refill or to get our check, but I would come back strictly for the tostadas!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "I love Tacolicious. But what happened to the amazing fresh minty salsa they used to serve with the chips?! That bomb salsa was one of our favorite things about coming here. Now the salsa is warm and kinda mushy. Sorta weird... warm salsa is weird. \n\n\nEither way still love the tacos and drinks. \n\n\nBut the salsa!!!!", "author": "Mick N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-09", "description": "Although this place is really good for tacos, they are a bit pricey for tacos. About $6 per taco and it feels much especially because I love just the street tacos you can buy at taquerias. \n\nAnyway what makes this unique are their drinks and the 3 salsas that come with a wooden spoon that range from mild to really spicy.  I love getting the cod fish tacos fried, the carnitas, and the veggie one. As for drinks, sangria or margaritas are good. We usually end up getting a pitcher but regretting it because of the cost. Overall great place though with shared tables good for groups or a date at the bar area.", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "Skip this place and go to the Mission for better tacos and salsa.\n\nSince Tacolicious is a taco place, it is only reasonable for me to expect above average tacos. The tacos were disappointing.  Beef was too salty, breaded cod didn't have any crunch to it, taco shells were stale, salsas were not tasty, guacamole was bland. Service was okay and decor unmemorable. Overall a painfully mediocre experience.\n\nNot the worst choice if you're in the neighborhood and crave tacos at a sit-down restaurant, I don't think it's worth going out of your way.", "author": "Heidi B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "Tacolicious may be a local Bay Area chain now, but not all locations are created equal. I think the Marina location is far better in terms of food in both quality and taste. A few differences I noticed were in the salsa and queso. The salsa here seems to have mint in it which made the taste reminiscent of mojitos. The queso here also had large slices of red peppers and less spice. The taco meat is also much \"wetter\" than other locations -- almost too much as the tortillas were nearly soggy upon arrival. I think the quality of the food was fine, but the taste was noticeably different compared to the Chesnut/Marina location. That said, I will stick to Italian food next time I'm in North Beach.", "author": "Edwina D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-07", "description": "Free chips/sales - always a plus.\n\nI'm giving this place 2 stars due to pricing (a bit expensive for small tacos) and just how oily the tacos are. \n\nWhen I bit into my MF Chicken Taco there was a pool of liquid that ended up on the plate.\n\nOverall it's average. I'd rather visit another Taqueria.", "author": "Inci A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "The hostess (girl with long brown hair and face piercing) was so rude to me after I asked her a simple question about outdoor seating. The last thing I need is to have some girl scream at me in front of several people for no reason before I'm about to drop $75 on food...I'm never eating here again. They need to hire friendly people.....not unprofessional and unpleasant people who don't make you feel welcome!", "author": "Lady N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "My first visit to Tacolicious was for a late Sunday brunch. There was no wait and the menu seemed pretty standard with traditional \"Mexican\" fare options. \n\nI ordered the michelada and their breakfast tacos. The portion of filling in the tacos was very generous and I was completely full after having one and a half of the tacos. They bring out chips and salsa when you sit, which is great! I always love it when Mexican places bring you free chips and salsa. The salsa had a nice flavor and wasn't overly spicy. The michelada itself was pretty decent it definitely had the kick of spiciness that I enjoy, I would have preferred a Dos Equis or Pacifico instead of a Tecate but that is just me being a little bit of a beer snob. \n\nThey also have a cool combo which I did not get but if I go back again for lunch on a weekend or dinner on a weekday I would absolutely try it. It is a taco (or maybe two or three can't exactly remember) plus a shot of tequila plus a beer for $12. Not a bad deal at all. I would definitely go to this place again.", "author": "Stephanie A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "I'm shocked this place has less than 4 stars. The tacos here are so delicious.\n\nI had came here with four of my friends to celebrate my 21st birthday and the waitress was really nice. They even gave me the chrurros on the house because it was my birthday. That was really nice of them.\n\nI don't remember exactly what tacos I ordered, but all I remember is that they were really tasty and not too overpowering. \n\nSince it was my 21st, I had to order a drink and I ordered a margarita. We also got a round of some shot that the waitress provided. \n\nOverall, my experience here was really enjoyable. They made my 21st birthday dinner very rememberable. I'll never forget their very kind service and the delicious food. \n\nGive this place a chance!", "author": "Allyson L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "PSA: this review does not review tacos. I try to stay on the healthier side when I can so I went with the ensalada chingaderas which let me tell you was so so so good. The mix of kale with crunch was amazing. I asked for the jalapeño vinaigrette instead of the coriander dressing because I love any extra spice I can get. I wanted to add avocado to my salad but apparently this wasn't an option so I got the guacamole instead.  they give you a big portion although it was expected when they charge you $10 for it. Overall great flavors in the salad and the guacamole was good too. My friends ordered tacos and they said they were on point. Everyone was stuffed after their meals, food baby's for sure. If you're in the mood for some good Mexican, try out tacolicous. They have locations all over the city and they do order delivery on a couple of the food delivery sites.", "author": "Kara N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-06", "description": "Yikes!  I used to really like Tacolicious but am bummed about some of the menu changes.  Bring back the chorizo potato taco PLEASE!  The fried avocado taco does not make it ok for them to get rid of the chorizo potato taco.  Just so you know.  We ordered 12 tacos and when I lifted one off the plate we were all grossed out with the pool of oil underneath.  \n\nMy friends spent quite a bit of time here yesterday, but we were constantly ordering and super low maintenance, but we overheard the servers talking crap about us because they felt like we were there for too long.  So um, that's awkward.  Not coming back!", "author": "Jessica F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "I really like the bartender on duty (Paulo)... He gets 5 stars, but I'm giving the restaurant 3 because there's no Family Guy on the TV. He politely explained that sports are required to be on when the TV's are. Otherwise, I had a wonderful time in this establishment.", "author": "Rajah H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "Overpriced, loud and tasteless. \n\nDrinks are watered down.\n\nOkay vibe/music, but horrible Mexican food experience. Nothing authentic about this place.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "This is about catering. We had Tacolicious cater our wedding welcome party in Sebastopol in August. The staff was really responsive and helpful during the booking process. We were able to swap out the dessert in the catering package for guac. The catering set up with the teal pots and the little succulents is super cute! Our guests enjoyed the food!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Amazing food and flavors!! SF foodie and first time at tacolicious and would highly recommend. Tuna tostadas, chicken tacos, shrimp cesar salad were delicious. All food is non-GMO & organic!\n\nI'll definitely be back.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Their specialty tacos are far more superb than the standard carnitas and beef. The standout is the battered cod and avocado selection. So far have only ordered through Trycaviar, but they're always speedy and delicious!", "author": "Danielle Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "This is a very fun restaurant to go to with friends. The atmosphere is lively, and the evening vibes pair perfectly with the nightlife of North Beach. \n\nI went with a group of girls, and the noise level was perfect for conversation. Not to loud, and not to quiet, I'd recommend sitting inside with a window table. \n\n Now let's talk about the food. It was good, I can't say great because I have had much better Mexican food. I do have to say their chips and salsa were on point. The guacamole was very good as well. Although they are simple dishes, a well executed salsa and guacamole is key.\n\nI also had the Beet Salad, which was by far the most amazing dish. The beets were perfectly ripe and the combination with the orange and queso fresco was amazing. \n\nMy taco choice was the butternut squash taco (I wasn't feeling meat that night). It was nice they had a vegetarian option. The tortillas are homemade, slightly to thick and dense for me, but the flavors were very good.\n\nLast but not least, the cocktail! We split a pitcher of margaritas and let me tell you, those babies were strong! Probably the only thing on the menu where you got your money's worth.", "author": "Cayla Dee P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "This restaurant wins my award for \"Worst Customer Service - Local Category\". Consistency is key here, as the tacos are always delicious, and the table service is always non-existent, even on the slowest of days. Prepare to take a seat at a dirty table, because it won't be wiped without asking. Also, be prepared to have to go look for your server when you want another taco, another drink, or you simply want to pay your bill because once the food \"eventually\" arrives at your table, you'll never see your server again. \n\nI was hesitant to write this review because I'm local to the neighborhood and believe that any restaurant can have an \"off day\", but I've been here many, many times, and the service is terrible every songletime. Consistency is key at Tacolicious!\n\n(Ps, thanks for replying Pablo, but the restaurant was DEAD. Had it been busy, I of course would have been much more forgiving. Systemic poor management and training is the only excuse for consistently poor service.)", "author": "Ted T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-15", "description": "Huh, heard so many good things. Didn't live up to the hype. I thought the meat was overly seasoned. Sometimes I just want to taste the meat without all that other stuff.\n\nOrdered carnitas and beef tacos. Preferred the carnitas. \n\nHowever, I will have to say that they have some bomb ass sauce. I received 4 different varieties. I do love me some good homemade salsa so thumbs up for that. \n\nTook stars away for the tortillas - not my style, too though and thick - and salsa was old. Cilantro had turned brown.", "author": "Song C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "One of our talents was nice enough to treat us to lunch. We ordered through Caviar on last Tuesday, May 23rd. There was a choice of three restaurants. I picked Tacolicious since I've never been to the one in North Beach. Our delivery order arrived around 12:30pm.\n\n4-Taco Meal: Mix and match all 4 ($17.95)\n*Baja-style pacific cod: cabbage, cumin crema\n*Achiote-braised chicken\n*Traditional carnitas\n*Guajillo-braised beef brisket\n\nA couple people ordered the four taco plate, so it was hard figuring out who's lunch was who's. I chose the tacos above, but I'm not sure if I got the right plate as one of my meats was super sweet. I think it was the beef? It was hard to tell as everything ended up melded together in the take out container. I ended up liking the chicken the best as it was tender and had the best flavor. The cod was disappointing. Mostly batter and not much fish. A coworker of mine ordered the Chile con Queso ($9.95) which I was really excited about. But it was rather thin and not very cheesy. Kind of like a thicker soup. I was disappointed as I wanted it be cheesier. I asked for lots of sides of salsa, but they didn't include much, so not sure if they give you complimentary salsa with your tacos or not. I like A LOT of salsa with my tacos.\n\nI've been to the Tacolicious in the Marina and I remember thinking it was pricey for what it was. I felt the same way about this location. And at almost $4.50 a taco, I expected more. Or at least, more free salsa!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-15", "description": "Food is overpriced. Four regular sized tacos for $20... I thought The taste would make up for it but I was wrong. The tacos weren't necessarily bad but you would think that the price would Say something about the quality of the tacos. Not any workers fault but the owners really need to reconsider their standards and get off their high horse. Customer service was great.", "author": "Daniela R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-31", "description": "So, I am super bummed out about the kale salad no longer being on the menu. My doctor recommended Tacolicious to me. She said the kale salad was so delicious and so healthy and told me to add chicken. It had this cumin apple cider vinaigrette which was to die for! I'm very upset to see it was taken off the menu. I got that salad every single time I was there. I wish they would bring it back and bring it to all locations. Aside from the salad, I'm a huge fan of the short rib tacos although I'm not a fan of tortillas. I wish they grilled the tortillas a little bit so they had a tiny bit of char. I only eat the meat out of the room temperature tortillas.", "author": "Danielle S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "The Taco Also Rises!\n\nIt was a warm spring day and we sat at a table outside Tacolicious watching it get dark and electric signs come on, and the res and green stop-and-go-traffic signal, and the crowd going by, and the Uber, Lyft and yellow cabs buzz around slower traffic, and the tourists going by, singly and in San Francisco, looking for the evening meal. I watch the waitress walk past the table and watched her turn left into the restaurant and lost the sight of her, and watched another, and then saw the first one coming back again. She went by once more and I caught her eye, and she came over and stood by the table.\n\"Well, what will you drink?\" she asked.\n\"Just water.\"\n\"Do you know what you'd like?\"\n\"Tacos, four of them, two traditional carnitas, one housemade chorizo with potatoes and one achiote-braised chicken\"\n\nThe tacos arrived all lined up on a long plate accompanied by another plate containing three small sauce containers. I loved the red and the yellow sauce, they were spicy. The chicken was good, the chorizo was tasty and the carnitas was to die for!", "author": "Afshin A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "I really wanted to go to Tacolicious, but it was kinda disappointing.  I truly felt as though I had entered the twilight zone the second I walked into this establishment.  There was no hostess to be found... We waited, waited and waited and finally 5-7 minutes later seated.  Usually this place is packed, but this day it surprisingly was not.  \n\nSo, when one of my best-test buddies and I sat down, it took a while to be greeted.  We first ordered our drinks and then about 15 min later ordered our meals.  Here's the first fail... our meals came out 25 minutes later with no sign of our duly awaited drinks... we asked the server and she rudely said ask YOUR server.  So we did and then one drink magically appeared, but where was the other mystery drink... We waited to find our server and asked for the other drink and all she said was, \"oh sorry.\"  Then a few minutes later when I was finished with my meal my drink appeared as was now my liquid dessert.\n\n30 minutes later the bill appeared.  I can tell you this was the first time ever I wanted to \"Dine and Dash.\" Great look, poor service.  I don't know if ill try again.", "author": "Mercedes M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-04", "description": "Food is okay but the music is so loud. I don't understand! This is not a club. It's a restaurant. Not going to come back.", "author": "Appy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "We dined here after calling and being told this restaurant had no wait while the one at the marina had an hour long wait. Maybe that should have been an indication. We arrived and stood at the front desk for at least 5 minutes with no one acknowledging us. Finally we were greeted and got seated 15 minutes later even though there was no wait and the restaurant wasn't busy. Once seated we sat, with our 3 small children while no one came to our table for at least 10 minutes. At this point we had one kids menu and no crayons. Our kids were starving and going nuts after 30 minutes of no progress beyond sitting down at a table. Eventually we got some water and chips and salsa and put in our orders asap. I have food allergies and needed answers to a few questions before ordering but the answers were vague and uncertain so I played it safe with an $18 salad that was so bland. The lights were too dark to see our food and the music was so loud it was difficult to hear each other. We ran out of water part way through the meal and the server never even came back to check how our food was, let alone refill our drinks. Our kids drinks came in the middle of their meal and then we had to remind the server a couple of times to bring out the ice cream. A manager came at the end and said they forgot to make an adjustment to our bill so I assumed maybe they were going to discount it for the horrendous service, but nope, she brought the check back exactly the same as it had been before. \nAlso, we took our children to the bathroom and the toilet paper and paper towels were both gone and the floor was littered with garbage. \nAll-in-all this restaurant fell very far short of the modest expectations we had. Not much I can say good about it besides that the chips and salsa were decent and everyone else's food seemed fine.", "author": "Emily B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "Pros: Came here during lunch with my coworkers and surprisingly they were not packed. The crowd on this block is usually for Tony's pizza down the block probably. The waiters were efficient with our orders and bill since we were on a time crunch. They refilled our chips often too.\n\nCons: Good luck with street parking. We ordered a variety of tacos but the beef brisket one was SUPER salty.\n\nOrdered: If everyone is getting tacos, it's best to get the 10 piece order. We got 20 tacos in a variety of flavors.\n\nWould I recommend: Ehhh... kinda on the fence on this place. Yes as a backup restaurant but not a first choice since its pretty basic.", "author": "Terry N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-14", "description": "Good place if you're in the mood for overpriced tacos! Came here for a lunch date with a friend and it wasn't too crowded which made for good service. The server was helpful in answering our questions and giving suggestions.\n\nThe nopales and oaxaca cheese taco was by far my favorite. The nopales were fresh and mixed with a slice of grilled oaxaca cheese. Definitely not the kind of taco you'd find at a local taco truck. The salsas served were also fresh which made for good flavor. Worth the try but I won't be returning for $5 tacos.", "author": "Edgar A. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "I was so glad to have made it to Tacolicious!  My girlfriend and I have visited their sister spot, Tacolab in San Miguel and we were very excited to hit the place up on our recent visit to San Francisco.  The chips and salsa were great.  I had a carnitas taco which was very good and a beer battered fish taco that was amazing!  They give you three choices of salsa.  I liked the habanero the best because it was very spicy!  We shared rice which we both enjoyed.  My girlfriend ordered the tacos dorados and was happy with them and I wanted to try them but I was too full once I got around to it. We were in the North Shore and found street parking very quickly which added to the happiness we felt at being there.  The service was very good, we were well attended to. We had a window seat which was nice so we could people watch.  There was outdoor seating as well but it was too cold a day for it.", "author": "La Shara C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-08", "description": "I'm giving 2 because chicken tacos and Guatemole was good. Other wise I didn't like at all. I walk in there and before I go I put myself to list from yelp. Nobody welcome me , I was standing up 20 mins waiting for table. I don't  like steak taco at all almost make me choke two times. I asked the server guy if he can change it for me he said he can't do that. I didn't like the service , taste etc. Ambiance was nice. They have a veggie options which is good. I like fried avocado tacos. When you first come they give you chips and salsa like everywhere , it's free and fresh. I was really excited to go and try their \"pictures \" tacos  but it's disappointing. Good luck to you...", "author": "İrem S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "This place is pretty rad! \n\nWe walked here after going to BBB. They fit our large group in quickly and we were met with multiple bowls of chips & salsa. These chips are freaking amazing!!!!!!!!!! We ordered two pitchers of margs. Strawberry & Original. Both were excellent. We ordered 20 tacos for our group / chicken, carne asada, fish & pork. This was the perfect amount of food for us. \n\nWhy don't ALL Mexican Restaurants serve pickled onions with their street tacos? What an additional little treat. I would hands down stop here again for tacos. Great atmosphere, awesome food & drinks!", "author": "LeeAnn C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-26", "description": "We ended up here for a quick drink before our show, and because the line at Tony's for a better meal option was too cray.\n\nIt's located on the edge of Little Italy and Chinatown, with several restaurants along the same street. When we stopped by on a Saturday afternoon it was very busy but we sat ourselves down at the bar. The ambience was pretty standard for San Francisco.\n\nService at the bar was sub par (we were never given menus or water), and the mojito seemed a bit watered down. But hey, free chips and salsa! Hardly anything is free these days so that was a bit refreshing.\n\nBased on this experience though, I wouldn't return.", "author": "Sue V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "My wife thinks Tacolicious is the best restaurant in North America. It is very good. Always sit at the bar. They serve beer in short pseudo-rocks glasses. I've never seen that before, but I really like it.\n\nBartenders are always very nice. If you sit and eat long enough, you usually get a few freebies. Couple different locations. Definitely an easy go-to spot.", "author": "David E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "Sooo overpriced. Tacos are good but it's truly insane how much they overpriced them for how small they are. It's good they serve chips and salsa bc I usually rely on that to fill me up as the tacos won't do the job.", "author": "Garrett S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Great tacos! As well as great drinks and queso! I would recommend coming here for food! The staff is friendly as well!", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-23", "description": "Went here with some friends to grab a bite to eat on a Friday night. The place was packed, but we were lucky to grab the last available table for the 5 of us.\n\nI ended up getting three different tacos: brisket, fish, and chorizo. All of the tacos were a decent size and had some good flavor combinations.\n\nTheir house margarita was also pretty good and the pitcher wasn't too expensive.\n\nOverall, the vibe of this place is great and filled with energy and is perfect for large groups. Not a bad option if you are looking for an affordable meal out.", "author": "Ryan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "The salads get never fail to disappoint. But they are a little bit pricey..  If you're feeling a nice hip vibe then here's a good place. The service is wonderful. Free chips and salsa with water. Pretty fast service. I paid $20 for a kale salad but it's enough for two. I suggest...GO!", "author": "Anita L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "The space rocks! Unfortunately the food doesn't exactly follow suite.  \n\nIt took a bit for someone to take our order. Not sure if it was the general way that things were or if it was the time of day but it was painful since the space was not busy at all! \n\nThe tacos were super dry but not too terrible. I wouldn't come back to tacolicious with all of the other tacos spots in the city.", "author": "Kaley K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-28", "description": "Started with empanadas-- nothing special. Then tried the fish tacos and the carnitas. Neither were impressive. Their presentation far exceeded their taste... blower. \n\nService wasn't great either. I hope that the incredibly slow service was due to a sick call, but who knows... at least the server was apologetic about it, and the drinks were on the house without us even complaining (that's how long it took...), so that's always a plus.", "author": "Phi N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-13", "description": "I visited this place on a Saturday during the NBA and NHL playoffs. The bar area was packed and a few tables were open. Since it was just myself the hostess offered to seat me near the bar area that had open seating. I waited 15 minutes and no one stopped to take my order or offer me something to drink. At this time a spot opens up at the bar. I moved to the bar and had a drink in hand right away. I ordered the plate of 4 tacos. I had the steak, chicken, and carnitas. The steak was cold and not worth eating. The carnitas was hot and really delicious. The chicken was luke warm and seemed to be way too moist of some sort of juices. The hot sauce was good along with the carnitas tacos. I would probably not come back due to the lack of service and cold to warm food.", "author": "Jason D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-01", "description": "I'm sitting here right now, 6pm on a Friday night and THEY'RE OUT OF GUACAMOLE. How does a taco place run out of guacamole?!??", "author": "Sue C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "Ok, so my son brought me here from several options nearby his house and even though we gad mexican food (bad) last nite...\nWe'll this was something special for sure. The HABANERO Was Let's say...HOT! QUATRO tacos all tremendous and the best ever. Never gad any as good in this would anyway.  Claire and HADIE  We're Great Employees To Take Care Of us.  Marguerite and beer chasers helped a lot. Why a 5, we'll it'll bring them up a little to where they might be...love, me.", "author": "Sumner B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Just what we were hoping for when we planned this meal - tasty tacos served in a good atmosphere. I could have tried quite a few things on the menu but went with the helpful servers advice and it was dead on. Great service. Thank you, you came recommended and did not disappoint!", "author": "Kett M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "Sampled three different types of tacos and wow they definitely packed a full plate of flavor and targeted different taste buds in my mouth. The amount of meat per taco was amazing. Many people may be discouraged when they see the prices and don't want to spend that much for just tacos but on occasions I would definitely say go... filling, tastes good, variety and great environment. Recommend to friends and family. Types of tacos we tried Pork, brisket and cod. Yum.", "author": "Jasson C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-15", "description": "Visited Tacolicious last Thursday night with a bunch of girlfriends. Despite our large party of 8, we were immediately seated (we called ahead which helped!) We were greeted by endless bowls of chips and a not-so friendly waitress who seemed like she'd rather be anywhere else...\n\nWe each ordered two tacos and were served a bowl of guacomole for the table. Since none of us ordered the guac we assumed it was complimentary and began to eat. It wasn't until we were half way through that we noticed that guac was actually on the menu for $10! \n\nWhile the tacos were delicious, the aftermath of Tacolicious was not so. About an hour after eating there all of us started to feel some sort of way. I ended up getting sick as a result of what I believe to be the fish tacos I ordered... Maybe I have a sensitive stomach, but the fact that we all felt sick to our stomaches was not the best sign... For how many great restaurants are located in North Beach, I probably wouldn't come back here.", "author": "Rebecca D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Been to tacolicious a few times now and the name alone makes me want to go here. I mean come on, it's the greatest name for a Mexican restaurant maybe ever. This is exactly what I would name a Mexican restaurant if I ever happened to open one. Anyways, I was pretty surprised that it wasn't busier when we got here last night, but we got a table for 5 right away. We started off with a pitcher of margarita fesca (milagro blanco, pomegranate, rosemary,\nagave). Oh my god, it was delicious. I was downing it like juice. They immediately brought us chips + salsa. We also ordered guac. They kept on bringing chips every time the bowl would be empty. Very much appreciated. I ordered the shot and a beer braised chicken taco and the carnitas taco. Both were great. Will definitely be back soon!", "author": "Ilana B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-27", "description": "I went into Tacolicious and was ignored by the staff\n\nThe place was empty\n\nAfter 15 min I walked out frustrated\n\nI guess they don't care or need my business", "author": "Jim O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-01", "description": "Dinner review. \n\nPlantains - 3/5\nTaco (chorizo) - 2/5\nTaco (carnitas) - 3/5\nTaco (brisket) - 4/5\nTaco (steak) - 2/5\nChurros - 4/5\n\nOverall, \"A-OK.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "I've gone here a few times with coworkers and have had a such a lovely experience-the service and food being exceptional each time. The place is great for groups of people, which is probably why people from work always recommend coming here. And there is a full bar. Seems like a great place for happy hour if you ask me (except I haven't actually been here for happy hour). It's definitely a great place to socialize over food and drinks. \n\nThe times I've gone here, I've gotten the 'Guajillo Braised Beef' tacos and the 'Traditional Carnitas'. The meat in both of these tacos were very flavorful and tender. Each taco is about five bucks each, which seems a little expensive if you ask me. But you can get four tacos for $17.95 which comes to about $4.50 per taco and ten tacos for $39.95 which comes to $4 per taco-- now this price seems a little more reasonable. The tacos are definitely exceptional and the salsas that come with your meal are great! I usually try to not eat too many tortilla chips so I don't get too full before my meal, but the salsas were so good, they made it hard to stop. Since each taco comes with two corn tortillas, I'm always able to split the two corn tortillas and divide the meat to make my one taco into two tacos since there is always enough meat to do so (am I the only one who does this?).\n\nI probably wouldn't come here on my own. Like I said, it's more of a place to socialize. But I would def come back with a group of people to try their happy hour.", "author": "Meghan J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "Came here late Thursday night with a friend to grab dinner. We had the tuna tostada which was really good and then we had 2 tacos each, at about $4-5/taco. Decent place for tacos, cool vibe, but lots of people there just drinking or partying, not necessarily a great dinner spot. But, it's a good place to go to when you are craving tacos in the neighborhood. I may return due to proximity, although tacos did not blow me away. It's more of a bar feel then a restaurant.", "author": "Marie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-15", "description": "I work in the neighborhood and am always struggling to find healthy things to eat for lunch, Tacolicious has some options for salads that are absolutely delicious- however they're tiny and over priced.", "author": "Melina V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-14", "description": "Good solid tacos, but this is coming from someone who rarely eats tacos and isn't an aficionado by any means.  Tried just about all of them and they were tasty.  Happy overall with the experience and price.  We sat outside, service was fast and pleasant as well.", "author": "James A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Grand selections of tacos to choose from.\n\nA good variety of salsas to test try too!\n\nNice open air and outside seating.\n\nWarm churros with chocolate ooze was a finishing win!\n\nTacolicious indeed!", "author": "Tiffany D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-26", "description": "I came here with a group of friends and we were seated pretty quickly. We had the mushroom empanadas which were actually really good. I ordered the butternut squash and carnitas tacos but was very disappointed with the squash ones. We all shared a margarita pitcher but I didn't really like the flavor. If I'm ever back in San Fran I might visit again.", "author": "Ana C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "not the best of the locations and the crowd tends to skew more tourist but with a happy hour featuring $6 margs, what else could you ask for??", "author": "Alexandra K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "This place had a fun atmosphere and it was happy hour so I was able to get 6 dollar margaritas. I went to this place off of a recommendation of a friend. I ended up trying 4 different kinds of taco: chorizo/potato, cod, mushroom carnitas, and traditional carnitas. I ended up liking the cod the best and then the mushroom carnitas second. The traditional carnitas was pretty good but I thought could of been a little better and the chorizo and potato tasted a little dry but was still pretty good. They also give you three different types of sauces ranging from mild to very spicey. I'd go again with friends for the cool vibes and the pretty good tacos.", "author": "Casey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "Beans with bacon here were excellent, tacos and plantains good as well. \n\nThe bartenders are great and you could tell they really know their craft. Their micheladas are alright, they could use better beer than the canned stuff. For $6 though, it's quite good.", "author": "Siddhartha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Hands down the best salsa I have ever eaten. The chips and salsa were free, too, something I always appreciate at Mexican restaurants.\nWhen we ordered we thought the tacos were a bit pricy, but they they showed up and I understood why. Every taco has two tortillas. There's generous filling. It comes with a variety of  dipping salsas. \nThe servers were attentive and our food arrived quickly. Easily the best meal we ate in San Francisco.", "author": "Lisa D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "Worst service I've ever experienced two times in a row at this location  we had to ask for chips and salsa as we waited 15-20 mins after we ordered and never received it.  Our drinks came out one at a time for some reason when we were two bites away from finishing our meal....pretty bad  we had to ask 3 different people for our check and they still never brought it.  We left cash on the table", "author": "Spraynard K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "In my opinion this place is overhyped and overpriced. If you have had real authentic tacos from the various Mexican restaurants in SF you will know why this place doesn't even compare. Like honestly one taco is 5 dollars.... Like what is it made out of? Gold? When I can get 5 tacos for 5 dollars somewhere else. I do have to give it to them that their sauces are really good and also their tortilla chips but that's basically it. The wait was over an hour. I thought it was going to be more efficient and less of a wait since they text you when your table is ready. I came back here after 45 mins and they said that they texted me but I received no text what so ever.. So they gave my table to someone else.. And I received their text after waiting 15 mins inside the restaurant when I came back... So overall wait was an hour and maybe more\n\nFor the food: I didn't think the tacos were that amazing to come back because they are pretty expensive but I did really like the fish tacos (cod) and the carnitas were also good. Their deal was 10 for 40 I think and I still think 4 dollars for one taco is still way over priced. \n\nOverall: servers were really nice but the wait and the cost killed this place for me. I really wanted to like this place since I saw so many yummy pictures of the tacos but overall this place was disappointing. Don't think I will be coming back when there are so many other taquerias that are cheaper and have better food.", "author": "Leslie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "Came here while in town on business with a friend.  We shared 10 tacos, an order of guac and a picante margarita.  Great service and food- highly recommended!", "author": "Rachel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Great service good food and really cool tile floor.  Real cocktails and reasonable prices. It ain't dirt cheap but u get what u pay for.", "author": "Nato S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Such an amazing find, great food, if you're vegetarian the fried avocado tacos are amazing! Definitely coming back :)", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "Super friendly and quick service. Our server was very knowledgeable about menu and food sensitivities.  We loved the fresh guacamole and the cod tacos.  We also tried the carnitas- they were tasty but too oily. We'd go back for the guac and cod though!", "author": "Sarri T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-05", "description": "This place is just way too expensive for what you get. I'm all for paying $4 per taco, but it better be a BOMB taco. The tacos at Tacolicious were just downright underwhelming, and even inedible for my standards. I came with a group of 4 and we ordered a total of 20 tacos (2 orders of the 10 plates), and within that assortment of 20 we pretty much tried every taco on their menu, including their \"taco of the week\". I liked the carnitas the best, but it was in no means impressive. It was just the best of a bunch of meh tacos. On the other hand, I literally could not eat the fish taco. I'm not sure if they fry all the fish at a certain point of the day and leave them under a heat lamp, but when I bit into the taco the only thing I could taste was stale oil. I'm uncertain of if there was actually any fish under all the batter. It was really bad. \n\nWith all that said, if I could, I'd still give this place 2.5 stars because the service was pretty good, the ambiance was hip, and the servings were pretty generous. But in terms of the quality of the food, I was incredibly unimpressed, and felt very much robbed when I paid over $30 for 5 tacos that were not very good. Needless to say I will not be returning.", "author": "Jaymee G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-13", "description": "My grandma would be so disappointed in me if she knew I ate here.\n\nFood: We ordered a bunch of tacos, some asada and chicken. Both meats were very dry beyond belief. I doused everything with salsa and lime to add some moisture. The meats were flavorless, especially the chicken. Not sure if they marinated the meat at all or just not long enough or maybe the meats were just overcooked. All plausible theories, but also just speculation. As I mentioned I used a hefty amount of salsa to try to compensate lack of flavor and dryness, but to my surprise (not really) the salsas were just mediocre. Not spicy at all and barely any flavor. I don't think I will be trying this place again.\n\nAmbiance: clean, large space, modern and hip decor. Basically the opposite of an authentic or true Mexican hole in the wall restaurant. \n\nService: Inattentive and unpleasant. I don't think the busy boy/waitress woman liked that I kept asking for lime, water, etc. \n\nPrice: When in SF, you just accept high prices, but this was just too much. The food wasn't pleasant, service was equally unpleasant, I really wish I didn't spend so much. \n\nOverall: This place is not authentic at all. Steer clear if you're looking for authentic tacos or just stick to the mission. With a name like \"tacolicious,\" I should have known better.", "author": "Astrid Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-07", "description": "Was really excited to try this place but won't ordering again. Not sure if I should place more blame on Door Dash or the establishment itself. I ordered the Baja Style Pacific Cod Taco.... it was a small piece of fish smashed onto a cold tortilla. That's it. No sauce or garnishes. I also got a Green Chili Pollo taco which was such a mess it was unrecognizable. Again, no garnishes or anything. Just a cold taco. Sad day for this taco lover!", "author": "Rachel R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-22", "description": "Overpriced ($5+ for 1 street taco?!) and taste not very good.  Guac was not bad.  Pretty good service.     Stay with your local taqueria!", "author": "Dkac C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "Their tacos are great, service could step it up a little. It wasn't even busy and i had to ask for my check 3 times. I just didn't feel as if i was being served, might as well just gone to the front and ordered and then sat down. But to end on a plus, the tacos are seriously the best.", "author": "Peej J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "A fun chain to check out in the city, whether you are in the mission, north beach, or the marina. The tacos here are solid, and it's a fun atmosphere. This is one of those places that is more trendy, than it is authentic Mexican food, but sometimes that can be a good thing. Great for a lunch date, but if you are looking for the most authentic mexican food in the city, head to a taqueria in the mission instead.", "author": "Ross S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-04", "description": "The service is beyond horrible. I've walked out of here twice now. Save yourself the headache and SKIP THIS LOCATION. The one I. The marina or the mission are great. It's only a matter of time before this location closes because of the horrible service - this place is never crowded and for some reason still can't get their shit together.", "author": "Sophie I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "I've been to all tacolicious locations, and this was by far the best one! The service was great, the food was delicious as always, and the restaurant itself had a very pleasant vibe. I asked the really nice server girl, whom was attentive, if she could take my card so I could pay the bill in advance to surprise my bf. She executed the task very well, and the surprise was a success!!! Thank you very much I really appreciate it.", "author": "Paola N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "We LOVED these tacos. Bottomless chips and salsa, great location and a really fun environment! Unique flavors of tacos, all amazing. Pictured are pacific cod, mushroom carnitas, and chicken Chile verde. Great service!", "author": "Steve N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-18", "description": "Delicious and creative tacos; love the authentic small corn tortillas, and thank you for allowing the mix and match. Many comparable restaurants require you to order 3 of the same variety. At Tacolicious, you can actually do a sampler for the whole table.", "author": "E T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Our server was great the salsa was a little watery but overall we enjoyed the experience the atmosphere is comfortable. This place offers great menu and drink options. Recommend coming here.", "author": "Saul D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Some of the best tacos in San Fran. Friendly atmosphere and great taco selection. Reasonable prices followed by a great alcohol variety makes for a fun time among friends while noshing on tasty salsa and chips. Check this place out if you're in the area searching for some quality Mexican!!!!", "author": "Matthew S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "Terrible service!!!\nDrinks took forever to come... I had to pick them up at the bar after asking the waitress three times.\nFood order came wrong. \nFood was ok, nothing special. If it weren't for the service, I'd consider coming back.", "author": "Isabela R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Despite the crazy chaotic scene that was the North Beach Festival happening outside, Tacolicious was able to serve and delight in a quick and efficient manner.\n\nWe were seated immediately and given a generous portion of chips and salsa which they replenished whenever we wanted.\nToday, we opted for the Tacolicious deal. 1 shot of tequila + 1 beer + 1 taco =$10.\n\nI've only been to Tacolicious one other time, and that was the one in the Mission where I had terribly undercooked Butternut squash tacos.\nToday, I saw they got rid of that terrible taco and replaced it with a Fingerling Potato Taco.\n\nThis taco was much much better. It tasted like a breakfast taco! There was also mushrooms, onions, and cilantro. It was warm, soft, and fresh. It went perfectly with their trio of salsas. I mean, potatoes & hot sauce is the perfect combo. The beer offered in the combo is Tecate, but I didn't mind bc we were drinking all day anyway, and it felt good to just have a cold beer that didn't cost $9.\n\nOur server was super attentive despite it being busy. She rocked it! \nThanks for the great service and great tacos. A good redemption by Tacolicious!", "author": "Lanie L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Good salsa collection. The taco menu choices are above average. Highly recommend the mushroom and chorizo. Overall a complete menu!", "author": "Rikin M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "I can now officially say I've visited every Tacolicious location in the city. What can I say? I love me some tacos and guac. Seriously though, this location is awesome! Located in the heart of North Beach, this is definitely one of my top places to visit when in the area. They served my party and I in a quick, polite and efficient manner. The Stockton St. Tacolicious crew was extremely accommodating, (the Valencia location is a kind of all over the place, it takes forever to get seated). \n\nFood:\nTACOS TACOS TACOS. My favorite are the traditional carnitas and Shot-and-a-beer Braised Chicken tacos. They were so filling and ridiculously satisfying. Pricing is as follows:\n\n1 For     3.95\n4 For     14.00\n10 For    33.00\n\nWe were a party of 4 and we ordered 8 tacos, we were all full by the end of the meal. Don't let these tacos fool you, they are packed with meat aka you will get full sooner than expected. If you visit Tacolicious you also have to order the Guacamole even though it's an extra 8 bucks. Trust me, you will not regret.\n \nService:\nLike stated before, I found that this location had a better sense of customer service when compared to my experiences at the Valencia and Marina locations. From the servers, to the chefs, everyone at this location was incredibly sweet and welcoming. Thumbs up for that.\n\nAtmosphere:\nI visited on a Friday night, so it was definitely lively and pretty packed. However, the wait for a table wasn't too insane. It was a fun atmosphere with a lot of younger people getting their taco craving out of the way before hitting those North Beach bars. Lightweight felt like I was in the Marina for a quick second. But yeah, overall it's a fun and lively environment; making it great for big groups of people.", "author": "Stefany Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "The food is terrible!  There was so much grease at the bottom of the plate, how is it possible that the pork was dry!  And the salsa tasted like cilantro.....straight cilantro.  \nWorse lunch I've had in SF.  Don't waste your money.", "author": "Andrea S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-20", "description": "Lousy service, got the order wrong (4 chicken, 4 fish tacos), then waited another 20 minutes to get the right order. Tacos were not nearly as good as an authentic hole in the wall, cost $40+ for 8? Never go here. If you want Mexican food go to the real deal. Tastier, cheaper, and you'll get your tacos in less than 40 minutes. The fish tacos were actually not even edible - One was even too many. \n\nI live locally, and wont be coming back to this disaster again.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "I love Tacolicious!! I've never left this place in a bad mood. \n\nThe vibe is always really chill, the tacos are amazing, and the queso is TOP NOTCH.  This is the perfect spot for a good lunch on a sunny Saturday. Come by if you're in the mood for a cold margarita and a solid plate of tacos. Nothing better.", "author": "Katie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-16", "description": "Came here one of the days during our visit to SanFran. (I know that version of San Francisco is not tolerated, but isn't California one of the most tolerant states?) (Sometime between 07/30/16 and 08/06/16). \n\nOur friend's cousin and bf came to meet us for a bite. We ordered a whole bunch of tacos. The one with the cheese was amazing. The water service sucked and rocked. It only rocked because my boo next to me was constantly refilling our water for us. No one left thirsty. \n\nThe drinks/cocktails are all margaritas, with which the menu was too vague to mention such. I found out from the server. I hate margaritas! \n\nThe shredded beef taco was too salty for my taste buds. \n\nAnd the vegetable taco was also yummilicious. \n\nI cannot vouch for any of the other tacos people ordered, but everyone was happy. One of our buds claimed that the soft taco shell itself tasted funny, but to me it was fine - I guess he's not accustomed to traditional corn taco soft shells. \n\nThe ambiance is cool and hip. We sat at a long table(s) close to the outside. The windows were open so there was less of a feeling of being pushed against the wall. \n\nThey also had a handful of desserts, that looked mmmmmmmmm! But we didn't get around to it. \n\nI'd go back for another round (of tacos) another day and maybe try a dessert! \n\nHappy eats!", "author": "Ronit M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Best tacos in California! Unique and tasty... affordable and fun.", "author": "H M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "Taco + Delicious = Tacolicious! DOH! Tacolicious does not have the most affordable tacos (about $3-4 per taco) to be honest, but they aren't bad and some of them are super flavorful! It is also better to go in bigger groups as tacos are cheaper when ordered in a greater quantity. \n\nBest Tacos: \n-Short Rib: juicy and flavorful strip pieces. My personal favorite! \n-Pacific Cod: Crisp and tasty batter - just wish there was more. \n-Beer Battered Chicken: Very juicy and the chicken has a light and zesty flavor to it. \n\nJust Okay Tacos:\n-Bistec: Way too small for what you pay for. \n-Chorizo and potatoes: Hit or miss - not a consistent portion ever \n-Summer Squash: Wish there was more sustenance like beans with this. Or atleast another seasoning. \n-Carnitas: Nothing Special. \n\nAlso, there are three beautiful sauces - the yellow one is way too spicy and the others are great especially with the short rib! In terms of drinks, they currently have a pomegranate margarita that is so refreshing. I also wish the Sangria had a bigger kick to it. If you come here during dinner time and especially on the weekends, the service is kind of slow, but usually the servers are very receptive! If you are going to get the guacamole, there's nothing really special about it, but it is still a great starter. \nThanks Tacolicious for a Delicious time! :)", "author": "Eric Joseph D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "I love tacolicious. When you sit down they immediately give you free salsa and chips. The salsa tastes amazing. Their tacos are always a beautiful display. The food comes fasts. Their happy hour menu is fantastic. Ambiance is great and you won't break your wallet.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-28", "description": "A fun spot that definitely serves some cool, unique tacos, but the apathetic service here really kills the mood.\n\nI came in with a close friend and one of her buddies that was vacation in SF for the first time. It was about 3PM and the place was practically dead, so we were expecting some pretty speedy service. Wrong. The waitress would stop by us rarely, acting as if tending to us was a chore (it wasn't - all we asked for was tap water and three tacos). The food took a long time to come out, but I admit that when the food came out, it was good. The shot-and-a-beer braised chicken taco was simple but totally yummy, tiny yet hearty. The accompanying salsas were also all delicious and complex, it was really fun to mix/match them with the different tacos. \n\nIf you're nearby and lackluster service doesn't particularly bother you, then I would say that this place is worth a try just because the tacos are pretty delicious. But personally, the only time I'd come to Tacolicious again is if I try a different location in a gamble for some better service.", "author": "Desiree S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "*** This is based on a to-go order I placed at the bar ***\n\nDue to long wait times at every nearby Italian restaurant in the Little Italy district on Sunday (7/31/16) night, my wife chose to get pizza at the by-the-slice window of Tony's next door -- I wasn't in the mood for pizza, and had just scarfed down a side of chow mien I picked up on our walk through Chinatown, so decided to check this place out\n\nIt's a bit funny/random/weird to find a taco-themed restaurant smack dab in the middle of Little Italy, but man am I glad I took a chance, I'm 39 and got hit on by a mid-20's hottie while placing my order, always a nice ego boost; my wife said I should have let her buy me a shot, hopefully they'll be a next time - I'm always game for free tequila :)\n\nAs for the food, I paid about $5.50 (before tip) for one jam-packed full carnitas taco (full size, not those wimpy street taco 3-biter tortillas) ... BEST carnitas I've ever tasted, even better than any Mexican restaurant in Los Angeles or San Diego - perfectly seasoned meat, and a side of chips & salsa were included -- also came with 3 types of \"sauces\" for the taco; I used the green creamy one that tasted like avocado, it was very good\n\nI would recommend this restaurant to anyone headed to San Francisco, definitely added to my must-eat list for any future visits to S.F.", "author": "Cory H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-14", "description": "When I started mentioning to people I was heading to San Francisco for a little trip, everyone and their mother told me with vigor \"you must have tacos while you are there\". Being one of my favorite things in life, I obviously knew I would not skip this activity. \n\nMy friend and I were walking around the waterfront and stopped into a restaurant to have a glass of wine and talk to the bartender about good local spots. When we said we wanted tacos, he told us to go to Tacolicious. The name alone completely sold me. I didn't require any additional recommendations. \n\nWe walked over to this little taco joint and were pleased with the colorful and airy interior. A friendly staff member bounded over to us and let us know we can sit anywhere. We grabbed a seat by the window and she came right over to take our drink orders.We decided to get a pitcher of the Sangria Roja (red wine, apricot brandy, spicy apple salsa, OJ). We loved it. It was refreshing and just a little bit sweet. \n\nWe had some guacamole to start which was really great too. I'm a complete sucker for tortilla chips and these didn't disappoint. \n\nThen we had tacos. Oh lord, so many tacos. \n\nThe Baja Style Pacific Cod was awesome. Fresh, light, flaky. Guajillo Braised Beef Short Rib was unreal. So well cooked and bursting with flavor. Chicken En Mole Colorado was awesome. I'm not usually much of a chicken fan, but these are moist and delicious. I think we got two of each and it was WAY too much food. So dumb. So tasty. So going back. \n\nI loved the casual vibe of the place, the swiftness with which they delivered my meal and sangria refills, the kindness of the staff. \n\nNow if only they would open in NYC...I think it would be a real hit.", "author": "Lauren B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "I know good tacos; I was brought up having the best tacos in Mexicali, but these tacos are out of this world. I'm so impressed with their vegetarian variety. They are scrumptious!!! I'm surprised it doesn't have better reviews. I'm bringing my whole family here", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "First time coming to this place for my coworker's cousin's birthday.  I'm a big margaritas fan so I naturally wanted to try one.  It actually was pretty good...one of the best I've ever had.  I didn't taste the sickly sweet pre mixed syrup and the lime juice tasted real.  That in itself made most of the night.  The tacos looked good although much fancier from what I'm used to at traditional tacquerias.  However, after trying one, I was hooked.  Delicious tacos as expected.\n\nI definitely can see myself coming here after work to have tacos and margs.  The place gets packed at all hours of the night as it is a dinner and post dinner spot.", "author": "Ben H L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-08", "description": "The food is okay nothing to say here. However the service was terrible had to wait 20mn before going to the bar to order then trying to get the check was even worse took 20mn and one wrong check!", "author": "Florian P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-13", "description": "Woah.. \n\nI walked in for lunch on a Monday and the first thing I noticed was the casual/ hipster vibe, employees didn't have a t-shirt or uniform just regular clothing. The hostess who greeted us didn't seem to care much and without any discretion, texting on her cell phone (charging ) by the bar next to other guests. \n\nI was sat by the computer in the back booth, apparently the servers hang out spot because they were standing directly behind my chair the entire time which made me feel uncomfortable. They could of been checking up on tables or keeping busy instead, that made me feel rushed and I didn't stay for long.\n\nMy initial thought was where is the manager?? That should never be allowed. \n\nMy server (1 of 2) was very sweet and about the only one who was actually doing her job. One star there. \n\nThe tacos were yummy and the salsas are awesome, that's another star. Overall the tacos were overpriced and I had a very unprofessional experience.", "author": "Ana B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "I've usually been a big fan of Tacolicious - wide variety of tacos, fresh meat, good service. However, the last time I went on October 29, 2016, I was let down. My group always starts off with chips, salsa, and guac. When we ordered the guac, the waiter told us there was an avocado shortage and suggested we order queso instead! I was in disbelief - what Mexican restaurant doesn't serve guac! Then days later, November 3, 2016 to be exact, there was a huge news announcement about how the avocado prices had dropped almost $1 per avocado. So remembering back on my economics classes, the supply and demand methodology wasn't adding up.\n\nBesides the 'avocado shortage,' the meat seemed to be a bit greasier than usual. \n\nThe plus side of this visit was that we learned how amazing the crunchy shell tacos are. Please keep those on the menu!", "author": "Emmy Q."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-02", "description": "Terrible customer service!! Waiter was very rude!! Never coming here again. As a customer, I think it is disrespectful for a waiter to tell me to \"relax\" if I am trying to explain to her for the third time what our order was!!", "author": "Laura Ann M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-11", "description": "On weekend nights young, hip 20-30 somethings fill the dining room consuming margaritas and other cocktails.  The vibe here is real!  My fellow North Beach pals and I enjoy eating and snacking at Tacolicious before we head out on the town.\n\nThe complimentary chips and salsa rock here! I think I ate an entire bowl of chips before my main entree of tacos arrived.  \n\nThe 4-taco special is a great way to sample different types of tacos offered.  A selection of salsas and sauce accompany the tacos-- watch out of the yellow hot sauce!  The special taco is available in the 4-pack special for an additional charge.  I'm glad I went for the special taco in my 4-pack as it was my favorite.  The special during our visit was the Vietnamese chicken taco.  Wow-- this was not only unique but also absolutely delicious.  I hope this makes it only the menu permanently.  \n\nThe noise level here is much higher than average.  This may not be the best environment for an intimate date.", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-10", "description": "Great place for tAcos and drinks. I generally  order whichever fish or shrimp are on the menu and my husband goes for the braised beef and carnitas. Love the roasted brussel sprouts but the sweet plaintains are never ripe and therefore taste bland.\n\nKids meal is excellent value - $8 for taco, rice & beans, agua Fresca and two scoops of ice cream!\n\nOn Mondays they donate 15% to a local public school - another reason to frequent a local business!", "author": "Serena S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-21", "description": "It's funny how when restaurants expand into multiple locations, the service & the product turn into one big crapshoot.  \n\nAm I right?\n\nIf we're being honest, perhaps the only chain to successfully beat this phenomenon is...\nStarbucks.\n\nSay what you will about the coffee conglomerate, but no matter what, I can count on my green tea, soy, & unsweetened latte to be fabulous; regardless of barista or location.  99 times out of 100.\n\nBeating those odds is the challenge.\n\nTacolicious positively kicked butt w Chestnut Street.  Then, w Valencia, it seemed like the apple fell close to the tree.  \n\nBut North Beach?  Meh.\n\nService here is always friendly, & usually efficient.  Props for that.\n\nBut on my most recent visit, I came in w a dear old friend just to catch up.  We sat at the counter (between the bar & the dining room) & only ordered the queso dip & guacamole.  While they did keep the chips coming unprompted, yet on cue, the chips were on the stale side.  Bad chips?  No bueno.  \nThe queso dip was piping hot, but it lacked kick, & was on the runny side.  The best thing was the guac, but even it was a bit bland.  \n\nDonde esta el sabor?\n\nThis location (wisely) pays homage to the neighborhood w their shot of fernet, a beer, & a taco deal.  No collective area loves their fernet branca more than north beach.  Outside of Italy anyway.  Props for that.\n\nAll in all, I still prefer Valencia street.\n\n3 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "We saw a huge rat run across the back bench while we were dining.  It continued to run back and forth and down the gap in the metal support beam, while we ate.  Yikes!  We informed the waitress who seemed genuinely alarmed but nothing was done about it.   I'm not sure what they should have done, but maybe could have comped the meal or investigated it or something.  I guess they did not feel responsible as blame was placed on the chinatown subway construction.  That may be true - I don't know - but if it is then maybe avoid all restaurants in chinatown/northbeach!  Either way, it's lame to just shift blame.\n\nFood-wise - it is ok.  Very few choices, but decent tacos.  I've had better for sure.  I enjoyed the meatballs the most!\n\nGiven the rat situation, I'd recommend staying away until they have exterminated the place.  I'm not sure how long it will take them to resolve it considering the lack of interest in the rat (maybe they already knew about it?)", "author": "rahul c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-25", "description": "Our server, Dino sucked.. It took 20 minutes to get us straws and 50 minutes to get us our tacos.. There was only about 8 parties in the restaurant. \n\nHe was cocky and full of himself.\n\nMy fiancé and I were thinking out buying out the whole restaurant on a Friday night for our rehearsal dinner for 60 people. They could of had our 20k.. We're going elsewhere.. \n\nDino was never around until the very end. I think he finally realized he had to work harder for a tip because we were in no mood. He showed more attention to the two guys who were obviously on a date with each other.. He was major c*ck blocking and the guys were annoyed. \n\nThe food isn't worth mentioning since the service sucked big time! \n\nWe came on a Friday afternoon on July 25th, 2014 around 2:30pm if the management feels like this is worth investigating.", "author": "Darlene M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-09", "description": "The music at this location is very loud if you want to have a conversation, you are better to find another place.  We ordered pork, beef, cod and chicken tacos and they were all salty, dry and spicy.  We couldn't eat any of what we ordered so had to throw the entire dinner.  What a shame.", "author": "Cindy R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "Taco Tuesday! Just kidding I'm not that excited about it.  It's was actually the worst tacos I've ever had in SF.  The meat was not flavorful, the taco shells were old and stale, and the rice and beans were cold. The bartenders were ripping tequila shots behind the bar not paying attention to guests while one guy was being super racist telling some Latino guy he wished he would grow his mustache out and wear a sombrero.  Really?!? Did you just really say that nasty comment to this guy?  If you spent more time focusing on your guests and not ripping tequila shots, your margarita might have actually been balanced properly and your tacos wouldn't have sucked so hard.  Gross.  Food, beverage, and racism.  Who could ask for more.", "author": "James L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "This is a really fun, trendy little taco place I found on my visit to the city over Labor Day weekend. The menu wasn't very large but the tacos were seriously delicious. I enjoyed the open kitchen and watching the chefs make the tacos. Even though they were busy, I got my food within 10 minutes of ordering. My waitress could have been friendlier. She hardly made eye contact with me the entire time but was very talkative to her other tables around me.", "author": "Morgan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-09", "description": "Quick Review: Another trendy Mexican spot in SF. Overpriced but tasty tacos, healthy options and good drink options. Be prepared for a long wait for long groups\n\nFOOD\nCamarones $12.75\nShort Rib taco X1 $4.75\nThe meat of the short rib was very good! Great flavor, very authentic to Mexican street tacos. But they rip you off with only letting you order 1, 4, or 10 tacos. Nobody pays $17 for 4 tacos. The shrimp was also very spicy and not a lot. It came with 2 tortillas.  That dish was ok, I'd rather order the tacos.\n\nSERVICE\nOur wait was over an hour, but understandably so because we had a group of 14. Our order was taken fairly quick and the food too. Our party was so large that a few of the orders were just put on the table and we had to figure it out. They were very nice to split our bill into 3 tables and took as many cards necessary.\n\nAMBIANCE\nTrendy spot in north beach. The bar has 2 TVs playing that were playing the warrior game. Bar stool tables, minimal decorations.", "author": "Brittany S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-25", "description": "I think you know what you're getting into when you go to Tacolicious.  It's expensive for what it is but can be satisfying.  But I do sometimes avoid coming here because I think the seating and set-up is beyond terrible. Unless you get one of the few booths along the wall, you're sitting on this plasticky, rickety tall stool you wouldn't even find in the dive-iest of bars. But the worst part is the lack of hooks under the table or along the walls while your party of three is sat at a table clearly meant for two. You're either wearing or holding onto your jackets or bags. Although I do see a lot of people just toss them on the not-the-cleanest of floor or sit on their jackets (which I've seen more than once have food or drinks dripped into it by passing servers).  I would suggest to install some hooks; I really don't think it would be that expensive.", "author": "whatever I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Returned after our initial visit to San Francisco and this place is still just as good as the first time we went! They have some of the best guacamole and tacos we've ever had anywhere. The tacos have a lot of filling, so three is plenty for a normal person. Very reasonable prices and great service. We were there on a Friday night, so it was loud inside, but didn't bother us because the food was so delicious. We loved the hint of mint in their salsa.", "author": "Cody J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "Their queso dip is my favorite thing on the menu. You won't regret it. Their tacos are a little overpriced to be honest, but their sides are awesome. It is definitely more of a high end Mexican food not an authentic Mexican food.", "author": "Jenna G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "As a devout lover of tacos and Mexican food in general, I adored this restaurant and the quality of the food. The meat they use for these tacos are so juicy, soft and tender that it's like eating a steak. (Try the carne asada tacos if you want some tasty steak.) And, as always, the tacos are made with the authentic soft tortilla wrap, not that wannabe-taco Doritos shell. My personal recommendations are the chorizo and potato tacos or the carne asada tacos. Check it out.", "author": "Elliot F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-18", "description": "Two stars for the food, it was good in parts. The service was complete trash. They messed everything up, were unapplogetic about it and it was super slow....wtf like why would you expect a tip if you make your patron work for the food? Bday dinner ruined", "author": "Asya M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "This place is ok.  \n\nIf you must get the tacos, avoid the Filet Mignon.  As good as it might sound, it's not worth it.  You end up getting 3 small pieces of meat on 2 corn tortillas with 1 caramelized onion string. Plus it's $3 extra (for a total of $7.95).  Instead get the \"shot - and - a - beer braised chicken.\"  It's $4.95 and you get a lot of meat on this taco, to the point I was able to separate take my 2 corn tortillas and divide the meat between each tortilla and still each taco was big.  \n\nThe bar here is pretty awesome.  Nice cocktails, but a bit pricey.  It is worth the stop.  My favorite is the sangria roja.\n\nThe Chips and Salsa is really good here as well.", "author": "Rose Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "Pros:\n\nDelicious food (when there isn't hair in the food) \nFully stocked bar\nFood gets to you fairly quickly \nNapkins are of good quality. You won't be murdering the napkin dispenser with constantly pulling out Napkins.\n\nCons:\n\nService could have been better.\nDon't remember ordering the hair taco. (found a hair in one of our tacos.)\nI was using the restroom and I had it locked, One of the workers gave a customer a key to unlock the door. The restroom is a single person restroom if you hadn't guessed it by now. \n\nThe food is good when hair isn't in there. The service is not. \n\nGo ahead and try it. Just double check your food. \n\nEnjoy!!!", "author": "Joshua R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "Solid Mexican food, but nothing that really sets it apart. The taco fillings were a little greasy but not overly so, but weren't particularly distinguishable from other Mexican places in terms of taste.\n\n-GUAJILLO BRAISED BEEF SHORT RIB - 4/5\nMy favorite of the meats we got. The beef had nothing special going on flavor-wise, but it was superr tender. A little fatty and greasy, but not as fatty as the carnitas.\n\n-TRADITIONAL CARNITAS - 3/5\nKind of fatty. A little salty but sweet at the same time, but flavors were weak.\n\n-SHOT-AND-A-BEER BRAISED CHICKEN - 2/5\nChicken was shredded and on the dry side. Had a little heat but was too salty\n\n-BUTTERNUT SQUASH, PASILLA PEPPERS, SWISS CHARD, PEPITAS - 3/5\nPretty greasy. I don't think I'd order this again, but it makes for an interesting vegetarian option. The squash is cooked nicely - neither mushy nor hard and undercooked.\n\n-RICE-O-LICIOUS - 2.5/5\nNot bad, but the texture is too mushy for my liking\n\n-GUACAMOLE - 3/5\nTheir guac is SUPER creamy and doesn't have tomato in it. Not strong with the lime/acidity either. I usually like chunkier guac, but theirs isn't bad.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Reluctantly had to come here for a networking event and I have to say management definitely has changed a lot since my last visit.  \n\nOur server Jennifer was great, food tasted fresher than I ever remembered it.  The manager is gone and the staff seemed really on it.  I'll be back for sure.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "One of my favorite places in North Beach! Great drinks, the food is amazing (tuna tostadas are a MUST) and the service is always attentive and friendly.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "You know that scenario where you land in town, your friend is still busy at work and you're walking around aimlessly for something to do in a short amount of time, within the neighborhood you're staying?\n\nYeah probably not. \n\nWalking around North Beach and after checking out Washington Square Park, I was walking over to some bars I knew about, around 3 o'clock. \n\nAs I'm walking I see an employee bring out the chalk board, which says happy hour 3-6. \n\nThat was convenient! \n\nStep in and grab a seat at the bar, I was ready to start my vacation the way I normally live my life, drunk. Saw a nice deal, tequila, beer and taco special for $10 bucks. \n\nThe bartenders and I started chatting it up. I inquired about the local beer, liquor and grocery stores around. They were very helpful. \n\nThe carne asada taco was packed. I was able to split my soft tortilla into two and essentially get two tacos out of it. It came with three sauces, all of which were pretty good. \n\nOrdered another beer, they didn't even charge me. Left a nice tip and went on my way.\n\nGreat staff, very friendly, super helpful. Seems like an awesome spot to hit up for happy hour if you're free that early.", "author": "Mitch E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-13", "description": "This is one of my favorite restaurants I've ever been to.  Nailed it!   Tacos are amazing with HUGE portions of meat.  Cocktails are creative and delicious.  Environment is fun and lively.  Get over here and try this one!", "author": "Larry B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "The place/atmosphere was fine. Service is fine. Tacos were fine. But I guess if I just wanted some tacos I'd just go to a taqueria.", "author": "Tinou B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-29", "description": "Had lunch with a friend last Friday when the weather was California-terrible (I feel like I always have to qualify any negative statements I make about our weather since plenty of East Coast friends have filled my Facebook news feed with photos of the #polarvortex).  \n\nI left the office at 12:30, trekked from the FiDi to Tacolicious in about 15 minutes, and realized that I really, REALLY need to start exercising because it was just embarrassing to be red faced BEFORE even partaking of the libations offered here.\n\nAnd let me tell you 'bout their libations.  Oh wait.  I can't.  That's right... it was lunch on a work day.  And I work in HR.  (Note to self: come back over the weekend).  Seriously, though, they've got one gorgeous bar set-up.  Like something you'd want to see in MTV's cribs.  Get on it, Lil' Wayne.\n\nI got one of the high tables and chairs for two in the middle of the dining area and found the seating... adequate.  Let's just say that they definitely aren't encouraging people to stick around for long chats unless you're comfortable with being uncomfortable.  I did, however, appreciate the purse hook that was built in... but there was only one of them.  Would it really have been too much to ask to have put in two?  Quintessential #firstworldproblem?  Sorry.  :(  I'm not complaining; I'm just sayin'.\n\nThe waitstaff promptly bring out glasses, water, chips, and salsa when you arrive.  The salsa is not spicy at all.  (I'm a total wimp who can't handle hot cheetos so I should know.)  When my friend arrived, we decided to split the 4 for 14 taco platter since neither of us were all that hungry.  She had been there before with coworkers and recommended the beef short rib (a quick skim through Yelp reviews seems to confirm this, too).  I, however, had a hankering for chorizo and since I couldn't drink, the \"shot-and-a-beer braised chicken.\"  \n\nI'm guessing that all of the filling is prepared ahead of time and just spooned into two freshly heated-up-on-a-grill corn tortillas.  I know that that's just practical for the restaurant, but I'm not a huge fan of cold chorizo.  I mean, I know that it's not the greatest thing for me, but I don't need to have that point emphasized when certain bits and pieces have congealed on me.  The braised chicken, though, was amazing even though it was cold.  If I come here again while ravenously hungry, I'll want to see 4 of those suckers on a plate.\n\nAll in all, I'd definitely come back if I was in the area, especially for their weekend brunch and some drinks.", "author": "Iona C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "This is the third Tacolicious location I've been to (previous locations are in the Mission and in Mountain View). Upon arrival, I noticed it was rather empty - which has never happened to me before at any of the Tacolicious locations. My friends and I sat down and were greeted by a nice gentleman who then introduced our waitress. \n\nThe four of us ordered some sangria, guacamole, and a plate of tacos to share for the table. I was incredibly impressed that the gentleman took out order without writing anything down and brought out all of orders without any mistakes. The food was mediocre and fell flat compared to the other locations on my opinion. I also noticed that they had removed the pork belly tacos from their menu which are my favorite. \n\nThe waitress, after initially being introduced, didn't return to our table until it was time to get the check. I am surprised she even bothered to come back, seeing as the nice gentleman had handled everything for us. I really hope that he received the tip we left.\n\nOverall, the atmosphere was nice, the food was mediocre, and the service was great (from the guy, at least). I'm not sure I'll come back to this one, and may have to give the Mission location a second chance to see if they, too, have gotten rid of the pork belly tacos.", "author": "Mike D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "You know, for yuppie tacos, these are pretty darn good. \n\nI'm quite a fan of the made-to-order guacamole. It's bright, fresh, and flavorful with just the right amount of spice for a little kick. Pair that with the trio of salsas/dips and you will have no lack of good choices for your chip dipping pleasure. Now onto the tacos: I love the braised beef short rib taco. It's incredibly tender but bursting with flavor that only slow braising makes possible. It's nice and salty but with some heat to balance it out. The fried cod taco is a close runner up. I like the flaky fish with it's crispy batter exterior but it's well balanced with the cabbage and creamy sauce. No taco meal for me is complete without carnitas and they do it pretty well at Tacolicious but the edge goes to mom and pop taquerias on this one. \n\nThe veggie taco is also really good here with the amalgamation of flavors from the asparagus to the oyster mushrooms to the garlic. The flavors work well together and that's what Tacolicious does well - putting a contemporary spin on the humble traditional taco. Pair it with some margaritas and beers, you've got yourself a good night of dining and conversation. Beer, shot, and taco specials for happy hour and they have a taco Tuesday deal too I believe.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "Great happy hour. 6 bucks 3 tacos. 6$ glass of wine. Excellent service. Outdoor tables overlooking washington sq park", "author": "Mitch W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-16", "description": "Solid place. My husband and I have been here twice now and both times have been good. \nDefinitely not authentic, but I don't think anyone comes here for authenticity. \nOverall a good vibe. A little pricey but what isn't now? And solid food. The fried plantains were my fave. And my husband had had all the tacos. He likes the brisket and chicken the best! \nIf you're in the area I'd recommend it.", "author": "Angela C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "Service was great but prices are ridiculous \n$18 for 4 tacos - all were delicious but tiny, $4.50 for a 2 bite taco\n\n$41 for a pitcher of house margaritas - split with the wife and not even a hint of a buzz afterwards\n\nNext time I'll take advantage of the free chips and salsa and go with a draft beer and a tequila shot", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-16", "description": "I've been here several times, and I don't know if it's just this location but the quality has gone down hill. I used to go to the tacolicious in Marina often and got really excited when they finally opened a location in North Beach, but it's not the same. Several issues:\n\n1) way under staffed. The manager has maybe 2 servers during peak eating hours. I understand the trade off by maximizing profit, but the wait times are not ideal.\n\n2) what do you do to compensate for the lack of staff? It seems you make tacos ahead of time to meet demand. So when I order 4 tacos, they're not hot, the tortilla is not fresh and the fried cod is cold. WTF? \n\n3) to make matters worse, you charge 5% for \"San Francisco health tax.\" Okay, cool but now I'm subsidizing the fact you underpay your staff and there is a lack of them, so I feel I am taking the hit twice.\n\n4) you keep raising prices. I am aware of this city's inflation and how businesses have gone out of business due to the lack of rent control. But $18 for 4 cold tacos with cold tortillas? No thanks.\n\n5) margaritas aren't that great either. Sorry staff, but I expected so much more.", "author": "Karl A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "This place has delicious tacos! I just wish they delivered so we could order them for office lunches. I'm not a vegetarian, but their veggie tacos are really good too!", "author": "Elena K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-11", "description": "Disappointing. So disappointing. I had heard from a couple coworkers that this was the place for tacos. I read on Yelp the raving reviews about the short rib taco. All disappointing.  I wouldn't bother coming here for anything except maybe to have some drinks with friends.\n\nOther things that made my experience poor? The lacklustre service which made me feel like I was being a burden by even being there, the salty guacamole (tragedy!) that we had to send back, the head poundingly loud acoustics (music + people = LOUDLOUDLOUD).\n\nI hear that other locations might be better, but I can't say that I'm in a rush to go check them out when SF is filled with so many other places for tacos.", "author": "Colene C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "Tacolicious is always a reliable choice!  I usually get a couple different tacos (the cod is delicious!) and I also recommend the margaritas! It's not super filling unless you order a lot or eat a lot of chips... guilty :P\n\nFood and drinks are on the pricey side but kinda standard for this type of place in SF. I often suggest this place when I'm meeting up with a couple of different people because it seems to be universally well-liked.\n\nUnfortunately no reservations, I think only the Mission location does them for large groups.", "author": "Connie Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-26", "description": "Friday night was pretty busy but luckily, seats at the bar were available. \n\nTo start off, I loved the chips and salsa and was adding the salsa to the tacos I had. They do bring out three more additional salsas (mild, medium and hot) with the tacos but my preference was the chunky salsa that came out with the chips. I shared a bunch of tacos which were loaded with fish/meat. We got the following flavors: fried local rock cod, shot-and-a-beer braised chicken, traditional carnitas, guajillo braised beef short rib, and house-made chorizo and potatoes. My favorites were the rock cod (hunk of cod with a crunchy batter) and the braised chicken (moist, super flavorful and saucy) tacos. I wasn't very impressed with the other three flavors but it really depends on what tickles your fancy.\n\nService was spotty. I didn't even realize there was a hostess until we were leaving so I don't think she did a very good job of greeting folks but she at least smiled and thanked us when we left. The bartender just simply took our order and gave us the bill. But the guy who delivered our tacos was the friendliest of the bunch.  \n\nIf you plan to pay a visit, look out for the little taco picture. I don't think I saw an actual sign with the word \"Tacolicious\" out front.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "The chips and salsa are great, the guac is great, the carnitas and chicken tacos I had were amazing. I loved that they had fun/unique (& REFRESHING) drinks that were nonalcoholic (in addition to the alcoholic drink selection of course!) Everyone in my group cleaned their plates and service was fast and friendly!", "author": "Tina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-05", "description": "If I could give this negative stars I would. My girlfriend and I ordered takeout today, two Marina Girl salads with Chicken. The Chicken aside from being minimal portions at best doesn't even equal a whole Chicken breast between the two. The chicken was also burnt, dry, and appeared to be yesterday's left over chicken. The salads were also entirely romain lettuce, no avocado, cucumbers, radishes, etc which are normally in the salads. For $14/salad I expect at least what the description says. The fact that the quality of the food and amount of the food vary greatly depending on if you order take out or dine in is just poor quality control from the management.", "author": "Josh N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Very nice service. All staff are friendly and very attentive.\n\nFood is a little too pricey. Tiny portion & not filling. I ordered beef tacos with picked onions: they were great but again, very tiny portion.", "author": "Salisa K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Thank you Tacolicious probably hands down one of my favorite steak tacos I've ever eaten in my life. I eat Mexican food 5 days a week. ;)", "author": "Codi B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "As much as I ADORE tacos, there are few that can really grab my attention and keep it. \n\nThis was one of those times. \n\nI wish they would've given me an unlimited supply of tacos from here because I easily could eat them for breakfast, lunch, dinner...midnight snacks, brunch, and \"after the break-up binges\". \n\nThey were that fantastic. \n\nThe chips and salsa both really hit the spot, and when we got our tacos (which were $5 by the way, cheap for San Fran) I was in heaven. I tried the carne taco and it was the perfect size. The best part is, they put another tortilla shell under the one cradling the meat, so technically you can make TWO tacos. \n\nThey do no skimp on the meat either. And they bring some side sauces to compliment your meal. Mmmm mmmm soooo good. \n\nThe design is fun and hip. Orange and silver make it look posh and sleek. And the water \"pitchers\" are fun too. Take me word for it, you want to come here. \n\nTIPS & TRICKS: \n* Try the shrimp taco, it's fresh and delicious, especially with us being right next to the ocean. \n* Get a Mexican Coke, just a coca cola in a glass bottle, but it is great.", "author": "Haley N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "We wandered into Tacolicious after walking around Chinatown, North Beach, and a failed attempt at Coit Tower. We were hungry people. \n\nAnd this was indeed the place to satisfy our hunger. It was pretty empty on a Saturday at noon, which could be a turn-off for some, but was a turn-on for us. Again...hungry people. \n\nThe menu is mouthwatering. We had a hard time deciding what to get. So we compounded that with five tacos (him), and one taco and a side of rice (me). Holy spiceballs, it was spicy. Even for him, a man usually unfazed by all things spicy. Spiciness aside, the food was delicious and I'm already craving my taco (the weekly special Halloween-themed taco: shrimp, beans, two different kinds of crema, etc.). The beans, oh, the beans - YUM. So creamy. Yes, I'm singling out beans amongst a vast sea of other bomb ingredients - I didn't choose the bean life, the bean life chose me.\n\nOh, and if you're positioned just right in the restaurant (i.e., a table facing the bar), you'll see a picture of President Obama tucked away in the hallway, smiling. No, he hasn't visited - I asked our waitress. Yeah, I was excited for a minute there, too. \n\nGo for the tacos (and um, the rest of the amazing-looking food on the menu, too!) and for the candid picture of the President, if you're so inclined. I don't think you'll be too disappointed.", "author": "Morgan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Had s get together after work with some ex coworkers.  Tried a variety of tacos.  Enjoyed the fish and the chorizo tacos with various salsas. Margaritas was pretty good as well.  Service was ok but it was extremely crowded when we went so it was difficult to get a waitress for while to take our order.", "author": "FG L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "Everything here is great. The salsa has a hint of mint in it which I love. Not a fan of the intense fast paced music while eating that's the only negative I have to say. Love their tortilla chips.", "author": "Kristen K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Took a short Uber ride from Fishermans Wharf to Tacolicious and I was not disappointed. Arrived in time for happy hour and they were playing the warriors game on all the TV's. Very chill atmosphere. Service was A1. Happy hour prices were great considering the area. The tacos are small but flavorful and filling. Nice selection of drinks and superb shot sizes. Definitely recommend for happy hour.", "author": "Richard B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "This location continues to have the worst service one could possibly find in the city. I do not understand how it's still open. It seems like it's run by a high school student as an after school project rather than an actual business. I suppose it's still open due to tourists who don't know any better. Please do yourselves a favor and go to Don Pisto's up the street or the Chestnut location.", "author": "Katy M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-07", "description": "If you're allergic to peanuts, STAY AWAY from their chicken mole taco.\n\nUnless you want to die.\n\nBecause that almost happened to me.\n\nChips and salsa were solid though.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "Omg!  The best Margherita I have tasted ever in the world!! Made by our most adorable bartender Claudia!", "author": "Mezzi M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-17", "description": "Tacolicious doesn't have the hustle and bustle of typical tacquerias....definitely more of a modern sit down restaurant to just kick back and catch up with some friends. The crowd was small when we entered for a Monday at lunch. \n\nTried a variety of their tacos, but to be honest, I wasn't blown away by any one of them. Granted, I ordered a plate of tacos for more of a value...but when you consider the fact that the single taco is $4 each, its pretty pricey as far as Mexican food goes. While each taco was piled nice and high, the flavors were all kind of flat. Not enough seasoning all the way through...especially for the braised short ribs and braised chicken...midway through it was just meat. While that's all good fun, it was difficult to get through without the additional salsas and lime they provided...to really add that extra kick. Kind of disappointing if you ask me.\n\nThe single redeeming factor to my meal was the chips and salsa. \n\nNow those were good.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-30", "description": "Food is good (and where do you find goat for tacos?), but SSSOOOO LLLOOOUUDDD.  Also, for the most part, very uncomfortable seating (bar stools throughout except one row of booth-style seating along one wall, all taken).  Won't go back, unless they tune the music (which drives up the loud conversations) WAY down.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-21", "description": "Great bartenders and great place for drinks.\n\nEating dinner here - didn't refill waters the entire time never saw our server on the floor. Had to keep our eye out for her and ask twice for chips and water.\n\nIf you're a vegetarian or vegan careful when ordering - the meat tacos were slammed up against the veggie tacos. Had to re-order and it seemed like a surprise to request vegetarian on a separate plate.", "author": "Kelsey L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-02", "description": "Significantly less tasty than the marina or mission version, really wasn't pleased with the meal for $45. Terrible.", "author": "Brittney B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "Pleasant atmosphere with some nice outside seating for a sunny day.  Was looking for something lighter than pizza while passing through North Beach and got a great salad - the Marina Girl - with chicken. I didn't have the tacos but they looked delicious and will have to do that next time.  If you're looking for a place to watch the game and have a margarita, this is a good choice for that too.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-16", "description": "It was getting late, but I wanted to grab a quick bite before the trek back to our lodging for the evening. And that's when I saw the sign...an orange-glowing beacon of hope in the shape of a taco. I had to go in. \n\nYou know how sometimes when you're out in the daylight for a while, you have to adjust your eyes when you step into a restaurant, because of the change in lighting? Well, it was already dark outside, and I still had to adjust my eyes when walking in because it was so dark inside of this place. I had trouble reading the menu at the bar; the candles were useless help.\n\nI wasn't looking to splurge, just wanted a quick snack. A grab and go from the bar if you will. But the bartender seemed to think I was coming in to casually enjoy a cocktail and order a full plate. Though I tried to drop the hint that I wasn't interested in anything other than a mere taco to go, they suggested that I try at least two. Fine. They took much longer than I expected getting the order put in and the food out to me. Tacos were okay, but not what I was expecting when I was lured in by their logo. Tacovicious, rather.", "author": "Christel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-24", "description": "Complimentary chips are thicker than what I'd prefer but the salsa it comes with is refreshing & tasty. \n\nPlantains were good. I'd prefer them being more sweeter. They just needed these to ripen a bit more. The Crema cumin that it comes with is excellent.\n\nShort rib taco has plenty of meat but very oily. \nRock cod taco of the week was good. Big piece of fish and tasty. \n\nService was great with female waitress. She followed up with me on more than one occasion. \n\nService was NOT good at all from guy waiter. He simply dropped off food took my order as if he has no desire for a tip.", "author": "Ivan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-01", "description": "Foods is delicious, drinks are good, blah blah blah, but my real tip is ELAINA is the best waitress I have literally ever had. Request her and have the best dinner ever! We love you, Elaina!\n\nPs order the passion marg and the short rib taco- delish.", "author": "Kaitlin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Wow what a gem!  Loved the dinner.  We were headed to Tony's for pizza but due to the wait we went next door to tacolicious and we were so glad we did.\n\nBest taco in my opinion is the chorizo and potato taco.  The plantains are great as is the salsa.\n\nI couldn't find a fault 5 stars!", "author": "Smorga M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "THIS IS THE BEST T LISH IN TOWN. I've been to every tacolicious in SF and hands down this one is amazing. Amanda runs a tight ship whenever I'm around, which feels like every time I come in and that's a lot. \nAnyway the taco of the week is buffalo chicken and it's made to precision. Not too much Frank's red hot sauce, perfect breading, amazing chicken, what more can I ask for? \nOh and don't forget they have my favorite cider- Crispin. \nAmanda keep up the awesome work your crew and you are the best \nPs These bartenders know what they're doing.", "author": "Chauntae M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-23", "description": "I'm a fan of the other Tacolicious locations, and generally think their food & drinks are OK. The service at the North Beach location is so bad it's mind-boggling. We have given this place so many chances, but the service stinks more and more each time. Here are some examples of what we've experienced at this location:\n\n-Long wait times when the main dining area is sparsely seated and there are multiple servers/hostesses on the floor\n\n-Apathetic/unfriendly hostesses and waiters\n\n-Incorrect food & drink orders\n\n-Ignored by waiters when we're ready to spend more money there, or close a tab\n\n-No apologies when said service sucks\n\n-The kitchen area is open to the dining area. We witnessed a male line cook on his phone showing his co-workers Instagram or Snap videos, without gloves (as a dude, I have a hunch that phone has made a trip or two to the can with him), then go back to prepping food\n\n-On one visit, we asked three different employees very politely to please turn on the Warriors game, and then basically we were ignored (i.e. never got the game on and it was not busy. No one was watching anything else that would have taken precedence). PS...It's SF, you have three TV's in there. Make an effort to know when your local teams are playing. The fact that you have multiple TV's is your only advantage over Don Pisto's (another taco place around the corner that's great) especially when a local team is on.\n\nThis all being said, I'm lazy and live close by so I'll probably end up here again at some point. In closing, I hate you North Beach Tacolicious. \n\n\n\n-", "author": "Michael R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-26", "description": "I feel bad only giving it 2 stars. Staff is nice place seems cool but was not impressed with the food or drinks. Chips were ok, Guacamole was not good. Taco was ok.\nMargaritas.... I've had better.\nI wouldn't go out of your way for this one.", "author": "Jacqueline M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "This location is not my favorite due to the decor and it always being busy (they all are). I'd suggestion mission or Palo Alto. The food isn't quite as good here, but it's still decent. There is normally a wait, but it moves quickly. Most of the bar is also \"seating\" and part of the reserved tables so there is less space for walk in eating.", "author": "Jonah K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-08", "description": "Tacolicious is a great lunch spot for a fun group of friends. I haven't been to the other locations but the food here is fantastic! My favorite items on the menu: Aztec chicken soup, fried sweet plaintains, marina girl salad, the pacific cod taco, and the mole chicken taco. Their chips and salsa are terrific as well, and they'll keep them coming as long as you're asking for them. I also love their pitchers of margaritas (yes, sometimes we order them at lunch). \n\nMy only grip with this place is the slow service and then loud music. I've tried coming in a few times for dinner, only to be bombarded by extremely loud techno music. I wouldn't even be able to hear myself think, never mind have a conservation with someone, in that environment. Things are lot more quiet and casual at lunch, which is my preferred dining atmosphere. Either way, the food is worth trying, but whether or not you come for lunch or dinner depends on what level of party mode you're looking for.", "author": "Regina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "The tacos at Tacolicious are certainly delicious, so the name is fitting. The place is cool -- dim, open and illuminated slightly by the open kitchen where you can watch the taco wizards performing their wizardry. Something I didn't know going in: Tacolicious is not for babies. Nope, it is not family-friendly. Now I know, and so do you. You see, the lights get dimmer and the music gets louder as the evening progresses, and Tacolicious becomes something of a clubby atmosphere. Tacos and cocktails in a nightclub? Awesome. Just don't bring the kids. \n\nI also had my first Spicy Beer here. I wanted a Michelada -- a real one with just beer, lime and salt -- but they didn't have that version, so I went for something different and ended up breathing fire for the rest of the night. The Spicy Beer is definitely spicy, so if you're not into the heat you may want to stick with their version of a Michelada (featuring assorted sauces) or just plain beer; they have plenty to choose from. \n\nThe location is great, the seating is ample and the tacos are fabulous. My favorite? The braised beef short rib -- it's rich and flavorful and truly amazing. I also loved the chicken en mole and the shot-and-a-beer braised chicken. Three tacos was more than enough, by the way -- especially if you down a basket of their tortilla chips and awesome salsa. \n\nAll in all, a great spot if you're looking for a fun adults-only night out.", "author": "Hilary H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "I love that this location is less crowded and more spacious - even on a \"date\" night on Thursdays. It's a nice place to stop by on the way home for happy hour or catch up with friends. Since there's more empty space, I found it easier to actually hear my friend talking even though we were sitting across from each other. Sometimes the Marina Tacolicious is just unbearably loud and crowded because the bar is centered.\n\nThere's a deal to get 10 tacos for $33 that I highly recommend. You could probably split it between 3 people! Or maybe 2 if you're feeling ambitious. My favourite is the beef. I'd probably skip the chicken, but the carnitas is bueno too. There are usually 6-7 types of tacos you can choose from so it's a fun platter to get esp to split for a date!\n\nThe sauces are my favourite I've found in San Francisco. Not the spiciest, but definitely flavourful and reminds me most of San Diego salsa!\n\nFor a non-hole in the wall \"Mexican\" restaurant, Tacolicious is pretty damn good!", "author": "Jennifer L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Can't figure out why, but the Tacolicious in the Mission is just consistently better than the North Beach location.  I order regularly for delivery (through trycaviar.com) and each time I break down and order from North Beach (which is WAY closer and costs me WAY LESS to have delivered) I'm disappointed - or worse.   Once, my fish taco was so deep fried I couldn't find the fish in there - (where's the fish??) and left my tummy really upset - activated charcoal time! - and once the fish taco - which I ordered GRILLED this time rather than deep fried - 'cause I'm no dummy! - comes with the fish uncooked all the way through - and their special pork belly taco was nothing by a lukewarm slice of FAT  - and it smelled a bit off.   Into the trash.  Kerplunk.   So, back to paying $5.99 for delivery from the Mission location - they just seem to know how to do it better out there (though they forget the guacamole a lot !!  Keep that in mind - )", "author": "Annie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "My friend and I made plans to go here last weekend and when we went to the other location it was closed, so we called and it ended up that it had moved down the street. What was really cool though was the woman who I talked with told me the marina location had an hour wait. When we arrived at the north beach location we sat down immediately. Pretty dope that they have an operator that provides that info. AND the food was awesome. I had the chicken taco, the chorizo one, and the taco of the week which was a calamari one (highly recommend this & chorizo). Order the guac and honestly any of the margs. We had two pitchers (lol) and we got the grapefruit one and I can't remember the other... but super good (not that much alcohol tho FYI). Def will be coming back!", "author": "Noelle C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-14", "description": "Excellent service! Food was good. I really like the chips and salsa. We went there at 2pm on a Thursday so it was pretty quiet, service was quick and the waiter was very helpful!", "author": "Linh L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "went for dinner last night this place was awesome. Staff is very attentive. you are provided with chips and salsa once you arrive. we ordered queso dip and guacamole which were both delicious. a little pricey but they give you a lot. my friend ordered carnitas taco which was very tasty and I ordered brisket. both tacos were very good. got full off the appetizers and one taco. fun place to hangout enjoyed music. wish we had one of these in my hometown \nwill defiantly be returning.", "author": "Jennelle T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-29", "description": "I stopped in to Tacolicious last Friday around 6:30 for a quick dinner with friends before heading to an 8:00 show at the nearby Beach Blanket Babylon. Granted, several of my friends showed up a few minutes late, but we ultimately put our food order in at about 10 minutes to 7. We ordered a plate of 10 tacos to share, which we thought would be easy enough. At around 7:20, we asked when we could expect the food to come out, as we had tickets to a show that started soon. It turned out that the kitchen actually never received our order, which was a bummer, as we had to end up taking our food to go (and then had to check the bag at BBB, so we didn't enjoy the tacos until a few hours later that night).\n\nOn the plus side, the food was comped, but it wasn't the great fun easy dinner we had expected. I'm also a big fan of the \"Spicy Beer\" - think Michelada with no tomato juice, but tbh, I would have been much happier having grabbed a (sober) slice at Golden Boy.", "author": "Laura H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-10", "description": "I am a big fan of Tacolicious, but for some reason the North Beach location is trying to be a club.  The music is so loud you can't have a conversation with friends, let alone hear your own thoughts.  Do your patrons a favor and turn the music DOWN!", "author": "Christy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "This place is BOMB. Delicious tacos and great variety. I liked the carnitas the best. We got rounds on rounds of salsa/chips and enjoyed the fried plantain and hamachi appetizers--both very delicious, although a little too small to share amongst 4 people.\n\nThe margarita fresca pitcher was good too, not too overpowering but with enough alcohol to know you weren't just paying for juice.\n\nThe ambiance is hip with very dim lighting--my friend had to use the iPhone flashlight to read the menu.\n\nOnly 4 stars because despite the quality, the tacos are definitely overpriced. Worth it for a ballin night out.", "author": "Taryn K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-11", "description": "F-minus, zero stars. Came in tonight and sat at the bar alone for some of my favorite tacos,  I go to the Valencia location all the time so I knew what I was going to order before I came in. I sat at the bar and waited...and waited...and waited. The bartender was catching up with friends, telling co-workers about last night's party, making drinks. He was doing a lot, except serving his counter customers. He handed me a menu at the 22 minute mark, and left before I could tell him I was ready to order. Then I waited...and waited...and waited. I was able to order at the 35 minute mark. I ordered two tacos, a beer, and some salsa for the big bowl of chips they had dropped off. \n\nTacos came quickly. The bartender dropped my beer off and left before I could ask for a lime. That's okay, I'll catch him when he comes back. Salsa had not made it to me yet (nor did it ever arrive). I finished my tacos and waited...and waited.\n\nMy tacos had been finished for a good 15 minutes, he finally came back and asked if I needed anything else. I told him what I would LIKE is a lime for my beer and the salsa from back when I ordered my food, but what I NEED is my check because it had been over an hour and 10 minutes and all I have to show for it is two tacos, and I had to go. Got my check, he said the beer was on him and apologized for how long things took (the kitchen was lightning fast, only he took long). In reality the beer was not on him because I was leaving, and did not end up having a beer, or water, or any beverage of any kind. Ironic because I was sitting at the bar!!\n\nThis location has a couple of solid servers, but the bar is always an awkward place to sit because it is always just the staff socializing in full earshot of the customers. Your not there to hang out, your there to work. \n\nThe food is great though, that's the only thing the North Beach has in common with the other locations.", "author": "Jeff C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-23", "description": "We came on a Saturday night and surprisingly there was no wait! The seating here is \"modern\", personally I don't think their stools are comfortable or the way their tables are so high. Anyway, to start off we ordered guac and we ordered I think 13 tacos. From reading reviews and hearing how sometimes you have to wait over an hour to eat here, I wasn't impressed. Don't get me wrong, it was good but it wasn't amazing where I have to come back. \nWe also had desert, churros and I think the flan. The chocolate that the churros came with was disgusting, it totally ruined it. Being Hispanic maybe I'm being a little too harsh, but I did come with high expectations and left a bit disappointed.", "author": "Irma R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "I work near this location and probably order take out at least once a week. Food is always fresh, taco combinations are delicious, and the guacamole is da bomb!!!", "author": "Meg S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "Service was friendly but slow. Place was not all that busy and took about 10 minutes from the time we sat down to have our server show up and then about another 10 minutes to get drinks. Food was good but nothing to get overly excited about. All and all it was just ok.", "author": "Garrett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "I'll be honest: I come here for the queso alone! In my former life in Austin, Texas, queso could be found on almost any street corner. In San Francisco? Not so much. \n\nBesides the creamy, spicy, terrible-for-you-but-oozing-with-deliciousness queso, Tacolicious also does a bang up job with their guacamole and their carnitas tacos. The grilled Brentwood corn? It's just alright.\n\nThe cocktails are spendy for a casual eatery but admittedly good... and they may or may not go down a bit too easily.  Be sure to check their Facebook and Twitter on Thursdays for their featured taco of the week - I always make sure to order this taco because it's the best!", "author": "Jelena Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-31", "description": "Aw shiet, I think this is gonna be one of my new favorite spots!\n\nBusy but no wait during Sunday brunchtime. EXTENSIVE drink menu and everything sounded delicious. I opted for the sangria roja (red wine + fruit + spicy apple salsa wuuut?) which was sweet and lightly spicy.\n\nFree chips + salsa right when we sat down. Oh haaaaaaail yea. These are thicker corn chips which are my FAVORITE and they are fried in-house, even better! Thick corn chips FTW! This is going to be my new fav spot mainly because of the chips itself. Hahah.. Yummy salsa and chips which just kept coming even when we didn't ask. Woot. They have hella worker bees!!\n\nThe place may get loud but not annoying-ly so. Tall tables with tall chairs (as a short person, I love this!) Lots of menu items at decent prices. Salads for the health conscious as welll!\n\nAt first glance, $14 for 4 tacos was expensive.. (c'mon if you go to ACTUAL Mexican restaurants they're like $2 each). They really stack up the filling here though and it IS slightly fusion food. In the end it was pretty worth it since I got started getting full after 3 tacos (WELL, maybe it was because I gorged on the chips too, lol). We got 8 tacos (1 of each + the special).\nMy favorite was the rock cod and and chorizo with potatoes. The chicken one was a close third (super juicy + flavorful) and my LEAST favorite was by far, the short rib one (it was a bit dry and overcooked, didn't help that we ate that one last too..)\nOverall, pretty awesome. They do layer on 2 tortillas per taco (PRO-TIP, remove the 2nd tortilla when you eat so it's less heavy!)\n\nDef would return!", "author": "Emily C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-25", "description": "I want to like this place, but it's just not very good.  The tacos are bland, the drinks are meh, and the queso doesn't even excite.  On top of that it's about 50% more expensive than it should be.  I think it used to be good but it hasn't stood the test of time.", "author": "John S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-31", "description": "I was really excited that a Tacolicious was opening up in North Beach. The one in the Marina is always good. \n\nWe came in on a Thursday night and got seated right away which is good. It was very loud and the music was playing really loud so it was kind of hard to hear each other or talk. That wasn't really my problem.\n\nEVERYTHING WAS SOOOOOOO SALTY. Like can't eat this salty. The guacamole, the fish tacos. Everything. The fish tacos were also so heavily battered there was barely any fish. The batter was also extremely salty. I tend to not really care about salt, I actually like salt, but this was just bad. \n\nThere is definitely better Mexican food around this neighborhood and I was thoroughly disappointed with Tacolicious. \n\nAlso, the service was just not great. The waitress never really checked on us, I had to ask for a new pitcher of water twice and when we sat down, no one came up to us for about 10 minutes. \n\nOverall just not a good experience and I will not be coming back.", "author": "Cara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "Good food!!!!  Great atmosphere!!  A friend who\nlives in San Fran recommended it and it was awesome!!  The server recommended  some\ntacos and they were fantastic!!!", "author": "Kelly D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-22", "description": "We love Tacolicious! This was recommended to us by a 'local' we spoke to on the airplane to San Fran! We went there on Taco Tuesday and the special was a nice amount to serve three of us (with the rice & beans side). We love this neighborhood too!", "author": "Sherri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "A fun and fancy taqueria! :D\n\nWith a full fancy bar, tacolicious turned a normal taqueria into a fun GNO spot! \nI came across Tacolicious during columbus day parade. I've seen pictures and check-ins on yelp and facebook for quite some time now and I finally decided to check this place out!\n\nWe ordered: (party of 2)\n*grilled squid veracruz $9.95 - almost like the Italian squid in marinara sauce. grilled squid in a bed of tomato-caper sauce, garbanzo beans and jalapeno. It's very tasty.\n*Ceviche de verano $11.95 - there's lots of cucumbers, cubes of avocados and fish. I wish it has some shrimps though but it's very refreshing!\n4 tacos for 14 dollars:\n*Carne asada taco - a little bit dry not my fav\n*slow cooked short ribs taco - tender and juicy with a decent amount of short ribs in the taco, mouth full. \n*fried calamari taco - it's a bit dry for my taste, but it's really good if you put a lot of salsa with it.\n*fried cod taco - my fav, huge piece of cod, it's flakey and flavorful with the right amount of batter and slaw on top.\n\nHouse Salsa - absolutely yummy! I also like the medium spicy salsa they give you with the tacos, super smokey with the right amount of heat. \nDecor - modern and simple, I like it! \nEnjoy your meal with a delicious margarita or cold beer, how much better does it get?!\nArrrrrrrrriba Arrrrrrrrrrrrrrrrrrriba!", "author": "Mindy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-10", "description": "Service here was absolutely horrendous. 4 of us ordered 3 orders of 4 tacos, but ended up with 3 single tacos. We tried to straighten it out, ended up with one more taco, and only after we asked the waiter again did we received our other two other  orders of 4 tacos. Our drink orders and simple water orders also took forever. The worst part, was that after all of the missteps we were not only not offered any comped items, but they tried to charge us for another order of tacos! When we told the waiter this he wasn't even apologetic. Food wasn't bad but the awful service is something I would not like to experience again.", "author": "Shabnam E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "FANTASTIC PLACE! Chealsea's Service is Top 10, Vibe is Excellent, and the Food is Awesome! My wife and I where just walking around choosing the Best Place to Go To, and we fell in there, and we didn't try to get out! Definitely Try This Place!", "author": "Bernie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-11", "description": "When in for lunch here yesterday. Bartender puts his pen in his \"man-bun\". Absolutely disgusting. \n\nChips were good. Salsa is weirdly sweet. Tacos were greasy. Ordered a chicken taco and cheesesteak taco. They brought me a braised beef taco and and a carnitas taco. They did give me a free cheesesteak taco. So that was cool.", "author": "Cliff H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "We got 3 different tacos : chicken, beef and fish. It was yummy a bit spicy but enough to be flavory.  The fish one had a lack of sauce, it was a bit dry and the sauce was too bitter.\nThe service was friendly and fast.", "author": "Cristelle M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Tacolishes is always a great go to place. Delicious food. The service at this location is awesome. A great decision for big or small groups. Last night, Thursday, I went with about 8 friends with no reservation. We put our name down then headed to the bar, watched the warrior game and drank pitchers of delicious grape fruit and pomegranate margs! It took about an hour to get seated, and it flew by!\n\nEnjoy", "author": "Maxine S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "7/17/13 Dinner\n\nCame here to check out the newest Tacolicious in town. Everything---from decor, vibe, flatware, napkins, plates are the same as the other locations except, to my utter delight, they don't blast the music here like they do on Valencia. The clientele is also different, a mix of tourists, older locals, and less of the hipster scene.\n\nTacolicious doesn't dish out authentic tacos although they are tasty. We pretty much get the same thing to see if they are consistent with quality. They don't disappoint!\n\n*Grilled rock cod tacos: always love the tangy spicy sauce. But for the first time we're offered the \"grilled\" option, which was not available previous on Valencia or Chestnut. Fish was very fresh.\n\n*Shot-of-beer Chicken taco: I think this is their signature item. It actually tastes a bit like the chicken taco at Lolo. I always get this when I'm here. \n\n*Guajillo-braised beef short rib tacos: very strong favored, but tender short ribs in tacos. Perfect with the yellow hot sauce. This has been a hit-or-miss at the other locations but the new location seems to have got this right. Not overly salty and no spices caked on the meat.\n\nOverall this is a nice alternative in North Beach if you're not into pretentious, touristy Italian and mediocre Chinese food. The Sangria Roja was also good. Our server Emma was friendly and attentive.", "author": "Matt Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Food is always delicious, but the service is always outstanding at this restaurant. The manager named Matt is great and has a fantastic attitude. I had a work emergency that required me to sign a document. Matt asked me to email him the piece of paper and he printed it out for me. \n\n5 stars out of 5 stars.", "author": "Alexander D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-15", "description": "HORRIBLE, HORRIBLE, HORRIBLE.\n\nAs a fan of the Tacolicious in the Mission and having also used the Tacolicious in Palo Alto for corporate catering, the Tacolicious in North Beach is an extreme disappointment! I would tell everyone to AVOID this location.\n\n1) THE FOOD IS HORRIBLE\n- So, so, so SUPER salty! It was as though I was sucking on a salt shaker! \n- DRY, DRY, HELLA MUTHA EFFIN' DRY! How old is the meat in these tacos? The short ribs were simply dry chunks of yuck. The duck was made up of hard strings of meat chips! WHAAAATHEFUDGEEEEE?!\n\n2) ZERO, NON-EXISTANT, BEYOND HORRIBLE SERVICE\n- Our waitress, a younger blond woman, was totally oblivious to customers. She was going to look for an extra chair. Never looked for one. Never mentioned it. One person in our party ended up leaving.\n- Sat there for a good 10-15 minutes without any acknowledgement after being seated. I had to ask several times if I could give her my order! WHAT THE HELL?!!!\n- Asked for water, 20 minutes later, had to ask again...and again. WTF?! The food was so incredibly salty, I probably needed buckets of water!\n- I was given a MAC lipliner (by a woman who wasn't my server) to sign off on my credit card receipt! This was actually pretty funny and the highlight of my experience here.\n- I don't know how busy they were inside, but the quality of the service outside sucked beyond words. If they were understaffed, then they have management issues which still deserve a sh:tty review. No matter what, they are deserving of a negative review. \n- I will say that there were a couple of guys towards the end, who stepped in to help some of the customers, and they were far more efficient than the ladies that work there--THE LONE STAR IS FOR THEM.\n\n3) THEY WILL OVERCHARGE YOU\n- I was with my 90 year old grandmother. I asked if they could make a Virgin drink, basically, soda water but with the fruit juice and fruit added to it...they charged it as a full cocktail--$15!!! ALCOHOL is what drives drink prices to what they are. To charge $15 for soda water with some pomegranate seeds thrown in is so F-CKING RIDICULOUS! WHAT THE F-CK B1TCHES?!!! THEY CAN HAVE THAT $15, BUT THEY ARE NEVER GETTING ANOTHER PENNY FROM ME NOR ANYONE WHO WILL HEED MY ADVICE TO AVOID THIS LOCATION!\n\nDespite their sh:tty @ss service, I still tipped my personal minimum of 15%, because that's how I roll as someone who worked as a food/beverage server in my teens and early 20's, but I totally cringed at writing that tip in. They are very lucky for Yelp, because I was able to hold my temper and tip them, with the satisfaction of knowing I would leave them a negative Yelp review later.\n\nI HATE THIS RESTAURANT. THE PLACE SUCKS FAR WORSE THAN ANY PLACE I HAVE BEEN TO IN THE PAST 10 YEARS! I WOULD GIVE THEM NEGATIVE 10 STARS IF I COULD!!! \n\nI AM STILL SEETHING OVER MY EXPERIENCE AT THIS SH;THOLE OF A TACOLICIOUS! I NEED A FKN SPA DAY!", "author": "Ladi Da A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "-Empenadas? Yes. Potato and queso.\n-Nopales? Yes. On tacos with tons of queso.\n-Plantains? Yes. My fave.\n-Chips? Yes. With mild, medium and hot salsa on the side.\n-Dark and moody? Yes. Just the way I like it.\nAnd your name is TACOLICIOUS!?! How can I stay away?\nYep. Count me in.\nTip - Gang up and order your tacos in bunches of 4 or 10 to save a few bucks.", "author": "Kristina K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-05", "description": "My friends recommended this place and not to be horrible but it was a huge disappointment. If you love tacos and tequila then this is not your place. The guacamole was tasteless. In fact we tried a few items to give them the benefit of the doubt and nothing changed.", "author": "Ani T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-01", "description": "DISCLAIMER : this review is only about the Tacolicious in North Beach. The ones in the Marina and the Mission are actually great places to go.  Both of which I have been to many times and always enjoyed myself.\n\nWhen I moved from the Marina to North Beach I was actually a little excited that another branch of one of my favorite watering holes was right down the street.\n\nI have honestly been to the T-lish in North Beach 10 times and they have always found a way to screw something up.  Whether it be the wrong tacos, wrong drink, rude service etc... Today's visit solidified that I will never come back here again. I would rather take the $5 Uber to the Marina.\n\nHaving worked in the industry I have an excessive tolerance for service so I usually give places the benefit of the doubt but today it was just too much. I showed up around 7 and put my food order in. The bar was moderately crowded. After watching 3 people come in and place to-go orders, get there food and leave I asked the bartender if something went wrong with my order. 40 minutes had passed so I gave them the benefit of the doubt. \n\nTurns out my they put my order in to go and have my food away. An honest mistake but they had known for 15 minutes and never told me. That is just inexcusable.\n\nSuggestion to ownership... Bring in a manager from the Marina or the Mission that can get this places shit together.", "author": "Cortlin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "Waiters are very friendly. Food comes out really fast. No line  for 7pm on a Saturday evening. It's quite busy in here. Loud atmosphere. \n\nThe food? Pretty average and a bit overpriced. $18 for 4 tacos? It would be worth it if the tacos are full of deliciousness, as the name suggests. The tacos are fully loaded with meat. It's not too flavorful. It's just a heavy dose of meat. You can def get better Mexican food in the Mission. \n\nThe salsa is delicious!", "author": "Sa M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Despite our initial reaction of \"Another White Mexican Restaurant\" we were honestly blown away by the taste, creativity and service.  Now anyone who's feasted on late night dollar tacos on the streets of Puerto Vallarta will find themselves sticker shocked at the thought of a 5 dollar taco but as an aficionado of the former these tacos are the mercedes benz of meat topped tortillas. The taco of the week and the flank steak at even a dollar more were worth every penny.  We started with an order of chicharrones de pollo (fried chicken skins - what's not to like?) absolutely yummy.  2 bowls of homemade guacamole, each one better than the next. The drinks were inventive, tasty and out of this world.  Top this off with never ending tortilla chips and an array of different salsas, delivered table side by an attentive staff and you have the recipe for a great night out.", "author": "bruce z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-06", "description": "Good casual place for tacos; casual ambience, fairly quick service, but prices are a little higher than expected here. \nThe standout here for me is the churros. \nYes, the churros. They were so good that we actually had 2 orders coz one was simply not enough. \nEverything else was expected but nothing else really stood out", "author": "Jocelyn L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Twice in one month and both times Tacolicious did not disappoint.  I am such a fan, new favorite taco place, my only problem is that they are a Bart ride over the bay away.  They took street tacos and kicked it up several notches.  I've tried the short rib twice, the grilled fish, chorizo and pork and although I repeated the short rib I haven't kicked any of them to the curb but will be going back to not only try  new one's but repeat others to determine what are my favorites.  Keep cooking great food in a lively atmosphere and come to San Ramon city center in 2017.  We would love to have you in our neighborhood.", "author": "Dianne M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-07", "description": "Not my favorite taco place, especially considering how many other amazing taco options there are in the city. While the flavors are good, it's more on the expensive side. Good for a nicer date maybe, but not if you just want some quick and good food.", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "Came here for late lunch with two others. We were greeted by a really friendly hostess as well as the owner. Great service! The food was delish. I loved the kale salad, the guac, and tacos. Good position sizes. Tip: free corkage!!", "author": "Christine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "The ambiance here is super fun and hip. I love the reclaimed wood behind the bar and the cool tile floor. It can be a bit loud when it's full, but that adds to the liveliness. \n\nThe tacos are a bit pricey, but that's because they're more than your typical carne asada: there's pork belly, brisket, filet mignon, seasonal fish, vegetarian options, etc. \n\nThey have a fun beer + shot of tequila special sometimes that's cheap and fun. \n\nClean restrooms, decent service. I'd recommend it to a friend for sure.\n\nNote: If you're looking for an authentic taqueria, this is not the place. This is a fun, hip, trendy restaurant that serves delicious tacos at San Francisco prices. For hole-in-the-wall authentic Mexican food, head to the Mission.", "author": "Lisa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-02", "description": "I'm not a huge Mexican food person, but thought I'd come with a couple friends and give this place a try becuase there wasn't a wait here on NYE. We ordered the 4 tacos to share, a pitcher of magherita, guac, and some other appetizers. \n\nThe tacos were pretty good! They double up on the tortillas, so we split the tacos easily in half and shared amongst the three of us. Their drinks are tasty too, and service is quick. They have a great drinks menu, and delicous chips/salsa/guac!", "author": "Jeanette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "Love the other two SF locations. This one has excellent food - the carnitas is one of their best (among the three locations) - but the ambiance is a bit lacking. It is like they had an odd-shaped space to work with and did the best they could. Still, the food is top notch. The chorizo tacos are very good. The michelada is perfect. Margaritas are good as well.\nTry the non-alcoholic fruit drinks...especially if you are 9 years old.", "author": "Jubilee D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-20", "description": "Great little Mexican place! We have always been to the one in N Beach when we visit and love that part of town. Service was fast and the food and margaritas were great! What more could you ask?? Oh and get the guacamole, it's awesome!", "author": "Erin Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "Tacolicious is good. Not great but good. I've had better tacos and I'll continue to have better tacos at other restaurants. I did enjoy the chips and salsa, and that our waitress was on top of refilling our chips as much as possible. I always like to try the vegetarian options when I go to a restaurant. It's not that I'm a vegetarian or anything but I think any restaurant that can create a mouth watering vegetarian option is worth going to. Each and every time I go to tacolicious I'm pleasantly surprised by the vegetarian options available. They're far from boring letting me know that tacolicious can make even the poor sad meatless meals fun and delicious. \n\nDespite the delicious vegetarian options and rotating menu I never really crave tacolicious. I feel like it's a if I'm in the neighborhood and really need some chips and salsa joint. However, it's not terrible it really is good. But I have yet to have a taco there thats made me sit up at night and crave it. I want to love it, but tacolicious where's the excitement? I like you, but I don't love you.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-06", "description": "I frequent the Mission location of Tacolicious, but as a family we decided to try out the North Beach location on New Year's Eve.  The quality of service and food at this location was quite low compared to the one in the Mission.  \n\nWe were seated right away, and given chips, but it took about 25 minutes before our drink orders were taken. Two servers came by and said they would \"be right with you.\"\n\nThe waitress on the floor then went out to the curb to talk to a couple of friends for a while, then came back and took the order of the table who came in after us.  Then went away again, then came back and apologized because \"only person on the floor.\" \n\nThe agua fresca we ordered for our two young daughters was supposed to be pineapple citrus, but was really a quite sour limeade. Maybe they forgot the pineapple juice?  In any case, it made the adults' lips pucker.\n\nThe Nopales and Oaxaca cheese taco had no cheese, and the tortillas on all of our tacos were dried out and somewhat brittle.  \n\nWe'll be sticking with the Mission outpost from now on.", "author": "Bea A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "We LOVE this restaurant. Always a great experience when we go. We have been here several times and the food, drinks and service  are always outstanding. Went last night for a few drinks with my boyfriend. Walked in and the bar was slammed. However, immediately Jay the bartender greeted us, attended to us, and provided us with menus. We had the passion fruit margarita, as well as the margarita with coconut water..both very good and fresh ! Jay frequently checked in on us and made sure we were happy with our drinks. Overall, a great experience! Any time we are in SF we always stop by :). Walnut creek needs one !", "author": "Liz B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-03", "description": "Suuuupperrr overpriced. The food wasn't \"bad\" but it wasn't great. Definitely not worth the absurd prices. Salty tacos, watered down margaritas. $100 for two people and we only got tacos no appetizers. Two stars is probably generous. Would not recommend.", "author": "Hoki J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "I came here for dinner and drinks on New Years Eve with my boyfriend. Luckily for us, we beat the crowd and got seated right away! We were about to order 5 tacos each, but our waitress was super nice and warned us that the tacos are pretty big. We ended up only getting 5 tacos total. My favorite is the braised beef short rib taco. It was overflowing with juicy goodness!! The drinks were also delicious! I love tequila, so might be bias about the drinks since we got 4 drinks which all were tequila based. The Nopal was my favorite. \n \nThere's also a bar there, so you can order drinks while you wait for your table.", "author": "Lina C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-09", "description": "The food was pretty good but the service was lackluster. It took a long time for our waitress to take our order. She apologized for the wait, which was considerate, but it even took a long time for us to get a carafe of water. The restaurant seemed to be understaffed for an afternoon lunch rush.\n\nThe tacos were decent but nothing that blew me away. I thought it was kind of pricey for the portion size but maybe its because of the quality of the ingredients.\n\nThere are a lot of good places to eat in North Beach so if you aren't craving tacos, I would suggest going somewhere else.", "author": "Bridget G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "I love Tacolicious, I've been there a lot and also to the Marina location. Their tacos are delicious and fresh. I recommend the carnitas and chicken en mole!", "author": "Delphine L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-17", "description": "Small portions. Ordered the kale salad, which was ok. The taco sampler was good but very small. Not too busy during lunch, which was good for us. Don't think I would come back. Nothing spectacular about this place.", "author": "Rosanna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Food was BEYOND amazing ! Service was great as well don't know what else to say other than that lol that's how much I LOVED IT", "author": "Mona A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "Great tacos amazing environment! We waited for our table on a wed night at 9pm california time! Thats how u know this stuff is GOOD!!! Mmm \n8 Carnitas, braised beef, fried cod tacos and 2 empanadas later we practically rolled out of the restaurant completely full and satisfied. Id go there again any time of the day (or night)!  Beware, all spicy food lovers, the braised beef taco was proclaimed extremely hot but isnt at all - just slightly oily ;) so put on the extra hot sauce go ahead!", "author": "Galina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-03", "description": "It's as the name says.  Tacolicious! Great tequila and booze selection to boot.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-27", "description": "Food was good. Service was ok. Had to ask everytime we needed something...drinks, food, Bill.  Honestly wouldn't come back.", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Excellent addition to the neighborhood and a fine substitute for Don Pistos when you aren't willing to wait in line for that around the corner. It's an upscale, hip, but casual place to get tacos and drinks basically.\n\nThe 4 taco combo is quite filling, especially if you load up on the free chips and salsa. I recommend the carnitas tacos and the chicken tacos. The short rib tacos are pretty rich and heavy while the fish taco is deep fried and way heavier than I imagined it would be. The agua fresca is quite refreshing too.\n\nService is a bit hit or miss here. They are friendly but they were mixing up people's orders (which table food goes to) and forgetting to bring a few things. Clearly, there's still some service hiccups but I'd probably give it another shot.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "my favorite taco place in SF! I get it delivered through the app Caviar almost every weekend. LOVE IT!", "author": "Kelsey K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "I absolutely love the location in the Mission so while on a business trip I opted to try another one of their locations.  The service level was terrible at the north beach location they just don't seem to have it down like they do in the Mission.  That being said if you want the same great food without the really long wait for a table you'll get it here although with the terrible service level you may just be better of wattling it out in the Mission.  I hate to do it but I have to go with only two stars for this location and recommend that they pull it together like they have in the Mission.", "author": "Christine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "Amazing tacos! Definitely try this place for great tacos in San Francisco. I always get the carnitas street tacos but my wife loves the chicken. Definitely give this place a try, you wont regret it.", "author": "Cliff S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-12", "description": "Allie at tacolicious hooked it up. She made sure me and my party had a great time. Would suggest this place to anyone visiting Berkeley or the city any night. Make sure you ask for Allie!", "author": "Allison M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-18", "description": "This place is good. \nThis place is alright. \nThough I wouldn't say it's out of sight. \n\nYet I return. \nFor guacamole. \nAnd tacos. \nAnd mescal. \nAnd cute girls. \n\nIt's really a good formula.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "We came as a big group on a Saturday and while I was initially unimpressed by the wait (longer than they initially said and seated someone else before us) the food was great and service pretty good. Solid guac, good margaritas and great salads. Most tacos pretty good and gluten free as well as veg options for people that need. I'd definitely recommend it here, and ambience is better at this location relative to other ones", "author": "Allie M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-18", "description": "I SAW 2 HUGE RATS AS I WAS PASSING BY IN THE RESTAURANt . It was disgusting , u can't believe they are still open. I haven't tried this place. & now, I'm definitely not going to try it out a I your me soon", "author": "Luis C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-01", "description": "Great food, super quick service, and a really nice environment. \n\nStated with the chips and salsa. Bf loved the chips, I loved the homemade salsa. \n\nTacos were on point. Best ones were definitely the carnitas and the braised short rib. Chicken wasn't bad. \n\nA little pricey for tj style tacos, and the music was a tad loud, but at least it was good music, so I can't complain too much. \n\nOverall, it was a good experience and I would definitely come back.", "author": "Jessica B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-17", "description": "Lots of hate for this place, and I don't know why.  It is actually fantastic.\n\nAll of the tacos here are great, particularly the fish tacos for me.  Everything is pretty light, with fluffy tortillas, and the margaritas are tasty!  The only taco I would advise against here is the cactus, which I think is too deep fried and killed the cactus taste.  But almost all of the meat tacos here are great, especially the fish and stewed beef.\n\nThe service here can be a miss however, as the cleanup crew can sometimes be a bit rude if you trying to get in and squeeze into space before the table is ready.  Understandable to some extent...\n\nGood scene too!", "author": "Mark M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-18", "description": "Came here only after seeing the line at the famous pizzeria next door  .. On to the food, tacos were excellent ! Drinks , spectacular ! Plenty of tv's around to catch the game. Nice clean decor. Thumbs up", "author": "Louie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Pricey for what you're getting. Quite loud and for unexplainable reason the overhead light got dimmed (a lot) during our dinner. Tortillas had an odd taste to them, but what was inside them was good. They did get my order wrong, but 3 out of 4 tacos correct was no reason to send it back.", "author": "Heidi W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "I live in North Beach, so we come here frequently to dine-in and grab take-out. \n\nHands down my favorite salsa! LOVE the guac. Tacos are very good and I like the rotating \"taco of the week.\" The kale salad and albacore tuna tostadas are my favorite items on the menu. The margaritas and tequilla cocktails are good. And huevos rancheros at brunch is delicious.\n\nI like the open feel of the place, and that they have outside seating, especially nice for getting some sun at brunch. Though when they're at full capacity inside, be prepared to bring your shouting voice if you want to converse at your table; the acoustics are terrible.\n\nThe only reason I can't give them 5 stars is the service. It's really mixed. We've had friendly bartenders and we've had sullen bartenders that try very hard to ignore us. We've had friendly hosts and hostesses, and some that seemed annoyed. Nice waitstaff and sour waitstaff. It's really hit and miss and can tarnish the experience, especially when bringing out-of-town friends here.", "author": "Sonya Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "Braised short rib tacos are amazing. \n\nAtmosphere isn't quite what you expect but it is very informal. Staff are knowledgeable on the menu front and like to guide.", "author": "Gareth B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-10", "description": "LORD HAVE MERCY. I love this place.  I am addicted to their mint lemonade drink called Silas.  I don't get why more places in SF dont sell this.  I've legit made people leave a venue across town early with me so I can get here before this place closes and get the silas bc it was all I wanted in life at that moment. \n\nAnywho, the tacos are amazing, kinda fancy and not your run down taqueria.  I truly recommend the grilled fish taco bc HOT DAMN SAM, that shit is on point.  The filet mignon is alright and I would skip the fried fish taco entirely bc their batter ain't the best in town for that (you'd have to head to el metate in the mission for this..trust me I'm a taconnoisseur)", "author": "Mia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-07", "description": "Ritzy-ish taco bar. Strong margaritas, artisan tacos, decent staff, fantastic location and vibe. Higher caliber establishment which reflects in price but worth it to be in the environment.", "author": "Daniel D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-18", "description": "Good tacos, great sangria. HORRIBLE SERVICE. This is the third time Ive been here and clearly not busy. Takes the staff at least 30mins acknowledge you to sit down.", "author": "Michelle Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-14", "description": "Great tacos, easier to get into than other locations!", "author": "Baygirl R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Just left tacolicious for dinner celebrating my 2 month anniversary and it was amazing! We had the house margs, quac and queso to start. I had the Kale salad and my bf ordered the chicken mole tacos and they couldn't have been better. To top it all off we had Elaina as our sever and she made the dining experience one of a kind with her A++ service. Definitely going back soon and hope we get the pleasure of dining with Elaina again!", "author": "Camille J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Don't come here if you're looking for a hole-in-the-wall taco experience for $5. There are plenty worthy places for that in the Mission.\n\nReasons to like:\n\n- Menu is broad (not just tacos) and ingredients are fresh. I highly recommend the squid appetizer and the kale salad. The spice options (hot, mild, chipotle only) are well done. The tacos are tasty and fill you up more than you'd think from the size.\n\n- Cocktails are great- the piccante margarita is a love it or hate it drink (try it).\n\nIssues:\n\n- If you're on the high stools, the seating isn't that comfortable.\n\n- It can get very, very noisy in here. More of a party atmosphere than a date-destination. And yes, the crowd can get a bit douchy (it's better than the Marina location).\n\nTo my mind the main question is whether you feel you're getting bang for your buck here. Personally I'm in the 'yes' camp - it's good quality food, fairly priced - but if Mexican food is anchored for you at the stuff-your-face for $10 price point I honestly think you should go elsewhere, and avoid inevitable disappointment.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-05", "description": "Don't Yelp too often anymore, but just had a fantastic experience for me and 3 other friends here. I've gone to the Tacolicious once or twice in Marina but this was my first time at the NB location.\n\nFood was spot on - we followed our server's (Joy or Joey I think!) recommendations and everything was delicious. Service was excellent - not overbearing and always available when needed.\n\nI might be converted to this location from now on!", "author": "Jason L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-15", "description": "First time I went food was great service was good. Typical north beach yuppy crowd...blah.\nWent again last night. Food was still pretty good. Service however sucked. Waitress couldn't be bothered. After taking the drink order she never returned, finally after flagging her down we ordered and she didn't get the order right. At some point another waitress came over and took over. \nThe most disturbing part of the evening was seeing a bus boy drop a dish on floor then pick it up and use it for sauce! \nYou go to a restaurant for food and return for service. I won't be back.", "author": "robbie l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "This place is amazing. Best Guac I've had in the US, solid cocktail list, great tacos, love the salsa as well.\n\nMy only complaint is the acoustics in the NB location extremely loud inside. To the point where you can't hear the person sitting right across from you. This could be good if you hate the person you're dining with but outside of that circumstance it is less than ideal.\n\nEither way I'll always come back to Tacolicious. I'm addicted.", "author": "Michelle A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-30", "description": "For all they hype I've heard about this place, I just wasn't really that impressed. To be clear, nothing was amazingly bad; but, the overwhelming mediocrity of the place combined with slightly overpriced offerings will most likely send me straight to the Mission instead of Tacolicious when I'm looking for taco satisfaction.\n\nTwo of my friends and I sauntered in (yes sauntered) on a Saturday afternoon and it was completely empty, which I thought was amazing.  However, I've heard the place gets super packed for happy hour/night time drinking and it's clear by the set up this is what they're catering for (high tables with stools, lots of standing space). \n\nService was....odd. Everyone was friendly and our waitress helped suggest menu items and got us more chips/limes/etc without complaint, but they were so fast to clear our table and provide the check that it felt like they were rushing us. Clearly, since there were only two other parties in the restaurant, they were most likely not trying to get rid of us. I can't tell if they were just super bored or if they normally are trying to provide fast turnover during high traffic times. They also are very stingy with portions of free stuff (they gave us two lime wedges for ten tacos and roughly a Tablespoon of each salsa for 3 people). Admittedly, the waitress had no problem getting more for us and this way we didn't waste food, but I would have liked to not have to ask for extras of everything and feel even more annoying than I already am.\n\nAnd for the most important thing, the food: Meh, with a capital M.\n\nWe tried amongst the 3 of us: fish taco, chorizo taco, short rib taco, carnitas taco, cactus taco, and guacamole.\n\nThe fish and the short rib were by far the best tacos and the only ones we would actually reorder. They were very filling, good quality of meat, and had a huge portion of protein for a street taco, but they still were a little bland. I slathered them with our guacamole, the lime and their salsas and they were still missing some spice. I think if their salsas were better, it would be more enjoyable, but the tablespoon of spicy habanero salsa they provided for the three of us tasted like nothing. The chorizo and carnitas and guacamole were just alright, but nothing special. (and the guacamole was $9 for maybe a cup of dip :/ ). The cactus taco was downright bad, and I highly suggest not ordering it. At the end of the meal, we paid $19 each for three tacos and some guacamole. Not sure if that was worth the price.\n\nIn conclusion, I think you're supposed to come here for the drinks and then after a few you'll be less finicky about the value/quality of the food.", "author": "Christina R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "The brisket tacos are amazing. Interesting flavors. The salsa is sweet and the tortilla flavor unique.", "author": "The D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-03", "description": "Love this place. Come here as often as I can. Carnitas are my favorite, but the roommate will never order me my own so I just end up begging at the side of the table.  The sever always brings me a water bowl outside which is appreciated. Oh and the drinks must be on point, my roommate is quite the lush and we always end up having to cab it back home since I don't have thumbs to drive the car back myself.", "author": "Graham J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "they seated & served us very quickly -which I loved! \n\nhowever, I wasn't the biggest fan of the tacos that I got. the tortillas didn't seem cooked enough to me, but maybe that's just how they make them.\n\nthe chips & salsa are great, I really liked how the salsa had a sweet zingy taste to it :)", "author": "Brooke W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "I work next door to this location, it is a great and convenient spot for happy hour food/drinks. They have a small happy hour menu but with a wide variety of selection at awesome super cheap prices. \n\nMy co worker and I came at 5pm when there was no one there. When we left around 6 the place was packed!! \n\nWe ordered the nachos, which were a 8 out of 10 on the nacho scale. The service was fine, nothing spectacular. The crowd was casually dressed, informal groups\n\n\nThe only real complaint I can have is that the lights were too dim. I usually love that ambiance but this was to the point where I could not see anything. Other than that I love the decor and feel of this place. \n\n\nI would definitely come here again and recommend it to my friends for quick, inexpensive and tasty mexican fare.", "author": "Zahra K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "This place was a pretty big disappointment. I read the reviews and was so excited to try it. The service was bad but we were expecting that from the reviews. We ordered the charged squid appetizer and 4 tacos. The squid was terrible and undercooked. It was so bad that we actually could not eat it and sent it back. The four tacos we ordered were the short rib, chicken, deep fried cod, and carnitas. The carnitas was the only decent one and still had a few flavor issues. The only perk was that it was a super cool atmosphere and probably cool for drinks.", "author": "Samanyha O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "Remember during the late 90's mid 2000's where it was cool to add -licious to every single thing? It was annoying as eff but we'll let this one slide this time.\n\nThe menu consists of simple Americanized Mexican food with a culinary twist. They have some weekly tacos, which I always add to my order. The tacos are quite cheap but they get pricey fast when you add chips and guacamole and some margaritas.  Its an easy $50 plus bill with me and a friend or two.\n\nEven though I think the guacamole is over priced, it is really good. The fish tacos are amazing and also their taco of the week and I say that in faith. \n\nMy friends like to order several tacos and then cut them in half. Why? Cause they are weird and like to share their food. Or keep their figures. Or it could be that they want to make room for margaritas. Who knows.\n\nThe house margarita is hands down the best. They do have other fun inventive flavored ones but why go against the best?\n\nYou don't really go there too much for the ambiance. If you go to the one in North Beach, you can people watch if that is your thing. The one at Chestnut is uber tiny and does have a small section for outdoor seating. You also get to see what the cooks and bartenders are doing behind the counter and ensure they are not doing anything weird to your order. At Valencia, they do have outdoor seating, its not to the street but looking at other tables to see what they've ordered. Plus, the place is dimly lit there that you may go home with people you didn't come in with.\n\nThe most horrible thing about it is that they don't have locations outside of SF.. cause guess what I want when I'm not in the city.. Taco-damn-licous.", "author": "Samantha E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "I love Tacolicious on valencia, great service, awesome food tasty tequila and 5 star bartenders. This is not that place. Was there on a Saturday afternoon, the waitress was fine, but food took quite a while, and didn't have those three salsa dish thing that I love about the other locations.  They did charge my phone,  but when I went in to get it I asked if they had chicken grease tequila, aka Pechuga. The manager with a broken arm started yelling at me to get out of his bar, and was really rude. I think they deal with a lot of tourists or something here, but I felt this guy is a class A jere and shouldn't work in food service at all.", "author": "JJ L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "I brought my three visiting cousins to Tacolicious on Saturday night. We were told it would be an hour wait but were seated in about 25 minutes - woo hoo!\n\nWe ordered a big platter of tacos, wanting to sample the various types. They were delicious for the most part, especially the rock cod and shrimp. (I didn't love the chicken taco on special - too spicy!) \n\nRegarding service, the host was awesome and made sure we were taken care of. Table service was fine. While we were waiting for a drink the bartender took my order but never delivered the drink. After about 15 minutes I found it sitting on the far end at the wait station and paid a different bartender for it... that was weird. Bar service was slow throughout our meal.\n\nThe restaurant is loud so I wouldn't anticipate any deep conversation but it's a quick, affordable (for SF standards!), fun spot serving great tacos.", "author": "Jenny V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "I really like this place for their tacos! They do it well and you can definitely taste that the ingredients are super fresh. We opted for 4 tacos for $14: two rock cods, braised short rib and the chipotle shrimp. Rock cod was good. The batter wasn't as crispy as I've had at other restaurants, but maybe I should have eaten this one first? So I'll blame that on my lack of judgement. The braised short rib was very tender and flavorful! And they piled that beef on. No shortage there!\n\nI'm a HUGE fan of chips and salsa and their salsa is awesome! They add mint (!) to their salsa, which gives it a nice refreshing kick. Never had that before so it was a great surprise. Definitely loved that taste. Kudos Tacolicious.\n\nMargaritas here are good too, but not as strong. I had the Fillmore Paloma: azul silver, fresh grapefruit, elder flower. Great balance of sweet and salty and bitterness.\n\nThe only gripe was that service can be slow. It did take us a while to get our drinks and the guys at the table seated down after us got their drinks before ours even though we ordered first. Not usually a big deal to me, but worth noting. Although our first waitress neglected us, at least two other servers did stop by to check in on us.\n\nAll in all, a good alternative to the North Beach area for late night  munchies.", "author": "Ling H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Hands down, the filet mignon tacos were amazing!!!! Must try them! They are very filling:) I ordered 4 and only finished 3! And the margarita with pomegranate was awesome as well!!", "author": "Kay M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "It would have been considerate to have  mentioned that they use flour tortillas for some reason. It might have prevented an hour of severe discomfort at 5AM.", "author": "jo a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "I have been staring at my computer monitor for the last 20 minutes trying to best way to fully encapsulate the awesomeness of this fine establishment. Here goes nothing:\n\nLOCATION: Right in the heart of North Beach (pro and con). It is within one block of the 45, 41, 8X, and 30 bus lines. NOT good for driving/parking (it's non-existent). If you do not take public transportation, Lyft/Uber/Sidecar/Flywheel/Taxi is HIGHLY recommended\n\nAMBIANCE: It's a small dining area and bar, which can get crowded quite quickly, especially during happy hour and weekends (not atypical of ANY North Beach establishment). The noise level can get quite loud, but would not attribute it to the music. People start drinking and start yelling and the tile floors do not help. \n\nSERVICE/STAFF: Generally, everyone is really great. If it's busy, you can tell they are hustling and trying to accommodate everyone. I'm a realist and don't need them to wait on me hand and foot, although I do get antsy when my chip bowl gets empty ;-) I have been fortunate enough to hit the restaurant at the right times - have not had to wait more than a couple minutes for a place to sit.\n\nDRINKS: Mmmm, the Sangria and Margaritas are delicious! It's on my list to try the Chupitos next!\n\nFOOD: The go-to for me and my boyfriend is 4 tacos (for $14, $2 off v. single tacos) and Chile Con Queso (TO DIE FOR). All the taco varieties are heavenly, but my party and I generally stick to carnitas and shrimp. If we're in the drinking mood, we'll go for the Prix Fixe which is: one taco, one generous shot of tequila, and one can of Tecate ($15 value)\n\nTO-GO: I have periodically ordered to-go and service is incredibly fast. I was recently made aware they accept online to-go orders, which is fantastic. Have not utilized this service yet.\n\nOVERALL: Just ... amazing. Food is addicting, service is good, ambiance is typical for North Beach.  Wish they were open later!", "author": "Alicia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "Awesome food. Well put together tacos with fresh ingredients. Came here for a late night bite and it was perfect to get a little nibble in without feeling fat afterword. I will say that the short rib taco was delicious but was sitting in some grease.", "author": "Sheena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "We had dinner a few weeks ago. Party of 8, sat outside.  Excellent customer service. The server offered order suggestions. We ordered just the right amount of tacos!  My only complaint was the other 3 adults didn't want to share another pitcher of delicious margaritas (killjoys)!", "author": "Suzi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "marina location is better.\nMagaritas are abit too sweet -   tacos are a bit too plain - prices are a bit to high.. but I still love this place and eat here at least times a week.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-03", "description": "I am bummed because I like the food and enjoy the Marina location, but I live in North Beach and was excited to try the new neighborhood Tacolicious that I assumed I would love! \n\nThe bottom line is that we had such horrible service here that it ruined the entire meal. Despite the fact that I liked the food, I am deterred from returning.\n\nThey seated us outside and it took 45 minutes for her to come get our drink orders. We had to actually go inside and ask to put in our orders and the waitress finally came out. By that point, we had AMPLE amount of time to review the food and had placed both drinks and food orders. The waitress brought the food out in a regular amount of time, but after we had finished eating, we waited another 30 minutes for the check. We had to go in and ask for her to come give us the check too. Then 30 more minutes for her to collect our check. We went in and gave her the credit card and check. Needless to say, she didn't get tipped very well. The horrible service was the topic of dinner, but hey, at least they were consistent. Why bother to sit people outside if you don't serve outside?\n\nNeedless to say, we left with a really bad taste in our mouth, figuratively speaking. I don't plan to go back here - but would likely return to the marina location where the service is much better.", "author": "Megan F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-20", "description": "The food is ok. The service is horrible. \nAfter we got seated we had to wait 30 minutes for our server to finally take our order. Meanwhile they kept serving us chips and salsa. After we placed our order it took another 45 minutes for the food arrive. By then we were tired, also full from all the chips they served us. No one really touched the food. We just wanted to pay and get out of there. The manager offered to give the kids a few Churros sticks. Not sure if I would go back to them again.", "author": "Gelareh E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-08", "description": "A***holes, and horrible customer service.\nTypically such a fan of T.L. But today service was way below standard.\nSo I show up on a tuesday date day on a nice Sf day. As we walk into the the bar we are told \"Oh the staff is just finishing up up a tequila tasting, come back in maybe 20-30 minutes. \nFine, no big deal my date and I head off to have a drink. We return approx 30 minutes later and are told the same thing.\nUmm okay. . .\nThe game game is on so we visit another one of of our fave bars in the area and this time return 45 mins later.\nAt this point it is blantantly obvious the guy that talked with us in the begining is lazy-eyed drunk(along with most of the staff at the bar) and slurring his words \"another 15 more minutes\" There was no way we were waiting around again to be served by this crew.\nHey, if you're closed just say so. Show some respect for your customers.\nWon't be returning. . .", "author": "Kia B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-06", "description": "I love the habanero (yellow) salsa. Good selection of tequila and mezcal. Place fills up really fast so plan accordingly.", "author": "Tiger T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "Went here for a friends bday a few weeks back.\n\nThe appetizers were great. The drinks were fantastic. The tacos......eh.\n\nthe prices were ridiculous. Im all for spending my money on food but knowing that Don Pistos was only a block away made my tummy sad.  The al pastor tacos i got were REALLY REALLY dry. \n\nOur waitress was fantastic though!!!", "author": "Krishna M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-19", "description": "We were new in the hood when we decided to try the hyped up Tacolicious. This means we ordered way, I mean way way too much food for 3 people.\n\nOur order:\nMade to order guacomole - we were so hungry when we got there and I was especially excited about the guac. Then it came...and it was such a tiny portion for $8.25. YES! $8.25!!!\nFried sweet plaintains - oh so yummy!\nEmpanadas de calabaza - these are veggie friendly. \nKale Salad - power greens so we had to order them.\nAlbacore tuna tostadas - not memorable.\n10 Tacos - we ordered all of them and none of them stood out so I can't recommend any of them. Sorry folks. \n\nAnyway, if you're looking for mexican without the frills, go to El Farolito for burritos or La Taqueria for tacos. But you'll have to find my reviews for those spots.", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "Yummy Taccos and great place. The Salsa was also really good. Order 4 mixed taccos  and taste the difference.", "author": "Inderle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-30", "description": "We went to Tacolicious for the first (and last) time last month. The food is good, but poor service made it the worst dining experience I've ever had. \n\nThe waitress who served (Ella) us was very condescending and we felt like we were intruding rather than being her (paying!) guests. She seemed to be annoyed by the fact that a colleague had a special dietary requests (dairy free). She walked away from our table in the middle of taking our order, because we had questions about the menu, promised to be right back, but in fact she returned over 5 minutes later and in the meantime managed to take an order from another table. The same happened when we requested the check - another table requested the check after us and got it immediately, we had to wait for our check much longer and then another 10 minutes to for someone to run our card. Our drink order was mixed up (we specifically ordered everything with no ice, when the drinks arrived with ice and we asked to have them replaced, the waitress did not apologize and only seemed to be annoyed by that) and we were continuously neglected during the stay (she was approaching all other tables, but not ours, and since she was not even looking in our direction, it was impossible to attract her attention). \nThe waitress only had a couple of other tables in her section, so I really can't find an excuse for her to neglect us in such a way, and there is absolutely no excuse for her to be rude and condescending. \n\nNeedless to say, we will not be coming back. The area has a lot of other workday lunch options and Tacolicious lost 3 potential regulars.", "author": "Ela P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-27", "description": "Excellent food been here several times for dinner. Margaritas are strong and the tacos are Heaven. I red command the short tips and fish taco. They also have a weekly taco which is a nice switch of pace. Best deal is the beer, shot and taco for $10! Can't beat it! Great place for a fun date or a night with your buddies. Yummy and hospitable. Pisto!", "author": "Katelyn B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-10", "description": "Service was great but the Bloody Maria was not good at all. Hoped the ceviche would be good but I couldn't finish it.\nMy friend had the tacos and the carnitas was subpar. I know the other reviews complained about the service but I went in a Sunday afternoon with a small crowd. It was raining and people were waiting around the block for Mamas and an hour wait for pizza. So I figured this would be a good alternative but was proven wrong. \nI grew up in the mission and had my share of tacos. This doesn't compare to good locations out there. If you want high end Mexican I recommend you try Reposado in Palo Alto for real high end Mexican food. Los jarritos on Van ness is a good choice for a sit down Mexican restaurant.", "author": "Cesar B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "I've been here more times that I can count and this is great. Huge - I mean huge- selection of tequila. If you love tequila, you must check this place out. It's such a lively and fun place to get a drink with friends and have a light dinner. They have tacos, a couple of salads - very good salads, very good tequila cocktails and some decent deserts; churros, flan, waffle chocolate taco. The thing that keeps me coming though is the vibe. Very laid back, casual, and fun. Sometimes I just want to go have some tacos but don't want to go to some hole in the wall or an upscale place. This place is an in between. The service is hit or miss but at a place like this who cares. It's such a fun environment to meet people for a casual drink. If you're into margarita - the real kind - then check this place out.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "It's really more 3.5 stars.  4 tacos for $14 is a pretty decent deal and will definitely fill you up.  We ended up trying 6 different tacos.  The cod, short rib, and shrimp were all just OK.  The vegetarian (corn, squash, and peppers) was very good, and the carnitas was great (comparable to Nopalito, IMO).  The double corn tortillas were a little too substantial for some of the tacos, so we had to discard the outer layer in some cases.", "author": "Simon L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-14", "description": "Terrible service, but good food. We were ignored for a good 20 minutes. People next to us (seated after us) were seen before us. Only after we called someone over did they actually come to our table. Surprisingly this isn't the first time I've had terrible service at this place. Order ended up being wrong, TWICE (meanwhile having no idea who are server was because we had 4/5 different people come talk to us). Really disappointed because not one person apologized for anything. At least do that when you mess up, MULTIPLE times at that. Anyway, wouldn't recommend this place. You can get bomb ass tacos at another place, not pay up the ass for them, and get amazing service.", "author": "Rachel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "Awesome tacos.  Can be very busy on weekends.  Waiting to go back on next trip to SF.", "author": "Rich N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-14", "description": "$5 for a single, yet fancy-ass, street taco?  Never again.  Not to mention the fifteen minute wait for a margarita pitcher as we watched the bartenders mill around doing something (apparently) infinitely more important than making drinks.", "author": "Jason R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Very good happy hour, with a nice crowd.\nWe had the Tacos, Nachos and the chips and salsa felt like I was in Cancun.", "author": "Kevin K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-09", "description": "Hysterically the worst service I've ever had without actually dining at a place. \n\nI understand wanting to close the place at 2:20 PM on a Tuesday afternoon without putting up a closed sign so the employees can have a tequila \"tasting.\"  Just don't tell people, \"We'll be open in 20 minutes\" only to have customers return in 30 minutes and tell them \"20 more minutes\" and have them return and tell them again \"20 more minutes.\"  By this point, the manager who kept telling me, \"20 more minutes\" was visibly intoxicated and had nothing to say other than \"20 more minutes.\"  I told him what he could do with his 20 minutes and walked out only to hear an eruption of laughter from the drunken employees of this marginal chain restaurant.  \n\nYou're probably asking is, \"why keep going back?\"  \nBecause my friend had a coupon, that's why.  God knows, I'll never give them business.", "author": "Corey V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "Had date night here last night. Wasn't disappointed! We had four tacos, three fish and one braised shortrib. We also got the queso dip to start and a few beers. They have the huge old school Coronas and it was great to have with our meal. The chips and salsa were amazing! They have this yellow habanero salsa that's pretty damn spicy but oh-so-delicious. Definitely coming back soon.", "author": "Cat G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-02", "description": "for the soft opening, like the other ones im biased. ive gotten to know the core crew pretty well, and they always treat my friends and me so well. chips salsa/queso, mini ceviche tostadas, tacos of short rib/carnitas/mixed grilled veggies and churros compleated the eats selection. sangria, margaritas and a drink with cucumber juice made the booze trifecta. The GM Ryan and his crew took amazing care of us even though we were in the far corner. It's great to see theyre flourishing and killing it across the board.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "With the new North Beach location just off Washington Square Park, I must say I'm a fan. Outdoor seating, large open space inside and friendly staff make for a good experience. Food is reasonably priced and they have a great happy hour to top it off. \n\nI always get the pasíon margarita (extra spicy) when I go, so delicious. I like the North Beach location better than the Marina one for sure; the crowd is much more manageable.", "author": "Carlynn A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-22", "description": "On Saturday, 6/21/14, my girlfriend and I decided to go eat at Tacolicious in San Francisco located in North Beach for lunch. I've heard a lot of positive things about Tacolicious and I've really been craving Mexican food so we made it happen. Read on to see how it went. \n\nAtmosphere/Decor:\n\nTacolicious is located right next to Tony's Pizza which is in a nice area. When you walk up to Tacolicious you will see outdoor dining tables. This is a great option especially when the weather is nice or when you want to sit outside and eat on a nice summer day. The interior of the restaurant is pretty nice. It has a nice open floor plan. Once you walk in to the restaurant you will see a nice sized bar to the right with plenty of alcohol options. The tables are pretty modern. Each table is set up where one person will sit on a large sized grey stool structure and the other person will sit on the the other side which is more like half of a booth seat. The wooden tables felt a little bit unstable. I only saw a few tables where you could sit about 4 to 6 people. They also play pretty loud music but you can still hold a conversation without the music taking over. The music playlist was mixed with various types of songs. I also liked how you can see into the open kitchen located towards the rear of the restaurant. Overall, the restaurant was well designed. \n\nFood: \n\nMy girlfriend and I decided to go with the 10 tacos for $33. We ordered 3 guajillo braised beef short rib tacos, 3 traditional carnitas tacos, 2 shot-and-a-beer braised chicken tacos and 2 house-made chorizo and potato tacos. All of the tacos came with the traditional cilantro and onions. Let me start off by saying that each and every taco was packed with a lot of meat! These tacos aren't skimpy at all! The short rib tacos were okay. I've had better shredded beef tacos. They were good but lacking in flavor. A little bit of added salt would have helped. The carnitas tacos were good. They didn't taste like traditional carnitas to me but they still had a nice simple flavor. The beer braised chicken tacos were my favorite. Too bad my girlfriend and I only ordered one each. The shredded chicken was packed with a lot of flavor and the chicken was very tender. The chorizo and potatoes were my least favorite. The chorizo didn't taste like traditional chorizo. There wasn't that much flavor to the chorizo nor was it spicy. It actually wasn't spicy at all. The tacos weren't bad at all it's just certain tacos lacked flavor. We also ordered a side of semi-traditional refried beans with cotija cheese and a side of rice-o-licious with mojo verde. The beans and rice were pretty good. All of the food was very fresh and I felt clean after I ate it. Usually when I eat Mexican food I get really bloated and feel heavy. I didn't feel that way after eating at Tacolicious.\n\nService:\n\nThe service was really good. Our waitress actually greeted us when we walked in and sat us down at our table. She took our order within a few minutes. We were brought chips, salsa and water very quickly. All of the employees seemed very friendly. \n\nOverall: \n\nTacolicious is a pretty good place to get a variety of fresh tacos. Each taco is loaded with a lot of meat. It's different compared to authentic Mexican or American Mexican food. In my opinion most of the tacos were lacking flavor except for the carnitas and chicken tacos. If you're craving tacos and are in the North Beach neighborhood, give Tacolicious a try.", "author": "David R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-30", "description": "Awesome prix fixe! We stopped in for a bite to eat before a comedy show, & enjoyed this. It was a beer, tequila & taco of your choice. There was an expansive variety of tacos. Everyone can find their favorite taco! I did not plan on eating Mexican food in North Beach, but got fast service since it was so empty on a Saturday night.", "author": "Tiffany P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-21", "description": "Delicious! My favorite was the Shot and a Shot Braised Chicken Taco. I loved the vibe and atmosphere of this place. And everything I tasted was delicious", "author": "Brooke M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "My first experience at Tacolicious was a positive one. \nI tried two different tacos, the shot-and-a-beer braised chicken and the pacific rock cod. i was able to pick up a beer taste in the battered cod, it had great flavor. The chicken tasted like it had been simmering all day, very good. The sauces that come alongside the tacos are a nice addition, my favorite was the green one.\nThe sides of rice and beans my boyfriend and I got, were the perfect amount for the two of us to share. \n* We drove by the Tacolicious  on Chestnut Street and there was a line out of the door. We decided to drive a few miles to this one in North Beach and it was a lot less packed, no wait for seating.", "author": "Vanessa J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-20", "description": "I'm a huge fan of T-Lish and though I live no where close to this North Beach location, a few coworkers and I made our way over for lunch as it's the closest one to our office.\n\nBy far the most spacious of the SF locations. Food is consistent with others. Pro tip: for a group of people, order the 4 tacos (or more) and split each one between 2 people as they double up on the tortilla. Thank me later.", "author": "Johanna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "I've been to the North Beach location a couple of times, the mission location as well as ordered Tacolicious for catering events. Every time I have been consistently pleased. The food always hits the spot, whether its tacos, guacamole or the marina girl salad. On my last visit I got the chile con queso which was very tasty. Tacolicious will continue to be one of my favorite go to spots in SF.", "author": "Tracy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-11", "description": "I like the concept at Tacolicious and I think if we had experienced even mediocre service, opposed to the non-service we experienced then maybe I'd give it 4 stars.\n\nOrdering a la carte can really rack up the dollars! Sure, I can get cheaper tacos most anywhere in CA but a veggie taco + a kale salad was a perfectly sized meal, not to mention quite tasty. I know that I could've gotten more bang for my buck at a traditional Mexican spot but that would also lead to overeating and/or leftovers and I just wasn't in the mood for all that.\n\nOur drinks were good but nothing to write home about. It'd be nice if they had a few more table and chairs arrangements. After walking around all day my bf was looking for some more back support. \n\nService: 1 star ( that's for our server; the bussers and hostess can have 5)\nDrinks: 2 stars\nFood: 4 stars \nPrice: 1.5 stars \nAmbience: 4 stars \n\nI'd try it again! Who's paying? I'll need more tacos next time!", "author": "Bailey M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Been here twice for dinner and a third time for drinks.  Delicious, fast service for the right price.  $45 will get you dinner for two and two drinks.\n\nCarnitas, braised short ribs, and cod are delectable.  I've tried all of the tacos--yay for splitting with the boyfriend--and they're all really good as long as you are a fan of what's in them (if you don't like shrimp, don't get the shrimp tacos).  The chupitos (mixed shots) are fun, the cocktails are pretty good, and the margaritas are very good.\n\nAmbiance is lively with low lighting and they have outdoor seating.  Small restaurant - group of 6 or less.", "author": "Francesca N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-19", "description": "Great food! We're on vacation from so cal and found this place on accident, so good! Yummy margaritas and the nacho were to die for!", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Tacolicious in North Beach!\n\nWoohoo! Same taco-y goodness as all the locations (same menu according to the manager), and a super delicious looking cocktail menu!\n\nMexican corn was a little dry, but that's the only complaint. \n\nHappy to have them in the 'hood!", "author": "Eli B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Excellent Beef Brisket Tacos! Get the 'Prix-Fixe' option that comes with a tequila shot + beer + taco for $10!", "author": "Ernie G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "For the second time in 7 days we experienced incredible service from Jay and Josh. On our first visit we were blown away by the incredible food and fantastic attentive service. Their knowledge of the vast array of Tequila and Mezcal was very impressive, our drink of choice and the tasting of said we take quite seriously.\nThe Ahi Tuna tacos are a religious experience not to be missed. The recommendation from Ella of the chicken Mole was amazing and Jason the chef then sent over the meatballs and a desert of Churros with chocolate dipping sauce was sinfully good. \nBravo to you all, we will be back next week with more friends and family. Thank you.\nJulie and Robert", "author": "Julie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "I'm a huge T-lish fan and I actively frequent both the Marina and the Mission locations. But now that this wonderful spot opened so close to me, I am in big trouble. I somehow always manage to order one too many pitchers and one too many tacos. I deem it the T-lish curse. \n\nWhat do I love about this spot? \n- Pitchers of the Original, Grapefruit and Passion Fruit margaritas \n- Short rib tacos (1st preference) and Carnitas tacos (2nd preference) \n- Guac dip with chips \n- Dim lighting and trendy ambiance \n- Friendly waiters\n- Great neighborhood location across from Washington Square Park\n\nSo why only 4 stars? The tall stools instead of chairs - it just does not work for me. I'm naturally very clumsy and after a glass or two of margaritas, how in the world is one expected to sit down without falling?! I need to rest my back against something or will consistently feel quite uncomfortable. \n\nAside from that, however, I love this new location and will definitely be returning!  \n\nHappy Eating, Yelpers!", "author": "Priya S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-13", "description": "Tacos are solid, drinks are good, ambience is fun. Great place to go with some friends and chow down on a bunch of different kinds of tacos and try some drinks. \n\nI think i've tried all their tacos (but their menu changes from time to time) and they are all pretty good. Their skillet roasted mussels are really tasty as well. \n\nService has been okay most of the time - when it gets busy, be prepared to wait and be ignored sometimes. \n\nOne time, however, when my boyfriend and I ordered tacos for pick up, they forgot about the order completely and when we got there later to pick them up, they'd lost the ticket or something. The manager (I think?) was incredibly nice and apologetic, and got us a few different kinds of drinks to try while we waited for our order at the bar. Thanks for being so great about our forgotten order!", "author": "Yishian Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "YEAH HEY! Tacolicious in North Beach! Woot Woot!\n\nLet's face it, the T-Lish in the Marina is always a pain in the ass, and when I'm in the Mission I stay loyal to the same burrito I've been eating from El Farolitos since I was in elementary school, but boy oh boy did North Beach need something like Tacolicious.\n\nService is great. Alex and Wayne are totally kickass bartenders, the tacos are tasty and always come out quickly, and the Camarones A La Diablo, yes please. Also, there's so much more space than the one in the Marina, so I always love coming here for a quick drink and a taco on my way home.", "author": "Jessi M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "So happy to give this location in particular a rave review.  \n\nDined here with two girlfriends, we had a great time cocktailing and eating our Saturday night away.\n\nI like this space slightly more than the Marina location, it's more open which lends itself well to the ever-present crowd.\n\nWe did have to wait, which we expected, but happily got down to business with a pitcher of margaritas.  For dinner we tried the kale salad (3 stars, only b/c I'm not *yet* a kale lover), tuna tostadas (infinity stars), an array of tacos (no explanation needed, perfection), and guac (5 stars).\n\nSuch a great evening of delicious Mexican fare and drink!", "author": "Brianna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Worked in this neighborhood for 6 years now and just found this place.  I just wanted a salad as I was walking around, read vinaigrette menu outside.  They had a Marina Salad, thier (which I typically don't like), cucumber, pumpkin seeds, add chicken with a Jalapeno avocado dressing....I literally can't get enough of it...I eat every last bit.   It's a bit expensive, but worth every penny ....I might be eating this every day.", "author": "Patty H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-12", "description": "I'm physically full. Emotionally disappointed. \nThe tacos are bland. I'm all about the tacos. Forget all the other bells and whistles.", "author": "Max H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Very yummy mexican treats with huge portions. Great chips, salsa and guac and good salads, tacos, etc. Nice outdoor seating and plenty of room inside if you were to come with a big group, etc. Lots of fresh ingredients at fair prices.", "author": "K. L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-13", "description": "Two strikes and this place is off my list.  \nLast week - sat down at the bar with my wife for a late night drink.  Hipster bartender has a major attitude and lectures us on how to order from him.  We put up with him and head home.\n\nLast night - Major attitude from the greeter/seater.  Seriously ridiculous under the breath whining about her job. No one comes to the table for over 10 minutes except a nice bus boy with chips.  We finally drop a $5 for the bus boy and leave.  \n\nThis pace has no concept of customer service and clearly does not want or need my business.  \n\nThere are some many good and gracious places in North Beach to enjoy!", "author": "David E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "I shared the empanada de calabaza as a starter. Then had the fried cod, braised chicken, short rib, carnitas, and a special pork (forgot what it was) taco. \n\nThey really pack on the meat! They definitely do not skimp. I liked the cod, chicken, and short rib the most. I thought 5 tacos wouldn't be enough, but it filled me up good. The empanada was good, but I would probably skip it next time and eat more tacos instead. \n\nThis is a great place to share tacos by splitting the double corn tortillas and redistributing the delicious insides. It's a bit loud though, so it may not be a good place for a date or to have a quiet conversation.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-24", "description": "I'd go back. While ambiance was hip, service was good and the food and chips were nicely presented, nothing was particularly noteworthy. \n\nI had 4 tacos for 14 dollars. The two pork ones were good, the seasonal veggie one also good but a bit monotonous, and the Pacific rock cod tacos was pretty bad, tasted like fried breading and there was a real lack of spicy, tangy or creamy flavors to make up for its overwhelming blandness. \n\nSo maybe I'm being hard on them but I just get frustrated having to pay a price premium solely for ambiance, I'd been hoping for some exceptional tacos or at least some interesting imaginative flourishes at this price. For as few mexican options as North Beach has, foodwise you can pay half the price nearby and get better tacos and better salsa.", "author": "Devin M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-17", "description": "Though the food is the same, I have more fun at the Mission location. I don't like that the restaurant and bar are right next to each other. The noise level is way too high to hear the person next to you.", "author": "Margaret R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "I went here for a casual birthday with some friends last night ( there were 12 of us) and it really was such an awesome time! I was kind of worried because I read that they didn't take reservations so I just had everyone meet up and was prepared to wait. It was Wednesday night so I didn't think it would be that bad, and turns out we didn't have to wait at all!  My friends had a table that was a little too small so they happily moved us to a larger one as soon as they could.  No problems, super nice and friendly staff.  Our waitress was so nice and handled the large crowd of us with ease and a smile.  \n\nTacos are delicious!  Try them all!  My favorite Margarita isn't on the menu - I always ask for just a plain margarita with jalapeño and it is sooo good! Just a little kick and so yummy!  \n\nLove this place, the North Beach Location has to be my favorite for sure!  Thank you Tacolicious for making my B-Day night awesome!", "author": "Camille D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "Expect to wait  for good  mexican  food. For the real stuff head to the mission area.", "author": "Jeff D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-21", "description": "What's not to love! Location. Food. The bartenders. Wish I knew the one waitresses name - will have to go back and ask so I can give credit where credit is due - she's incredible. It's just overall a great place to go - whether it's 2 of you or more - the food is amazing. The margaritas perfect for the restaurant. And what's not to love about the location.", "author": "Sheryl F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Great place!  Food is delicious.  Best tacos that I've had in San Francisco.  For a first timer, i'd recommend the 3 tacos for $12 and try 3 different ones to see what your favorites would be.\n\nGreat video on  YouTube of them making Guacamole.  Order it and its made fresh right in front of you.\nhttps://www.youtube.com/watch?v=R31jcwTdlxw", "author": "Michael U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-07", "description": "I've been to the Tacolicious in the Mission and the Marina, and maybe it was the night I was there (a few days after Christmas), but it was incredibly quiet when we walked in after being told the wait at Tony's was going to be 2.5 hours for 7 people. I had just received the Tacolicious cookbook from my mother-in-law, so naturally coming here with her was really special.  We were seated right away at their bar tables and were approached by a waitress almost immediately. Baskets on baskets of tortilla chips and salsa were provided within sitting down as well, and it turned into this basket that never seemed to have a bottom. Since there were 7 of us, we ended up ordering a fair amount of food...as in, 30 tacos, two orders of guacamole, and an order of the grilled squid veracruz. As always, my favorite taco here is the carnitas.  Surprisingly, the taco of the day was probably the most disappointing despite it having bacon in it. We passed on dessert because everyone left here absolutely satisfied and insanely full. Tacolicious is fairly consistent when it comes to delicious tacos, and its North Beach establishment is no different than the other two places I had been to before.  I loved here and wouldn't mind going back!", "author": "Lisa I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-06", "description": "So here's the trick to having a good experience at Tacolicious : Sit at the bar, and go on an off night.\n\nWe've been a few times on Friday and Saturday nights had decidedly disappointing experiences due to the service and noise levels. The quality of service just isn't there and both times we ended up waiting rather awkward lengths of time without drinks (nothing puts a damper on tacos like empty margarita glasses). The sound is also pretty atrocious here. On a busy night, you can hardly hear the person sitting across the table from you because there's just nothing to absorb the noise. \n\nHowever - when we've gone on slower nights and sat at the bar, the experience has been great. The barstaff is friendly and charming, they know their tequila and the service is on point. Plus, you can actually carry on a conversation with your date!\n\nI love the ceviche here, and the fish tacos are pretty great as well.", "author": "Caroline M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "The service here is excruciatingly slow. I come here all the time because of friends they consistently take 10+ minutes to complete a beer order.", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "This place is really delicious. I went with two friends and we got the 10 for $33 deal and ordered a variety of their delicious tacos. The food is very filling and tastes very natural. Service and location were also great. I will definitely come here again.", "author": "Dani P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Wanted to visit here the whole time in SF and it was certainly worth the wait! Excellent food, great fast service. And I am in love with any restaurant that will leave you a carafe/bottle/pitcher of water. It's so smart, frees up servers for more important things!", "author": "sharon m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-17", "description": "The food, cocktails, and service were great here. \n\nThe main problem with this space is the acoustics. When I cannot hear someone talking to me in the same table there is a problem. They need to put in some foam insulation so there are fewer surface sound can bounce off.", "author": "Anthony K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "haterz gonna hate\n\ndisclaimer: i dont live in SF and cant speak out for the bay area food snobs, however tacos are my life and i really, reeeeally enjoyed myself here. also i went on an empty monday evening. \n\nif an affordable taco is what you seek go somewheres else, i came to san fran to spoil myself and spoil i did.\n\nhouse salsa is great, a nice medium/mild blend with some chunk and a nice citrusy aftertaste. i sat at the bar, barstaff was super nice. house margarita: BOMB! order 2 (at least :) ) \n\nat this point i will digress a moment to discuss taco prices. in california if you are eating \"authentico\" and it tastes good, my younger, degenerate self would tell you that if you are at a joint that 1) charges you over 2$, 2)accepts credit cards, 3) allows u to order in english; than ure just wasting your time. however!!!!!! my recently hard working self would tell you that paying 4.50 per taco at this small, little, \"hipster\" taco bar is worth every penny.\n \ni had one cod, short rib, and shot and a barrell chicken, my taste buds were rocked. they played the \"safety dance\" while i was there but my wallett was three sheets to the wind. have been once, will be back for more; hopefully while some girls and not a creepy old man are present. really liked the presentation on all levels, everything i oredered came out in a clean, sleek, and well organized vessel. hot sauces are TASTEY, especially the habañero, dont be afraid!!!! has a more mild and rich flavor than one would expect with that pepper. \n\nupon receiving my 3 taco/2 margarita bill of 40 dollars, i was greeted by a firm handshake from the bartender who thanked me for coming, after which i happily tipped 6 dollars. \n\nif you are worried about breaking the bank, stay in the mission, if you are looking for a foward thinking (read:fresh/fun) expexerience on the taco than you cannot go wrong\n\nalso****** if you are a stickler, these folks wrap their s$@t in not one but two taco sized corn tortillas, 1) because they LOAD it up and 2) because thats how mí abuelita does it", "author": "Eat M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-25", "description": "Service was pretty rough. Tacos were yummy but server forgot sauces (had to ask) and we ended up clearing our own plates from the table onto an adjacent table after the server brought the kids' desserts but didn't remove their lunch plates! So bizarre since the restaurant was practically empty.", "author": "Lindsay W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-08", "description": "This has to be the loudest restaurant in San Francisco. On a recent visit, we were literally screaming at each other and sitting next to each other.  Our food arrived before our drinks and was fine.  But cold.  This place makes me wonder what is happening to the old school charm and authenticity of SF.", "author": "Monica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "Place is Crazy crackin sometimes but food is quite good... drinks our flowing.. staff seems very competant but I wish they would hire some more people and raise prices so it can be more relaxed feeling.", "author": "Adam O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "When I first read that a Tacolicious was opening up in North Beach I was extremely excited! (I love me some Tacolicious but the one in the Marina is always so crowded and while the location in the Mission is nice, we just don't venture that way very much anymore.) \n\nFast forward to yesterday when I officially received a job offer and couldn't think of anywhere else I'd rather celebrate than the new Tacolicious location. Delicious margaritas and tacos? Yes please.\n\nMy guy and I arrived around 8ish for dinner and were seated right away. Chips and delicious salsa were placed in front of us as we perused the menu. We started off with a pitcher (probably not necessary) of margarita picante (a favorite) as well as the albacore tuna tostadas \"contramar-style\" per our waitress' recommendation. We decided to go with the 4 for 14 deal and ordered 2 fried local rock cod tacos, 1 house-made chorizo and potatoes taco and 1 guajillo braised beef short rib taco. While the fried cod is always delicious, we decided that the chorizo and the short rib tacos were definitely the winners. The fried cod seemed to have a higher batter to fish ratio than we prefer, but it's still tasty.\n\nWe decided that this is definitely our favorite location not only because it's within walking distance of our apartment but also because of the size and layout of the restaurant. It feels much more spacious and open than the others. We definitely plan to make many return visits, there's a lot of delicious looking eats and drinks that I still want to try.", "author": "Emily S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-13", "description": "Reasons for the 3 stars:\n\n- 1 for the lack of tables. It's a big restaurant, but you'll notice that there are a lot of 2 seaters that they put together for larger groups. IMO, a few more tables can easily be added to reduce the wait time.\n\n- 1 for the bar service while you're waiting to be seated. During my experience, I was waiting at the bar to get two beers. Two of the three bartenders were working on table orders leaving one dude to man the bar. Took about 8 minutes before the one bartender could get my drink, but when I was seated, I ordered a drink and literally got it within a minute. Here's a suggestion - people that are seated can wait a little bit for their drink since they're already seated. Keep the people waiting for their tables happy since the wait takes a while.\n\nOther observations from a Friday night:\n\nFood: The food was great. The only taco that seemed a little off was the Chorizo taco - it just didn't have that much flavor.\n\nAtmosphere: I couldn't tell if the music was loud, or if the crowd was louder. Just be prepared to talk loudly, or repeat yourself during a conversation.\n\nWaiter Service: Excellent, no complaints.\n\nNote: This has nothing to do with the restaurant, but let me just say...Blondes, blondes everywhere.", "author": "Alfonzo J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "I love this place and try to go at least once a week. My only problem with it is the lighting. Apparently the owner likes to dim the lights and it makes it hard to see if the place is even open, much less read the menu without a flashlight. So, if you are walking by and think it's closed, take another look.", "author": "Patrick R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Great new spot in North Beach, which was sorely lacking in Mexican food options. Lots to like about Tacolicious. Great chips and salsa trio. Great beers on tap. Great service. The tacos are very solid as well. They are sized somewhere between street tacos and full-size tacos, but are very tasty and satisfying. Skip the fillet mignon option. They are not worth the extra $3 per taco. There are TVs for watching the game and a comfortable bench along the back wall. I lingered a while watching MNF, and enjoying an excellent IPA on tap.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-12", "description": "Unfortunately some of the people here don't know how to treat customers and manage the tables. I asked the hostess a table for 4, she said it would be one and a half to two hours, which looked strange considering that there were many empty tables and just a few people standing, but I said ok, let's wait and see if maybe it gets faster. After 10 minutes I got the text message saying that my table was ready. How can you misestimate the wait time that much? What if I had decided to go somewhere else and get a drink while I was waiting for my hour and a half? Whatever... As I went to her, I discovered that she put down a table for 2, although we clearly said that it was for 4, but she was only able to say that we would need to wait again for a new table for 4 to open up! The funny thing is that there were at least 3 tables for 4 empty at that moment and no one waiting for them, and she couldn't fix her mistake by giving us one of those tables... Besides the hostess, we also had some other unpleasant incidents with other employees, which makes me think that this place needs to reevaluate how they treat their guests. Too bad because the food then was good and our waitress was nice, but because of her colleagues the overall experience was poor.", "author": "Massimo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "I hate giving anyone a low review. I really wanted to love this place I mean how cute is the name. Had the guacamole & albondigas & tacos. Nothing special about it. Wish we would of tried somewhere else.", "author": "Kami R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-22", "description": "What a pleasant alternative to the Marina,  which would be the perfect location... If it weren't in the marina.  I'm a little sad they took away the Victorian charm out from the previous resturaunt here,  but its a dope spot.   Playing all my favorite songs from The Animals to Psychedelics Furs to 2 pac.  Oh and did I mention the food...\n10 starts if I could.", "author": "Kelly N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "So, although I wouldn't say Tacolicious isn't true and authentic Mexican food, or even the best place for Mexican in San Francisco (go to La Taqueria in the Mission for this), Tacolicious is amazing.  I especially love this location because all of the staff make an effort to make sure you're happy and are treated right.  Their guac and cheese appetizers are must haves.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "Loved this place!! My friends took my husband and I here on our first night in town. The drinks are strong, and the tacos are delicious! Reasonable prices too. It had a fun, boisterous atmosphere, and was a perfect place for a fun night out with friends!", "author": "Katie B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "One of my favorite places to go with friends. Great food & great atmosphere! Their deal of a taco, a shot & a tecate for $10 is the best!", "author": "B S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-10", "description": "Hate to do this to you tacolicious, but this location is a shit show (love the one in the mission, other two I went to have been fine as well). Let's see, in short these were the major issues:\n\n1. Seated right away due to a pretty empty restaurant, so food will come out fast right? Nope, 2.5 hrs later and we finally get our 10 tacos.\n\n2. Tacos were lukewarm. Maybe they microwaved them...in 2.5 hrs. The beef short rib tacos are my favorite, I've had them at least a dozen times at various locations. They came out rock hard/dry, cold, and fatty with no seasoning. \n\n3. Chips were stale.\n\n4. Service--- doesn't exist, it took only 30 min to get a menu and we never saw our server again. They didn't even get the order correct, but our party was so done by that point to care. We just wanted to GTFO.\n\nWTF is going on at this place. If I was blindfolded and served the food, I would have never guessed I was eating at tacolicious. One of our friend's said \"this is just like Yabo's tacos in Columbus\" as a compliment...that's when you know it's bad, Yabo's is horrible. Tacolicous should never be compared to such a place...\n\nThe mission is insanely busy on weekends, but at least the food is great. Just go on a Sunday if you can or a weekday. In fact I went the very next day given my experience here, to get my taco fix and make sure I wasn't dreaming. It was like going to an entirely different restaurant. Sure we had to wait for a table for 15 min, but at least it was worth it....unlike this location. I normally give places two tries (in case it's an off day), but this one is out in one when there is no shortage of other locations.", "author": "Puneet S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-22", "description": "I love the tacolicious near me on Chestnut but I visited this location yesterday w some friends from out of town and was very disappointed.\n1. Service- Very poor. Our food came out promptly but was just dumped on the table by a food runner. There was no explanation of the different tacos or salsas. We didn't know whose order belonged to who. The food was cold. We wanted to get it heated up but couldn't find our server, she never stopped in after to ask how the food was. It took 20 mins to find someone to run our card. I had to ask the staff to remove dirty plates. I think only 1 server was working and the food runners were not being quite helpful. There were two guys behind the bar hanging out, not sure why one of them couldn't help her out.\n2. Traditional carnitas was very greasy and lacking flavor. Probably would have been better hot. The fish tacos were also generic. The huevos rancheros was satisfactory as was the short rib. \n3. The margs were disappointing. Not worth the $10. Visit Nopalito, or the Chestnut tacolicious for better margs! \n\nI will never return, so many better options", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-23", "description": "I have been meaning of to write this review for awhile. Back in June my husband and I came to visit SF with some friends. We made a group reservation for 10 people on a Saturday night. When we arrived for our reservation they said they were really busy and our reservation would be pushed a little. After one hour past our reservation time we asked the hosted when we would be seated and what happened to our reservation and she rudely responded with \"SH*T HAPPENS!\" WOW!!! Talk about quality customer service. We remained polite and finally were sat 1.5hrs after our reservation time. The bartenders were also rude and no one apologized for the delay. Probably the worst customer service I have ever had at a restaurant. Definitely won't be coming back or recommending to anyone! Managers really need to be taking a closer look at their staff.", "author": "Laura K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "There are not enough good things to say about this place.  The food, the atmosphere, the staff, the drinks, the Paul Madona artwork... AMAZE!\n\nAtmosphere: Tacoloicious is perfect for any event or time of day. My roommate and I joke that it is an extension of our apartment. We go straight from work, on Sunday afternoon after a gym class or on Friday night before going out. The patio is great for eating outside and the bar is always vibrant and lively Thursday-Saturday night. It is a super trendy spot filled with Paul Madona artwork. The open kitchen makes things feel more authentic. \n\nFood: I literally eat here at least once a week and it never gets old. The short rib taco is unreal, the queso is delicious and the chips and salsa are phenomenal. They recently had a vegi taco of the week that was perfect for my roommate (in addition to the vegi taco permanently on the menu). The taco of the week rotates - every one I have tried has been unique and tasty :) The marina girl salad is a great lighter option as well. If you are looking for dessert the churos are the best I've ever had. \n\nDrinks: All of the drinks are amazing. The ingredients are fresh and there are a lot of fun margarita and mixed drink options. The Nopal is my personal favorite. If you buy a pitcher it is affordable. \n\nStaff: The staff are some of my favorite people. The hostesses are always friendly and greet you as you enter. Chips, salsa and water are delivered to the table shortly after sitting down, my order is always taken promptly and the food is delivered very quickly. Ryan, the old general manager, and JP the new one (and previous bar tender) are great and do a fabulous job making tacolicious a welcoming and fun place to spend the evening. \n\nIf you haven't been to tacolicous you are missing out!!!", "author": "A H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "Chips & salsa, vino and the Marina Girl Salad.  The little things in life that get you by :)\n\nAmen for the new spot.  Perfect reason to stop by on the way home from work or start a night out in NB a little earlier than planned.\n\n3 reasons why I love the new spot,\n\n1.  Cannot thank them enough for opening up such a spacious location to house one of the best restaurants in town. \n \n2.  I can hear my friends talk from across the table.. without having to scream.\n\n3.  My glass of wine, although always a generous pour from any T-lish, is kept full of my favorite pinot grigio without question.  \n\nBravo T-lish, bravo.", "author": "Lisa G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "I came here for lunch with a friend on a Sunday and it was packed. Luckily there were two spots available at the chef's counter facing the kitchen. We watched the cooks as they quickly grilled meats, assembled numerous tacos, and prepared salads. \nWe ordered a bloody mary, tacos, and the kale salad. The salad was fresh and the vegetables crisp, although it didn't come with quinoa as advertised. We tried the chicken, steak, and veggie tacos. The chicken was the best - shredded chicken was marinated in a flavorful smoky cerveza sauce. Homemade chips and salsa were a nice addition. They also served three different sauces with our meal, each unique in spice and flavor. I highly recommend this place, especially if you can grab a table outside on a sunny day. They have other locations in the Marina and Mission.", "author": "Alya G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "Delicious tuna tostadas, calamari salad, and guac. The margs are also always amazing! Taco of the week is always good and generally the tacos have enough meat to make two tacos. Only one time out of the hundred times I've eaten did I have a so-so experience when the tuna on the tostada was a bit too salty. Overall a fool-proof go to mexican spot. The only reason for 4stars is because it is $$$$", "author": "Taylor P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-03", "description": "The guac and tacos here were very good.  Also enjoyed the fresh salsa served at the beginning.  My biggest gripe here is the price.  While the tacos were savory, the portions were small for the price, and there was nothing out of the ordinary about the cuisine to merit the higher price.  \n\nHowever, for a clean, fresh dinner at a fun place with tasty cocktails, this is definitely a solid pick.  Ordered the taco wine, fish tacos, and carnitas tacos, and all were tasty, as I said before.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Tacos, cocktails, and great service. What's not to like? Dino is our favorite server. He's funny, charming and attentive. Any time we are in North Beach we stop by here just to see him, and have a taco or two. Like Good Times Dino is Dino-myte!", "author": "Jacklyn H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-22", "description": "My girlfriend and I had an assortment of street tacos and salsas.  They were great along with the drinks!  We just moved to the area and I think we found a spot we'll be hitting up frequently! Thanks!", "author": "Matt H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-30", "description": "This place has a cool atmosphere but not my type of party. Food is too expensive, we ordered guacamole for 9$, which we could of got for free at a real mexican restaurant and not a white mans mexican themed establishment. BUT they were playing good music.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "Went for Sunday lunch, very happy with our food. Guacamole was excellent and the place is nice  will probably go back if in the area.", "author": "Laura D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-29", "description": "Overrated in a serious way. Perhaps this a great spot for happy hour, but we came to eat food after reading rave reviews.  This is the loudest place I've ever eaten a meal. The chips and salsa were both decent, but the tacos were nothing but meat. Imagine going to Taco Bell and getting a taco packed with pure Taco Bell meat. Can I have some sour cream, cilantro, tomatoes, or anything else other than pure meat packed into a taco? Additionally, even if this is a well known happy hour spot, the sangria was nothing to write home about.", "author": "Jolie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Always a pleasure eating here and enjoying all of the sights. I order the carnitas and chicken tacos. The three sauce selection pairs perfectly with the entrees. Drumroll please: the chips and guacamole is the best in San Francisco. Get there before peak time e.g. weekdays before 5:00 PM.", "author": "Trevor C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-26", "description": "Insanely good food!  Took awhile to get post mates to deliver it on a Memorial Day but that's just life.  Best tacos I've had in years and great sauces too.  Wife is half Mexican and we think we are experts on the topic of good tacos.  Love this place.", "author": "Andy P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-25", "description": "Tacolicious is one of my favorite spots in the city! The bartender Wayne is so accommodating and nice and very helpful. The foods great and we always have very efficient service whenever we come in. Try the pasion margarita and carnitas taco! They're the bomb!", "author": "Anna K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "Great Tacos, great service, would recommend next time your in North Beach.  \n\nWent to Tacolicious on a Saturday around 12:30.  The restaurant was busy, but we were seated right away.  We ordered a 10 pack of assorted tacos and 4 chupitos (large shooters).  All of the tacos were great, I especially liked the short rib.  When ordering the chuitos we tried to order more than one kind but were informed we had to order all the same because they make them in one large batch, makes sense if you think about it.  We couldn't decide between the Nopal and the Mucho Gusto. We decided on the Nopal.  At the end of our lunch along with the bill our waitress came over with another waitress and brought us 6 Mucho Gustos. 4 for the table and 2 for them which they drank with us.  All in all a great experience.", "author": "Brian B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-17", "description": "Ambience- super cool. \nFood- delicious \nDrinks- inventive. \nGo!!", "author": "Shannon M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-30", "description": "Very good food but salty and greasy. Great drinks. Overpriced for what it is. The guacamole is $8.25!!", "author": "Marcy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "Bartenders know how to use tequila - I'm not talking strong, I'm talking about using it as an ingredient to compliment some damn good tacos.", "author": "matt j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "When I say I am always here, I am ALWAYS here.\n\nI visit this Tacolicous at least 2-3 times a month and I am never disappointed. \n\nService: This place can get really busy during happy hour and big events, but the servers are always attentive.  Be ready to look over the menu quickly and place your order. Tlish is fast-paced - not because this place is trying to rush you out- because they are trying to feed the masses. My water glass never empties and there's a never-ending supply of chips and salsa. \n\nFood: I've had almost all of the different types of tacos and margaritas - my favorites are the Nopales and carnitas tacos and the nopal and mucho gusto margaritas. Each taco comes with an extra tortilla which means if you order two tacos, you're really getting four! \n\nAmbiance: The music can get loud as the night goes on, but it's a boisterous, fun place to have a quick meal.  \n\nOverall: Check your expectations at the door folks- just come in and enjoy the food and the ambiance.\n\nTip: TRY THE QUESO. Just do it.", "author": "Jess A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "Enjoyed my meal here. I would actually give this place 3.5 stars but one of my issues with Yelp is that they don't allow you to rate in half increments. Food is good enough that I would definitely back come here again and I can tell you that I have already craved those excellent tacos.\n\nWas served a basket of good chips and salsa. Followed up with a hearty and very good Aztec Chicken Soup which had a tomato base and large chunks of dark meat chicken with additional condiments. \n\nI then had three very good beer braised chicken tacos with a side order of rice. \n\nLiked that they brought out three sauces to use for the tacos.\n\nFor taco lovers I recommend this place.", "author": "Mitchell M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Finally made it to SF to try this place, and very glad we did.  I had bookmarked their salsa recipe online a while ago, and got to try it at the restaurant - it is seriously delicious.  I ate way too much there, and then went home and made it myself.  It's a roasted tomato salsa with mint added, which takes it to a really special place.  The rest of the food was good.  Unusual things to try, mostly well-executed.   There were a couple vegetarian options, and they were good, but a place like this could easily have more than the couple.  I thought the only vegetarian option for beans was good but a bit boring.  Cocktails were good, we tried a couple of their signature drinks and enjoyed them.  Table are very close and it gets loud.  Service was okay, not great, though our bartender was very personable.  The food was good and I would definitely go again.  Tony's Pizza next door is a huge draw and doesn't take reservations, and the waits are usually 1-2 hours.  For now, Tacolicious is much less crowded and we spent some time at the bar there waiting for our table at Tony's.  We also diverted there for lunch instead of Tony's on one visit, and it was a nice alternative.  Definitely follow your meal at either place with gelato from Naia across the street - best gelato anywhere!!", "author": "Robyn B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "Delicious. We came on Saturday and it was a full house, but not too crowded. Great margaritas, and a fun vibe. Accidentally ended up here for breakfast that Sunday and we were not disappointed! The lemonade is so good, it's insane. We got the brunch breakfast burritos, very tasty.", "author": "monica t."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "The chips were stale.  We asked for another bowl, but were told they only had one source so it would be the same chips.  The beer on tap was flat. We were there at 5:30 so this would have been prime time for dinner food,", "author": "S S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Great meal, service, and location. We sat outside on a gorgeous San Fran afternoon. The braised rib tacos were incredible and the guacamole was also really good. I would recommend this restaurant to anyone; it's kinda family friendly if you went early and your kids were cool.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-15", "description": "Horrible service and drunk employees. Waited to be seated for 45 minutes and decided to leave after seeing people arrive after us that were being seated right away. The owner should get a clue and hit responsible adults to run their business.  We had guacamole while we waited which was mediocre at best. Don't believe the hype.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-13", "description": "First let me say I'd give 3.5-4 stars for the food and atmosphere here.  I've been here a couple times already and like most of the food (and service the previous time was 'ok') IMO, the ambiance and atmosphere are exactly what this neighborhood needed.\n\nBUT the service at the bar?  Are you f r e a k i n g kidding me?? \n\nThere were two young male bartenders on duty (Monday night) I simply couldn't believe the complete lack of service and attention to ALL the customers, not just us.  These guys clearly didn't care about their customers at all.  Ordering seemed to be a privilege that bartender #1 reluctantly granted to me.  Once the food arrived, not ONCE did they ask if any of our food was ok or if we needed anything.  In fact I really wanted to send one thing back because it was cold but I couldn't get their attention, so I just ate it cold!  We would have also drank a lot more but they never noticed our empty glasses or asked us what we'd like next.  Imagine that, at a bar!?  They don't even make eye contact with the thirsty customers or notice when glasses are completely empty!  Wow.  One customer next to me was trying to pay their bill for at least 15-20 mins, poor girl.  It was good to see though that the bartenders enjoyed several shots shared and cheered between themselves during this time.  I guess they were toasting mediocrity, indifference, or the fact that they were so lucky to con somebody into giving them this job.\n\nNote to Management:  You have a great restaurant in a great location.  Don't screw it up by hiring such ungrateful non service oriented d-bags for \"bartenders\".  This kind of service might fly in the marina, but to adults in North beach, it's offensive.", "author": "Kyle K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-15", "description": "Everything was fresh and timely. Drinks were delicious, with or without the alcohol. Generous portions of actual protein on taco. Too bad the taste and creativity is mediocre and nothing memorable.", "author": "Kayu T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-17", "description": "I had no idea how good a taco place could be until I tried Tacolicious.  My group ordered a few of each type of taco and a pitcher of margaritas, loved everything, then repeated the same order and thoroughly enjoyed it all over again.  It was fantastic, I can't wait to go back.", "author": "Kenny J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "Sat in the corner part of the bar with a friend and was very content. Bar tender was friendly and attentive. Their salsa is amazing. It has a fresh kick to it that is beyond lime....i feel like it's mint. We split 4 tacos between us and 2 was enough to get us full on top of the guac, salsa, and bean dip they gave us. The pulled pork tacos were a win! Definitely be back.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "Just had a killer lunch here. Vegan tacos. Great SFO-based IPA. Amazing server (Brianna). Thanks! Just enough food to get me back on my walking tour of this awesome city. The habañero salsa was just enough fire in the belly!", "author": "Vikas S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-08", "description": "Mediocre tacos--I don't understand why everyone in SF is obsessed with this place! I'd say it's because of the free chips and cheap tacos, but everyone knows the Bay Area has more $$ than they know what to do with. I'd rather try a random shack in the mission.", "author": "Abby H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "I have been going to Tacolicious religiously over the course of this past year and it never disappoints. Whether coming with a huge party at night or for a business lunch during the work day, the ambiance allows for any type of rendezvous. \n\nBeing a vegetarian can make it challenging to find filling and delicious mexican food that isn't drowning in sour cream and guacamole. However at Tacolicious there are a number of options for vegetarians that actually have flavor and can fill me up. They switch up the combination/flavors of the vegetarian tacos seasonally and they are always out of this world.\n\nThe Queso with their warm chips is sinfully delicious...because it is liquid gold, and that is always one of the first things to get devoured when I go with groups.\n\nLet's not forget to mention the drinks...the Nopal pitcher is a personal staple however you cannot go wrong with anything on the menu. Nothing is from a mix, all of the cocktails are fresh because they use fresh fruits and amazing combinations (so no hangovers!) I literally watched them cut over 50 blood oranges for their fresca once!\n\nIt is hard to put into words what makes this Tacolicious in particular stand out against it's peers in the mission and marina, but I think it can be attributed to the service. The servers always makes sure to personalize each group's experience and continually check in to make sure everyone in your party is well taken care of/having a great time. \n\nThere is so much more to say about this wonderful place that a review can't do it justice, but after writing this I'm officially hungry and heading there for dinner again tonight!", "author": "Alison G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-18", "description": "Horrible service.  Asked for a 10 person table, the hostess said they had a party of 15 also waiting and whoever got there first would get the table.  They ended up seating 4 of us at a small table assuming the table next to us was going to finish soon (they had full drinks and had not even paid yet).  We awkwardly kept squeezing people around the 4 person table until the table next to us left making them and us extremely uncomfortable.  We asked if we could move to the 15 person table since it was still open, they said no even though our full party was clearly there before the other one.\n\nOrdered queso and guac and only had 1 basket of chips that was constantly empty.  Slow bar service when ordered several pitchers margaritas. \n\nGreat food. Terrible service and clearly understaffed.", "author": "Nicole J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "This is my favorite little restaurant chain in the city.  You can't beat the raw tuna tostadas and the braised beef short rib tacos!", "author": "Kevin P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "You have to try the Albacore Tuna Tostada, they are AMAZING!!!  Always a great place never disappoints", "author": "Shannon W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "Tried this place for the first time on Saturday... Yum! Asked for no cilantro on my tacos,  but forgot to ask them to leave it out of the guac... but when the guac came, no cilantro! The waitress had them make everything without it since I'd mentioned I didn't like it. Considering that half the time places forget to modify orders even when you remind them, this really won me over. I'll be coming back.", "author": "Mary M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "I've lived here just under 2 months and this is my first official favorite spot. Lee ( I hope I don't forget these names ) greets you so kind and consistently she's not over the top but super nice . Great first face for any company . Patrick the bar tender went above and beyond ! Great drinks great suggestions full of information ( about the food , location etc) I'd go back just to see him and then the food itself ... Has been so awesome . I've managed , bar tended , served over ten years combined and great service and dining experiences are rare . I have had two in a row at this location. Go!", "author": "Lauren S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-20", "description": "Liked the spicy dip. Limited vegetarian choices. And the veggie tacos pretty much sucked.", "author": "Sagar J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-12", "description": "In town on vacation and met a friend here for dinner. Cute little spot,  love the atmosphere. Tacos were delish, braised chicken were my favorite. Sangria was great too. Staff was friendly and attentive.", "author": "Leticia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-25", "description": "I've walked past this place several times and finally decided to give it a try. After waiting about 20 minutes, we were seated inside. The overall vibe of this place is very fun, loud and it's a great place to go with a small group of people, have some drinks and eat some tacos. \n\nUnfortunately, the service was not great, and the food was average. \n\nThe fish taco (Baja style) was good but needed a bit of a kick. None of the hot sauces was particularly good, and the short rib tacos were oily and a bit greasy. \n\nThe tuna tartare tostada was the bright point of the lunch.", "author": "Adam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-29", "description": "Came here to have a few drinks while we were waiting on a pizza next door! Good drinks, awesome bartender..will definitely be back when we come this way again! Oh & you Can't complain about the complimentary chips & salsa ;)", "author": "Stephanie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-27", "description": "Gluten free and delicious! This place was great and everything was very flavorful! Please note I do not ask if everything I order is gluten free I use my best judgement and hope I don't get sick (also I have severe gluten allergies not Celiac disease) and I will know within 20mins if I have consumed gluten and I will be severely ill for the next 48-72 hours. I had a chicken taco, veggie taco, chips, salsa, Guacamole and Sangria and I loved everything!", "author": "Onna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "Meh, Average at best. Pistos is 100 times better in every aspect", "author": "Paolo C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-08", "description": "Given my recurring bad experience at the North Beach T-Lish, I was hesitant to give it another try, but my friend had a Gilt city brunch deal only valid at this location so I figured one last chance couldn't hurt. I can now confidently say I will not be back to this location. This time, we found a sticker in our guacamole, my breakfast burrito arrived cold (I sent it back and waited 15+ mins for a new one even though the restaurant was empty),  and our bill was totally messed up at the end. On a positive note, I will say the service seemed mildly improved from my last visit, but we were one of only three other tables there, and frankly, the bar for improvement was pretty low. Tacolicious is still one of my favorites restaurants - just not this location!!", "author": "Mindy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "This location is more wide open then the others, which made it seem a little different. The food is still fantastic.  Didn't care that all the tables are high tables with seats that have no backs. However, compared to the other Tacolicious restaurants, it was easier to get a seat/table here. So that is a good reason in of itself to visit this one.", "author": "Dilly M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "The manager lied to us and said there was a huge dinner party coming in so we had to sit in the back. Made us feel completely awkward and unwelcomed. Even stopped us as we walked in saying \"whoa whoa is there something I can help you with?!\" No party ever came. The place was EMPTY on a Friday night and continued to stay that way. Thanks for lying to us. Even when we told our server, he did not even have the balls to apologize. He did give us a discount, which we appreciated, but a real man and a true manager would have come up to the table and apologized for being rude and flat out lying. For this reason, we won't be back to this location.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "Great chips and salsa, margaritas, and braised beef tacos.  Pretty good for the money too... if you get the margarita pitcher!", "author": "Maurice T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-01", "description": "By far the worst experience eating ever. Disappointed that I even gave this place a chance given the fact that North Beach houses such culinary gems. From the second we walked in, we were not serviced properly. The place was empty and yet we still had to call attention of the waiters to seat us. After which, we waited forever for the menus to be delivered to us. When we finally got our menus, they ignored us and did not even offer water. Nevertheless, hunger propelled us further into the dining experience. After ordering our meals, we were highly disappointed by the quality of the food. The tacos were drenched in grease, the sangria was worse, and we were all wondering why it was that we were spending $5.00 per taco. We couldn't even finish the six tacos, so I mentioned to the bus boy that we were honestly disappointed and whether we could do something about it. He proceeded to tell me that I could take the tacos I was complaining about home. After I asked repeatedly to speak to someone, he went ahead and decided to speak about me to his coworker in Spanish, obviously unaware that I could understand him ( including the moment he called me a bitch). Finally, I was able to speak to a waiter and settle on taking the uneaten tacos off our bill. Worst eating experience in North Beach, will not be returning.", "author": "Julienne R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Went with some family members, the adults shared the taco platter(4 veggies, 3 fish 3 short ribs) refried beans, rice, guacamole and 2 pitchers of margaritas (watermelon ones).Carnis liked the fish tacos the most.  All the food was very tasty.  I liked the veggie tacos quite a bit.  They had a kids menu, which was great, but the one issue was (and the reason this isn't 5 stars) is that tween we were with found the kids chicken taco to be very spicy.", "author": "Sheetal P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-15", "description": "Wow! Mexican pizza on happy hour menu paired with an agave-lime margarita, yikes! Homie bartender did a great job. Chips and salsa were great too. HD TV, clean bar.", "author": "Brandon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "Had a bad experience completely turned around by Alfonso this afternoon. \n\nI came in right after they had sat a huge rowdy party in the dining room so I sat outside by myself and ordered a salad and some tacos. The tacos came within 2 minutes, some crazy fast tacos let me tell you. Of course they were good too, they always are. Anyway I finish my tacos and they get bussed and I sit around a while waiting for my server. It's like 2 in the afternoon and I've got nowhere to be so this is fine. Next time I see him, I let him know that I never got my salad and I felt like it was too late for it now. I asked him to make sure it wasn't on my bill. \n\nHe comes back a few minutes later and apologized that I never got my salad, and even took care of my tacos for me. What a great guy! I feel like he went above and beyond what was an appropriate response to make sure I left the restaurant happy. Which I did. \n\nI don't leave a lot of reviews, but I think in this case it was the appropriate response.  Thanks again Alfonso, see you soon.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-08", "description": "I'm in love with the carnitas. This location is really nice, and feels more spacious than the Mission and Marina ones. The floor tiles are beautiful, I want some for my house. The service at this location is awesome, and everyone who works here is really attentive. I love coming here after work for dinner. They're open for lunch, too, if you're in the Financial District, it's not that far away. Highly recommended from a Jewish lady who loves her some pork.", "author": "Julia D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "I'm a pretty regular tacolicious go-er in the marina. When I saw the Gilt City deal for brunch at the newly opened Tacolicious- North Beach I was stoked, seemed like a great deal and I expected the same quality as I get at the marina taco. I had a few qualms with the north beach location. \nPro-\n-No wait, we got seated immediately at a table of our choice. \n- a choice of pitcher with the Gilt City deal \n- enough options for brunch though I wish tacos were included in brunch menu. \n- dessert--churros were quality\nCons-\n- the service was slow even though there were only a handful of customers in the restaurant \n- our waitress was nice though a smile wouldn't have killed her. \n- we found a sticker in our guacamole-- I guess that means its fresh? \n- the burrito we ordered was not hot all the way through. They took it back and remade it, came back better. \n- bistec y huevos were good the rice seemed a little old for noon though. \n\nIn all... Perhaps Taco isn't the best brunch spot. I can't say how taco in north beach is the rest of the time, I'd stick to the marina taco if I were you though .", "author": "Megan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "This is my favorite of the 3 locations because it seems to be less crowded and has a great happy hour during the weekdays.  Everything is delicious so just get what jumps out at you!", "author": "e w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Have never been to the tacolicious in north beach but was thrilled when I found out it was there. Have had great experiences at the mission and marina locations so I suggested it to my group of friends. The hostess seemed a little ditsy but she got us seated on a Friday night in less than 20 minutes. I already knew what I wanted but some of my friends have never been there before. Our server \"MK\" was great. She had great recommendations and kept our drinks full (not to mention she's very easy on the eye.) I've now been to all 3 locations in San Francisco and look forward to trying the one in Palo Alto!", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "Came with my boss and coworker and we sat outside and it was lovely. I got the cod tacos. Loved the spiciest yellow salsa as well as the medium one. The service was great and personable.", "author": "Alexandra W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "The tomato salad is super yum. The option to order a giant variety taco platter is super awesome.  I like that they have a full bar. Lots of taco spots don't.  I almost like them better than Don Pisto's,  However, and to be fair, they both have slightly different menu options and prepare their menu options a  bit differently and that are equally mouth watering.   Thanks for opening up a spot in North Beach!", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "It was my first time at Tacolicious and I had 4 different types of tacos: The beef, the chicken, the fish, and the carnitas. They were all delicious and especially like the fish. All the food was very fresh and the presentation was good. The tacos are all served with 3 different types of sauces and all of those were tasty. If you like super spicy go for the yellow sauce. \n\nTravis along with one of the young ladies took care of me and we both excellent. They were both very attentive and also gave some good recommendations about what to get because I couldn't decide at first. The margarita was also great a really complimented the food. \n\nThe atmosphere was also good and I could see it being a great place to go to hang out with a group of friends. \n\nI had a great experience there and will be going back.", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "Amazing margaritas, tasty tacos, and perfect chips and salsa... Is there anything more you need to know?! Go here eat tacos and be happy!", "author": "Kiley T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Love the new location - food/service is the same as in the Marina (and i'm sure the Mission location as well). Very spacious and the decor is awesome. Well done!", "author": "Alison M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-12", "description": "We went on a Monday- third time we tried to get in but it's so busy that we never got seated prior to this. The gal helping us was sweet and attentive. I was blown away by the tequila menu: a double sided sheet over a foot long. Ended up getting a pitcher for $32 of a drink - it was really just a carafe but that didn't change that it was good. The tortilla \"snack\" was the best thing we had on the menu. Everything else was good but standard. The rock cod was probably my least favorite. I agree with Johanna L. that 2 people can split 4 tacos. I will be back however, to try more of the snack menu along with those delicious sounding shots.", "author": "B S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-17", "description": "I love Mexican coming from LA and these were up to par with anything that I have had! Love this place", "author": "Aanand P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "My girlfriend and I went to Tacolicious for brunch not knowing if the food was good or not, but I have heard a lot of Tacolicious before from others, so I thought we'd check the place out. Best decision! We both had an order of the Lone Star Tacos and they were fantastic! It was like a breakfast burrito in a flour taco. The tortilla seemed homemade, not exactly sure, but it was great. The peppers added with the egg, melted Oaxaca Cheese, and other ingredients really pumped up the flavor. We also shared a Margarita with coconut water and that was also good. The chips are quite basic, as well as the salsa, but overall, not bad at all. I'm not too sure how the other restaurants are like, but because this one is in a fairly busy touristy area, the place can be a bit crowded, but not overwhelming. We sat at the bar and watched the Giants game, so I cannot complain at all. The food is a bit pricey, so be sure to expect a somewhat high bill (4 Tacos for $17). The service was pretty good. I believe the bartenders name was Ashley. I overheard someone call her Ash, so I'm assuming her name is Ashley. She was really nice with a smile on her face. I'll definitely recommend others to this place and I'll be going back for sure, perhaps with a larger group.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-10", "description": "Great tacos, I usually go to the ferry building on Thursdays to get them. Try the chorizo and potato or whatever the daily special is! I also love the agua frescas!", "author": "Amber M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "Having been to the Marina and Palo Alto Tacolicious restaurants, I had relatively high expectations for this one and they were certainly met.  The good news is that this one is 4 blocks from where I live.  The food at Tacolicious is always consistent and always very good.  They tend to keep it simple and only change the menu seasonally, which I like.  When I think of high end Mexican food and a good time, I think of Tacolicious.  I've been with anywhere from 2-8 people and we are always accommodated and get what we expect (sometimes that means waiting, but they are accurate).  I'm not sure if it's a good thing or a bad thing, but it always ends up not being cheap - mostly because of the drinks that you are compelled to order given the fun environment.", "author": "Alex O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-15", "description": "The drinks were amazing. The food, incredibly bland. If it hasn't been so expensive I would have let it all slide. I can get amazing tacos for $1.25. Here they are $4.00. Here they uses special tortillas and beans but that doesn't justify anything. It's just a tourist upscale taqueria.", "author": "Jonathan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "Three words: yummy red sangria!  I sampled all the tacos but my favorite was the carnitas.  I would give another star if the beans were better.  Compared to the flavor of the tacos, they seemed a little bland.  But the carnitas and sangria are enough to get me back in the door!", "author": "R. B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-15", "description": "SO LOUD!!!! I love the food/drink here, but it's impossible to carry on a conversation without losing your voice. They really need to fix the acoustics at this location.", "author": "Sarah J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-20", "description": "Just as good as the Marina location but this one is larger. There is some outdoor seating, but it's pretty minimal", "author": "Ami D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Tacos are solid. Drinks are great. Nice addition to North Beach. Pretty loud.", "author": "Stacy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "Visited on a Tuesday for the first time and they have a Taco Tuesdays special of 6 shells plus the fixings to make your own taco for $12. Add the awesome rice and drunken beans for just $5 more. And lastly don't forget you get two discounted margaritas for $5 each and you have one awesome meal that is plenty for two for $30. Everything was great. We will be back!", "author": "Mark P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "We got seated hella fast, which is great compared to some of the places around this area.  They fed us high quality chips & salsa while we waited for our food, & weren't all weird and cheap about it either which is refreshing.  I'd like them to have fresh squeezed orange juice please.  I liked the waitress's jeans but they could've used another server.  Anyway the food was pretty average, they really beaned up mybreakfast burrito.  So overall ok place if other options packed but not really worth traveling across town for.", "author": "Shoaib M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Dank! This place reminds me of Bar Taco in Hartford, CT. Came with two friends and followed Yelp's advice, getting the tuna tostada (something like that) appetizer- imagine sushi crossed with mexican food- it was incredible. Also had the pear margarita. Yum! Can't wait to go back :)", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-05", "description": "Perfect place to come for a quick dinner and drinks. The tacos are super filling and the salsa is to die for. Brunch is great too, especially the huevos rancheros. My only issue is the cocktails on the menu are super inconsistent and each time I order the same cocktail, it's much different than the previous time I ordered it.", "author": "Ali A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-28", "description": "Perfectly met expectations. Braised beef had fantastic flavors and the margarita was delicious. Giving only 3 stars because while the meal was perfectly tasty, nothing necessarily exceeded our expectations. Simply put, no flavor explosion occurred.", "author": "Mel W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Very good... The short rib tacos are really good.  Guacamole was definitely Worth getting", "author": "Amanda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "At a taco joint goes this place is pretty good - creative tacos (would have preferred more veggie options). The chips and salsa were fantastic - there was some Indian type spice in the salsa - cant pin point what it is - but tasty. Wasn't in the mood to drink liquor so I had a Silas - lemon, lime, mint, fizzy water - hit the spot.    Side note - good music - would be a good bar to visit and get food. Would have been a five if they had a wider menu with a few more taco options. Service  was friendly and  prompt.", "author": "Paras P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-21", "description": "steak in our shrimp salad, which was over dressed. slow service. queso was poorly prepared velveeta (i.e. not restaurant queso).", "author": "Shane B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-23", "description": "The carnitas tacos were great! The margaritas were delicious and the service was quick! Couldn't ask for more.", "author": "Ashley J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "If you're looking for margaritas and Mexican food in the city, this is the place to go. The salsa is unreal, the food is delicious and the margaritas are strong. Really can't ask for anything more! Our favorite tacos are braised beef short rib and the carnitas. This also is my favorite location of the 3 in San Francisco, feels like the largest so usually not too long of a wait. TLish never disappoints.", "author": "Bailey B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "Incredible Kale salad, amazing tacos, cool vibe - we loved it! The cod and the carnitas tacos took the top honors. I highly suggest checking it out!", "author": "Barry N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-11", "description": "Our table was not greeted for about ten minutes & the appetizer came after our entrees. The food was okay, but not nearly good enough to outweigh the bad experience.", "author": "Elaine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "Yum! I will be returning! The tacos are wonderful and the margaritas are good!", "author": "Bridget O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "Now hear me when I say this.. This place is seriously one of  the best taco places I've ever Been to. They also have ridiculous good queso and chips.. You must seriously try this place. Get several different tacos. My choices were the chicken and carnitas and the vegetarian. Outstanding. Well done tacolicious.. Well done.", "author": "Jed T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-10", "description": "I'm actually appalled by my experience here tonight. I walked in with a friend and we both stood there for a good 5 minutes before anyone even thought about saying anything to us. Actually, my friend had to walk up to someone to get any service. Then the hostess seats us at the bar and as we go to sit a group of drunk girls run up and say things like \"oh! Are you pulling my seat out for me?! I'm sitting there.\" So I say \"sorry, this is just wear the hostess sat us. See the menus?\" So I have to ask a group of guys if they would move over from where they were standing so we could sit and have dinner. Then a waiter drops chips and salsa directing in front of us. Awesome! Some food! As I dip my chip into the salsa one of the guys yells \"no no no don't do that!\" So I stop and turn looking confused. He says \"that's ours! Did you order chips and salsa?\" And I said \"no...\" But don't they typically come before the meal? So they actually grabbed the plates from us. My friend and I were shocked. We tell the hostess what's happened and we didn't even get an apology. What I got was a couple cold tacos. Get it together! I work in the service industry and what I experienced tonight is just ridiculous.", "author": "Chloe H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Chicken tacos  were just okay, Aztecs soups was really good", "author": "Lu G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "We always have an amazing experience here thanks to Cameron and Dino! They are so attentive and so much fun! The micheladas and camarones al diablo are to die for! Totally going back!", "author": "Tiffany C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-27", "description": "Great location but they recently raised their prices and now the prices don't match quality. Overpriced average Mexican food.", "author": "T. B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Great food even better margaritas , I usually end up enjoying the veggie taco  the most. Would recommend.", "author": "Ted J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-10", "description": "I am not a frequent reviewer but I felt compelled to write this. We have gone to tacolicious in North Beach twice, the second time leaving before we even ordered and the first regretting our decision to stay. Unlike the friendly (and kid-friendly) experience on Chestnut) the north beach restaurant is unpleasantly loud, holds a happy hour which doesn't include wine (??), and employs staff which are rude (we had to ask one of the wait people to stop swearing in front of our ten year old(f-bombs rained !!). Why we went back a second time you ask ? We'd gone to Chestnut a few months back and had such a great experience, that we chalked our first one up as bad luck. Not the case. We will never go back. Fortunately, Cafe Divine is right across the street, and welcomed us happily, wine included :)", "author": "anita w."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "The braised beef short rib tacos are amazing every time, without fail! It's a fun atmosphere and a good place to come with friends. I just wish the drinks were stronger. At first I thought it might be the bartender, but it happens everytime and I'm assuming it's not the same guy working every night. For $10 a drink, it would be nice to feel slightly buzzed.  Also, I promise I'm not an alcoholic, just a broke college student.", "author": "Caroline D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-29", "description": "We tried tacolicious because previous reviews were so good.  But we were disappointed.  The food was fair and a bit pricey for what you received.  We tried several different tacos, but none very exciting.  Nice location.", "author": "Patti A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Pleasant experience.  After spotting a patio spot from afar during the dinner hour, my bf, dog and I dashed for some tacos.  The food (4 tacos for $14 and queso dip) were yummy with a unique flavor and the margaritas were solid.  The waitstaff earns pints for brining my pup a bowl of short rib.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "Total meh experience... Wanted to go with 2 stars, but opted to give the benefit of the doubt given that we came in an hour before close on a Friday night. I was disappointed from the start BC they were out of the ceviche & the tuna tostadas- two of the items that enticed me in previous Yelp photos. The chip were stale, the refried beans tasted like they came straight from a can, and the tortilla soup could have used more salt or spice. The tacos, the Micheladas, and the ambience were the higher points.", "author": "Mary C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "What can I say? Tacolicious is the best! The atmosphere is fun and the staff is fun. Everytime I go I feel at home right away with friendly service. JP always makes sure to go above and beyond!!! Can't wait to go back this weekend!!", "author": "Jill E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-24", "description": "Food is good, but service is so not. None of the servers or staffs are kind or friendly, they seem all a little awkward, even. Tacos are okay, portions not so small, so so sangria. Can't recommend it.", "author": "Esther L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "First of all I would like to say that the food is delicious and very consistent.  This review is specific to this location.  If I was rating the food alone I would give this place 4 maybe 5 stars.  If I am sitting down and have time to enjoy a casual meal also 4-5 stars.  On two occasions I have sat at the bar while I ordered food to go and on both occasions the bartender has blown it.  Same guy, shorter hair and tattoos.  Both times I saw our order sitting on the counter for 15+min while he looked at it multiple times and just moved on.  He even moved it cause it was in the way still couldnt make the connection....come on bro figure it out its not that hard.  Only when we asked about our food did he finally realize it was the right one.  I would still recommend this place for causal night out where you're not worried about service and just want good tacos.", "author": "Rick J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "White boy frat party with about a 10:1 male:female ratio, super noisy and annoying people and prices were extremely high for just meh food.", "author": "Andy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "Super excited when I heard that Tacolicious is now in North Beach!!  Went there today for lunch and had the Fresca Margarita....super refreshing and seriously never tasted anything like it before.  Had the Ahi tuna tostada which will be one of my new favorites there.   Ryan who is the GM there is very cool", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Extremely loud on Fri nights but otherwise the yummiest tacos in town. Definitely worth checking out. P.S. Beet salads might be on the verge of passé but still worth ordering here!", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "Great food, great location and atmosphere. The service was terrible though! We only saw our waitress once. However, I would give it another chance", "author": "Emily K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-16", "description": "Delicious food but super disappointed in the customer service and portions. Ordered for my coworkers today, and considering the $450 price tag, there was not enough rice, beans, or salad for everyone despite ordering enough for all 15. When I called to inquire about my order, thinking perhaps there was an error, not only was I hung up on the first time around, but I finally got a hold of someone, left my number to talk to a superior, and never heard back from a soul. Definitely not the spot for a big group lunch to go.", "author": "E G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-13", "description": "What is the big deal? Went there on a recommendation from a coworker.  What is this Shi shi foo foo tacos? Small portions, high prices, tacos mediocre at best. Beat salad barely enough to feed a hobbit, $9. Come on.  Far better tacos in most any taqueria.", "author": "david b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-12", "description": "Visited Tacolicious North Beach while walking from the ferry to downtown.  I have been a fan of these outlets from the beginning. This one does not disappoint.  The service was excellent although admittedly I arrived at 1:45 p.m. so after the lunch crowd.  I sat at one of the side tables in the main dinning room and could watch the Giant game while eating lunch. The music was a little frenetic but not so loud that it distracted.  The decor is upscale, roomy, clean and excellent.  The waiters were very attentive and the service was outstanding.  I ordered the old standby, two carnitas tacos for $3.95 each.  They were terrific.  The meat was seasoned perfectly and seemed of high quality. The tortillas were soft, two for each taco. This gives you a little bonus as you can peel the second tortilla away and turn two tacos into four, given the amount of carnitas filling in each of the two.  The tacos are served with three mouth watering salsas -- including the basic for the day which was a tomatillo/tomato/mint salsa.  In the three were also an mild avocado salsa and a yellow/habinero salsa that would sizzle the toughest palate.  The tacos are served with piquante pickled vegetable slices that you can add to the mix.  \n\nI asked the waiter if they did crispy tacos and he said \"no.\"  I know that at the Marina restaurant they sometimes do crispy tacos as a special one day a week, maybe Tuesdays. That option -- well executed --would vault Tacolicious to five stars in my opinion. \n\nOther features that make Tacolicious so good are such details as providing you with really thick white napkins, as many as you want, given the tacos are juicy.  They provide you with a small dish of special salt to sprinkle on your food as needed. This place is well worth visiting.", "author": "Bill L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-16", "description": "Got take out from here this afternoon and ordered the carnitas and braised short rib tacos.  Opened it up back at my apartment and realized they gave me some chicken tacos instead.  They were also kind of dry and none of the standard sauces on the side were included.  .......... my sunday is ruined.", "author": "Walter M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-16", "description": "Drove up from San Jose to visit Tacolicious after watching a segment on the Food Network. We tried the Albacore tuna tostadas which were good but nothing like the portrayed on TV. They didn't make my knees buckle but they were yummy. A little pricey for what you get but not bad. The disappointing part was that they were out of the shrimp tacos which was the featured taco of the day. It was only 4:00 in the afternoon so either these are that good or it was bad planning to run out so early. We then wanted to try the chili con queso aka Mikes Cheese Dip. Strike two! They were out of this too which leads me to believe it was just bad planning to run out of two of the most popular items that they are known for. We then tried the braised beef short rib tacos. Not quite strike three but pretty close so let's call it a foul tip. The final strike out was that we waited a long time to get out check. If you live in the city it might be OK to stop in but if you plan to take a drive to visit this over hyped place featured on the FN skip it. I, along with my girlfriend, were disappointed.", "author": "Ron B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-12", "description": "Yay! Another Mexican place in North Beach!! Tacolicious has the BEST sangria I have ever had, their salsa is amazing and they are super attentive even though its jam packed w/ customers. Sooo happy to have another option in the neighborhood!", "author": "Catherine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-07", "description": "Well, I can't review the food as I never got a chance to taste. I had been told how great the food was so I decided to grab a bite before work. I was greeted by a very pleasant host who told me that I should place my order at the bar and the order should come up pretty quickly. I went to the bar and stood with my menu in hand  and watched as 2-3 people shimmied behind the bar. After standing for about 3-4 minutes I see the host enter the bar area and I am encouraged because I'm thinking he will surely inform the staff that I was waiting. Nope....the host poured himself half a beer, took a sip and chatted with one of the bartenders. They continued to chat and catch a glimpse of the football game. The bartender never looked up or even seemed to be aware that I was even in his periphery. Just as the host took a sip and looked up at me, I let my menu slip from my hand, land on the bar and proceeded to exit. I might visit another location but most likely not here although it is convenient to my job.  In any case, not a good first impression", "author": "Renee L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "great mexcian  food .", "author": "K G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-07", "description": "Awesome ! great ambiance , the beer chicken and steak  taco were amazing ....had a Don Pilar Anejo Margarita - Delicious ! Going back often !", "author": "tony r."}
