{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "This place is honest good and ready to serve. I am new to San Francisco so I follow yelp a lot. The places that stayed that would be open were close. Which was great since I tried Tacos club.\nAmazing customer service\nGood Food\nOn time", "author": "Hector D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-06", "description": "I think I've come to grips with paying $3 for Mexican street tacos.  I guess this is what I get for living in the Bay.  \n\nBut for $7 you wish the fish was actually crispy and the sauce to be decently flavorful.  Rather, the sauce was runny, they skimp on the cabbage and the tortillas were soggy.  \n\nThe al pastor had good flavor but part of the draw for this meat needs to be the char and there was none whatsoever.  The texture contrast was absent and it's not a good sign if I can make a better al pastor.  Also, no pineapple?  \n\nThe carnitas was the best one but again, if you don't have any part of it be even remotely crispy then carnitas will never really be carnitas.  \n\nAlso, no salsa bar and radishes and pickled vegetables?  This is a taco club I never want to get into again.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "Okay. Good food, but it's not the best and it is slightly overpriced. Perhaps it's doomed by it's prime location and appeals more to bar drinkers. \n\nI would walk to the mission for tastier and authentic food if time permits.", "author": "Janno L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-30", "description": "Honestly - I think I've only ever been to this place after midnight.\n\nIt hits the spot when it's time to go home and I am about to get into a Lyft or make the trek over to bart.\n\nI always go for the chicken burrito and it never really disappoints.\n\nShould I check out this place before a night of drinking?\nProbably.\nBut will I?\nProbably not.", "author": "Stephen P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-29", "description": "first time ordering delivery from them. disappointed with beans and packaging. They mixed the rice with beans in same container. Also, beans appeared and tasted canned. was looking for traditional refried pinto beans homemade. Didn't get the extra side salsa I asked for. otherwise, the Flautas & carnitas taco were good.", "author": "Amber S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-16", "description": "At 1 am on a Friday night after drinking in the area, this food will hit the spot. It's not very pricey and feels like nothing more really than fast casual Mexican. The tacos were good but nothing I'll likely repeat. The carnitas was easy better than the carne asada, which was extremely dry. Chips and salsa was necessary of course, but nothing more than some dried out chips and pico. Again, for late night drunk food, it's a solid option for sure.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Wonderful! Happened upon it while waiting for music to begin at Swedish American Hall. Carnitas nachos were so good! Liked it so much we came back the next night. Decent price too.", "author": "K D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-26", "description": "My first $2 Tuesday  tacos! It wasn't as crazy  and crowded as I first thought; well then again, I went after Christmas and crowd might not have been that crazy.  Inside all the tables were full. I was all turkey  out over Christmas and so I didn't want to go home to eat more turkey and felt tacos was a better alternative than more turkey!! Anyway I tried the 3 Al Pastor pork Adobo, one Carne Asada grilled steak and Nopales con Queso. I prefer the meat ones instead of the veggie one. Next time I will try one of each next time.  \n\nGood portion size and service was pretty quick. You get your own utensils , water pitcher with slice of orange and napkins by the cashier on the shelf by the wall and tables.", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "We had an excellent dinner here. It was a warm night so we sat outside and enjoyed our cactus burrito and mole chicken. The mole was amazing and the burrito was also great. The service was quick and the people working there were very nice.", "author": "Katya F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-10", "description": "I'm sorry, wanted to love this neighborhood spot but honestly some of the worst tacos I've encountered in a long time - especially when so much great Mexican food is just a couple blocks away. Carnitas were so greasy. Carne asada was very salty. Bread for the torta was pulled out of the freezer and tasted like it'd been there for a while. And al pastor just tasted as if it had raw cumin thrown on top - super odd. We unfortunately won't be back.", "author": "Shannon H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-13", "description": "It was my first time at this place and got bad experienced. Worse burrito I've ever had. Supposed to have more stuff for super burrito, no tomatoes salsa, no cilantro, no onions, no chips and was waited for a long time even it was only two orders ahead of me. Won't go there ever again", "author": "Voralak K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-14", "description": "This was a decent place for a taco.  It's a tiny little place with only a few tables, but I went during a time that it wasn't busy.  The tacos were good, but not great.  I was expecting more flavor and authenticity.  Even so, it hit the spot.", "author": "Nicholas F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "This was the only taco place we could find open and walkable after we went out to Blackbird. 4 stars for being open at 1:30 am and man, did this place hit the spot.\n\nNachos had a generous amount of toppings and (dare I say) too much cheese? Burritos were on the smaller side but tasty in that way that only burritos can be when you've been drinking past midnight. They kept bringing my friend the wrong burrito and taking it away, which was confusing.\n\nLet's face it, none of us would come here sober or during the light of day. I would probably come back late night if I'm ever in the area and too lazy to trek to Mission though.", "author": "Stephanie K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-02", "description": "Tacos Tuesday - not enough room for everyone that wanted to have tacos. \n\nSangria's decent. Tacos were good. Burrito was good too. Not the best, but not the worst either.", "author": "Nina Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-14", "description": "My husband and I stopped here to eat today and first of all Antonio took our order and he's the sweetest guy, great customer service, he took great care of us, and then when we got the food, omg it was delicious, absolutely delicious ! Best guacamole ever! Their pastor is so good! My husband got nachos and the chips were just made, we are definitely come back to eat here again when we come visit, great customer service and delicious Mexican food ! The salsas were so good too!", "author": "Ana A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "They charge for cheese and sour cream on your burrito. 50 cents each. The burritos are all over $9\n\nAlso nachos are $9 without meat", "author": "John S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-30", "description": "Shame, I wanted to like this place so much. It's in such a great location and has nice decor. I ordered a vegetarian burrito and I was looking forward to it after a long bus ride home. I took a big bite and all I got was a mouth full of shredded pork -- literally my nightmare as a vegetarian. \n\nI understand there were only two guys there and the cashier was nice to bring my order out to me, but I will not be coming back. Such a waste, as it was twice as much as how much a burrito should cost.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "Street tacos here are delicious! I wish I got the name of the kind man who helped us at the counter. This is a tiny quick service restaurant with a few small tables inside and a few more outside. We got our food to-go but outside seating offers a great spot to people watch and enjoy the Castro. I'd come here for delicious street tacos (they also have other things- quesadillas, enchiladas, etc). Definitely try the pollo and carne asada!", "author": "Nikki R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-28", "description": "Update: I can no longer endorse the fish taco. As a San Diego native, tonight's taco was truly pathetic. Soggy fish, soggy cabbage, nonexistent white sauce. For the $6 price tag, absolutely not worth it. \n\nOn a bright note, the 2 dollar taco Tuesday deal is great. Carne asada was on point. Red sauce was nice and spicy.", "author": "William V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "Always fesh and well prepared. SF Mission has the history, this spot on Market St.rules. The owner is always welcoming and passionate about his purpose - to serve you the best. Fine sangria too!", "author": "Judah D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-18", "description": "First and last time in this place . $14.25 for a super burrito de carne asada . I was expecting amazingness after this price but I got the complete opposite. \n\nNot only did they get my order wrong the product in general was awful. Hardly any meat , and way to much sour cream . The burrito completely fell apart after a couple of bites due to the overload of sour cream. No bueno para nada!", "author": "Jocelyn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Expensive and salty.\nThe first time I went there I ordered a burrito. They charge extra for cheese and sour cream. The tortilla wasn't heated enough so it tasted like flour. Overall it just wasn't that good and over $12.00.\nThe second (and last) time I went there I had guac and chips. It tasted like onions and salt and apparently it had avocados in it because it was green.", "author": "Jonathan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Needed something real quick. Used the restroom, which was clean. Establishment was empty. Taco  prices a bit much but needed to hurry. Ordered two tacos asada and chicken. \n\nCooked on grill. Asada was  marinated and juicy. Chicken also. I will return. Salsa was bland but sometimes the salsa makes the food which is why I rated a 4", "author": "Paris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Pretty good - liked the papas and chorizo taco (5/5)\nAl pastor - pretty good also (4/5)\n\nNot much else to say because I didn't eat all that much - taco tuesday is each taco is $2\n\nSeating is extremely limited, so I wouldn't recommend meeting a large group here.\n\nGood enough to come back and try again, and will do so to try more of their expansive menu.", "author": "Alexander W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-04", "description": "Delicious Mexican food in a cozy spot. I had the carne asada burrito but it was tough to decide. Everything looks and smells great!\nThe staff was friendly and attentive. \nThe place is tiny inside, so maybe go during off-peak hours. There is some outdoor seating, but it's a little too cool in the winter for me to sit comfortably. \nI'll be back for tacos next!", "author": "M G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "Really sad because this place used to be great. New owners are clueless. \nRidiculously over priced and tiny tiny burritos. They got the order wrong and just laughed when we let them know.  Never ever going to waste my money there and I'm going to make sure as many people know how awful it was as posible. \nSo many better places to get burritos and tacos in the Castro.  I highly recommend La Tortilla on Castro and Zapata Mexican Grill on 18th.", "author": "Antonio D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Stumbled across this place after visiting the Twin Towers scenic spot.  We looked on the map & saw the Castro Theatre.  Drove around, to see what this area was.   Happened to park right in front of this place, not intending of having tacos but we walked up & it was \"Taco Tuesday\".  Tacos were $2 & beers $3!   DELICIOUS!!    The steak was moist as well as the carnitas taco.", "author": "Ihan R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-21", "description": "I LOVE TACOS. If there were an actual taco club that I could join, I would be the Treasurer or the Secretary or some higher-up in the organization, but not the President or the VP, too much responsibility and you'd probably have to show up on time and do a lot of delegating. I think I'd feel more comfortable allocating the funds for tacos and libations, and showing up 20 minutes or so late to each meeting.\n\nThe most recent meeting of the just-now-created taco club occurred last night with my platonic bae and only other member of the taco club Hector M at Tacos Club in the Castro. I got a craving for tacos early Tuesday while thinking about what I wanted for lunch, but since I had already promised myself Turtle Tower (since this may be the last week of jury duty and TT won't be as accessible), I asked Hector if he wanted to catch some brews and tacos after quittin' time.\n\nHe found Tacos Club on Yelp, though he's a Mission local and my favorite Salvadoran, he says that \"Taco Tuesday is a white people thing\" so local taquerias may not be accommodating. Oh man, ladies and germs, this place is really DEEELLLISSSHHH. I now want tacos again just thinking about how great of a time we had. Fast service and sweet, cute boys working there, awesome $2 tacos, $3 beers, and $4 sangria that packs a punch. Also who can say no to homemade tortilla chips and perfectly seasoned guac?? We had carnitas, carne asada, and I got one nopales taco. The red and green salsas on the table are super yummy too, we both preferred the red as it was more smokey. Check this spot out, it's now a favorite for me!", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "The service is so amazing and the food is delicious. I enjoy every bite at this place.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-08", "description": "The service here blew - not so personable cashiers who don't give you your proper order but when you're hungry and desperate you deal with what you got", "author": "Allen N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "Carne Asada burrito & tacos are real good!\nChips & salsa & plantains are fresh and delicious!\nService is fast & prompt!  \nLocation and cleanliness are perfect!\nI will def be back and I rec all to go!", "author": "Noor S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Saw the awesome yelp reviews and went ahead to check it out! Love the Castro District in SF and the location of this place is perfect for people watching! Also, it's only a cable car or MUNI ride away from my school, so it was easy to find. The tacos are pretty filling, so are the sides that come with it. Staff is nice and the place was pretty clean. The only con is the price, but that's most places in SF tbh. And, taco Tuesdays are a thing!!! So check it out!", "author": "Deepshika V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Actually Jamie W. and I didn't mean to come here. Yes, I realize that's not an impressive way to start a review, but I have to be honest and tell you our original intention was to try Tacorgamisco across the street. The problem was that it was packed with hipsters on their smartphones, and we just had little tolerance for the surly indifference we were sure was wafting through the newly popular spot. Meanwhile, there's this space-challenged taqueria right next to Super Duper Burgers where the comparatively less fashionable apparently patronize. We were fine with that and also with the robust-enough menu that offered burritos, tacos, enchiladas, botanas (appetizers) and platos grandes (photo: http://bit.ly/1evOaZw).\n\nBoth of us bypassed the more standard items and went for what we thought might be their specialties. Jamie went for the $9.25 Al Pastor Torta in which they stuffed their spicy pork meat into an Acme soft roll with tomato, onion, crema, lettuce, queso cheese and refried pinto beans. Sounded like a tasty sandwich, but it didn't elevate above its ingredients into anything that was too memorable. Although the house-made corn chips were a nice touch, there was a nagging blandness to the whole plate, and fresh salsa was the only salvation (photo: http://bit.ly/1SaLsLn). Mine was the more ambitious $12.50 Carnitas Plato Grande where the abundant portion of slow-cooked pork tasted slightly burnt like it was left on the grill a bit too long.\n\nThere were plenty of distractions on the plate though with quite a bit of rice, black beans, salsa fresca, a grilled jalapeno and three flour tortillas (photo: http://bit.ly/1OxRVtU). However, none of that was enough to offset my initial disappointment with the carnitas since so many other places prepare it so perfectly. The place doesn't take very long to crowd up, but instead of a hipster-centric vibe, it was more of a gentrified dine-and-dash group which we found much more tolerable on a Tuesday evening. Given all the stellar Mexican choices in this city, even in the neighborhood (El Castillito comes to mind), I'm not sure when I'll be back to Tacos Club, but I'd be willing to try it again just to see if it was an off night for them.\n\nFOOD - 3 stars...Mexican dishes that just miss the mark with a missing ingredient or an overlong layover on the grill\nAMBIANCE - 3 stars...pleasant when it's empty but it gets to be a tight squeeze soon enough\nSERVICE - 3 stars...quietly unobtrusive\nTOTAL - 3 stars...not my favorite taqueria but not the most reviled either", "author": "Ed U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "The outdoor seating with the cute lighting and the fun music make this my go to spot for tacos and burritos in San Francisco. Not to mention the agua fresca and orchata. The entire staff is so friendly and there's always really good energy flowing through the store. If you still aren't convinced, grab some friends and go for taco Tuesday and get two dollar tacos and three dollar beers. This will be your go to spot in the Castro. I promise you.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-01", "description": "While I only had the chance to try the Chile Colorado burrito so far, it definitely made the cut.  They did not skimp on the meat, there was a lot of flavor, and they offered nice extras like a spinish tortilla.  I will be coming back to try the other items on the menu, their mole looks especially good.\n\nOther great things about the Taco Shop:\n-friendly staff\n-expansive menu\n-flavored water (serve yourself on the side)\n-indoor and outdoor seating\n-half of their kitchen is upstairs and they use a pull down ladder to get there (uniqueness factor?)\n\nIf you are hungry and in the area or if you're just craving 'dem Tacos, this is a solid place to go to.", "author": "Mike L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "I LOVE this place! Pretty casual burrito place but their food is yummy!\n\nSmall location but easy to street park.\n\n~10 per person. \n\nHighly recommend it. I always get their vegetarian burrito and it's pretty filling.", "author": "Hiral P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-02", "description": "I ordered here looking at the reviews on yelp thinking that this was a descent place. The burrito came out it was one of the smallest burritos I've ever seen for 10 dollars! I might as well go to El Burrito Express and get a baby burrito. Also when I ordered they did not have any steak left, so i ended up ordering chicken. I got my burrito and bit into it, majority of it was tortilla, and uncooked beans and rice.\nTo make things worse I woke up the next morning saying there has been FRAUD on my credit card. I will never return here and I would not recommend anyone else to either.", "author": "Vincent G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-10", "description": "Had a carne asada burrito and it was bland. Not too much taste or substance. Too much guacamole and sour cream. Also, pricey for no chips or pico de galla.", "author": "Geo H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-24", "description": "After several attempts, I can say definitively say the super shrimp burrito tastes like the color beige. The inside bits are often too mushy. The tortilla... over cooked and crunchy.", "author": "Jeff N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Best burrito in the Castro hands down! This spot was also another Mexican fast food joint that was just ok and open late night before but when Tacos Club took over it was turned over for the best! I come here mainly for the Carnitas burrito because wow... it is soo good! Just the right amount of beans and rice without over running the main ingredient. Each bite is as flavorful as the next. Not to mention that their house made salsas (free) are such a good complement to the food. I have had most of their food here and all is really really good. Taco Tuesday is where its at here too, $2 Dollar tacos and Beer. If you are a Mexican food lover please give this place a shot, you will not regret it.", "author": "Troy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "One of my favorite spots for tacos. The carne asada and carnitas tacos are exquisite. Often get tacos to go, but had a really great meal here yesterday.", "author": "Bill J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-27", "description": "I LOVE TACO TUESDAYS HERE! Everyone's so friendly and I usually get up for seconds. I mean, they are only $2 each (less than a MUNI tix!). My favorite tacos have to be tinga and the carne asada.", "author": "Melissa T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-02", "description": "The food is amazing, let me just start by saying that. I am a very picky eater and they totally let me customize my order. They also are very kind. I would 100% recommend this place for anyone who loves authentic Mexican food.", "author": "Zackery R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "First of all I love a place that has an energetic, happy staff that are just nice people to be around. The guys here were funny and kind. \n\nI ordered the Enchiladas Verde, tomatillo based salsa, with chicken. The chicken was juicy and spiced perfectly. The beans and rice were great too, but still no one can compare to Mexican Mom's beans. That being said I did think they could have used a little more flavor.. they fell a little short of what I was hoping for--that real authentic, you can hear the aunts and uncles cackling in the back ground all gathered around the table, authentic taste. \n\nOverall great food, lively bunch of guys, and some fun tunes to boot.", "author": "Martin R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "Granted - when I got my burrito from Tacos Club it was 1:20 AM, and I wasn't at 100% brain capacity... but my carnitas burrito from Tacos Club was absolutely amazing.\n\nThe carnitas burrito was massive, and I opted for the spinach tortilla (to my BF's dismay) which actually made the burrito way better.\n\nMake sure to add guac to your burrito! Also their chips are amazing!", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "Sadly there has been a change of ownership. We went two or three times then gave up. The meat was tough and inedible. The portion sizes much smaller. What a shame as this was a Thursday night staple for my family for years. When we've driven by recently it looks empty. Why tamper with a good thing?", "author": "Chanel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "Though Tacos are relatively inexpensive, but portions are small. My 11 year old end up ordering about 3 to fill him up for lunch (which adds up to be $12 per meal) even tacos came with two corn tortillas.  Everyone shared the full order of Guacamole and Chips. The Mister ordered the carnitas burrito while the boys had the grilled fish tacos, and a bunch of steak tacos. I got the Carnitas taco with a side of rice and fried beans. Simple and delicious. The Mister thought the carnitas was a bit dry, while I thought mine was not bad. I also tried the grilled fish taco which was spot on. The fish was moist and came with the char grilled flavor. \n\nCasual comfortable ambiance. Nice patio seating on a warm day.", "author": "Em T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "Cheap tacos, even if it isn't taco tuesdays. Not the best in SF but pretty darn good. \n\nService is great, outside patio is nice and they allow you to byow. The waiter both nights (we went twice in a week) was friendly, brought out water and answered my \"whats the best\" question. \n\nIf you can grab a spot on the patio, it's great for people watching!\n\nDon't forget to try their hot sauce, it's eye tearingly good!", "author": "Jannies L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "I had the chorizo burrito, which went very well with my Corona. It was delicious. Great value, and fast service on a Saturday night. A solid 4 stars.", "author": "Ernie B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-22", "description": "Late night drunk food!\n\nCome here after clubbing or gaming (Brewcade).\n\nTheir carnitas tacos, quesadilla (huge), and chips/guac are delicioso. Too bad they don't give chips/salsa complimentary.\n\nA few inside tables and some outdoor seating as well. Order at the front and your food will be served to you. There is also an area to serve yourself water.", "author": "Angela D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-12", "description": "Expensive and not great. San Francisco has left me with high standards for tasty, good-priced burritos. This place has neither. My burrito was mostly tortilla. The tortilla was put on the grill, which gave it a weird, overpowering taste. A good burrito lets the fillings do the talking.", "author": "Katherine F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "OMG my favorite taco place. I'm generally not a huge fan of Mexican food. And I haven't had anything here other than Grilled Fish + Grilled Prawns Tacos. But I have to say that they are amazing!!!\n\nNot the cheapest place, but if you wanted something good and quick, not too expensive, not too filling, and are tired of Super Duper a few stores down, this place is perfect.", "author": "JET T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "good nachos, loaded high with toppings! guacamole is worth it. great atmosphere, friendly service. \nfun spot to hang out and people watch.", "author": "Jessica S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Been here threes times. Love the food and the music. Burritos are great, especially the steak.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-10", "description": "Last week you were out of chips, tonight you are out of chicken.  Two hours until closing, what are you going to serve? First rule of food service, have food to serve.", "author": "Jim F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "$2 TACO TUESDAYS. Can't argue with that! Stopped in here on a whim while walking down the Castro, conveniently on a Tuesday, and was drawn in by the delicious smell and other people sitting outside having a delightful time. \n\nThe place itself is very small inside with just the front desk, the kitchen, and a few tables, that's why they have great outdoor seating, plus you get a great view of Market. Everyone working there was friendly and helpful, describing in great detail the size and flavor of the tacos I was about to order, and they brought it out to us in no time! \n\nThe tacos themselves are somewhat small though, and I ate four in order to feel satisfied. Other than that, it was fast, fresh, and flavorful! Will be coming back to try their other things. Keep an eye out for this place, because you might walk right past it, even though your nose won't! :)", "author": "Kyrie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-19", "description": "Worst nachos in the Castro ever. It's all chips. Hardly any toppings and for $10 I would expect more. The flavor of these miserable nachos was far from good. I had to down them in a full bottle of salsa just to get a flavor.", "author": "Timothy P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-03", "description": "I wanted to like this place but was disappointed with the bland flavors. The chips were crispy but had little flavor. The salsas boring and flavorless, too. I won't go back.", "author": "Tony M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Great customer service. You would always see a smile on employees' faces. Food is bit pricey but delicious.", "author": "Ruchika L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-19", "description": "I ordered a grilled fish taco.  It was tasty.  However,  the fish was literally one large bite  \nwhich I believe was a rip off for $6.75.", "author": "Nora S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "This place used to be awesome. Then they doubled their prices, which was fine because the quality increased too. But today I went and got 2 burritos to go. It cost more than $25! I had to request chips which they did not otherwise give me. When I got home I realized there was no salsa and that the burrito was about 90% tortilla, 5% sour cream and salt, and 2% beans, 2% lettuce, 1% salsa. It was inedible. So salty!! And no substance. I called to complain and they just hung up on me. I'm going to Dispute the charge with my credit card company. Do yourself a favor and go to a decent taqueria around the corner.... These guys have lost their way...", "author": "Deb R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-21", "description": "NEVER EVER EAT HERE! Garbage food! The workers and the owner are on drugs! The burritos had nothing in them literally nothing. Asked for the owner only to have the crazy guy hang up on us. Awful experience. There's too much good food in the area to eat this garbage. NEVER EVER EAT HERE!", "author": "S8adow M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-04", "description": "TACO TUESDAY. i went three weeks in a row when i first found this place. their tacos make me extremely happy. personally i think their carne asada tacos are best but i'm also a big fan of their carnitas and al pastor.", "author": "Alyssa L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "solid.\ninexpensive.\nquick and tasty.", "author": "Nick S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-31", "description": "I was wicked hungry and I wanted real tacos. So tiny at the register made some great suggestions and the roasted pork was deeliciius. He was friendly and introduced the staff which is his brother and adorable hard working mother !\nIt was super cheap and fresh and outstanding service \nI would gladly go back", "author": "Dan U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "Seeing a ton of five-star reviews here, and not really sure why that is. My experience there yesterday was good, not great. The decor is improved, the style is there now in a way it wasn't before, that's for sure. But the burrito I had was mostly rice, it really just felt like a ton of rice and a tiny bit of meat. Also, the chips w/ guacamole was pretty minimal for the price. The chip serving size was small-ish and the guacamole didn't seem particularly fresh.\n\nI may need to give this another go, order differently, and see if I just caught them on an off day. Pretty mediocre experience for me, though.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-02", "description": "Now, I can't tell if the food was good because I was drunk or if it really was scrumptious.  I'm going to go with the latter.  I ordered a burrito with chicken, hold the sour cream and guacamole please.  And I sure did inhale that burrito.  It didn't stand a chance.   They had seating outside so that I could stuff my face and provide some entertainment to all those that walked by.  Definitely will return!", "author": "Nyla K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-08", "description": "Nice open atmosphere and friendly service. Colorful variety of authentic styles. \n\nLunch was super yummy! \n\nTacos: Carnitas and chicken tinga on soft, warm tortillas were authentic and flavorful. \n\nBurrito carne asada packed with juicy steak, black beans, rice, and spicy salsa was huge but amazingly tasty.  \n\nSangria was perfect - not too sweet. \n\nGo and enjoy! \nHighly recommend. \nWe'll be back for sure when in the Castro. :)", "author": "Mish C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-04", "description": "Super tiny burritos. Tortilla overlapped itself due to lack of filling. Won't waste my $ at this place any more.", "author": "Brooke F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "The Tacos club is the best Mexican food I've ever had the pleasure to indulge in.\n\nI'll share my first experience where I had a total of three taco's: one Steak, one Chicken, and one Shrimp. The Steak taco was amazing. The meat was cooked to compel the tongue to bliss; never had I had such flavorful beef! The Chicken Taco was also a joy to savor; the cooks have mastered the art of fine poultry. Lastly, the Shrimp taco was a further delicious taste of authentic, real food (honestly, the food was all so vibrant, it was a true treat indeed!). Just the thought of the food makes me want to go back...\n\nAs a final point, the staff are fantastic people. Strike up a conversation (if you have the chance) and you'll be secondhand happy; the delight of the employees bubbles through their speech to warm your own heart!\n\nAll in all, I'd recommend the Taco's Club to anyone. This restaurant is among the few making food really worth eating.", "author": "Rory G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-14", "description": "I ate here for the first time last night. Small little mexican joint in the castro area on market street. Its clean inside, there were only two workers. I ordered the slow cooked carnitas which came with rice , a choice of beans, mini salad and choice of tortillas. \n\nWhen i got my plate, i was amazed at how much meat they slap on it! SUPER POINTS for this ~~  The slow cooked pork was tender and falling off each other, and it was perfectly seasoned, not too salty. the rice was pefectly made. the rice wasnt mushy wet or too stiff. I got the pinto beans which was flavored well. I also tried their HORCHATA which is made of rice and seasoned with  cinnamon and sweetener. Delicous! One of the best horchata i have tasted. Also i got a steak taco which was delicous, again they give you alot of meat!\n\nI would definitely go back to this place again if i am ever craving mexican food. Its easier here to find parking rather than going to the mission  and spending a good hour looking for parking. \n\nAnother bonus i would like to add to this place is good service. We ordered, sat ourselves and got our food within 10-15 min. The guy who took our order was also very nice.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-25", "description": "Came for Taco Tuesdays, was left rather unimpressed...\n\nThe area is super hip and trendy, very fun to walk around and hang out! \nTacos are $2, beers are $3, and sangrias are $4.\n\nTacos were really average and rather small... They really didn't provide much meat, that in the end left us hungry and wanting more, but instead of ordering from here, we bounced to find a better place.\n\nCute, small, and limited seating.", "author": "Amy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-07", "description": "Yum.\n\nBeen here multiple times, and everything is good.  The nachos are to die for.  Fully loaded with meat, cheese, and all kinds of goodness!  Tacos are street style and very good.  Breakfast is delicious.  Never a wait, and the service is friendly.  It's wonderful to sit at the tables outside on a warm day. A little pricey for Mexican food, but hey, it's the Castro.", "author": "Jaching H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-31", "description": "Ok, so continuing on.....if you want straight up Mexican food at a good price, check in here. Beer and wine sold too and late night open. My Grandma would be ok here and that's sayin something.", "author": "Lorenzo R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Amazing food!!! Tacos are made with the perfect amount of meat and toppings! Salsa was perfect!!! Small but quaint!!! I LOVED IT!!!!!!", "author": "Victor A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-18", "description": "The worst. Avoid at all costs. Orders incorrect. Poor customer service. Over priced. My suggestion: go for the Mexican restaurant across the street that won't try to rip you off.", "author": "Nathan J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Time has improved things, the place looks so much better now, the tables inside and out are kept clean, and the service is very good.\n\nAnd they have nopales burritos, with green salsa, and so good, so fresh and tasty.\n\nThe fish tacos are great, just perfectly fried tasty fish, great slaw, so good.\n\nI can honestly say I have never had a bad dish here since they opened.\n\nEnjoy mucho!", "author": "William M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "This Mexican spot just gets it. It's not that hard to make a solid taco: the mandatory double-layered corn tortillas, cilantro, onions, and meat, with the optional salsa, avocado, cheese, and sour cream.\n\nSimple, high-quality ingredients prepared in the traditional Mexican style. I haven't yet come across better than this spot in SF.", "author": "Geoffrey B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-14", "description": "I'm not really an expert when it comes to burrito places. I know what I like, and this basically is that: a nice local place just off Castro that serves tasty food at decent prices, is open late, and has staff happy to serve me even when I'm jet-lagged out of my skull and haven't eaten in hours. \n\nThey have a little indoor and outdoor seating, but generally I like to grab mine to go along with a bottle of Mexican Coke, and their burritos are huge enough to keep you quite content for some time. Prices are about what I've seen elsewhere, and they've got a good menu beyond just burritos - they do fine tacos, as their name suggests. \n\nIn short, no complaints - just delicious food.", "author": "Sophie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-04", "description": "Excellent joint. As you'd guess from the name, it isn't your hole in the wall Mexican joint but instead a bit upscale while maintaining a casual vibe. The place has a warm, welcoming beach vibe. \n\nI recommend the carnita burrito! Outdoor seating is nice on a sunny day.", "author": "Victor W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Taco Tuesday prices were unbeatable! $2  per taco, street tacos only. They should offer them all the time. Quality was amazing. Easily the best tacos in the city. Tinga de pollo was by far my favorite. Salsa verde was spicy and delicious. Great service too.", "author": "Brinnley B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "If you are travelling through the area you should stop by and check out this local joint.\n\nDelicious fresh ingredients and well flavoured beef.\n\nDon't forget to try the sangria if it's a warm day.  It's delicious!", "author": "John W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-03", "description": "I just ate a \"famous mole burrito\"from here it was $15 an listen it was very under portioned mean you can get three taco truck burritos for what i paid at least make the worth it the mole was coo but i see no need to retur", "author": "Joe J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "I enjoy the food here. My boyfriend and I tend to go on Tuesdays for Taco Tuesday, and they're always delicious. It's inexpensive and quick also...even where there are a lot of people around. The only thing that would make it better was if there were more seats, but it's a small place, so you can't complain too much about that. \n\nP.S. I'm addicted to their guacamole even though there is not much to it.", "author": "Raymond G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-25", "description": "This isn't a scoop-it-out-of-a-warmer kind of place. Deep-fried fish with spicy slaw and a tasty pork al pastor taco for $10.50 (sans beer) is a good deal. As an added bonus both were on a doubled-up tortilla.\n\nConsumed on a sunny day at an outside table with a glass of spa water (thanks for the orange slice) makes this a cut above the normal taqueria experience.", "author": "Jake H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "The best burrito without having to go to the Mission.  Carne Asada finished on the flat top, fresh made guac, delicious AND spicy homemade salsa.\nThey also add cheese or sour cream at no extra charge and you get in \"fajita style\" (grilled, peppers, onions and mushrooms for just .85! \nI'm addicted, \nWhile the Castro dining scene dies a long slow death, it's nice to see the old stand-bys still doin' it right!\nI'd rather walk the extra 3 blocks to Tacos Club for a really REALLY good burrito than settle mediocrity from the very convenient Zapatas.", "author": "Bob H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-26", "description": "This place was amazing. We got all of the tacos and have to say it's all about carne Asada tacos.  The chorizo was really good but honestly it's a morning taco.  The sangria wasn't special from what I heard, but I won't factor it into my rating as I just had a modelo.", "author": "Joshua M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-04", "description": "I will not be returning to this taqueria.\n\nI ordered a chicken al pastor burrito.  It was ok, not great.  I asked for spicy salsa, I don't know what I got, but it wasn't spicy.  The burrito was the most expensive I have ever gotten in this neighborhood.\n\nThe worst part though was when I received the burrito, I asked where the chips were.  They told me it is an extra $3.95.  I have NEVER eaten at a taqueria that doesn't give you chips with a burrito, and I NEVER will again.", "author": "Kenneth O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "This has definitely become my favorite Mexican food stop in the Castro. I still really enjoy the chicken mole burrito, sweet, tangy, moist, very good with sour cream (a free addition). But my new favorite burrito is the Chile Verde Chicken. I get the spinach tortilla, refried beans, and sour cream, and it's so delicious I almost always forget to save half for later (the burritos are big!). \n\nToday they were out of guacamole, which was a bit heartbreaking, but I can understand why. Their guac is muy delicioso, and I generally order a half order every time. It's not the biggest portion, but it's sooo good.\n\nThe people here are amazing and friendly, and they treat regulars really well. I will definitely keep coming back here. FYI their brunch is great as well, I particularly enjoyed the special that came with chilaquiles y todos las cosas but the chilaquiles would be a good option on their own.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-09", "description": "If I can count how many times I've been here.  Everything on the Menu is great.\nWhat I order the most:\n\n1.  Grilled Fish Tacos   2.  All of the Burritos are great.  3.  To Share:   Nachos with chicken and   Platanos.", "author": "Joey C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "We came in here mainly bc I found parking right in front.  To our pleasant surprise, the food was really delicious.  \n\nThe place is very small, so you really need to be in and out.  My SO absolutely loved his fish taco, said it was the best he's had in a long time.\n\nWe had some tasty tacos, a bean/cheese burrito and quesadilla. I appreciated that they don't just steam the flour tortillas, they place them on a grill for some good marks. The salsa was very flavorful.  \n\nThe service was great too. The guys working there were patient and friendly. \n\nI don't think you'll be disappointed if you try this place.", "author": "Cheryl D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "As a Castro resident, I feel \"qualified\" to say that Tacos Club has the best Mexican food in the Castro. In general, there aren't any other good Mexican restaurants in the Castro, but Tacos Club is still pretty good.\n\nIt's a bit nicer than your average taqueria, probably to cater to the surrounding (gentrified) neighborhood. It also comes with a higher price tag than your average Mission taqueria. Expect to pay about $9-14 for your meal.\n\nThe staff is friendly and the food is good quality. Flavor is big! Tacos on point. I feel like I need about four of them to fill up, costs about $13.\n\nDefinitely stop by if you're in the area.", "author": "Bryce A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-25", "description": "Love this place. However, in the last month I made three take out orders and ALL three were made incorrectly.   I understand mistakes are made from time to time and let go of the first one. Second time, I was a bit irritated and called store to asked them to pay more attention to phone orders. Today was the icing on top of the cake!  I went to the store to have them make it the way I ordered it... Whole wheat tortilla, chicken, black beans, fajitas, guacamole, pico and spicy sauce ONLY!", "author": "Francisco P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "Tacos Club's Taco Tuesday deal is one of the best kept secrets in SF. At least once a month I'll find myself here ordering a huge plate of assorted street-style authentic tacos and leaving for about $8-10. Tacos Club provides classic flavors executed well, which is the best thing you can say about a taco joint. \n\nThe deal on Tuesday nights, the outdoor seating and the friendly staff make it an exceptional choice for a cheap and delicious weeknight dinner. I once saw one of the staff walking around in the city once and recognized his face as being \"the guy who always smiles when taking tacos orders\". That's the kind of place Tacos Club is.", "author": "Will S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "Their food is excellent. I  suggest if you get take out that you check your order before leaving. I ordered a grilled fish taco and a shrimp taco and got hom\ne and they had forgotten to put avocado on both. Very disappointing !!", "author": "linda m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "We were visiting San Francisco this weekend and were walking by this place and thought we would stop. Its small and doesn't have a ton of seating. However the staff were extremely polite and full of smiles. We just ordered a couple different types of Tacos and they were EXCELLENT. When I am back in the city, I will definately stop by. \n\nPlus, two extra thumbs up for the employee who gave a homeless man a takeout container of food while we there. Warmed my heart. :)", "author": "Clay R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "We had lunch there on Sunday afternoon. Food was fast and excellent. Service and staff are friendly. My Baja Tacos were very good. My husbands mole enchiladas were very good.", "author": "James A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "This is my my favorite place to get tacos in SF! The baja fish taco is sooooooo good!", "author": "Thao L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "Had a delicious steak burrito! The customer service was phenomenal. I'll definitely be back!", "author": "Daniel R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-12", "description": "Guacamole good, but chips over salted. Baja fish tacos too much Baja sauce and should have came with limes to squeeze over. Refried beans and rice were good. No horchata?! What!? Rotten bananas on counter top need to go. Service was good.", "author": "Jason S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-02", "description": "Best tacos in all of SF-maybe the whole world. Order the carnitas and you will not be disappointed.", "author": "Lindsay M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Regardless if it is taco Tuesday or any other day of the week, I never check in but I'm a regular because I work 2 minutes away. Their $2 street tacos are the best I've tried so far up here on taco Tuesdays and it keeps me coming back. But when I'm really hungry, I always get a burrito with no rice, no beans, add cheese, sour cream and guacamole (suuppperr good guacamole here!!! always fresh and perfect cold temp/ right amount of salt) and honestly any meat they make is delicious, I usually go with carnitas, carne asada or al pastor (chicken or pork depending on how much red meat i've eaten recently lol). They get pretty busy around lunch time, calling in for your order for pick up would save you much time.", "author": "Jetty S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-21", "description": "Stumbled upon this little gem while walking around the area. Food was great, everyone in my group enjoyed their food with no complaints. Only thing I didn't like was their horchata. It was a bit off for me, but every place does it different so no big gripe against them. Not much seating inside, but again, not that big of an issue.", "author": "Cisco P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "I friggin love this place. They have great hours staying open late when everything is closed up and they have great food. The staff is super friendly and the tacos de plazas, the simple and cheap tacos, are awesome and three will easily fill someone up. The meat here is savory, and that isn't just because it is in the Castro! ;) Worth a visit.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "I hit Tacos Club every Tuesday for Taco Tuesdays. Best tacos (IMHO) in SF and $2 a piece.", "author": "Dean B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-13", "description": "I just paid $23.00 for one vegetable burrito and one Carne burrito. They asked if I wanted guacamole and all that ( like a  super burrito) I said sure. They were just about to get slammed in there so easy glad to get my order in first because I was on a short work break. Not only wasn't super expensive for a small dollop of guacamole and SC. When I brought it back, I bit into the vegetable burrito and it was a steak burrito. There isn't anywhere on the online education menu that I found that says all the extras to.make it a super was going to be  $7 extra dollars.", "author": "Elyse T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "I love this place.  A must visit in the Castro for quick and inexpensive Mexican fare.  The service is awesome.  The people working here are always friendly and working with a smile.  The food is great and reasonably priced.  A huge burrito is under 8 dollars.  I usually get the Burrito Colorado which is spicy and saucy.  The quesadilla is another favorite.  They also serve beer, wine and sangria.", "author": "Tom F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "This place is so good! My husband and I are visiting from southern ca where there is bomb Mexican food on every corner... And this place exceeded expectations. We barely spoke once the food came lol We will be back again before we leave town...", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "BEST TACOS !! I'm a taco enthusiast, I love tacos! This place has the best ones! Their tortillas alone are amazing. Fresh & flavorful. But what really puts it over the top is the meat. I've only tried the carne asada & pollo asada ones but man, AMAZING. The flavor on the carne asada tacos was so good I could just eat the meat plain and be in heaven! I don't like cilantro & onion so I order mine with just meat & green sauce (spicy, but some of the best salsa verde I've ever had) and they are mouthwatering! I order 5 to eat there & take 5-10 home, they are that good! I recommend going on tuesdays (that's the only time I go) because they gave a great taco Tuesday served ALL day (not just happy hour) where tacos are 2$, beer 3$, & sangria 4$. BEST deal, BEST tacos, amazing people working there who are always so friendly. I recommend ordering some chips too, their fresh hand made & amazing as well!", "author": "Linda W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-08", "description": "I love this place. Bob from the Castro told me about their Taco Tuesday & it's a great deal. Their basic tacos are 2 bucks. They are like street tacos, so it's not super-fancy, but their ingredients are fresh and the staff is friendly. I think I'm going there today.", "author": "Scott F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Veggie taco was adequate but the lukewarm beer & the \"I'm bitchy but I'm cute, right?\" attitude were not.", "author": "Shal J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "Great little spot for Taco Tuesday. $2 tacos & $3 beers... Prices like this are practically unheard of in SF.  Yeah tacos are small put packed as full as they can be... Two was definitely enough for me! Excited to have found a true taco Tuesday spot that isn't ether ridiculously crowded or totally over priced. Warning- seating is limited... Only down side of this cozy little spot right on Market!", "author": "Katherine E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "Taco Tuesday!! 2$ tacos 3$ beers!! Love this place, the food is so fresh, and the carne Asada tacos are AMAZING!! love these guys! They have seating outside so you can take hour pup, such a fun place!", "author": "Luis S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "Just had such a nice meal, very friendly service! The manager even brought me out a free refresco. Great outdoor seating.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "Probably the best taco in SF.\nIf you can sit out side were the fumes from the Fabulouso (think Mexican pine sol)\nwon't kill you , you should be ok.\nThe bathroom if frightening.\nTaco Tuesday is a great deal at only $2 each, carnitas great with crispy bits as it should be.\nThe help here is nice, but please stop with Fabulouso !! \nA restaurant should smell like food, not a toilet.", "author": "K. K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-10", "description": "Wow has Tacos Club gone down hill fast since my last review.  As I noted, there is usually some sort of mixup in orders.  That has been the case in each subsequent visit.  My last visit ended up in my leaving without even ordering.  Upon entering the empty restaurant, I was ignored by an employee at each cash register.  One was likely finishing a shift and the other appeared to be having quite a bit of difficulty balancing the numbers with the cash.  After not being acknowledged, I decided that it was probably better to go to the competition than be ignored for another 5 minutes.  Seems I'll be unlikely to return.", "author": "J B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Great place for burritos but not enough seating. Stack your burrito with everything. It just makes it better. A bit on the expensive side if you compare it to chipotle.", "author": "Karan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "This is our second trip in as many days. Tonight nachos with chicken, guacamole and pico de gallo was the best nachos I've had that I didn't make myself in a very long time! The quality of the services is matched by the quality final mealy", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Dog bless Tacos Club. \n\nGoing to the Castro generally means a lot of late nights, dancing and drinking, so a full stomach beforehand is a key survival tool. Food options after dark are...well, there's the Creme Brulee Cart... Other than that, you're walking all the way to Sanchez or Church for decent eats. That is, until Tacos Club opened up. Fat burritos, succulent carnitas, tasty guacamole, and the orange-slice water is a really nice touch that separates it from the rest of the taquerias in this town. \n\nNo, wait, you know what separates it from the other taquerias? \n\nEverybody behind that counter is always happy. Every single time. I don't mean, they're pleasant and cordial, I mean, everyone I've spoken to at Tacos Club acts like they woke up that morning and said, \"Sweet! I get to make tacos today!\" They're not bouncing off the walls or anything obnoxious, they just seem to really love their neighborhood and what they do. Making delicious tacos. And that's why I stop in there whenever I can. \n\nYou guys are doing it right, keep it up.", "author": "Kevin B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-11", "description": "I'll be honest, have no clue what was in the green tortilla I ordered but the dude at the counter was chill and had some good recommendations. Ordered the chicken burrito and man I'll tell you, that was one of the best burritos I've had. Keep in mind that I live in Santa Monica, with East Los Angeles right next door and Mexico just a hop, skip & jump away, I know and love me some Mexican food. Great salsas as well good price points. Thanks again.", "author": "Tahj Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "The fish tacos are comparable to what you find in the SD area. Everything is fresh and vibrant. Seating is limited, however you'll likely leap out if your seat to proclaim how delicious your food is. So save the seats for the tourists!", "author": "Shawn C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "I had the fried fish and veggie tacos on corn tortillas. It was delicious and healthy tasting with lots of fresh veggies, much better than the new awful taco place across the street. Next time I want to try the platanos and the grilled prawn taco. They charge for chips, but they are homemade.", "author": "Meredith G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "Farthest 1st, 3 of the carne asada tacos with chips & salsa, & one large veggie tacos & the chips & guacamole & horchata. \nWent on taco Tuesday and it was delicious! $2 tacos and fresh horchata enjoying the view of the Castro life, can't complain. Great meal, service, and overall good time. Definitely coming back for more!", "author": "Jasmine W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-07", "description": "First off, I want to complain about this establishment regarding their pricing.  I don't want to be the douche that complains about trivial things but a pet peeve of mine is when your price board doesn't match what you are actually charging me.  I complained before and got my 50 cents back with a promise that they will change their price board soon.  A month later, it's still the same issue.  Although this time I didn't complain as I didn't have the energy to point this out.  Instead, here I am yelping about this bad business practice.  If you increase the price, show it on the board and your menu.  Don't let me be surprised to see this when I check my receipt.  50 cents may not be much but we all work hard for our money and deserve paying what is written!  How can this be reported to authorities?  Do you guys have any suggestions?\n\nOk, enough ranting about the price.  I gotta say the food is really good here though.  Although, it's a bit pricey compared to the other taquerias in the gayborhood (Castro).  The chile verde burrito I have here is so tasty and has more flavor than the other taquerias. Their breakfast burrito is so good too.  Be careful though because the burritos are really hot temperature wise so don't expect to eat it right away or you will be burnt.  Like I said it's pricey as it doesn't come with free chips.  An additional sour cream or guacamole would cost you additional 2.00 towards your regular burrito.  \n\nI hope they fix their pricing issue and other yelpers, please let them know as well so it's just not me who gripes about this.  :D", "author": "flozion f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-29", "description": "AH-MAZING!!!! Stopped in here on a rainy day with a line out the door. I had the tacos de plaza unfortunately I only ordered three I could probably eat like 10 they were delicious. And they aren't skimpy on the portions. My fiancé and I filled up for 25$ that's including drinks! Everyone needs to come here! So delicious", "author": "Alexandra B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "This is the type of place that I considered not writing a review for because I didn't want it to become so popular that the line is out the door, but they deserve the 5 stars. Here's the deal: Everyone in SF has there own things they like about burritos, so maybe everyone won't agree with this review. For me, this was the best burrito I've had in the city in years. \n\nFor years I was a SF burrito lover. I started dating someone from San Diego and tried one of the burritos down there, which put SF burritos to shame. They don't have rice/beans in their burritos - just meat and guac, which made me realize that the rice/beans just masks the flavor of the delicious meat. So, I've been ordering my burritos that way in SF for about 2 years and I'm constantly disappointed. I've been trying to make the switch to tacos, but I always miss burritos. \n\nLast night I ordered a carne asada burrito with nothing but meat and guac. It was perfect. Amazing tortilla, deliciously grilled steak, and a thick (but not too thick) guac that complemented it perfectly. Each bite I took I was sad that it was that much closer to being done. \n\nI ordered my BF a chicken quesadilla, which he couldn't eat bc he had been sick all day. Naturally, I ate 60% of it. Quesadillas aren't  really my thing, but again, the tortilla and grilled, juicy chicken were so good I couldn't help myself. The only problem is that today I feel like I weigh 400 pounds.", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-06", "description": "Great service. Awesome chips, flautas are money and the ingredients used seem to be quality. \n\nHere's where they fall short.....\n\nNo salsa bar (WTF?). Pinner tacos. These tacos are almost $3 and they are the type you could eat in two bites; weak sauce. They should cost a $1; flavor is nothing special either. They also DO NOT hook you up with chips when you buy tacos, you have to pay $3 for them, which I did, and they did not hook up any salsa. I am sure that doesn't typically happen, but the reason I came here was because I wanted the fresh fried chips and salsa ( I knew I should have checked!!!). They also give you a tiny portion of chips. Most taquerias will give you as many chips as you want for free, so I was expecting to get hooked up when I paid $4 for some chips (quit being so stingy!)\n\nIt really sucked not getting the salsa. I probably would have given them two stars, but the service is really great, the flautas are worth coming back for, and I am sucker for fresh fried tortilla chips. Would be four if they would hook it up on the portions by about 1/4. Yes, I'm a fatboy.", "author": "Eucalyptus J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-09", "description": "I've eaten here a couple times out of convenience, and hats really all it is. Nothing HORRIBLE to write about, but the food is just mediocre and the flavor of the meat is really only as good as the salsa you get on it. I've had tacos here only, and nothing to talk to anyone about at all.", "author": "Anush V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-03", "description": "Beware! Had a chicken burrito last night with a side of guacamole and chips. Food poisoning. Started throwing up at 8am and never felt so bad sitting waiting for a 13 hour flight.", "author": "Matthew R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Great tacos, good drinks and good people! While I realize paying almost $3 for what appears at first to be a mild street taco may seem extreme, do not be discouraged!! They are excellent!! And the people a just as money. \n\nToday I had an early lunch of a carne asada and a pollo taco. They had so much meat on them it was falling out of the sides after my first bite! the seasoning on the meat and the verde salsa blend excellently. By far some of the best tacos I have had in this city yet!", "author": "Jason C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-18", "description": "Some of the most authentic tacos in SF. Al Pastor rocks. \nDon't get me started on the Chillaqules for brunch. Fantastic with chorizo. \nHighly recommend.", "author": "Bert J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-08", "description": "Can't give a review, because taco club has told Yelp they close at 2 AM but here I am, standing at the curb at 1:00 AM wishing and praying taco club is open but it is not. lights off. Nuffin. Where the f do I go for tacos now!! #help #tacoemergency", "author": "A Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Awesome taqueria style tacos. Wish I could eat here every day. Friendly staff. The owner really tries to connect with the community.", "author": "Richie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-17", "description": "Legit Mexican food that is far better than any of the other places across the street.  They are way underpriced for what you get.  Consistently the best carnitas tacos I've ever had.  I only wish they offered a hard shell taco version. And it doesn't hurt that there are always some hotties working or eating here.....heart of the gayborhood.", "author": "Jason F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Back again... Becoming a regular Every time I visit this neighborhood! Great service and Food! Veggie alternatives too!", "author": "Kimberly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-06", "description": "Ordered flautas expecting flour tortillas. Aren't corn tortillas, made in the same way as actual flautas(flour tortillas) called \"taquitos\"? But I love your food!", "author": "Edward B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "All this time has passed got my many favorites now but the Tortilla soup is great on a rainy day too!", "author": "Joe Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-19", "description": "Good food and GREAT service, but the food didn't hit the spot. I bought a steak burrito with an addition of cheese and guacamole for about $11. Although filling, the burrito wasn't fulfilling, if that makes sense. The flavor was not rich nor distinct from other taquerias. Again, good food, but nothing differentiating it from the rest.", "author": "Lazaro G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-25", "description": "Necessita  mucho mas  sabor  por favor. Why o why are so many Mexican joints just void of the spicy and complex flavors that make Mexican food so good. Pinto beans can be delicious when cooked right, carne asada should sizzle in the mouth. Often I find even salt is absent. I understand everyone has different tastes but please something. The staff were very friendly however, and the place is a great location, but it just won't be the place that pops into my head when I want some Latin cha cha cha.", "author": "Matt A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-03", "description": "How a $9.5 mole burrito can turn into a $16 meal by simply adding black beans and substituting a flour wrap for corn tortillas is beyond me. Not even any garnish, nothing green...lime, cilantro, guacamole....nothing but mole chicken, black beans with a crumble of cheese and rice....with corn tortillas. No salsa, etc. etc. If you can move beyond that, it IS a tasty dish. But, in this economy, if you can't fix the basics of allowing substitutions and simply add garnish...a lime and sprig of cilantro would REALLY have been nice and made the plate pop. Had this dish been the original $9.5 price, I would have rated this 4 stars. With the garnish and a dab of salsa, probably 5.\n\nOh, and WHERE were the pickled peppers? Forgotten? OK...maybe next time....", "author": "Jim S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-10", "description": "Is 20 minutes too long to wait for a mediocre burrito ? I placed my order and noticed another customer waiting. He was served but I was kept waiting. There was 1 cook and 1 cashier busy yapping on his cell to do anything else, when I asked why it was taking so long he became irritated and blurted out 2 minutes( which turned in to 5) then continued with his cell chat. When I finally got my burrito to go I asked \"where's the chips?\". He said that would be $1.00 extra! Chips are free everywhere else! How was the burrito?, below average and over priced. And oh yeah, the salsa I requested was forgotten. If you like slow service with attitude this your place.", "author": "David I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-30", "description": "Lots of competition for a good tacquiera in SF .  This is just okay.  It's small, crowded, and a bit pricy. No chips with the burrito, it's an extra $3.95 for chips and salsa.  Any of the other places in the neighborhood-- beat this place hands down.", "author": "Dennis N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "Used to be La Fajita Grill. Makeover includes new flooring, counters, tables, and menu. Ate here a few times when it was La Fajita and found it unaspiring. Tacos Club has much friendlier service and more diverse menu. \n\nOrdered Carnitas Burrito, Quesadilla, and Fish Taco. Food is much nicer in quality and cleanliness. Watermelon Juice was also very good. Will be back to try more of the menu.", "author": "Roland L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-20", "description": "Came here at 1am on a Saturday, no line, super fresh guacamole, pico de gallo, and chips. Service was fast and friendly. They also have very good horchata and other agua frescas. Perfect for a late night or afternoon bite!", "author": "Jayron M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-24", "description": "The Tacos were definitely not bad. The service could have been better though, but the setting in which you end up eating made up for that a bit.\n\nI went there with a group of friends and I think we all generally felt roughly the same about, not a place we're dying to go back to, but if invited we probably would anyway. I don't hold a grudge against it, but it was nothing special.\n\nOne of my friends got the burrito and tried his girlfriends taco, he said that the burrito was much better than the tacos. Since I had the taco I'm thinking I will have the burrito next time, or perhaps the torta.", "author": "Anastasia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "This place has very good tacos! \n\nThe service is very good and I LOVE the way the place is so much cleaner than before.", "author": "Mr. Bill S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-20", "description": "Hm, I think overall the food was good. I got the quesadilla which was quite large in portion size. The tacos were pretty good, I'll make sure to get them again. It's a good spot to grab good from with limited seating but if you're wanting a quick spot near the Castro, this might be the spot.", "author": "Juan T. K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "freshly hand-battered fish tacos! excellent. all of the small touches make the menu interesting. I am a regular.", "author": "Mathieu S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "Worst Taqueria Ever.  HORRIBLE!\nI can't believe this place even has a business license.  Without a doubt, the worst taqueria I've ever seen.  I've lived in San Francisco, since 1997, and been to taquerias all over town.  This is, without a doubt, and the worst taqueria I have ever seen.  I ordered, along with two friends.  We're just about the only people there.  My food was never delivered, even after my friends we're almost done.  I was told they forgot to make my food, and that it would be comped.  My food finally arrived AFTER my friends were finished eating, and my somewhat passable meal was not comped, even after apologies and promises of a comped burrito.  Avoid this place.  Better to go home hungry, because you will probably never receive your order anyway, even after paying.  Seriously the worst taqueria in San Francisvo.  Never again!  HORRIBLE!", "author": "mark f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "It is so good. Sometimes the service is a bit slow but worth it. I highly recommend the chimichangas", "author": "Scott L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "Amazing mile and great service. Soup was huge and yummy with lots of avocado", "author": "Jay B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-24", "description": "Ordered 2 burritos for take out.  I ordered chicken, pinto beans, guac, sour cream, cheese, mild salsa, lettuce and tomato on a flour tortilla and specified NO RICE.  I got very little chicken, a few beans and a LOT of Rice.  If there was any cheese or guacamole or sour cream I couldn't find any trace of any of those (for me) essential ingredients.  This was without a doubt the driest burrito I have ever experienced, kind of like eating some Gobi Desert wrapped in a tortilla.  I think my mistake was in not having him read the order back, although he did repeat each item as I was giving it to him.  I see lots of good reviews for actually eating there but I would not recommend their takeout-I wont be back.", "author": "Pat R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "Super burritos rocked!!!! And I liked how they are wrapped in wax paper so it's easier to hold and less messy to eat.  It's the more classy place to have a burrito al fresco.", "author": "Anthony H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-04", "description": "It's still great carnitas and nice people, but the auto-tuned pop whining out of the crappy TV speakers really is oppressive. Bring your own music and tight ear buds.", "author": "Brian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Arguably the best tacos I've had north of the border. Ordered 3 tacos al pastor, and while the meat wasn't exactly cut/presented the way it is in Mexico, the flavor was delicious! Go here for legit Mexican food! Can't wait to return to SF to grub here again.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "Solid Mexican food. The steak salad was delicious, tender flavorful beef. The vegetarian burrito had just enough rice and the rice was perfectly done. Be sure to order extra cheese though, extra is like normal. This place is great, even with the silly name. Hope to visit again soon", "author": "James S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "This is good, reasonably priced Mexican. I haven't yet tried a dish I don't like here. I've tried the burritos, tacos, mole, and enchiladas, and they've all been great. I'm a big fan of the chicken mole burrito! They stay open pretty late, so Tacos Club is a post-bar-hopping favorite for my friends and me.", "author": "Erin S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-12", "description": "Was looking forward to midnight tacos on a Sat night, but the place was shut by 11:30pm, with a sign that says close at 2am.", "author": "Xiaoming F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-29", "description": "I have never dealt with such rude service, ever! Stopped by on a very rainy night and ordered 2 quesadillas to go. The cashier asked me if I wanted a side of guacamole and we both said yes, so 2 guacamoles on the side,  This place is not cheap and the total came out to $25 which is fine.  We get home and realize they never included the side of guacamole so I walk 4 long block in the rain to get what I ordered.  This is where it gets nasty.  Not only did they not give me what I paid for, they would not take my word that they shorted me on my order and kept saying it is in there. I even called home to have my partner check again and nothing. They argued with me for a while until I told them I would go back home and bring everything back to get my money back. At this point the cook started preparing a side of quac and I left with a promise to never every give these crooks my business.  They are a bunch of rude punks that should not be in the restaurant business.", "author": "G A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "Love Taco Club. The staff are always friendly. I enjoy their chicken burrito without rice. Super fresh and very tasty.  I highly recommend.", "author": "Jim D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "Love the Platanos dish and Nopales Tacos. This place makes it easy to be a vegetarian!! Not sure about their vegan options but I like this place much more than Gracias Madre in the mission.", "author": "Krystal G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-05", "description": "This place have rude workers. Refused service before 2am and pushed me out the door. Yez, i may have had a few drinks but pushing me out the door when their sign says \"open\" isn't nice.", "author": "J.e.e. M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "Very good.  Had prawn burrito.  Was good, inexpensive, fast service.  First time here.  Several options for you try.", "author": "John R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-13", "description": "Real regular- fine if you're in the area, but definitely not worth going out of your way for. I had the carne asada tacos that were good. Service was very friendly and the food came quickly. All and all it was ok", "author": "Esprit S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-05", "description": "Great nachos, some of the best in the city. Also they have taco Tuesday special that is worth the trip.", "author": "Jose G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Excellent food! I ordered a steak & chicken corn taco & they were both out of this world delicious, authentic, & the meats were cooked perfectly!  The chef/owner, Antonio, was so friendly and cooked my meal from scratch!  I was so satisfied with my lunch from the flavors to the amount of food!", "author": "Stephanie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Marisco with prawns and nachos with carnitas and guac were fantastic. Highly recommend. You get a lot of good food for your $.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "My god was this delicious!  The food was amazing, the ambiance was perfect for a lazy Sunday brunch with great friends and the service was spectacular!  Why everyone was waiting around the corner at Starbelly is beyond me because we got the best brunch in town!  Huge pitchers of mimosas that were more like Champagne with a splash of orange.  I cannot wait to come back!", "author": "Jen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-26", "description": "Great place outdoor seating , fresh food and great taste  I got the carnitas with green salsa and it was amazing , fresh guacamole and affordable prices !!!", "author": "Louie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "Really great food, really great staff, and a cute little environment! I highly recommend the vegetarian burrito- just make sure you listen thoroughly to all of the options they give you at the register!", "author": "Natalie M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "One of the best mexican joints in SF. Clean and festive interior with very friendly staff. The food is not super oily. Ingredients are high quality and authentic. Would highly recommend as a regular in your eatery rotation.", "author": "David C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "The customer service at Taco's Club is poor. I've given them many chances but they consistently fail. To make matters worse they have cavalier attitudes. Today was the last straw and I will not be back. I am also going to go out of my way to discourage everyone I know from patronizing this establishment.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "I came here a couple of times before work but the second time we ordered it to go and were given a number and told to sit and wait for it to be brought to us. 20 minutes pass by so my friend goes up to the counter and checks on the order since we're almost late for work. He asks the guy and surprisingly it's just sitting on the counter.  The place wasn't busy so why give us a number if you aren't going to bring it to us.  The food is decent but not that great and the service is questionable.", "author": "Jen J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "The steak burrito is filling and yummy! They were really nice and let us buy food even though they were closing.", "author": "Trina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "Great tacos with onions and cilantro, just as it should be.  Glad to see these guys in the Castro!", "author": "M M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "Big fan of Tacos Club. Have had their tacos and burritos a bunch of times- are filling and well priced. Staff is very friendly and provide great service. A good vibe at a good location.", "author": "Ben R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-17", "description": "Very very friendly service and the food is BANGING! The menu is diverse enough that it definitely takes some time to decide, but it's not overwhelming.", "author": "Julio A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-05", "description": "Awesome food. Specialty Mole burrito was delicious and a friend rated the chorizo and potato burrito pretty highly as well. Friendly staff too. If I lived in SF I would come here A LOT!", "author": "Mark P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Small place, very friendly workers and DELICIOUS food! Highly recommended the tacos on Tuesdays!", "author": "Yassi J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-17", "description": "I love this place! I liked Fajita Grill, but they'd seemed tired lately. Taco's Club is a vast improvement. It is cleaner, the food is delicious and it is a great value. I had a Steak Grande Taco and a small guacamole for $8.00. Best guacamole I've had in a long time. delicious taco. Authentic Mexican food. \nThe staff is lively and very sweet and welcoming. I love the fresh new look of the place, too. If they sold taquila, they'd give Tacolicious a run for their money.\nBut here's the thing that completely won me over today:  I carelessly left my Tablet there. I left, went back to work, noticed I didn't have it, hoped I'd left it at home when I had dropped in quickly before returning to work. Got home at 6, and realized the sad fact that it was gone. \nI almost didn't call Taco's Club because I figured it would be futile, but I needed \"closure\". Guess what?! They saw it and saved it for me!!!!! What are the odds? This place is magic!!", "author": "Jane L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-19", "description": "I tried this place out today after work, mostly out of desperation. I hadn't eaten all day and it was almost 4 pm, couldn't stand to walk another block.\n\nI came here a few times when it was La Fajita. I really wasn't a fan of that place. Figured I'd give the redux restaurant a shot.\n\nDamn, I'm glad I did. I ordered the vegetarian cactus burrito on a spinach tortilla. Everything was fresh and delicious. It was honestly one of the best burritos I've ever eaten, and blows away any burrito I've ever had at any of the other Mexican restaurants in the area. \n\nGuy working at the counter (mid 20s, buzzed head) was super friendly, checked up on me and everything. Great service, great food. My new burrito spot in the Castro.", "author": "L M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-08", "description": "Yelpers, you know my rule.  The filth they show you isn't half as bad as the filth they don't.  Look at the vomit and grease on the sidewalk out front.  They expect CUSTOMERS to eat at tables on a filthy sidewalk.  Trust me, you don't want to see the bottom of their refrigerators, or how food is handled.", "author": "EC N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "By far one the best Mexican food restaurants I've had in SF. Service was great and the food was just unbelievable. Hands down I will for sure go back and eat there and I will recommend it to my friends!", "author": "Favio S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "Tasty tacos. Also the guy at the register overheard me tell a friend that I had given blood today, and he gave me a glass of fresh squeezed orange juice just to be nice.", "author": "Catherine S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-13", "description": "This is a great little neighborhood Mexican place. Tacos and burritos are tasty and the service is friendly. What's not to like?", "author": "Chris M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "I ordered the Steak burrito, fajita-style with black beans and a flour tortilla. It was probably the biggest burrito I have eaten in SF. It was okay, but not great.", "author": "Johnathan W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-04", "description": "Bad Service and Food. Visiting from Southern California we thought we would give Taco Club a try. The food is bland and overpriced. I ordered a bowl of Pozole and it was horrible. Smelled ripe , like it was bad. When I approached the gentleman at the counter to let him know, he said he could \" take it back\" , but never offered me a replacement meal or refund. They let us walk out without saying a word. Horrible experience for a $40.00 mexican food lunch.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "the folks at tacos club are truly honest, great people.\n\nlong story, short: in my drunken stupor last saturday night, while enjoying a burrito at tacos club, i almost managed to win that night's darwin award, blacking out in front of the restaurant, and leaving my wallet, my keys, my newly-purchased nintendo 3ds, as well as my dignity sprawled all over the place.\n\na couple friends found me and took me home, leaving all my belongings there, because they didn't know any better.\n\nwent there today, and not only did tacos club gathered my belongings, they kept it there for two days, untouched. my credit cards, bank cards, and a wad of cash was in tact, along with my keys and nintendo 3ds.\n\nthank you antonio and alberto for everything; i'll definitely spread the word to friends to check you guys out for local, authentic mexican food. oh, and one more thing: i promise not to pass out drunk in front of your establishment ever again.", "author": "Mike N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "This little Castro taquería has really hit a home run. Really amazing food. The food always tastes fresh and healthy, never greasy. Their nachos are the best! The overall experience is great, and the staff is insanely adorable (especially the latino guy in the little bear beanie). Great service. Great food. Check it out.", "author": "Denny G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "I've eaten here a few times (for to go) and it's been great each time!  Fast service and nice people working the counter.  Really great vegetarian options - I'd recommend trying the Legumbres burrito!", "author": "Lauren D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-11", "description": "This place is a convenient location, but for the price I would expect a lot more. I got the chicken burrito and it came to over $12 with guacamole. Food is so-so quality and portions are small. There is not much place to sit and the interior design was completed in a hurried fashion. Way better options in the Mission for half the price!", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "This is THE best taqueria this side if Mission.  I've lived in Mexico and they have the most authentic tasting tacos in the Castro.  If your looking for the Americanized blander alternative the Castro has that as well but for those looking for a more authentic tasting taco here's your stop.  Also, taco Tuesday is awesome.  So glad they are down the street from us.", "author": "Vincent G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-30", "description": "Kinda rude. Myrna were very unwilling to adjust an order. I mean if I'm gonna pay for the food just please make it to how I request- charge what it costs just do it. Otherwise the meal is decent. It's nothing special- just open until 2am.", "author": "Robert R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "solid mexican food.  friendly staff.  good salsas!", "author": "R B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-27", "description": "The man whom owns this establishment is a criminal.  HE STOLE MY FRIENDS WALLET, AND EVEN ACKNOWLEDGED THE FACT THAT HE DID.  If you support this man's business you support criminals.", "author": "Tylr K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-23", "description": "No salsa bar, dry burritos, no chips served with the meals, and overpriced to boot. The service and staff were fantastic and friendly, but bland overpriced burritos with no chips or salsa in SF?? I'm amazed this place is still in business!", "author": "Todd H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "this place is great, the entire staff is so nice. I love having a solo dinner with the yummy grande tacos & sangria or enjoying a meal with a group of friends! I am sure all the food is great but i am currently hooked on the grande tacos with chicken, i tend to order the same thing a lot when i like something:)", "author": "Johnny B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "Hands down best mexican place in the Castro! Fresh ingredients and great tastes! It feels like your transported to a tropical villa in Mexico with food to match!", "author": "jp v."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "We were looking for a Mexican restaurant in the Castro area of San Francisco and stumbled upon the newly opened Tacos Club. Everything was made with fresh ingredients and cooked to order on the spot. We could not have been happier. Make sure you save room for dessert. The flan is the best I have ever tasted!", "author": "D L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "Best burrito I have had in the city yet.  Local organic ingredients and friendly staff.  Mike was very courteous in serving up our order.  Open late too!", "author": "Jason T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-15", "description": "Over priced!!! I ordered food here for pick up. One of the things I ordered was chips and salsa. Brought my food back to work and found there was no salsa. I called and they could care less. Never again!!!", "author": "Dani G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "This place ROCKS! With the friendly staff  and \"at ease\" dining environment, one can enjoy a REAL and great meal- AUTHENTIC in every way!! Antonio and his team is always friendly and always sets the mood. Whether it's Taco-Tuesday or that late night bar snack, one can't go wrong with Tacos Club.", "author": "Ronaldo T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-05", "description": "I haven't been to this place since I first moved into the neighborhood in 2010.  I went last week for Taco Tuesday.  There is enough variety on their taco menu.   I highly recommend the Pastor.  I'd probably say that this place is the best taco place in the neighborhood.", "author": "Perry P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Ay, que rico! Tacos--real tacos, with soft or crispy corn tortillas, succulent fillings, and snappy salsas--are a revered street food on both sides of the border. In TACOS, Mark Miller adds a chef's sensibility to this vibrant primer for building delicious and authentic tacos.", "author": "Correalew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-01", "description": "First time here since it was La Fajita Grill. So glad to know the food is just as good, and the decor is greatly improved. Tastiest Mexican food in the Castro (especially the cactus burrito). And the food is organic and locally sourced as well. \n\nThey got rid of all the cold tile and metal - now it's all warm and inviting. \n\nMy only disappointment was that the burrito wasn't grilled after being wrapped in the tortilla - I love I when they do that and I liked that about La Fajita Grill", "author": "Thomas F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-07", "description": "Don't come for Taco Tuesday.  I waited 45 minutes for 3 tacos.  They lost my order completely, and if I had said nothing they would never have noticed and I wouldn't have eaten at all.  Many other customers were also testy, having waited ridiculous times.  The tacos were tasty though, thus the extra, second star.", "author": "David W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "We visited SF and we were searching for an authentic Mexican place. Taco Club has really really great food, and everything is house-made, so you should eat there.", "author": "Thomas J H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "WORST EXPERIENCE EVER!!!!!!!!!!        So I order a chicken burrito and I also asked for a medium spicy salsa and extra chips on the side..  order came to 13.00..   no big deal..   So I am walking down Market street and I decide I want to have a few chips..  and that is exactly what was in the bag with TWO tiny containers of salsa!!!!!!     So I go back to the taco club to see what happened and the young guy behind the counter had NO understanding as to what I was talking about.   I told him that I had ordered a medium order of spicy salsa and extra chips and the burrito was only 8.00 so WHY did the order come to 13.00????   He said that orders were \"subject to change\" on the menu?????   WHAT DOES THAT MEAN??    So of course I did NOT get what I wanted so I asked for a refund..   got the refund..   young man behind the counter VERY argumentative with me throughout the WHOLE BAD experience of dealing with this situation!!    VERY uncomfortable and would not recommend to anyone..   BAD BUSINESS.........       NO STARS............     horrible people to deal with!!", "author": "Martin C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "Good food overall.  Friendly but annoying cashier... I really dont care about your opinion of my itinerary for the day but whatever. Had the tacos flautas and Quesada all were good and portions were nice. Give it a try.", "author": "Johnfucious S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-11", "description": "I live in the neighborhood and thought I should try a new place for fish tacos. This is NOT the place to go even though the reviews here are ridiculously positive. I paid over $10 for two fish tacos with no side. what the hell?? I paid extra for beans and rice and they were below average. A much better and cheaper place is El Castillito on Church. I guess it doesn't pay to stray from what you know is good food.", "author": "greg j."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "This is NOT the same taqueria that used to be here. This new incarnation serves exceptional gourmet Mexican!  The chile colorado and the mole enchiladas are some of the best I've had.  And the tacos and burritos are que rico too for those of you that still want that taqueria experience.  You will be happy you tried this new restaurant.", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "I love the weekend brunch. The taco egg scramble is my favorite. Also, Taco Tuesdays are great!", "author": "Fabian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-11", "description": "stopped in for breakfast randomly on our way to twin peaks. service was great, food was amazing...", "author": "Bugsy S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-13", "description": "so check this out .. i come here once a week .. the people that work here are all extremely friendly .. they know my order by heart .. i come in, they ask me if i want my usual and that is what seperates this place from others .. they are great !! so the food .. okay, it's not like other places .. they kinda got their own flavor & i like that .. but bottom line it's all about the friendly & courteous service here .. so personal .. & for me it's convient since it's a half a block from my house .. as long as they keep up that friendly environment i will continue to be a regular there ... one worker in particular is extremely friendly on the eyes .. just had to include that in here ..", "author": "Michael P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "Come for lunch often. Their grilled fish tacos are bomb! The staff is always efficient and friendly!", "author": "Oliver K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "a great place, with great healthy food.. best Mexican in the City !", "author": "Yousef H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-20", "description": "Much-needed overhaul of La Fajita is good, great menu and the food is fine but I fear the pricing is going to put them under - seriously, $11 for a super burrito and $3 for a Mexican coke?  You might command that premium if the food or ambiance was noticeably better than the rest, but I can think of a least a couple of other tacquerias nearby that I actually prefer and which are a lot cheaper.  Very friendly service though.", "author": "Jeff P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "Amazing mole burrito.  So tasty!   Friendly, upgraded, fresh and organic food.  5 thumbs up!", "author": "J P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "Decent Food. A little expensive. Chips are really good - when they are fresh and they remember to salt them.", "author": "Daniel B."}
