{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "This place is surprisingly good. \nHuge portions and decent price. \nThe chef is and old school mamacita, her son comes in sometimes to help out. But it's always better when she makes it. Takes a while but get over it and be patient. Grab a beer or Mexican coke while you wait. \nI get the regular burrito with carne asada, refried beans, no pico de gallo, with the house made spicy sauce and add just a little bit of sour cream. Comes out perfect and saucy. \nAlso take the green salsa for my chips, it's got a lovely garlic hint to it.", "author": "Texus T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "Decent food, they gave me 3 slices of avocado instead of guacamole for the platter which was a bummer. $14 for combo platter, meh prices.\n\nI came 30 minutes before close and they were able to make my food in under 15 minutes which was good. However, I had actually ordered over the phone 45 minutes prior, they just didn't understand my order (I wanted one chicken platter and one combination chicken and beef platter.. they thought I didn't know what combination meant...???) so I had to physically haul my ass over to place my order even though I thought I was picking it up.\n\nMoral of the story, order ahead online or in-person, anything but over the phone.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "After almost 10 years, this is still my favorite Taqueria ever! Every time I return I expect something to have changed, or the food to be worse than remembered, or it to be gone completely (because that's what happens to favorite places, right?). Yet, each time I am pleasantly surprised with mouth-watering deliciousness, service with a smile, and the best Jalapeño salsa around! I love you Taqueria el Jalapeño!", "author": "Amanda E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-16", "description": "The owner charged me $3 more for a quesadilla. When I asked him why he said, \"super shrimp\". When I told him that's not what I ordered and it's not $9.50 or a quesadilla, he said, no. Basically just blatantly overcharged me.", "author": "Avery D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Mexican food doesn't get cheaper than this. The place gives you a homely feeling and the owner is super nice. She takes her time, but the wait is totally worth it. Free chips is a plus. I feel full after the free chips and one super taco, so basically in $7 or so.", "author": "Chetan G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-01", "description": "Decent grub near city college. Ambiance is well not great but it's a taco shop so you don't except more. Get a pollo taco, you'll feel good. Full yet not too full. It's awright", "author": "Eileen G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-27", "description": "This area of town doesn't have much selection as far as Mexican food is concerned, so when my nacho craving hit (as it does on most days that end with Y), Taqueria El Jalapeno was pretty much my only choice (too lazy to go to West Portal for El Toreador). So this review is based off a weekday afternoon visit, in which all I ordered was carne asada super nachos (I think the totally was $8.50...). There was a lady working the counter and making the food. Luckily, no one was ahead of me, so I walked right up and placed my order. As previous reviewers mentioned, it does take a bit for your order, because this lady is running a one woman show, but it wasn't that bad of a wait (although I had no orders in front of me.) \n\nWhile waiting, you can load up on the salsas at their little salsa bar. The red and green salsas were hella good. The pico de gallo was so-so. \n\nOverall, I think the nachos were pretty damn good. They are generous with the meat and the toppings, and the portion is really big. The only small bummer is the chips they use; which is crucial, of course. They use that giant bag of yellow corn tortilla chips from Costco. If you're a Costco shopper, you know what I'm talking about. Those chips are alright, but there are so many better quality, and sturdier chips out there! Sturdy is important for all of those hefty toppings they pile on. If they upgraded their chips, these would be some 5 star taqueria nachos for sure.\n\nIf you have a craving for some loaded nachos, I think you'll be quite satisfied by what Taqueria El Jalapeno is serving up.", "author": "Liz M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-20", "description": "Run of the mill Mexican, nothing special, Tacos are tiny and not the best quality of carne asada, and honestly super disappointed with their hard saltless chips and tiny dip selection. It was the typical red and green sauces at the sauce bar, both really spicy so there's really no choice in heat. At other taquerias in the area you get a much better presentation of housemade salsas, but this place I think is serving something very similar to what you can get in a can at the grocery store. All that aside, the owner was really nice and polite, and she chatted with me in Spanish for a bit. Friendly service, quiet spot too cuz there's only one tv usually playing a Spanish soap opera, and there wasn't a huge crowd of people. If you want to avoid the crowd and just chill somewhere for a quick bite away from the city noise, *not expecting the most amazing tacos*,  then this is your place. If you want a great food experience and are willing to drive a little further I suggest the taco spots closer to SFState.", "author": "Mona L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-27", "description": "There are better places to eat on this street. As taquerias go, there's nothing special about it, and it's on the dingy side. Stellar food can make up for this, but that wasn't my experience here. On the plus side, they do give you chips with your order.\n\nI felt bad for the woman working at the counter--she was all alone during the lunch rush, taking orders, turning around to stand over a hot griddle before stopping in the middle of a ticket to answer the phone, which seemed to ring every few minutes. My food took thirty minutes, and I nearly had to cancel my order to make it back to work on time.\n\nAs I was waiting, someone came in with his girlfriend and said he was finally going to show her a \"real Cali burrito.\" I don't know if I will ever understand San Francisco's obsession with and pride in their burritos. I've had plenty of mom-n-pop hamburgers that make me sneer at fast food; the best tacos I've had have always been from humble stands, usually in Mexico. But I've never been to a burrito place here or anywhere else and ordered a burrito which made me say, \"Okay, this is clearly better than Chipotle.\" Maybe that's because all you can ever do to improve a burrito is put more  things inside it and use better ingredients...texture is almost irrelevant in a burrito. Is it just because they're easy to eat while you're walking? I'll take well-made tacos, gorditas, tortas, etc. any day over a burrito.\n\nI guess what I'm trying to say is that if your reputation is going off your burritos, there's a lot of competition in SF. It's hard to stand out, and I thought this place fell short.", "author": "Adam M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-08", "description": "Super disappointed when I ate here, just because of the whole experience.\nCleanliness.Decor: standard, 3/5\nCustomer service 2/5\nFood 3/5\nPrice: Cheap\nCame here from school with a 50 minute grace period until next class. Ordered one super burrito from a worker who was working alone.I ordered after a group of three men, and the wait time for their food was about 20 so i assumed my wait would be 30min. Lady worker comes in to work, to speed things up and she was doing it fast like a normal restaurant would. Only bad thing was that she made 2 burritos for some customers who ordered 10 minutes after me first. Highly disappointing because i was ended up waiting 35 minutes to then just go up to her and ask if my food was on the way, then she said what did i want.... I waited 40 minutes to get a burrito and the meat was pretty over cooked that it was like chips. \n\nHonestly i believe they usually have better experience but for me that day,  i was out of luck.", "author": "Innocent N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-26", "description": "I came during noon time and there wasn't many people. I ordered a taco and enchilada plate, which came in about 10 minutes. It also comes with free nachos and delicious salsa.", "author": "Vivian C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I go to school near here so this is my cheat meal once in a while ! Their burritos are HUGE, and delicious !! Any taqueria with a salsa bar and I'm sold ! Very delicious verde salsa ( yes that matters )  and home made pick de Gallo. The woman that owns and cooks the food here is so lovely she always asks me how I am doing and remembers my orders. Go here if your starving and need a huge burrito !", "author": "Lara C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-25", "description": "First time I got a steak super burrito. The flavor are okay it edible. The burrito was not rapped right enough steak was super salty.  Second time I got a beef tongue super burrito. There was no salsa in the salsa bar and they don't make their own chips. Super races place to go for a burrito. Taking crap about me in Spanish like I couldn't understand hand movements.", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "We arrived on May 26th (Saturday) after the normal lunch crowd and there was only another couple dining.  We wanted to avoid the weekday school crowds which other reviewers had complained about. The television was blaring a soccer game in Spanish.  The single woman working was also the cook, server, and cashier.  We both ordered super burritos (beef tongue and grilled chicken) which were reasonably priced. .  Free chips were provided.  Along the counter were a variety of hot sauces which needed to be refreshed.  Our meals arrived wrapped in aluminum foil.  Just like many other reviewers statements, the food was intermittently warm and cold.  The meat was warm, but the other additions were cold or at room temperature. It seems like they should have warmed up the entire burrito before serving.  Because of this, it might be better to take the food to go and warm it in your own oven.  Food was good and we'll probably return as it is difficult to find beef tongue in nearby taquerias.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Good place. I had a carne asada super burrito that was $7.50. Customer service was friendly. Overall I was satisfied.", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-01", "description": "Holy cow Ingleside, how salty do you guys eat. \n\nI love burritos! I have never struggled to finish my burrito before. It was THAT salty. I usually devour my burrito asap but I found myself eating the nacho chips more. Pretty ironic that I'm eating nacho chips to avoid saltiness.\n\nSo I ordered a super steak burrito with jalapeños. She struggled to grab a gigantic tortilla because it was sticking to the other tortilla. Finally she got it but it kinda ripped in the center. She put it on the grill anyways. \n\nThere's a bin of cooked steaks next to the grill. She just warmed it back up on the grill. I'm guessing they are so salty because that's how they keep it fresh? Anyways she end up giving me a super salty burrito with no jalapeños. \n\nThey do give you some nacho chips for free albeit all broken up. Free is free. They 3 salsa: the normal diced tomato n onions, Verde, and some red super watery salsa. I love the Verde salsa, for that I give it 2 stars.\n\nTl;dr: steak is too salty. Forgot my jalapeños even though she acknowledged it. Ironic that this place is called El Jalapeños. Salsa was good thus 2 stars. Would not come again. I rather order a burrito from Whole Foods which is comparable in price and only 2 blocks away.", "author": "wilson y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-26", "description": "I have been here a few times but I must say a few things.\n\n1) Depending on who is working will determine how well your meal will turn out. The owner lady makes the best burritos. Anyone else will not do. In fact, if she is not working I refuse to come here. Here portions for meat are perfect. Anyone else will put less and your burrito will lack flavor. \n\n2) The male owner will periodically be here taking orders. Just be patient with him because he can be disengaged at times. I have ordered food here before and he has missed parts of my order. Also, he can rub people the wrong way with his attitude. From time to time he can sound harsh when taking orders. If he does do this just raise your voice a little louder and speak even more clearly so that HE understands your ORDER! Include a loud noise as well because he tends to get distracted. \n\nMy last few points:\n\nMake sure to get your chips.\nTake as much salsa Verde as you want.\n\nAs for my order today. Good. The owner lady did a great job. You can tell she works hard and for that I appreciate her efforts. Not a fan of the guy! El es malo. \n\nThis is my warning to all as well as my words of wisdom!!", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "All I can speak to is their carnitas tacos, but that I can speak well to. The meat was succulent and so juicy. It had great flavor and perfect seasoning. Mexican Cokes, respectable hot sauce and I'll be back.", "author": "Mark B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "If you're originally from SoCal and looking for that same Mexican taste up north. This is it.", "author": "Alejandra F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-22", "description": "I've always wondered why Ocean Ave, although one of the busy streets in San Francisco lacks restaurant varieties. Having a strong hispanic population, you'd think that there would be a vast array of tacos and burrito places in this side of town. El Jalapeno if I'm not mistaken is the only Mexican joint this side of the city has. \n\nSo even if the food seems to be lacking, you can't help but settle and say that it's good although in reality, i's just okay.\n\nI also find that this place for what the overall; look, flavor, service and clealiness is quite pricey.", "author": "Jan R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "This place is pretty good. Like the lady that owns the place makes the best burritos, but it takes time to get our order since she's working by herself most of the time. I think it's worth the wait!", "author": "Nurf P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "1 star removed for service BUT there was only 1 person working and still managed to get food out quickly. Carne asada Quesadilla was huge and gave a ton of guac and creme on the side, carne asada Torta sandwich was great too. If I am by city college or over on ocean I will def come back. The lady working was not very service oriented, but she was cooking and taking orders at the same time- she did so very hygienically which was a plus, also the fact she had multiple people eating in there who 'paid after' was a pleasant thing to see this day and age in a restaurant without a waiter /waitress (reaffirming my hope in a society of trust, that wont skip out on the bills)", "author": "John O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "My favorite steak burrito. They use really good beef without the gristle making for a crispy perfect steak. Love the salsa verde and nachos as well. \nTry the chorizo. Steak burrito still my fave though.", "author": "Jorge R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-11", "description": "I had been here a few times now and the food is delicious. I went today and they were a little busy. After I ordered today I asked the cashier \"can you make that for here\" and then he responded very rude. The food then took so long to get here. Great food though. One of the best taquerias in the city.", "author": "Travis H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-14", "description": "Small Taquera, kind of dirty and worn, and in need of a makeover.\n\nI ordered a super carnitas burrito. Price on the board was $7.25. With 8.750% sales tax that should have been $7.88 but I was instead charged an even $8 - not a big deal but just know they are a little shady in that way.\n \nMy burrito was a generous  size -  lots of meat and the right amount of beans, rice, cheese, sour cream and guacamole. Unfortunately the carnitas was really salty. So salty I had to drink 2 bottles of water afterwards.\n\nThis is the best taqueria in the area. Unfortunately, it's also the only taquera in the area. I might give them another chance but will skip the carnitas.", "author": "Bumble B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "Super delicious Burritos. Their number one is a super with Carnitas or Carne asada! And of course the bean choice is Black Beans. :)\n\nI also love how nice the guy at the counter is and the lovely lady who cooks the food! You can tell it was made with love. \n\nDid I mention their crunchy homemade tortilla chips? It has just the right amount of crunch and seasoning on it.\n\nI will always stop by here from Vacaville", "author": "Miranda T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-01", "description": "I feel Taqueria el Jalapeno a solid Latin American restaurant for traditional Mexican cuisine. Although it's kind of a small location some of their foods on the menu are worth trying out because it comes with big flavor.\n\nWhen I come and visit this location I tend to get the super burrito or the quesadillas, they both taste really good. But just like most Taqueria's in the city, they offer the same main ingredients. The have the same choices of meat like: Carne Asada, Langua, chicken etc. I feel like what makes this place different is the comforting decor and the warm and friendly workers that are there. Another plus is the fact they have prepare the food on order right in front of you. No hidden kitchens, pre-prepped meals. A nice change of pace for once.\n\nBecause the location is on Ocean it's a chance at getting something different from the overwhelming amounts of Asian inspired good locations. Take a chance and roll the dice on this taqueria, you just might like it.", "author": "Donald W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "GUYS.  Why have Yelp reviews evolved solely into the superlative?  Is this the best Mission-style burrito in all of SF?  Go make your own list.  Work for Thrillist, or something.  Want Mexican in a super-sterile atmosphere with outgoing, friendly service?  It's called Chipotle.\n\n[steps off soapbox]\n\nTen of us trickled into this place around 3pm.  There was one woman behind the open grill.  She 1) made all of our stuff, 2) made it to order, 3) took an additional to-go order over the phone, and handled it all like a boss.  You probably think I'm kidding about this a la minute stuff, but we ordered two portions of guacamole and she disappeared into the back.  A few seconds later, we heard pounding.  Yes, she was pounding the crap out of that avocado to order.  \n\nOther notes, besides this cook's awesomeness: carnitas are to-die-for, portions are larrrge.  Telenovelas play on an old tube TV hung above the beverage cooler.  It's legit.  It's delicious.  Go if you're in the area, and stop worrying about who's the best of the best.  Your tummy will thank you.", "author": "Ashley B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-12", "description": "Takes a really long time. About 20 minutes for a plate of beans, rice & cheese. Don't think I'll come back here", "author": "Squally C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-28", "description": "I have now officially been here a full 20+ times this year. I love burritos and San Francisco restaurants definetly have a wide variety on how a burrito is made and filled. \n\nIt is frustrating for people to compare burritos from different restaurants because the only factor that can be compared in my opinion is freshness. \n\nWhat this place does is make a good burrito with lots of meat and value. \n\nFor $7 rounding up. I think it's a good burrito for the money considering currently average burrito is about $6-8. \n\nThe carnitas is bit salty sometimes but doesn't seem to ruin the overall experience. \n\nThe beef is okay I am not a fan. \n\nChicken  is good but chicken is a weak choice for burritos in my opinion. \n\nEl pastor is full of flavor. Sometimes too much liquid.", "author": "Nathan A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "Quick and solid to place to fill a burrito craving. I'll do takeout whenever I'm in the neighborhood. \n\nTheir grilled chicken and carne asada super burritos are standard. Nothing special. ($7)\n\nTheir shrimp burrito ($9) is a bit of a disappointment. Instead of taking fresh prawns and then grilling them like El Farolito, these were tiny baby bay shrimp and they weren't grilled. The flavor of the shrimp was a little off too.", "author": "Earl G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "The best Taqueria in San Fransciso hands down  Forget about El faralito this is super duper authentic and delicious !!!", "author": "Lewana K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-01", "description": "Tiny and weathered however the food is very good and authentic from what I can tell.  I'm just a white girl and not exactly a connoisseur of burritos but I have had many and this one was exceptionally delicious. I got the wet burrito and lt was ginormous.  I was only able to eat half and I was full.  The chips were ok and the salsa bar needed to be restocked.  I would eat here again.", "author": "G T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-09", "description": "Worst experienced ever! If you want a real Fresh Burrito? Go to SFSU cafeteria or Mission and 16th. It is worth the money there for a Prawn Burrito $9.00 with everything in it.\n\nThis Burrito place is my First and Last to eat here. The place looks old, unclean and disorganize at the time I walked inside. There only one person working. She handles food, cashier and chore at the same time. Look very wary from her works, from what I see from my own eyes, the black still in the hot water. Are those beans supposed to be cooked and out of the water already? Why the foods are pre-cooked here? It must be not enough customers and she is the only one who is an owner and work here. I suspicious the food could be the left over from yesterday. That's why she had to cook over again. It is a waste of money but food from here because I am not getting a fresh food.\n\nI ordered a Shrimp super, in my mind it supposed to be a good one. But apparently she had a big scoop of red color small shrimp on the grill. I noticed it won't be a good Burrito any more because it is not Prawns and beside they are not a normal size shrimp but just a baby pre cooked shrimps from a frozen bag which were sold  from any supermarket stores in froze section.\n\nThe burrito was very big but the tastes was terrible, it's all watery from the inside. It was so much water that it splashed at me on my clothes. I thought I was eating something else instead of a burrito, because there were a lot of juice coming out from it. I hate the taste from it. The tortilla isn't fresh and also the food itself, which i am Very disappointed from it.\n\nHer business is already bad and she is still  not honest with the work that she does. Where will it get her? Not far too I supposed. She just dig a deeper hole for herself. That's all I can say.", "author": "Jeremy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-17", "description": "I'm really disappointed I came by at 530 on my way home and they were closed , this is the 4 time in 2 months this has happened. They really need to change their hours if they're not going to stay open till 7 . I just want some tacos", "author": "Troy A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-04", "description": "Customer service is okay. Lady sorta snapped at my friend. We get it. Tacos are 2.68!!!!!", "author": "Michael T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "MUY BIEN!! QUE BUENO!! I may have taken 3 years of SPANISH but this is literally all I know. As my true fans know, Lashondraneeshaw doesn't give out 5 stars often but this taqueria be smackin. I usually order steak nachos or a carnitas burrito and they give you a generous amount. They dont skimp on that shit!!! They authentic, like you in Mexico authentic. It's kinda dirty there but that just adds to the whole authenticity of being in Mexico.", "author": "Lashondraneesha W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-14", "description": "This place is extremely slow because there's only one worker here. I would give it a 0 zero if I could. As the orders roll in, I wait extremely long to even give my order. After that, the woman forgets about my order and I had to wait 40 minutes just for two tacos. Everyone who ordered after me got their orders before. I wouldn't recommend to go here unless you have the whole day to waste.", "author": "Katie F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-14", "description": "Classic Mexican food. Delicious. But their hours are borderline rude. Also no horchata", "author": "Luke R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "In my quest to hit up all the restaurants on Ocean in the Ingleside, I stopped by for some mexican food on a saturday afternoon. \n\nI noticed that many of the customers are frequent patrons because they know the owners. The lady who cooks is very nice but her husband, the one who opens a big bag of tortilla chips from Costco and warms it up and works the register - not so nice. According to the husband, they have been in this location for 10 years. Way to go! \n\nOnto the food..\nThe hubz and I spilt a \"Super Burrito\" which was humongous! It's a big burrito with sauce and cheese slathered on top. You have to eat it with a fork and knife. Classy right: :) .. \n\nI also ordered the homemade horchata which was really good, and an order of tacos to go. The tacos were tiny. Probably because I compared it to a ginormous burrito?", "author": "Nancie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Been going here for years. Consistently good. The lady who works here is my hero. Also, you get to watch spanish soap operas while you wait.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-25", "description": "Small, friendly and quick. You can tell it's going to be an awesome taqueria because the sign is ugly and dilapidated. This is the best taqueria in the area. I did not enjoy Ocean Taqueria, and the next good one is the superior Taqueria Guadalajara.\n\nShort walk from City College; longer walk or bus/Lyft hop from SFSU.\n\nNot much else to say. It's not the best in San Francisco, but nothing in the neighborhood really compares, and it's better than anything I've found so far in Sacramento. Oh, the sign says \"100% FOOD MAKE DAILY\" so that's pretty rad.\n\nIf you're looking to have a couple drinks, take your burrito down the street to Randy's.", "author": "Jason M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "I have been going to The Mission since the mid-80's for my burritos.  And to be quite frank, nothing else was ever good enough.  It must have been the combination or ambiance, cultural flavor, decent prices and delicious food.  Sounds fair too me.\n\nBut then I discovered a burrito shop near my house.  I figured that I would give it a shot.  Its not the first time I ventured away from the Mission taquerias.  So I was not expecting much more then \"ok\".  Well, I was overjoyed and content with the quality of the food and atmosphere of the restaurant and neighborhood.\n\nThe quality is just as good as the other taquerias over the hill.  And the vibrant Ocean Ave doesn't make it boring to eat and look out of the window.  Afterall, you got the MUNI trains and buses running up and down Ocean Ave.  The SFFD Station 15 is a few blocks away and it always offers a thrill to watch them fly down the street.\n\nAnd inside is Mexican television and a taqueria feel.  I like this place for either sit in or to go!\n\nMiguel", "author": "Miguel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "This place is awesome! The service was great, I had a Carne Asada Burrito and it was spectacular! \n\nAll you Booshie ass San Francisco Hipster idiots saying that the place is dirty and run down. Ummm... if you know anything about Mexican Taquerias, then you would know that \"Hole in the wall\" places like this have the best food. Keep your ass going to Chipotle if you want your shitty clean food.\n\n5 stars to this place!", "author": "Jasper L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "I have been eating here since I was a little kid. The lady recognizes our voices on the phone and already knows our family order. Always delivers the same quality and I love the salsa so much. This is not a fancy restaurant and it's not fancy food, but it tastes great, and it's always nice to go in to pick up the food and see the super friendly lady and watch the Mexican soap operas on the old TV.", "author": "Julia R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-15", "description": "I was just coming out of San Francisco Public Library - Ingleside Branch today feeling very hungry. Next moment, I walked over to Jalapeno and here I was getting something to eat. I came in here today ordering a Chicken and Cheese Quesadilla Suiza with a bottle of Jarritos Mandarin Orange Soda, the total for both items came out to be $9.43 so this meal is worth the money being spent here. The customers are generally students from City College of San Francisco and Archbishop Riordan High School.\n\nGuacamole and Sour Cream are common toppings used by most other Taquerias. My plate of quesadilla had guacamole and sour cream on the side as well. Their burritos, tacos and nachos are something which I have yet to try the next time I pop in for some Mexican Food. In addition to Taqueria El Jalapeno which I just visited today, I've been to:\n\n- Cinco De Mayo Taqueria\n- El Faro\n- El Farolito Taqueria\n- Jalapeno's Mexican Kitchen and Grill\n- Taqueria Vallarta\n- Rubio's Fresh Mexican Grill\n- Gordo Taqueria\n- La Corneta Taqueria\n- La Parrilla Grill (THE LOCATION ON OCEAN AVE BY CCSF MAIN CAMPUS IS CLOSED)\n- Ocean Taqueria (CLOSED)\n\nThese Taquerias are the one stop for me to satisfy my cravings for Mexican Food when I don't feel like eating anything else. Overall, I had a pleasant first time experience here at Taqueria El Jalapeno today so I am definitely coming back next time!\n\nACCEPTABLE FORMS OF PAYMENT: CASH / CREDIT CARDS / DEBIT CARDS", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "I'm a big fan of burritos and this place meets my standards. For less than $8 the burrito will fill you up for sure. I haven't tried anything else on the menu except the super burrito. \n\nI love it because its convenient for me and the lady who works here is nice. I always order politely with a smile and she replies back nicely as well! \n\nThe only thing I dislike about the place is that the chips aren't really that good =\\ and the sauce station isn't that great and appealing either, compared to other taquerias.", "author": "Darrell N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Burritos here are amazing!\n\nUsually gets filled around lunch time due to\nThe students in the area but food is prepared in no time. If there is a line, i usually run to fill up on sauces due to the fact it runs out fast.\n\nBurritos are always a meal for the whole day.\nFilled high with you choice of meat without having to pay extra for meat. \n\nI just wish the Carne Asada would be made to order.\n\n8/10 in my book.", "author": "Arturo T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-04", "description": "For people who like to wait only. If it's any different next time I visit I'll update this review, but it's a SOLE proprietorship, which means I waited almost half an hour for a burrito. As did everyone else. Some people left as they walked in, smart. The food is fine, even though the overworked woman screwed up my order and forgot the salsa and cilantro in the burrito, so that combined with an overabundance of rice and beans meant a dry burrito. The carnitas were excellent, crispy and flavored in an goodly portion, so I'd get them again but ask for very light rice and beans, and make sure the veggies get added. But only if I'm in no hurry and want to chill for an hour.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "I was walking towards Ocean Ave. It's the one place that I could possibly get some Mexican food. I ordered a beef burrito regular size. Seems very dry. It's not that cheap. But the lady behind the counter is super nice.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-15", "description": "El Taqueria Jalapeño banks on the fact that this section of Ocean Ave has no proper taquerias. El Taqueria Jalapeño sold me a burrito de cameron  (shrimp burrito). However, the shrimp was bay shrimp. Come on! I'm so glad I didn't nonchalantly throw a buck in the tip jar.", "author": "Adam H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "I go here a lot, as it's nearby. The tacos and burritos are always awesome. The beef is pretty much always delicious. A lot of times there's no one immediately visible but she usually comes out if you're patient. It's a very relaxed atmosphere.", "author": "Sean M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "The carnitas made me do it.\n\nI've had two burritos from this place, both carnitas, and the pork is just fantastic.  It's perfectly salty, it has crispy edges, but inside the crisp it's tender and moist.\n\nLike another reviewer I observed, I, too, found the gentleman who works here to be less than friendly, and he also messed up an order of mine once.\n\nTo ensure the best experience, I keep my visits to when the place isn't very busy, and I stay close to the kitchen so I'm available when they ask questions about my order.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Definitely deserves a solid star increase after my last trip here.  Got the enchilada & taco combination plate.  The sauce on the enchilada was a total winner - very fresh and delicious.  The taco was good and came with guac on the side.  \n\nI'll be going back again for another round soon.", "author": "Brian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "Have always had a positive experience here.\n\nBurritos are perhaps my favorite in the city. Perhaps...\n\nFood is flavorful and doesn't take a long time to be prepared for you. One of the ladies there is really sweet and we always converse in Spanish.\n\nPrice is well worth what you get.\n\nHorchata being a bit syrupy and thick is my only issue with the place.", "author": "Alejandro T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-03", "description": "Just a block away, when my craves kicks in my go to default is super nachos w/ everything on it, black bean, lengua meat.\nAnd the beautiful lady serves extra portion too, total satisfaction.\nWish it would open on Sunday's.........", "author": "Kru X."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "I was expecting more given the reviews.\n\nI got the Super Carne Asada Burrito on a Friday early evening\n\nMeat: Too Salty and overcooked and tough\nService: Slower than most other Taquerias, I even think she used a microwave to prepare my burrito.\nCleanliness: Seat was a bit sticky and, but overall not horrible.  Still could be a little cleaner.  I don't have high standards for Taquerias.\n\nI will not comeback to this place, my burrito sucked and my friend threw his away.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "The super burritos are amazing! I had to limit the amount of times I eat here each month now that summer is almost here, because even when I promise myself I'll only eat half, it's so tasty that I never keep that promise", "author": "Elise S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-02", "description": "Food is alright, but the service takes forever. Just hire one more person...the poor lady at the counter is cooking, checking people out and cleaning.", "author": "Alex A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-20", "description": "Food: Their pico is surprisingly very good. The burrito had a little too much rice imo. \"Not as good as it looks\" my brother says of his super burrito with al pastor. \n\nService: It was lunch and just a man and a woman working behind the counter. The man took orders but he seemed kind of rushed. \n\nOverall good and satisfying experience. Try the pico.", "author": "Samuel J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-30", "description": "Came here about two days ago nd enjoyed it. \n\nFirst off, this place was pretty nice - each table had a vase with beautiful flowers on it nd tha place was empty when we came, it looked pretty clean nd maybe it was just a really LOVELY day but oh wells, i still liked how this place looked compared to OTHER taquerias. Tha lady working was by herself but she was really NICE nd prompt. \n\nShe BROUGHT us all of our orders at tha same time to where we were seating. My order came out perfectly but i do wish their super burritos came with lettuce =/ I ordered a Super Burrito w/ Carne Asada nd asked her to cut it in half :] Tha chips were ok (squeeze some lime over them, genius whoever thought of it aka for now: Kristy) nd tha sauces are self-served so we helped ourselves to tha fresh salsa which was good. My burrito was delicious nd it wasn't too big or too small. It got me full but not BLOATED which i really liked. \n\nOverall, i had a pleasant first experience here nd would most def. come again!", "author": "Michael N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "I used to live on Capitol, and this was my fail-proof hangover cure. Their carnitas super burritos with refried beans are to die for. Their carnitas are perfectly crispy on the outside and tender on the inside, and it's like home-made food- you watch as the lady fries up your meat/ tortilla/ beans all separately. Very reasonably priced but I gotta say their hours are a little funky. Still love it though!", "author": "Natalya C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-01", "description": "WARNING:  STAY AWAY.  DISGUSTING!!!\n\nWe used to come here frequently. The quality of the food here has been going downhill for a while. A couple of days ago, we ordered three \"Super Burritos\" that were regular-sized. We each ordered a different type of meat. All of the meat was burnt! Charred black. The meats were inedible. \n\nWhen I called to tell the owner about the burnt meat, he said that it was grilled. He also claimed that people like it burnt. I tried to explain, but he insisted that many people prefer their meat grilled. I guess grilled and burnt are the same thing in his vocabulary. He was very defensive and had an attitude. Come to think of it, he has never been friendly anyway.\n\nHe helped us make the decision to never go back to his restaurant ever again.", "author": "S M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "The food here is good. However, service is extremely slow. Took 30 minutes to get my quesadilla but that may be because it's only run by 2 people.", "author": "Reymark R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "Terrible. It took us almost an hour to get 2 burritos both of which were cold, soggy and barely edible.", "author": "Patricia F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-05", "description": "Came here and ordered a regular Carne Asada burrito here a few weeks ago. For the price, the burrito I was eating filled me up. The beef was seasoned enough. Your order also comes with a side of chips. I didn't have anything to complain about on the food. Maybe I was just too hungry to really care.. The place is convenient for a quick bite. It wasn't overwhelmingly busy.", "author": "Tony C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-07", "description": "Taqueria El Fail..\n\nThe tacos weren't that great and were pretty bland. Basically just two warmish tortillas topped with some meat. THAT'S IT. I had to engulf it with the salsa from the bar to actually give it some sort of taste.. But speaking of the salsa, they do give you free chips so I'll give em' that.\n\nBut no Horchata or even a Restroom? WTF..", "author": "Albert L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-07", "description": "I ordered and the guy just stared at me and laughed. Talk about uncomfortable. I just wanted a breakfast burrito without chorizo - seemed simple enough, but I guess warranted being heckled. Ontop of that, they threw chorizo on the grill anyway and I had to interject to make sure it wasn't for me--which it was, for some reason. So they had to throw it out, and as I was leaving he hit me with \"We made it extra special for you\"... K. Threw it out. Minus $14. Never coming back, 1 star, GG.", "author": "Mike T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-01", "description": "It's a mom-and-pop taqueria.  In some cases, mom-and-pop resturants are great because of the food quality and sincerity of staff.  El Jalapeno has the latter but not the former.\n\nCoherence: I always order a simple burrito.  I'm used to taquerias differentiating  between a 'Regular' and 'Super'.  El Jalapeno doesn't, not in their menus or when they took my order.  Had I known, I would have shouted 'No cheese and sour cream', even when I order \"regular(s)\".   \n\nIngredients:   As taste would hint, I gather their food has preservatives or been idling in their fridge. Food tastes like that from a food bar at your local Safeway.  Is it digestible?  NO!   Is it delicious? NO!  Even when I'm starved, I can't finish a single order.  I've also sung it back up.  These are always clear markers that somethings wrong with the food.  Another clearer indicator would be their chips.  They're not fresh and thin but rather more like a stock you'd get from a bulk bag at Costco. \n\nPrice: Its all affordable but kinda odd.  The merging of sizes/ingredients isn't to my economical advantage.  Whether it be a 'Regular' or 'Super', the price comes out to a mid-range between the two.  This is compared to a Mission-district taqueria where a 'Regular' usually runs under $5 and a 'Super' goes for $7+.  \n\nAmbiance: Are the facilities cleanly? Fairly.  The tables and chairs don't seem like they've been wiped down after every patron but my toosh and arms weren't tainted by hidden remnants.\n\nService: Are they friendly?  Yes?  They've never botched my order and don't talk to me like one in an assembly line of customers.  \n\nConclusion:  Although its a family business; sometimes their teenage kid gets put on register duty, they're ultimately a restaurant.  Unfortunately, making my own burritos tastes better than what they sell.  I dont cook that well!", "author": "Honest J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Every Mexican establishment in San Francisco wishes their burritos were as good as the slices of heaven served on a plate here. I'm a burrito enthusiasts and in my entire life of living in SF a burrito has never tasted as good as they do here. New favorite Mexican place found!!", "author": "Joseph P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Really yummy! There was one women there when we went in and she cooked three meals for us in maybe 15 minutes! I couldn't believe it. It's more of a taco shop but that's perfect and on top of it, they have hot carrots.", "author": "Kimberly M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "i ordered a grilled chicken plate about $10/$11, $12 dollars with a snapple.  I would give them 4.5 stars if i could\n\nThe chicken was so G O O D! it was juicy and not dry with seasoning and great flavor! The beans and the salad were also good, and they serve tortillas in a traditional mexican tortilla warmer. this surprised me since other places wrap them in foil, but was a great plus.\n\nif you are in a hurry this is not really your place.\nThey make your food when you order.\nThey bring the food to you if you're eating in, and they pick up after you.\n\nnice decor, fresh flowers. they also watch spanish television shows.\n\none star off for the rice- it was a little dry and their tortilla chips are store bought, even though she offered them instead of me asking.", "author": "Viri D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-03", "description": "As a Mexican food fan I wanted to give this place a better review buy honestly it wasn't good. Carnitas was way too salty, like crazy salty. Salsa tasted funny, not fresh. Place was filthy, dirty dishes all over the tables, smelled off, mop bucket in clear view of customers. Owner had a piss poor attitude and was not friendly. Avoid this place", "author": "Phillip F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-07", "description": "Worst 'Mexican' of my life. I ordered a shrimp burrito and a pastor taco. I put in a dollar in the tip jar cause it seemed as though the lady understood. When I was walking away with my to-go order I found that they had given me a shrimp taco and pastor taco. I was seriously disgusted when I found the shrimp were measly little nothings with poo veins in tact. YUCK! The shrimp were also opaque like they weren't even cooked and they smelled like fish. The pork was dried up like it had been refried from when it was cooked days before. If refried dog had a taste, this would be it. \n\nBecause of my experience here, I am now even considering being a vegetarian.", "author": "Siren G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-02", "description": "A nice little convenient place to get my burrito fixings when I don't feel like making a trip down to La Corneta in Glenn Park.\n\n\n\nThe couple that works there are pretty friendly. Super burritos, hearty in size, with everything for $7. All you can scoop chunky salsa (don't worry, they have all the other condiment stuff there too) which is always a plus for any Mexican spot for me.", "author": "Annie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Great place to go too if you need a good fast burrito if you're in the area.\n\nNothing ever goes to waste.", "author": "Jacen W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-28", "description": "Yeah, no thanks. \n\nWalked in on an empty restaurant and was promptly ignored by the owner who was sweeping in front of me for 5 min. No greetings, no hello. \n\nSorry, I'm a paying customer  and there are plenty of options out there. This is SF after all. A courteous, \"HI, will be right with you after I sweep up these rat droppings and lemme not wash my hands then I'll be ready for you\",would've been great. \n\nEh, mebbe his food will make up for his lack of customer service skills, I thought.  Ordered the shrimp burrito, regular.\n\nNo, it didn't. The shrimp were the size of sea monkeys you ordered by adding water to it.  Seriously, so small that you couldn't taste shrimp. It would've been perfect if my burrito were 2 inches big(that's what she said).\n\nScrew this place. I'd rather go to Baja Fresh or Taco bell. All mom and pop shops should NOT be patronized. \n\n1 star for decent salsa. \n\nThe only reason this place is in business is because of the half-starved kids from CCSF and you know how sharp teenager's tastes are.", "author": "Bill N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-05", "description": "if you like shrimp tacos or burritos DO NOT COME HERE.\n\nThe shrimp is as small as the shrimp you find in your cup of noodles for 99 cents at Walgreens. It also smelled fishy, rather than shrimpy.\n\nI'm sorry guys, but I LOVE shrimp, especially in any burrito or taco I order, so when the main ingredient in my dish isn't right, I am sad. And this place made me really sad.\n\nAt least the chips and salsa sorta made up for it.", "author": "V V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-25", "description": "If you have been in class all morning,and craving for a big meal close-by, this taqueria is good enough. It is a small taqueria, with few seatings and tables, and it can get crowded during the semester.\nThe burritoes are good with affordable prices. I like it for convenience,and close to the City College Campus.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-07", "description": "I moved out and didn't look back. However, I went to visit my parents and I drove past this place. My mouth watered.\n\nI miss this place. I live a city away but man, it's worth the drive. \nThey definitely live up to their name.\nYou want it spicy!? You'll get it.\nTheir little salsa stand inside makes me so happy. \nBIG CHEAP BURRITOS!!!", "author": "Susy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-20", "description": "Average. The shrimp burrito isn't good. Uses tiny salad shrimp.  The pollo asado was much better than average.  The cuts of beef and chicken were both very good.\nAlso, there is no bathroom for customers (despite the fact that many people eat-in), so just be warned.", "author": "Chris A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-07", "description": "After school, my boyfriend and I ordered vegetarian tacos and nachos to-go. The tacos were pretty small and boring. I wasn't sure if it was one taco or two since all the toppings were placed on top of two tortillas (see picture). The nachos were very very very soggy due to the huge piles of beans, sour cream, and guacamole topped on it. It needed less beans and more cheese. Service was quick, but food isn't the best.", "author": "Priscilla W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-10", "description": "I ordered a burrito from them expecting it to be finished in 15 min at the most. After seeing other people get theirs first I began to wonder about mine. The cook just stopped cooking and I realized they never made it! I felt like they just stole my money. If the other lady didn't come back I would have no way of proving I paid for it. What an outrage! They even stepped out for 10 minutes. 32 minutes later I finally got my burrito. When I got my chips I was also disappointed because they ran out of salsa such a basic thing. And they no longer make their own chips, now its bought. As a long time customer for more than 10 years I was very disappointed with the service and will likely avoid this place.", "author": "Alex C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-01", "description": "First time going there aaaanndd my last. \n\nThe guy taking my order had the worst attitude. The place was kind of loud and it was kind of difficult to hear him speak. He rolled his eyes at me. Terrible customer service. \n\nI bought a super burrito. The rice is too dry for my liking. It taste like microwaved rice. The food was ok overall. \n\nThe place is tiny but it's in a good location. \n\nI'm not going back there again. Food was ok but customer service kills it for me.", "author": "Vincent C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-10", "description": "5 minute walk from school!\nAll the workers are super nice.\n$6 for a gigantic veggie burrito!\nThey have a plate of roasted jalapenos but they weren't spicy at all. \nOr maybe my spice tolerance is just really high.\nDefinitely coming back though!", "author": "Justine L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-19", "description": "THIS PLACE OMG.\n\nI'm from San Diego and this is the best mexican food in the city I have found in the 3 years I have lived in SF.\nI ordered a burrito and the meat was delicious and well cooked, the guacamole was FRESH (not from a can), and everything about this place was delicious.\nHighly recommend & will be returning.", "author": "Sydney P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-19", "description": "OK.  I tried this place today.  Here's how it went:\n\nThe first thing I saw was a sign next to the salsa bar telling people not to get salsa unless they're ACTUALLY GOING TO EAT IT.  Now, I can understand the owner's frustration with food waste, but the sign makes for a less than inviting atmosphere.  \n\nI ordered a regular burrito with carne asada, refried beans, no salsa, no tomato.  The menu says a regular burrito includes onions, cilantro and salsa, so I said again, onions and cilantro are OK, but no salsa, no tomatoes.\n\nMy first bite?  A huge mouthful of salsa.  EW.  \n\nSecond and third bites were big pieces of carne asada--well, mostly fat with a bit of steak clinging to it.  I tossed both of those bites too.  And my order was to-go, so I didn't go back and get it done right.\n\nThe rice and beans were pretty tasty, and at least 3/4 of the carne asada was actually meat that was also pretty good.  So the food itself is actually decent.  And the burritos are regulation size.  But, you know, I'm only happy with decent food if I actually get what I ordered.  \n\nI would suggest that Taqueria El Jalapeno place develop a most customer-focused approach.  And if they don't want people to waste salsa, maybe give out individual portions at the counter upon request.", "author": "Lorelei S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Great local burritos. I can walk here, so that may bias me, but this is much better a burrito than some of the more *hip* places I've been. I love the pork super burrito right out of the foil.", "author": "Nadia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "I don't know if I was just hungry from studying or what but I ordered a Super Chicken Burrito from this place and it was the best I've ever had. I eat burritos all the time from many different restaurants and this by far was the best. Their chicken is really juicy and they grill it when you order it so its hot and fresh. Its 7.20 (tax included) for a super burrito and its pretty large in size. I shared half with my sister and I was completely filled up.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-19", "description": "Giant burritos. Free chips and salsa bar.", "author": "Patrick S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-13", "description": "All right, so things were going great. My chorizo quesadilla was delish and I was loving the free tamatillo salsa with chips. And I mean seriously loving the salsa. There were little hearts and stuff flying around as I gorged myself on a second helping... and then of course right after I finished eating all of said salsa I saw the guy that worked there take a container of salsa from a cleared table and pour it right back into the main container. WTF. I don't know if the couple there before touched the stuff or if they double dipped. Heck, they could have gone all American Pie on it for all I know. (Ok, that may be a bit of an overstatement, but you know what I mean.) Ugh. =_=;;", "author": "G C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "A decent place to eat for City College students but I wouldn't go out of my way to drive and eat here. If you're on a low budget, get the tacos, they're filling and satisfying enough. It wasn't really tasty but I rather spend four dollars here than at McDonald's. If you're hungry Everything basically comes with a side of tortilla chips which is nice. If you're a big boy and want a big kid's meal, then go for the burritos - it's more than enough food, roughly the size of your forearm.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-15", "description": "I really hate to do this because the first time I ate here I thought it was a decent place considering it wasn't in the Mission. HOWEVER I just ate there Friday March 9, 2012 and THERE WAS A PIECE OF GLASS in my freggin chicken burrito!!! Longer than an inch WTF then when I told them about it, theywere extremely rude and called me a liar! \nNEVER EVER again will they get another dime out of me.", "author": "Honest B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-13", "description": "The tacos are very good and the regular burritos are so big so it's not necessary to get a huge one but overall some good authentic mexican food.", "author": "Henry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-06", "description": "Very clean and staff is very friendly.\n\nIf you are in a hurry, this not the place.  They make everything as you order and its fresh.\n\nI highly suggest the Fajitas mixtas..yummy!!!!", "author": "Anthony Xavier S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "Me puede tener un burrito regular de carne asada por favor?\n(I really should've gotten al pastor, cuz that shit was hella marinaded in delicious like Angela Davis' Afro) \n\n**Crunch** **Crunch**\n\nWhy the fuck is there bacon all up in my burrito? The day shit turns out right...it was the fuckin day for tears...\n\ngood enough for three stars...will come back and try other shit.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-26", "description": "The food is good, although there isn't aren't other taquerias on Ocean so you're kind of stuck with thus place. The best: Pastor, the worst: the Spanish Jerry Springer type show blaring on the TV every time I go here.", "author": "Michael D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-09", "description": "3.80 stars.\n\nThis place makes very good and large burritos! I usually get the steak super burrito and use their hot sauce. I also like their super quesadilas (am I spelling it correctly? probably not, my apologies). Oh so yummy! Beware of food coma, because you WILL get it. They cook the food very fast too. The last time that I've came here, I got very thirsty after eating the salsa chips and a super burrito. Not sure if that was due to the chips or burrito, but it's a big turn off for me if I get really thirsty after eating (b/c of the salt or MSG, or both).\n\nAlso, the place has a fairly decent size seating area, but I wouldn't recommend eating here with more than 4 people if there are other people in the restaurant. \n\nOverall, I recommend this place.", "author": "Sam W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-12", "description": "Yuuuuuuummmmmmy!!!  I *REALLY* like this place!  \n\nTaquerias are a dime a dozen around here, and often sorta interchangeable, but Taqueria el Jalapeno stands out.    We eat here, often (2x+ week) !  The food is really good, fresh, and high quality; and unlike your typical San Francisco taqueria, Jalapeno's is SUPER clean inside.  The seating is comfy enough to eat there.  The staff is very friendly.  \n\nThe two carne asada taco plate kicks some major ass.  I LOVE the enchiladas.  The other day, my boyfriend was simply drooling over his torta.  \n\nYou can tell that the owners really give a damn about the place.  It shows!", "author": "Amy A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-26", "description": "carnitas (fried pork) torta with all the fixings (sour cream, guacamole, lettuce, tomatoes, onions,) on a crusty white roll.\nthe whole sandwich is grilled and served hot.\na street stand style mex sandwich which was very tasty.\nbest $5 sandwich on this street for sure!", "author": "Jeff W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "Very good super burrito! I loves the carne asada and it was really cheap as well coming to about $7. Also comes with free chips and salsa bar. I also tried their super quesadillas which was also really good for a quick lunch when your craving Mexican", "author": "Derrick I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-17", "description": "I found this little gem through some friends at City. Man they were on the money. I ordered a super burrito. It was fat and juicy. The other half later on tonight was even delicious. I am definitely coming back.", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "SO GOOD!  Delicious and filling platos de carne asada, carnitas, coctel de camarones, fantastic pico de gallo, also horchata and aguas frescas.  Often it's run by one tiny and very nice lady who runs the register, prepares and serves the food, and takes to-go orders by phone, all by herself!  This place is a great local taqueria.", "author": "C P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-05", "description": "I give it a 2.5(but to be nice and help their score, I will make it a 3) Sadly my search for an awesome taqueria that is close to my house continues..I was hoping it would be this place but alas, it is not. The guy at the counter was not very nice, but not rude..but close enough to being rude to make me cringe a little. Leo and I both felt the same about the guy...I ordered a super veggie burrito para llevar (to go). Ok, first I must say I LOVED their salsa at the salsa bar. I wish I brought more home because my burrito was pretty boring.\nAt La Corneta in Glen Park their veggie burrito is filled with all kinds of yummy veggies..zuchinni, corn, carrots, etc. But their tortillas are super doughy so that is why they have not won my heart. OK, back to the El Jalapeno burrito, my super veggie was nothing but rice and beans. Unless you count some wilted lettuce as veggies... MY VEGGIE BURRITO HAS NO VEGGIES, DAMMIT!!  I have rice and beans at my house. I could have saved myself $6.\nLeo has not eaten his yet so the jury is still out on his carne asada burrito. I am not expecting any miracles. The miracle will be when I finally find my hidden taqueria gem amongst all these impostors.", "author": "celene m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-04", "description": "Is this the best taqueria in the city? Definitely not. It is, however, the best one in this terrible, forlorn quadrant of the city. If you find yourself stuck in or, like me, are even more unfortunate enough to live in this miserable part of town do yourself a favor and get the best burrito you're going to be able to get without having to go too far from home. If you live outside of Ingleside/Ocean View, however, you probably don't need to be worried that you're missing out.\n\nJust a good, solid local place run by people who work hard and serve up excellent food.", "author": "Mark S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-10", "description": "The ambiance is great but the food is not. I'm pretty sure it made me sick after eating one of their burritos. I highly recommend NOT going to this place and going to Ocean Taqueria instead!", "author": "Landra S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "Best burrito place in the bay! So delicious, so consistent, and so conveniently priced for soo much food! The bf n I have been coming here for years, it's almost an addiction at this point. When city college isn't in session n I don't travel on ocean ave very often I literally have withdrawals! my taste buds won't let me go three months without jalapeño it's a must have!", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "This spot is so convenient for CCSF students (even those who go to State ^_^). It's like 2 blocks from CCSF and of all the years I've lived off of Ocean Ave. this is the best Taqueria you'll find. It's my other choice other than El Farolito's off of 24th and Mission. Both share the same level of quality. This wife of the owner is real friendly, you get free chips which is cool, and the prices's are reasonable (just a little bit more than El Farolito's). There's really no parking around it though but you'll eventually find some. If you're taking a stroll through the neighborhood, definitely check out this hidden gem. Peace. =)", "author": "Aaron F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-30", "description": "GROSS! I got a shrimp burrito and the super nachos and bother were disgusting. The burrito consisted of bland rice (no spices added at all) as well as boring refried beans with absolutely no seasoning. The guacamole was watery and tasted like it came out of a package. The tomatoes in the salsa were not even ripe yet and were mostly a pale orange or green (and the salsa was also pretty tasteless). The shrimp were the same tiny nasty shrimp you find in cup of noodle or cheap Chinese fried rice and they and the nerve to charge extra for it. The nachos were just inedible and they put all the beans on the bottom and the chips on top of them! Anyone who likes this place has never had real Mexican food or at least been to a taqueria that caters to Mexican people. I will never ever go to this place again. A complete waste of $15.", "author": "tahira a."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-03", "description": "Try the super tacos with lengua (dine in). Really good, reasonable price, and plentiful. Two will fill you up.\nThey can be a bit slow if there's a couple of orders ahead of you, so make sure you're not in a hurry.\nParking's not too bad either considering the location.", "author": "Adrian Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-21", "description": "Delicious! All things that were good:\n\n- Chicken grilled up right in front of you.\n- Black beans\n- HUGE burrito\n- Cheaper than average - $4.75 for a standard, and they accept credit cards\n\nOnly the lack of tortilla options (flour only) prevents this place from five stars.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-29", "description": "Not bad, a little pricey but in the prefect location if you are near CCSF or far down on ocean.\n\nNot worth a special trip but if you are in the area not bad. \n\nReally nice people and service.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-11", "description": "This taqueria has changed hands many times since I was a lad going to city college.  It is now Taqueria El Jalapeno and it is probably best taqueria on this section of Ocean.  Used to be better, but the quality is somewhat inconsistent.  \n\nOn a good day, you have excellent meats and well cooked rice served in huge portions.  On an off day, the meats may be dry and the rice may be stale.  You do get free chips and there is a little salsa bar left over from the previous owners.  Still, the best bet for a burrito in this neck of the woods.", "author": "John L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-20", "description": "I was excited to move back to my old neighborhood. I read all the reviews and decided that my first burrito should come from here. No dice. I show up during the advertised hours only to find them closed. More than once. \n\nOK. I finally chance upon the place when it's open. My order is taken by a kid. Literally, he was about 10, and playing video games at the counter. But that's not where it all went wrong. He handed the slip off to a woman who started to assemble our burritos. My partner's Super Chicken was fine. My Regular Carne Asada was promptly anointed with guacamole, although I explicitly said that I want none of that. You see, I am deathly allergic to avocado. \n\nThe woman (operating with her bare hands the whole time) picked the large bits of avocado out of the nearly-completed burrito. NO! No, I scream! I am allergic, I can't have any, I'm not kidding. She picks a few more bits out. NO, I say. She plops the just-grilled carne asada onto the green mess. NO, I say, I was serious, I can't and won't eat this. She throws the burrito away and... disappears into the back room. Finally comes back and assembles another burrito - rather stingily, I might add. Barely stopping when I scream NO HOT SAUCE!\n\nOh, and did I mention the salsa bar that only contained limes and radishes?", "author": "Lina B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "Only ate here once and had their salsa, veggie taco for $3, and pre-packaged chips.  I was surprised at how fresh the ingredients looked and tasted.  I liked the ma n' pa feel of the place...and it was clean and comfortable.  Glad I skipped over the chain-taqueria a couple of blocks closer to CCSF.  Most patrons had burritos--I'll come back for one next time.", "author": "Kim T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-21", "description": "I don't remember ordering a rice and lettuce burrito, but that's what they gave me.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "Just stopped by today for the first time and had a super burrito.  I thought it was really good and reasonably priced.  I chose to have my burrito with al pastor, refried beans and being a super burrito, it had cheese, sour cream and guacamole inside.  That's risky to me since a pet peeve of mine are the cold spots and/or glops one gets in burritos that don't have this extra stuff spread properly.  I'm happy to report everything was very well assembled.  I will be back for sure.", "author": "Kirsten F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-11", "description": "You all know what a Wet Burrito is. It's a regular burrito covered in enchilada sauce or whatnot. El Burrito Express does it well. Taqueria la Guadalajara has perfected this craft. However, I don't think Taqueria El  Jalapeno understands Wet Burrito, or even Taqueria in general. They covered my burrito with Campbell's tomato soup, or maybe a generic off-brand tomato soup. Also, when do you EVER put parmesan cheese into Mexican food. Yes, my wet burrito was topped off with something that you top pasta or pizza with, parmesan cheese. It's not even the packaged or shredded parmesan either, it was truly the Kraft shake bottles you buy at Safeway. What's the matter? can't drop a couple more dollars for some shredded Monterey Jack or Cheddar? Drive a little bit more, get to Glen Park, and live in pure bliss.", "author": "Chris L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-07", "description": "i really like this place cause its the closest taqueria by my house. it is literally a couple minutes away from my boyfriend's house. so we usually just walk down there.\n\nthe lady  always fucks up our order. not all the time but on some occasions. today, i ordered a superburrito with re-fried beans. she gave me pinto beans instead.  one time i ordered chicken. she gave me beef.  but i still like the place.  oh and they dont give you chips unless you ask.\n\nocean taqueria is a couple blocks down. their burritos taste better. =)", "author": "B B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-26", "description": "So, I was working in the city one day and had a craving for..........PIZZA. Hold on this is all going to make sense. Just give me a minute. Let's see where was I ? Oh yeah, so I was trying to make it over the bridge before traffic and I was cruising down Ocean and saw a pizza place with a parking spot right in front. This was sweet. I was damn near grinning from ear to ear. I'm not sure if I was happier about my parking spot or that fact that I was about to down a couple slices. As I stroll in I ask the guy at the counter what kind of slices they had available. Apparently I had found a slightly more upscale pizza joint that only served whole pies. My grin quickly disappeared. I thanked him and explained that I was in a rush and didn't have time to wait for a whole pie. Feeling rejected I walked back outside only to see my truck parked right in front. What a waste of my parking karma. Not helping matters my stomach began to grumble. So I had to find another place to eat. \n\nThen I looked up and dead ahead there it was Taqueria El Jalapeno. It was Glorious! The thought of pizza quickly left and all I could think about was some Carnitas tacos. I made a beeline across the street and was pleasantly surprised as I walked in to a nice clean family run place. It seemed like a couple ran it. They even had their young child hanging out in the place. I ordered at the counter and was quickly served 3 carnitas tacos. They were awesome! The salsa was Delicious. I went for the spicier salsa and that was an awesome call. I probably could have eaten 3 more. Not because they weren't filling but because they were that good! I thanked the staff as I left and my grin was definitely back. Also I still had the dope parking spot. Sweet!\n\nThis place is totally recommended if your ever in the area.", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-19", "description": "no, this place does not deserve the 3.5 stars it has right now. this is a  5+ star place. for sure.\ni call it city burrito since its so close to ccsf and i found it one day between my classes. i love the little mom who is the cook and owner. its fresh and wonderful. they are so nice and always offer me chips. even though i bring my own drinks (i'm cheap) they still smile and are really nice.  the regular burrito here is so wonderful. if i eat the whole thing for dinner im still full in the morning. i LOVE this place so much.\ndelicious every time. i lovelovelovelovelove this place. i think its my fave place to eat in the city. i went to visit my boyfriend in vegas and he asked me to bring him a burrito from \"city burrito\"", "author": "just k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-31", "description": "Do you know my test for a restaurant's greatness? If you go into the place at a weird hour (like 3pm or some off time) and it's still bustling, it is a good restaurant. Which is why this taqueria makes my list. I like this cute little Mexican place on Ocean not far from City College (Ahh... memories!) The burritos are affordable and hearty. It is very clean here and the staff, who prepares the food in front of you, is nice and friendly.", "author": "Patricia M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-04", "description": "This place has uncommonly good fajitas and chips and salsa.  The burritos are good too and big.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-30", "description": "Very filling and very cheap for the size of its burritos ($5-6). Nice and friendly service from the lady who gave us free chips. Got our orders correct and would definitely stop by again.", "author": "Lisa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-22", "description": "I sure do love me a good burrito. And the telenovelas playing in the background make your dinner so much more dramatic.", "author": "Claire C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-20", "description": "This is hands down the best in outer mission/sunset and ingleside area. I have been searching for a mexican place I enjoy and I'm happy I finally found it.", "author": "Hannah G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-28", "description": "DO NOT EAT HERE!!!!  This place is disgusting and a HEALTH HAZARD.  While I waiting for an order, I witnessed them pick up leftover tortilla chips from customers finished meals and put it right back into the chip tray.  They then gave me a bag of those tortilla chips.  SICK SICK SICK.  Stay the hell away.", "author": "howard l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-08", "description": "Great food and outgoing staff.  I had my usual lengua super burrito and was quite pleased with not only the portion and taste but the cost was reasonable as well.", "author": "Robert G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-29", "description": "Huge burritos, fair prices, good salsas, nice people. I'm glad to have this establishment on Ocean Ave.", "author": "clay b."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "This place is really good.  I can just tell.  Growing up on the edge of Southern California, this place really is authentic.  A little Mexican lady is freshly making the food at a burner stove.  My fiance, friends, and I have only had their burritos, salsa, and chips, but everything was so fresh and flavorful.  I could maybe understand why some people had soggy nachos or whatever though, because these people actually take the time to marinade their meats and such.  Also they automatically put in onions, sour cream, and guacamole.  All I can say is, \" Get over it.  If you go to Mexico, that's what you get Whitey.\"  They add in the spicy without telling you, but I'm Asian and immune, so it tastes really good to me.  I recommend going here if you like AUTHENTIC Mexican food.  The chips and salsa are especially good, and the burritos are SUPER big (better tasting and pricing than Chipotle).  Yum!", "author": "Candiace A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-27", "description": "I love this place. Best Mexican in the neighborhood by far, although there's not a lot of competition on Ocean. They have my order memorized even though I only go there every three weeks or so, and the burritos are the size of a small baby. I recommend getting your order to go unless you like Mexican  soap operas at full volume.", "author": "Andrea H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "This is an excellent taqueria.  Very friendly and very affordable.  Try the carne asada tacos!!!", "author": "Erik N."}
