{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "A small place with very friendly people and to top it all really tasty food! \nIf you are close by you must go and try everything out there- from bowl to burritos. Everything is really tasty! I love this place and have been going here for almost 1.5 years now! \nAlso, they customise things for vegetarians/vegans! There are plenty of options.", "author": "Dee M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-11", "description": "If I could give this place zero stars I would. They are very deceptive about the pricing. I ordered the mixed grill vegetable burrito with guacamole. The burrito says $8.65 on the menu and .75 for the guacamole. They charged me $12 claiming that I got the super burrito and their reasoning was because I got \"extra\" salsa and lettuce which is an extra charge. I'm never coming back to this bogus taqueria again. This establishment is scamming people. If you go to this place, CHECK YOUR RECEIPT.\n\n*update* \nI went back 10 min later and asked to speak to the owner which was Christina. Christina was the person that rung up my order initially and I asked her to explain the extra charges. She had some trouble explaining it and gave me $2 cash back. I initially refused the $2 and told her that's not the reason I came back. I explained that she is scamming people for extra charges and it's unacceptable. She then tried to give me the $2 again which I accepted and then walked out.", "author": "Brandon M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "Great lunch spot. Quick service, fresh ingredients and delicious food for great prices. There are a number of outdoor tables for enjoying the beautiful Bay Area weather. I had a super burrito with everything on it, which is a great value for the dollar. However, to make sure I can comfortably finish the whole thing next time, I will probably try the baby burrito, which is on a smaller tortilla.", "author": "Halle H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-12", "description": "I live down the street and really wanted the place to be good.  I tried it once (got a carne asada burrito) and was really unimpressed.  Wanting to give it a second try, because everyone has a bad day, I went back for another burrito (spicy chicken this time)... I'd say it was flavorless, but I guess nothing, with hints of cleaning supplies and strangely a hint of oyster/shrimp, is a flavor.  The staff is nice, but the food is just so; ugh.... there's a taco truck in front of the courthouse that's soooo much better (the one parked closer to 6th than the other); although it's only open during lunch and breakfast.", "author": "Lane S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "We stopped here after spending way to long at REI. I was starving. Thwt had tables outside on the side walk so we decided it was the best place to stop with out dog.We ordered nachos and I got fish tacos. My boyfriend got the baby burrito. The nachos were full of black beans and cheese which were tasty and guacomole which was very average. They were huge and we couldn't finish them. My fish tacos had a ton of fish which was good but also way too much sour cream and guacomole again. That made them super heavy. There were minimal veggies and no lime to squeeze on to them. My boyfriend wasn't a huge fan of his burrito either. Overall the outdoor space has potential. The food falls beside the mark. Also it would be nice of they sold beer at least.", "author": "Anne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "I absolutely love this place, I love their baby burritos that in turn gave me a burrito food baby and I also love their prawn burrito (that are only served as super burritos) that cost me over 2 years of gym and pilates memberships in order to rid the shrimp weight. ;)  That said, I would do anything right now to eat one of their burritos for lunch. Can someone invent a teleportation device to zap me from FiDi to Dos Amigos already?!", "author": "Denise L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "Ask for a receipt and make sure to check it!\n\nThe Asian lady (assuming she is the owner) charged me almost 3x the amount for 2 baby burritos. It should have been around $16 and she charged me $42. \n\nAfter she charged me, she didn't give me a receipt or ask if I wanted one. When I walked out of the store, I had a bad feeling so I checked my credit card transactions. I came back and asked for a receipt. I saw her look at the receipt from the cash register, rip it out of the machine, and then start charging me for 2 baby burritos on a new receipt. I tried to give her the benefit of the doubt. \n\nNow I knew something was wrong so I told her that she charged me $42. She didn't even check my phone cause she knew she overcharged me and gave me my money back in cash. Very shady.", "author": "Carolyn N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Good food at a good price. I tried the regular quesadilla ($7.95). The tortilla was crispy, and the meat was tender. Portion size was generous, and I got two meals out of it. \n\nLocation is good - it's right next door to REI.", "author": "Elaine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "A small hole-in-the-wall amazing taqueria\n\nThe outside looks pretty fancy, probably because it is located right next to AirBnB's HQ office :) The inside is actually quite small, with no sitting room. \n\nI came here twice, once for the baby burrito, which is actually quite big--it made me more than full. The food is served hot and with a good mix of ingredients. They don't hold back on adding stuff into the burrito. The second time, I got the enchilada--that was a pleasant surprise. Served piping hot with lots of filling and sauce, and lots of MEAT, it was easily one of the best enchiladas I've ever tasted.\n\nThe service is also quick. Get in, pay, get out. Getting your food is a breeze.\n\nOverall, would definitely come back again.", "author": "Henry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "Since I'm always looking for a solid burrito, I got a rec to check this place out.  I'm bummed because I had really high expectations but it ended up just being mediocre for me.  Nothing super stood out, but can't complain about the quality.\n\nCarne asada taco\nCarnitas quesadilla\nShrimp burrito\n\nI would be open to trying them again and giving them another shot. Last time I ordered off Postmates so I can't vouch for the service but next time I'll drop by.   \n\nTL;DR Quick and does the job when you need your burrito fix.", "author": "Lyn C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Ten years later, this place is still the best taqueria not in The Mission. I used to eat here almost everyday when I worked at The Giftcenter next door, and coming back here today was such a treat. Several of the same awesome people still work here. I can't believe they still remembered me AND my name after I stopped coming here regularly 5 years ago. The Super Quesadilla tastes just as delicious as I remember. SO glad this place is still around (and thanks for playing Fulanito for me today, guys! It was so nice to see you all!). I will be back soon for sure!", "author": "Jen O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "The food here hit the spot! We had a cheese quesadilla, baby tacos (pork, steak and chicken) and a grilled chicken salad. The portion sizes were big, and the meat was well seasoned and very good One employee was a little rude, as I asked for meat on my salad at the end, and she said she already had asked me that earlier (un necessary for her to say anything...just throw the meat on there!), hence my 4 stars and not 5. Also not much room to sit n eat, but great to go!! I'll def eat here again. Yum!", "author": "Robin G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "I've never ever thought I would fall head over heels for a NorCal burrito.  \n\nIt's not cheap but the size is more than enough to keep you full. $12 burritos don't exist in SoCal. \n\nThe salsas were fresh and seasoned well. Rice was perfectly cooked and the carne asada had a nice smokiness that perfectly complimented everything else. \n\nAn entire week in SF but I loved my burrito lunch from here the most. I'll be back.", "author": "Phuongngan B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-06", "description": "This is one of the few places to get Mexican food in this area. \n\nThe food is delicious! I highly recommend getting a baby burrito and your favorite type of meat. Don't let the name fool you. It's called the baby burrito, but it's a healthy size. They load it up so much that they have to double wrap it in foil. \n\nMeat, sour cream, guacamole, salsa, and anything else you like...cilantro, salsa verde, pincante, lemons, \n\nThe food is fresh, they get a steady amount of foot traffic so they turn over their food frequently.\n\nI also recommend getting a Horchata to wash it all down. It's not too sweet and very refreshing after that burrito.\n\nI would give it a 5 if they spent a little bit of time creating a better atmosphere. There is no where to sit. The place smells like cleaning products. \n\nBut don't let that deter. \n\nWalk in order what you like and eat it somewhere else.", "author": "Jenner B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-01", "description": "This place seems to have really stale and dry meat and other ingredients. I was not happy with the burrito I got", "author": "Robert S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-14", "description": "Great place to grab quick lunch at fair prices. Only issue I have here is that every lady making the burrito, quesadilla, nachos etc, make it differently. \n\nThe place can be a little cleaner.", "author": "Sandip P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-06", "description": "I think I've probably eaten here often enough to warrant an update on my review from way back when.\n\nThere are still much better places for burritos nearby, but Taqueria Dos Amigos is about a block away from where I work, and for convenience sake especially on a busy work day I don't mind coming here to grab a quick burrito lunch.\n\nTheir burritos are definitely on the small side so I'm definitely forced into having smaller portions which isn't necessarily a bad thing especially for an old guy like me.  There is not much difference in size for a regular burrito as opposed to a super burrito.  Sure, they give you more ingredients in the super but you seemingly get less of each ingredient so the burrito comes out to be the same size yet you are paying more.\n\nI order the same things with each visit.  My usual is a regular burrito with the tomatillo chicken which I just refer to as \"green chicken\", black beans and spicy salsa.  I like the green chicken.  It's all chicken breast meat and often in huge chunks but it has good flavor in it and it's fairly moist.  For a change of pace I'll order the prawn burrito, but that just means having to wait longer as the prawns are cooked to order.\n\nTheir carnitas are decent, but I've never taken a liking to any of their preparations of beef as I've found their beef to be too dry, too bland, too grisly or a combination of all of that.\n\nThe staff is very nice too.  So a 3 it is!", "author": "Wilhelm Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-09", "description": "This is my all time favorite Mexican restaurant. The burritos are amazing and I love their tomatillo salsa!", "author": "Mykaela M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-13", "description": "When you have the ability to go to the Mission district, or walk a few more blocks to some on-point taco trucks, I would choose that over any of the food here. A solid disappointment.\n\nI've gone twice now out of convenient proximity from work and regretted it both times. \n\nFood\nI'm vegetarian, so I've had their veggie options--the first time, I was underwhelmed by the flavors. The second time I just felt like I got ripped off. I got the grilled veg burrito and the vegetables were raw, the beans a bit crunchy, and the spicy salsa had little spice.\n\nService\nOddly, the servers here are exceptionally rude (except for the cashier, she was very friendly). I say oddly because of how limited our interaction was and yet I've had repeated negative encounters. \n\nAmbiance\nNothing noteworthy\n\nPrice\n$8-10 for a poor quality meal? no thanks.\n\nOverall\nI have no plans to go back. Both meals there were sub-par.", "author": "Aly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "This place is great if you want a decent burrito, and need it pretty quick! I personally only order vegetarian items since the chicken quality isn't up to my standards, but I've heard their beef and carnitas tacos are good too! The staff is fairly quiet, but super speedy at serving you. The food is always reliably good, its never amazing, and seldom bad. Sometimes the guacamole makes me feel weird after, so I don't always get it. I personally love the taco salad, and their burrito bowls!", "author": "Larissa S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-20", "description": "I find it difficult to judge Taquerias against each other because the nature of mexican food is so similar. The contents are almost all identical and the menu options are generally the same. This usually leads me to rate places based on the few things that i care about most when I'm on the hunt for a good burrito and that is the salsa, the location and the ability to communicate with the servers.\n\nThe latter of those three criteria played out well with Taqueria Dos Amigos. Located in a convenient spot in Soma just a few blocks away makes it one of the more accessible mexican options available to me. Also, the service was friendly and spoke decent english, which is something that I definitely appreciate. \n\nI have slightly different taste in salsa than most people I know. I like my salsa very thick, but not chunky at all. Basically an almost gooey consistency is what I look for. I also like it to be very spicy but slightly sweet too. It's hard to find salsa like this as most places make it too chunky or not spicy enough. This place had it just right though.\n\nOverall, this might be my go to mexican option in the future because I really like both their location and their salsa. \"I'm a fan.\"", "author": "Mark O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "Their burrito tasted really good after I wore myself out shopping at REI for 3 hours! I needed food immediately, and very close by, and there they were.\n\nI was tempted to order the meat, but I stuck to my vegetarian ways. The veggie burrito was basically a burrito without meat, but with extra good guac and cheese and that good stuff. The salsa was p good-- order the spicy, since it's not all that spicy relatively.\n\nI thought the staff was friendly and nice.\n\nNo frills, not the best burrito around, but absolutely killer convenience and a good respite when you're tired and in the middle of REI-ville.", "author": "Bill G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-28", "description": "Neighborhood place, burritos quesadillas are good for a quick bite if you are into this type of food, they don't open late which l understand for this area in San Francisco but they have nice outside seating.", "author": "Jorge B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-14", "description": "I just wanted to grab sth to eat quickly in that neighborhood so I went to this place. I had a shrimp taco and On my first the shrimp wasn't cooked. I went back to the store and the ladies working there said it was cooked through without even bothering to look at the food. (So you can see the service isn't good!). They did make another one for me after I finally showed them that it was raw. I will never go back again. $5.45 for one small taco with that kind of quality and service is outrageous.", "author": "Luci L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "It's a tiny no-frills counter off the Airbnb building but they sure know how to make a burrito bowl.\n\nI'm not a fan of their burritos but, paradoxically, when it's deconstructed into a bowl it just works. An $8.48 regular chicken and steak bowl fills me up almost daily. The meat, beans, rice,salsa and veggies are good; stay away from the guac. And be warned, friends who've tried to get fancy with other menu options are always disappointed.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-05", "description": "I work close by and I must say, this place is frustrating to no end.\n\nTypically, a line, or queue, is a first in, first out process at a restaurant. Not at Taqueria Dos Amigos. Often, they will have the burrito prepared for the person behind you, effectively making them cut you in line. This has happened to me nearly every time I've gone in there.\n\nAlso, I'm not sure what is going on with management in there, but if you enjoy getting served by bickering staff, Dos Amigos is the place to be!\n\nAnother thing: gloves. You won't see them being worn. Ever.\n\nI'll keep going there because it's too close to the office not to, but I've finally been irritated enough to say something.\n\nAnother thing, they have a minimum card charge of $8, which isn't posted anywhere, so you're forced to buy more than you bargained for. I got a burrito which came to $7.20, and was asked to buy something else. As I didn't want anything else, I asked them to just charge me $8 and call it a day. Apparently that was too complicated of a task, and I was forced to buy their cheapest item, a can of  soda, for $1.50. I don't even like soda.\n\nAnyways, I hope these people get it together or go out of business so another business owner can have a chance at running a half-way decent establishment.", "author": "Donny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "The carnitas super burrito was very small. In terms of ingredients, she included visibly about two thirds of what other taquerias include. The price was a little bit above average. The location is too convenient for me so I will give this place two more tries, but I will probably order different items.\n\nUpdate: the super tacos are great. I have really enjoyed them.", "author": "Andrew F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-05", "description": "The moment I realized I'm part Mexican was when my mustache jumped straight off my face to attack my burrito before I could. Muchachbros y muchachbroettes, this Pulled Pork x Coleslaw Burrito is what evvvvery comfort / Southern / black resto or trucko wishes to be. #adm #isspanishforomg Also shout-out to the Cactuar Yologoatlo Cheese Burrito.", "author": "Dan B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-08", "description": "Pros, great burrito, great service, and great location. Cons, no chips. My lunch place for half a year, still in love. Hahaha.", "author": "Donna Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Our office moved from The Mission to SOMA, I was initially very concerned about the quality of the local burritos, but then I found Dos Amigos. \n\nTheir burritos are on par with most SF Taquerias by default but where Dos Amigos goes above and beyond is their salsa and toppings. On top of the spicy pico de gallo and cheese, I have them add their very hot orange salsa along with onions and cilantro. The pairing of it all makes for one of the best burritos in the city.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "Do not order UberEATS from here. I waited over 45 mins then got a call to tell me that my regular burrito was, \"unavailable\". It probably would have been available 45 minutes ago. Shotty service. Won't be coming back.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-02", "description": "One of the only places to get decent Mexican food in the area. \n\nThe pros: \n-They have black beans, refried beans and pinto beans. \n-The veggies always appear to be fresh\n-It's clean, they keep the interior pretty clean considering how many people flow in and out day by day. \n-They're quick (lines can seem long but they get through the orders fast) \n\nThe cons: \n-Good luck finding street parking. Food trucks park just outside this place & parking spaces always seem to be taken. (Though, there is a parking garage about a block and a half away)\n-The price ($7.25 for vegetarian burrito)\n-The portion/price (I'd expect the veggie burrito to be super sized considering the price)\n\nOther than that, it's decent. A nice treat after pay day. Can't make this place an every day favorite due to the price. \n\nVeggie burrito & canned sprite? A steep $9.38!\n\nWhich is considered standard in this neck of the woods... *ouch*\n\nCheap tip? Save your cash and head to Trader Joes which is walking distance to this taqueria and opt for their black bean & cheese burrito for $2.99. :)", "author": "chante q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-14", "description": "Strictly a to-go spot but has decent Mexican depending on what you get. Stick to the burritos and try the green or red chicken, it's really tender and flavorful. If you want something light they also have baby burritos.\n\nStay away from the nachos, they use stale store bought chips and heat the cheese in a microwave so the chips come out soggy and inedible.", "author": "Gonzalo S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-27", "description": "If I could give 0 stars I would I are here since I work across the street but the meat has no flavor at all and the burritos are small for the price they ask a total insult to Mexican food idk what the owner was thinking she's. It even Mexican", "author": "Jonathan E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "The burritos aren't to DIE for, but they are fulfilling enough.\n\nI had the baby burrito with spicy chicken, a tiny bit of pico de gallo, a bit of sour cream and  guacamole. After being rolled up and contained in the aluminum foil that the baby continues to steam in, I run to ask my friends for cash because they have a $8 minimum on cards and my baby burrito came out to be about $7.\n\nThe taste of the burrito was decent. It was easy to eat and not too messy. The portion size of the baby burrito was perfect. I might come back and try it with the spicy pork instead.", "author": "Linda K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Came here after the diamond outlet. The smells alone warrant a visit. Not sure what the hate is all about. 3 1/2 stars? Really?\n\nThere prices and portion sizes aren't \"Midwest\" huge but they are more than reasonable compared to any other place in SF. Tacos are really good, breakfast bowl was amazing and their service very friendly, green pork by far the best I've had. Will definitely return.", "author": "J H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "I came here before an event and I was very pleased with my burrito. The rich flavors were beyond my expectations, however, the restaurant is very small; they only have two chairs inside. Other than the size of the restaurant, I'd come back here again when I'm in the area!", "author": "Steven T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-21", "description": "I work next door to it at the giftcenter and to be honest i have not had any crazy complains about the food which for the most part it's ok, not bad but they changed their spicy salsa which was awesome and now tastes like dirt and bland, their pico de gallo tasted weird as well and i found out that the chorizo for their breakfast burritos is cooked the day before and not therefore is not fresh. The staff is great and i never have a problem with them but i was told that they don't always get the ingredients they need for their salsas which is a bummer. Some other co-workers have expressed their dis-taste for their food quality which has significantly dropped (specially the carne asada but i tend to just eat chicken which is not bad). I blame the owners for this, this is why i don't go very often anymore. I prefer the place next to Trader Joe's, their stuff is great.", "author": "Jose L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "If there's one type of food that hits the spot whenever you're a starvin' Marvin, it has got to be Mexican! \n\nThis location is tucked away quietly on Brannan Street in between 7th and 8th and can easily be missed, but once you get there, you'll never forget how to navigate your way back. \n\nThe food here is simple, yet bursting with flavor. I mean, I totally get it, you can't go wrong with guacamole, sour cream, cheese, and salsa, but Dos Amigos takes it one step further and promises 100% fresh ingredients, no MSG, no lard, nor preservatives... and as they say, no bull!\n\nI've had the opportunity to try out their prawn tacos, taco salad, the super quesadilla with el pastor, and cactus goat cheese burrito. All were tasty and can be customized to what your palate desires. \n\nThe actual restaurant is quite small, but there is plenty of outdoor seating available. Food is made directly in front of you and BAM!, your burrito is served fresh and hot. \n\nCustomer service is friendly enough and they aren't stingy with customers like me who enjoy extra extra jalepenos or salsa on the side. \n\nThey are also proud brewers of Peet's Coffee and Tea for those who need their daily fix who happen to crave an enchilada or chile relleno on the side. Now that's accommodation! \n\nI will definitely have to try their super nachos on my next visit and would recommend this place to anyone who wants muy excellente Mexican food on the go. \n\nDisclaimer: I am not an expert on Mexican food. My expertise stems from Taco Bell.", "author": "Ann S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-25", "description": "Dos Amigos isn't amazing, but it does the trick.  My parents work nearby, so my brother and I will drop in and grab some food from time to time, out of convenience.  Lord knows Dos Amigos is much better than whatever food truck is parked in front of Airbnb.  The horchata is decent but could definitely use more spice.  The quesadilla is browned quite nicely.  The cactus and goat cheese burrito is a bit slimy but overall enjoyable.  The prawn taco is very generously portioned and delicious.  The baby tacos are done poorly - the tortillas were stuck together, so we couldn't properly enjoy all the scraps that had fallen out of each taco.  I also just cannot understand why the employees don't wear gloves here when they handle the food, but I guess it isn't against health regulations because they have been doing it for years.", "author": "Tracey L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-03", "description": "Dos Amigos is one step above average but I wouldn't say it's the best food I've ever had.  The super burrito was good and well wrapped up so no messes were had.  they even spread the ingredients out before wrapping which I liked so no one food was tucked away for a surprise bite.\n\nThe Horchata was probably some of the best I've ever had. You know it's authentic when you get to the bottom and all you taste is the cinnamon/rice concoction at the bottom.  It was a thicker consistency than most and damn good.", "author": "Kevin J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Great food, no complaints there. Fare prices also. Customer service by the ladies making the food could improve.", "author": "Lawrence D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-05", "description": "Inconsistent. I usually order the baby burrito, which depending on the person making it, can really vary in size. I ordered one today and the woman making my burrito put the smallest dab of guacamole and sour cream, not even enough to spread throughout the burrito! There's a better Mexican restaurant nearby call Dos Piñas. Go there instead.", "author": "Serena S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-23", "description": "Amazing super taco!  I really like how fresh it tastes.  Has a tiny table with two seats inside, and many tables outside in fresh air for more observant patrons.", "author": "Niniane W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "This place was just around the corner from avoiding the traffic unto the bay bridge and my mom and I did not feel like sitting in traffic. We decided to find a place to eat and my navigation directed us to this taqueria. I gave it a 3 star because the actual restaurant is very small (but it is SF), but despite the size and setting, I liked that there were small tables and seats outside. The food plates, meat selection, salsas, and prices were very decent. The ladies there were very professional and kind. The owner was there too that day and received us with a smile as well.", "author": "Martha B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "The Sig-O and myself were preparing for our big day at the Jewelry Mart, the Jewelry Mart that doesnt really serve food. Taqueria Dos Amigos is conveniently located outside of the entrance to Jewelry Mart, a quaint little shop that serves all the goodies! We got the taco deal and took advantage of their outdoor seating arrangement. Quick/good food in a great little busy street. Not too shabby! 3.5 in my book!", "author": "Mary T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-24", "description": "Decent food but overpriced.  Also bad service.  \n\nI visited every now and then for lunch.  Given the somewhat isolated area; Design District, they're the go-to place for Mexican as there aren't competitors for blocks (even miles) around.  As with any ethnic restaurant, the farther out in the City you drift, the higher the prices.  A regular burrito here costs upwards to $8+.  Add a drink and say goodbye to $10+.\n\nOne time, I came in here to order my usual: veggie burrito.  On the wall menu itself, the ingredients are etched plainly and simply in black text.  I tell the line cook I want \"...everything except sour cream.\"  \"Everything\" includes lettuce and other standard burrito items.  Dumb line cook kept bickering with me, insisting that lettuce is extra and  I had to pay for it.  Short of any changes on their menu and having been there just last week, I don't see how this could be.  I eventually pointed to the menu itself.  Her response \"Oh!  Ok.\"  REALLY?!?!?!  She then adds on, \"Next time, just tell me.\"  WTF?!?! Is this your first day?!?!\n\nI moved along the line to the register and told the Cashier (maybe manager) about the gripe I was subjected to.  She snarls the same: \"Next time just tell them!\"  WHAT THE HELL IS SO HARD TO UNDERSTAND ABOUT \"Everything except sour cream\" ?!?!?!  Do they need reminders about their own products and the composition thereof?!?!?!  I wasn't having this.  I politely said 'No thanks.' when it came time to pay and walked out.", "author": "Honest J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "Getting a baby burrito on my lunch hour here really hits the spot.  Good portions, ratios, flavors, out the door real quick.  Feels a bit expensive for what you get, but just blame SF real estate for that.\n\nA food truck or two will be stationed outside, but usually I find Dos Amigos a bit more appetizing!", "author": "Eddy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Was at the diamond outlet and stopped by afterwards.\n\nHole-in-the-wall place but excellent food.  I had the chicken quesadilla - cooked exactly the way I liked it!  It was a nice day and so we sat outside.  There is no space (or rest room) inside", "author": "DJ L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "I do like the food here. They make your food promptly and in front of you. However I HATE the way they wrap my burrito . Every time I see them roll it I cringe . The place is very small also but the people making your food are friendly and the food is pretty good. If they rolled my burrito the correct way it would be a 4 star.", "author": "Marjana S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "I ordered 4 burritos with different meats, and they might have been the most disappointing burritos I've ever had. The meat and rice were dried beyond recognition, and the salsa was odd. The hot sauce tasted weird, like curry, which couldn't salvage the burrito. Normally, I'd say that (like pizza) even a bad burrito is still good, but I will never eat here again.", "author": "Drew P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "I've only been a handful of times, but considering their is scarce Mexican food in the area and I usually like to get my food fast, this place is perfect. I usually get big burritos, so their speed of making the food and the good flavor make this a great place to pick up food to go. It won't blow your mind by any means, but it will be satisfying. \n\nI have not tried much else there, but I gather that the flavors will remain consistent throughout the menu since they are all served from the same cafeteria style food layout.", "author": "Richard K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-03", "description": "I work around the corner from this place so I've been here a couple of times to get a quesadilla or something basic like that. First time I was there I was grossed out by the bare handed food handling. I ate the quesa anyway. \nFor some odd reason or another, people don't think I speak Spanish. I know the bay area is lacking Puerto Ricans but to carry on in Spanish like I'm not there and say some stuff you think I don't understand but do is not cool. I thought I wouldn't be back but dammit my craving for a quesadilla was strong today. I figured let me give it another shot for the sake of second chances. \nBut there she went again bare fist into the shredded cheese and I just....\nEven the taco trucks in my Oakland neighborhood rock the food gloves. \nHow do I know your hands are clean? Maybe you scratched your nose or ass right before I walked in.  Idk. \nThere's a lack of good, close by food in my work area so I'm bummed that this place didn't make the cut.", "author": "Ginger C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-19", "description": "Got burritos and they were great! This place is always packed so it was great to try after shopping at the gift center. Looking forward to trying other items on their menu!", "author": "S T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-25", "description": "We decided to drop by solely based on their easy street parking. There are several parking spots available right in front of the store. Plus the spot we got had 10 minutes left on the meter. I love that because I never have coins (or carry cash for that matter) on me. \n\nAlthough NOT my favorite taqueria in the city, it's solid and it gets the job done when you're looking to grab a quick to go meal. You can watch them make your order as they have the ingredients all laid out up front. Tightly wrapped, hefty portioned burritos at a fair price tag...plus they take plastic. Service is always pleasant. \n\nThey're A-OK in my book.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I was sent here for some breakfast burritos by my boss one day and never looked back. They cook the chorizo on the grill with scrambled eggs and voila! I'm also a big fan of the bowls when eating out of a tortilla seems like too much work or if you know you aren't going to be able to eat it all and want to be able to save some for later.", "author": "Leina K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "Love the burritos.  The super burrito is great size, the baby burrito is perfect for downing the whole thing in one sitting. Spinach wraps and carnitas are my go to! They also have coffee soda and horchata", "author": "Stephanie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "Great little hidden taco/burrito shop, a little off the beaten path.  Food is cheap and tasty, and the tacos are ginormous (I usually end up just eating them with a fork).  Staff is super nice, too.", "author": "Brian T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "My burrito was ok. I saw them give a free burrito to a homeless guy though. I thought that was cool enough for them to get my business again.", "author": "Teem P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "Love this lunch spot! So quick and delicious! \nOne con, $8 min for card purchases. :(  Just a baby burrito is not enough. Will keep coming back though!", "author": "Elizabeth S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-04", "description": "If you're looking for a dry, small, overpriced burrito, this is the place!  If you want a decent Mission style burrito, go to the Mission.", "author": "Matthew G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-04", "description": "Great for a quick lunchtime Mexican fix!  If you've eaten at Taqueria Del Sol in the TL, this place is run by the same people.  The burritos are the perfect size (not monstrous, like with Chipotle) and are quite tasty!  The only thing bad about the place is the shitty tortilla chips that you can get for a couple of extra cents.  They're usually stale and very bland.", "author": "Ernest H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "Is me first time in this taquerias I order Super burrito  we pork is great. \nExcellent. But. Two think  the ket maker different. One the employes  she never wash the hand  she touch her face and the  \nOne coster she order to go food the employee  she attend the costumer and I seed her add lettuce.  She touch the food and she not wash her hand \nEbriting. One the employee she  clining. The hood  and he use  Quimicos. In the top off the food.  This no good.", "author": "Edwin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-28", "description": "Just took a burrito with me. Might not be the best burrito I ever had, but nevertheless it was very delicous. Authentic. Quick. Reasonable price. Could imaging to go there regulary if I would live here. So check out for yourself.", "author": "Jayr R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Ordered the super burrito with chicken and it did not disappoint. Chicken tasted great and ingredients were fresh.", "author": "Matt H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "This place is great! The food is fresh. The staff friendly and polite. I wish I had this on every corner instead of chipotle. I will go out of my way to visit Taqueria Dos Amigos", "author": "Tom B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-13", "description": "Unfortunately the shrimp in the shrimp burrito that we ordered weren't fully cooked so I can't give this place a great review because of that.  We actually had to pick them out because we didn't want to eat raw shrimp.  Maybe their other burritos are good but I'd stay away from the shrimp or make sure they really cook them.", "author": "Blake B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-10", "description": "New to soma and seeing this weird little place, had to try it. So on a Sunday afternoon as my son was playing at the park with mom, decided to hit it up. \nI wanted a taco but not for $3.50 a pop. (not when a great taco is available right down the street at the best buy taco truck for less than $2). So I settled on a regular (verde) chicken burrito. Still expensive for what you get though. \n\nAs I sat down at the park and bit into my burrito, I was happy. It tasted pretty good. The rice, whole beans, fresh salsa and chicken had a good blend of flavor. Not too heavy but still flavorful. The chicken was a tad overcooked (a little dry) but still ok. Both my son and wife keep coming over to steal bites from my burrito, so I guess it passed our family's taste test. \n\nOverall a decent place and will be back if I don't feel like driving to the mission. Only real negative is the cost to value ratio.", "author": "Dom L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-06", "description": "Yumm!  I really like their vegetarian burrito.  They don't skimp out on anything and put more of anything you ask for.  AND they have a spicy sauce you can add to the burrito which actually has a kick to it.  I kept adding more of the spicy sauce and definitely over did it.  I ended up having to calm my burning mouth with some yogurt.. but man was that a good feeling to have gotten that much heat from the sauce.\n\nMy main complaint is the hours... I wish it didn't close so early.  And, that there were more seating.. though I do appreciate the (limited) outdoor seating on nice days.", "author": "Rachana S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Breakfast burrito, sub chorizo for grilled chicken. Throw in some mild pico, onion cilantro mix, extra cheese, and spicy sauce...... MONEY every time. I can and have had this burrito every day of the week. Simply fantastic.", "author": "Andrew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "I can't resist the pulled pork with coleslaw burrito from here, so delicious!", "author": "Anthony W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "Holly taco balls.  This place threw down two amazing pork (carnitas & bbq pork) tacos.  The portions were huge and they were pretty good. It's a simple taqueria next to the jewelry mart.  So after your done dropping bank on rings, you can treat yourself to an inexpensive meal.", "author": "Darin E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-05", "description": "My husband always talks about how good the food is here! and today! My first time and this plave and it was the worse experience ever!  My husband got a burrito and when the lady was done my husband asked to make it a wet burrito which its just hot sauce on top, well this lady rolled her eyes and with a very rude attitude said why couldn't u said it earlier Now I have to remake it, My husband embarrassed said It was fine just the way it was.. when It was my turn to order I got an order of flautas (3) The same lady said well we only have 2, and I said kindly  well the order has 3 can u make it please.. again she mugged us and said well now ur gone have to wait 8 minutes!  I was so disappointed! ! How can someone be so rude and act that way towards the customers!!! I won't EVER be eating here again!!!!!! The food was good but the Service was the WORSE EVER!!!!", "author": "Karen B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-16", "description": "Great Mexican food. Pretty authentic. Efficient and best for take out although they have some tables outside. They fold their burritos better than anywhere else I've been. My favorite is the breakfast burrito (less than 5$) and served till 11:30am. I also like the burrito bowls they have; they are much better than Chipotle and they let you design it, also there is two different sizes of burrito bowls.", "author": "Will C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-05", "description": "I have to be incredibly honest.\n\nThere is only one, sole reason that I eat here.\nEvery year during the crafts fair which I attend with my close friend from 400 miles away, she gets hungry before we get to it from BART. Therefore we always stop here, every year, to get a burrito of some sort.\n\nIn all honesty, it may be better during its much slower hours, but during the crafts fair, there are people EVERYWHERE. There are also rude people attacking each other for seats and it is cold outside. Also, I have to wait like 30 minutes to get a burrito and be out. Anyone in this world knows that burritos get made within 10 minutes, so 30 is a long time to wait. Top it off with a lot of hustle and bustle + quickly sold out items, you just keep asking yourself why you are here.\n\nThe food, itself, is nothing I would praise, but better than starving to death for sure. They are not bad, but nothing close to spectacular. Portions are only ok for its price.\n\nEvery year I look forward to her coming back and to the crafts fair! But every year I am probably going to hit up the Subway before reaching our destination.", "author": "Winè C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-02", "description": "This small taqueria serves its purpose if you are looking for a quick fix of Mexican food.  There are not a lot of local Mexican food options in this area, so the line can get a bit long at lunch time during the week.  However, they get through the line quickly, the ingredients are solid, and service is friendly.\n\nOther than 2 tiny tables for inside, their seating is limited to uncovered tables on the sidewalk; great during a warm day.  If it's cold or raining, you're taking your food to-go.", "author": "Don T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "The staff are friendly enough and but the goat cheese and cactus burrito is to die for!  So different and delicious.  The spicy salsa is also one like no other and is a MUST on the burrito.", "author": "Adrienne G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-01", "description": "Always good. It is what it is.... A cheap joint that has fresh Mexican food. Good for what it is.", "author": "Lyndsey C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-01", "description": "I was headed over to Airbnb headquarters, and arrived a little early, as I often do when embarking to the parts of the city I have not been to before.\nIt was lunch time, so I really desired to find cheap, fast eats nearby. \nI started looking and everything was hella bistro. $30 cranberry walnut chicken salads & croque monsieurs.\nWhat the hell...?\nA few minutes up the way, I see Taqueria Dos Amigos.\nI am hoping it is: a. cheap and b. good.\nIt turns out to be neither.\n-\nThe \"restaurant\" is just a take out place with one table. This is a work-lunch crowd, and that's who was crowded in here. About 7-8 people. There seemed to be 5-6 staff as well, which created a muddled, confused atmosphere where no one was in charge. The only guy was who people yelled their orders to, mostly, though an older lady took mine. Within one minute, a woman in her early 40's then offered to take my order again.\nI told her I was all set.\nStaffing has issues here.\nThere's an abundance of staff, but they do NOT move quickly. It likely would have even taken half the time, with half the staff. 2 people tried to take my order, 1 person asked me about beverages, 1 brought my food to me, another rang me up!?!?!?\nI'm all for job creation, but it has to be creative and excellent. This is turdass.\n-\nMy meal was close to ten bucks for three \"mini\" soft tacos with pork and a side of rice & beans. Meh.\nThe tacos were okay. The meat was a little dry but well seasoned. The rice and beans was flipping terrible. I had her scoop the refried beans onto the rice, hoping it would be a savory, sexy mess to devour. \nInstead, the rice was flat in flavor. The refried were completely unmemorable, non-outstanding and bland.\n\nNow I'm craving Taqueria Guadalajara in San-flipping-Leandro because THEY make REFRIED BEANS that will make you 'GASP.\n-\nSo all in all, it's a good thing I was getting paid to be nearby, because the food was sucky and I've also had food-poisoning from the McDonald's nearby.\nCheers!\n\nThe Good: It's proximity to the corporate offices of many Top 100's\nThe Not-So-Good: The food, the staffing issues, the congested delay and hassle of trying to eat here\nThe Price: Pretty expensive for cheap, bland Mexicali\nTwo Words: Don't Bother", "author": "Johnny K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-23", "description": "I like the burritos and nacho salad. Ask them to separate the chips or it would get soggy. The portions are more than enough for me.", "author": "Alex w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-15", "description": "One of my fav spots to get a burrito in the city. Yes, I like this place more than most spots in the Mission. It's definitely a hole in the wall spot but the quality of food is top notch. Fresh ingredients. Deliciously seasoned meats. Salsas with a nice kick. They even use chicken breast which I'm a huge fan of. Beyond the quality this place is super affordable and you get a ton of food for your money. I also like how the burritos aren't too greasy. Definitely one of my go to spots.", "author": "Nik R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "Stumbled across this little place last month... it was between Dos Amigos and the Indian-Curry Food Cart parked a block away. Dos Amigos won out and I was very happy with my choice. They are sort of a 'Chipotle-esq' build-your-own burrito joint, but they also have other delicious treats on the menu too.\n\nAwesome things about Dos Amigos:\n1- They have Al Pastor as a meat option. This is a rare treat indeed! (I'd eat at Chipotle much more often if they'd get on board with the Al Pastor!)\n2- Fabulous house-made 'spicy' sauce. It's delicious.\n3- A few outdoor tables.\n4- Their 'spicy chicken' meat option is also solid.... Though, honestly- the Pastor is better.. but I could just be saying that because I am having a love affair with Pastor.", "author": "Tamara B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "This is the most legit taqueria in this area without having to go the Mission. They have several different kinds of salsa you can ask for. Get the Orange one that is super spicey but really good. My burrito was enormous and tasty. Like I said it's about as close to a Mission taqueria that you can get in that area. Nice little find for when I'm craving a burrito. \n\nNote they also have a baby burrito that was fairly large also since their super was pretty big. Definitely will head back when I get a craving for a burrito.", "author": "Hyung L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-21", "description": "Poor service. Greasy food. High price.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "Thanks to the owners for taking care of a few hungry teachers last night just before closing time. You all are the best! The burritos hit the spot!", "author": "Katie G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "This hole in the wall gets the job done when you need a Mexican fix and not enough time to stroll to the Mission. Not many options around this particular area.\n\nQuesadilla was delish. Guac was mediocre. Coworkers' picks ranged from burritos to tacos resulting in satisfied ratings.\n\nDidn't expect to spend as much as I did, but then again I've been spoiled by Mission quality and prices. Will bookmark as last-minute-wait-it's-dinner time option.", "author": "Annie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-06", "description": "Definitely gets the job done when you're battling a nasty hangover. Or is this the case for ALL Mexican food places? \n\nI kind of liked that I could be indecisive and have 1/2 spicy chicken, 1/2 grilled chicken, and 3 types of salsa in my burrito and not feel judged. Flavors were alright, definitely not bad though. Pretty small place, so eating inside isn't really an option. At checkout, they gave me extra salsa... but no chips? Hmm.\n\nThis isn't the most convenient place for me to get my Mexican food fix, but if in the area again, I would probably come back. Quick and easy - their bases are covered in terms of basic options, but I wouldn't go out of my way to eat here.", "author": "Briana F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-15", "description": "Good solid burritos!  The prawn burritos are really good.  They always screw up our phone orders so I only go there and order.  \n\nNot the best burritos in SF, but clean and solid.", "author": "Saus A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "I have gotten food from here many times, as I work in the area.  It has always been very good.\n\nToday while waiting for the employee to make my burrito, someone walked in and handed her some wallet he found lying on the ground outside.  I guess he was trying to do something nice for the person who lost it.  But the woman making my food took the wallet - which moments earlier had been on a busy San Francisco sidewalk - handed it to another employee, and continued to make my burrito - touching each of the ingredients with her bare unwashed hands.\n\nFrankly I was shocked.  I didn't say anything, which I started to really regret by the time I got halfway back to my office.  When I got to my desk, I threw the burrito away and decided to write this review.  Now I have to go find something else for lunch.  I'm not interested in walking several blocks back to Dos Amigos for my money.\n\nI figure this sort of thing must happen all the time.  But it's deeply disturbing to actually witness it and realize that the employees seem to have no concern or awareness about the ways microbes, dirt, and yuck may be getting transferred into their customers' food.  I almost wish I hadn't seen it and could remain blissfully ignorant.  Gross.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "This is an area staple.  All the meats are well cooked.  A nice surprise is the roast pork (vs the carnitas which is also good).  They do have salad versions of everything, so bed of lettuce vs burrito shell for the calorie conscious.  Line moves quickly even if out the door.  Solid breakfast fare too.", "author": "Flip F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "I work nearby and we go for lunch to Dos Amigos very often. They offer big variety of meals, service is fast and prices are reasonable.", "author": "Grigory S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-22", "description": "Friends for Life with Dos Amigos \n\nGreat burritos! I got the baby carnitas burrito with refried beans (of course), sour cream, guac, and green salsa. The size of the burrito is perfect for girls...and guys that aren't that hungry (so basically not good for guys). \n\nThe green salsa wasn't spicy at all so next time (and there definitely will be a next time) I will go for something more spicy. \n\nThe only negatives are that the burrito was lukewarm...I don't know what happened there. Secondly, the restaurant is only conveniently located if you're shopping at the jewelry mart. \n\nAll in all, great Mexican food. I'm already dreaming of my next trip to Dos Amigos...delicioso!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "If this taqueria were a carrot...it would be a good carrot!\n\nEverything on the menu is delicious and very nicely priced. Very filling, too. I think I'm going into a food coma just writing this review.\n\nOne thing that always weirds me out though--the horchata always has some weird non-Newtonian fluid at the bottom. It's fun to stab.", "author": "Jay A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-19", "description": "If I can still feel the pit-of-the-stomach burrito effect two hours after eating, it's an automatic downer. \n\nOne good thing I noticed was that the staff was very clean in their work. She washed her hands between handling things and making my burrito, and they avoided walking by our table with trash bags for another route while we were eating.", "author": "Alita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-01", "description": "Great burrito spot. Close to my work so I go there often, and they are always quick and courteous and serve delicious food. The baby bowl is my jam.", "author": "Risa P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "My fiance and I were at 888 Brannan to look for wedding invitations. After an hour and a half with no results, I was frustrated and my blood sugar was dangerously low. Thankfully, Dos Amigos happens to be in the same block and saved my life (and my fiance's sanity).\nI had the \"Baby Bowl\" and he had a Carne Asada Burrito. Both were flavorful, fresh-tasting and yummy. \nThe place is small and the people working are very much \"no frills\", but it all works.", "author": "dina s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "Basically a hole in the side of a building, virtually no seating or atmosphere but the food is pretty good.  They have salad bowl, and burrito bowl, options which are a little lighter and don't put me to sleep after lunch.  Their horchata is pre-made and needs more ice, but food has been consistent.", "author": "Andrew R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-15", "description": "Good food, convenient if you are shopping next door at the SF jewelry mart, but no place to pee. \n\nHowever, there are small tables inside and out for those that have no where else to eat their fresh tasting Mexican meal.\n\nA lot of take-out customers keep this place open.\n\nIt may be a hole in the wall, but it's a nice hole in the wall off Brannon.", "author": "Mr. O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-30", "description": "Ugh. I used to work near here and was sometimes forced to eat here seeing as they are the only place open on a weekend in the neighborhood. \nThe place smells like cleaning agents and rotten meat.\nEverything is overpriced and then put in a microwave to be zapped of any real resemblance of actual food.", "author": "joanna r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "Legit taco shop. Reminds me of the socal places but isn't that style. Still good for the bay area. Horchata is the very good and freshly made.", "author": "Charlie O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "If you like fresh, authentic, Mexican food, served in a clean place and run by a couple of charming guys, you'll like Dos Amigos.  We stopped in after a trip to Bed,Bath & Beyond and got the 3 baby tacos for $5.95.  The perfect pick me up and what a deal!   The tacos were served on mini soft corn tortillas and packed with your choice of several chicken, beef and pork preparations, all of which looked yummy.   We chose Pastor, Steak, & green pollo.  They were all 3 fresh and delicious!   \nThe big appeal for me here is the freshness of the food and cleanliness of the place.  The guys were busy keeping things clean and tidy - I love that.   We're going back to try more!", "author": "Laura M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-28", "description": "Blahh.. Not good at all.  I came here for lunch and got a super chicken burrito.  Everything in it was pretty bland.  They also put the cheese on top of the sour cream so the cheese doesn't melt. \n\nThey dont have a salsa bar which sucks so I had to ask for it.  Here's how it went down..\n\nMe: Can I get some salsa?\nOwner:  I put 2 in the bag \nMe:  I like A LOT of slasa, can i get more please?\nOwner (as she puts 1 more in the bag):  I gave you 1 more!\nMe: I mean can I get a lot more? I like salsa with my burrito.\nOwner: I already gave you another one!! \nME: WTF? \n\nIf you are going to charge 8 bucks for a burrito you can at least hook me up with some salsa....", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-23", "description": "Got the super taco with beef. The beef was very tender and flavorful. The taco is on the bigger side so you can get full with just one! $8 minimum for cards so bring cash if you're not buying a lot of food.", "author": "MC N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "Surprisingly good. It look a little tex-mex but the taste is more real than the second suggests. Had the super burrito, I'm a little boring with my toppings but the woman probably folded the burrito better than anyone I've ever seen (avoids the clumps of food in one spot by using the tortilla to smear everything in a good mix before folding it) and it was delicious. Cheap too, I would recommend!", "author": "Joshua H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-15", "description": "Not good at all. I was riding by today and I was a hungry. A burrito usually fixes that. Got a super. The carne asada was pretty good so I'm okay giving it two stars, though I'd prefer 1.5 stars, but everything else flat out sucked. The guac tasted day-old and bitter. The tortilla was chewy. The rice and beans were completely void of flavor. Like I said above, just not good.\n\nHonestly, the little taco hut in the Trader Joes shopping center across the street is better. I won't be coming back.", "author": "jared c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "Tasty chicken burrito. It's a life saver in this relatively restaurant-less part of SOMA if you are looking for a quick bite.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "Taqueria breakfast burrito canonization (i.e. five stars):\n\n1. Black beans\n2. Wheat tortillas (with no surcharge - see below - things have changed for the better!)\n3. Egg whites without a trace of oil or butter\n4. Lettuce at no charge\n5. Plenty of mild salsa\n6. $5 or less\n7. Friendly service\n\nDos Amigos, I proclaim you canonized!", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "I came here one day while I was on jury duty. Needless to say, sitting in jury duty for sixteen hours over the course of two days gave me a lot of time to think. Namely, I thought a lot about burritos during my second morning. So I Yelped for a burrito place. \nThis one was close enough, I guess.\n\nThe chicken burrito really hit the spot. Probably because I really wanted a burrito. But in retrospect, it was kind of just okay. The portions were good, but all it really amounted to was an uninspired blend of unseasoned chicken, cheese, beans, and pico. Noting spectacular.\n\nThe staff was friendly, but the price kind of seemed a little high. I liked being able to sit at one of the sidewalk tables. But there wasn't anything else too spectacular or exciting. Like jury duty.", "author": "Conor D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-10", "description": "The service is terrible.  The cashier over charged me and started yelling at me when I asked how much the items were. After a minute of reviewing the menu he finally admitted he over charged me and angrily refunded me the difference.\n\nThe food quality is so-so at best, 2.5 stars on a good day.  The meat looks and tastes old and the other ingredients like the beans and sauces have been sitting for a while.  I try to avoid this place unless nothing else is open or I'm in a huge hurry.", "author": "Fawad R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-16", "description": "I'm going to say this place is better than ok, but not superific because I know I can get cheaper tacos in the Mission. However, it is good and the guy who served us was pretty cool. So no complaints there. They give chips but in regular restaurants you can get 3X more.", "author": "Marie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-14", "description": "Nachos = Good\nTaqueria Dos Amigos Nachos = Super Good!", "author": "Carnley P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-01", "description": "Dos Thumbs Down!\n\nOne of the worst burritos I've had in a long time and the customer service was just as bad.\n\nMAIN POINTS:\n- The most artificial, toxic-green-colored \"spinach\" tortilla I've ever come across.  Think... Ninja Turtles Green.  It even smelled like plastic but tasted like a regular tortilla.  I honestly think all they did was add food coloring to the dough.\n\n- Their baby burrito was so dry.  Their menu described their baby burritos as a super burrito, just smaller, but there was hardly anything \"super\" about it.  Skimpy on everything except the rice hence the dryness.\n\n- Veggie nachos was super disappointing.  A lot of guac, a lot of sour cream, although they were not layered on top of each other but in separate sections of the container.  Meaning, I had a bunch of chips doused in just sour cream, a bunch doused in guac, a bunch doused in just refried beans--you get what I mean.  It was not pretty nor did it taste like anything I was craving.\n\n- I ordered over the phone so that I could skip the long line.  I ended up still having to stand in the long line just to get into the place since they have no system setup for easy \"to-go-pick-up\" orders.  Once I got in, the lady at the counter was no help what so ever.  She left me standng there looking like an idiot until I spoke up and said, \"Hi, I ordered over the phone.\"  And I don't know why but the customers that were there are some of the rudest people ever!  I know that it's lunch time and you're hungry but you don't have to act like a bunch of a55es.  They just kept mugging at me as if I was \"cutting\" them but what the hell is the point of ordering over the phone if I can't just come in and pay for my already prepped food which was sitting on the counter and getting cold and just get out of there already?  And as we were leaving, they refused to part out of the way until we squeezed through--R-U-D-E!!!\n\nThe only plus side to this experience is that I found out gourmet food trucks make regular rounds right in font of the Gift Center next door so the next time I even step close to Dos Amigos is because I'm stuck standing in a food truck line that's worth waiting for!", "author": "Ivy Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-02", "description": "Overpriced, amount of food they serve is not worth the price you pay.  The killer part was when I asked for some guacamole (75c xtra)  The lady took a teaspoon and plopped it on top of my food.  Then I asked for xtra guac.  This lady shook off the rest of what was onm the teaspoon!!! I was too threw.  Never again.  For much better mexican food during lunch  time that's worth the price head over to the Iron Cactus on 4th st", "author": "Tatiana T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "The spicy chicken is really good, all white breast meat (well for the most part). The taqueria is simple but the quality is good. This is definitely my go to spot for some quick tacos!", "author": "Tracy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "I was impressed. The quesadilla super suiza was the bomb. Every bit as good as el farolito (also the bomb). It was a little more expensive though. 10 bucks for quesadilla, chips, and drink. I definitely recommend it though.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-07", "description": "Ok, I love this place. It's in the randomest location, and it closes early, bc it's in such an industrial area of town. But their burritos are AWESOME. Such fresh ingredients ... their salsas are the best. You have to get the verde chicken if you're doing the chicken burritos, and if you're doing veggie, get both the red and the green sauces. They have baby burritos ... I love places that do that, bc I never eat a full burrito. They give you the option of wheat tortilla, as well as jalepeno, tomato, or spinach. And the burritos are well wrapped. I hate it when your burrito is so overstuffed that it's popping out of its tortilla, and is completely unwieldly to eat. But the people here always make them well. \n\nI've never had anything else on their menu, bc never felt the need to expand beyond the burritos.", "author": "Antara B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-23", "description": "let me get this straight, I just payed ten bucks for a piece of shit burrito but theres \"no public restroom\" for customers to go wash their hands??? Interesting...the steak taste disgusting and there was a bone in it I couldnt even finish my food and I ALWAYS FINISH MY FOOD", "author": "H G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-22", "description": "Don't be tempted to get the $.25 chips & salsa - it's the worst I've ever had! They should call it Extra-Stale Chips & Red Pasty Glop. My super burrito was OK.", "author": "Jim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-16", "description": "Shrimp quesadilla - Crispy, lots of shrimp, cheesy.  Perfect.  Make sure to get the salsa too, one of the best in the city.", "author": "Henry H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "Conveniently located near my office.  I go here somewhat often as it is quick and easy.  The buritto's are pretty good but I hate how the asian lady always tries to jack me of chips and salsa. I have to ask when they are sitting right next to her.  Really annoying.  $8 for the super buritto = I should get some chips w/o asking!", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "It saddens me to read the low reviews of this place: most seem to decry the business of the place (which is an indication of quality) or the lack of substantive guac and salsa sides you get for free.  If that's your only consideration then perhaps it deserves three stars, but those complaints aren't an indication of quality.  \n\nThis place serves the best carnitas I've had in SF so far, and my sample size is roughly 15 taquerias.  I don't think you'll be disappointed with anything you get that has carnitas: meaty, crunchy, moist, delicious.  Nuf' said.", "author": "Eric M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "what i ordered... super burrito with bbq pork\n\n...good fillings from rice to guacamole and the chopped bbq pork mexican style was flavorful, so cumin(ny) with no hint of sweetness...\n\nchip and salsa were sold at $0.25 which were so nasty... chips were hard and stale, and salsa was kinda fishy.\n\nambiance... ok(hole in a wall but sidewalk table's and chairs were availble)\nservice...ok\ncost...$(fair)", "author": "Gors P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-25", "description": "Not too bad and nothing too great about this taco joint. I got a fish taco and regular carne asada taco. Fish was not Ensenada (baja) style I was hoping to find, but then again very few fish tacos up this north are. There was bone in my carne asada, but the salsa was good and spicy like I asked for. El Tonayense makes a much better taco for less. \n\nAlso I witnessed the restocking the rice and saw plenty of that heating water drip into the other foods. Not that big of a deal, but not fun to see... My co-worker swears by the pulled pork burrito with this magic orange sauce. So I'll take his word and raise my meh 2-ish to 3 stars", "author": "Matt A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "Great.  made to order.  Meaning, the put the burrito together in front of you.  You tell them what you want.  Most everything seems nice and fresh, but as usual the tomato salsa or (pico de gallio) is sometimes way less then fresh.  I like this place once a month or so.  The hot cause is nice.  I am pretty picky about burrito places.  So 3 stars is good.", "author": "Christopher F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-01", "description": "Nice alternative to Dos Pinas. I like coming here because their food looks and tastes fresh. I agree with others that the skimp on their meats and their sides, especially if you order a super burrito. They are pricier at 8 bucks for a super burrito.\n\nThere's generally a line but it moves pretty fast.", "author": "Brian W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-11", "description": "It was 5:30pm on a foggy Friday night. My co-worker asked me if I had heard of the new Mexican restaurant opening next door to the SOMA REI. I figured her boyfriend was planning on treating her to a hot date with spicy food to kick off a mucho caliente weekend.\n\nI bumped my sleuthing up to number 11 and went to google maps \"stalker view\" to see where on the street it could be. Hmmm... that's odd. Only warehouses and REI on Brannan. I couldn't find it on Yelp. I couldn't find it on google. Time to get resourceful. I called REI and asked for help.\n\nREI guy: \"Thank you for calling REI, San Francisco's friendly sport outfitter.\"\n\nMe: \"Uh... hi. I have a really weird question.\"\n\nREI guy: \"Great. Can I please place you on hold?\" *click*\n\n1 minute later...\n\nREI guy: \"So... tell me your weird question.\"\n\nMe: \"Uh... I hear there's a nice new Mexican restaurant that opened up near you. Do you know what it's called.\"\n\nREI guy: \"Oh... you mean the hole in the wall? Yeah, it's tiny. I have no clue what it's called but it's right next door.\"\n\nMe: \"Oh. Ok, thanks.\"\n\nI apologized to my co-worker that her BF was going to take her to a hole in the wall burrito joint for their hot date. She laughed at me and said, no, I just was thinking we should try it for lunch sometime!\n\nSo we did. I recommend sticking with the baby burritos. They're about the right size. There's a decent selection of meats in sauces, beans and the hot sauce is hot because of diced peppers. There is the requisite Jarritos and cane sugar Coca Colas in glass bottles. But you have to ask for chips and guac for your burrito. Lunch time is getting packed a bit, but it's not that long a wait.", "author": "Brady K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-22", "description": "These guys are awesome! Same dude is always there. Its clean and hot an real tasty. O and they have a goat cheese and cactus burrito!!", "author": "Andrew S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-07", "description": "This is pretty good taqueria.  The place is fairly small, normally I would get to go..  Pastor burito for me and vegetarian quesadilla for my husband and we're set for lunch...", "author": "Pikachu P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-15", "description": "*UPDATE*\nI work in 650 Townsend, so dos amigos is probably one of the closer places I can go without paying more than $5 for lunch if I feel like grabbing a quick bite.\n\nMost recently I ordered 1 order of chicken tacos (it's kind of like 2 tacos b/c they give you two corn tortillas, and enough filling to make two tacos. And they give you chips and salsa (still not enough salsa for my chips), and it was so cheap! \n\nTastes decent as long as you eat it when it's hot! (still not better than Guadalajara in Davis)", "author": "Irene C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-12", "description": "I really enjoy Taqueria Dos Amigos.  \n\nJust devoured a Prawn super burrito, and it was truly fantastic.  Well proportioned, high quality ingredients in a well constructed wrap.  Their chicken quesadillas are excellent too.\n\nClean, well run establishment with friendly service!", "author": "shaun l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-05", "description": "Decent burritos. It is a half a block from work so it's super convienient. Kinda overpriced tho (for a non-sit down place). For an 8$ burrito I expect it to be deep fried and covered in cheese....or filled with gormet items...or some other thing that would justify taking all my moneys.\n\nEDIT\ni just ate there for the 2nd time and the carnitas was 75% fat. EWWWWWWWW. grissle party. They're lucky I didnt dock all of their stars.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-17", "description": "Just because they are right below my office building and just because they serve food a little cheaper then the cafe in my building, i come here. when i'm lazy to run out to get traditional chinese food, i come here to get a quick togo and bring it upstairs without worrying about looking for free parking again. \n\nthey can give you a lot of stuff in whatever you order. make sure u don't add random stuff that is not offered or you'll be charged with extra servings of this and that. \n\noverpriced it is, that's why i used my company credit card to pay for this stuff so they can pay the 3% on that credit card charge. HAHA\n\nBTW, don't every eat @ this location. take it to go, i'm sure you'll enjoy it more. also make sure you don't togo it to a place where it's far away because everything will get all soggy.\n\nBTW the place is owned by ASIANS and operated by mexicans or latinos. not a genuine place if you want real food.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-11", "description": "Taqueria Dos Amigos is a welcome addition to the SOMA neighborhood that is very populated with nice sit-down food, but not too many grab and go options.  Given the limited competition, this place is probably going to have my business for a while.\n\nOn the burritos - they have super (includes cheese, sour cream, and guac), regular, and baby burrito.  The super is about $7.  I think these burritos are enormous and taste good.  I've had the spicy pollo with hot salsa twice and feel good recommending that if you like stuff that's on fire.\n\nFew gripes outside of the fact that they are only open until 7PM and they serve not-homemade tortilla chips.", "author": "Mandy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "I promise to start up my diet again... tomorrow.\n\nStopped by and couldn't help myself - ordered the super nachos with carne asada.  YUMMY!!!  Of course, they just microwave it to melt everything, but basically it's nacho chips, your choice of beans, cheese, meat, guacamole and sour cream (I don't like salsa) all piled on top and melted together.  WOW!  Grab a fork, because these chips are messy.  Good messy.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-27", "description": "Finally, a decent take-out burrito place within walking distance of my work!  Prices are a little steep, but the quality is good.  They even have a couple of small outdoor tables.  This place will definitely become part of the lunchtime rotation...\n\nRandom details gleaned from the takeout menu:\nTagline: \"No M.S.G., No Lard, No Preservatives, No Bull\". \nIt appears to be run by the same people that own Taqueria Miraloma: http://www.yelp.com/biz/Gha_YUsPQowGrY14NEFPOA", "author": "Josh L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-30", "description": "Dos Amigos is my work-neighborhood taqueria. I can, for the most part, only say good things about Dos Amigos.  However there is no nearby competition, (that I can quickly get to during a 30 minute lunch break) so it's monopoly on Mexican food in this corner of SOMA has left me happy that this place exists as a lunch option.  \n\nComplaints:\n1. The prices are a bit higher than the Mission and the portions are smaller.\n2. Dos Amigos does not sell the infamously cheap classic of rice, beans, and cheese.\n3. The guacamole and sour cream are so cold that when added to the beans/rice/meat, the burrito ends up being cold. I highly recommend you ask them to heat it! \n4. They erratically assess a $.5 fee for card-purchases under $10.00.  \n5. The black beans are sometimes slightly undercooked.  \n\nWith that said, the service is fast and the quality is generally quite good.", "author": "Stanley E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-13", "description": "My husband was in the neighborhood near REI. He wanted chinese food for dinner, but he happened to drive past this place. He calls me up 'you want mexican instead?' My answer (very rare)-Sure!\n\nMy only requests: black beans, chicken, and wheat tortilla.\nTo my surprise, he brings home what I ordered. And the only thing he changed was the tortilla-spinach instead of wheat. To me that is just as good. And for himself, he ordered the tomato tortilla, but with refried beans of course.  I was starving after my evening workout and we both devoured the mega burrito. The only down side was that the chicken was dry. Oh and the price is on the high end for taquerias.", "author": "Mauling W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-22", "description": "\"Ehhh\" is the best I can say.  I'm a Texan and no hole in the wall Mexican joint has scared me off yet.  But you had better have good food.  This place is a tiny hole in the wall with not-so-good food. \n\nI ordered a vegetarian burrito: rice, black beans, guacamole, salsa, cheese, & lettuce.  If they can't do this right then there is no hope for the meats, etc.  The rice was cold.  The beans were HARD.  They were skimpy on the guac (how rude!).  And the chips are in little sandwich bags - clearly rebagged from Costco or the like. \n\nAll in all not a fan.  More than one star b/c it didn't make me ill.", "author": "Kathryn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-13", "description": "Went here for the first time this weekend. We were in the neighborhood and happen to pass it. It's a cute little Mexican place. There are a couple tables inside and about 5 outside. We ate outside since it was a nice day.\n\nThey had great food! My boyfriend and I got one of the meals, split it, and we were both full. We got soooo much food for only $10.00. The food is really good. If you're one of those meat eater people (like my boyfriend) they have several different things to choose from. They had like 6 different kinds of chicken, 3 diff kinds of pork.....etc. \n\nThe staff was really friendly, too. \n\nWe will DEF go again, or order for delivery!! :) YUMM", "author": "Stacy M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "Delicious! Nachos are more than I can eat and the burritos are delicious as well. Get the horchata. I never would've found it, but I was walking from my girlfriend's over to REI. Really happy I did!", "author": "osmahn k."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-02", "description": "I can't say I was really impressed.\n\nI live next door to El Metate, so maybe I'm spoiled on taqueria fare.. but this place was pretty bad.\n\nIt's close to my work, so I can't help but wish it was a bit tastier, but in additionally to being a little overpriced for a taqueria (okay, maybe due to the area, but still..) it was really poor quality.  My beans tasted stale and dry, like they'd been microwaved and left to simmer under a heat lamp.  The building is cramped and crowded, with barely enough room to order and stand in line for more than six people at once.\n\nThis is fate's cruel hand at work.  \"Behold!  Burritos next door to your place of employment,\" and when I finally got my scattered brains together enough to remember to go.. BZZZT.  GAME OVER.", "author": "Juliette S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-11", "description": "When deadlines are coming up, with no time to walk any further than a block, my stomach is growling, demanding to be fed with anything, this is where I go to get a quick to-go meal. \n\nIt's overpriced, but does the trick for someone extremely lazy and willing to fork over the money for convenience. Since this is the closest food source to my work, I've tried almost everything on the menu hoping to find something decent that I can rely on. So far I've had cold quesadillas with unmelted cheese, tasteless enchiladas, tasteless tacos, and tasteless burritos. I don't get why the flavor is so lacking. I keep asking for spicy salsa and sometimes I wonder if there is any salsa in it since I can't taste it. Am I losing my taste buds?\n\nI'll tell you what I do like. I like that they wrap the $6+ burritos extremely tight in foil. Makes it easier to eat while multi-tasking without making a mess at my desk. Also they're super fast and efficient, so I don't have to spend more than 5 minutes getting food if I'm in a rush.", "author": "Victoria N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-21", "description": "Yet another \"if you're eating here, you must be working here\" place.  I hope you work here, anyway, because there's only a few mini sidewalk tables to sit at and they fill up mighty fast at lunch, so you might have to take your food back to the office.  Despite numerous reviews complaining about cold cheese, my baby burrito actually came out just fine.  But like many of the eateries around here, it's definitely overpriced.  Sure, I may be stuck in this area for lunch, but I can always get my burrito fix at Miraloma Taqueria when I get home.", "author": "Wes M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-20", "description": "Pros: Edible food. Not a lot of other choices in the area\n\nCons: Expensive. Nothing fantastic. Not spicy.", "author": "Matt W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "The freshman entry of Dos Amigos into the SOMA/Gift Center neighborhood is a welcome one. Nestled smack dab in the middle of Brannan between 7th and 8th next to REI, Dos Amigos is easy enough to walk to from where I work. This would be a challenging drive-up because there is only commercial metered parking out front. Eating in is also a challenge because of the two-seater \"tableitos\" situated on the sidewalk right outside the hole-in-the-wall.\n\nI must have a less discerning palette than a lot of folks who have reviewed Dos Amigos, but I think that their food is satisfying. The flavors are a comfort to one searching for the flavor of Mexican food, and is not a schmancy reinvisioning like Chipotle. The Carnitas is \"porky\", the Carne Asada is \"beefy\". The prawns are...delicious.\n\nWhile Dos Amigos is not stellar, neither are they sub-par. Don't fear to tread into this hole-in-the-lengthy-wall because you will not be disappointed.\n\n*I recommend the refried beans, the tomatillo sauce, Carnitas (burrito, Taco Salad), Chili Verde (burrito) and Prawns (Quesadilla).", "author": "Rey T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-05", "description": "I have a love/hate relationship with this place.  I love to get food from there but I hate to pay the prices I do for it.\n\nTheir carnitas are really good and i want to try their tostada salad but paying 6.00 for a baby burrito and 8 dollars for a small and I mean small tostada - you can get a bigger taco shell from Taco Bells people - just doesn't make sense to me!", "author": "May A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-27", "description": "Plus - close to my house and tasty.  Living in SOMA can be a challenge when it comes to places to eat.\nMinus - kinda on the expensive side for a burrito. \nI'll probably be back due to the ability to get quick and tasty food without venturing too far, but not going to  make it a regular pit stop.", "author": "Joanna C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "AMAZING prawn burrito (my husband and I make a point to visit every time we're in SF and ALWAYS get the same thing).  Kind of pricey ($8) if you can finish one by yourself...but they're big so we always manage to split one.  Outside seating only and very few tables at that.  But if you're there on a slower day or are grabbing to go...perfect.", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-13", "description": "Split a super burrito with the bf. He selected the mole chicken and it was pretty good. A little to sweet for my taste. It was sweet and tangy like bbq sauce. The bf enjoyed it. Definitely couldn't finish a whole burrito to myself. The horchata was blah...I probably wouldn't go back.", "author": "Chauanh D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "seating/space/service:\n- there is virtually no space to sit inside (two seats, maybe)\n- outdoor seating is nice, assuming the weather is (which south of market is the majority of the year).\n- regardless of how nice it is outside, it's still on the sidewalk which means a party larger than four people is either at multiple tables or is eating elsewhere.\n- i live on this block, so convenience factor plays a lot in my decision to go here. i really don't care about the above seating nonsense.\n- the burrito construction line is the cashier line is the 'waiting' line. when things are moving quickly, this isn't a problem. god help you if you want to order more than one burrito and there's more than a few people there: it will be unclear who is supposed to be standing where, who is going next, who is paying, & who is waiting for something.\n- how many tiny plastic salsa cups (get compostable, please) you get with your meal (or per tiny chip bag) is arbitrary and based on who is behind the counter.\n\nfood:\n- i always get the pulled pork & cole slaw burrito, which is 5/5 stars.\n- other burritos & quesadillas are decent, 3/5 stars.\n- optionally, they have a wheat tortilla (good) and a spinach tortilla (meh) \n- their guacamole does not impress me, it gets worse the later in the day you go\n- i keep chips at home, so their insulting policy of charging you $0.25 for a sandwich bag of 10-15 chips doesn't impact me. negative stars for the times i've run out at home and pay for them anyways.\n- the pico de gallo/salsa fresca is underwhelming and detracts from the better food\n- no salsa bar/no unlimited [or reasonable defaults of] salsa is insulting\n- the hot sauce (sauce, not salsa) is awesome - 5/5 stars.\n\ntangental:\ni like the hot sauce. so much so that i would buy a half pint every time i go there. why don't i? although you can get 1/2 pints or pints of salsa, guacamole, rice, and beans: hot sauce is not on the menu. occasionally someone on staff has been smart enough to realize that selling a few pennies worth of hot sauce for more than a hundred pennies is good business sense. perhaps they are less financially driven and just have the good sense that bickering over some pureed tomato and pepper isn't good customer service. i dream that one day the wisdom clicks and the rest of the staff follow suit. at this point, i ask to buy half pint just to see what happens.\n\nwhich leads me to the day manager (owner?). the profitable hot sauce logic escapes & asking her to contemplate it angers her. she berates the staff for problems outside of their control (see above re: lines/space issues). thankfully, she doesn't seem to work there past about 5pm or on weekends.\n\noutside of the mission, this is one of the better taquerias i've been to; even with the insanity of denying someone who wants to pay an order of magnitude above what the product costs to make. \n\nso if you're reading this, Taqueria Dos Amigos, please put 'hot sauce half pint/pint' pricing on your menu board and we'll pretend it was always that way.\n\nuntil then, you know i'm just going to keep asking every time i come.", "author": "bill f."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-28", "description": "can't figure out the 3 stars and below reviews.\n\nif you are looking for something different, try their specials:\n1) bulgogi burrito (korean bbq with onion & bell pepper) - best as tacos\n2) pulled pork and cole slaw\n3) meditteranean with black bean (this one is my personal fave and also good for vegetarians!)\n\ni'll be back again and again for #3, i can't get enough of it!", "author": "Josie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-07", "description": "Convenience is really what brings me here as I work literally 500 feet from this place.  So when I'm craving a burrito for lunch this is my place!  I usually order the vegetarian baby burrito with half black beans and half refried beans on a wheat wrap.  It's tasty, always hits the spot, not over priced but nothing spectacular on taste.  I like the complimentary chips and salsa.  I should also point out they have several mini tables set up for outdoor seating--always an added benefit in my book!", "author": "Jennifer B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "Got the vegetable burrito stuffed with freshly sauteed zucchini, peppers, cauliflower and broccoli. Yum!", "author": "Donna W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-25", "description": "I feel a little crappy giving this place 2 stars, but as the rating system says, \"meh, I've experienced better.\" I feel crappy because the staff is courteous and the place is clean -- plus it's the only burrito place besides Urban Taqueria that's located this side of the Gift Center. I agree with Krist M. -- the food is unexciting and tastes out of a can. Definitely better than a frozen burrito, but not up to snuff when compared to other taquerias in SF.", "author": "Dan E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-02", "description": "The past month marked the grand opening of Dos Amigos Taqueria just around the corner from my building.  This was a heavily anticipated opening, as tacos are right in my lunchtime wheelhouse, and the bare rudeness of my current options leads me to fantasize over any newcomers to the scene.\n\nUnfortunately, Dos Amigos underwhelmed in nearly every regard.  Let's start with pricing:\n\nAt $2.85 per taco, this is the most expensive taco option within my lunch radius and perhaps within all of San Francisco proper.  The pricing scheme leaves the consumer in stuck between two less-than-ideal lunching nodes:  Do I go for a reasonably-priced yet less-than-fulfilling deuce-taco combo?  Or do I buy the third, ensuring fullness (likely even stuffedness), but launching the lunch price tag into the $9 range pre-drink?  Neither option is a catastrophe, yet neither is anywhere near ideal.\n\nTortillas:  Plus points for white corn, minus points for steaming instead of quick frying.  A steamed taco tortilla is a recipe for a mess -- the tortilla must act as a meat hammock of sorts, and steaming lends to the burstability of this support system.  Steam my flour tortillas for my burritos, but do NOT steam my tacotillas.\n\nMeat contents: The options were standard (Carne Asada, Chicken, and Al Pastor) -- but the meats were sitting in BINS getting COLD.  Taco meat should come straight off the frying surface and into the taco without passing GO or collecting $200.\n\nCheese:  I had to shout in order to keep cheese off of my taco.  They were forcibly placing cheese on tacos.  This is an offense against all tacos everywhere.\n\nSalsas: Lacked punch AND pizazz.  Did not lack water.  Soaked through the tortillas almost instantaneously.  The resulting meal was more like a taco salad that I would NEVER have ordered in the first place.\n\nI thought I was about to make Dos new Amigos.   What a bummer.", "author": "Ben A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "If you order the right stuff here it's pretty darn good. I love the superburrito with black beans and pollo verde. Vegetarian burrito is also solid. Perfectly respectable chicken nachos, and they're generous with the meat. However there are a few cons: basically no indoor seating, tough parking, and a certain lack of authenticity. No aguas frescas, lousy horchata. Still, overall I give it a thumbs-up.", "author": "Dave S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "Had the steak burrito, very legit in my opinion. Nothing super special but above average. Still can't figure out how/why Mexican places in SOMA can charge $8 a burrito though.", "author": "Matt Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-07", "description": "It's lunchtime Sunday, and I hadn't eaten for a good 24 hours (pretty much since a late breakfast Saturday), so maybe that's some context for why my carnitas tacos hit the spot.  But they did.   Eat 'em hot.  (They lost a little in the transportation to work, where I am now, having just wolfed my tacos.  But they were pretty tasty.)", "author": "Laurel B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-19", "description": "Had dinner here the other night with my friend. Though there was only one worker on staff, he handed out pretty large portions and really hustled in the back. The steak could have been a little bit more juicy and flavorful. But, this place sure beats many of the Mexican places I've been to in the city.", "author": "Jj H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-15", "description": "the baby burritos are decent - I just got a chile relleno it was pretty much the worst one I have ever had.", "author": "shawn p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-13", "description": "Fairly average Taqueria but its located in SoMa, one of the few that is. \nIts clean though, thats for sure.\nThe highlight is that they'll do a chocolate mole super burrito which I haven't found anywheres else, but unfortunately you need to be here when it opens to get fresh food on the weekends, or else the food is stagnant.  Maybe weekdays are higher turnover leading to fresher food, I don't know, but be careful on the weekends.", "author": "Johan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-10", "description": "In a neighborhood seriously lacking solid, quick, and cheap lunch spots, \"The Two Friends\" as it has become known, is among the best for an easy lunch during the week. It is fast, the meat is pretty quality, but best of all the burrito technicians here have perfected the art of the \"The Spread\". Ya know when you get a burrito and the ingredients are all unevenly distributed and you end up with a 2 inch pocket of sour cream? Yeah? You hate that? Me too. At The Two Friends, you may notice a quick manuever - often undetectable to the human eye - in which they evenly distibute the ingredients into even bands through out the delicious cylinder. If they don't already teach that at Burrito College, they should. 4 stars for sucking less than the other places around my office.", "author": "Heavy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "Dos Amigos is good.  Right next to REI on Brannan.  Try the Carne Asada.  The service is quick, friendly and the food is good!", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-27", "description": "We were in the area and found ourselves super hungry at 1:30.  Driving along, we spotted this taqueria and decided to give it a try since there weren't many options in the area.  Since dinner was at 6:30, we didn't want a huge meal.  I ordered a \"super\" taco with carnitas and my hunger was baaaaaarely satisfied.  The taco tasted fine, but for $4.45 I was expecting a little bit more food.  There are tables outside to eat which is great if it's not freezing cold, but there are only 2 tables in the place itself.  Like those \"restaurants\" at SFO, go here to get overpriced food since you otherewise don't have much choice!!", "author": "Tim L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-10", "description": "Dos Amigos puts out good food. The decor shouldnt even be a thought in your head since its a small place that is clearly set up for you to take your burrito on the go.  I got a carne asada burrito that was damb good. I live down the street and a quality burrito in this area is going to be well received by the neighborhood.", "author": "Michael G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-12", "description": "First of all, those 5 tables you see outside when you go by REI are the entire seating area. Then the pricing is clearly for the Exhibition Center/Gift Mart (i.e out of town) crowd. The food is very average. My gripe with my taco was they take a hamburger-type take out box, stuff some tortillas into the bottom, and then pile on the toppings (meaning mainly lots of lettuce), so there is no possible way to pick up the taco. It is like a taco salad without the deep fried goodness.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-05", "description": "I love this place. It's close to my work and I am a Mexican food fan. Today I tried their cactus burrito and i'll get it again. Generally I eat their vegetarian burrito with black beans and i've never been disapointed. They are large burritos and they taste good. I take them back to work and eat em, so I don't mind that they only have a few tables outside... all in all, I say they hit the spot and wouldn't ask them to change a thing", "author": "Bret C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-27", "description": "ok im sorry this might be an ok taqueria by SF standards...but the quality is very baddd....the pinto beans are white (clearly out of a can) as are their refried beans...their chips are store bought lacking the crispiness of freshly made ones....their meats are over seasoned/marinated (the burrito drips with grease when you get it) and everything is overpriced for what you get....the Urban Taqueria up the street near Trader Joe's is a lot more savory and cheap! I honestly don't understand why this place is always busy...", "author": "Sancho P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-21", "description": "Dos Amigos fails to impress yet again. Just finished up my super carne asada burrito and though I'm about to go into a food coma, I find myself wishing I would've gone to Dos Pinas instead, or better yet, Luna. The reason I even bother giving it a chance is due to the convenience of the location. What's not to like? Alright, let's get started.\n\nThe service is piss poor. Somebody please teach these ladies how to smile. A lesson in paying attention would also help. On both occasions I've been here, they've screwed up our order. This should be pretty elementary stuff, really. I mean, I'm there the whole time, picking out beans as they are making my food. But as you're getting excited about that sour cream and guac getting thrown into the mix, your super burrito is suddenly demoted to a regular and rolled up without the crucial aforementioned ingredients. After correcting an order, whomever screwed up will look at you and infallibly go \"Oh, you didn't order that.\"\n\nService aside, let's talk about the food, which is mediocre at best. As someone already mentioned, this is a lazy taqueria where everything is in bins from which you make your picks, rather than freshly cooked up on the stove. This doesn't necessarily have to be so bad, but the least you could expect is that the binned meats are of good quality. Let's just say I had to pick out two pieces of unchewable fat out of today's carne asada burrito. What's worse, the super nachos were carelessly thrown together and shoved into a microwave to be transformed into a nasty, soggy mess. If you care at all about your nachos, the preceding sentence hopefully already made you move on to another lunch option.", "author": "Patrick M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-07", "description": "I discovered this place a few weeks ago, located in the designer district snuggled against the Concourse building. It is the only mexican taqueria around the area, and as far as I know, in eastern SOMA, and it truly is a gem. You get about 10 different choices of meats on your burrito, including chicken mole, carne asada, spicy pulled chicken, etc. I recommend the baby burrito, which has all of the ingredients of the super burrito, but is, ta da, smaller (and about $2 less!) Still a filling size and served with sour cream, guacamole, rice, beans, and meat. I am hooked to this food, and travel out of my way to get here when I am craving Mexican. This review is all about the food, because there are some inconveniences, such as no real dining area and no bathroom ( you have to go through security next door to pee! )", "author": "T W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-27", "description": "we went to this place earlier this week for a lunch break from shopping at jewelrymart for possible wedding jewelry. i got a vegetarian taco (black beans, rice, salsa, cheese, guacamole, sour cream, lettuce...). it was big and yummy, but messy! my sister ordered a chicken burrito and it was pretty messy as well and dripped all over, but she liked it! we also ordered nachos to share, no meat. yes, they were microwaved but they were really good! my sister also got a drink and it was just under $20...didnt seem too expensive to me.\n\nso i had no problems at all with the food, but women working the counter were completely unfriendly, which is why i am lowering my stars. they didnt seem to enjoy being there and were behind the counter texting while we were deciding what we wanted. not that its really that bad, but....i dont know, it just rubbed me the wrong way.  and they have like no seating inside, and all the trash cans were full.\n\ni would go back if i was in the area!", "author": "jenny s."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-10", "description": "This place has never had good food.  The service has never been good.  I always leave feeling I was ripped off.  I think the cashiers charge different prices.  I know this because I have paid different prices for the same items at different times.\nBut this is what I'm most pissed about.  A BEE BEING served in my vegie quesedilla.  When I brought the bee invested product back to them, they gave me a hard time.  DO NOT EAT HERE.  Walk to the mission and get some real food.  This place sucks.", "author": "Dominic P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-14", "description": "Stopped here after an event at the Concourse.\n$10 and some change got me a burrito with a soda.\nNot bad, nothing special.\nAte at the table's on the sidewalk.\nWas hoping for more room inside to eat but it is pretty cramped.", "author": "Anthony A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-25", "description": "The taco here was quite all right! Their burritos even better! And they actually make mole pollo which you can throw in your burrito! It's not mole negro, it's a more traditional typical red/brown mole sauce. Not spicy. Just very tasty and delicious! I had the super burrito with the mole pollo (that's chicken) with the whole works, sour cream, salsa, guacamole, etc. SO BIG! So scrumptious! So warm! I devoured the whole thing in one sitting. The location is pretty random. I think they get a lot of customers from the Hispanic locals and from folks who shop at either REI or the Jewelry Gift Center because this little taco joint is situated smack in between these big buildings. Works out great if you want a good bite but don't want to deal with the hassle of parking elsewhere or walking far to find a place to eat. I had a bit of the diced chicken which they allowed me to try before choosing my meat for my super burrito. It was tasty and tender! The carne asada was smoky and well-cooked (I usually like them a bit tender or pink) but the carne asada was minced well so it would blend very well with the burrito. Price was fair for what you're getting. Toodle a loo!  :)", "author": "Pamela L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-10", "description": "This place is not bad.  Nice and close, prices about average for the area and they're fast.  Would prolly recommend the green pork and the shrimp quesadilla is tasty.", "author": "Monkey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-01", "description": "this place is in the middle of nowhere in soma, but totally worth the 15 min walk from my office!  The food is solid and far superior to Victor's (the other taqueria in the area with that \"GUAPO\" lady).", "author": "Stan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-30", "description": "mmmmm this place is super good!  they have bul go gi burritos, mediterranean burritos, and of course the regular types.    the chips and salsa are great too!   burritos are way too big for me to finish (which is awesome).", "author": "thien t."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-13", "description": "There's not anywhere else for Mexican food around but it is still better to do without rather than eat here. Raggedy, wet, and overpriced. The Costco chips repackaged in sandwich bags with small condiment container of salsa were insult to injury.", "author": "Arptro H."}
