{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "Best carne asada burrito!!! I lived in San Diego for 20 years and went to Mexico a lot! This place mimics that flavor in all ingredients of the burrito to remind me of Mexico!\n\nThank you, Taqueria Zorro! The super burrito is so worth the trek! PS it's $11.00 but you're paying for the sour cream and guacamole which is usually extra when asked to add to your burrito!", "author": "Danette A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-24", "description": "A huge fan of Taco Tuesdays!\n\nThe food is quite tasty and the portions are pretty large. I love their salsa bar and their salsa verde in particular! Be aware if you're eating in you can have endless salsa, chips come at an extra price. If you're taking food home you are only allowed to take 3 servings of salsa. This is the only downside for me. Taqueria Zorro is on my way home from work and I like to take food to go so I would appreciate taking a bit more salsa with me because it's so delicious!", "author": "Inci A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-08", "description": "After moving to Russian Hill / North Beach from the Mission, I had a serious withdrawal from Mexican food! Thank god there is Zorro to fill in that gap. They are almost just as good as the taquerias in the Mission but without the lines or hipsters everywhere. My recommendation is to just go with a standard Carne Asada Super Burrito. Super juicy, full of flavor, and gigantic. Just like a porno.", "author": "Henry W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Carnitas Zorro Buritto? So. Effing. Delish. Perfect for a Friday night!", "author": "Michelle G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "This taqueria is a solid place for lunch. I like to watch my dollars and for less then $10 you can get a descent burrito with all the fabulous trimmings. Of course the super burrito is a dollar more but you get pretty full just off a regular burrito. And you get complimentary chips and salsa ( the salsa verde is the bomb ).\n\nIn the city its hard finding places for lunch under $10. This place isn't an El Farolito but will satisfy your burrito craving for sure.\n\nThey have plenty of seating. The vibe is very homey with the traditional music and portraits on the walls. The staff is friendly.\n\nParking around here is tough, but it is a definitely an easy walk if you work nearby. \n\nMy suggestion for a parking is to park a few blocks away and walk towards Broadway street. It is very crowded since Chinatown is next door. \n\nMy burrito was just okay, it tasted a little under seasoned but I would much rather have it under seasoned then over seasoned to where I needed to toss out my lunch.\n\nHappy eating folks!", "author": "Kam H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "My family and I ate here yesterday! My husband and I ordered super burrito with carnitas. They were big for the price and tasted really good! The only weird thing is that we had corn and peas in it too! I didn't mind it but husband didn't like it. My kids shared the quesadilla meal. It looked and tasted good. Yeah it simple to make but it was good! Not oily! Would I go back? Yes! Also I loved what my receipt said at the bottom! Read yours the next time you order :) Thank you for the delicious food!", "author": "Ashley A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-18", "description": "I'm not sure if the food was good or bad to be honest. I was super hungry for lunch and went into this restaurant for a quesadilla and a beer. My bill was $10 which wasn't a bad price. They have a salsa bar with salsa that was really good and spicy. The cheese quesadilla was extremely oily. However it tasted really good. I feel like they could have used a lot less oil. One positive was I found a power outlet to charge my phone.\n\nThe bathroom situation was probably the worst part since you have to get a key, walk down a flight of stairs and wait for an individual bathroom that there was a long line for. Kinda lame. Overall this restaurant is just meh.", "author": "Jordan S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "Ordered super nachos with steak and a super al pastor quesadilla. Food is flavorful and they don't skimp, especially since it's bit pricey. \n\nI love the fact that they have a salsa bar, which is always a plus for me. \n\nOverall, I think I paid $24~ total and the only bad thing was that they gave me al pastor for both dishes but no biggie. \n\nWill I be back? Yes, since I live close by and it does the job.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-06", "description": "Unfortunately, I am very displeased with this restaurant. I ordered through uber eats, and specifically noted I wanted grilled steak and refried beans in my super burrito. When I started eating, I could tell something was off and turns out they gave me a chicken burrito with black beans instead. I am allergic to chicken and broke out in hives. Unacceptable if you ask me.", "author": "Samantha Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-15", "description": "Came here for lunch on a Wednesday. They had a burrito deal (all burritos $7.99)\n\nFood: I got the veggie burrito (wasn't discounted even when all other burritos are cheaper). It was kind of cold and wet. The veggies in it seemed like frozen veggies (peas, corn). There was basically no flavor and I wasn't crazy about their salsas either. I also got the mango juice which was way too sweet and tasted funky.\n\nService: No complaints on the service. Ordered and got the food within 10 minutes.\n\nAmbiance: Seems a little run down but has cute Mexican theme decor. Plenty of tables that can easily be moved to make bigger tables. \n\nOverall won't be back. -_-", "author": "Hayley D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-27", "description": "The one time I go with my gut to give this place a try beside the reviews it has received. As previous reviews have stated \"mediocre\" burrito that just filled you up. The meat didn't have any flavor at all-- almost felt like I was just eating a veggie burrito. \n\nDon't come here--", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "I ordered two chicken tacos and 80% of the tacos was lettuces.  I never had such horribles tacos in San Francisco.", "author": "Hector S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "In need of some late night grub, lo-and-behold this place was still open. It wasn't crowded at all so the service was pretty quick. I got the nachos since I wasn't starving and thought it would be a smaller amount of food but it was a pretty big portion! While it was decent, especially for late night food, it wasn't the best nachos I've ever had. Halfway through, I noticed some of the cheese wasn't even melted. That being said, it's a decent option in the area and maybe some of the other food is better, I'm not sure. I'd give it a shot again if I'm in the area and need something to eat but wasn't overly impressed.", "author": "Pooja C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-13", "description": "This taqueria is in a great location but it's just mediocre.\nThe super burrito is your run of the mill burrito. \nIt was filling, but it wasn't the best I've ever had.\nIt doesn't compare to el farolito or la taqueria.\nYou will have to park far away because it's on a busy street. \nOverall, if your walking through the area and want Mexican food. This place will do in a pinch.", "author": "Kevin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Late night delight. Grilled veg burrito was supreme.  The salsa could be better. Staff was nice.", "author": "Emile B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-12", "description": "I used to really like this place and I don't want to give it a bad review. But I just ordered pick up and 20 mins after when I came to pick it up, they only physically started to make it after I was there. They didn't seem to understand my order either. Didn't separate the chips from my nacho after I specified it. Just put the toppings on small bins, I was barely able to get out, forgot my refried beans.  After I got home, the chips were all soggy and I had to throw the whole thing out.\n\nI don't think their food is bad, they just didn't give a shit when they made mine.", "author": "Bowen C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "I have eaten at many Taquerias in general and many in San Francisco in particular: this is one of the better ones! A good burrito is an art to make, the ingredients have to be right and the method and manner of bringing all together is also a skill. Zorro's gets it right. I went with the Super Burrito steak. O man so full of rich flavor. And the meat was perfect i.e. I did not order extra meat. The side of chips are just right, and the salsa adds more rich flavor. The location is simple, just a place to eat without pretensions. So go as you are and enjoy.", "author": "Jimmy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "Came here looking for carne asada fries (Zorro Nachos) and my boyfriend ordered the Zorro burrito. I didn't have any of the issues with ordering the way everyone else did and our food came out without problems. The Zorro burrito was excellent with the fries being extra crispy inside. The Zorro Nachos were perfection and just what I wanted. I didn't expect them to be super crispy with all the toppings but they did try their best. My boyfriend remarked that it was probably the best he's had at Zorro's (he's been here many times) so I don't know how consistent the food is in quality and the fries in crispiness based on his comment but I hope it'll continue to be so so I can come back for more!\nThe restaurant overall is like any Taqueria and it isn't super clean or dirty. It's extremely casual and doesn't have much going for it, but it's the food that's on point.", "author": "Jenn T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "You need to try their Zorro Burrito. ¡It has guacamole and french fries! Definitely good food. :)", "author": "Brigitte S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "This is our go to drunk/hungover food. We typically get the veggie burrito & zorro burrito w carnitas or chicken. They fill it with a ton of good stuff (fries in the zorro) & the meat isn't dry. It's a good size burrito so there are always leftovers. Nachos are also good. \n\nThe food comes out pretty quick and they give you a side of chips and salsa lids to get salsa from their salsa bar. Love their late night hours !", "author": "danielle a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "This place might be getting a bad rap from being practically next door to a strip club.  But the Pastor is on a completely different level than the average shop.  Belongs in the same class as the Mission burrito shops.  Yup, I hella went there.\n\nJust get a super burrito with the pastor, gorge yourself on half, take the other half home for your 2 mooch roommates with the munchies.  There's some philanthropy for you.", "author": "J S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-29", "description": "Ordered a large chicken burrito bowl. Kinda light on the meat. Plenty of rice though....", "author": "Steven S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "Decent taqueria located right on Columbus that has a lot going for it, such as:\n\nLate hours-this place opens at 11am ish and doesn't close until 1 am. Perfect for the late night munchies.\n\nPricing-in this area everything costs more then you might expect. So tacos for three to five dollars? Quesadillas for six? Decent sized overstuffed burritos for nine ish bucks? Yes, please.\n\nFresh things. Do I really have to expand on this ? I do? Really? Ok, whatever, they have a great do it yourself salsa bar with a half dozen different options. That is always a wonderful thing to find in a taqueria. But wait there's more-the prep area in addition to being extremely visible (you walk/stand/wait by it before you get to the cashier for ordering.) is always hot and fresh. Nice. They also have a house burrito which is kind of a fusion item. Burrito with fries in it. Just what the late night carbaholic needs.\n\nThe Mural. The dining area sports a full wall mural of an episode from Aztec mythology, replete with bathing maidens and leopard men. Bonus points for the little marker explaining the scene.\n\nThings that I'm overlooking for now but otherwise may cost a star or two:\n\nThe dining area can suffer from sticky table top syndrome, especially during the lunch and late rush times. \n\nThe staff can be a tad overworked, and thus will not respond to erratic herbal/beer impaired ordering with zestful enthusiasm. \n\nThe bathrooms are down a flight of stairs. Not cool when herbal/beer impaired ordering has occurred.\n\nOverall an easy four stars. Great late night food choice.", "author": "Steven W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "Stopped by Tuesday, June 16th after the Golden State Warriors game. Was out celebrating the win, so we needed some sustenance to counteract all the beer we'd been drinking.\n\nI decided to get a couple of regular tacos. They're normally $3.65 each, but since it was Taco Tuesday, they were $2.25 each. Score! Each taco comes with your choice of meat, onions, cilantro, sauce. I decided to get the Al pastor: bbq pork & Carne asada: grilled steak tacos. I actually wanted Lengua: beef tongue, but they were out. Both meats were tender and flavorful.\n\nMake sure to grab some salsas from the Salsa bar. They have Habanero sauce, Jalapenos, Green sauce & Red sauce. Since my order came with chips, I grabbed one of each. The habanero packs a punch, so you don't need a full container to add some heat to your tacos. A little goes a long way.\n\nGreat place to grab a meal after a night of drinking. I'd been craving tacos for a while, so this definitely hit the spot!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-19", "description": "Oh my WOW! The super quesadilla was absolutely amazing. The green salsa is also a must. We also got the super nacho which was good. The portions are huge so between the two of us we could have just ordered one or the other. We will definitely be making trips into SF to get a quesadilla here often!", "author": "Megan W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "Went here on lunchtime on a Friday. Ordered Zorro nachos. It was good. Had fries, onion, guacamole, chips. Around $10.", "author": "B C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "Ordered a Super Burrito for take out and felt it was decent, but not spectacular. I did like the fact the burrito was wrapped quite well for takeout and was glad that the burrito wasn't \"leaky\" and / or soggy. \n\nAnyhow, I would rate this place a 3/5 but will have to try some other foods out to see if it's better or worse.", "author": "Drew R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "The best tacos in San Francisco. Fast, clean and chip. Chicken meat is delicious. If you want eat mexican food near north beach area this place is number one.", "author": "Ufuk Emre M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-04", "description": "Their food is pretty decent. Prices are not too bad. I love how they're right next to my job and stay open late sometimes. The food comes out fairly fast. \nOne thing I LOVE about this place is their burritos.  Omg so wet and juicy. But their steak is not good. One time it wasn't cooked right and then last night it was overlooked. \nThey got my order wrong a few times too. Every time I say no onions I swear they put extra ‍\nTried their steak fries and before I ordered them I asked what all came on there and she put everything on it when I specifically said just queso,  crema, & guacamole. Anyways I might give this place ONE more try before I give up on them fully.", "author": "Chanel D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Had the Zorro burrito--packed with beef and it was both good and filling.  The complimentary chips & salsa was good, too.\n\nCan't wait to go back.\n\n12/2017 update\nBeen back here twice now.  Had the Zorro Burrito again and a Beef Quesadilla today.  The quesadilla was good and hit the spot but for the money,  the Zorro Burrito is the best deal.  This has become a go to place for me.", "author": "Jim I."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "I like this place. A local favorite and a quick dinner for me. Recommend the Zorro burritos cause I love 'em fries.", "author": "anomyous c."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-14", "description": "Overall cleanliness in the dining area doesn't seem to be super duper. \nThis could be a great burrito place, but the thing that was a total deal breaker both times I went was that the carne asada was so over cooked, it was all dried up, flavorless and nasty. It was actually crunchy. Whoever is cooking up the Carne Asada is cooking it way too long to let it get to this state. Very rookie move!", "author": "Jim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "Seriously so good. The food is real authentic Mexican food. I have been looking for a place like this since moving to the bay arrea. Its within walking distance of my work and the the food is so dang good. I usually call in my order and walk over to pick it up. All the girls I work with love this place and its obvious why. The people are nice and the food is bomb. What more could you want.", "author": "Sara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "Visited this place Thanksgiving weekend. Bare bones look, but quesadilla with guacamole was very good, and fairly large. My only issue would be that the order taker was very sullen and unwelcoming. I don't like mechanical service people, but a little cheerful would be nice", "author": "Jack W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-19", "description": "Solid mediocrity.\n\nIf you need late night munchies,\n\n& you're craving Mexican,\n\nI see it.\n\nOtherwise, I'd say pass.\n\nBefore Don Pisto's (a sit down restaurant w wait staff as opposed to a taqueria though) opened in North Beach, this was the only Mexican joint in NB proper.  Yeah, there's Taqueria San Jose #3, but that's way outta the way.  This is the hub.  Location, location, location.\n\nYes, they're open till 3 am on weekends.  You gotta love that, right?  Who hasn't done the too-many-cocktails-out-till-2-without-doing-dinner thing?  And anyone that has done the too-many-cocktails-out-till-2-without-doing-dinner thing in north beach, has come here.\n\nService is either cool or atrocious.  No eye contact, getting orders wrong, a long wait.  But keep your eye on the prize.  It's an old school taqueria.  Absolutely no frills.  \n\nTheir burritos are pretty solid.  Easily the best thing on the menu.  A friend of mine always orders the chicken quesadillas suiza, though, & insists they're good.  Better than average, though?  Nope.\n\nUltimately, a cheap Mexican place that's not really that cheap.  \n\n2 & 1/2 stars.", "author": "Veronica M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-19", "description": "I came here to eat with my friend and the chicken tasted raw and it was pink. The food is disgusting and overpriced, don't eat here.", "author": "L J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-11", "description": "Ordered Super Nachos with (our choice) of carne asada meat. Although the portion was huge, plenty to eat for two, the price tag of the nachos with two soft drinks was over $18. That's very steep even if the nachos were exceptional - which they weren't. The dish was loaded with sour cream, guacamole, salsa and cheese, but trying to find the actual meat proved to be difficult. I think they put more carne asada in just one taco. The flavors were decidedly bland - just meh. Also, a small bottle of Coca Cola came to $3.10! Ouch. I won't be back.", "author": "Phil T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-06", "description": "It's early in the morning, you're drunk as hell and all of a sudden you get this craving for Mexican food (if ya know what I'm talking about give me a high five! ) Luckily, you're also in North Beach and until the first train goes back to the subs you have a couple of hours to kill. You could forsake yourself one more time to have chosen the subs over the city as a place to live (read: sleep) OR you could just forget about all of this, feel happy that Cinco De Mayo is knocking on the door and step into this Taqueria named Zorro.\n\nWhat you'll find are all your favorite Mexican dishes and literally more than you could possibly eat, even in this drunken state of mind. Go crazy with delicious fish tacos ($4), big fat burritos ($7), quesadillas ($3), cheese over nachos ($7) and a massive salsa bar. Food coma guaranteed.\n\nOh, one more thing: there's enough space for you and your entourage. Come in and find out.", "author": "Sebastian F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Everything I personally expect from a taqueria. The California burrito (aka zorro burrito) is always delicious. I LOVE their salsas! I'm simply addicted to the green and red salsa they make and consume it in very unreasonable quantities. This place is always the good choice for a quick and yummy Mexican food.", "author": "Justyna M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "I was craving late night tacos and decided to Postmates from Taqueria Zorro because the delivery fee was only $5. \n\nI noticed that the prices of the food are a bit higher than other taquerias in the Mission. \n\nWhen I got my food, I can tell the ingredients were a bit higher quality. The onions in my tacos were slightly pickled (which I liked!) and had a purple-y tone. They were also sliced very thinly which was appetizing. They have heaping mounds of meat on the tacos, very generous portions. The al pastor and carne asada were both juicy and flavorful.\n\nThe only thing I regretted ordering was the chorizo torta (Mexican sandwich). The chorizo was very salty and tasted processed. \n\nHope the delivery fee stays cheap!", "author": "Jennifer C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-09", "description": "I agree with the other reviewer who said that this place is fine for late night munchies but little else. If you're hungry, craving Mexican food, and already nearby then go for it. Otherwise, don't bother.\n\nI got a taco salad with refried beans. The shell was crispy and there was certainly enough of everything but both the beans and the rice were so lacking in flavor that it was difficult to taste anything but the onions and salsa. It filled me up but didn't satisfy in the way great Mexican food should. My dinner companions had a shrimp taco and chips with guacamole. The taco looked fine but the guac was watery and bland like it had been diluted with something.\n\nChips were good and the salsa bar offers both red and green salsa, plus pickled jalapenos.\n\nService was friendly and helpful and the prices weren't at all bad for SF.", "author": "Ellery D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-01", "description": "Looks like the friend I came here with already rated this place with our experience! But here's mine -\n\nWe were craving carne asada fries and Taqueria Zorro popped up on Yelp. This may have been mostly my fault and the cashier didn't hear me clearly or something, but our orders came out as the Zorro burrito instead of the nachos (fries). Not a big issue, but we were both craving mostly just the fries part, just not wrapped up in a burrito. \n\nI lived in San Diego for a few years due to school, so I am very familiar - maybe too familiar - with California burritos and carne asada fries. I didn't have high expectations, but the burritos we had were surprisingly flavorful! It was so flavorful that it kinda threw me off - just didn't seem to pull the burrito together that well. I wish mine had more fries and for them to be more crispy/fresh, and less sour cream, but now I know what to expect. The size was decent and filled me up. My friend had a problem with his burrito because it was poorly wrapped. I kept mine wrapped up within the foil, so make sure you eat it that way if you're having wrapping problems.\n\nThere's water available near the salsa bar, however... there seemed to be really old limes laying at the bottom of the cooler as 'flavor'. I noticed right away but was thirsty. Mistake. Definitely tasted like old stale lime water... but I sucked it up and drank it all because water is water. :\\\n\nThe place was busy for a late Thursday night, so that was welcoming. Definitely one of the cheaper options in the neighborhood.", "author": "Shanise M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-29", "description": "Absolutely underwhelmed by the quality of my overpriced super burrito here. \n\nI came here to watch one of the Warrior's Finals playoffs games here one evening because they had a television in the back. I noticed the menu prices here at Taqueria Zorro are more expensive than your typical taqueria. I didn't want beans in my carne asada burrito burrito and asked if I could have a double serving of rice instead. The cashier denied my request :/\n\nThe steak inside my burrito was overcooked and lost any flavor it originally had. There was too much salsa inside my burrito, but that's just a personal preference. Their homemade chips came with my meal, but those also tasted stale. In a neighborhood dominated with Chinese and Italian restaurants, Taqueria Zorro failed to meet or exceed my expectations. I shall continue eating Chinese and Italian within the North Beach vicinity.", "author": "Philip M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-04", "description": "This Mexican spot is right in central North Beach. It may seem like a tourist joint, but I am a local, and I thought it was good. I had a burrito zorro that came with french fries and chicken. It was a good meal. I'd go back.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-03", "description": "The chips aren't great, and the prices are a little steep, but they've got a bomb California burrito. It's called the Zorro burrito, but it's a California. Instead of rice and beans, you get fries inside of your burrito, and of course you're going to choose some spicy, tender al pastor, which drips from its marination juices. Not the biggest or cheapest burrito you'll ever get, but they close at 1am, and everything comes out super quickly, even the burritos. It'll hit the spot for sure. Don't be surprised. Just because it's on Columbus, next to all the fancy Italian restaurants (and strip clubs), this place is still a hole in the wall. The tables are crooked, the seats are dirty, and the salsa bar is hopping.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "It has been a week since I last ate here and I'm still dreaming about their nachos. \nCame across this place after I left Rogue around the corner, ordered some nachos with half carne Asada and half chicken to go. Total was about 12-13$ if memory serves me right- I remember thinking was crazy expensive. I got back to the hotel and I could only eat about half of the order. It was so filling, tasty, and absolutely worth the money. It's on my list of places to visit next time I'm back in the Bay Area.", "author": "Heyyou C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-18", "description": "The worst Mexican restaurant in San Francisco! Bad service and over priced for Mexican food by far! $4 + for a very small taco LOL no way! Stay away!", "author": "David F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "I found this place to be an ok place to go to. Prices are not that bad comparing to the stores around it and the food was good. Here was my visit.\n\nWhen a friend of mine and I arrived there after the night event at The Exploratorium (totally should go there, it's a fun an interactive and serves drinks if you are 21+) we were craving for carne asada fries which they had it under the name of \"zorro nachos.\" When my friend ordered for us we later found out that the lady misheard her. Instead of zorro nachos, they gave us a zorro burrito which is totally different. I understand that human error can happen and we could've looked at the receipt to make sure that she put in the order correctly, but regardless, when you expect to get one thing and get another, you get a little disappointed (even then, the title of the food just read \"2 Carne Asada Zorro Bur\" which by glancing at it, you would think that your ordered is right). \n\nMy friend and I said oh well, we were hungry, and the carne asada fries were essentially the inner body mass of the zorro burrito. I opened mine and found mine to be not well wrapped. This caused my burrito to fall all of its bits out and into the plate and from there I finished it with a fork. Not exactly an ideal situation if you were to order a burrito. The burrito itself wasn't that at all, just a little strong in flavor to my taste. I feel that maybe they added a little too much onions on mine. \n\nOverall, I would give this place another shot to see what the Zorro chips are like and see what is the difference. If it impresses me, I'll come back. If not, I'll try find another place to eat that's near to the Exploratorium.", "author": "Tito G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-30", "description": "Satisfactory at best. Zorro's is good if you want decently palatable Mexican food but are way too lazy to venture into The Mission. All the burritos here have been just fine, but I don't think I'm going to come back because my body is a temple and temples don't settle for \"just fine\" burritos. The service here parallels the food: not crappy enough to complain about, but not great either. Mehhhhhhh - there are so many other cool lunch spots within a 5 minute walk from here. I'd only recommend Zorro's if you're desperate for average Mexican food.", "author": "Desiree S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "TLDR: https://media0.giphy.com/media/sryUjzuFelzKU/giphy.gif\n\nThis is a story.\n\nA story about a boy and his burrito.\n\nA story about a burrito that was wolf in sheep's clothing. \n\nPreparation was swift. No smiles, just lazy smirks. Handed over in a lukewarm foiled shell.\n\nThe boy cowered into the corner, alone, cradling this burrito.\n\n\"you'll ease the pain, you always do\" he whispered to himself.\n\nhe slowly undressed it with his eyes, running his fingers along its dips and curves.\n\nHe slowly peeled off the first layer and nibbled, just how it likes it.\n\nFirst bite: confusion.\n\nSecond bite: emptiness.\n\nThird bite: heartbreak.\n\nHe trotted back to his kingdom, disappointed, only to spend the next 20 minutes playing flappy bird (THE ORIGINAL) on his outdated smartphone.\n\nThe truth finally reveled itself: its called Zorro because it literally slices into your intestine and creates a pathway to exit your body in the most ungraceful way possible. \n\nConclusion, do yourself a favor and save some time. Just place that burrito directly into the toilet.\n\nThe end.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-26", "description": "I love tacos; I hate to call these fake places out. However, I ordered 6 tacos and was shell shocked with the $25 dollar price tag. Cancelled my order and hope y'all steer clear.", "author": "Moy G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-05", "description": "I could not be anymore disappointed... For staters I worked 3 years at a place similar to this. I am aware that costumer service is not a priority, I however was very disappointed. \n\n\nNow since I worked at a place very similar to this I knew better than to ask what items on the menu are not available. The cashier mentioned a few, but nothing of my interest.I ordered a torta De milanesa (fried steak sandwich), chicken nachos supremos, and a carne asada burrito. \n\nOnce the nachos were ready ,they informed me that they were out of bread, I wasnt okay with that, because  I had already asked If they could make me a torta and they had said yes.. Instead I asked for a refund. As far the carne asada burrito goes, they never made it for me, so I also got a refund. \n\nI understand how tough is working at a place like this, with only one cashier and two cooks. I been there, but how can you forget to serve me a burrito when we are the only ones there? How can you tell me there is tortas and then once i think my food is coming you inform mw there is no bread? I myself used to forget to serve food at times but I had a line that would end at the door and have cars on the drive-thru.\n\nNow the bathroom they have should only be used if you just cannot wait. It has a disgusting smell that I'd you decide to go in there you may end up saving money because you will no longer want their food.", "author": "Teresa Isamar D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-19", "description": "Why do I always crave Mexican in the wee hours of 2am?! \n\nEspecially when I'm in North Beach. Where there are a thousand Italian restos, but not a lot of taquerias.\n\nThankfully, Taqueria Zorro is conveniently open til 3am on the weekends to serve the clubbing/drinking/gentlemen club crowd around the area. Not to mention that New Sun HK resto is the nastiest thing (read: last choice, but salted fish fly lice, me love you long time!) after drinking and dancing all night.\n\nGive me carnitas tacos and some greasy nachos anytime. They also come with a salsa bar? ay carumba.", "author": "Janice C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-23", "description": "This place is the bomb, usually after a night of shenanigans this is a must stop for me. Usually after having a few drinks. I usually get a carnitas burrito \"Zorro\" style which is the beans and rice switched out with French Fries, or some places would say \"Cali Style\" The menu is full of options and the prices are reasonable. Defiantly one of my fav mexican food spots in the greater Bay Area.", "author": "Tre S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-21", "description": "So it's a given from my last review that I REALLY like the carnitas here. Crispy fried, yet moist on the inside, and wonderfully seasoned. Many more return visits, some sober ones even, I believe it's time to bump my neighborhood taqueria up to full stars!\n\nHere's a new find for me - the grilled fish tacos. (http://www.yelp.com/biz_photos/taqueria-zorro-san-francisco?userid=DvcAC_nlKaTDsHcA8Slagw#5PwMZRk5nRvZgCJLhpJhPw) So yummy. The fish has the nice charred flavor but was still moist. The salty seasoning was balanced nicely with the lime and the pickled red onion. Throw in some red cabbage for crunch and texture, you've got perfect balance of flavor and texture in every bite. It's now a toss up between the carnitas and fish tacos for me here.\n\nNot everything is a hit here - I found the lengua to be a little tough. However when you consider the nice friendly folks who serve you here, afore-mentioned carnitas and fish tacos, and not to mention great deals like $1.75 taco Tuesday and $6.50 burrito Wednesday, Taqueria Zorro is tough to beat in North Beach - A neighborhood fave.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-17", "description": "If you're in the area and want a late night bite to eat then I highly recommend this place. It's better than any other fast food you can get. Although it gets pretty busy in there and crowded with a bunch of drunk people, food is actually pretty good.", "author": "G A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "Newbie Californian just tried fries inside of a burrito. Pretty good. Def get the green salsa", "author": "Alexia S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "Got a chicken burrito and a few bites in realized there was a thick long black hair inside. $13 down the drain. Never going here again.", "author": "Alexandria K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "My favorite part is that they accept Yelp orders. Arrive early to avoid traffic. 4 stars because their bathroom is gross and speed of service isn't fast. Although, good customer service, and fresh ingredients.", "author": "Stan Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Solid taqueria. Love their huevos con chorizo and the staff is usually pretty nice. Sometimes they offer Milanesa torta which is really good. Their Zorro burrito is ok but if they didn't use really cheap frozen fries and instead used really good quality house cut crunchy fries it would be a burrito that would make history.", "author": "Brandon D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "Ridiculous pricing. I've been waiting here for awhile and I've never had to pay so much for 3 tacos ! Literally spent 20 for 3 tacos and a coke. On top of that I paid $4 extra dollars for avocado?! What the hell. At least they tasted decent but next time I want tacos I'll go to the mission where I know I pay 1.50 per taco and not 3. I'd hate to see their pricing for taco Tuesday's. Not ok.", "author": "Angel L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-14", "description": "The supreme burrito was really yummy, but the eggs and fries in the huevos rancheros were juuussst passable. The eggs were too hard to be over easy, the fries might've been sitting out a while beforehand. You'll be full though, that's for sure!", "author": "Candy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-21", "description": "We came in for lunch and was able to still order breakfast huevos con chorizo very well proportioned and very tasty.....also had a order of the NACHO ZORROS and they are incredibly along with there service ....\n\nMost definitely coming back in the future..", "author": "Hector Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-18", "description": "Near North Beach / Telegraph Hill, Russian Hill and Chinatown?\nLooking for a restaurant to satisfy Mexican Cuisine Cravings?\nTaqueria Zorro is here for you!\n\nHere are some of the items I ordered today:\n- Veggie Taco with Cheese, Beans, Rice, Guacamole, Lettuce, Sour Cream & Sauce*\n- Jarritos Mango Flavored Mexican Soda*\n\n*My first taco at a taqueria. I've been ordering Burritos and Quesadillas from my previous taqueria visits. Today, I digged in to ordering a Taco.\n*I am absolutely addicted to these Mexican sodas for some reason. This is probably the fourth or fifth flavor I have tried.\n\n- Nice staff members,\n- Good food and service,\n- Clean spacious facility\n\nOverall, positive first time experience here. I enjoyed the veggie taco I had, it was delicious and I am so craving for another one while writing this review. Burritos, Nachos and Quesadillas are something I will try next time I come.\n\nParking: Street / Metered Spots\n\nPublic Transportation is of convenience and a smarter alternative.\n\nThis taqueria is among one of the dining establishments in the area open till 1 or 2 in the morning. Perfect spot for those late night cravings. Their hours of operation may have changed and it is printed right on the menu. So feel free to take a look at the menu posted on the door before walking in.", "author": "Bennett W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-19", "description": "I am simply disappointed with this restaurant. With all the great authentic taqueria's in SF it amazes me that this place is even open.  For what I ordered, it was extremely over priced. The quality was poor and presentation was dismal. It's sad because everything sounded so good on the menu. \n\nMy hubby and I ordered off of Waiters.com and that was very pleasurable experience. However, what came was an utter disappointment. \n\nOrdered the following:\n2 pollo tacos\n2 carnitas tacos\n1 carne asada taco\n\nAll meat was seasoned with the same seasoning. How do I know? I found a bay leaf in both the chicken and pork tacos. All tacos were weighed down with lettuce making them mini salads.  This was disturbing because lettuce was not in the description on the menu.  The chips tasted bought and not home made, which is beyond confusing to me. They tasted like chips from a local delivery service that delivers to many taqueria's around the city. Why would you waste money buying your chips when you can make your own and they'll be a thousand times better? \n\nIt's a shame. With the other options out there for taqueria's, I will not be going to this place again.", "author": "Jamye K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "Went in for burritos last night, first time trying it out. Used online order for pickup, which was easy to use. Staff was nice and had my order ready early. \n\nThe burritos were AWESOME. I used to live in New Mexico; this place has very authentic flavors and generous portions. Grilled chicken was seasoned to perfection, obviously a family recipe. You can ask for no cilantro, that alone makes this place 10x better than that chipotle stuff. Even the tortilla was flavorful. \n\nThe salsas are also great, at least the red and green. I did not try the others yet, but I will be going back to try more for sure!!\n\nUpdate: order online. Tried to order at the counter the other night, got the wrong size, wrong salsa, and almost got charged for three burritos instead of two. I could have placed the order with the guy making the food and had no problems, but the girl at the register just did not understand what I was saying.", "author": "Sara G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-17", "description": "This is written after the last time I ever go back to Taqueria Zorro. I have lived in North Beach for the past 6 years and this place has systematically started to screw its customers over and over again with in the past year. They used to be a place that just Didn't F#ck up Mexican food but now they figured out how to do it. It greasy, unrecognizable and over the past year they have added 50 cents  to everything every 3 months to their increasingly shitty food. \n\nThey are now the most expensive and worse Mexican food in San Francisco. Unless your drunk and will not remember your experience go anywhere else. Best option is to go to Don Pisto's a few blocks away. Its 10,000X better food and surprisingly cheaper with a 20,00X better atmosphere. \n\nThis place has self destructed and if you spend money here, YOU ARE A SUCKER. \n\nP.S.  After 10 pm add a dollar to whatever the menu says and wait for the blank stare \nfrom the 17 year old that doesn't know how to explain why.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "Best norcal burrito i can consistently have in the city (ok, north of mission). Churn out orders, and even a line rarely backs them up. Great mexican for good prices. High quality ingredients, excellent salsa s and specials are worthwhile", "author": "Linn K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-21", "description": "Phat burritos! I had the breakfast burrito and it was yummy the salsa was spicy the way i like it... but the cashier lady taking our order not so friendly.. she needs to cheer up or something lol\nA plus is that they bring your order to you if your dinning.. another plus is you can view how they prepare your food.. so the kitchen is out in the open. The menu pretty plain and simple and in the back dinning area has the sports spanish channel... I will mos def return to grab a quick bite....", "author": "Linda B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Two things you must try if you come here. Their super nachos with bbq pork and refried beans with everything on it, and their special Zorro burrito.", "author": "Johnny N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-12", "description": "So let me start out by saying the food here is ok. What I am rating this disgusting place about is its stealing employees. I went to this place on Saturday. Bought nachos which totaled $10.62. I left no tip as this was a take out order. I get an email from my credit card company several days later stating that they noticed an unusually large tip of $8 on my $10 meal. These scumbags wrote themselves in a $8 dollar tip! And then forged their signature on my credit card receipt. I'm disgusted that a place can try to pull such dishonest behavior. Beware, if you use your credit card here make sure they give you the final credit card printout. Best yet, avoid these lying, stealing people like the scrum they are. I guess I showed them. I disputed the entire bill and these losers aren't going to receive a penny of my hard earned money. Please watch out fellow yelpers. These people at this dirty taqueria are no good liars and thieves!!", "author": "John C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-21", "description": "The food was good. Having grown up eating Mexican food my whole life I felt that is place was Okay! Pretty average. I had the carne asada plate which the meat was cooked perfectly but the rice, beans, and salsa were just okay. I believe the salsa if the most important part of a Mexican dish and this salsa did not meet my expectations.", "author": "Maria J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Amazing burritos. I don't know what this 3-star nonsense is about but the food is consistently delicious. Just go!", "author": "Genny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-14", "description": "Sometimes visit this place but no more\nMy patience is limited.\nTerrible service Terrible attitude so mean and rude employee and owner.\nI don't know why those emploees are there.\nFood is below average.\nLike this food place have to kick out from northbeach.", "author": "thomas p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Gotta love the fajitas! Great place to stop by for some fast comfort food.", "author": "Annette O."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-29", "description": "The taco salad was horribleeeeee.... I asked for no sour cream and swap out the greens for just spring mix or something when I ordered but they honored neither of the requests in the end. The lengua was alright. The bowl wasn't the fluffy crispy kind.  IT JUST MADE ME SAD.\n\nApparently they have good burritos sigh.", "author": "Vivian H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-21", "description": "I honestly don't really remember much of this place.\n\nMy drunken ass ended up with a flour quesadilla.\nAll I remember was \"this is ok\" and then dipping it into their hot sauce and thinking \"ugh, gross.. I'm skipping this sauce\".\n\nSince our group was all drunk and stuff, we wanted to use the bathroom.  We were sad to see \"out of order\" sign on it.  Then we saw this guy come out of the bathroom with a key.  I don't know if they use the sign so homeless don't just use it or whatever, but I'm so glad we got to use the bathroom.  I wasn't happy about it being SO so SO dirty.  It had an empty fuji water bottle in the toilet floating around.  WTF? How does that happen?  At least clean it once in a while or something.\n\nDefinitely not coming back here!  On top of it, it's CASH ONLY!", "author": "Stephanie B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-04", "description": "Stopped by on our way to the strip club, lol. The food was pretty good, pretty standard taqueria food. The burritos are giant. The place was pretty dirty, but it was also really busy that night. It was the night before the Super Bowl, so there were definitely more people out than normal.", "author": "Amy P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-15", "description": "I came here last night on Valentine's Day to get something to eat. I ate a carnitas quesadilla and my friend had the same.\nIt was really good. I especially liked their jalapeño sauce they provide for the chips. I put it on my quesadilla to. It was a good size, I couldn't eat all of it at that time.\nIt's a little small, but the food is good. They have a bathroom downstairs as well.", "author": "Melissa S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "OMG!! I just happened to walk into this place when walking down Columbus Street. They have hands-down the best shrimp tacos ever! I have literally been trying out shrimp tacos from every taco shop that I go to ever since I left San Francisco, with the hopes that someone will come close to the tacos that I enjoyed here. I have yet to find another taco shop that can imitate what Tacos Zorro created. I got the shrimp tacos and add sour cream. Simply amazing! The next time I'm in San Francisco I making a beeline for Tacos Zorro", "author": "Janell D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "Seriously.....it's 11pm and almost everything is closed except for this gem.  I had the burrito and Nicole had a quesadilla, both were comparable to Mission street.  If you're in the area, eat here!", "author": "Nick R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-03", "description": "Was lured with the idea of french fries in my burrito. Then I was delivered a tortilla with soggy potatoes cut in the shape of french fries. Will never return.\n\nSpices way too mild, even their spiciest salsa seemed like it came from a jar. That was opened a few weeks ago and never sealed properly.\n\nNothing about my burrito was worth eating - the chicken was bland, and I can't even remember what the chorizo tasted like.\n\nThe biggest disappointment is - there's literally no reason for it to be this bad. Fry the fries for about a minute longer. Spice up the salsa. Add seasoning. *anything*", "author": "Jeremy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-23", "description": "My very first burrito, exactly twenty years ago, came from Taqueria Zorro.. \n\nAnd my 365th burrito also from the same taqueria was today.\n\nYou know what that means?\n\nI have accumulated a year of my life at this same taqueria. \n \nI have also keep track too.\n\nYou can say, I'm a \"loyal patron\" and a \"dork\". \n\nWhy do I like coming here?\n\nBecause it is located in Chinatown, Taco for $1.50 on Tuesdays and Burrito for $6.00 on Wednesdays.\n\nIn honor of my milestone-visit of this taqueria, the shop has newly-introduced the \"Zorro\" Burrito. The $6.00 burrito has a choice of meat, sour cream, avocado and french fries in a flour tortilla. The filling reminds me of a dish I've had when I was San Diego-Carne Asada over French Fries. The special burrito is not as filling as an ordinary Burrito-minus the rice and beans. The meat was charred nicely. But the fries were too overcooked and too crispy. \n\nMaybe I'm use to eating fries with my burger. \n\nThis place is one of my five-star places for a \"Silver-Bullet.\" But the special burrito is kind of a disappointment on my milestone meal. \n\nCash only and a favorite of Yelp's too. \n\nI will continue to eat here and hopefully get to the 1,000th visit and burrito plateau from this taqueria.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-17", "description": "They constantly screw up every order placed in advance and are cutting back on meat portions. I keep paying for items that I don't receive. It's more disappointing each time I give them another chance. \n\nThis used to be the place to go for Mexican food, but it's a luck of the draw to get what you paid for these days. \n\n2 stars because if your lucky enough to catch them on their A game,  you can enjoy a great meal here. Unfortunately, that's not often the case.  \n\nBoost your attention to detail and be fair with portions.  That's where you need to improve.", "author": "Eric B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-15", "description": "Like many of the other yelpers on this page, I give Zorro's a solid 'meh' on the rating scale. They aren't bad, but they aren't amazing either. I have been to this establishment many times, as I work nearby, and each time has been almost disappointing. They are also pricey for burritos, but I think that has more to do with their location than anything else. Most places near North Beach are pretty expensive unless you count the dirt-cheap Chinese stores a block over. \n\nSome days for lunch, I get a sudden craving for a good burrito. While I'm dreaming of El Farolito's or Taqueria Guadalajara, I head to Zorro's because they are close and I don't get long breaks. They're located near several strip clubs and if you keep walking up Columbus you'll find a tasty place called Pizzelle Di North Beach. There have been days I have walked to Zorro's for lunch, stood in the doorway for a second, then kept walking to Pizzelle's. That is how unremarkable Zorro's is. \n\nI've had their tacos once, and haven't tried them since. It was as if they were inedible. \n\nNormally I go for their burritos. They are not only crazy bland most days, they are also ridiculously messy. The tortilla is greasy and flaky, but somehow also doughy? The inside is just a mess. The whole thing usually falls apart halfway through and I end up having to pick up bits of onion and meat and pretend I'm eating my meal like the adult human being I am. \n\nSo why give this place three stars instead of two? \nWell I've mentioned this place is close to where I work, and the staff is pretty friendly. \nThey have juice there, which I actually like. Horchata's a disappointment, but I like their pineapple or mango juices. They're cheap and watery. \nUnlike some taquerias, Zorro's will include a little bag of chips with your order of a burrito. I think they put it in for you to scoop up the bits of your burrito after it disintegrates to a pile of mush. \nThey are open late, like most places on Broadway and Columbus. \nFinally, despite the criticisms I've given, they ultimately do what they set out to do. They make burritos. While this seems like a small thing, I appreciate that there's a wide selection of food in the area. It would be so easy for NorthBeach/Chinatown to become a sea of the same overpriced Italian and underpriced Chinese food, and the occasional milk tea joints sprinkled in. So what if they're not stellar or terrific? Let them serve average and mediocre food! \n\nAnd if you want to get really good burritos, go to the Mission you lazy bum! :D", "author": "Claire A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-16", "description": "The food is subpar. My bf and I got the zorro bowl with carne asada. Basically a bowl with iceberg lettuce, some shredded white cheese, small pieces of carne asada, and watered down guacamole.\n\nThe bowl reminded me of something I could get at Taco Bell or El Pollo Loco.\n\nYou order at the counter, sit down at a table, then go pick up your food when your order is ready. \n\nOverall, there's much better Mexican food in SF and better restaurants in this area. I'd skip this place.", "author": "Ella C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-28", "description": "Nothing beats a Mission burrito, but these days getting out to the Mission is inconvenient for me so I'm pretty happy when I find a reasonable facsimile.\n\nThere are a few almost-Mission-standard taquerias peppered here and there throughout the city, and Zorro is one of them. In the dozen or so times I've been there over the years, I've found it to be consistent in price and quality.\n\nThey have $1.50 Taco Tuesdays and $6 Burrito Wednesdays (regular, super or wet, any protein except shrimp). There's a small salsa bar with three types of salsa, plus lime wedges and marinated jalapeño/carrot mix. There's plenty of seating and a TV that is invariably tuned to a soccer game.\n\nIt's nice to be able to get a decent burrito in North Beach, especially since the only other competition closed last year (replaced by a Nizario's Pizza). Give them a shot next time instead of your usual post-booze pizza slice!\n\nP.S. Cash only.", "author": "Valeria R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-27", "description": "This place sucked, the carnnitas pollo asada and Carne asada sucked, the burrito taco and torts I has was nasty, no re do here.blahh", "author": "Ace B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-21", "description": "The food was Delicious. Fresh and authentic .we ordered nachos, tacos and steak dinner. And everything was really good, except for the Cashiers bad Attitude", "author": "Irma S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "This is really a three and a half stars but opted to be nice.  I got the Asada super burrito not bad but not great either. The steak was a little chewy then there were peices that were really tender and good. The beans we're over cooks but it had a nice balance of meat rice and Abrams not like at other places where you usually get a lot of one thing in your burrito. Over all it was okay... Not great not bad but okay.... Keep at it zorro! You have potential", "author": "Dominic A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-10", "description": "Sorry to lay this on the Z.\n\nI used to be OK with Taqueria Zorro, but after multiple times in a row of feeling awful afterward, I don't think I can go back.\n\nThey give very good portions of food for an OK price, but that's just it, the food is the heaviest brick you can put down. And the flavor just isn't really there. Maybe it would help if I didn't finish my whole burrito.... but I love finishing my burrito, so yeah, I'll just hit up a burrito spot that doesn't make me feel this way.\n\nThis is a food only review though. The staff is nice, and the ambiance is OK (for a Mexican joint).", "author": "Peter M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-01", "description": "Girl at counter needs attitude adjustment. Says open at 11am. All I got was a bad look and no service. If you don't like your job, quit.", "author": "Juan V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-14", "description": "Came here 'cuz I had a Tippr deal to use ($10 value)\nGot a burrito and large drink - after tax paid $.50. So, price was pretty standard, esp. in the North Beach area.\n\nBurritto: Nothing special but hits the spot when you need Mexican food and there's not too many options around the area.\nStrawberry agua fresca: Tasted watered down and kind of like kool-aid......\n\nThey were pretty fast at getting my order down though, so that's a big plus.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-10", "description": "Decent al pastor tacos place in the North Beach/Chinatown border. I could barely finished three tacos however...don't know if because buzzed or a stomach of beers. Must return when less imbibed for an update.\n\nWhile a good size and lots of seating, the place gets crowded on weekends. But, it's a good choice if in the area and want a taqueria fix.\n\nDidn't notice in the other reviews but there are two small tables for six and a table for two near the front door, and the many counter seats. More than expected for this small divy noodle house. Again, the major drawback is the parking, which is aggravated by the one way streets, the no left turns allowed areas and the meter maids. ):(", "author": "Peter L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-08", "description": "For its quality, it's way overpriced. Two tacos will cost you over 10 bucks and still leave you hungry for more. I haven't tried their burritos yet, but if I'm back maybe I'll give that a try. The quality of the food itself is so so, but there aren't that many mexican places in the area so you gotta take what you can get", "author": "Amaresh S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-21", "description": "28$ for 6 regular Carne asada tacos and two drinks?  I've paid this much for tacos before and more than happy to do so if they're good....\n\nThe Carne asada lacked flavor. Nothing special at all.  Free chips and salsa. Salsa was good but chips were stale. Don't think I'll be coming back here.", "author": "David S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-23", "description": "I work nights and phone ordered a few different things off the menu for myself and co-workers. We will never be ordering from this place again and barely touched what they tried to call food. Not to mention they didn't even give us 2 of the burritos we ordered.  This place is a joke!", "author": "Jasean W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "Taqueria Zorro could get away with being a lot worse given that it's the only \"real\" Mexican place for like half a mile in any direction, and it's right in the heart of North Beach Drunk Jagoff Central. It's not one of the top taquerias in the city but 4* just for actually holding themselves to this much of a standard of quality when there doesn't really seem to be a financial need to do so.\n\nBurritos and nachos start at a little over 7 bucks. That's a bit higher than most SF taqs but to be fair they do also give pretty hefty sized portions and their meats are generally pretty good. You can also get pinto or black beans here and you get free chips w/ a salsa bar. Tacos a little over 3 for a regular, a little over 4 for a super. They have some more authentic stuff like lengua and that goat head soup on Sundays too. \n\nOnly minor disappointment is that they used to have really nice fried carnitas a few years ago, but now they seem to just be doing the easy pot roast style that most places cop out to these days.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-11", "description": "This place needs to work on their customer service. I'm not asking for the employees to be overly enthusiastic, but at least offer a genuine smile or a \"how are you\". \nOh & why aren't the chips complimentary? I'm paying $3.29 for one taco, I think I deserve a side of six chips. \n\nThe food is pretty good, but the customer service is horrible.", "author": "Alaina T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-07", "description": "Cheap beer + 1.75 tacos on Tuesdays! I'm game. \n\nTacos come in many options like chicken, steak, fish, etc. \n\nYou also get a batch of chips too! \n\nThis is the spot if you work in the Financial district. It's about a 10 minute walk and plenty of good eats. I honestly only came here for Taco Tuesdays and they had a 6 bottle mini corona for $10! \n\nThere's plenty of seating too. Maybe I'll come back for the regular food.", "author": "Adam J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-09", "description": "Some of the worst tasteless Mexican food you can have, not to mention overprice. I think they stay in business because they are the only Mexican food in the area. If you enjoy Mexican food, please avoid this restaurant!!!", "author": "Uriel A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-12", "description": "This is where wahoo drunks from across the bridges and tunnels stumble into after hours for a carb load to soak up the booze. \n\nThe Zorro burrito: instead of rice and beans, french fries! Pretty good!\n\nThey have a rear room with more tables and a TV, and serve cold mini buckets of Corona on ice. \n\nThey have a lot more than burritos here, pretty much everything you would find at any decent Taqueria. \n\nIf you are going to eat a lot of beans, get your lap dance next door at L'Il Darlings beforehand, so you don't stink up her tiny outfit afterwards.", "author": "Wanugee N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-14", "description": "Taqueria Zorro is the best Mexican spot in the area (not that there are a ton of competitors in north beach/ nearby FiDi), and in comparison to other taquerias in the city is pretty solid. Since I work close by, this is usually my go to spot with my other options being chipotle or the tacos san buena truck. \n\nTaqueria Zorro's tacos are a bit on the meh side, but the burritos are good. On Wednesdays they're $6.50 (regularly $7.25), and if you're as broke as I usually am, every bit counts.", "author": "Paige C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "This place was not what I would expect from a Mexican Taqueria. I got the Super Carne Asada Burrito with shrimp but the order instead was changed to Carne Asada w/ more Carne Asada. I love beef as much as the next guy, but really? Even though they got the order wrong, I was okay with it. What I wasn't okay with was the fact that they put ground beef into the burrito! Carne Asada does not mean ground beef! I also ordered the regular nachos. It came cold, with unmelted shredded cheese and limp jalapenos, LIMP JALAPENOS!! How does that even happen?! The salsa that came with it taste more like tomato sauce with salsa. Overall, quite disappointing experience. I'd rather walk through the Broadway tunnel for Nick's Tacos instead.", "author": "Adelbert Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-09", "description": "Reasonable if you're leaving a bar. I wouldn't go there for any other meal though, and really did you expect North Beach to be the spot for your burrito fix?", "author": "Misha T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "Awesome post-bars Mexican spot in North Beach if you're tired of the usual Chinese or pizza late night meal. I definitely recommend the Zorro - there are few California burritos (i.e. burrito with french fries in it...um, YUM?!) in the city that I know of! Service is pretty quick and the line usually isn't so bad. Kinda sucks that beans are an extra charge but at least the guac is free!", "author": "Tiffany F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "My colleague recommended this place to me for my office party. I went in person to place the order and the taqueria was empty of customers. I have to admit I got a little nervous, but I relied on my recommendation and the 'best of SF guardian' they have listed on their website. \n\nI ordered grilled pollo and carnitas for taco buffet and the sides- beans, rice, salsas, guac. The ordering was a little challenging with the counter staff, but once I spoke with the manager he understood exactly what I wanted. Then the owner Norman followed up to make sure everything was perfect. \n\nI was really impressed with the food!! The flavors were delicious. I didn't get the 'meh' taco as one customer reviewed. It was really tasty and an inexpensive way to provide good easy food for a group meeting or holiday party. I will definitely order again. \n\nThe only reason why it is 4 stars and not a 5 is I wish there was some cabbage or something fresh to put on top of the meat besides just the sauces. Regardless, my guests and I loved their food and there certainly weren't any complaints in the bunch.", "author": "Ginny B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-15", "description": "Taqueria Zorro is the only Mexican place in North Beach, fortunately it's really good.\n\nFirst of all; THEY HAVE LENGUA!!!\n\nIf you are not excited by that let me explain.  \"Lengua' is \"tongue\", as in beef tongue.  If you think \"ewe, gross!\" to the idea of eating tongue than you have absolutely no right to even talk about food.  Lengua is incredible; it's moist, fatty, has a great texture, etc. etc.  You will not go back to carne asada, carnitas, or whatever else you usually get.  The lengua is fresh too!  How do I know?  They run out of it frequently but replenish their supply regularly.  I go regularly and they are out about a third of the time, if I go back the next day after they are out of it they usually have more!\n\nThey have daily specials: Monday is Quesadilla Day ($6.50 for any kind), Tuesday is Taco Day (tacos are cheaper but still too small to be worth it), Wednesday is Burrito Day (all burritos are $6.50, even wet super burittos!), and Thursday is Torta Day (get a free soda with your torta!).  Wednesday is the best special by far.\n\nTheir regular menu has most of the standards of a NorCal Mexican place.  Their burritos are really good, tacos not so much, quesadillas are not as good as the burritos but still good; the true gem, however, is their Taco Salad which is freaking awesome.\n\nThe taco salad comes in a big fried tortilla bowl filled with all kinds of goodness.  The bottom layer is a mix of your choice of meat, beans, and rice and it's covered with a very nice salad and usually topped with cheese.  Usually topped with cheese?  Yep, sometimes they forget and that inconsistency is where they loose a star.\n\nIf there's one problem with Zorro it's the inconsistancy; I've been charged different amounts for the same food on different days and each chef seems to do their own variation on each dish.  You never know exactly what you're getting but it's always good and always in the ballpark of what their menu claims.\n\nOther problems?  A lot of the bums wander in here and try to take your food.  WTF?  If I wanted dirty hipster kids eying my food I'd eat in the Mission, NOT IN NORTH BEACH!", "author": "D D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "Do you like cream?\n\nWednesdays are $6.50 burritos.\nIr's a good sized burrito with choice of grilled fish, green chile, pollo or carnias. \nGo for the Zorro, and you get fries and avo. choice of meat\nIn your burrito. \n\nJust delete the fries, go easy on the cream and have what i just had!!!", "author": "Bert K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-05", "description": "So sorry but the prawns burrito did not work for me.  Fusion is good if it works but I had to pick out the prawns and set them aside somewhere on a dish.  Yeah, it was deserted when I was there -- where everybody go?  Party of one is so boring.", "author": "BanBan T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-23", "description": "I walked past this place a few times and really wanted to try it.  The ambiance was very casual, with a big flat screen TV set up on the wall in the dining area.  I ordered a chicken super burrito.  My opinion is that it was just okay, nothing special.  The portions were also just okay, as was the service.  IMHO, the prices are slighty higher than they should be.  I give it a 2 and 1/2 stars.", "author": "Lawree S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-20", "description": "Teh food here was pretty good. I had the burrito and it was delicious. Great flavor. The fresh waters are also delicious. The melon flavor is worth trying. My only complain was that the restaurant looked dirty. That doesn't help when you're trying to enjoy a meal. They should try to keep up with the cleanliness of the restaurant.", "author": "Judith F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-24", "description": "Steak Plate with re-fried beans\n\nI ordered the \"steak plate\", It was very good. As you can see in the photo, it came with all the basics (beans, rice, lettuce, avocado, tomato, steak, and corn tortillas). The meat tasted great and was very tender. The sides were also very good. It was a very big plate of food.\n\n I will be returning and try something different.\n\nIf I have a negative comment, it is that for Mexican food and the ambiance, it was not inexpensive. However, this is probably due to the fact of being located on Columbus in the heart of North Beach.", "author": "Mark D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-15", "description": "Horrible experience.  The customer service is horrible.  The gal taking my order kept talking to another worker and looking away often while she took my order.  The bathroom was disgusting.  Paper, toilet paper and women hygiene stuff all over the floor.  Seems like the bathroom had not been cleaned in weeks.  So for the food, the tacos that both my wife and I bought were horrible. The meat was dry and the tortilla was hard.  We both almost barfed after eating.  Maybe it was a bad experience just for us as others have great reviews about this place (A gem ?) hardly....  but maybe others will have great food and customer service but then again, it's a taco place and maybe another day the food will be better.....", "author": "Sandy J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "I have been going here for over 10 years so I would say I'm a regular.  The food is great and I usually get the Super Taco. It's huge for the amount of money you pay. The Zoro Nachos made with French fries are awesome!  The negative is the service. The girls are hot and cold. One is so nice and friendly and the other is like a cold fish. The guys that cook are great and friendly.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-19", "description": "I love the Zorro Burrito here. Conveniently located on Broadway and Columbus. The ladies on the cash counter looks serious with little or no smiles. The place is not so clean either. Cleanliness and Burrito joint don't go hand in hand, that's only my observation. Anyway, the food is great and the Chef is great. Don't know his name though.", "author": "Anand S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-27", "description": "I would give this place 4 stars for the burrito, but I have to actually take one off for a few things:\n\n1) we ordered a grilled chicken burrito and a grilled tofu burrito. We had to repeat it a few times, as the girl at the cash didn't seem to be able to understand us or register our order fast enough.\n\n2) despite saying a few times what our order was, I wound up with a grilled veggie instead of tofu burrito. Eh, no big deal, I can still eat it, but it was still a mistake.\n\n3) I requested my burrito as mild. Dunno how \"burn your face off\" qualifies as mild but it was definitely way above even medium level. The boy had hot salsa on his and he said it was pretty intense, so maybe mine really was \"mild\" on the scale of what they had.\n\nThe overall burrito was actually really great and I enjoyed all the veggies and the beans in it. I'd have given this place a 4 star definitely based on that, but the screwups deserve a ding and a mention.", "author": "Cassandra J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-19", "description": "I was dying for tacos and was super glad I found this place. I ordered the grilled fish and the al pastor tacos. Turns out they didn't have grilled fish, so I defected to getting the fried fish. \n\nSo.. portion sizes are DINKY. I've never seen smaller tacos before. There was so little meat in them, and for the price they charge... 1 star. Otherwise I would've given two stars. I paid nearly ten dollars for something that barely filled me up. Flavor-wise, I've had better tacos. The sauce they put on each taco was pretty good though. \n\nThe place itself is kinda diner-ish, though I'm okay with that.", "author": "Alessio Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-30", "description": "I try to stay away from the Mission for four reasons:\n\n1) It smells weird.\n2) Hipsters.\n3) I'm from LA, and this ain't bomb-diggity Mexican food.\n4) People always come up to me speaking Spanish.  I hate letting them down and seeing the look of disappointment on their faces when I tell them in broken Spanish that I no comprendo, no habla espanol.  Lo siento!\n\nSo, I opt for Taqueria Zorro, which is a few blocks away from my office.  Hoping to bank on some delicious crispy tacos, I was disheartened to find out that they didn't have any.  *SIGH*  To make matters worse, the lady behind the register spoke little English, so I was actually forced to use a bit of Spanish to communicate.\n\nWith my little spirits crushed, I decided to go for the Machaca con Huevos, which is basically a plate of deliciousness for less than $10.  Bits of fried meat (I'm guessing carne asada?), peppers and tomatoes were tossed in with scrambled eggs.  There were some breakfast potatoes in the middle (think country-style pieces seasoned with a salt and spice mixture).  Rice and beans (your choice of refried, pinto or black) with melted cheese on top.  Shredded lettuce with a big slice of tomato on top.  A stack of hot, soft tortillas.\n\nThe eggs were delicious - slightly spicy and seasoned so no salsa or pico was needed.  The rice and beans were also flavorful.  Salsa bar had awesome spicy green salsa.  Potatoes were better than your average breakfast joint.  No line at 12:15 PM.\n\nOne star off for slightly higher prices, no crunchy tacos, cash only, and a basket of chips cost $1.  My friend's enchiladas were deemed bland, so he had a blast finishing up my dish (and trust me, it's a HUGE platter).  Also, no tamales?  The selection is limited, so I'm guessing it's more of a burrito and taco place than a full-range Mexican place like El Sotano.\n\nMmmm, machaca con huevos, mi amor.", "author": "Tori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Great burrito for a quick fix! Open late and the food came out quick.", "author": "Marie W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-20", "description": "what's better than a fish taco and carne asada taco after having drinks with friends?  KUNG FU TACOS!  ok, that was a shameless plug...  the tacos here are good and full of flavor, lots of meat and piled on with cilantro and onions.  definitely a satisfying late night snack.\n\nI'm stuck here, whether to give them 3 or 4 stars.  I'm lowering it to 3 based on the cleanliness of the facility and their customer service.  I don't expect 5 star service from a taqueria but at least be helpful with the menu items... you know how they say it's clean enough to eat off the floor?  well, I wouldn't eat off their tables.  just be careful of where you put your food and your hands and always remember to wash your hands afterwards.  I guess I shouldn't be expecting too much here.  after all, this place is near the bars, clubs and strip clubs.", "author": "Samson M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "Why this place only has 3.5 stars amazes me. it's so good. the zorro fries + carne asada= best carne asada fries ever............ I also had the burrito and it was huge and delicious, even when I was eating it cold and sober.\n\nThey also have an extensive salsa buffet. Get the green one!", "author": "Christina L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "I love this place.  The first time I went here was in around 2003.  It was full of Mexican firefighters watching the Mexico vs USA soccer match.  Most rambunctious.  \nThe food is great.  I always get a burrito and a beer.  The burrito meat is always juicy and the tortilla is really nice too.  Not too pancake-like, but nothing like the crap you get in the supermarket.\nThe service is always great at the counter, which is incredible when you think of the mood they should be in considering they have to listen to that awful Chinese woman's singing.\nI love their green salsa, but their red one, not so much!\nReally good value with a Burrito around $7.  You get free chips if you want.", "author": "nottellinya a."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-29", "description": "Missionites will gasp at this statement, but I swear Taqueria Zorro in North Beach is the best taqueria in the city.\n\nI love the salsa bar here (3 salsas of varying spiciness but uniform awesomeness) and the carne asada tacos. Normally I'm a taco supreme, give-me-all-the-toppings-and-condiments-you've-got kind of girl, but at this taqueria, the simple things are best. Fresh and delicious salsas and the plain ol' carne asada tacos. Extra cheap if you come on Taco Tuesday (every Tuesday!).", "author": "Kim T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-18", "description": "Overall two stars, bought nachos, tasted and smelled like urine. Starting trying to figure out why it smelled. Come to find out it was the sour cream that smell. Unknown if it was spoiled but...bad!!!!!!!!", "author": "Paris S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "A few weeks ago, I was out drinking with friends and we turned to a usual North Beach drunchie staple, Golden Boy's. But another friend ventured down the street to Taqueria Zorro where he got a burrito which had fries in it. Fast forward a week later=me, drunk in a taxi by myself, telling myself \"I will not drunk eat. I will not drunk eat.\" But the image of the burrito with fries popped into my head and I became convinced I must try it. So I told the taxi driver to instead stop along Columbus where I hopped out at Taqueria Zorro. \n\nAfter drunkenly scrutinizing the menu, I found the Zorro burrito with fries, sour cream and guacamole in it=JACKPOT! I carried the warm foil-wrapped goodie home, barely containing my excitement, got into my pajamas, turned off my lights and got in bed where I drunkenly consumed the burrito by the glow of my computer screen. \n\nIt. Was. Delicious. Soft fries wrapped in a burrito with delicious meat, sour cream and guacamole. What's not to love? The meat is a tad too salty, but the rest of it makes up for it. One of those foods you can't help but close your eyes with pleasure while eating. Best burrito I've ever had, hands down. I'm pretty sure I was emitting moans and sighs of pleasure. If my roommates had been home, they probably would've thought I was engaging in inappropriate activities. But well, some girls bring home boys. I bring home burritos. \n\nI'm pretty sure this new discovery will be pretty hazardous to my waistline, especially with it being just a 5 minute walk from my apartment, but I wouldn't have it any either way! Next time you're drunk in North Beach, get the Zorro burrito. You won't regret it. Even if you wake up with salsa-stained sheets. ;)", "author": "Steffi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "This is definitely a hole in the wall place which seems to be the earmark of authentic Mexican food. I ordered a carne asada torta also known as a mexican steak sandwich with a side of fries. It was definitely a two hand sandwich and was jam packed with all the goodies! I tried the house salsa which was just the right amount of spicy for me. Authentic mexican food is simply the best.", "author": "Faith C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-14", "description": "Yum! Most of the options in the area are centered around Italian food, but I simply cannot do without a Mexican option like this. I believe it is the zorro burrito that has fries in it, which you'd have to be a fool not to want. A great late night or really anytime option for fast casual!", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "went here because I am local.  burrito good sometime but one day I walk home and I finish burrito make me go diarrhea. shit out 8 dollars. also very messy to clean", "author": "Jon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "Pretty yummy. Got a veggie burrito with extra picco de gallo. I would say I didn't get any extra and was disappointed in the amount of veggies in my veggie burrito. Not enough lettuce. The rice was bland but everything else had a good smokey flavor to it.  i wouldn't mind having it again.", "author": "Katie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-14", "description": "Don't get the Zorro Nachos. I was feeling adventurous and only finished one third of them. They were okay but I was expecting fries as one of my toppings on the Nachos, instead it was just fries with all the regular nacho toppings. My friend got the cheese quesadilla, which was really good. Tip: Don't be adventurous at this place and you're food will be pretty good.", "author": "Iman R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "I was wandering on Columbus when I bumped into this gem. Its hard find good mexican food in this part of town but Zorro does not disappoint. The service is fast and the food came hot and fresh. I will soon become a regular.", "author": "Helen L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-16", "description": "On our way back to our hotel, we decided to walk around North Beach. I've never been there before so my girlfriend was showing me around. As I walked by this restaurant, I suddenly wanted some Mexican food. The food wasn't anything special, but the portions were very generous. We just ordered a couple of tacos each, and there was so much meat that you couldn't even pinch the ends of the tortillas together. Personally, that's a little too much meat for me. \n\nNot sure if I'd stop by again since it's in an Italian neighborhood, but one never knows.", "author": "Michael C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-15", "description": "I stopped here for a quick lunch. A few tacos and we'd be on our way.  I had a few tacos and my girlfriend had a veggie burrito.  Everything was actually pretty tasty!  The salsa selection was good and the ingredients were all fresh and well proportioned.  \n\nThis isn't high dining but it is really good, fast food.  Recommended if you're in the area and want to stop in and have a quick bite to eat.\n\nThe staff was very nice and the place was generally clean and pleasant.", "author": "John G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-21", "description": "This spot should have been featured on Unsolved Mysteries..why, do you ask? The mystery is how this place has managed to stay in business for several years. The only thing this place is good at serving up is diarrheria! \n\nI get it. This place specializes in serving cheap food to intoxicated North Beach visitors. As a person who has lived in North Beach, and will be moving back soon, I can honestly say that I've given this place plenty of chances. I tried this place during the day, at night, during the week, and on the weekends. Each time I astonished at how bad the food was. All of the ingredients taste like they came out of an old can. The decor - cheesy and unauthentic. And the service - was on par with the type of service you get from a fast food restaurant. \n\nPlease heed my warning. The next time you're thinking about stopping by here, do yourself a favor and go lick the stripper pole at Little Darlings next door. I'm sure you'll find the taste more appealing than anything Zorro could produce, and there's less of a chance of  \"catching something.\"", "author": "Michael H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "First off, I'm from San Diego.  I had much pride in the California burrito from my hometown, but as fate would have it, I drunkenly stumbled into this place while I was visiting some friends in SF.  Much to my surprise, I saw the California burrito on the menu and I thought to myself, \"there's no way this is the same burrito as the one from SD.  AND there's absolutely no way it'll taste nearly as good.\"  But I had to try it, so I ordered one.\n\nWell, after what seemed like a long & arduous wait for my drunchies to arrive (frankly, it was probably only about 4 or 5 minutes), the burrito finally came.  Tearing through the layers of aluminum foil, my heart was beating insanely fast... most likely because I had way too much to drink and I get massive Asian glow.  Anyway, I finally got past the aluminum foil to the warm tortilla, and I poured a little bit of the green sauce on top before biting down.  \n\nHOLY FLAVOR EXPLOSION BATMAN!  I hadn't had a burrito this good... ever!  I didn't believe it.  So I took another bite, and another.  And my friends ate some too.  Then they kept eating more.  Everyone was stunned.  Shocked.  Flabbergasted.  We couldn't believe just how amazingly delicious this burrito was!\n\nThe next day, we were still thinking about the burrito.  We decided that there was no way a California burrito in SF could be better than one in SD, so we went back again... completely sober.  This burrito had high expectations to live up to.\n\nAnd did it ever.  Wow.  The second time was just as good as the first!  I now have a new favorite burrito place.  Unfortunately, it's 500 miles away.", "author": "Yu T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "I'm a huge fan of tacos, so this place came in handy. Open fairly late and friendly service. Now for the food. I ordered take out, 1 grilled fish and 1 prawn taco with chips. Flavor feel flat, no seasoning, just plain ole dry...but it was plenty of shrimp and fish in the soggy taco.  The chips tasted stale and the salsa a bit watery.  Cool if you just need a little something to eat.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-09", "description": "Worst FOOD POISONING experience I've had in my entire life :( \n\nThe food was complete crap, but the service was very good. They brought me my food and gave me free chips and water. Sweet people, it's quite a shame that they aren't using fresh food :(", "author": "Lori L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-14", "description": "We were downtown and didn't want to ride all the way out to Mission, so I looked on yelp for what's local and found this little place.  Apparently, it's in little italy area of SF, the area was very nice and fun to walk around, but this actual taqueria was not good!\n\nThe food was expensive for a Taqueria, my burrito and drink cost me 12.50. I got the carne asada and there were no actual pieces of steak, it was just shredded steak, almost like you'd find in a taco.  Yuck ...\n\nThe rice had a minty taste, I LOVE burritos, but this one tasted so bad, i actually had to stop eating it.\n\nI'm not a particularly picky eater, either!", "author": "Jared C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "This was was only taqueria in the area when I lived in Russian Hill years ago.  I would stop in for late night nachos.  They weren't the best but satisfied my crave.", "author": "Brent F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-21", "description": "Not the best place for a veggie burrito.  Small and expensive.  Better off waiting till you get to the Mission.\n\nBurritos are roughly $7.   \n\nThe salsa is good though.", "author": "Bucky W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-06", "description": "Both times I've gone, I specifically requested mild salsa. Both times I got my burrito, it's been inedibly spicy. I'm so done with this place. I'm out $8 and still haven't been able to eat lunch.", "author": "Katie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "It may be a bit lack luster on the inside but just get the bbq pork super quesadilla and all will be right in the world!!!", "author": "Amy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "$8 - something for a burrito?....sure, why not?\n\nGoing fancy on something like burritos isn't usually my style, but this place gets me to do it every time. I've tried a couple different burritos from here, and it sounds weird, but the breakfast burrito is my favorite. It's like one of those SoCal burritos with fries in it, but it has eggs in it, and it's especially delicious after 9pm. Fucking delicious. The mushroom quesadilla is good too, and everything here is HUGE. \n\nThe service is good; I've never had to wait too long for my food. They also have a great selection of salsas in their salsa bar in the back. \n\nI really don't know what else to say about this place except...luxury burritos! (at least compared to what I'm used to).", "author": "Angela S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-19", "description": "Hey, what happened to this place?  And, who was that guy who hugged me when I entered the Taqueria?\n\nHow long has it been Taqueria Zorro?  Remember the nights you use to fill my stomach contently before those inebriated times of chaos, lust, loathing, love, and debauchery.  Oh, how I've missed you!  But what happened to you.  Was I so naive when I was younger that I thought you were the 'shizzle for my stizzle'.\n\nI guess, times do change, so we must change with the times.  I must move on my friend.  I have experienced a world of Taquerias out in the world now and realized that my youth was a mere vessel to lead me to greater heights in the burrito world.", "author": "Jules S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "I ate here every night for a long time because they were selling me a tostada for less than 5$ that was like a crunchy tortilla circle covered with piles of beans, cheese, lettuce and a ton of meat. The bar-b-que pork is the bomb, but I noticed I was getting hell of fat from something at Zorro. Maybe it was the pork or MSG, I really doubt anybody knows. The guys who work here are hell of cool, proud guys and there sometimes are cool ladies at the register. It doesn't happen a lot, but there are sometimes perfect 10 strippers on line at this place. There also sometimes are a lot of cops in here. ;)", "author": "Avram K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-23", "description": "The biggest mistake I stumbled upon in a while. This place is so over priced, food is bland and not spicy. I felt violated after eating here it was really bad.... oh and to top it off $10 for two tacos and a soda....If you think this is good perhaps you dont travel in SF much... plenty of killer places in S.SF that have better flavor a nice kick and cheaper for sure... shame on them for even calling this Mexican food !", "author": "Kent S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-08", "description": "I recently went here on a rainy day mainly to get out of the down poor before catching the bus. The sign out front is very catchy but the flavor is not. I had a grilled chicken burrito with everything on it but for the price and lack of defined flavors the only thing good about this place is that it keeps you dry when it's raining. \n\nIn a city with hundreds of amazing taquerias this place has a long way to go so for now they are definitely off the list because being only decent doesn't cut it.", "author": "Justin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "This place is great and tasty! Had two Al Pastor (bbq pork) tacos that were delicious, and a cold Dos XX beer, can't beat it.Totally recommend this place.", "author": "Stephanie E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-05", "description": "This is good for late night after a night of drinking. The food is okay but nothing to be taken aback.\n\nI was with one of my buddies for a night out of town and this place was conveniently open so I said why not. I had no expectations anyways.\n\nI do like the ambiance. The mariyachi (sp) was blasting and some couples were even dancing by the tables. Pretty entertaining nonetheless.\n\nThe food itself was okay. I ordered a chicken burrito and i've had tons of them in my lifetime. The chicken had good flavor but the problem was for one, the salsa they put in was very spicy. I can take it but that night I had been drinking and the last time I wanted was spicy food! There were too many juices which result in the tortilla to get soggy towards the middle to end of the burrito. And three, the burrito is wrapped with like 5 layers of tin foil! Maybe it's b/c of the extra juices!\n\nOverall, it's average at best. A late night spot to get some quick food. That's about it.", "author": "James K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "Dude, get the super mojado burrito. Its got enchilada sauce all over it, guacamole, sour cream and melted warm cheese on top too. You are going to want to rub this burrito all over your body. But you won't do that because you are hungry. Maybe order two and rub one on your body and eat the other. \n\nI came here hung over Monday morning and ordered this with the carne asada inside. I thought they were a little skimpy on the guacamole but other than that I have no complaints. I love burritos. A good burrito gets me aroused. This burrito aroused me. All the stuff inside of it was mixed well. The enchilada sauce made me want to lick my plate. \n\nMy friend ordered the super mojado burrito with shrimp and surprisingly, they were really generous with the shrimp! You know how most places are skimpy with the shrimp? Yeah, not this place. Lots of large, yummy shrimp in his burrito. My other friend had chorizo and eggs with beans and his portion was very large. The prices are pretty standard Taqueria prices. I thought our food was worth every dollar. \n\nOh, and they have a little salsa bar with a few different kinds. I really liked their salsa. I'm a baby and can't eat super spicy stuff and they had a salsa that was chunky and yummy and not too spicy. \n\nIf you're in the North Beach area and are craving Mexican food, I would say Zorro is the place to go!", "author": "Liz M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-15", "description": "Staff is dumb , had no idea how to redeem a voucher from restaunt. Com . Completely disappointed . Manegment should work on this , you stand to lose more customers like me . Get your employees trained on Groupon . To improve your business", "author": "Henry S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-28", "description": "Got the veggie burrito. Tortilla was cold (I like mine warm), and there was more lettuce than beans/cheese/rice. I guess that's why it's \"veggie,\" but all the good stuff (beans/cheese/rice) were in smaller quantities. Flavour was sort of lacking... because of all the lettuce, it tasted more watery and not savoury. Not great for the price ($7 or so).", "author": "Dan Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-09", "description": "i feel like ive been scammed. i ordered the fish taco & its not even worth $6. the girl in the cashier was rude also & didnt greet me. the workers that were cooking did not wash tgeir hands when comming back but instead just dipped their hands into the ice. disgusting !!!", "author": "Kyln L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "I'm writing this review based on one experience and one item. \n\nI went to college in San Diego and spent 5 years there. In that time, I fell in love with something called a \"California burrito.\" It generally has carne asada, pico de gallo, cheese, sour cream, guacamole and french fries. \n\nIt may sound odd to some who have never tried it - but it's delicious in a way that's nearly indescribable. \n\nNo where in San Francisco does it anywhere close to what it tastes like in San Diego. I've tried at several locations and it just doesn't work. \n\nSo tonight when I was leaving North Beach and my buddy told me about this place that had a California burrito, I said I'd be down to try it. \n\nIt's amazing. \n\nCompletely and absolutely amazing. \n\nIt's the closest thing to a San Diego style California burrito I've ever tasted up here. The carne was done right. The fries were done right. The tortilla was the right size.  \n\nIf you are a San Diego transplant or a returning San Franciscan from San Diego and have been craving a California burrito (like I had been, desperately), come here. It does it 100% right.", "author": "Jeff T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-22", "description": "This is my favorite Mexican North of the Mission. Located in the heart of North Beach, TZ has everything you want from Mexican- Tasty Salsa bar, Warm fresh chips, a classic california-mex menu, nacho fries! and they will talk you through your order as they cook it. Bomb.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-03", "description": "Its no wonder they don't have many Mexican restaurants in North Beach. Its called little Italy for a reason. \n\nI went with a group to track down a good breakfast burrito to soak up some of the drinks i had the night before. \n\nI got a carne asada burrito for almost $8 and a few others got some regular burritos. \n\nFirst of all the service wasn't that great. I felt like I was going to be put in detention if I asked for water one more time. And the salsa isn't accesible...you have to ask for it. :(My breakfast burrito was hardly mediocre. It was a bunch of rice and it looked like ground chorizo instead of carne asada like I had hoped. I don't know. I'd rather go to Mama's down the street instead. \n\nMy recommendation: Do not get Mexican food or breakfast burritos in North Beach.", "author": "Heather H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-12", "description": "The burritos here can get pricey but on weds burritos r 6 bucks.\n\nI usually get the super chicken with no cheese it's huge and very consistent.\n\nAlso remember to use the green sauce ...", "author": "DOM d."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-20", "description": "Missed the mark.\n\nNo egg whites.\n\nNo wheat tortillas.\n\nNot cheap.\n\nNo lack of oil in the chicken.\n\nHoped for a little more \"yes\" with my $7 breakfast burrito.\n\nThey probably hope most of us would say \"yes\" in coming back.\n\nBoth of us missed the mark.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-15", "description": "Come on  Tuesday for $2.25 tacos or Wednesday for burrito special,  except for shrimp.  Small serving of chips, salsa on ice.  Order was easy, 5 min wait for food.   None of the meats stood out.  It's just a taqueria in North Beach that has horchata.", "author": "Rey D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-02", "description": "I love their burrito.. there was one there that i really like. instead of putting rice on the center of the burrito, they use fries. yum!\nthey serve the food to your table when you dine in so you dont have to wait on the front.", "author": "Wendy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "I came here late at night with a friend after drinking (considering the restaurant's location near strip clubs and bars this is the number one way to enjoy it because it is open so late). I got the California Burrito which doesn't appear on the online menu but was directly under the Zorro Burrito on the menu. \n\nThe burrito was very saucy which I generally enjoy even though it makes quite a mess. It was decently priced and not small but not particularly large (in a world of mega-sized burritos). I have gone other times and gotten other things but that is the best they serve and it is very good.", "author": "Stephen S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-06", "description": "I asked them not to add any sauce on top of my burrito but on the side, but they didn't.\ninside the burrito (Mojado) was too dry. I had to add more sauce and sour cream to be able to swallow it. \nthey have 4,5 different types of sauce: 2 red ones are absolutely tasteless. green sauce and tomato sauce are at least hot!\nfish taco was soooo bland.", "author": "Neda M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-10", "description": "Pretty good taqueria in an area where one wouldn't otherwise expect to see a cheap mexican joint.\nI had their veggie tacos which were pretty good, except that they were wayy too filled too loaded up to picked up and eaten like normal tacos.. I tried eating them with a fork and knife which turned out be an exercise in futility.. so this made for very messy eating.\nTheir salsas were a lot thicker and yummier than most other places, and they have nice big seating area with a tv.", "author": "Aditya M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "Stopped here for a quick bite while exploring the area. The quesadilla was alright and not that cheap. You can tell they're trying to make it cozy. What repulsed me was the bathroom. I just didn't feel like they care very much about hygiene which is an unpleasant thought.", "author": "Yolanda Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-08", "description": "This place is pretty horrible. It is a cheap taqueria with few redeeming qualities.", "author": "Melville M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-29", "description": "Wow, this is the second Taqueria in the Bay Area that I noticed had alcohol. It seems like it's pretty much the norm to have alcohol with tacos in Northern California. I've been to numerous places in Southern California, and you'll be lucky to have alcohol being served, but, I digress.\n\nFor those that know me, know that I have a weird fetish when it comes to tacos. Issues would be more like it. My friends and I normally end a meal with tacos as dessert (oh so healthy). So, I would say, I know a good taco when I commence grubbage on one.\n\nSo, before dinner, as we were walking around, we stumbled upon this tacqueria. Futbol (soccer) was on the tube. Posters of Futbol teams everywhere and alcohol! I ordered two Carne Asada tacos, which were decent. Seasoned OK, but just didn't have that flavor that normally puts my mind into a euphoric state that good Carne Asada does. I loved my trip to the bay, but I was starting to miss Mexican food from Southern California.", "author": "Wes S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-18", "description": "Pay no mind to the \"Bathroom out of service\" sign.  As long as you're a paying customer, you should have no problem obataining a bathroom key from the cashier. \n\nOkay. And now onto the food. Since this seems to be the only Mexican place in North Beach, I have dined here on several occasions - usually after too much pizza and meatball sandwiches. \nSometimes a cheap little taco, on the way to walking to the parking garage, is in order. \n\nTheir super burritos and carnitas tacos are my standard grub.  The carnitas are just the right amount of moist with some crispy bits.  The super burrito is a messy grub-fest, so be sure to grab a fork.  The have a couple of salsas (a guacamole-based, and semi-spicy red one, some pico de gallo, some marinated jalapenos, and some sliced lime).  Chips are an extra buck, so make sure to ask for them while ordering your main meal.\n\nAll in all, this is a decent, quick, tasty place to get some Mexican (no, not him - I dine on him later) in the heart of all that is Italian/Asian fare.", "author": "Kara B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-21", "description": "i know i shouldn't compare Taqueria Zorro with the taquerias in Mission but i have to. The prices for a burrito is kinda expensive -- a regular burrito is 5.95 and a SUPER burrito is 9.95! plus chips AREN'T for free?! its an additional $1 for chips. \n\nbut i know its the only taqueria in north beach and its a great location for drunkards that have the munchies after clubbing on Broadway. \n\nPRO: fresh and good location\nCON: prices and no free chips :(\n\nbut i wont be coming back.\n\nMISSION BURRITOS ARE LOVEEEE", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-12", "description": "I have to say, the goods within the burrito are pretty top notch, but the problem is all in the execution. There is a general sense of DGAF about proportion and ratio of rice, beans, meat to the size of the tortilla for the result to be stellar. By the last dollop of guacamole, you already know there's a lot of love - almost too much love to wrap and you're thinking, \"There's no way he can make this work; there's so much food and not much tortilla!\" And your thoughts are spot on. The guy folds one part of the tortilla over, realizes he can't complete the job right, and literally uses the foil to smush everything together and hold it tight. This happens every time. \n\nAnd personally, I really enjoy Gordo's burritos and really appreciate them even more every time I visit TZ. Why? Well, Gordo's puts cheese on the tortilla when they heat the tortilla so it melts nicely. TZ heats the tortilla, adds all the other stuff, then the cheese, smushes the burrito, and then heats it again the steamer. The cheese is still not melted and then it just tastes weird. \n\nIt always feels a little dirty sitting inside, but when you're in the mood for a burrito, you just have to eat it right away. Unfortunately, there aren't any other burrito places nearby, so TZ has to do.", "author": "NickJess S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-14", "description": "Went to Zorro with a daily deal coupon for $10 worth of food. I got a regular chicken burrito and chips. They have a salsa bar with two types of salsa. When I opened the burrito wrapper, the actual burrito was like soggy & wet probably due to the salsa inside the burrito. The chicken was pulled chicken and the burrito was OK. The chips were MAYBE 10 chips in a ilttle bag. \n\nI probably won't return...", "author": "Heather M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-09", "description": "$1.75 taco Tuesdays and $6 burrito Wednesdays, eh. I come here only because they're right around the corner from where I live and is actually the least sketchiest cheap restaurant along the walk. They have pretty fast service, too, which is a plus when I'm not expecting anything exceptional.\n\nI have gotten their tostadas, tortas, burritos, and tacos. Out of these, I'd just stick with the tacos for their utility, and maaaybe the tostadas, except the lettuce and tomato they put on my recent ones have been questionable. Their carne asada comes out very dry, but I guess it's not that bad if you must have your beef. If I had to choose a meat to get, I'd go with the chicken or pastor. Their chorizo and lengua aren't that bad, either. I've had pretty bad chicken at Mexican restaurants, but Zorro's chicken is actually decent, flavorful, and not dry. Their pastor isn't as juicy as I've had them, but it still tastes nice. I'd skip on their other pork options; I'm not very fond of how they do carnitas or chile verde. I could also do without the salsa they add in a container for their tacos.\n\nBut anyways! Taqueria Zorro is a chill place to go on Tuesdays or Wednesdays for the deal to get full! If I had more money, I'd probably opt for the other places surrounding it, though.", "author": "Amy Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-26", "description": "The day after NYE, we wandered around the streets of north beach looking for something to help ease our hangovers. We tried going to another mexican place--something maybe fusion, overly americanized and fancy--but they were packed and the host was being snooty about the 2 hour wait time. I'm willing to wait for good food but if you're gonna turn up your nose and act like you're the shit, I'll pass. It's just annoying.\n\nSo we wandered around some more and found Taqueria Zorro and decided to try it. He got a giant monster burrito and I got a quesadilla the size of my head. They were both super cheesy and delicious and put us in a major food coma. \n\nBest ever.", "author": "Ringo M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "$six zorro burrito....avocado, sour cream, al pastor for meat selection y fries...all rolled up in a large flour tortilla and foil wrapped burrito...super large and duper filling...a burrito with no rice y no beans...perfect for a deep socal burrito lover at heart....please note that zorro goes heavy duty on the sour cream...on the side next time...also note that zorro also offers a typical norcal bean, rice and vegetable useless filler filled mega-burritos...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-23", "description": "Came here for the Zorro burrito after my brother raved about french fries. To be honest, I think I would have preferred rice and beans - french fries tend to get a bit wet in a burrito, I've noticed, though that could partly be because we walked up to Chinatown before we finally sat down to eat. Still, they gave me carnitas and shrimp in the SAME BURRITO, so how can I really complain? Salsas are great, too.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-04", "description": "Working the night shift really wasn't cool because pretty much everything was closed.. my co-worker told me about this place and how they are open late and is pretty good on price..\n\nWell the price is good ... but when it came to the food... that's another story.. \n\nI ordered a veggie taco from here and when I started eating it.. it was ok but I had an extra surprise in my taco.. I was eating and bit into a pea... which really threw me off.. also found a few more peas and carrots in the taco too.. I don't know about you but I'm pretty sure your not suppose to put peas and carrots inside a taco.. \n\nGood thing they gave me chips and salsa to get the taste of the taco out of my mouth...", "author": "Lena S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-11", "description": "You know .. I dont know how I end up here. Somehow I get talked into this place, and this place have nothing on my usual taco joint. However, I do appreciate taco tuesday deals and the fact that it never gets too crowded. Also, the service is decent and the food aint bad, but you know. I've had better. Much much better.", "author": "Jessica H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Considering the location, in the midst of strip clubs, Italian restaurants and on the edge of Chinatown, Zorro is surprisingly good. It's slightly pricier than, say, someplace in the Mission, but I would attribute that to the high rent I'm guessing they have to pay. I'm a burrito and quesadilla kinda guy and Zorro always hits the spot for me. I have a buddy who is way pickier than I am and he says they're good as well. My favorite bar is Vesuvio (which is across the street), so when I go there, I'm usually coming here before or after drinks. No complaints at all.", "author": "J N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-30", "description": "I am so addicted to this place now. Just went and got 4 fish tacos. Less than $7. I'm a pig, but a cheap pig!!! \nEat it up!!!\n\nAlso, why no salsa bar anymore????\n\nPPS, Why so much packaging for to-go orders????", "author": "joanna r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "I have found the third burrito.\n\nEverything good comes in threes right?  Or is that everything bad?  Either way...\n\nIt started with the Papalote Soyrizo Burrito.  Mmm, so tasty.\n\nNext was the Little Chihuahua tofu burrito.  The real great thing about the LC are their salsa choices.  I recommend Chipotle!\n\nBut enough about those guys, they're old hat!  Chime Taqueria Zorro and their delicious Zorro burrito!  Gaucamole, sour cream, french fries, and all the other fixin's you'd expect make a stellar burrito.\n\nOddly, chips are free with to-go orders but not dine-in.\n\nOpen late!  Cash only!  Awesome burritos!", "author": "Jeff G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Really good, cheap burritos outside of the Mission. Their non-meat options extend beyond beans and rice in a tortilla. The grilled vegetable burrito comes with grilled peppers and onions. I don't eat starches, so I ordered it without rice, cut it open, doused it in free salsa and fresh lime juice, and ate the insides. It was delicious.\n\nI asked for cheese, which didn't come with the burrito, but the cashier was nice enough to simply ring it up as a substitution since I didn't want rice, rather than charging me extra.", "author": "Holly U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "I probably go here 2-3 times a month since it is 1 of 2 burrito shops in North Beach.  The burritos are delicious and pretty big.  It's a little expensive, but not horrible.  The indoor seating is kind of a dump.  The salsas are just ok.  I wish they had a bigger selection of condiments.  The breakfast burritos are interesting.  They're pretty much regular burritos with french fries in them.  \nOn a bright side, the quesadillas are amazing.\nOn a side note, it's located  right next to a strip club.  If you don't mind being harassed by the strip club doormen every time you get a buritto, this place may work for you.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-23", "description": "How do you say \"barely adequate to sustain life\" in Español? Because that's what these nachos were.", "author": "Kevin U."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-20", "description": "3.5 stars is about right.  \n\nThis place just can't touch El Faralito. \n\nWhat it did well: flavorful meat. Good tortilla. Large size. \n\nThe bad: Poor burrito roll technique, overfilled with sour cream, internal cheese not melted, multiple gross gristly chunks of meat, and they are salsa nazis.  \n\nBiggest gripe: 8.15+ tax for a super burrito, you can get a burrito and a taco for that much at el faralito.  Moreover, the whole salsa behind the counter thing is lame.  Also, the salsa they had were not that good.  Pico was watery and bland and the green isn't anything special. \n\nOk for the area and for a late night bite, but not very high on the overall burrito meter.", "author": "Mike I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-04", "description": "Came here on Taco Tuesday...man, how I wish I had known about this special before my last week at work!\n\nAll tacos are only $1.50...yes, you read that correctly.  I had fish tacos which combined cost less than one order under the normal pricing.  They were small, but pretty filling.  The fish can either be grilled or fried - I had the grilled fish which was a generous size and juicy.  It comes with red onions, red cabbage and some sauce.  \n\nThe food was a bit salty and the chips in particular were extremely salty...but for $1.50 tacos and a bag of chips, I'm not one to complain!", "author": "Alvina W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-12", "description": "I liked you better, when Taco Tuesday was just $1 per Taco, you killed it for me when you went to $1.50..Shame on you ZORRO :). \nOverall nice place to grab a quick bite, Always a football match to watch in the back room. \nCASH ONLY - NO Credit Cards", "author": "Séamus C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "Fantastic surprise at this place.  We are not from this area & have been trying new places all week. Some have been good, some bad.  \n  The prawn quesidilla was a great deal and very filling.  The steak burrito majado was amazing.  In an area with tons of restaurants, this one has been our favorite by far.  Food tasted fresh and was still hot when we took it home.", "author": "Chris F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "Never hurts to have one Mexican choice in the heart of North Beach.  We checked this out because we had a GroupOn.  Hubby chose their nachos with chorizo.  The plate was piled high and he managed to plow through about half of it before asking for a to-go container.  I picked a Carnitas-filled cheese quesadilla and WOW!  The plate weighed like 5 pounds and was heaping with quesadilla goodness.  Carnitas were nicely flavored with good balance of soft, chewy and crispy.  Cheese was gooey and plentiful.  Accompanying pico de gallo & roasted chilies gave it just the right kick.\n\nFor the price, a satisfying decent meal.", "author": "Lxs S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-24", "description": "Whoa!\n\nNot quite what I expected in North Beach, but after wandering around SF all day I was really hankering for some carne asada! Got two tacos and wow they REALLY pile the meat on! I love when the meat is little crumbles, so they did a good job there. The only thing I would have liked would have been a little more onion/cilantro to go with all that meat.\n\nSucks that they don't give drink refills, but at least they're up front about it.", "author": "Torie Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-28", "description": "OK, so I've eaten here a few more times since I wrote that last review, without any alcohol affecting my judgment, and it deserves an extra star. Chile Relleno burrito is aaaaaaaamazing.\n\nI just wish I didn't have to walk by the strip clubs to get to it!", "author": "Christine K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "Love this place. Their spicy chicken tacos are amazing. I look forward to Tuesdays just to take advantage of their taco Tuesday deals! Also, their grilled fish is so good (when they have it). The Zorro burrito too..fries instead of beans? Yes please! I could go on and on. One more: their salsa!! Only a few kinds, but I practically drink it it's so good and fresh. As is their spicy carrots. Can't wait for tomorrow:) It's a quick and casual place, but clean and gets the job done.", "author": "Misty M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "Zorro burrito is the bomb. Love the fries replacement of the beans and very thin ( not doughy ) tortilla which makes the burrito much less heavy.  Great for the price. Def a try! The place does need some renovating and it can be kept cleaner.", "author": "Carrie T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-13", "description": "Update 3-15: I went back! and Yes this was the spot! DO watch out for those carrots! They are fire!\n\nI was drunk and hyphy. I still need to figure out if this was the place we went to for burritos. All I remember is wanting a hotdog. After the last yelp party, we came back to North Beach and had dogs in a counter service like spot. This time our only choice was burritos. We walk in, wait in line for 10 minutes (it was packed) and we get 2 big super burritos. Carne Asada Meat was good, filling was perfect. Share these bad boys! You won't be able to finish one alone. \n\nAll I remember is how GOOOD they were. I ate like 3/4 and tossed my BF the rest. Poor guy. He was the DD and all he got was a bitten up burrito. I must come back during the day and confirm this was the spot. You know how it is when youre buzzing, hungry and want to attack something greasy.", "author": "Lily M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "French fries in a burrito ? Why no! I absolutely loved that place when my friends introduced to me!", "author": "Khaloud D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "I usually get the burritos here and they are pretty damn good. I like the various specials that they offer throughout the week. Zorro burrito is akin to a California burrito and quite good if you are not being health conscious.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-09", "description": "We have just recently moved back to the North Beach area and I was wondering if El Zoro's food would be as good as I remembered it to be. Sure enough, it is!\n\nThis place is open late, the food is very, very good and it's reasonably priced. Now, this is definitely a take-out place  and not a nice sit-down restaurant , which is exactly what one should expect from a Taqueria. And, the fact that it's next door to a strip club really has no bearings on how good their food is. I just wish that they had a delivery service!", "author": "Mia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "I was wondering around the area looking for something to munch on early mornin and found a good amount places closed around 10 -11 am.  I really wasn't even in the mood for mexican food.  After wondering around long enough I saw that this place was open and I said \"Fuck it, it's go time\".\n\nI went for two tacos, simple.  I wasn't after anything extravagant.  Just wanted something to throw in the ol' gas tank so I can move.  I got a carnitas taco and a carne asada taco.  I sat  and fumbled around with my phone for a few minutes.  My tacos were then handed to me.\n\nThey were delicious.  So much meat and stuff. They do the double corm tortilla thing, which usually I hate, but in this case, it wasn't even enough for all that succulent meat.  I'd probably go again, if given the opportunity.  Of course, there's just so many restaurants in San Fran, it's going to have to wait till I get a few more cranked out.\n\nBoner Apple Tits.", "author": "Jorge R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-14", "description": "Taco Tuesdays are awesome but only for meat. If you don't want meat, you have to pay full price. That sucks.\n\nYou can get a six pack of Coronas for $10 every day and the restaurant area in the back is okay. Expect to wait about ten minutes for even the simplest of orders. However the burrito I ordered was HUGE and wrapped in copious amounts of tin foil to keep it warm just in case I was walking to Oakland with it.", "author": "Alex R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-16", "description": "You ask for mild salsa on your burrito and they give you the spicy house salsa. They don't care. I am writing this review to help remind myself to never go back there.", "author": "Andrew W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-04", "description": "I was surprised to find a decent veggie burrito joint here next to all the strip clubs...but I guess it makes sense. \nIt was big, it was tasty and it was cheap.\nAll you could want in a burrito.\nI am satisfied.", "author": "Kelley D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-21", "description": "It looks authentic so why doesn't it taste it?  Alright, I'm not Mexican BUT I've eaten my fair share while going to Mission High and working in the Potrero area, as well as the many joints in San Jose.\n\nYes, the price is high but considering the location - it's cool.  It's ok at best.  The sad thing is it wasn't even hot - how's that even possible?\n\nIf you have cravings for Mexican in the wee hours and stuck in the North Beach area, this is the place for you.  I think they have a bucket of beer for $9.99 so that is a good deal...so what it's Corona?", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-13", "description": "I had a carnita burrito, with sour cream and avocado and a coke for about 8$. \nThe burrito was huge and it tasted good, had horrible heart burn after, but that's not their fault. right?!", "author": "Alisson X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "This place has consistently won me over for authentic mexican food. I've tried several other spots in the mission and none have sufficed in flavor or quality. Most days I get something basic like a carne asada burrito, chips and maybe a soda. Averaged priced, and usually your order is up in 5-10m tops.", "author": "J K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-06", "description": "They are losing a star....for upping the price of taco tuesday tacos.\n\nYea yea, 50 cents isn't that bad... but eff, I was used to dollar tacos.\n\nThis economy just blows...", "author": "David H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-21", "description": "I've been here twice. The first time I would have given 2 stars, the second time 1 star. I'll round up from 1.5 to 2, for convenience and a decent taco (carnitas) the first time I ate here. Tried the chile verde the last time, which was almost inedible due to the amount of fat and almost no pork. Literally, I had at least a softball size glob of fat, and many smaller pieces of pure fat, covered in chile verde sauce, and at most, 1 full bite of actual pork. This was also advertised as a special of the day on their sidewalk sign, so I would expect it to be better prepared. At $10, it was quite a rip off, since I ended up paying for rice, beans, and iceberg lettuce. Too many options in the area, so I won't be coming back.", "author": "Alison S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-10", "description": "I love their grillled veggie burrito, it's superb.  My favorite burrito in the city.  Salsa bar is also fantastic.  However, the bathroom is gnarly.", "author": "Keegan R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "Pretty good burritos, certainly by most standards, though probably only meh by Mission standards.\n\nI've had the chicken one and the carnitas.  Meat was good quality in both cases, a bit too much rice for my tastes and the salsa was inconsistent on two consecutive days - yesterday it was bland, today more flavorful, but still not spicy enough for me.", "author": "Brian G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-03", "description": "I am kind of a Burrito super fan and this place was just enough to somewhat satisfy my craving.  They immediately lost points when I ordered Carnitas and they told me they were out.  The Carne Asada was descent at best and there just wasn't anything that really differentiated this place from any run of the mill burrito spot.\n\nHuge positive for these guys, they are open late night, and a burrito at 2AM after a sweaty dance fest at Kells is the ticket to eliminating the morning after hangover!", "author": "Ken V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-09", "description": "I came here twice. The first time, I loved what I got (I think it was an enchilada-burrito type thing). Not so much the second time (flautas). Their salsa though is AMAZING. I loved it. Overall it's a great Mexican place with tons of flavor.", "author": "Jay M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "Food is all right, pretty average.  \n\nMain reason this place gets 3 stars is that I called ahead, placed an order and they told me the food would be ready in 10 minutes.  I get there about 15 minutes later and that is when they BEGIN making my order.  They hadn't even started yet and the place was empty when I walked in so it's not like they were super busy.  3 stars for laziness.", "author": "G. T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-17", "description": "We live in the neighborhood and love this place. Taco Tuesday with great fish taco's from $3.95 for $1.50 and on Burrito Wednesday a great (any kind) of burrito for only $6.00\n\nThey have some great fried fish or meat specials also, lots of food for a small price. \n\nAnd where can you watch soccer almost any time while having a great meal?", "author": "The A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-16", "description": "Probably my favorite Mexican food place, I get the chicken quesadilla everytime and it's so huge. My boyfriend can't even finish the burrito. Definitely bang for your buck.", "author": "Allison M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-25", "description": "I'm spoiled because I get much good Mexican food in San Diego. Regardless, this place stinks. I've given it a few tries and I must go out of my way to advise you to stay away. Two of the three girls taking your order are downright unfriendly... so they're off to a bad start. The food screws with your system, your plumbing. Low quality meat and fish... and they use some kind of freaky grease to cook. It'll go right through ya.\n\nBe kinder to yourself; avoid at all costs.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-21", "description": "Raised their prices again. 7$ for a regular burrito and 9$ for a super burrito. A typical burrito joint.", "author": "Jimmy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "Zorro is surprisingly good for being smack dab in the middle of North Beach, swimming in a sea of touristy Italian restaurants. \n\nI've never been bummed about my burritos here. They're not the best in the city but it's open late, cheap, fast and filling. \n\nQuick side note: I hate the \"bouncer\" working here. Why on earth does a cheap Mexican taqueria have a bouncer-type dude that randomly checks order numbers? Do I look like I'm a burrito thief?  Kind of ridiculous.", "author": "Alli J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "I can't believe anyone has anything other than great things to say about this place.  I guess the big negative is that it isn't any closer to fidi.  I am so tired of Tlaloc ruining my burritos with cactus it's seriously not funny anymore.\n\nThe super carne asada burrito is huge $8.05 out the door, and taste like real mexican food!  The salsa bar is sparce, with only 3 choices, but amazing.  I guess the drawbacks are the ambience is not somewhere you like to go hang out for a eat-in lunch and the chips are really really awful.", "author": "jeremy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "Best carne asada burrito I have ever had! The meat is so juicy and delicious. \n\nI live in the Mission and like everyone else here I consider myself a burrito aficionado. I was also under the impression that burritos served outside of the Mission weren't as good. Boy was I wrong! \n\nThe prices are a bit steep by Mission standards, but fortunately burritos are only $6 on Wednesdays. My coworker and I spend the first half of the week anticipating our Wednesday burrito lunch tradition.\n\nMinus 1 star due to the poor quality of salsas available.", "author": "Paul W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Four stars just for the Zorro burrito. It's that good. \n\nI've sampled some of their other offerings -- tacos on Taco Tuesday, for example -- and found them middling. But the Zorro...avocado and french fries in a burrito? Yes, please. It's a little heavy and a touch on the greasy side, but if this is a problem for you, you're probably barking up the wrong tree going to a taqueria. \n\nThe food is cheap and the service is prompt. Go for the Zorro, stay for an additional Zorro.", "author": "Michael T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "I was recently in the city and after a long day of walking all over, I needed a quick but somewhat healthy dinner. I did not have to time have a seated meal and there were a few shady looking places in the area. I noticed Taqueria Zorro and thought I would give it a chance. When I walked in it looked pretty clean, the salsa bar looked maintained and did not have salsa droppings all over. After checking out the menu I opted for a chicken burrito. You could see all the food being cooked and all the prepped food behind the glass looked somewhat fresh. It was almost 7pm and they had a few people at the tables and a couple to go orders waiting. After about 5 minutes my order was ready and everything was correct, Took my order to go and about half way through my burrito my mouth was on fire, I like spicy food  and I can usually handle the heat, but it was spicy. I would have liked if it was just a tad less hot so I could have enjoyed the other flavors like the chicken, beans and guac. I finished the other half later and it was still spicy, but it was good. The perfect dinner on the go and everything agreed with my tummy. I would go back when I am in the area, but I think I would ask for salsa on the side or mild. I used the restroom while I was there and although it was down a funky hallway, it was clean. Which was a real bonus because the bathroom in the pizza shop across the street was gross!", "author": "Yana W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-08", "description": "*Big vegetarian burritos: Check\n*Salsa bar: Check [awesome green salsa]\n*Open late: Check\n*Beer: Check\n*Drunk people stumbling around outside to watch while you wait for your food: Check\n\nSounds like a good taqueria to me! \nAnd it's now replaced my old neighborhood favorite of La Parilla Grill, that used to be across the street and closed.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-24", "description": "Consistently high quality Mexican food.  Typically get their mushroom quesadilla super.  Walk-up short order, seating area.  Nothing special in eating area, for me works best as to-go food.", "author": "Jonathan D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-24", "description": "Best Late Night Drunk Food!  I have never come here before midnight.  The nachos are a great dish to share with friends after a hard night of going out.  \n\nHowever, maybe it is the only child in me, but I love the FISH BURRITOS or the PRAWN BURRITOS.  For nachos, the ideal choice is Al Pastor or Chorizo, but for the burritos, man nothing tops these burritos.\n\nThey have these little Corona Little Buckets, which is not really worth it.  Drink first, and then come there afterward.", "author": "Min P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "I've came here a few times solely to get the Zorro Burrito/California Burrito/SoCal Burrito. \n\nI always come to dine-in and the TV is usually pretty loud but the taste of those french friends inside the burrito more than makes up for it. Overall the place is 3.5-4 stars and I'll round up for them.", "author": "Terry M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "I always get into with people about authentic taquerias opposed to taquerias for \"GRINGOS\" or \"TRANSPLANTS\".. This place is very authentic to me. Just missing live mariachi music.. Its typical to pay almost $!) for a super burrito in san francisco now a days but most of them sucks. This place was good and they had black beans too. A lot of places dont.. this place has a wide variety of combos and fixings.. Come check it out its right for you... Had a super carne asada burrito with everything... even the chips was fresh", "author": "Tareau B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-09", "description": "Very average overpriced Mexican food in North Beach. Nothing here is great and everything OK. Unfortunately, theres nowhere else to get a burrito in the neighborhood so I eat here twice a week.\n\nChili Relleno burrito is the best bet but they will be sold out when you go. Also, try the green salsa if its thick and hasn't been watered down with ice cubes.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "Just a quick update.\n\nMake sure instead of just getting carne asada you mix in the lengua with the carne asada and you get the perfect flavor!  Thank and till my next burrito.  ENJOY!", "author": "Patrick T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-18", "description": "No good, not good at all. They make a massive burrito but that just means more to throw out. Why are there peas in my carne asada burrito? \n\nI felt sick for hours after, maybe it's my fault for not going in drunk?", "author": "matt l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-30", "description": "This place is on the way home from work for me and it's convenient to stop and grab a burrito before walking up the hill.  Very recently, they applied a rule of allowing only 3 small plastic containers of salsa per order.  So, while if you stay there to eat, you can help yourself to as much of their salsas as you want, if you take it to go, it's too bad for you because three's the max.  3 small plastic cups for a big burrito and the chips is not enough for me.   But if I want my usual 5 small containers, they now want to charge me $1 more.   It's the small things like this that break a restaurant for me.  There are others that are more accommodating to long term customers.  Best of luck to Zorro....", "author": "Melissa R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-07", "description": "I like this place enough to come again (and again and again, especially since it's the closest Mexican place next to my house AND takes credit card!) but it's not the best Mexican food I've had. They were really accommodating though, and made my burrito without the tortilla shell in a to-go box (faux-burritobowl!). Half of my box was filled with chicken, so I definitely feel like I got my money's worth. My to-go order also came with a bag of chips and salsa, which was unexpected and really nice!", "author": "Melody L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-16", "description": "A roommate concurs with me, this is hands down the best Burrito place for Nob Hillers/Chinatowners. NOT THE BEST, but the BEST in the area. It'll do the trick. \n\nTAKE-AWAYS: \n- The burrito is huge. That's what she said. \n- The \"crispy\" tacos come to you in an open shell/pie/salad sort of deal. It's not wrapped up at all, so it might come as a surprise to you. HOWEVER, for a light but firm meal, it's perfect. \n\nUntil a better place comes along, this stands on top of the echelon, simply because there are barely any Hispanic joints in this area.", "author": "Abel L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-03", "description": "For not being in the Mission this place has great Asada burritos (super w/ no rice is the way to go)\nFriendly service\nnot too pricey\nquick\nfresh food\nin the Broadway area so you may fall in love with a stripper while you much on tacos.", "author": "Life L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "I came here once a few years back and thought the food was horrible. Since my friend wanted mexican, we came here because it was close. Maybe it's because it was really late in the night, or maybe it's because after being in SF for 3 years after living in San Diego I've finally got over how a burrito should really taste..but the super burrito with carne asada was to.die.for. the carne asada was so juicy, along with the sour cream and guac. mmmm, i can taste it as i write about it. i was supposed to bring most of it back for my boyfriend, and you better believe he was sad when he realized half was gone. \n\nMy friend got nachos, which were also delicious! This is now just not a last resort kind of place, i'm pretty sure i'm craving one of their burritos right now.", "author": "Natalie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "Great carne asada burrito!! Go here with my coworkers, now that is getting fed, serious burritos people... Yum", "author": "Becky U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-19", "description": "Love their food. Best Mission style burrito I've found in North Beach. Sometimes they get the order wrong, sometimes they don't answer their phone, etc. but still a regular spot for me.", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-31", "description": "They have a California Burrito (a real one, with fries, carne asada, guac, and no superfluous fillings like rice; if  you are from SD you will know how important this is)! This, my friends, is a rare find in SF, and definitely worth the $6.95 you pay... There is not a lot of interaction between the \"chef\" and the cusomter, otherwise I would give them a 5.", "author": "Carrie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-14", "description": "Ever since having carne asada fries in san diego I have been on a quest for something equivalent in the bay area. Now i can't say that their nacho fries necessarily blew my socks out of the water, but they were pretty good.", "author": "Sunni B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "This place is awesome. Huge servings and they aren't cheap with the sides. Buy a couple coronas to go with your meal. This was a great place for lunch after exploring China Town and North Beach area.Very filling.", "author": "Paul G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-26", "description": "To finish off my anthology of Santacon, I'd like to bestow the following title to Taqueria Zorro: The establishment that saved me from the abyss.  \n\nAs we staggered and swaggered our way down the streets of North Beach looking for some food to sooth our stomachs, we found many of the establishments were cash only.  Not good, as apparently Santa doesn't carry cash.  We ran into some younger kids that were totally amped on Santa costumes, and they directed us to Taqueria Zorro.\n\nOh how wise these kids were, a regular Carne Asada burrito with no rice, and cheese later and my belly and soul were appeased.  They've got a pretty good salsa bar, with a few choices, each one tasty and fairly mild.  The bathroom at this joint is pretty wild, going through the door you think leads to the bathroom actually leads to a secret passage (staircase) down to said bathrooms.\n\nSecret passages are cool.", "author": "Eric L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "Tuesday = $1 Tacos (Regular price is $2.95)\n\nPollo, carne asada, pork all legit. Salsa and fresh limes for you on the side to help yourself. They also given you a roasted Jalapeno. \n\nHe not a bad deal for a Tuesday. \n\nNOTE: The street its on is hella busy which is standard for North Beach and the restaurant is next to a strip club.", "author": "Tom L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Very good service and food. The grilled veggies Burrito is my favorite meal:).", "author": "Sandra S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-09", "description": "I was having a serious quesadilla craving last night after my bf suggested to get Mexican for dinner. I wanted to go El Burrito Express but it was closed when we got to the door!!! I couldn't settle for anything else but a quesadilla and he didn't wanna drive all the way to El Farolito so we came here after my sister suggested this place.\n\n**Parking is such a bitch on Columbus st!**\n\nTheir menu was pretty big. They had burritos, quesadillas, tacos, nachos, flautas, fajitas, soups, menudo, etc.\n\nThe prices were higher then El Burrito so my expectations for it was higher. I went for the super steak quesadilla. It had steak, guacamole, sour cream, and tomato salsa. ($8.55) To my surprise, I like Zorro's quesadilla better then El Burrito, even though it's more expensive, it was really good, and huge. LOTS OF STEAK. BF got a super steak burrito with everything and it was humongous! He couldn't even finish it, and I don't even think I can finish it, which is a surprise since I eat so much. \n\nI want some more!", "author": "Juliane N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "It's crazy to say I've only tried this place just last month when I used to work in the Telegraph Hill area often. With my recent gig, that was located in Telegraph Hill, all of my coworkers raved about the So.Cal burrito. They would come back to the office screaming, \"OH MY GOD, YOU ALL NEED TO TRY THE SO.CAL BURRITO FROM ZORRO'S!\" I was a bit skeptical, because I am not a burrito person (yeah, I know, what's wrong with me?) and the fact that, if I were to eat it for lunch, I was afraid I wouldn't not be able to concentrate afterwards. Since most of these folks raving and screaming about these amazing burritos were from So.Cal (San Diego), I decided to give it a chance.\n\nWhat's different about a So.Cal burrito? There are french fries (along with guac, salsa, rice, beans, choice of meat, etc.) Yeah, you heard right, french fries--whaaaat! Don't knock it till you try it. \n\nI ate half the So.Cal burrito and I definitely couldn't concentrate after lunch. I wanted to pull a George Costanza by sleeping under my desk, but I didn't. I may have worked a little slower than usual, but all I could think was, \"That was a damn good burrito.\" \n\nAnd I've been craving a burrito since.", "author": "K. E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-01", "description": "I consider myself something of a burrito connoisseur. I blame it on my college days in San Diego - Roberto's, Alberto's, Santana's, Sombrero's, Cotixan...I am well-versed in the way of the burrito. \n\nSadly, the burritos up in the Bay Area had not been living up to my drunken college memories. There was always something, well, OFF about them.  Not anymore.\n\nWe stumbled upon Taqueria Zorro serendipitously after Giordano's had stopped serving for the night and we needed drunk greasy food ASAP. I ordered the Super Burrito - overflowing with guac, chicken, pinto beans, rice, salsa, cheese....holy crap this is what my life has been missing! \n\nAbsolutely delicious, probably not all that nutritious, but they serve you in your seat and hand out lots of water (which is ideal when it's 2 AM and a member of your party is pretending to be awake by propping his head up against a wall). They make ordering a snap, and are patient as can be when people fall on themselves trying to order \"WHORE-CHAY-TA.\"\n\nIn other words, no better way to celebrate the passing of the first hour of 2008 than to be nose-deep in a TZ burrito.", "author": "Devon S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-11", "description": "Carne asada tacos before having dinner. Tacos? Must try the legendary \"mexican\" tacos here in SF so Ive been told. We walked in here by chance and I just had to get me some tacos.... Carne asada ordered and it was decent! Not top notch or authentic as the tacos trucks in LA, but decent. Soccer games on tv and decor like youre in Ensenada's bars is throughout here.......\n\nEnjoy.", "author": "Mike F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-10-31", "description": "Its a good place to go for solid gringo-grub after a night out at the numerous nearby sleazy bridge-and-tunnel dance clubs and/or strip clubs, if that's your bag.  They actually have very good burritos here, and they won't give you sh*t for asking to specialize it for you (e.g. more sour cream, light guac, etc.).  They pile on a huge amount of chicken, which is stewed and forked (not charbroiled) and is supple, juicy and flavorful.  Solid.", "author": "Rick H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-04", "description": "A mission to eat a burrito at every taqueria in San Francisco brought my friend and I to Taqueria Zorro. The place was of his choosing. He had already covered the mission and needed to branch off. So there we were, real San Franciscans, sitting in a tourist trap ordering some hella expensive mexican fare. But what the hell do you expect? It's in North Beach, and you know what for being in North Beach it's really not all that bad. \n\nMy friend the burrito expert found that the burrito was too loosely rolled. However, he found it excellent that they had a variety of beans and he really enjoyed their chorizo. I was not a fan of the dry beans in my taco and had to pretend that they were really the beans served at La Taqueria in order to make the best of the experience. A large amount of sour cream and cheap shaved lettuce accompanied my taco. Fortunately I was hungry enough not care about visual aesthetics. \n\nAll and all, if you're drunk in North Beach and don't want to pay the big bucks for some unrememberable tourist food get your ass over here. Just do remember that the place might also be called Zorro because it carves a Z in your stomach after you've eaten there.", "author": "Alexandra M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "After a horrible time at Cobb's Comedy Club, we decided to go eat around the area.  We found a hole in the wall taqueria, so we decided to eat there.\n\nI order the burrito the way that I wanted with carne asada, lettuce, and salsa with no rice and beans. It was quick and fast within minutes we got our food.  I took a small bite and it was soooooo YUMMMY.  I ate the burrito hella fast, so I was full after just eating half of the burrito, plus it  was a fat burrito too.  It was only $6.35 what a great deal. \n\nMy friend's had ordered a 4 taco's and 2 burritos and a breakfast burrito and they loved it. We would definitely go back again and again.  The foord was worth every penny.  We all loved this place.  I had found parking in a downtown chinatown garage for only $2 for 30 minutes on a late saturday night, but make sure you get your car out by closing time which was 11pm. Or else I dont know since we were done eating in 20mins.", "author": "Kay V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-09", "description": "Disclaimer: I only write reviews when I hate or love a place. And I am livid but I will give their food 3 stars.\n\nThe girl working the register got my order wrong then made me pay to fix it. I ordered carne asada fries and she replied with \"Zorro nachos?\". I looked at the menu and said yes. - I received a burrito.  \n\nIt is not my fault Taqueria Zorro decided to call carne asada fries Zorro Nachos.  I hope the owner has a talk with his employees, because I just had a talk with mine and you can guess what Taqueria in North Beach we are going to avoid from now on.", "author": "Dani Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-27", "description": "Just stopped in for a burrito.\n\nLack of flavor. Lack of tasty salsa. Lack of...substance.\nI can understand how this would be delicious after a night of North Beachin' - but for any other meal, don't bother.", "author": "Dustin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-10", "description": "Beware the spicy carrots!  They are NOT milder than the actual chiles in that bin with radishes and onions, but 10x more spicy.  Ouch ouch ouch.\n\nStumble in drunk to fit in with the crowd... the food is very filling and is great for soaking up that drunkenness really well before you expel it in a doorway later in the night.  Needless to say, It tastes better going down.\n\nTry the burrito with the mexican flag colors on it... fun to share and enough to pick at among 2 or 3.  I splash every bite with some Tapatio.  Horchatas are the best, and remember what I told you about the evil carrots.", "author": "Marjorie B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-24", "description": "I came to Taqueria Zorro in search of Nacho Fries. As a relocated South Bay resident, NO Nacho Fries can compare to downtown San Jose's Iguana's Taqueria Nacho Fries. But Zorro's were quite tasty. The food is good and very afford able. I defiantly be returning.", "author": "Al O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-16", "description": "If you work in the Financial District, you know it's impossible to find a good burrito around there. Some are decent, Alex's and Los Socio's are good in  moderation, but none are really damn good burritos like Gordo's or Pancho's serves up. \n\nWell, let me tell you a little secret: If you can muster up enough mid-afternoon energy, stroll up a few blocks into North Beach and have yourself some El Zorro. \n\nPlenty of seating, a jukebox, a salsa bar, a bucket of beers for $10, and pretty good burritos. Now don't get me wrong, these are not in anyway the greatest burritos ever, but they are good and probably the best in the downtown area. The burritos are huge too. I'm not a fan of the double-foil wrapping, but that's just me. All I'm saying is 1 layer of foil gets the job done. \n\nBut seriously folks, these are pretty good burritos.", "author": "Justin B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-28", "description": "Looking for something semi-healthy, I went with the taco salad, which comes in one of those gigantic fried tortilla bowls, and managed to not eat any of that part! Yay me!  The rest was a generous portion of salad greens, black beans, grilled chicken and a half of a fresh avocado.  Plus salsa bar and being asked if I also wanted a little bag of tortilla chips to go, all this and a drink for around $7.  They had a burrito special that day and feature $2 tacos Tuesdays.  Looks to be a favorite of the neighborhood worker bees based on the line that formed behind me during my visit.  I'll be back.", "author": "e w."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-23", "description": "If you like salsa that tastes like bland tomato sauce from a can and food that tastes like cardboard...  This place is for you.  They would not do a combo plate with a taco and chili relleno so I just got the chili relleno plate...  Almost $14 is what I was charged.. Wow!  not a fair price for what was served at all.  Both the red and green salsas were bland and completely void of heat.  I was really craving something spicy.  No chance at this joint.  When I asked if they had anything hotter she just pointed at the trough of pickled jalepenos...  That's not heat by the way.  Enough said.  Will never return.  And In a city like SF with so many great Mexican joints there is really no excuse for food this bad.  The bar is set high Zorro,  Step it up!", "author": "Tony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "The food is great, cheap, and open HELLA late which is good. My friends and I would get wasted, take the bus over here and get good food. Hey I'm honest...\nProblem with this place is that it is not the cleanest. The bathroom is down right nasty. It s a scene outta a TJ spring break gone wrong special on MSNBC lol. Horrifying....\nBut the food is still good. Go for sure but stay away from the bathroom", "author": "Stacy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-02", "description": "Now can we just take a moment to say \"WOW those Taco's are TASTY!!!\".. I love this place with passion!! Fast and friendly service, nice and moist burritos (don't even need extra salsa sometimes - and i'm usually a salsa-freak!).. The tacos are 'you get your money's worth' size!! Love this place, it's a once a weeker for me at least!", "author": "Rak P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "Zorro is Spanish for Fox.  And Ill be damned if the tacos here aren't more foxy than anything in the strip clubs nearby.  (Just a hunch)  Watch now as our cunning hero outfoxes authority, outsmarts foxy foes and outrageously eats four tacos in a sitting...\n\nOur Backdrop:  \nIn the true spirit of Don Diego de la Vega, Taqueria Zorro defends the people of North Beach against tyrannical touristy Italian joints and provides a safe haven for ravenous intoxicated travelers.  On a brisk Thursday evening, a mysterious masked man manages to slip past the sirens that lure the lost travelers into dungeons of lust and destitution.  With football flashing on the big screen and the scent of spices sifting from the salsa bar, our hero dashes past the damsels and into the taqueria's dining room ... undetected.\n\nOur drama unfolds: \nHungry after a few hours of swashbuckling with the bumbling authorities and charming damsels in distress, Zorro arrives and orders not one but two carne asada tacos.  With a side of ... a chicken taco.  Oh and one al pastor.  And better get one of those $10 dollar corona buckets.  The villagers gasp.  \n\nOur conclusion:\nZorro is too cunning and foxlike to be stopped, and he delights in publicly humiliating those who doubt his dedication.  The tacos fall in rapid secession - prey to a swift crack of his whip or slash with his sword.  He has never met a taco here that he hasn't seduced.  This night was no different.   The bottles sat sadly in their bucket.  Now only limes where beer once beckoned.  The villagers cheered - knowing once again they had witnessed the legend.  And the dancing damsels were then freed from their dungeons to run away with our dashing hero.  A few pounds heavier, some salsa on his cape, and a sharp smell of onions on his breath.  But as foxy and unpredictable as ever.   \n\nOur moral (or lack thereof):\nYou, too, can stop by Zorro and have a tasty taco for (or four) yourself.  And someday, if you are lucky, or better yet in distress, you may catch a glimpse of our mysterious masked hero and legendary cunning linguist yourself.  \n\nZ", "author": "Brad C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-05", "description": "I've been here a few times, usually late at night after leaving some night spot and just before heading on home.  The place sort of reminds me of Mel's.  When I'm there eating late at night I love it and it tastes so good, but I wouldn't ever want to eat there in the light of day.\n\nAt night when my senses aren't all that awake, the food does taste good (it's hot, it's spicy), but some things are off.  The meat for one.  The carnitas always look dry as if they've been sitting out for days and the asada is a definite no go.  Asada/skirt steak as it is, is really cheap to buy so if their asada is on the lower end, well you can imagine...  Also, the al pastor there.  I love al pastor but my mom always told me to be careful where I order it from because sometimes it's old just hidden under all those spices.  Hmm...\n\nBut enough about the meats which were sub-par.  Everything else is decent, not the freshest ingredients, but decent (albeit a little overpriced).  The people are pretty friendly though.\n\nBottom line, if you are in No Beach and are craving Mexican food well this is your place.  It's nestled between strip clubs, and plenty of Italian restaurants.", "author": "Jennifer H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-14", "description": "This place is pretty good. A little ways from my work but hell, the old pancho villas at the waterfront is probably farther. \n\nAnyways, their burritos are pretty decent. Pretty good flavor considering they are not in the mission or in SJ or where other mexican-food-loving people congregate. \n\nI like their salsa bar - it's not big but has stuff I like. \n\nTheir 1 dollar tacos are the best. I've been there the past two weeks and the portions differed...but they are still good. \n\nanyways, I'll be back.", "author": "Leena C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-08", "description": "5 stars for being open all the time, dishing out some huge burritos that I like. Mojado burritos are where it's at.\n\nMinus one star because I have run into some pretty sketchy clientele in this place, but it appears they now have security on Saturday nights. I guess I should expect this from a taqueria next to a strip club, but nonetheless...\n\nMinus one star for the girls that take your order because they're woefully misanthropic.\n\nPlus one star because the sell Coronas BY THE BUCKET. YES.", "author": "Eston B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "Call me stupid.\n\nCall me uncultured.\n\nWhen I see that huge street of Italian places on Columbus I have no idea which one to pick.  Many have the \"People On Yelp! Love Us!\" sticker.  Dishes of gnocchi start to look the same on a printed menu. \n\nIn reality I'm just too lazy.  I wanted something good and my stomach wouldn't give me time to make choices.  I saw a sign that said taqueria and went for it.\n\nTaqueria Zorro didn't disappoint me.  They didn't have some of the extras and additions in the burritos I'm used to at other places but when it came down to it, I got a tasty, meaty burrito that hit the spot.  There's a decent amount of space and a few TV's in case you feel like hanging out for awhile.  The prices are about average with a super burrito coming in between $6 - $7.\n\nIf I'm ever indecisive and drunk in North Beach again, I'll be banging on the gate of this place if it isn't open...", "author": "Steven R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-08", "description": "THIS TRULY IS THE BEST TACO JOINT IN SF... open late night for the hungry, their burritos were GINORMOUS...\n\ni was pretty drunk the entire time i was there after a late night adventure at the club... but i KNOW my eyes opened up as i was handed my burrito... it was heaven.  steak GALORE in their carne asada anything.  we had a big group, and we all had jealousy pangs when we all recieved our food... \n\n\"hungry with our eyes, and not stomachs...\"\n\n- but we were ALL SATISFIED with what we had... sooo yummy, but such a far drive from local nightlife... i also asked for an extra side of sour cream...\n\n- they gave me an ENTIRE CUP OF SOUR CREAM... and like a hungry kitten, i devoured the cream along with my burrito... completely.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "Ok, so let me preface this review with the fact that I was totally crunk when I ate here.\n\nSo, I did this underground race in the Park. Which turned out to be more about drinking than riding my bike. So I roll out of there and meetup with some friends in North Beach. My friends took one look at me and said ok, we need to get you some food before you drink anymore...ok!\n\nSee we went across the street from the bar we were at and there was a Taqueria??! WTF? Tacos in North Beach? I order two tacos al pastor and a tamarindo Jarritos(my fav). \n\nHelped myself to chips, salsa and the pickled jalapenos and carrots. The tacos we're really good. I would definitely eat there again, but I live in the Mission so I wouldn't make a trip out there.", "author": "isaias J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-12", "description": "Standard late-night snack.  The torta (toasted white sandwich spread with refried beans, guacamole, sour cream, cheese, onions, jalapenos, & your choice of meat) is pretty delicious paired w/lime & a huge soft drink.  Chips & salsa on the side (note: extra chips = $1)!  Don't DRIVE here just to eat, parking might be a problem....\n\nIs it just me or is the green salsa is redolent of gazpacho?\n\nCash Only\nTorta = $6.95", "author": "Christina J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-07-12", "description": "Oh, man. This place sucks. I didn't eat mexican food for a year after eating at this dump. So gross. Especially the quesadillas. They are literally dripping oil. Like tablespoons of oil. \n\nAnd they never, EVER, get their orders right. Seriously. I used to work down the street from them and sometimes ordered the nachos (because that's the only eatable thing they have). I would order the super nachos, or whatever they were called. They were supposed to come with cheese, bean, guacamole, the works. And sometimes I'd open it and it would just be nachos. CHIPS!! Seriously. If they had just forgotten the guacamole, that's one thing. But just dry chips?\n\nAnyway, if you are absolutely starving and low on funds, then maybe this place could be good. That's why they get the one star. And if you're ordering to go, make sure you check your order before you leave. I guarantee it's missing something.", "author": "Carla P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-25", "description": "My two word review: Mediocre & Overpriced.\n\nUnfortunately for me, I work just 2 blocks away, so it's the closest taqueria, leading me to eat there every so often.  But after maybe 6 or 7 burritos, I have to say that I've never had one that I'd call \"good\".  \"Adequate\" is as far as I'm going to go.  \n\nHere's the deal: I eat stripped-down burritos (I'm a vegan), so I'm really interested in them getting the basics right.  They only have plain flour tortillas, so nothing special there.  Their refried beans are bland -- seemingly without any flavor or richness.  Their rice is not only bland, it's consistently undercooked.  Few things I hate more than crunchy rice in a burrito!  Their guacamole is almost more of a salsa, with chunks of undercooked onions and other things in it; it's also runny.  Inexplicably, although they grill their tortillas, once they wrap them in foil, they steam them!  This, of course, makes the tortilla gummy.  No idea.\n\nTo top it off, this burrito is more than $5.  And they don't take plastic, but they do have an ATM machine that will gladly keep $3 for the privilege of giving you your money.  Grrr!  And the interior is as charmless and dingy as...er...a taqueria, but in say, the Tenderloin.\n\nI'll probably eat at Zorro again, and I'll undoubtedly complain about it every time I do.  What I wouldn't give for El Burrito Express to open a branch in this neighborhood!\n\nEdit: A better local burrito has been found!  See my review of La Parrilla Grill.", "author": "Curran H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "I love this place cause they are always opened late.  This is a great place to come to when you are partying in North Beach.  Good tacos and a hidden downstairs bathroom to party in as well.  Rocking!", "author": "graham p."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "I was desperately looking for a quick place to eat at on a Sunday. I found this small looking taqueria and couldn't have thought of a better lunch. Although this place might look small there's actually a decent amount of seating especially in the back with a flat screen television. I had a carnitas burrito. They make it fresh so there's steam flying everywhere. I found the burrito pretty good. The only problem is that they wrap the burrito in like three layers of foil even if you're eating-in. If you like opening presents then come here. The salsa bar is pretty small and only offers one type of spicy salsa along with limes and peppers. I'd come back if I were lusting for a burrito. I hear that the vegetarian burrito is good too. I saw one customer order one while another ordered one with what I thought was \"fries\".", "author": "Michael H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "Taco Tuesdays $1.75 tacos. many options to choose from. the meat is delicous, the seasoning is great. Most importantly great great salsa.\n\nI prefer to go here over Nico's Tacos. Atmosphere is not as great but although Nico's is going for more California-Fusion tacos, side-by-side, Taqueria Zorro wins.", "author": "Dave C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-03-14", "description": "Not sure why people are giving this place high marks. \n\n- Too expensive. Burritos are supposed to be 4$. There were items on the menu for almost 10$!\n- Not that great. Salsa wasn't impressive, the chicken was over-cooked and generally bland. \n\nI am from Boston and there are a couple fantastic burrito joints in the city (Anna's Taqueria and Boca Grande) so my burrito expectations are high for SF. I imagine I will do better down in the mission, I suppose that's what I get for getting a burrito in north beach.", "author": "Scott T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-19", "description": "My Go-to Mexican place and I love Mexican food.\n\nI really wanted to bag on this place but it always has consistently great food. The torta is off the chains good and the so-cal burrito is another cant miss option. I have always gotten the steak and been happy having not gotten any of those funky fatty or gristle bits. \n\nBeen there about a dozen times and they are still batting 1000 in my book. Plus they have a great salsa bar with that green creamy salsa that is one of my favs.", "author": "Chris B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-05", "description": "Three stars is actually generous based on the last burrito I will probably ever get from this place.\nCold: seriously, by the time got it back to work, nothing was warm in my super veggie food log. Whatever warmth that the tortilla, rice and beans (hopefully) once had, was somehow lost. And it was warm day.\nWet: Sometimes liquid (from lettuce, salsa, etc) gathers in the bottom of burrito. I'm aware of this fact, and have made peace with many soggy burrito butts (get your mind out of the gutter), but with this particular burrito, it was already leaking out the sides halfway through. Not ok.\n\nTo their credit, the service is pretty good (but it helps if you know a little spanish when putting in phone orders), and their self serve salsa bar with 3 decent salsas and jalepenos/carrots is usually well stocked and of good quality.", "author": "Chadwick M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-09", "description": "damn this place was good! I was asking our secretary about the taco truck down the street and she just shook her head and told me to go here. thank god she took the time to teach this naive grasshopper. \n\nMy carne asada burrito came toasted and exploded with burrito condiments. it was totally messy, just how i like it! Enough mexican folks were eating in here, so i knew i was in the right hands.  I think this place really belongs in the mission, but hey, im happy its close to my work.", "author": "Michael N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-11", "description": "Is it ridiculous that my favorite taqueria in San Francisco is nowhere near the mission? I love this place so much that I go every time I'm in town.\n\nHilarious anecdote: I once ordered beef fajitas to go. My receipt said 'beef fajitas lengua' Turns out 'to go' sounds like 'tongue' or something I don't know but let me just say BEST FAJITAS EVER to this native Texan.\n\nI'm not a fan of the nightlife in the area or the particular crowd on weekends so I might recommend not hitting up Zorro then. But, you know, if you're into it then hit away.", "author": "melissa d."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-23", "description": "Best taqueria in North Beach. Taco Tuesdays and Burrito Wednesdays. I don't order the wet burrito because last time they microwaved it. Yuck.", "author": "James C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-12", "description": "DO NOT GO HERE! I have occasionally eaten here over the past year and although I admit that the food tastes good, I just got home with my burrito and right in the middle is a wad of chewed peppermint gum!!!! What kind of place is this? Be warned. Not sure what else they may be doing to the food at Zorro. Nasty. I am going to tell everyone I know about this and you should too!", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-01", "description": "I used to love this place so much\nCarne Asada Torta is sooo good.\nIt's gotten smaller and less fresh over the years.\nPrices have increased dramatically.\nStill okay Mexican food to fill the stomache.\nLOVE that they open so late.", "author": "Paula Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-18", "description": "The $2.40 fish taco sign immediately drew me into this out-of-place taqueria in the middle of north beach.  The choice of grilled rather than fried fish was welcome, the white sauce complemented the fish well, and the portions were very generous.   \n\nWithout question the best quality-to-price ratio for fish taco I've found in SF so far.", "author": "Jeremy C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-10", "description": "Stopped in here after drinking in North Beach. Ordered a bunch of food I don't remember but I remember it was pretty good. Yum", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "this is more like 3.5 than a true 4 stars...\n\ni LOVE shrimp burritos...because shrimp is my favorite protein... so i search for places that have shrimp burritos... and they have it... \n\nwhat's good about this place is... well... the shrimps in the burrito are huge... and they are whole shrimps vs chopped ones.... \n\neverything else here is a regular mexican joint... they use to have a better salsa bar than what i saw last night... and they are kinda stingy on the veggie toppings for my super shrimp burrito... \n\nthis isn't my favorite burrito place... but it does the job when i'm craving a shrimp burrito!", "author": "Kelly H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "Another day, another super burrito.  Al pastor, with black beans please.\n\nI had been to Zorro once when I was drunk, so of course it was awesome.  It was nice to come back sober and check it out.\n\nThe burrito was respectable; all of the ingredients were decent, they had the right proportions, everything was mixed up well enough and the cheese was melted.  Nothing about it really stood out as a great burrito, but if you're looking for Mexican in North Beach I'd check it out.  And if you're drunk, it will more than suffice.\n\nThey have pretty good salsa, but they don't have Tapatio which is a taqueria must-have in my book.", "author": "Joseph N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-18", "description": "Taco Z is a little bit pricey for fast-food mexican, but at 2 AM it always hits the spot.  We usually get a burrito and they are always taste great.  For a beverage I'll say the horchata.  Tasty!  This would be a 4 star review if it was a little bit cheaper.  \n\nBonus: always a chance of some crazy causing a scene.", "author": "Jordan A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "OMG this place is amazing!!! I got the zorro nachos this time and the zorro burrito last time....so freaking delicious I am beginning to get addicted. Highly recommend this place! It's super easy to walk to, great location!", "author": "Jamie S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-07", "description": "The first few times I came to TZ I hated it and proceeded to talk shmack about it to anyone that would listen.  Call me impulsive, I guess.  I was a vegetarian for 18 years and although I eat meat from time to time, I still choose the veg. options out of habit.  \n\nThat's where Zorro and I went wrong.  How could I be so foolish?  \nGO FOR THE CARNE ASADA people!  The veggie burritos/tacos here are bland and tasteless.  The carne asada burrito is about the size of a football; a huge pouch of ooey-gooey goodness.  \n\nI'm surprised no one's mentioned the $10 Corona buckets, but I guess the secret's out now...", "author": "Kerry D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-09", "description": "Who woulda thought i woulda ended up here? Well, we spent too much time popping in and out of restuarants the demanded a 20-30 minute wait for the 6 of us.\n\nWe were all a little buzzed from the pre-dinner wine and cocktails at another bar, and low and behold, we stumbled upon this joint.\n\nMexican in North Beach? Who woulda thought?\n\nWell, the tastes and textures were cosmically right on for all 6 of us. The food was good, it was filling, service was fast, and we got a lot of food for not much money. I'm glad we didnt' wait 30 mintues to be seated and talked into having another glass of booze on a work night.\n\nThe chicken burrito helped me sober up for the drive home, and I still had money left in my wallet after a night out with friends! Go figure!", "author": "Anita R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-09", "description": "If you are hungy and need the bare minimum meal to avoid upchucking unnecessary food and burping vile odors then head to Zorro's for the basic chicken burrito.  Good shredded chicken, juicy and tender, beans and rice.  I get it with sourcream but I ask them to hold the salsa.  I hate the taste of cilantro when I can still taste the whiskey in my mouth.", "author": "Shiho F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "Solid, fresh, authentic-tasting Mexican food, as in not overly salted to hide flavors that shouldn't be there, and not food that tastes good only when you're drunk and/or desperate, i'm a fan :)", "author": "Lana L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-21", "description": "I've been to Zorro about 25 times. Their burritos aren't that good, so-so at best; their tortas are soggy and rather undersized. I've found that their carnitas, carne asada, and chorizo are quite dry. and i find their green \"guacamole\" sauce to be an inadequate substitute for avocado, or hell, even guacamole. \r\n\r\nYET, i keep going back.\r\n\r\nWhy, you ask? Because every once in a while, they get it right, especially if you get the chile verde, which has been the exception to their pro-dry meat platform. The possibility of getting a decent burrito (based on sheer chance) in concert with its convenient proximity to my office has somehow drawn me back over and over, despite my full appreciation of just how not-great the place is.\r\n\r\nOn a side note, if you're drunk, it might be decent, but even if you're drunk, if you can drive out to the mission, you're better off getting some farolito.", "author": "Bernie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-12", "description": "YES! - I've finally found a great tasting, inexpensive Mexican restaurant by my office again.  I was a bit sad, b/c I hadn't had any Mexican food recently, b/c the restaurants all have been raising their prices, so a burrito now costs almost $10 at most of the restaurants downtown.  \n\nThis place is awesome, b/c the food is freakin' delicious (I had a super chicken burrito yesterday for lunch w/ some chips and salsa for only $7.58 - that's a bargain for Mexican food in downtown in the Financial District).  It tasted fresh and their portions are very generous (I was barely able to finish it all, and I had major food coma after I got back to my office.... so it made crunch numbers a bit harder that afternoon...but sooo worth it).  \n\nThe location is a bit off the usual trail for most people working downtown, since it's up in North Beach, so it was not crowded at all - that's just fine by me.  You should definitely check out this place if you're around the area.", "author": "Minh V."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-09", "description": "Greasy. Dirty. Fast. \n\nI should've known by the color of their guacamole, staleness of their chips & oily smell to avoid Taqueria on North hill. My girlfriend and I wandered into this glitzy place, ordered a grilled vegetarian burrito, corn quesadilla & horchatta. All were dripping with grease, I felt my stomach wanted to curl inside itself after the meal. \n\nThe salsa bar was dirty and stale. The peppers looked appetizing but I was afraid I was ingesting week old condiments. \n\nPeople said this place is cheap...??? Go to the Mission district and find real authentic Mexican food. This place is a tourist trap.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-21", "description": "Absolutely the worst Mexican food I've ever had the displeasure of eating. \n\n\nWhile my girlfriend and I were in town we had a craving for some good 'ol Mexican food. Living in Southern California we've eaten plenty of delicious hole-in-the-wall Mexican food for cheap and this was 1000% not it. We got two super burrito's, her's with chicken mine with Chili Verde.\n\nRight away I was taken aback by the girl behind the counter. After she took our order she proceeded to bite her nails while filling our drinks and handling the lids. Who puts their fingers in their mouth then handles customer's food? Seriously? Again, out the of hundreds of little Mexican joints I've been to I've never seen something that gross.\n\nAnyway, we get our food and I take the first bite into my burrito and what do I get? An extremely hard, dry, large piece of pork. The pork they used was so hard that the plastic knives they supply CANNOT EVEN CUT IT. The rice was so over cooked that it turned to mush in the burrito.\n\nAfter all was said and done we walked out of there $24 poorer and still hungry. Needless to say we didn't eat Mexican food again until we got back home. I am very surprised by the other reviews here giving them anything higher than one star. Maybe those people never had real good Mexican food? If I could give them zero stars I would.", "author": "Brock H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-05", "description": "It's unbelievable that I found an awesome Mexican place near my work. I really can't believe it. Please pinch me. Ok, enough gringo emotion. \n\nI LOVE Mexican food. I grew up eating Mexican food. This place is great. Everything is good. The people working there are \"authentic\". I even got heckled by the woman at the register for daring to ask whether the combo plate included corn tortillas. Yes! Heckle me. I love it.\n\nInvited my friend from L.A. up here. He grew up in Wilmington. Trust me, he knows Mexican food. He couldn't believe the carne asada taco was so good. He's a SoCal snob, like me, when it comes to Mexican food. Enough said?  \n\nOk, maybe it isn't. When he was here we saw a guy get out of a SUV and body-slam a pedestrian in the crosswalk . Ok, that has nothing to do with the food, but, if you show up on Friday or Saturday night, you've been warned.", "author": "Rich M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-28", "description": "I had the nachos here once before, and they were so good! Granted, i was drunk but under that condition the nachos were out of this world.  Ate them again last night and I was only slightly buzzed, and they were not good.  The chips that they used tasted like they were bought from a grocery store.  \n\nGimme a taqueria that fries their own tortilla chips, or give me....lots of salsa to cover them up!", "author": "Jackie D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-18", "description": "Not too bad for being at the intersection of Chinatown and North Beach. Very spicy. Decent.", "author": "Andrew K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-02", "description": "This place is a shit hole.  But the food is incredible.  I really wish there was a wall up so I didn't have to see the vats of meat and other food...but it is good enough that I don't care.  Get it for take out.  It is the only mexican food in North Beach worth eating.", "author": "Kacy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-21", "description": "Made a visit here recently b/c of a Scoutmob promo.  Walking up, I realized that this is the very spot where I had eaten multiple times completely faded.  Never remember it being anything more than mediocre at best, which is an egregious sign considering how the food palate stoops to much lower standards when inebriated.  The stars aligned and allowed me to return again, this time totally sober.  Got the Zorro burrito, which is basically a California burrito - carne asada/avocado/salsa/sour cream/fries.  It's simple, no cheese/rice/beans.  Total came out to $3.50 w/ tax, which was the first plus.  Second plus - holy jeebus it was delicious.  They didn't skimp on the meat and it was probably the best sized rice/bean-less burrito I've ever seen.  Touch of the fries was just right, didn't mask anything, but still could appreciate the contrast from beans/rice.  Overall as a joint though, this place is still hit or miss.  It could be a lot better given their prices, but if you ever happen to stumble into this place, voluntarily or not, try the Zorro burrito.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-12", "description": "I think $8 is a bit much for a super burrito but they're pretty damned big at this place and fill you up.  I usually only eat about half in one sitting and then save the rest for later.", "author": "Paige W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-11", "description": "Just ok.\n\nTasty for drunk people, not so spectacular for the sober.", "author": "Holly F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-14", "description": "This is my favorite taco-stand in San Francisco!  It is so good!  When ever I come here, I always buy a bunch of tacos because I just love this place.  I find myself taking a few along with me after I leave the place.\n\nI really can not comment on anything other than the carne asada tacos and burritos, but from just those to items, I am in heaven.  \n\nThey use all fresh ingredients and the service is quick and friendly.  I can't believe some people don't like this place?  I guess they had a bad experience?  I don't know, I never had a bad experience and everyone that I ever introduced to this place have all given me the thumbs up on this place!", "author": "John O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-24", "description": "I was on one of my North Beach jaunts, walking along past the girlie clubs and wondering if I could find something food-related rather than sex-related nearby. When I headed a bit further, I spotted Tacqueria Zorro on my right and headed over there. (How could I not try a Mexican food place in North Beach? The randomness just made it the perfect choice). \n\n  In any case, the pluses:\n\n--It was pleasantly quiet, a refuge from the construction outside, and seemingly tourist free\n--My grilled veggie burrito was about $6, although I could have purchased a simpler one for $5 something...not too shabby at all. \n--I brought my own water and didn't feel tacky for drinking it there. Thanks, Zorro's!\n\nAnd the minuses:\n\n--The burrito was delish, but nsomewhat heavy. If I'd had a way of transporting it home, I would have done so. I'd recommend splitting it with a friend.\n\nOtherwise, good times, really--I felt completely refreshed after going there.", "author": "Beth F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-20", "description": "Went into today for the second time in the past few weeks. Won't ever be going back again.\n\nMy super burrito wound up costing me an astounding $17.05 by the end.\n\nI ordered a beef super burrito, price tag $7.05. Gave the lady behind the counter a $20. Got $2.95 back. Said \"Hey didn't I hand you a $20?\" She said \"no, you handed me a $10.\" Strange considering I'd just gone to the ATM and withdrawn $40, and now only had 1 $20 left in my wallet. \n\nThe burrito is good, its just not $17.05 good and the service is...well... not the greatest. If you plan on going, make sure you pay with exact change to avoid what happened to me. Regardless of if its a mistake or intentional I can't support a business that rips off customers.", "author": "Jason N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-11", "description": "I think this is the only mexican restaurant in North Beach - it's near work, so came here for dinner. \n\nIt's a bit on the pricier side - regular tacos are $2.55 each and they're pretty small. I also had a veggie taco salad - it came in a crispy tortilla bowl with black beans, lettuce, corn, cheese, avocado, salsa and spanish rice. Some of their burritos are priced in the $8-$9/range. My friend had enchiladas and they looked small compare to the restaurants in the Mission. I liked the horchata, but you can't really mess that up! \n\nOverall, the food was OK and it was playing soccer on the TV so that was nice.", "author": "Gladys C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-31", "description": "Maybe more like 2.5 stars.\n\n  Extremely average gringo-style taqueria. No buche, no tripitas, no cabeza, just the usual stuff, except they do have lengua. Unfortunately the lengua is bland, mushy and totally dissapointing. The camarrones are rock-hard and nasty, the al pastor watery and chewy, but the carnitas ain't bad. Matter of fact the \"El Zorro Torta\" with carnitas is really damn good - depending on who makes it! Unfortunately they tend to run out of it by the time the sun goes down, so usually I just end up with the super vegeterian burrito - which ain't any cheaper than the meaty burritos.\n\n  Their salsa bar is totally average and in danger of being overshadowed by El Pollo Loco, which is just sad.\n\n  A big gripe is that the restroom is permanently \"out of service\" so if you want to stop in here for cervesa and tacos after binging at Grant & Green, O'Reilly's or your watering hole of choice, you are going to be cameling it until you get home or make it to your next destination, which really freakin' sucks.", "author": "Thomas S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-06-01", "description": "Had a Super Burrito with Carnitas which came with some decent chips. When I got home I noticed there wasn't any salsa for the chips. The burrito was huge though, and I couldn't eat the whole thing at one sitting. Definitely a good deal for $7...\n\nUpdate: both the chorizo and carintas tacos are damn good (with simply onions, cilantro, and sauce). Also found the salsa bar...\n\nUpdate 2: carnitas taco(s) once a week never disappoint\n\nUpdate 3 (May 2008): Not sure what happened here, but I've never had a worse taco in my entire life. Both tacos took forever to make, but i'm not sure why, as they weren't even cooked and tasted like shit. Never again....", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-30", "description": "Yum yum yum in my tum tum tum!! How happy am I that there is this fab little restaurant down the street from me?? VERY!! \n\nNothing but the burrito will do for me, especially with extra guac and hold the cheese. Then order a side of chips and salsa, only to sprinkle the salsa inside the burrito. Bite the top of the burrito off, maybe a few extra bites for good measure, then dip your chips in the yummy goodness that is the center of the burrito to really get the most out of it! Hmmmmmm........", "author": "Stephanie J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "The Carne Asada Nachos with everything are amazing! Great place to get a quick bite while drunkenly stumbling through North Beach.", "author": "Adrienne P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-20", "description": "The food wasn't too bad. However, I wanted something to quench my thirst and tried to buy the smaller size coronas. Cashier wouldn't give me one, instead upselling me on a larger size. On a beer. Wow. Great place for drunks and tourists.", "author": "Vincent Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-18", "description": "I'm giving this place three stars.  I tried a Zorro Burrito and it was pretty good, but way too expensive.  I used Scoutmob and would not go back here and pay full price for that burrito.  I'd rather make my own fries and stick it in a burrito from another place, even Gordo, which I'm not that fond of.  I would have loved to wash that burrito down with some horchata, but they were all out.  The front of the place was drafty and the back was hella loud because there was a jukebox blasting music.  I'm not that old, but it was even too loud for me.", "author": "k h."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "I don't know what's with all of the bad and mediocre reviews.  Me gusta Taquieria Zorro!  It is a hole-in-the-wall joint, but the food is yummy.  Their breakfast burritos (HUGE) and super quesadillas (HUGER) are tasty and delicious!", "author": "Patti L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-12", "description": "DAAAAAAMN THESE BURRITOS ARE SO FRESH! SNAP!\n\nSeriously though, it was pretty good... I had a super veggie burrito and I got the spicy salsa... WOW! The salsa was probably the best part, it had this smoky flavor that I REALLY enjoyed... I wondered if maybe they use MSG, because this shit was unnaturally tasty.\n\nOkay, and now the bad... After finishing off a little over half of my burrito, I found a thick, black hair interwoven with the lettuce. It turned my stomach, but being poor has taught me to see past things like this, so I picked it out and kept eating... Ugh.\n\nThis place is open late and about 4 blocks from where I live, so I'll definitely be eating here again...", "author": "P A U L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "SF Food Inspection Score: 90\n\nThank goodness that place got above an 80. I didn't get a shrimp burrito because I thought it had a low score...\n\nWhat a pleasant surprise! \n\nI can always tell how good a taqueria is by tasting their basics: a super veggie burrito. It was nice and wet, lots of good flavas, and inexpensive.\n\nThough no burrito will compare to Ocean Taqueria, this place satisfied my hunger after a long day a work and a long night at the clubs. \n\nThe next time I'm on Broadway and I am not craving Chinese food, I'll come back and try their tostadas!", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-29", "description": "Tasty, quick and cheap! Super Carne Asado Burrito no guac or onions, with sliced avocado $6.50. Huge burrito, ate half today - and now have lunch for tomorrow!", "author": "Janine L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-02", "description": "Ultra low quality meet cooked badly, rude slow service, and small portions.  Skip it even on Taco special days.  I know it is about it for Mexican food in the area, but that it still no excuse for the place. Go else where.", "author": "Derek n."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-06", "description": "Not the best, but that isn't to say I wouldn't come back. Just means, if I had few choices and was having a bad night, I'd come back to what I know wouldn't disappoint me completely. \nI had a breakfast burrito with chorizo, egg, potatoes and cheese. The burrito was gigantic - seriously who can eat that much burrito? The cheese wasn't completely melted which kind of sucked. And frankly, the food lacked some taste. But it didn't taste awful, just had nothing to taste really. \nBreakfast burrito and coke cost me $10, which I think is kind of pricey but you're in North Beach - go eat Italian!", "author": "Liliana A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-30", "description": "Great salsa, get the burrito without the sour cream as the put a little much. \n\nDefinitely overpriced, but best burrito in North Beach.", "author": "John B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "Not bad, as far as these places go.  Food was a bit salty and the bathroom was out of order.  This is definitely a place to visit AFTER the bar.", "author": "Robert M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "Good food, just you cannot eat all the food in one night, the portions are even too generous", "author": "Pamela F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-18", "description": "Really good tacos. I like them better than Nick's, and they're not as expensive. I had the carne asada and grilled chicken.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-13", "description": "Get the chicken burrito.  It's potentially the best in the city.  I wouldn't recommend anything else there, but the chicken burrito is SO good that it alone merits 4 stars for Taqueria Zorro.\n\nTip: you can get half off coupons on the back of receipts at the Safeway a few blocks away on Jackson St between Front St and Davis St.", "author": "kiely c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-06", "description": "Probably the best option for a mexican \"antojitos\" restaurant if you are in North Beach.\n\nI recommend the \"Carne Asada Quesadilla\", it's huge and it's probably the best value for your money. Sauces are not great , they could do a better job by cleaning a bit that area, and they are usually marked as \"mild\", \"regular\" and \"spicy\" which is not spicy at all.\n\nSomeone else also mentioned the \"Corona Cubetas\" which is a good deal for San Francisco prices. \n\nAlso if you are a \"Futbol\" fan , theres always a game on the TV.\n\nI'll give it three stars only because I'm mexican and I'm not used to pay 8 dollars for a quesadilla and a coke. Sauces could be better and the chips, that you get as appetizers before your food is ready, taste like crap.\n\nFood is good, above average, service is great.\n\nTres Estrellas!\n\nciao", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-18", "description": "I used to come here for lunch about once a week as their Burritos were very very tasty. For under $7, I would get a Carnitas Super Burrito to go and that would fill me up until the evening time. The Burrito packed a nice punch and the meats were very tender and flavorful. \n\nI believe this place started getting a ton of business from their $1 Taco Tuesday, which is now $1.50, but it was totally worth it as they didn't skimp on the meat or fixings. This drew a huge crowd and now, I believe their attention to the food has drastically fell through. \n\n\nThe Burritos are not as tasty anymore and they completely jacked the prices up. The customer service is not up to par and its completely disgusting when you find corn in the middle of your burrito, come on now CORN!", "author": "Thomas J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-22", "description": "The burritos are not the cheapest in the world but they are very good.  The people behind the counter are very friendly and this is a good place to grab a burrito and go for lunch.", "author": "david c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "Super tasty and fresh tacos. Everyone here is really friendly and the specials on Tuesday are definitely good value ($1.75 each).", "author": "Lucie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-05", "description": "The guys who work here hook it up! The portions are big and the service is friendly. Taco tuesdays and burrito wednesdays!", "author": "Josie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "I miss coming to this place.  I used to work right around the corner and would stop in every once in a while.  Always yummy after a long shift.  The people who work here are really nice even if sometimes there are communication barriers :).  I'll have to find some excuse to come back more often now.", "author": "Robin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "Awesome burrito! It was a pound if it was an ounce. Great place for lunch. It could only be better if it was bigger.", "author": "Claude J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-30", "description": "dude!  Excellent burritos everytime!  Carnitas done the right way!  Deep fried chunks of pork...pulled and grilled just before they pile them into your burrito! I was like woah after every bite!  Carne asada is really good too!", "author": "Peter M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-20", "description": "This is a great lunch spot if you work in the area, but don't go out of your way for a burrito here. Stick with the steak -- al pastor, if you're a fan, is disappointing. Otherwise it's a pretty standard Mexican joint. Coke in a glass bottle, free salsa station (chips'll cost you), and the requisite burrito assembly line behind the glass partition.\nThe eight-table dining room has a big TV that is perpetually showing soccer games. Whether they're actually live or just recorded and on repeat, I can't tell.", "author": "Marty S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-11", "description": "After walking by here about a thousand times in the last four years, I finally tried this place last night, not sure why I hadn't before. It's your standard SF/California taqueria...nice employees, interior a little dingey, plentiful portions. My burrito tasted exactly like burritos I've had at more than a dozen other places, but that's what I expect. I don't want to be surprised by my mexican food. I'm moving to Paris in two months and I know that I will be having major cravings for burritos just like this.", "author": "Rose K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-02", "description": "i have not been this maddened, furious even, by treatment in a really long time, I actually cant remember the last time i have been so upset. \n\nif you are the owner this needs to be addressed!\n\nafter the giants game last night (game 5) everyone was celebrating in the streets, my boyfriend and i came in to grab dinner out of the chaos. We were wearing giants clothes but we were both sober and did not act the slightest bit unruly. i placed my order and my boyfriend said he will have the same thing. when the food was brought to the table 1 of the items was completely the wrong item, no big deal at all but i let her know in case it was supposed to go to someone else since our order was so simple. the waitress told me i was wrong and that this was what i ordered, still fine.. its just a take out burrito place so i didn't care all that much even though i was annoyed that i paid $9.75 and she would not even acknowledge she may be wrong. before she and i could conclude our very quick conversation i had the receipt unexpectedly grabbed from my hand and to my surprise found a VERY large security guard hovering over me (literally inches away and over my body as i sat in a seat). he was very aggressive and approached the situation as if i were causing a scene and about to start a fight or something. i was baffled, still am.. almost cant express in words. what started as me having a quiet conversation with my waitress turned into a man 3 times my size threatening me with his body presence obviously as a signal for me to shut up. i began to explain that we just had a mix up in the order but he didn't want to hear anything.. still standing his forceful ground over me within inches he demanded i either eat the burrito \"i ordered\" or get out. \n\nWHAT KIND OF SERVICE IS THIS!!!!! i am a 5'3\" girl who came in, paid and clarified to my waitress i was given the wrong food then was basically threatened by a rent a cop 3 times my size to shut up and get out or he would make me. if i had been a vegetarian and was given my item i would have to leave without food because no one would listen to me. \n\nit was to the point where my boyfriend was silent the whole time with a stunned look on his face. afterward he said he didn't want to say anything because the approach that the security guard took indicated he would get physical if we said anything. \n\nwe used to be regular customers to Taqueria Z and will never go back. if you support your employees acting in this manor i assure you, your customers have no business spending money there.", "author": "Barbara C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-02", "description": "Taco Tuesdays!!! $1 tasty ass tacos! My boyfriend and I were walking around planning on having a lil taste here and a lil taste there but after we tried one carnitas taco here we came back after a couple hours and got a few more. The carnitas was flavorful and juicy. Just about the best I've ever tasted. They have your standard little salsita bar so you can spice up your taco to your liking. tortilla chips were free (i think this is only if you eat there). My biggest complaint is that their toilet was out of order.", "author": "Niki P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-01", "description": "Pretty damn good burrito. Only thing missing... decent hot sauce.", "author": "Helen C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-26", "description": "Been here many times -- it always looks good from the outside as an alternative to the bad pizza by the slice and good chinese food options late on a party night in North Beach.  Atmosphere, service, etc., is just fine, and most of the customers on a busy night were local latinos.  Only problem is the food.  Chile Relleno was soggy and full of tasteless cheese.  Burritos are dry.  Salsas are okay but only two kinds.  They've got to have one of the worst fish tacos in town -- the wrong fish for the wrong dish.", "author": "Gil S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-09", "description": "We order 2 burritos and receive only one tray of chips. A hispanic dude walks up and asks for more chips, he gets another tray no questions asked. We go up and ask for another tray of chips, they ask for a dollar. Yah, fuck taqueria zorro. racist bastards.", "author": "Mike A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-22", "description": "Great cheap Mexican food open where you need it (North Beach) when you need it desperately (until 3am). I lived in San Diego for 6 years, and these burritos are comparable to the ones there. I'm partial to the Super Veggie Burrito, but don't let me limit you.", "author": "Kelly C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-30", "description": "Taco Tuesdays!! Great super cheap dinner on a Tuesday night. Love their carne asada. Chips are only so-so and that can be a deal breaker for me, but their salsa selection makes up for it. I always order too much food here and after the meals done deeply regret it and vow to not come back. But it's just too dang good. Their tacos and burrito's are awesome. It's a good break from the italian selections surrounding it.", "author": "Audrey V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-04", "description": "I live near here but always doubted trying this place because it was right next to a hustler club, the decor is whatever and plus I'm a germaphobe.  When I saw it highly recommended on Yelp I felt comfortable trying this place and absolutely love it!   And for someone who hates processed foods, them using fresh steak, chicken and large prawns for their dishes is fantastic.  I also really liked how they used fresh mixed garden salad for my tostada salad (not the cheapy iceberg kind).   Needless to say - I come back here often.  I'm not a big burrito fan, so I've never tried them. But I can at least vouch for their Tacos, their diablas and taco salads.  5 Stars for what it is.  Thanks guys for directing me to this place!", "author": "Ana L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-11", "description": "Average burrito, average steak quality. Nice low-cost alternative to the expensive overrated touristy stuff in the area.", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-12", "description": "Yay! I'm a fan! El Zorro has a really yummy grilled veggie burrito. It's stuffed with freshly grilled veggies, rice and salsa. It's so filling. They give you fresh chips and have a really good salsa bar too. But peeps, it's definitely a no frills taqueria. Think a little bit'o Mission in the heart of North Beach! They are always really friendly, inexpensive, delicious and fast. :) Oh and it's cash only.", "author": "Christy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-06", "description": "one of the best burritos in town.  or maybe it's because it used to be our go to spot for late night north beach dining.  we don't hang out in north beach much anymore, but luckily, i still work relatively close.\n\nif i'm super hungry for a super burrito, i'll come here.  massive burritos that are big enough to save the second half for your next meal.\n\nthey have flautas too, which make me happy.  only complaint, they're stingy on the chips ... why???", "author": "spiff e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-06", "description": "Fast/Cheap/ Close by.. Live Football match's on Tv's 24/7...GOOOOOOAAAAAAALLLLLLLLL!", "author": "john c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-03-23", "description": "This place decent in my book.  Ups?  Good place to fill that burrito craving  when you live in Chinatown.  Downs?  Prices are a bit up.  Burritos are a bit wet and fall apart sometimes.  Well it satisfies my cravings and that's all that matters.", "author": "Doogie H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-15", "description": "Meh. I've never had anything particularly good here. It satisfies the burrito craving in the same way dominos satisfies the pizza craving - the letter of the law, if not the spirit.\nThe Only reason to go here is that it's the only taqueria within an easy walk of the main North Beach drag. San Jose Taqueria at Mason & Francisco is better, but boy, if you're really craving a Burrito, you've gotta head to the Mission - 'Little Italy' ain't burrito country.", "author": "Eric D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-29", "description": "Maybe it's because I'm drunk every time I come here, but the suiza quesadillas are to die for.", "author": "Rego S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-01", "description": "Pretty tasty Mexican food for a neighborhood spot.  I recommend ordering your burrito with the extras - avocado, sour cream, etc - as some items do not come with it already.  The horchata is just decent.  Huge portions of everything.", "author": "Tamar N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "their food is amazing..and at good price....zorro burrito all the way", "author": "Amanda A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-18", "description": "Since brevity is the soul of wit, I will be brief, this taqueria is awful. Some of the most boring burritos I've ever had. If there was a half decent Mexican place in North Beach this place wouldn't stand a chance.", "author": "Robert P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-05-31", "description": "I've been past here probably a couple thousand times and never have tried it out because I have a bias against restaurants next door to strip clubs or porno shops.  But, I had a 2-for-1 burito coupon and my appreciation for value trumps my porn/food mixing rule.  Anyway, the place offers 10 kinds of meat and the interior was not bad.  Lots of Mexican patrons, soccer on the TV, and colorful decorations on the ceiling gave an air of authenticity.  The carne asada was good and the other meats I saw on other tables looked appealing; I just thought my burito was a bit soupy.  I will ask for no beans next times as I believe they were the culprit.  It was a satisfying experience, but nothing to rave about.  With a 3 rating, I basically say \"If I'm in the area and in the mood for this type of food, it's a fine choice\"  Other people in my party liked it more than me, so probably can be considered a good potential for an upgrade if I ever go again.  http://taqueriazorro.com/", "author": "Marc S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-22", "description": "The quesadilla is pretty good, but you really cant mess that up. Its good enough to satisfy the hunger pangs, but its a little pricey so I wouldn't make it a habit.....", "author": "Hector A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-08", "description": "Really good mexican food for a good price.  I cant think of anything witty to say.", "author": "iPunchfish -."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-05", "description": "Didn't expect to find a money burrito spot in North Beach but Zorro gets the job done. Very good burritos with great meats and pretty decently sized. After a night out on Broadway, Zorro is the perfect place to soothe the soul, sober up, and down 1500 late night calories. The line is crazy long after 2am.", "author": "Ed L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-24", "description": "Zorro Burrito (with fries in it, soaking up all the delicious heart-stopping juices) was so good. The guacamole was terrible, not worth dipping chips in.", "author": "Kyle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-19", "description": "Had  super burrito. It was pretty good. I wanted to get the mojado, but the place is cash only. There was a lot of meat. The burrito was $7.54 with tax. The sauces are not that hot so play on! Lots of seating and computer jukebox. And tv's.", "author": "Andrew Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-10-25", "description": "I work nearby Zorro so I've been here several times. I wouldn't call it one of the best taquerias out there but it's pretty good. The burritos are quite large and very filling. For me, it's all about the sauce that they marinate their meat in and it is pretty good. Unfortunately, it's also pretty oily though that's not really surprising. If you're at North Beach and craving Mexican (for whatever weird reason), check out Zorro's.", "author": "Jonathan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Been here too many times to count.  Just good mexi food that is somewhat overpriced.  But in the overpriced section of SF that is North Beach I'll take it.  Veggie Tacos rule here!!!!", "author": "Tito C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-06", "description": "One of the better Mexican places in the North Beach. Their menu is pretty much the same as most places. Their burrito is not Mission Street good, but it serves its purpose. The alhambres is decent, and so are the flautas. Definitely worth walking from Battery Street for.", "author": "Rommel N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-06", "description": "Unlike Gil S., I quite like their fish tacos. Today they were especially yummy and I asked what kind of fish they used (Tilapia). The fish is sauteed instead of fried in a kind of a hot saucy loveliness. The taco is simply dressed, 2 small steamed corn tortillas, onion and cilantro. I opted to add a little sliced avocado, which made me very happy. Don't get me wrong, I love a nice fried fish taco but a girl has her figure to consider.", "author": "Isabella R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-20", "description": "Finding good Mexican food by my job is hard. I'm near Chinatown and the financial  district so Chinese food and American food is easier to find. My bosses and co-worker were getting burritos from here one day and asked if I wanted one. I hesitated thinking the place might be Rubios or Green Salsa but I asked for a burrito and I was not disappointed. Good Mexican food, their veggie burrito is a good choice when your feeling a little guilty about calories and their tortas look pretty good too. Good salsa bar as well!!!", "author": "Shirley E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-04", "description": "Passable if you're desperate for mexican food, but the taste of the food barely surpasses Chipotle. Prices are way too high, servers are way too mean. Plus, for some reason, it seems to attract the most exceptionally prickish drunks on Friday/Saturday night. I went there more than once, and after a while figured out what on the menu could be made okay, so I can't give it less than two stars, but I sure as hell can't give it more.", "author": "Wayne W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "What, you mean to tell me you DONT have to go to the mission for decent Mexican food? I havent spent much time exploring the Mission, but Zorro's is by far the best mexican food ive had this side of Market! It's nice and cheap, and QUICK, like Mexican should be. My only qualm is that their horchata is a little grainy, which does not make for a tasty drink, but the resolution is that they sell buckets of coronas as well...who needs horchata when you can wash your burrito down with a bucket of coronitas? \n\nThe decor is a little cheesy as well. Seating is in the back and it has a semi-cafeteria feel to it. There is a jukebox that plays super spanish music and a tv that is usually playing an old boxing match. Not a classy place but a great one if you're looking for a quick, delcious, fatty meal.", "author": "Sarah I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-10", "description": "this is the best taqueria around my office so far.  The burritos are hefty and they don't skimp on anything.  The quality/quantity is also very good for the price... it's less than $8 for a super burrito.  It's definitely a consistent performer and it's my go-to spot for a lunch-time burrito.", "author": "grant l."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-22", "description": "Probably one of the best burritos I've had in a long ass time. But I paid a lot of money for it and the service was pretty weak. I stood at the counter while the woman cleaned for like 5 minutes. It wasn't a huge deal, but a mood killer. What I really liked is how they mixed my black beans with cheese so that they didn't fall out. Yummy.", "author": "Jenna R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-11", "description": "Loved the Torta with Carnitas. Late night Friday it's the perfect cure for a hangover. Excelent service, cold Negra Modelo, chips were average.", "author": "James K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-27", "description": "Not bad, I always get the Steak Plate on my way to work if I'm in the mood for mexican. I went here late last nite as my roommate was craving some burritos. I ordered only two tacos and they were a mixture of heat and spiciness. Would I come back? I have already. But would I go to another taco place before this? I would if it was more convenient than this.", "author": "Eric R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "The chicken burrito here is pretty awesome. So good that I actually get a craving for it, it's a pretty authentic place in the heart of North Beach definitely worth a try for some tasty Mexican food.", "author": "Olga P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-03", "description": "Great place 'El Zorros'... I only really eat here when im 'El Skinto' as North Beach has many other healthier alternatives.  The burritos are the size of new born babies... Although i find it annoying when i get given a takeaway bag when i plan on eating in...", "author": "Barnie M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "this place is great if you're looking for a cheap carnitas taco and some beans--  and i always am!  seriously.  fast, affordable, tasty, friendly, easy... what else do you need?  i'm down.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-07", "description": "well i've been eating here sporadically for a few years cuz it's next to my work, and the only thing close to a decent taqueria in north beach.  mediocre at best, they get the job done if yr in a pinch.", "author": "eric i."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-06", "description": "probably the best taqueria in north beach!  but really, it ain't bad!", "author": "Jill k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-11", "description": "Best burritos in the area financial district or north beach (San Jose Taquera #3 is good but way out of the way).  They make large burritos with a large amount of meat and great fillings.  The salsa bar is great with several really good versions of the standard salsas.  Warning: their hot sauce contains chopped jalapeno peppers and I would advice ordering the mild sauce.", "author": "Ture A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-04", "description": "dependable, al pastor, quick and efficient ... and how about football 24/7 ... in north beach?  pour me another cold one ...", "author": "tim y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "I was shocked to find good Mexican in North Beach! I was a little buzzed from drinking at Pearl's so I don't quite remember what kind of taco I got, but I'm pretty sure it was carne asada. It was SPICY!!!!! Oh wow I must have guzzled 4 glasses of water after one taco. But I must say it was a mighty tasty taco. If I go back I will definitely ask for something milder! If you like spicy this is the place for you!", "author": "N. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-09", "description": "Best super casadilla in the world. Try it and you will be amazed", "author": "Nick v."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-25", "description": "Very mediocre. Could someone open a taqueria in North Beach???", "author": "Heidi P."}
