{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "CASH ONLY\n\nA wonderful taqueria in the heart of the Mission. It's cash only and from my experience these are the places in San Francisco that know they are not losing business by being so. \n\nThey're recently remodeled! There's now bright yellow walls and colorful traditional flags lining the ceiling. There's a couple communal tables that would comfortably seat six, a couple booths, and some two-seaters. A clean, and fun face-lift T. Cancun!!! \n\nI'm ALWAYS blown away at how scrumptious the food is. This past time I got a chicken taco, which was juicy and delicious. But previously I've gotten the shrimp burrito special, and a classic carne asada burrito. All of which made me forget about how frustrating it was to scramble cash bills. This is a Mission staple and I will one hundred percent be returning.", "author": "Navila H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-19", "description": "Came here around 11 because my friends wanted nachos. They gave us free chips with salsa with our order, that was pretty good. The green salsa was pretty spicy. \n\nWe ordered the nachos with no meat and they just looked sort of sad. The nachos consisted of beans and cheese, nothing else. The chips weren't that crunchy and the cheese just stuck to the chips making it even less crunchy. But it was alright given it was so late and I just wanted to eat something. \n\nCash only!!!", "author": "Donald C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-04", "description": "I ordered a vegetarian wet \"mojado\" burrito to go around 11pm on a Friday night. \n\nIt's topped with hella red enchilada sauce. I appreciate a lot of the sauce, but sadly, the enchilada sauce just tasted like the cheap stuff from the can just dumped on top, I could even kinda taste the metallic flavor from the can. :( \n\nBut otherwise the stuff inside the burrito was pretty yummy, not bad for a late night after drinking meal. But I was quite sober when I ordered FYI. :D\n\nIt's so fat and massive, check the pics.", "author": "Shruti D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-15", "description": "I had two super tacos there. Chorizo and al pastor. Both were really good. The chips were just OK but the sauces were fantastic... Both the green and the red which were very spicy. And the food was served very quickly.", "author": "Gary L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "Word on the street is the super burrito is the thing to try in SF and Mission is where to be.  We found this place on a list of places to eat.  It was a Monday night.  We easily ordered and received our food.  It's pretty authentic here, not offering ground beef tacos.  I had a super chicken burrito. My Cousin had the carnitas and my daughter had a cheese quesadilla.  Not going to lie... Anna's Taqueria in Boston has this place beat for flavor but this burrito is a little bigger.  It needed more flavor but kudos on the real deal cheese here.  My daughters quesadilla had so much cheese if she had eaten it she would have been backed up for days!  A little much.  It was ok but did not knock my socks off.  Also... the tortilla's didn't taste like they were made on site or fresh.  (Plus a $9 burrito?)", "author": "Holly W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-27", "description": "Disclaimer: I am rating this place almost entirely on their veggie burrito, salsas and service. \n\nMy girlfriend and I came here after El Rio during Pride but before our next party stop, knowing we should probably fuel up a bit. There was a bit of a line, but it went by relatively quickly. The cashier was a young guy who seemed indifferent about the line but moved fast enough for me. We had:\n\n-- Vegetarian Burrito (minus cheese and sour cream) // Ok I know this may sound basic since this was essentially just beans, rice, pico de gallo and avocado wrapped in a tortilla but thaT'S WHY IT WAS SO GOOD. (Another disclaimer: I was also low-key buzzed and starving at the time of this meal), but regardless! Everything inside was perfectly executed and the salsas provided alongside the basket of chips were clearly homemade, beautifully balanced, spicy and a great addition to the burrito. I don't think y'all fully understand the value and difficulty level of making homemade salsa that white and Latinx people alike will enjoy. But I digress. \n\nServers were busy since there were quite a few people hungry for burritos and tacos. Still, they handled it all gracefully and refilled our salsas with no complaints when we asked, regardless of having multiple orders in hand at the time. \n\nI might just make this my new go-to late night spot regardless of it being a bit out of the way on my way home - the atmosphere is just what you would expect from a taqueria and in that sense, it feels like home to me.", "author": "Alex K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "I've been coming here for 10 years and there is nothing better than an al pastor (marinated pork) super burrito. \n\nThe meat is super good and the game changer is they toast the tortilla. This allows the burrito to not get soggy if you wrap it up to finish later. \n\nOpen till late, too!", "author": "Drew F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "10/10 would recommend! The super nachos with carnitas were filling and cheap! I even took the extra home. Would come back again. It was great to have some great Mexican in San Francisco! \n\nMy friend had the super burrito with chorizo which she said is also delicious! They also do a vegetarian burrito if that's your thing!", "author": "Jess N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-31", "description": "Definitely this restaurant was misstated and is not a four or five star which made us go there. The food was low quality with the price they charged me \"cash only\". Me and my friend got stomach ache 2 hours after we ate their food.", "author": "Barry K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-10", "description": "I dunno, I think if you advertise yourself out front as \"BEST VEGGIE BURRITO IN SAN FRANCISCO,\" you gotta show up with something besides onions, beans, avocado, rice, cheese, and a mild salsa. It was totally adequate, I'd go there again in a heartbeat if I were a little tipsy, but it's nothing special. The folks who work there are very nice and it makes for a good experience. Salsa verde is superior, but it's nothing incredible.", "author": "Jacob H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-11", "description": "Came here on a nachos quest because a friend who used to live nearby swore the nachos were the best here. We ordered the super nachos (sans sour cream) with carne asada. Definitely feeds 4 people with normal appetites or 2 very hungry folks. \n\nThe carne asada was browned deliciously. And the avocado was sliced and placed on top. However, we couldn't come to an agreement on the salsa (I liked it, my friend didn't). But the whole thing was let down by the quality of the chips which tasted bland. If they got nice thick salty chips then it would be a 4 star for sure.", "author": "Jean K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-08", "description": "It's ok, not bad... not great... good size, good price, quick service, average taste\n\nps... I grew up in the south-bay where we take our burritos seriously so I'm a big of a burrito snob.", "author": "Honeya O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "This is for the al pastor super taco. This taco was so balanced and so delicious. The perfect mix and match of spice and cheese. Fresh avocados, creamy cheese, soft and delicious tortillas, and al pastor that packs a punch. My friend in the area says that the al pastor is her go to and unfailing choice. Pretty incredible incredible for the price. Something about the texture that's unforgettable in my book.", "author": "AnnaRose G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "As far as Mexican food goes, this place is above average. They have a clean restaurant, friendly staff, and surprisingly great salsa. The burrito was on par but I would say it was exceptional compared to its competitors. They were very prompt in cleaning up when customers left and the staff behind the counter appeared professional and hardworking. This is a great lunch stop but the burritos were about 4-stars", "author": "Nicholas L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Vegetarians: go here for a veggie burrito. Vegans: they'll add more Avocado at no extra charge to substitute the subtraction of cheese and sour cream. \nThey're nice dudes who run the spot who never serve anything but fresh ingredients and best of all, this location is open until 3am on Friday and Saturdays and rarely will you see d-bags of the sort that frequent the original location on 18th and mission.", "author": "Kristina B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "This place is horrible. I can't understand how they stand in business. Reluctantly stopped in again this week for a burrito and quesadilla. Extra greasy; tough, rubbery chicken; not a fan of the chips either--too hard and grainy. I want to like this place, especially because it's open late, but the food is just terrible. So much better food available elsewhere.", "author": "J. C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "You will be happy here. Excellent veggie, prawn, and steak burritos.\n\nI prefer the other location on Mission & 19th St, which has best burritos in town. But that location is closed for remodeling so this is the second best place in town. I don't know why it tastes slightly different here but it does. It could just be that at the other location, they make the outside burrito shell a little bit crispier on the grill, I'm not sure. \nBut you still won't go wrong with either place.", "author": "John J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-10", "description": "Come with your Spanish polished:) You'll get a small order of chips and salsa if you eat in. They have water to serve yourself which seems to be the neighborhood trend. Remember cash only, but ATM on site. \n\nShe ordered a burrito and I had two different tacos. Tortillas and meat were very fresh. Not too heavy and the flavors were classic. Great option for plain old good Mexican food. \n\nStaff was also very friendly!", "author": "Amy R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Used to eat here in the 1990s.  Dreamed of it every since and each time I come back from the east coast, Taqueria Cancun is a must. It never disappointments.  Carne Asada super burrito is THE order here.  Like Angels tap dancing on my tongue.", "author": "Greg C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Hands down the carne asada super tacos in the Bay Area. Service is fast. Location is ok and perfect for a late night snack after drinks!", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "Yummy carne asada burritos at reasonable prices. They should offer mild salsa though, even though I know they don't have that in Mexico, but either do they have burritos. They could at least make some accommodations for people who don't like spicy food. Even their mildest salsa is quite spicy and I like eating the tomatoes with the salsa. I guess cause they add the jalapeno seeds in it. I do like that they offer free chips with your purchase. They also have great horchata.", "author": "Jennifer T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-20", "description": "Superrrrr basic Mexican food. Went there to try out the hype and it definitely did not live up to the hype. Typical wet burrito, nothing to fancy or special ot set itself apart from anything else BUT it wasn't a bad burrito, just a very basic one. There are defineitly other burrito spots in the city where you can get a much better burrito for your money.", "author": "Navdeep D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "Came here with some local friends after an evening at a brewery a few blocks down. Hands down best (authentic) tacos ever. Most definitely a hole in the wall place, but aren't those always the best? \n\nCome here after a night out. Order anything on the menu. It's all good. Will definitely be back when I'm in the Bay!", "author": "Katherine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "This is hands down, my favorite taqueria in the mission....I live around the corner from El Farolito + La Taqueria...so that says a lot. \n\n-fast service\n-the guys are always super nice and give you extra salsa if you ask\n-best horchata\n-their nachos (veggie or with meat I've had both) are fire\n-super burritos (veggie or with meat I've had both) are bomb and filling\n-tacos are amazing\n\nPretty much just great all around. \nIt's my go-to every time I crave a good burrito!", "author": "Mandy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "Taqueria Cancun has the best burritos in San Francisco, and by extension, the world. They also have the carnitas that are so delicious they tempted my boo out of 9 years of vegetarianism, and he's never looked back.\n\nHeads up: cash only. There is an ATM inside if you are without.", "author": "Tasha D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-26", "description": "Bla. The chips are super cheap quality and stale . Made the nachos crappy . No one else was too excited about their food.", "author": "Valerie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "There's no place like Cancun.\n\nThis hole-in-the-wall spot is perfect after a night on the town at El Rio or Royal Cuckoo. And yes, they easily have the best tacos in the Mission.\n\nCome here for late night snacks and stay for the free chips. They're always super friendly and the quick service makes this spot one for the books.", "author": "Rachel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Really enjoyed this restaurant. Portions were large and the food was delicious. It's a little confusing picking up your order because there are no numbers. This place is legit", "author": "sean m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-06", "description": "Love this place, I think that there burritos are the best! Definitely coming back soon.", "author": "Max S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "The place is a-OK.   Kinda hole in the wallish but come on in.  Order at the counter and then have a seat til the call you up.   Seats about 20-30 but of course you can get take out.  You may even want take out and head to the bar across the street.  \n\nThey have burritos, tacos and a variety of plates.  It's not a huge selection but that's ok.   Got the large wet burrito and a beer when I was there on a busy Fri night.   It was ready in no time.  \n\nFlavor is good.  Lots of meat and rice.  Lots of sauce and cheese melted into the plate.  Was able to eat half and took the rest home in a go bag. \n\nI know a lot of people rave about this place and I have to say that it was good but no more than many other Mexican restaurants in the city.  Not sure that I would go out of my way to get here but if I was walking down the street I just might come in back.", "author": "Marcus K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Every Mexican place I go to I always get the Carne Assad Super Burrito. I'd have to say this is behind Taqueria San Bruno regarding the taste. Behind La Taqueria regarding the balance of ingredients inside of the burrito. Behind El Farolito regarding size and a slight lower grade in taste. That being said, it's not too far off from these 3 spots. Great taste, Great price, very stuffing. There just wasn't a WOW factor. Chips were okay", "author": "Jason F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "Got sick twice at this place. 2nd time my whole family got sick.   The cashier with the diamond earring does not have any customer matters. If u don't want to get sick do not buy food in here. Good luck!!!", "author": "Monique M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Only stopped in to poop but the bathroom was relatively clean. Had soap, paper, and a working hand dryer.\n\n4/5 would recommend.", "author": "Nude P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-10", "description": "Hot damn this is a good burrito. I had a super burrito with carne asada, and it was magnificent. Great balance of flavors without being greasy or heavy. The green salsa goes well with it too.", "author": "Price H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-04", "description": "Their meat is good\nThey messer out our order pretty bad though\n\nWe ordered three burritos, different meats and some without sour cream or cheese. The orders came back all mixed up. Might be a mistake but 2 of the burritos weren't the right order at all, and it wasn't too busy of an afternoon", "author": "Jad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Went for some tacos and a burrito and it was amazing. It tasted like my mothers cooking and that's a major plus this place is honestly so good and really good on pricing. New favorite spot.", "author": "Maria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-29", "description": "The low key, underrated Mexican food joint. That's my thing. \n\nThere's no lack of Mexican food on Valencia, I'm aware of that first night I stayed around. But with all these hipster-ish restaurants and all, sometimes you just want a nice taco/burrito to go, go back home and watch some utterly offensive Jim Jefferies stand up comedy, with a bottle of cold beer and some laughters. \n\nSo yeah. Late night and nowhere to go? Cancun is your best friend. Don't mind staying at the restaurant if you don't feel like to. Yeah don't let the interior fools you, the food is killing it.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Probably my favorite mission burrito place. I like this location and the one actually in the mission. Both are dives but the burrito is incredible and lasts for 2 meals. The guy was super cool and I added egg to my veggie burrito. They give you chips too wherever you eat in or take out. Washed it all down with horchata. \n\nGreen salsa is killer! Some of the best so don't miss it!", "author": "Alison B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "One of the best vegetarian burritos I've had. For $8.50 you get a huge burrito plus chips. I liked that they heat the tortilla to the point that it's a little crispy like on a quesadilla. I don't know what it is in the burrito that makes it so special, but you'll look forward to every bite no matter how full  you get. The interior is great as well, with bright yellow walls and dozens of little flags hanging from the ceiling.", "author": "Ben E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "Can anyone say \"crazy cheap burritos\"? Damn!\n\n$5 for a burrito so big I had to finish it in two meals, plus chips and salsa. Pretty good deal if I do say so me'self\n\nIronically, the chips was actually much, much tastier than the burrito itself.\n\nThe burrito had a lot of stuffing (meat, rice, beans etc), but ended up being very dry with not a lot of sauce. The chips, on the other hand, was surprisingly good--it wasn't just plain tortilla chips, they had some kind of spice baked into it. The salsa sauce served on the side was also had a real spicy KiCK to it.\n\nThe inside was decorated like some kind of festival is going on All Da Time, which is uplifting in a way.\n\nWeeeeeeeeeeeeeeeeeeeeeeee", "author": "Henry L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-19", "description": "This was once a fine establishment to satisfy a voracious appetite. Their salsa verde was decent, the staff knew customers by name and they preemptively placed your order as you approached the counter near the register; this made life great, if not easier. \n\nBut I'm afraid to admit that the comfort of having a quality veggie quesadilla in this neighborhood has vanished. \n\nIt was evident that this place was in decline several months ago when I was served salsa verde that was gray. The salsa gray was forgivable. \n\nNevertheless, the customer service has abruptly disappeared. I ordered and paid for two quesadillas several weeks ago, but was only given one. I had to contest this with the man at the register because the server demanded that I bear the burden of proof to prove the purchase of the second quesadilla. The transaction history proved my case. \n\nYesterday's order was a debacle. I ordered two veggie quesadillas to go. When I arrived home, I was eager to subdue my drunken belly. I bit into the quesadilla and immediately spit it out. It had chicken. Yuck! \n\nI dashed back to the taqueria in a fury and asked that they correct this reckless order. They agreed to do so after I expressed my dissatisfaction. This error is totally inexcusable. \n\nI'm writing this review at 5 in the morning because this experience has crippled my faith in defending this once great place and I admittedly can't go back to bed. \n\nWhat was once a landmark in our neighborhood, is now a blurred taqueria store front not worth the convenience. \n\nGoodbye, Taqueria Cancún.", "author": "Tommy G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-18", "description": "Looking for cheap Mexican drunk food? The carne asada quesadilla is fantastic and hit the spot late at night after drinks. It's basically a slab of steak with melted cheese, then fried in a tortilla. 10/10 would order again.", "author": "Jane S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "We were close, it's highly recommended. We tried it and didn't even order food! \nThe overwhelming smell of Pinesol, the fluorescent lights and the plastic seating killed our buzz.", "author": "Maria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "Just had some super chicken tacos  for late lunch. Definitely full. They mean super when they say super. $3.99 per super tack with everything.", "author": "Maddie N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-16", "description": "I prefer this location over the other.  Still good food, but w/o the intense crowd.  also, this part of mission is safer..\n\nthe super taco fills me up just enough before an evening of drinking.  and it's only $3.50", "author": "Angelica C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "Asked for extra salsa twice and when we got to the bar where we were eating we did not receive any. My friend and I were sick the next day. We think it is because the refried beans had lard in them and we are veggies.", "author": "Lori S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-17", "description": "When I was pregnant, I told my husband the first meal I want to have after my labor is a good steak quesadilla from a taqueria.  My husband delivered.  He picked this place because it's walking distance from St. Luke's hospital.  It did take a while for me to enjoy my first meal but it was good.  It wasn't the best quesadilla, I still like El Farolito's or La Guadajalara but this one was good enough.  My husband liked their burrito too.  Funny thing is since trying this place, we've gone here a few times.  Went here before getting discharged from the hospital and many times we've gone to doctor's appointments.  We do love mexican food.  I think my one qualm is I wish it had more sour cream.  \n I think the great review is the great memories that's tied to it.", "author": "Claire J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-27", "description": "The food here is pretty good. Definitely good for when you're drunk and just want some comfort food. The only thing I don't like that they don't have a salsa bar. You have to ask for more salsa and they give you very little.", "author": "Julia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Fresh tasting ingredients, not bland or salty, sour cream actually looks like sour cream and their guacamole doesn't look like a variation of watered down pesto sauce. Yes, I hate when taquerias serve up a type of the aforementioned guacamole, it needs to be smooth and with a bit of a creamy texture to it. \n\nCancun ranks pretty high on my list of favorites.", "author": "Esther A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-08", "description": "Great late-night burrito. \n\nIt's what you'd expect: kind of dirty, hard cafeteria seats and packed to the gills. Lots of savory meats on the grill. Tacos, burritos with every part of a cow or pig (or chicken) that you'd want. They are generous with the meat. \n\nOnly disappointing part was lack of a salsa bar, only giving you a small side of pico de gallo. \n\nThe al pastor burrito was passed around and (almost) unanimously voted \"best burrito we've ever eaten.\" Our DD (and only sober taste tester) the next morning clarified, \"it was just alright.\"\n\nSo, if you come in the cold light of day, it may be a different experience.", "author": "James W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "If I could give negative stars I would. I came here for the first time and the cashier was really rude! I got my \"super\" burrito with no sour cream expecting me to eat all dry. So I returned it and when I was telling him he looked at the burrito all confused so I opened it up and showed him. Who ever is the manager should really teach them customer service and how to make there own food they have on the menu.", "author": "Lola B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Best spot to get a burrito after some drinks. The carne asada super burrito is extremely good, top it off with the green sauce and you are good to go. It's a cash only place, they have an ATM there but it's a $3 fee. It's my favorite spot to get a burrito at all hours of the day.", "author": "Steven C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "This place is great. Great prices, delicious food, and its open late. You will never leave hungry or disappointed.", "author": "Leo V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "The food here is just average and pricey for what you get, I thought. \nGot the burrito mojado de carne asada and it was just OK.  The meat wasn't anything special.   I thought the sour cream or crema on top was too sour.  The burrito is a decent size.\n\nThe shrimp cocktail tasted off.  The shrimp tasted gritty. \nHorchata was average and slightly watery for my taste.", "author": "Heejin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-24", "description": "My go to spot for any thing carne asada....  they dont play around when it comes to the tortas.  One day I will figure out how to make their green sauce.", "author": "Adrian J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Always amazing. Their al pastor is absolutely fantastic and I love the quality of their tortillas. I love going there and their green salsa is also delicious.  Everyone needs to go here especially late evenings.", "author": "Sean K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-04", "description": "This place is bad I gave it a try I ordered chicken enchiladas and they were the worst enchiladas I had and to top it off their orchata no words never going back there. Last the prices on yelp are different", "author": "Leo G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-14", "description": "you can't find a place that is cheaper than this 6.50 for super burrito 5.50 for regular and a vegetarian!! \nonly thing they speak little English! so little hard to order something that little more then they can understand. \noh well I'll still come bk! bc it's cheap!!! lol!!!", "author": "Lizzie G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-30", "description": "The plus?? it didn't give me food poisoning.\n\nNow for the minus. Ordered a bean and rice burrito, it was eh, you'd think for $8 they would give u more than a baby slice of avocado. \n\nThere's no salsa bar, and when you ask for more salsa, they'll tell you \"there's some in the bag (yes a teaspoon)\" and when you ask for more, you get a crazy attitude look and one more salsa. \n\nToo much mexican food in the mission to put up with that.", "author": "Rocky R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-22", "description": "Inedible, I end up going once a year since it's literally right next door to my apartment.\nI have no clue where these 5 star reviews come from. Take your money someplace else, you'll even have a better meal from safeway up the block!\n\nJust got a burrito for lunch, didn't finish it (and I finished almost everything I get)\nGuy handed it to me in gloves with raw beef blood on it. Inside was nasty tasting as well\n\nThe restaurant smells of some industrial cleaning product (though it's not very clean) - so much cleaner that your nose will start to hurt. I wonder if they are covering up for some sort of other nasty smell.\n\nI will not be coming back.", "author": "John L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "Super taco is nice, reasonable price and enough to make you full :) Staffs are nice. They help you go through the menu. You can even ask for extra salsa source.", "author": "Aim-on S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-10", "description": "I heavily rely on lengthy Mission Street as my 5-star destination for my burrito craving. You can't go wrong with most of the finer taquerias for your craving of the \"silver bullet.\"\n\nBut after my recent visit to Taqueria Cancun near Bernal Heights, I may have depended on them way too much. \n\nI came here for lunch and ordered my usual super burrito. For $6.00, I get the grilled steak with rice, beans, salsa, avocado, sour cream, Mexican cheese, chopped onions and cilantro in a large flour tortilla. All the key interior ingredients were fresh and tasty and the grilled meat was grilled very nicely. But the cook burnt my tortilla while cooking it on the grill. I don't mind the tortilla being a little burnt, but it was overly scorched (see my picture and would you eat that?).\n\nI've been eating here about forty times, but never had any problems here until today. Burning the tortilla is a minor issue, but I'll continue to come back and eat my burrito here and other food.", "author": "Matt G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "I really like this place. This was my favorite Taqueria in my childhood. They still have great food. All the food taste very fresh!\n\n I just went recently and was glad I did. The only thing that threw me was that they only take cash. That can be a deal breaker for me since I never carry cash. \n\nThey have very late hours as well. \n\nI would give them 5 stars if they just accepted debit/credit card.", "author": "Sarmad N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-21", "description": "Writing a review for Taqueria Cancun is unnecessary. Who doesn't love good tacos? However I do need to express my love for the Carne Asada Nachos. They get their own review. \n\nI went out with my friend Rosy to play bingo at the Knockout, on our way we picked up some yummy beef nachos, extra jalapenos. The Knockout lets you bring in food, as long as your tidy and those lucky nachos made me win bingo on the first game. The Carne Asada Nachos are pretty big, so you get a lot for your money. \n\nI couldn't finish the review without mentioning the Grilled Chicken Burritos, which are my favorite and two meals for me. Also the Ceviche tostada deserves an honorable mention.", "author": "Rebekah T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-20", "description": "You guys. They changed the salsa verde and it sucks. The only reason to go there was for a vehicle for that salsa. It's time for revolution.", "author": "Brooke B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-07", "description": "I came here drunk after a night out. My friends and I placed our orders and surprisingly it took for ever to get our orderd because the food runner refused to answer our questions. He pretended he did not understand Spanish, well this guy looked like Cantinflas and his accent was thicker than Sofia Vergara's so I hope next time he knocks the B.S. off and stops acting like a douchebag, otherwise we'll end up at the next-door taqueria.", "author": "Chloe B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-17", "description": "Carne Asada Burrito = Stomach Ache all next day and bathroom visits in the high single digits.\n\nThe very least I expect from a $10 burrito is for it not to jack up my intestines.", "author": "Jim M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-05", "description": "This place USED to be pretty good. The quality of their food has dropped tremendously over the past couple of years. Pretty obvious they just don't care anymore and it definitely shows, and their prices aren't any cheaper than their competitors. As a quick note the carne asada can/will now have chunks of bone and a healthy serving of un-chewable cartilage nodules.\n\nAfter getting food poisoning (never had food poisoning before), as well as a close friend at a different date, will opt to never go back unless its for the cheap chips and salsa. A bloody shame too as it's the only simple taqueria in the vicinity :(\n\nDo yourself a big favor and hit up 24th street and have pick of the litter of many that are better.", "author": "Dayman D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "Humblebrag:  I have eaten what some might consider an alarming number of burritos in my life, from all across the country.\n\nThis location of Taqueria Cancun is probably my favorite taqueria.  Way less busy/pretentions/full of partiers and hipsters than the other Mission location.  Their super burritos are a gift from Maude.  Meat grilled perfectly, stuffed with avocado, and if you're super pro you'll ask them to grill the tortilla.  Staff has always been incredibly nice.  In retrospect, I think it may have been a mistake to write this review because now I'm craving one of their toddler-sized burritos.\n\nCash only!", "author": "Amber M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-29", "description": "This place has messed up my order several times now. Worst part is that the order is very simple yet these guys always mess it up. This morning I just ordered a chorizo and eggs breakfast burrito and ended up with a greasy soggy burrito that only has beans chorizo meat and cheese. The most disgusting burrito I've seen in my life.", "author": "Ron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-21", "description": "I'm at St. Luke's Hospital in early labor and all I want right now through these contractions is a super veggie burrito from Can Cun. \n\nThat's what I think of this place.", "author": "Bonnie G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "OK, so how can two Taqueria Cancuns (...or would it be Taquerias Cancun) be so different? The one I've been to in my distant past is the grimy one that's still there at Sixth and Market. I get cold sweats thinking about how I ate there once and had a derelict yelling at me for not giving him some change. It was not a dining experience I ever wanted to repeat, and I sprint just a little faster every time I pass by it on the way home. \n\nSo it was with trepidation that I suggested to Jamie W. that we go to the one in the Outer Mission after noticing that El Zocalo was closed (yet again!) Wow, what a difference a neighborhood makes...so bright, open and colorful with a conscientious server and lots of seating. The menu is full of bargain-priced food, enough to thrill a truckload of illegal migrant workers... IMMIGRACION!... IMMIGRACION!!\n\nOr even an overweight Asian-American looking for a cheap meal. But is the food better than my memory of their sister operation? Oh yes. I ordered the $4.99 Carnitas Torta, melty goodness in a French roll with plenty of pork, cheese, refried beans, and avocado along with tomato, onion and sour cream (see photo). Because it was cheap (a bad excuse), I also ordered a simple $2.99 Quesadilla that used the same cheesy goodness (see photo). Delicious.\n\nJamie ordered the hefty $7.99 Super Nachos platter, an extravaganza of corn chips, melted cheese, refried beans, sour cream, guacamole and salsa with chunks of al pastor (marinated pork) and slices of avocado and jalapeno on top (see photo). Like I said, hefty... and awfully good. \n\nFOOD - 4 stars...really good Mexican on the cheap \nAMBIANCE - 4 stars...Surprise!... clean and spacious, especially on a weekday night \nSERVICE - 4 stars...certainly fast enough for my considerable appetite \nTOTAL - 4 stars...OK, the good sister lives in the Outer Mission and her evil twin lives off Sixth...got it?", "author": "Ed U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-17", "description": "Hey, if you've got a big appetite or you know your date does, then you might like how the burrito is stuffed, rolled and covered in sauce here. The competition for best virgin burrito in SF is a tight one. This joint is just about as good as any other. If your date eats the whole enchilada (meaning burrito), your luck will probably run out shortly. Those things are big enough to stuff a mule and keep it going until it gets to the other side of the border.", "author": "Anna L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "Even though everyone raves about La Taqueria a little further up Mission, I would choose Taqueria Cancun every time. \n\nWhen it comes to vegetarian tacos, there is no contest. The beans,the salsas, the perfect proportions. Everything is so flavorful. Meanwhile a lot of other places just seem to dial in veggie orders and focus on the meats. \n\nI would totally give this place 5 stars if there was anywhere to park. But that's okay, I'll honestly risk the ticket.", "author": "Jasmine M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "I got the super burrito with carne asada and it tasted great! The chips and salsa are pretty good too. The order comes out pretty quickly so if the line seems long, don't worry, it'll move fast. \n\nNot a great dine-in spot, definitely more of a late night place. It's a pretty small restaurant, a little dirty, and the place probably seats about 30 people.", "author": "Jason X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "This is my favorite Mission burrito spot. Way less of a line than some nearby spots and I prefer their burrito over other more highly touted places in the area. \n\nSeating can be a bit hard to come by.", "author": "max m."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "They just raised their prices to a ridiculous amount and I will now boycott them indefinitely. Plenty of other places to go in the mission. The owner decided to get greedy and increase the price for a super and veggie burrito to $9 ($10 after tax). Insane. Absolutely boycotting.", "author": "David C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-27", "description": "Their food is very good and authentic, I definitely recommend Taqueria Cancun. The homemade Melon juice was a refreshing choice too.", "author": "Randy S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-15", "description": "The food is average. I've had much better. I asked the Alex (the guy at the register) if the chips are homemade. He told me they make their own chips. When I asked for hot fresh chips he proceeded to tell me that the chips are made at their other location and are brought to this location. The chips look store bought. They're stacked in baskets and handed to customers who are dining in the restaurant. Basically, the chips are inedible.", "author": "Not Impressed A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-16", "description": "Inquired about animal products in rice and beans-not vegan :( \nAlthough I mistakenly ate a burrito- it was delicious. Just saying.", "author": "Teresa C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "Quick service. Delicious burrito overflowing with the ingredients. The tortilla grilled, toasted then I just love that. Not too much cheese, everything tastes so fresh. Complimentary chips and salsa, pico de Gallo and green salsa. I love this place.", "author": "Tasina H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "Wow!  When you go away from this stuff for a long time it taste crazy good.  I know a lot of people prefer other taquerias in the city...I've been to most of them that haven't been established in the near term (3 or 4 years) but I grew up on taqueria cancun (since the 80's @ the orig in 6th & Market) and I love me some BURRITO MOJADO or ALAMBRE.  No one makes a wet burrito like taqueria cancun.  Get al pastor or legua for meat choices.  If you like something different go for the cabesa or sesos.\n\nStay away from your boring dry burrito guys.  Make it WET...the pleasure is all there.  Don't knock it till you try it.  C'mon live a little...be adventurous.\n\nReally great service over here this afternoon.  If you speak Spanish, even a little, it goes a long way.", "author": "Jules S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Solid spot for Mexican food in the city.\n\nGot the veggie burrito ...'twas so delicious!! My boyfriend got two carne asada super tacos that were easily...hands down the best tacos I've ever tried and seen so far in my life as a Californian.\n\nDefinitely will choose this location over the one on market and 6th. It's cleaner, bigger and the tacos are better.\n\nThey kindly give you chips with quac AND salsa! Incredible", "author": "T R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-28", "description": "Good late night tacos! Went after a show and it was exactly what I wanted from my first taco in the city! Would go again anytime! I had the super taco with al pastor, avocado, sour cream. Highly recommend!", "author": "Katherine L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "I loved this place. I am all about culture and this place had it. We looked at four different places before going to this one. The service was fast but the space is really small. There was just enough room to walk past people but it was totally worth it. The food was fantastic. The portions are  more than worth your money. \n\nOne thing I was pleasantly surprised at was the bathroom was so clean. The staff was cleaning while we we're there so they get props for that. That shows me that they want to portray a clean environment. The only downside was in the bathroom, there was no where to hang my bag but it wasn't that big of a deal. \n\nThe only reason it gets a four is because of the lack of space. There is just enough seating and the seating that is there is really close together. (I'm all about personal space.)", "author": "Monique L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "One of my favorite taquerias in SF. The burritos and suizas are unreal. Try their el pastor. Pretty cheap too which is a major +.", "author": "Lucas H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-22", "description": "To this day I cannot fathom how this place has a following.  But, the great SF burrito debate drags on.\nThis place is best for broke people with no textural sense, but looking for nutritional sustenance.\nFirst; why lettuce on a burrito?  It just wilts and turns to mush.\nSecond; why rice on a burrito?  But this is a fundamental requirement for many burrito fans; so we just have to agree to disagree.   For me, rice is just extra carb filler.  It adds nothing to burritos other than size.\nSalsa here is lame.", "author": "Josh K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-23", "description": "Make that 200 reviews for Taqueria Cancun.\n\nOkay, I'll say it again:  Lots of places serve \"good Mexican food\".  Here, you can certainly get it.  I'm always on the lookout for a place that has a great $5 burrito, and yes, they have it here.\n\nThis is one of those \"if you're in the neighborhood\" places.  Yes, if you are, this is a place you will want to visit for solidly good Mexifood at a good price.", "author": "Matthew D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Great burritos... I must have had a thousand of these in the 15 years I've lived nearby. Mostly veggie burritos, as meat is the weak spot at this place. But the boiled shredded chicken is quite good! Carne asada, not so much... I prefer that at farrolito. BUT nonetheless, this is the restaurant I go to more than any other, and that says a lot. The salsa verde with blended avocado and tomatillo is epic!", "author": "Fletcher S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "Hit and miss. So far, I've been here twice and ordered the chorizo super quesadilla both times. My first time here was amazing... Five stars, I was in awe. The quesadilla was so big and delicious! The second time, it took them nearly 20 minutes, and my quesadilla was barely warm. I highly recommend getting a super quesadilla (and probably saving half of it) since the normal quesadilla barely has anything but cheese.\n\nThe service is fine, willing to help you but not the friendliest. There are a bunch of tables you can sit at, but they could be cleaner... Price is great, and they give you some chips and salsa too! I'm not used to getting anything free at a less-than-$10 place!", "author": "Kimberly Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "Taqueria Cancun is a small taco shop on Mission Street that is open late and services beer until 11 pm.  It's a great late night place with good burritos and even better tacos.  Every order comes with free chips and salsa (red and green salsa) which is a great bonus for your order.  The food is made quickly and they supply unlimited water as well.  I've only come here late at night and the night-time weekend rush is not too bad because they're service is very efficient.  They burritos are made fresh with rice, beans, lettuce, salsa, and your choice of meat as well as guacamole and sour cream if you ask for it.  However,  I prefer the tacos (2 per order) over burritos because they are amazing and made to perfection and they do not fall apart while you eat it.\n\n\nI would recommend it to anyone is out and about in the mission on a Friday or Saturday as it's a great late-night eatery!", "author": "Robert T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "I saw the guy who was preparing by burrito spit in my food. The burrito was soggy after. I think it because I'm white. I think this is another one of those racist Mexican restaurants in SF. I hadn't done anything wrong. If these people don't like their jobs, then I think they should quit. I am proud of who I am and I will not be ashamed because I'm white.", "author": "Rich A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "By far and away the best burrito I've had in the Mission.  That is all.", "author": "Tarah D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-28", "description": "Consistently a two-star place. \nI mean, its great for drunk food.\nwho needs Avocado AND Guaq on their nachos? \nTheir horchata and juice is really yummy if you need a sugar rush.\n\n\nbut honestly, Los Panchos is right across the street and its better.", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-10", "description": "FYI - The vegetarian burrito is not as the rice isn't vegetarian or vegan (cooked with chicken stock).", "author": "Kris R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "Most recently of Nate Silver fame, Taqueria Cancun definitely has a reputation, which may be more hype than anything else. It's definitely not bad, but I've had the famous al pastor a couple of times, and the most memorable part was how wet and messy it was. Try it late at night, when convenience and sloppy quantity is more important than the cheapest, best burrito, and you'll be more than satisfied.", "author": "Cailin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "I frequent the mission and love enjoying some good Mexican food after a few beers! This time I was completely sober and was able to actually enjoy my food. Out off all the Mexican food I've ever had this is by far the best yet! I ordered two al pastor super tacos and i can't even describe how amazing they were. I for sure will be back and would recommend this place to everyone 5 stars deserved hands down and the best part was even the service was amazing  the cashier guy was amazing as well", "author": "David J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-27", "description": "2nd stop on my burrito tour of SF!\n\nA++. Complimentary chips & I am SOLD!\nJk, I'm not so easy, BUT the burritos here are definitely winning. The staff is unbelievably friendly and nice and the crowd is an assortment of young trendy groups and straight up hungry people.\n\nSuper burrito, duh. They do a good job of toasting the tortilla so it's all quesadilla-like.", "author": "Lian T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "Hands down best veggie tacos on earth! Gotta get them with black beans... and extra green salsa! Cheap, quick, convenient.\n\nTip: Use your complimentary chips to scoop up half of the ginormous taco, then  you can eat the rest like a regular taco.", "author": "Ganesha B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-30", "description": "My Bodyguard Ed Lover Muay Thai Street Fighter and I were out Bar hopping in the Mission the Other Night and I Spotted Taqueria Can -Cun which peaked my interest but we were a little thirsty . So we popped into a Bar for a drink . Ed and I were engaged in great conversation with a couple of lovely ladies. I suddenly felt an urge for a Burrito , Ed Lover was deep in Conversation with the Ladies . So me being the Polite and Discreet guy that I am ,not wanting to disrupt his flow. . Popped outside to the front of the bar and left a Voice mail letting him know where i was at . I wandered in to Taqueria Cancun LOL. Its a hole in the wall but it was packed with Mission Street Hipsters and a few Thug life type folks. So I got in line and Ordered an Al Pastor Super Burrito and was given Chips Salsa and Guacamole as an appetizer . My Burrito was ready in 5 minutes and it was a BIG. \nI started in and it was the Yummiest Burrito Ive had in a while. I was half way through my Burrito and received a call from my Bodyguard Ed worried about me wandering around in such a rough neighborhood alone LOL. I let him know where I was and he entered TC like the Pinoy Tupac that he is and let his presence be known WEST SIDE!!! \nI will have to return again and try more items out.", "author": "Eugene L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "MUCH MUCH gratitude to Alex, Ernesto and the staff at Cancun in Bernal. I made a dumb, drunk maneuver, and left my shoulder bag there after a late night taco. The staff found the bag, which contained my brand new laptop and an external hard drive with years of valuable files and photos. I was crushed when I realized it was gone. I went back the next day to ask if they had found it, alas the day crew had no knowledge of it. Upon returning today, almost a week later, the night crew were there and surprised me with it. He had actually gone out of his way to look me up on Facebook and send me a message. Little did I know it was sitting in my \"other\" mail folder. I am super humbled and grateful that they held onto it and did their best to return my valuable stuff. Super awesome, guys...!!", "author": "joey e."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-02", "description": "Ordered a burrito here about a few weeks ago. It was disappointing. I took it home and regret every bite. I ordered a lengua burrito but it turned out to be more like a veg-burrito, with a few small pieces of meat. 85% of it was beans and rice. \n\nSkip it there are better places down the way. Oh, this is a review only for this location. I like and have no complaints of their other two locations (SOMA and the one near 17th and Mission).", "author": "M R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "good Mexican restaurant. had a super veggie burrito and it was good. has a fun, festive atmosphere. feels like a beach spot.", "author": "Denise C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "This is the pick of many local for the best burrito in the Mission and for god reason. The service is fast and friendly with a spacious and clean dining area. They wrap the burritos full here and you'll easily have enough for two meals.", "author": "Darren F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-15", "description": "These guys dont give a crap. They have gotten my order wrong many times. Go to gran taco loco on 29th and mission", "author": "Daniel Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Carnitas burrito and a horchata the size of my face. My deathbed request for a final meal. \n\nI moved to CT and I miss Cancun every day.", "author": "Shana H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-17", "description": "Looking for a no-frills, Classic Burrito experience in the Mission?  Well this is the place...selection of fillings include grilled and shredded versions of chicken and steak; tasty marinated carnitas; chips and a flavorful salsa verde round out the meal - and they offer Mexican coke to wash everything down with.", "author": "Rich R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-30", "description": "One of a few very good choices of taquerias within a 10 block stretch of Mission. This is the one out near Valencia( Burger King across the street)  at the foot of Bernal- They have a few simple items and do things  their way , which just happens to be quite a good way  they actually cook the sandwiches and burritos on a flat  griddle top, that's what give them a nice crispy exterior. Pastor ( pork) and carne asada burritos are real winners in the meat category and the veggie super ( $ 8.75) is hard to put down in one sitting. The place does a steady business at lunches and evenings. Good beer selection, aguas frescas, veggie juices & homemade tortilla chips, note : they are a little skimpy with the salsa, do not have kid portions and it's cash on the barrelhead only, son. For the really hungry try their Burrito Mojado (A Big One) meat, rice, beans, onions, cilantro, salsa, topped with enchilada sauce, green salsa, melted cheese, sour cream & mexican salsa -colorfully festive in decoration it's still a bit divey, Not a place you'd want to linger too long, but good for a tasty, cheap and filling meal.", "author": "Aaron Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-28", "description": "Holy Mother of Burritos! Taqueria Cancun, you are gooooooood!!!!\n\nSF's 7x7 list has been on a roll lately. From the bacon wrapped oysters @Anchor & Hope (delish) to the Porcetta Sandwich @Roli Roti (a big WOW for taste), & now a super burrito @Taqueria Cancun. Thank you, 7x7, for introducing me to this spot. \n\nWhat's even more amazing is that it ONLY cost $5.99. Awesome deal!!!\n\nAlthough a cheap-o burrito, you'd think taste would be comprised. Nope, not the case here. We ordered a super steak burrito, no rice, and black beans. The tortilla was slightly grilled & had a nice, little crunch to it even. The burrito had savory chunks of plentiful carne asada w/ just the right amount of cheese. I loved the fresh slices of avocado, too. Half a burrrito later....I was satisfied. And now, I have lunch for tomorrow.\n\nOverall: Thankful to have found this cool taqueria. Service was good (friendly cashier) & it's a clean, no frills, casual spot to grab a quick bite to eat! Big thumbs up to their super burritos!\n\nTips:\n*Bring quarters for the parking meters.\n*Bring cash. Credit cards are not accepted.\n*Chips & (spicy) salsa are complimentary. Woohoo!", "author": "Joy A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-24", "description": "They charge for meat on super nachos now here. It's 3 dollars more. So super nachos is 7 bucks with no meat. This place sucks now and the nachos aren't as good as they used to be. Never coming back. Epic fail cancun. Super lame nachos. 10 for nachos.", "author": "Bert D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Every week I end up saying \"2 veggie burritos, both with black beans and one with no sour cream.\" And I never regret it.", "author": "Ge O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "My favorite burrito place in SF. Flaky tortillas, fresh grilled meats, great avocado, nice service. And never crowded, at least at lunch, mellow and convenient.\n\nTwo years later, still my favorite place.", "author": "Nelson M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-19", "description": "While it's not my favorite taqueria in the city, Taqueria Cancun doesn't fall short in making good burritos. That's just it though...they're good, not great. \n\nI've had a couple other dishes, like tacos and super quesadillas but my go-to order is always a burrito. A vegetarian burrito runs about $6 here and gets you a HUGE burrito filled with rice, pinto beans, cheese, tomato, onion, cilantro and avocado. I can never finish the whole thing in one sitting, so their burritos are perfect for leftovers since they're so big! \n\nAlso, their chips aren't my favorite and I feel like they're kinda stale. They give you two different kinds of salsa - pico de gallo and salsa verde. Salsa verde is pretty spicy but definitely my favorite out of the two.\n\nWith so many other taquerias in the Mission, Taqueria Cancun isn't my go-to place for a burrito but it's still a good choice if you're in Bernal Heights.\n\n*Cash ONLY!*", "author": "Stephanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "This is a bit awkward to reveal, but the thing is, I'm a burrito skeptic. (I know, I know, like being an agnostic in the Bible Belt.) It's just...why do I need soooo much relatively flavorless rice and tortilla and cheese and sour cream? Why not skip the fillers, stick to the good parts, and just order tacos?\n\nThen I moved a few blocks away from Taqueria Cancun, and finally understood the purpose of the burrito. What made the difference? Largely the big chunks of fresh avocado where most places use guacamole, but the fresh-griddled tortilla and restrained hand with the sour cream and cheese don't hurt either. \n\nI personally think the beef and the chorizo are the best meat choices, but the al pastor was the only option I've tried that genuinely disappointed.", "author": "Amy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-20", "description": "I have never been of the belief that this is the best Taqueria in San Francisco ever , I guess I should disclose that . With that stated , I should say though it's always been good to fair , and that by far this is the best of the locations . I was very hungry last night after bar'ing across the street and had a yen for a Quesadilla . I went with the super which gives you all the fixings including avocado , and well... it just wasn't that good. Like not even being slightly buzzed could I be convincing myself this was a tasty treat . It was greasy and the carne asada was tasteless . I think it gave me a tummy ache to be honest. Still good chips and salsa though for sure, very nice and quick staff, and haven't inflated the prices so that's definitely positive.", "author": "Lauren V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "Omg these burritos are insane. We just went and there was no line, food came out fast but was cooked perfectly. We got carne asada and pastor burritos (not both meats, one each).  Very tasty and not too super big, so you don't feel like you ate a small child. Chips leave a little more to be desired and they barely give you a handful, but burritos are so good, you don't need it.definitely recommend this place", "author": "Traci H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-24", "description": "Not bad, not remarkably good. I live a few doors down so that's my main reason for frequenting. They have carrot and orange juice. The service is very stiff. The food is not notable.", "author": "Addie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-24", "description": "MAN would you guys please stop using those nasty Costco chips.They are too salty and gross. I feel like I'm at a bad house party ever time I eat those chips. Most taquerias in the city fry their own, or buy them fried from other local businesses. I got really excited when you had new authentic chips the other day. Finally, I thought, they got the memo. But no. Sadly, today the same old tired, dry, mealy chips were back. What a bummer. I definitely wouldn't have ordered nachos on these cardboard shingles.", "author": "Phillip F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-18", "description": "Al Pastor was its name. And eating was the game. \n\nOrdered my al pastor in super burrito style. I was hungry, yo. Burrito was great. Tortilla was nicely grilled adding that slight crunch to the bite! Meat was juicy, warm, tender, flavorful. Towards finishing it up, I noticed no sign of runny grease at the bottom of my foil. Didn't make the burrito dry though. Just felt that something was missing.\n\n3.5 stars. As much as I try to find a burrito that comes close to what I've had in SoCal, or Mexican food much less, this place falls a little short. Don't get me wrong though. Awesome food. I'm just real picky about this kind. But try it out and see for yourself.", "author": "Will S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "This is the one place I opt for a veggie burrito over a taco. Why? Science. The lightly toasted tortilla on the burrito equals amazing. \n\nI don't love the chips or the salsa, but I can look past this because the burrito really is that good.", "author": "Amber K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-06", "description": "After going here so many times and putting up with it I have decided to just say this:\n\nGristle. Abundance of those pieces that no one wants to chew in their carne asada burrito no matter how drunk you are. Every single time, in every burrito.\n\nThe \"out of the bag chip thing\" I can overlook if the food was better. But in this case I can't even do that.", "author": "j m."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "You know that moment when you're watching Man vs. Wild and the advisory pops up telling you about how all those amazing stunts Bear Grylls does are merely staged demonstrations and not actual survival tactics based on life-threatening situations? \n\nI close my eyes too during this advisory because I'd rather watch the show pretending everything's happening because the lion is actually chasing him or it's so cold that he physically needs to gut a camel, drag its entrails and sleep in within its boney carcass.  \n\nThe point I'm trying to arrive at is I don't care where the meat comes from in Taqueria Cancun's burritos. I'd rather close my eyes and skip the metaphorical advisory and devour their bomb burrito in Bear Grylls bliss.", "author": "Monica S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-10", "description": "This place is pretty standard in terms of Mexican eateries. Whether you order in or take out, your meal comes with complimentary chips and red/green salsa, which are freshly made. When I was here, I ordered my favorite: carne asada torta. The torta did its job in filling me up, but it wasn't anything spectacular in my opinion. The bread wasn't toasted enough, so it was still soft instead of the usual crunch. It was also lacking in terms of guacamole spread and salsa in my torta. The meat itself wasn't as juicy and tender as I had hoped, but was sufficient. I will come back if this was the only joint open at the time, but otherwise, I will venture out to other eateries in the area first to try different tortas. Tip: they only accept cash, so leave your cards at home!", "author": "Hurnan V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "Cancun vs. Cancun.\n\nOne features tackiness and drunk college students. Yes I went. And yes I'm judging years later.\n\nOther features delicious and massive burritos for a college drink special price ($5) as well as service faster than it takes a frat boy to drink his beer.\n\nChicken burrito debauchery will be remembered far longer than my spring break debauchery. Not spending time in this Cancun drunk certainly helps.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "My favorite taqueria in SF hands down. Very kind service and amazingly good food. The tortilla they use is phenomenal.", "author": "Zach M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "I have been to all 3 San Francisco Taqueria Cancun locations and this one if by far my favorite. Though I have received good service in all locations, I feel this one is the best as far as food,space, atmosphere and clientele. The staff here are very friendly and always seem like they are having a good time. \n\nMellow in the afternoon and early evenings, wild and crazy in the late evenings when the party moves to everyone's favorite taqueria just down the street from El Rio!\n\nNow to talk about the food. Their vegi burritos are to die for, but my all time favorite has to be their Super Carnitas Taco's with \"everything\". Not even sure what that all includes but it is simply magic in your mouth. Highly recommend to one and all meat eaters out there. \n\nAlso the horchata is good as well. If you are not familiar with this delicious beverage see the link I have included http://en.wikipedia.org/wiki/Horchata#Latin_America\n\nIt's a drink made fresh every day and very authentic. Perfect with any Taqueria Cancun meal!", "author": "Goth Kitty Jen J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-25", "description": "I used to frequent this place when I lived in SoMa (Sleazy 6th, to be exact). The service there was actually great, despite their having to put up with all manner of craziness on the block.\n\nThe food is not bad here in the Mission/Bernal location, but the guy who is often at the cash register seems to hate taking orders and having to do basic arithmetic. I'd rather go somewhere else in the neighborhood, where I know I can end up with 1) the kind of burrito I ordered and 2) not a pocket full of odd change.", "author": "Joel S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "Feels like a taco place...plastic plates and giant cups of horchata.  The food is very good.  The complimentary chips are not homemade but the salsa is excellent.  The super taco wasn't my favorite, but the carne asada is delicious.  My favorite was the enchilada.  The serving size was good and it comes with rice and beans.  I loved the enchilada sauce.  My kids loved the plain quesadillas.", "author": "Ryan K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-13", "description": "Simply the best burrito in San Francisco...hands down.", "author": "Rael E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "Let me just say that i have gone here in the past and they were pretty good BEFORE my 2 recent visits. One of my recent visits i ordered my daughter a regular burrito with cilantro and onions and no hot sause, what do they give me a big tortilla with just meat, cilantro and onions!!!! WHAT???? My daughter was very disappointed. I let it go maybe it was a mistake, YEAH RIGHT! On another occasion my boyfriend  tries to order me a qusadilla suiza and they tell him they don't make those their!!!!! ITS ON THE MENU! when he gets to my job with what ever he could order, and he is eating his regular beef burrito he finds out that their is only rice and salsa in it THATS IT!!!!  Words could not express how upset he was.", "author": "Ana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "After 20+ years in SF, this remains my fave taqueria, especially for the veggie burritos!", "author": "Georgette R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Cancun has the best burritos I have ever had. Ever. \n\nI usually get the chorizo super burrito and every time, I die of happiness and go to burrito heaven. It is so good!! And also very cheap as far as good food goes in sf. \n\nAs a California native with an obsession for burritos, I've tried quite a few. This is place is the best. Make your way to Cancun in the mission. You won't be disappointed.", "author": "Jill E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-10", "description": "Meh, I've had better. The super burritos are kind of small. The super nachos not that super, the chip and others ratio isn't that even and the spice is overpowering (and I can handle my spices). The super nachos are meh as well. I ordered a lot, but had some of each.", "author": "Stacy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "Veggie burrito was delicious, but I am suspect about the rice as well, my body wasn't happy and I'm pretty sure there was chicken stock in it. If that's a problem for you, stay away.\n\nService, blinding fast. Horchata available. Very genuine little taqueria.", "author": "Jeff M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "Great drunk food, I know this because I've stumbled in here all lit up and gotten my grub on before.\n\nStandard taqueria fare and tasty salsas.\n\nThe reason for the four stars though is because this place knows how to bring the heat.  I've ordered lots of super burritos from many different taquerias and taco trucks and I always request them extra spicy.  Seldom do I consider the burritos I get actually spicy, but the \"extra spicy\" carne asada super burrito I ordered here actually was deliciously hot.", "author": "Brad R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-02", "description": "Burrito, yay! Getting back to the bar and realizing it had a tiny bit of meat,  tons of rice and nothing else. It was not super by any stretch. It was awful.\n\nWTF has happened to this place?", "author": "Mike F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-14", "description": "Very good authentic Mexican! Every order comes with chips and yummy guac and salsa. The burrito was different than most and very good. Bathroom wasn't the cleanest, that would be my only complaint.", "author": "Dara R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "I would've given the 5th star had they remembered to hold the guac 4 times alread!!!\nI am starting to think its a joke they play on me...other than that this is the next best thing to Gordo's (east bay).\nWhat ever they use in their Chili Verde is mixed with crack because I cant get enough...I woke up many times at 12:45am praying they are still open or some of those hipster kids are forming a stay open line just to score some green sauce. Best value in my opinion are the super tacos.\nI also love that they bring your \"aqui\" order to your table in less than no time.", "author": "Wild Style G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-11", "description": "Everyone hears about how unbeatable San Fran burritos are... So upon my first time being in SF, the first stop was here. The family that we're renting a home from a few streets up had suggested it and man were they spot on. Burritos tasted fresh, authentic, and were packed to the brim! My one bummer moment was seeing that they don't include cheese, lettuce or guac inside. So I wouldn't really call that a \"Super Burrito.\" But all in all, that thing was gone in nothing flat! I'd say worth your time if you find yourself hungry on mission st.", "author": "Taylor S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Legit Mexican food! Had the carne asada burrito.... Delicious!!!! Happy we stopped in!", "author": "Karin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-16", "description": "The first time I came here was years ago and I had ordered a pork taco salad served in a fried tortilla shell. Oh my goodness it was delicious, I'm talking tunnel-vision delicious. \n\nNow years later I live in the area and you know what? It really is the best veggie burrito I've had in the city, and for just $5 that's a great deal. It's an inexpensive spot to stop by before you head to El Rio or the Knockout for some drinks with friends.", "author": "Rachel W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "4 people\n4 burritos\nevery single burrito was wrong\ni ordered beef ... got chicken\ncousin ordered no cheese.... got cheese\nother cousin ordered no onions.... got onions\nother cousin ordered refried beans... got pinto beans\nnot one burrito was correct\nand it wasnt even busy\nand it was FREEZING in there.", "author": "beth m."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "Has still got it.\n\nTip: this is the one with the lovely, almost sweet, salsa verde. \n\nNo charges for chips. Loads of salsa. Fast. Dirty. Cheap. Good. \n\n(not quite so dirty as, say, 19th/mission or 6th/market. Family-friendly Cancun). Fabulous veggie burritos.", "author": "Glen M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "This is amazing mexican food. It is great for vegetarians and meat eaters. I had the eggs a la Mexicana and my fiancé had the eggs con chorizo. Both delicious. Their horchata is also tasty. The only issue is they are cash only.", "author": "Arielle M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-03", "description": "These burritos are awesome!  I get the burrito mojado with carnitas every time.  It's realllly good!  I am a sauce fiend and they give you TONS of it.  I recommend getting it to go, because you get more sauce that way.\n\nThe burrito is HUGE, and it's cheap.  What more can you ask for?", "author": "Shae H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "A great place for a last call burrito! Not sure I'd go here during the day time, but post-Makeout Room it does the deed. \n\nWatched a guy pick a burrito off the floor piece by piece...\n\nFive minutes later I noticed his burrito had disappeared...\n\n*shudder*\n\nYes. Great for 2 AM.", "author": "Leigh W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-27", "description": "You want the real thing go to LA TAQUERIA on Mission.  \n\nThe last three times I went to Taqueria Cancun in the last two years:\n\nThey put a tiny pinch of meat in by burrito.  I'm talking like, 1/4 cup of meat-No exaggeration.  \n\nThis last time I went, business was quiet.  They forgot about my order and I waited fifteen minutes before going up and saying \"hey I ordered something\".  Their response \"huh, oh...sorry\".\n\nI'm done with this place.  I've lived in this hood for 12 years and I know a good burrito-This ain't it.", "author": "Dante S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "This Cancun location gets five stars for me- it's a little bigger, a little brighter and a lot cleaner than it's other locations.  It's also closer to my casa, which is nice for me (but what do you care?).\n\nAnyway, the super prawn burrito is to die for.  They really load that baby up with prawns- it's chock full of the perfectly grilled, crunchy, plump crustaceans.  I love to cut the burrito in half so my first bite is gooey, creamy, hot, amazing.\n\nTheir carnitas super tacos are also amazing and a great deal.  A little over 2 bucks for a taco loaded with meat, crema and at least a quarter of an avocado.  The carnitas is so juicy and delicious.  With the complimentary fresh chips and a melon agua fresca, you're good to go.\n\nI also LOVE the guacamole-esque salsa verde that comes with the chips, and their horchata is some of the best I've had (there's a little extra cardamom in there, or something).  \n\nMmmmm.  Salivating just thinking about it.", "author": "Amanda R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "I've been here a few times because it's convenient to a friend's house. I've had their Super burritos, Chicken and today I had Shrimp. The Shrimp Super burrito is ok, lots of shrimp but it tasted a little fishy. The chips are good, salsa and hot sauces are just eh. I still heart another taqueria.", "author": "Karen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-31", "description": "Amazing vegetarian burritos...their rice is perfect and they are more than generous with their avocado portions (hard to come by). They also have really great chips, not too flimsy and lots of flavor. Definitely one of my favorite burrito spots.", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-23", "description": "Ever tried to Order Over the Phone from these IDIOTS.?!!!!!!!!!\nFORGET ABOUT IT.... As they either Mess Up or Even give your orders to someone else. \n\nHORRIBLE.", "author": "Alf M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-18", "description": "Super quesadilla was amazing, but more food than I would have guessed or could finish. Oh, and the salsas they give you with your meal were pretty spicy to me. Overall, good atmosphere for a Friday afternoon and I liked the picnic style tables!", "author": "A P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "It's the perfect late night drunk meal.  Lots of food, great prices.  I would say their tacos are better than their burritos.", "author": "Owen J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-29", "description": "3/5 you got here drunk...again\n\nget a burrito. everything is pretty filling. cash only though =/\n\nafter a few bites, you'll have settled enough of your stomach to keep drinking! yay!\n\ngo next door for drunk bingo at the knockout.", "author": "Alvin D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "I go here often. They'd get 5 stars if the meat was a better cut, but otherwise very very good. I usually get the carne asada super burrito to go, but if eating there the super quesadilla is fantastic. It's grilled and chock full and gooey and absolutely delicious.", "author": "Chris P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-08", "description": "Is this a taqueria or salvadorian restuarant? All the food taste like salvadorian food", "author": "Orlando B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "Best Burrito and Nachos in town.  Actually, in state. Actually, in the Country. Never been disappointed, they have amazing Carne Asada, and the best Salsa Verde imaginable.  I wont say the staff is the kindest and most welcoming, but it is after all a Taqueria that sells you a 2 lb burrito for $5.  Great Tacos, Quesadillas and other items, but they specialize in their Burritos.  Just look at the wall to the right of the register, you'll see countless \"San Francisco's best Burrito\" certificates. Also, unless you have a gargantuan appetite, you can usually save enough of your food for a second meal.  Great Horchata too.", "author": "Benjamin F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "This is a great place for burritos!  The price is right and the burritos here are big. The only complaint I have is they only take cash. I rarely carry cash nowadays and I'll go more ofter if they start taking credit csrds.", "author": "May M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "This place has a pretty good burrito. I had the Vegetarian Burrito and it was a big burrito, very good. The chips and salsa are not good. The chips are overly salty wholesale chips and the salsa comes in little cups that' makes it obvious it's not made in house. Overall it's a good deal for this neighborhood with a burrito costing you $5.50.", "author": "Ryan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "This place is bangin' because it has delicious torta's for $5 that come with everything delicious(beans, sour cream, avacado, meat, tomato). Also, every order comes with chips and salsa!! This place is a really good deal, and unlike other taquerias in the area, it has a pretty descent sized dining area that is also nice looking.\n\nyou can tell this place is popular because it is crowded even at random, non-usual dining times.\n\nGo here for a torta al pastor, you will not regret it. While you are at it, get an horchata.", "author": "Caitlin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-09", "description": "They are cheap. They are right by my apartment. They have amazing chorizo.  They are open late.  They are fast.  They are friendly.  They are delicious.  They have all the parts of the cow that I could never bring myself to eat but it's nice to know that they're there anyway.  They have great salsa.\n\nOne time they got my order wrong but what I ended up with was better than what I'd ordered anyway, so I didn't complain.", "author": "J S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-06", "description": "I don't know which one I went to.\nAnd it wasn't because I was drunk.\nI honestly don't remember which one I went to. And yes, I am too lazy to google map it. And I didn't know until know that there were more than one.\nUsually, we go at night. AKA I can't see the surroundings very well. Usually its good. Sometimes the salsa is too spicy for my taste, but its usually passable and quite flavorful.\nI decided I wanted to go out on a limb and get the taco salad. Apparently, MAYBE, from a different Cancun than I usually frequent. \nBlek.\nWhichever one it was I went to, don't go to it. Not much flavor, or color, and it just looked sad. \nBF had the burrito and he didn't finish it. That's even sadder...", "author": "jeddie k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "I'm hooked on their Vegetarian Burritos.\n\n$5.46 with tax & they're huge!\n\nGreat for a cheap dinner with pals & definitely more than enough burrito for two. And chips & salsa come with every order.\n\nYum...", "author": "Sara L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-26", "description": "This location of Taqueria Cancun is my local taco stop and one of the selling points of my neighborhood. Many a late night have ended with a basket of chips and salsa and some tacos, thus bolstering my chances of avoiding a wretched hangover the following morning. \n\nMore often than not, I stop by here to purchase a soda cup of the salsa verde. Yeah, the slightly creamy kind with the fresh avocado blended in. It's off the hook and really takes home-made huevos rancheros or what have you to the next level. I can and have made a meal out of that salsa before.", "author": "Candice L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-03", "description": "I honestly don't know why people think these places are so great. I don't know how many Taqueria Cancuns there are but there are two that I know of and they are both absolutely average. If I could give it 2 1/2 stars I would, I'm rounding up instead of down because I don't want to be a dick about it. \n\nIn an area full of Mexican places I really think you can do better.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-07", "description": "Before a visit to Naps tres for some bad karaoke, I was hankerin' for some mexican food. I was told by a local, to hit up taqueria cancun only a few steps up the street.\n\nbleh, blah, bluh, just about sums up the experience.\n\nI ordered a burrito with pollo asado and a taco de lengua. My first bite of  lengua tasted old and tough. Yuck. I initially wanted to try the Sesos, and now I'm glad they didn't have any. I can't even imagine what old brain tastes like. After pushing the taco to the side, I started on the Burrito. I couldn't find any meat in my burrito, until I was about half way down. Where's the meat?!?  Where's the flavor? Where's the Salsa?\n\nI concur with Tom R. and agree that there are a lot of other places in the Mission that are way better.", "author": "Robin K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "Out of the 3 TC locations, this one's the most welcoming. \n\nI've had all of their vegetarian options- all equally delicious. Seriously, you can't go wrong. \n\nDefinitely my favorite place outside of Mexico to get a taco!", "author": "varuka c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "Been there a bunch of times.  One time I pulled up front in my new car and I parked.  Then a group of young Mexican guys all leaned on my car or looked like they were about to, because they were drunk or just losers.  This car is black and brand new and the last thing in the world I need is some losers leaning on my car.  So I hopped back into my car and took off because it's not worth it to me.  Sure, I get a cheap taco, but the cost of the damage to the car is much more.  Paint costs a lot.\n\nAnyways, the food is always good and cheap.  Not too long ago (a few months) there was a viscous stabbing there.  A woman stabbed a man because she didn't like what he said.  Not exactly a safe area you know?  \n\nSo tonight I went to the Lexington and afterwards i told my friend let's go to El Farolito.  She wanted to eat before driving, which is a good idea.  So we went to Cancun.  I have ate there a lot in my life...because I am poor and I love Mexican food.  The veggie torta I had tonight was delicious, but not nearly as good as El Farolito.  \n\nCancun always has friendly and efficient employees.  Must be a hard place to work at.  those employees deserve purple stars.  The place needs a security guard like they have at El Farolito and so many other late night restauarnats.\n\nIn a nutshell.......great prices, fast service, yummy food, dangerous area.  I am sort of torn between 4 stars and 3 stars because of the violence.  I guess it's not the fault of the establishment so I will go with 4 stars.", "author": "Cynthia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "My girlfriend loves this place, she'll travel across town just for one of their veggie burritos and its definitely what she misses most about the mission. \n\nI however didn't get the hype. Their tacos - meh. The pastor burritos - meh. The chips - barely edible. \n\nAnd then I tried one of their super veggie burritos with black beans and now I'm almost as obsessed as my girlfriend. They've got these huge chunks of perfectly ripe avocado that just melt in your mouth. Definitely one of the better burritos I've had in my life.\n\nGo cancun!\n\n Oh and open one up in NOPA so I won't have to trek across town.", "author": "Murphy O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "Like the other versions of this place, the food is affordable, tasty, and this one is open past 12am. On top of things, the food is prepared quickly, the people taking your order are friendly, and the area isn't too bad. There's not much you can ask for from a restaurant that serves Mexican food when you just ended a night on the town, or perhaps a long day at work, or doing something that gives you the munchies after 10pm at night.\n\nThis version of Taqueria Cancun is located near the end of Bernal Heights, Mission, and Glen Park. It's close to a Safeway and El Zocalo.\n\nOverall, there's nothing bad about this place other than it's not the greatest gourmet Mexican food on earth, but it isn't the worst. Come here if you want a cheap & filling meal, but don't expect that much.", "author": "Rob L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "Fast, tasty, inexpensive Mexican food!", "author": "Richard A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "Here is the truth: Cancun is inconsistent. However, 4 out of 7 times you will enjoy a terrific Mexican meal. 2 out of 7 you'll have a good meal and 1 out of 7 you'll forget you had a meal. Those are excellent odds.\n\nMy strategy is to call ahead - \"pickup five minutes\" - walk the dog over (approx five minutes), retrieve my freshly made tacos/burrito/breakfast burrito, and stroll home to feast in front of Seinfeld reruns. About as wonderful an evening as they come.\n\nSECRET TIP: Get the Mexican coffee. It is mindblowing and nobody knows about it. I'm drinking some now, which is why I'm writing this review.", "author": "matt s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "I do not like Mission-style burritos. I thought I never would, but Taqueria Can-Cún has changed that opinion indefinitely! I got the veggie burrito with added jalapeños. Was spicy and delectable. I can only eat half so it's great because my husband and I both get a meal for around $6. Plus, you can trot on over to El Rio with your nice, warm burrito and chill out!", "author": "Jennifer P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-13", "description": "HANDS DOWN. BEST TAQUERIA IN TOWN.\n\nI WILL MISS YOU DEARLY TAQUERIA CANCUN SINCE I MOVED TO EAST BAY.\n\nLet me just say, their super beef quesadilla or any other type of quesadilla is absolutely delicious. From the quality of the tortilla itself, to the yummy carne asada, to the pieces of whole avocado versus putting gross and watery guacamole, to the way they wrap it with aluminum foil to keep it warm and soft. Absolutely delicious and quesadilla second to none.\n\nSuper nachos are also great! \n\nTheir hours are also extremely accommodating!! ONLY TAQUERIA IN THE CITY OPEN TILL 2:45 AM DAILY! \n\nLOVE IT, ADORE IT, OBSESSED!\n\nCONS: they do not accept credit cards. This is absolutely RIDICOULOUS because it is only a way to drive clientele who does not want to pay a $3 ATM fee and other $3 NON-BANK ATM fee away... It's really a shame cuz I was often forced to hit el Toro as I only had a crdit card on me and was lt willing to use their ATM :(", "author": "NC B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-01", "description": "This place is Solid, in terms that you get a Big Burrito, your quesadilla or your nachos, and it's what expected \"a Huge Americano Hog Fest\", which by no means is meant to sound as a derogatory statement in part of Taqueria Cancun. However, yes here is the However/ Comma part of the review, their food just doesn't have that magic SAZON (spice) that you crave when sinking your teeth into a giant mass of mexico wrapped into a flour tortilla. I'm still trying to figure it out, let me get back to you with an updated review as I keep comparing it to others around the neighborhood. I hope to uncover the missing ingredient for you.......hmmmm maybe it's the Lard/salt proportion that goes into the mix, who knows , like I said I'll get back to you on this hehehe.", "author": "Lannette G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-14", "description": "Y'know after seeing all of those \"Best Of\" awards for Taqueria Cancun, I figured well jeeze I better check this place out, considering how much I love Mexican Food. \n\nWell after a visit to Cole Hardware I thought I'd peep the sitch. I wandered over to Taqueria Cancun and tried a burrito with asada. I was not impressed. The burrito was rather dry, they put waaay too much rice, and the salsas were not anything special.\n\nI give this place 3 stars, because I'm nice. But hey, I hear the tacos are pretty good? So maybe I'll have to go back and return with an update.", "author": "Jena R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-30", "description": "3.49 so I couldn't round up to 4 (sorry)\n\nLive here almost a year and my first mission burrito.  To be fair I don't like Mexican food (I know -- stop reading now and skip to the next review) but I was *really* hungry and wanted something fast and cheap, what are my choices in the mission?\n\nBack to the Burrito, Super (chicken)  no beans or rice - it was good.  Great flavor, salsa, sour cream, avocado and the perfect amount of kick (heat).  Great value, place was fine, good service no complaints.", "author": "Jas S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "Great big burritos, a little to spicy for me but that's just how the Mexican salsa is I guess.  Will be heading back again soon.  If you're in town for a short amount of time this is one of the place you have to eat at!", "author": "Eric G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "A good neighborhood taqueria.  The burritos are better than average, but I go for the gluten-free tacos, which tend to have the filling break through soggy soft taco shells.  If you are looking for a good, quick meal, this is the place.  The hours are accommodating, too.", "author": "Sean R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-03", "description": "Get the Burrito Mojado.  It's awesome.  Don't forget to bring cash, they don't take cards!", "author": "Travis S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-06", "description": "Came here and I asked for pozole, in which I was looked upon like I asked for something that is never served. So I continued to order a Super Chicken Burrito. I wanted a Strawberry fresca, but they only had Horchata & Cantelope,which I don't really like. I waited like 5mins for food which is great. The place seemed clean (minus the cockroach on the floor) lil buddy probably wanted some food (HAHA). Overall it was a mediocre experience I'm starting to think all these damn taquerias aren't as good as I thought. Seems like bigger prices for not so great food and are catering to things like Veggie, which is great but hey don't forget about the authentic food.\n\nQuick Tip: Cash Only", "author": "Sarina I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-28", "description": "The food is edible and good if you live close by or just getting out of el rio, knockout, etc.\n\nI was unimpressed with their quesadilla.  It was on the small size and didn't nearly have the taste of el faro, but it did the trick in a lazy pinch.  Sarina, that same roach was in line too, but sadly, that was the last time he is going to order because someone put the smack down to lil roachee.\n\nMy friends liked the burritos which I didn't have an opportunity to try, but maybe next time.", "author": "Po L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-03", "description": "Came here this past Sunday night. Ordered the super prawns burrito as I usually do. What I didn't know was that it also came with a bad case of the stomach flu. Never coming here again.  Beware when ordering seafood here. Save yourself the agony.", "author": "Cynthia Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-15", "description": "This is hands down the best burrito in the city!\n\nI am picky as hell when it comes to my Mexican food~ and this place is exactly what I want.  I *love* that they put actual avocado into my burrito- I don't really want guacamole~ I want avocado and it is like someone finally read my mind.\n\nAnd the secondary factors... the chips are yummy, the people are nice, and the place is bright and cheerful!  I love how close it is to my fave dive bar and would never go to one without the other~", "author": "Amy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-08", "description": "The chorizo tacos at Taqueria Cancun are hands down the best tacos I had in SF and possibly anywhere else.  I actually lost track of the number of times I went here during my brief one week stay.  \n\nWords cannot describe the delight that awaits you when you order a chorizo taco.  I won't even try. Just go here.", "author": "Christopher R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-08", "description": "So in Sweden, tacos and burritos is not the most common food.\nThe tacos that we do have taste like plastic bag and tomato with some tasteless green \"suppose to be guacamole\" sauce, all I can say is that it taste like authentic Swedish shit.\n\nSo of course I had to order a vegetarian burrito at Cancun.\nI have to be honest with you, I was expecting more.\nMy disappointment might have to do with the fact that I had no cheese, sour cream or salsa in my burrito, so I had some brown rice with very little avocado however I did take a bite from my friends burrito and that one was so much better.\n\nI will have another try, maybe at the other spot.\nAll and all it was a OK place, the bread could have been a bit more toasted and I was disappointed that they missed my salsa.", "author": "cecilia k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Seriously the best taquria in the city.  It gets four stars instead of 5 because I ordered a super taco and got a super burrito instead (which is what I was charged for).  I wasn't that hungry but still ate half the burrito.  And was sad the rest of the entire night for wasting the other half because it was so good.  Fresh ingredients and solid food.  Can't go wrong.", "author": "Jessica C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-24", "description": "The best burritos, deliciously overstuffed, for a great price. There's a reason the wall is covered in awards.", "author": "Surat L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-12", "description": "just stumbled in on a late Wednesday night, happy anything was open, scanned the menu with my friend Alexx, turned to him and decisively said, \"how bout we get the super nachos to split.\"  With meat?  yeah, with chorizo!  I know this seems like a bad idea at first, a misstep on an otherwise pleasant, lightly intoxicated Wednesday, but it just seemed like the right idea at the time.  One of those instances where at least 85% percent of the time its the wrong idea, but this time, well just this time it worked out; like instead of, \"oh that night was just going swimmingly until we ordered fricking chorizo on the super nachos.\"\n\nWhat's great about super nachos is that it takes like all the supporting characters from Mexican food  and makes a fairly solid stand alone meal out of it.  Like typically if you tried this in any other genre of food, it would fail miserably; like oh, I'll take hamburger meat, pickles, onions and tomato and put on a tray, bake it, slap some ketchup....you get the idea, like a clown in the kitchen basically.  And yeah, nachos are kind of like low-brow bachelor food, but that's only if you make it at home in your microwave, where as when you order it from a taqueria/restaurant it takes on a much classier appeal.  The kind of classy that only a taqueria on mission street that's open until 3am can provide.\n\nA few caveats about ordering the super nachos with chorizo after midnight on a weekday (a weekend you have plenty of time to recover).  One:  Ask for the sour cream on the side.  Don't get overconfident.  You know that sour cream can do damage at that hour, but what is worst, is that when they smother the nachos in it, it not only turns a layered platter of beauty into a soggy, sloppy mess, it always (at least for me) makes me kind of feel depressed after eating them.  I can't really explain why (in this forum), but it has something to do with regret, gluttony, and disillusionment.\n\nThe second caveat is:  don't be foolish and try eating this by yourself (again with the overconfidence), or don't try splitting it with someone who pecks at food like a bird or who's too interested in talking about themselves and loses sight of what is most immediate and important, which is tearing through some kick-ass super nachos.......I mean c'mon people, you gotta live!  You could split this three ways and it would still carry its weight.   Godammit, I just made myself hungry.", "author": "James W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-27", "description": "My roomies and I strolled down to Mission to play taqueria roulette and pick something we hadn't tried before. On the fence between a Salvadoran pupuseria  or tradtional Mexican fare, we walked past Can-Cun. I'd seen it walking thru the neighborhood, and admit I was adverse to the glaring yellow and bright lights. But after checking the menu and prices decided to give it a go. \n\nI tried the prawn burrito, my roomie had the veggie, and other dude had the carnitas burrito. The server brought them out after a short wait, and handed each to the wrong person. I bit into the carnitas and was like \"wow\" this is great. Veggie bit into my prawn, and my man bit into the veggie and exclaimed how good it was (and he is NOT a vegetarian). I knew mine was not prawn, but I was almost not going to hand it over it was so good. The seasoning was yum, if not a tad too salty, but calmed down by the sour cream (and the Mexican Coca-Cola). When we finally sorted it out, I enjoyed my prawn burrito, though I wished the seasoning on the shrimp was just a notch more like the carnitas. I tasted my pal's veggie burrito and it was quite hearty and tasty.  All of our burritos had been toasted on the grill before and serving, so they had a nice hot toasty taste.\n\nWhile I am sure there are equal or better places in the area, this was good inexpensive and fresh tasting. \n\nChips are salty and clearly not home made. I think my favorite chips in the city are from Maya downtown on 2nd near Harrison.", "author": "Jon L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "I get the veggie burritto w/enchilada sauce inside. Messy and mouth-watering, aye mami!\n\nAnd it's right by the Knockout, hollah!", "author": "Faith S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "the tacos are massive and the burriotos are great! The meat has flavor which is what makes or breaks a good Mexican joint ;)", "author": "Glenda R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "Best burrito in the city.  There's a reason they keep winning the Best in the Bay award.  \n\nI'm not one to exaggerate but I'd step over my own mother for their El Pastor Super Nachos.  The super burritos are excellent, using big thick slices of real avocado.  One last note, the green sauce they serve with the free chips will change your life.  Colors will be brighter, birds will sing to you and rainbows will appear at random.  Damn I love acid.  \n\nBring cash because they don't do the card thing (Welcome to the Mission) and enjoy the comical, late-night hipster contingent  while waiting for your food.  You're always bound to hear a conversation laced with grand opinions and self-referential pomposity.", "author": "Yoni M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-14", "description": "Just like Cancun down at Mission and 19th except minus the drunk hipster overflow from neighboring inner mission bars. Which is good. Because I like to get my burrito on in as zen a fashion as possible. \n\nDownside? If taqueria fare makes you gassy, you'll need to leg it out of there straight away. It's so quiet in here, everyone will know it was you.", "author": "Autumn K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-12", "description": "BEST SUPER BURRITO de Al Pastor by far. For the longest La Tapatia in South City was my go to place for a burrito. I was always let down by other places but one late night feening for a burrito I was brought into Taqueria Cancun and of course I went with the AL Pastor because honestly it's the best kind of meat that is just meant to be in a Super Burrito. The pork is marinated so well and with hints of pineapple take this burrito over the top. Be sure to ask for extra green salsa, pour that over each bite of the burrito, foodgasm each time. Most places charge $10+ for a super burrito, here at Cancun the prices are fair and cheaper than most places. Don't forget to grab an Agua Fresca, usually they have 2 flavors, Horchata and Melon. Both are amazing. Service is fast here. I order over the phone and most times they say \"okay ready in 5 mins.\" Quickest service I've received other than a fast food place. Definitely my #1 go to place for a super burrito.", "author": "Liza E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-22", "description": "I thank Jesus at least three times a week that these guys are open past 1am!", "author": "O. S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-11", "description": "Definitely one of my favorite taquerias. The griddled tortilla and the chunks of avocado as opposed to guacamole really make the difference. The horchata is pretty delicious as well.\n\nI do have a couple of minor complaints though. \n\nThe chips are almost always stale. C'mon guys, invest in a couple of twist ties.\n\nNo carnitas. No CARNITAS?\n\nDon't get the chorizo unless you're surrounded by people who love you. I mean REALLY love you. This may be the true test of loyalty. I'll say no more than that.\n\nOh, and one more thing. DO NOT EAT ONE OF THESE BURRITOS BEFORE GOING TO WORK (like I did yesterday.) Your co-workers WILL find you lying unconscious in a corner from a meat induced coma.", "author": "Josua P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "Post-drinking taqueria-munchies must be some kind of SF rite of passage.  You people who grew up here, you have no idea what shit we had to eat in the Midwest after a night of imbibing - with the exception of the Pork Burger Man at my college (bless that man!), it was slim pickings.  Doritos and Hostess donuts, or Taco Bell - ugggghhhh....Taquerias are the diners of the West Coast - they serve both the young and old, they are open all the time, and when you gotta have it, you gotta have it.  You know what I mean.\n\nEverything on the menu is what you would expect, but I am going to tell you something VERY useful, here is the best item they offer:  1 Taco.\n\n1 Taco.  It couldn't be more simple.  Or more delicious.\n\nGet it with the carnitas (they must not have had them before, but they do now).  So savory and wonderful.  SO much better than the burrito and won't make you pop your pants' button.\n\nIt's so good that it almost makes the electric urine colored walls, the drunk teenagers talking on the phone, and the \"is it a guy or is it a girl\" people disappear.\n\nRoad map:  Argus.  Stool dancing.  Taqueria Cancun. 1 Taco.  Car dancing.  Home.  Bed.", "author": "Liz S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "I always love Cancun. I didn't realize there was one this far down though. It was a pleasant surprise to say the least. I can't resist a breakfast burrito anytime of day, especially after consuming a lot of drinks. Service is good, lots of space and conveniently located near a bunch of bars too :)", "author": "Greg G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-02", "description": "Not as good as I remember. I guess when you're 22 and broke this stuff tastes great! \n\nWe came here before we headed over to the Rocket Dog Rescue benefit at El Rio. (BTW, I won one of those Kristina R. \"Not Normal Yes Normal\" t-shirts in the raffle!) \n\nHad a veggie burrito and husband had a torta. Food tasted ok. Salsa was HOT. Self serve jalapenos were HOT. Food inspection score card displaying 66%...not so HOT.", "author": "Caroline C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-14", "description": "2.5 stars, actually.\n\nTaqueria Cancun is a prime example of what hype can do. Just check out the overall Yelp ratings of all 3 of their outposts:\n\n1) 19th & Mission: At the Hipster epicenter of Mission: 4 stars\n2) This location: At the outskirts of Hipville: 3.5 stars\n3) 6th & Market: At crack cocaine central: 3 stars\n\nSo due to liquor induced hunger, I now have been to all three of these locations. Taking hype (lack thereof) out of the equation, there's no drastic difference in food quality, overall, it's barely reaching \"all right.\" But, this location is waaay less crowded, and no scooby-doo extras (see my other TC review http://www.yelp.com/user_details_reviews_self?userid=e331pQV1I-SSnWw_w0PfMA&review_sort=time&review_filter=category&category_filter=mexican) in sight.\n\nSo if I limit my crappy chips intake, and fireball \"guacamole\" salsa intake, not get the carne asada, chorizo, beef quesadilla suiza or nachos from this place, I can actually walk out and think that this place is a-okay.\n\nSo what did I have here that was actually good? Quesadilla Suiza with Al Pastor and their Horchata.", "author": "Faffy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-09", "description": "Ever since I found this place, I've been getting the Burrito Mojado ever since. Such a good burrito! Also the salsa and guac is perfect while waiting for the MOJADO!!!!", "author": "Danny P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-29", "description": "I like how they hyphenate Can-cun. I like all the options on the menu. I like the idea of super tacos; they're tough to eat as tacos, but the size is such that one makes for a light meal and two is a full dinner, and that they don't induce food comas the way super burritos do. And I like the tacos al pastor here a lot. \n\nNot really digging the red and yellow color scheme though.", "author": "matthew r."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "$4.50 al pastor burrito?\n\nCheck.\n\nEnough food to make me feel like I'm gonna yack?\n\nCheck.\n\nMeat choices that include beef head, tongue and brains?\n\nCheck.\n\nI thought it was great, and I was only slightly buzzed.  The place smelled bad (as others point out), so do take out.  I'll give an update once this bad boy works its way through my system on my ski trip tomorrow.\n\nOr is that TMI?", "author": "Rocco B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "I like the vegetarian burrito and nachos, with no sour cream.  This location seems quieter than the others, so that works for me too.", "author": "Seong P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-04-12", "description": "Last night I had an interesting combination of Thai and Mexican.  I know .... but it went well.\n\nI ordered a Quesidilla Suiza with al pastor, and it was greasy and good.  But I forgot to add onions, which I will next time.  The pork has lots of flavor, but I wanted more heat.  Next I will try the burritos and / or alambres.  \n\nMy only gripe is the lack of salsa provided with the chips, which are complimentary.  I got a tablespoon or so of salsa.  I wanted to dunk everything in it, but I got so little that after a couple of chips, it was gone.  I also found a piece of carne asada in the salsa, which might be expected, but was slightly disturbing.  \n\nI think I'll go back, but will ask for more salsa on the side.  One quesidilla does NOT a review make!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-16", "description": "This place sucks.\n\nThe salsa sucks.  The rice sucks.  The chips suck.\n\nOnly vegetarians like this place because apparently they put a ton of veggies in the veggie burrito, but even if that did appeal to me (which it most definitely does not) then it wouldn't hide the fact that it's still a shitty burrito with funky-tasting rice and awful salsa.\n\nI can't understand how this place wins so many \"readers' choice\" awards because it just flat out fucking sucks.", "author": "Doctor L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-12", "description": "Taqueria Cancun is pretty much my neighbor. This comes in very handy on the rare occasion that I am drunk and craving a  late-night quesadilla. The quesadillas rock, but everything else is just okay. I have come to love El Metate and totally prefer it over Cancun. \n\nThere's just no way they have the best burrito in the city. Not a chance.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-21", "description": "Really greasy and not particularly good. I just think the quality at La Taqueria (a few blocks down the road) is much much better. Not terrible but not even really ok. It certainly passes a health code inspection but might cause an upset stomach from all of the grease. Only recommend if you are drunk and need it ASAP and nothing else is open.", "author": "Ben L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "Just checked out their vegetarian burritos, heard their names in the foodies news everywhere so I said to myself I cannot miss it...\nIndeed, their food is good and the ambiance quite genuine. However, and sorry all the hard fans, I do take Chipotle's vegetarian burrito over this one.\nFirst, they do have the bowl which avoids you  the wrap; second, they are so simple and good, it is just like a good salad with a beans base...\nAnyways, there cannot be dispute when it comes to tastes, as Latins said, they are all good, depends on what you like better...", "author": "VIORICA C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-11", "description": "This is my burrito and nachos standard in the city. Carne Asada burrito comes heavy on toppings and lots of meat. Usually get it to go, and eat it at home. Hard to beat their flavorful burritos and spicy salsa.", "author": "Darren K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-01", "description": "Ok, i give you a second chance Cancun. Your just Meh, but maybe that is all I need sometimes.\n\nps. your rice sucks.", "author": "Shannon Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "Taqueria Cancun saved my relationship last night!  No really, it did.\n\nI was in a crappy mood.  I wanted to go to Whole Foods, but everyone and their brother were headed to the ballpark to see Barry.  I tried to buy groceries at Bi-Rite and it seems that all the non-ballpark goers were there. So, with my crap attitude I went home.  I wasn't up for my usual of GFC...and it dawned on me to go and have a cheap dinner and get out of the house.\n\nI walked over to Taqueria Cancun and then realized how much cleaner this location is to the others.  How nice it is to not have the music blaring.  And an extra plus, no homeless people asking you for leftovers. \n\nI ordered a burrito mojado with carne asada and for $5.90 it seemed to have changed my attitude. Not only was it fast and delicious, but the price was right. \n\nYes, I came home with a better attitude and a great dinner all for under $6.  Could you ask for anything better?", "author": "Valarie A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-08", "description": "Ive been to this Taqueria Cancun a handful of times and its about average.  Their burritos are good but not great, they make a pretty good horchata and their prices are cheap. \n\nI went last night with a friend who is always raving about their al pastor burritos so I decided to try one.  To me it was just ok, the burrito overall was fine, wasnt too dry but the al pastor was average.  I felt that it was TOO marinated, the flavor of the meet was too strong that it drowned out the rest of the ingredients.\n\nOther comments; they only use avocado and no guacamole, which is fine but I prefer guacamole. They do happen to have a really good horchata probably the 2nd best int he city behind the El Farolito in the Excelsior.  Their prices are also very low, the average taqueria in the city charges $7-10 for a super burrito.\n\nAll in all, this place was just ok. If I am with a group of people and they want to go here Ill go but if its my choice, Ill go to El Farolito.", "author": "Ian P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-06", "description": "Always good food here. My favorite burritos. Burritos - try the carnitas, veggie and carne asada ... I tried the tostadas de ceviche today, liked those too. Try the pickled jalapenos in the big tub by the water dispenser.", "author": "Dana G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "I second all these emotions...they make the best burrito in SF. I highly recommend the carnitas-YUM YUM! The lighting is a bit like a hospital waiting room but that just makes it easier to see the hombres caliente that work there. \n\nDon't miss out on a truly delicious and satisfying burrito.", "author": "Nick B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-21", "description": "Forget any other mexican joint in the mission. Here's why: you know you're at a great taqueria if the only types of salsa are HOT and \"where's the flippin' water?\" HOT. None of that v8 broth that other taquerias pass off as salsa\r\n\r\nGet the horchata (you'll need it for salsa). Do yourself a favor and order the super quesadilla. It's the size of a burrito. Cancun doesn't mess around. They remove the rice and beans filler that comes in a burrito and they fill it with sour cream, huge slices of avocado, meat, and cheese. Too much good stuff. I have brought over thirty friends here, and everyone of them has told me that it was the best quesadilla they've ever had in their lives. No joke.\r\n\r\nDon't waste your time with similiar resturants in the mission, I promise (and I've evaluated them), they don't compare. Okay they come close, because who really cares when you're wasted? Nevertheless, Cancun is open till 2am on weeknights, 3am on weekends, so it's there when you really need it (eg: when you're drunk).", "author": "John M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-04", "description": "Ok there are 3 cancuns that I visit frequently, but this one still                   \"takes the cake\".\n\nThis is the 1st taqueira cancun I have ever visited. the 2 others                         ( mission and 18th) and (Market and 6th( are defintiely worth mentioning but like I said this is the best one.\n\nThis one I think has the most clean seating. The employees are more generally nicer and engaging. There juke-box IMO has the best selection too, lol.\n\nThe parking at dinner time sux but I cant blame that on this rest.\n\nI'm at a lost for words on how fantastic this specific rest. is\nIt will always be my #1 taqueria in all of San Francisco.", "author": "Andrew Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-07-10", "description": "Time was, I had this to say about Cancun ,\"It's open late and is better than Farolito. But it has more friends than it deserves. Mediocre, says me.\".\r\n\r\nMan was I sassy? Turns out, I was thinking about the Cancun near 19th. The one up in Bernal on Market (this one) is way better. It's not *great*, but it's satisfying and flavorful and cheap and I don't constantly have to hear about it from cheapskate, drunk at a Mission-bar types who think it's the end-all. As with the original Cancun.\r\n\r\nThe salsa verde is actually too goddamn hot. See if you don't agree. And man, are the chips ever crummy. But otherwise OK.", "author": "Jeremy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-16", "description": "To start off, I would like to disclose that I have a rule to only leave reviews after patronizing a business at least 5 times so my reviews aren't made willy-nilly. \n\nBest tacos I've found so far in SF. \n\nTrick - get one super taco and one regular taco, as they usually put so much \"super\" on the taco, that it can be shared with a regular taco.  Or, if you're feeling naughty, just get two super tacos.   Quesadillas are pretty tasty too.  I don't think I've had a burrito from here...I come here for tacos, and other joints for burritos.", "author": "L W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "I love this place. Affordable, friendly service and the portions are big. I ordered the steak enchiladas for around $7 and was presented with an enormous plate (2 enchiladas, a mountain of rice, beans, sour cream etc.) plus four hot tortillas. And they don't skimp on the complimentary chips and salsa (2 kinds). Definitely coming back.", "author": "Kareem Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-25", "description": "Eh. Perhaps it was the measly taco, but my last experience at Cancun was pretty unmemorable. And no, I wasn't drunk! Well, I wasn't THAT drunk, anyway. The Mission location serves up a badass veggie burrito, but the taco I got here was pretty blah. I do, however, love the slices of avocado used in lieu of guacamole because they add this buttery richness that is sometimes lost in guac. Occasionally I'm into simplicity over complexity, and no, it's not cuz I'm stupid. I have my Master's, for christ's sake! The amount of money I've spent on my education OBVIOUSLY points to my immense and intimidating intelligence, right? Right? Someone, please validate my choice to spend the rest of my life in debt! Throw me a bone, people! Or at least a dollar!\n\nAnyway, Cancun's cheap, meaning that I can actually afford to eat here, and the salsa does meet my required level of spiciness. I would prefer an actual salsa bar, but the chips are so crappy that it doesn't matter that much.  Also, if you're looking for vegetarian nachos that will inevitably cause a heart attack, skip Cancun and make your way over to Farolito, trust me. Remember, I have my MA so I'm totally a credible source. Okay, someone needs to positively reinforce me RIGHT THE FUCK NOW. \n\nYou know, I should probably just stick to the burrito. Tastes better, which serves as good reason to eat more than a stupid taco, and I deem any reason to eat more as successful.", "author": "Chloe S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Best veggie burrito in the city.  Hands down.  I love the way they grill the burrito till the tortilla is lightly crispy.  Not to mention, even with the price increase they are one of the cheapest burritos in town.\n\nOh and the salsa verde is quite tasty with just enough heat.\n\nHuge love for Cancun!", "author": "Trey d."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-18", "description": "When I'm bar-hopping in the Mission, I hit up the Cancun on 19th and Mission, but when I'm hoping to find parking, I go to the Bernal Heights location. Either way, I know I will leave full and happy. \n\nSince moving to Oakland, I've had frequent cravings for Cancun's vegetarian burrito. Soooo tasty. I love the melty cheese, the guac, the whole beans...it's just too good. \n\nAny East-Bayers wanna get together a Cancun Carpool, let me know!!", "author": "Vandana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-26", "description": "Burritos in this town is like religion. Everyone has an opinion and as soon as you open your mouth about yours, people either yawn in retort or want to ram their fist in it, so be careful what you say. The thing is, unless you get one of them new fangled California burritos with olives and arugula (lord have mercy on your soul) they really aren't that different other than 1) the care of the assembly 2) the relative freshness of the ingredients (look at how brown the lettuce is for any indication) and of course 3) the general safety of eating there (check out their health department certificate and police blotter). That said, I will stand firmly by the Burnal Cancun.\n\nI have no idea what level of affiliation this location has with it's other namesakes, but there is no question that this is the best of the lot based on the above standards. Always go for the *grilled* chicken, and grab your own personal bottle of Cholula to smother every bite. I think what distinguishes this place from other burrito chutes in town is that the contents are not only fresh, but evenly distributed throughout the burrito and made with a consistent ratio. There is always plenty of room to sit, and the water glasses are almost always clean.", "author": "Matt L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "For a taqueira, TC is one of the best in the city I think. Although you get less for atmosphere and dining conditions than some places, the quality of the food and the prices are actually very good. Generally, if you ask for  a veggie burrito at TC, you get a humongous thing barely capable of consumption at one sitting. If you add in a little meat, it's definitely a complete meal. Also their chips are some of the better chips-to-go-with as I have had at SF taquerias. I also like the agua frescas, esp. the watermelon one.\nIf they could only conquer a small fly problem, they would be heads over heels above Pancho Villa's or some of the other Mission district places.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-01", "description": "Simply the best burrito in the city.  I've lived here over 15 years now and I've tried just about every taqueria in the mission (no small feat), but this is the place that keeps me coming back.  I don't think there has been a month in the last 15 years that I haven't eaten here at least once. \n\nThe meats are grilled fresh imediately before going into the tortilla, the rice and beans are nicely seasoned and would be a treat by themselves.  Avocado is a nice addition to anything and their salsas are the best I've ever had.  They even sell salsa by the cup so you can take it home or to your friend's party.  Your guests won't leave you any left over when the party's over - it's just that good. \n\nI didn't even mention the price yet. How can this food be so good and still so inexpensive? I don't know why, I'm just glad it is.\n\nTaqueria Cancun is worth the trip from anywhere in the bay area.", "author": "Bryce M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-01-11", "description": "I don't understand why this place got so many Zagat reviews...\n\nEven though it offers a good portion for an inexpensive price...their super burrito being roughly $5..which is good if you are broke and want your $5 to go a long way. ...but i still wouldn't pay for it. \n\nI've gave this place two shots, and I dont' think I will be visiting back, unless I absolutely have no where to eat at 12am.\n\nThe last time I got a super burrito= meat had way too much fat and the guacamole was all brown.\n\nTo top it off, I got to enjoy my food with the bleach scent filling up the restaurant.", "author": "Catherine O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-29", "description": "So, I have a story about this place (\"Hey, Devin, do you have  a story about *every* place you review?\" Maybe yes. Maybe no. Maybe fuck yourself.). \n\nThere I was at the Knockout around 1:20a on some lovely weeknight, when BOOM it hit me: must. eat. now. Starvingstarving. No, stop talking interesting person, no I don't want a beer no I don't want to dance nonononononono we're leaving NOW musthaveburrito. This, um, happens to me a lot. Anyway, so I've just moved to the neighborhood, and am not yet terribly familiar with the local late night eats, so I had nothing in mind when we ventured out, leaving one darkness for another. Immediate right: oh god. Taqueria RIGHT THERE! Magnetized, I stumbled in, dumbstruck with our good luck. Order order, veggie burrito, no cheese, no sour cream, are your beans vegetarian, etc etc. Sit down, across the table from my date (that was a date, right mister?), they call my number, I do some kind of embarrassing standing/falling motion that gets the burrito in my hands and onto the table which I once again find in front of me. Bite: ohgodamazing. Bite: ohholyshitbestthingever. Several bites later:\n\nDrop.\n\nWha?Wh-y?Wha---why is it down...what is? Why...whys my burrito on the floor? Neither one of us could figure out how I had managed to drop my burrito on the floor--face down, my I add. And now, here it comes: the testament to how great this burrito was. Within moments, before we could even begin to truly debate it, the thing was back in my mouth. I was back to making out with that same juicy-beany-guacy-pico-y surface that had been smooshed down onto the taqueria floor.\n\nThis was like, my....third? date with a guy I really liked. And I let him watch me do that. I love Taqueria Cancun.", "author": "Devin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "Cancun (on Mission and Valencia, yes they cross) reliably serves the best vegetarian burrito in San Francisco.  I've been coming there since 1997, and the only thing that changed are the prices (used to be $2.65 for a veggie burrito).\n\nHere's the perfect recipe: Vegetarian burrito with pinto beans, extra cilantro, extra avocado, and no sour cream.", "author": "A S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-26", "description": "So around my house, there are two burrito places I frequent.  This place and El Gran Taco Loco (http://www.yelp.com/biz/el-gran-taco-loco-san-francisco).  Taco Loco is literally right across the street from my house (I often look out my window to make sure they're still open).\n\nBut recently, I find myself coming here more often, which if you know me, walking an extra block to get a burrito is quite a statement.  I think it's because of the \"Best Burrito Ev4r!\" awards they proudly display, or some combination of the fast service and cheap prices.  I really don't know why, because their burritos don't taste all that special.  Anyways, nothing really special, but not bad either; right down the middle.  I guess that makes it my little Buddhist burrito shop (blasphemous, I know).\n\nOh, they're open late too, so that's a big plus.", "author": "Zhi Q."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-08", "description": "I actually got burrito-jacked at this joint once.  No shit.  I was sitting there minding my own business, halfway through an al pastor or something, when I decided to walk across the room and get a cup of water.  In the 30 seconds or so it took me to do this, some guy just walked in off the street, picked up my half-eaten burrito, and started to walk out the door with it.\n\n\"Hey!  That's my burrito!\", I yelled at him when I turned around from the water cooler.  He just kept going.\n\n\"HEY!  THAT'S MY FUCKING BURRITO!!!\", I screamed, as all eyes in the room turned towards me.  The thief paused by the door for a second, took a quick glance over his shoulder, and set the burrito down on the nearest table, right in front of some other lucky patron who was finishing up his own order, and then just bolted.  \n\nThis one girl just laughed and laughed and laughed, like it was the funniest thing she'd ever seen.  \"You just got burrito-jacked!\", she said, barely able to keep her shit together through the hysterics.  Indeed I had.\n\nThe guy behind the counter witnessed the entire episode, and offered to make me another burrito.  I turned it down though.  I really wasn't that hungry to begin with, and I probably would've given the burrito thief the rest of my food if he'd just asked me.  That rip-and-run thing got my dander up, I guess.  \n\nI left after that and went next door to watch Astral play some shoegaze rock at the Knockout.  \n\nTrue story.", "author": "Gopal R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-31", "description": "So I came here looking to get the bad taste out of my mouth from the last burrito I had at El Toro. Thankfully, this did the trick. I was happy that the rice was moist, the pinto beans flavorful, and the carne asada smoky and delicious. My only gripe was the green salsa given with the chips was spicy but not very tasty. Also, the burrito leaked thru my brown paper bag, but that's SFs fault for banning plastic. At $5 for a reg burrito, I'll def return. My current fav burrito spot in SF.", "author": "Chantly S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-18", "description": "Solely for the vegetarian burritos!!!\n\nYou will not miss the meat in these burritos. Very simple yet very very good. Once again don't skimp and get it with everything and a large melon drink. That's all that needs to be said. I once got the burrito with meat and didn't think much of it as much as the vegetarian. \n\nBy the way the best meat taco is down the street on 25th and Mission, my other review La Taqueria.\n\nAB", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-10-12", "description": "Boo!\nTaqueria Cancun is not so great and I really don't get the hype particularly when there are SO many great Taquerias in the neighborhood.\nEverything I have ever gotten here has been \"meh\" bland, boring etc.\nDude just walk down to El Faralito if you want a cheap and decent Taqueria experience. I'd even go to El Taco Loco (which is similarly \"meh\" aside from it's fabulous mural of a taco wearing sunglasses, really the only reason to go there) over this place.\nEverytime I have mediocre mexican food in SF I get irritable:(", "author": "Catty C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-03-30", "description": "This is the nearest burrito place from my front door, and it's a pretty good taqueria at that.  Their veggie burrito is excellent (hope you like lots of avocado) and their al pastor is tasty.  No carnitas, but their carne asada is good.  They usually have tasty cantoloupe agua fresca.  I would say they're probably just as good as El Farolito.\n\nThe patented Cancun decor consists of insane BRIGHT YELLOW walls covered with weird paintings of bare-chested Aztek warriors striking action poses while cavorting with beautiful latina maidens, and lots of colorful streamers hanging from the ceiling.", "author": "David A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-18", "description": "This is my favorite burrito in all of SF.  I get the pollo asado regular with a spinach tortilla, and it is consistently fresh tasting and very, very delicious.  Inexpensive, and an easy, filling meal.\n\nI have only two small criticisms: the chips are always stale and don't taste very good, and that sometimes, the juke-box springs on blaring unbelievably loudly after complete silence for ten minutes (on or off, guys!)", "author": "Brent D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "Yummy burrito, good tacos, and a great super quesadilla. One of my faves.", "author": "Zak S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-30", "description": "I LOOOOVE CANCUN!!!! The Quesadillas and the melon Agua Fresca is my favorite. \nBEST IN THE MISSION", "author": "Lindsey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-19", "description": "I just got out of a pretty serious relationship with a carne asada super quesadilla from Cancun and let me tell you something, I have never been with a more giving, caring, nurturing lover than that quesadilla.  On the coldest of nights and the darkest of days that quesadilla smothered my worries in hot melted cheese and illuminated my spirit with it's bright south of the border flavors.\r\n\r\nYou simply cant ask for much more.  If only, I didn't get all caught up in those fish tacos from Nicks.  It was one time, I was drunk. I thought it didnt count if you were drunk...", "author": "zach o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-09", "description": "Smell: Scary awful!\n\nFood: Great!\n\nMy first visit to this Cancun location tonight.  The veggie Super Burrito was awesome.  But the place smelled like ASS.  I mean, it seriously smelled like somewhere there's a layer of something that has not been scraped off or degreased for a very long time.  It was empty in there.  Several people walked in, smelled the air and walked back out while I was eating.  I halfway didn't mind because the burrito was so good.  What can I say, I'm a hopeless burrito addict.\n\nUpdate, months later: Yep, still smells like *ass* in there.  Yep, veggie super burrito still is *excellent*.  Go figure.  I really love the generous amount of cilantro.", "author": "Eric O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "My favorite burrito in the Bay Area.  Flavorful rice and beans, big chunks of avocado, a big filling portion.  The other offerings here are great too - the quesdilla suisa, the al hambre meat plate, etc.  The guys who work the register are usually friendly.  I lived a block from this place for twelve years, and often got a burrito there once a week.", "author": "Adam C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "Ok, I used to hate Cancun. I always thought their burritos were overrated. After refusing to enter Cancun for years, one afternoon we decided to try it out again. We ordered spicy super veg burritos, and when we took the first bite it, it was heaven. It had a ton of flavor. The salsas were great. I had to say, it managed to find its way into my top 5 veg burritos in the mission (It will stay there, if it remains consistent). Do not go to the one near 29th and mission, we went there a few days later and it was back to mediocre (will be posting there shortly as well).", "author": "Ajesh S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-25", "description": "I used to eat at this Cancun location about 3 times a week, dinner, lunch, breakfasts.  I thought it was okay then - but it was my taqueria so I kept going back.  Lately I've been forced to eat burritos in other parts of town, and this has restored my faith in Cancun.\n\nI had a veggie burrito here a while back, and dang, it was great.  Maybe I've been wandering the desert sub-par burritos too long, but I was impressed.  Mostly by the rice and beans, the rice was fluffy and bright bricky red with tasty zest and the beans were equally impressive.  As always great slabs of avocado and any cheese problems (there used to be some cheese problems) have now been solved.  They still grill the outside of your burrito better than any of their imitators and the green salsa is great (thought the red is abysmal).\n\nStill, I also remember the times (well three that I can remember - though to be fair that's out of literally hundreds, if not thousands of visits over the past 5 years) that Cancun has made by belly churn, and I the more numerous times I've simply been bored with what I thought in my burrito arrogance was it's lackluster burrito.", "author": "Gustie L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-21", "description": "With so many taqueria joints in the Mission, it would be hard to justify going back.  The carne asada was chopped too fine and close to ground beef.  Plus, they got creative with the al pastor, which is a dish that you aint got no bidnuh messin wit.  The salsa was HOT, and I loved it which is why this place gets two stars.  \n\n\"Go for the salsa, stay for the crackwhores outside.\"", "author": "Will H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "Only been here once but the chicken tacos with everything are awesome. My friend got the veggie taco and I wish I got that, but didn't regret the chicken. Chips, salsa and super-spicy guac with every order is a nice perk. I'll be back. VERY cheap! And beer! I checked that they have \"beer and wine\" on the additional tips, but I think they just serve beer.", "author": "S A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "I always get the super chicken quesadilla, this might be my favorite taqueria en the city.", "author": "Mark R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "This is my favorite cheap and abso-freakin-lutely delicious burrito dive. I've been coming here since I was about 10 with my dad. And now I bring everybody here. \n\nThe decor is a little tacky and overly colorful, but frankly, it's the best burrito in the city. Now, I haven't been all over the world tasting burritos, so I'm sure there's a better place SOMEWHERE out there. But I haven't found it yet. I am a die hard loyal Bernal Heights Taqueria Cancun fan. \n\nI don't order anything but burritos when I come here. And everybody I've ever taken has declared it either the best they've ever had, or bumps it right up near the top of their list.\n\nYOU WILL NOT BE DISAPPOINTED.", "author": "Mindy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "I love Taqueria Cancun ! Okay, it helps that it's in my neighborhood but I would still seek out their veggie burrito with black beans, spinach tortilla and no sour cream ( my way) even if it was across town. I also love the enchilada plate, I'll order the grilled chicken enchiladas with whole beans on the side and extra avocado.  Mmm the enchilada sauce is delish !  To go or eat in it's service with a smile. As a friend in the neighborhood says, on a good day there's no better restaurant.", "author": "Michelle M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-26", "description": "Okay, so they've been voted as having the best veggie burrito in the city.  I think it's GOOD, but I wouldn't say it's THE BEST. \n\nThe veggie burritos are filled with delicousness, including slices of avocado.\n\nI've had the veggie tacos a few times - if you're a strict vegetarian, be careful! I've found pieces of chicken burried in the tacos...", "author": "Sean G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-23", "description": "This place is OK. Honestly, I don't see why Cancun has such a crazy rep. The food is standard taqueria fare, but its not mind blowing. If I'm having a Hamm's at the Knock Out I often pop in here to fill that salty void in my soul with a regular chicken burrito, but the truth is, its just OK. Pizza and Burrito joints near bars always tend to get better reviews because lets face, that shit is good when you are on a bender, but that skews the data.\n\nLa Altena down the street (by Safeway), while spotty at times, has fresher ingredients and a shorter line.", "author": "Zac H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-29", "description": "A bit  disappointed with TC lately. Used to be my favorite for Carne Asada burritos, but something happened. The flavor is bland, something... perhaps the salsa lacks the punch it had. Perhaps it's just this location. Perhaps the location a little further down the Mission is better.\n\nTheir melon agua fresca is very good.\n\nMy search is still on for the San Diego style California Burrito;\nCarne Asada, melted cheese and french fries... alas SD is a bit far to go for that.", "author": "Geordie E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "This place was awesome, I wish I could go every week! We were visiting from the UK and were recommended to go here by a friend who lives in SF. We had the veggie burrito and the super steak burrito, they were fantastic. Loved the avocado not guacamole, loved the amount of cheese, the price(!) and basically I'm very jealous of anyone who gets to go here regularly. Friendly and quick service too.", "author": "Cath A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "This burrito isn't quite as magical as El Farrolito, but it's pretty damn good.", "author": "Klevin D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-26", "description": "A year ago, I probably would have given this place four, maybe five stars.  Can't put my finger on exactly why, but they've lost some zip on their fastball.\n\nMaybe I'm just getting older.\n\nLet's not forget this place still serves a solid burrito for $5.", "author": "Jackson R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-05", "description": "Update: I do admit its the better spots to go to 'round hurr.\n\nThey must have somebody on the inside when those best of the bay articles come out. Because there are way too many places that rock burritos better then them. Stale chips and over greased quesadillas w/ cheese. Please.\n\nThe fellas that work there dont seem so happy either.", "author": "riz l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-08", "description": "Upon moving from New York City, I realized that the Mexican food I was eating there was CRAP!\n\nI'm addicted to these burritos. I can't get enough. The vegetarian super burrito is delicious. I love that they use fresh avocado instead of guacamole. They chips could be better (like not stale) but who can eat chips when you are eating a GIANT burrito!\n\nAlso, try the breakfast burrito. My friends and I have made it tradition.", "author": "Bella T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "I don't mean to give just \"passing grades\" to any/all of the taqueria's i've been to in the Mission but it's merely because I pretty much like them all and it can be hard to differentiate them.  I had a burrito here and it was competent and hit the spot; slightly more lime-flavored perhaps even.", "author": "Mike S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-26", "description": "If you have not had there nachos - man you have no idea what living or eating for that matter is.  \n\nI remember chowing nachos at the 7-11 in my yute...dang good right?  Or the nachos at Taco Bravo in Cupertino before they shut it down...now in Fremont ...\n\nOk back to these guys...the beef the cheese some kind of mad concoction- I cant explain it but they get all of it infused together perfectly so that you never are sitting there going - there is no cheese on this chip.\n\nI usually will drop the car for a car wash on Van Ness and walk over...the walk back to the car is prolly a good idea- I thinks.\n\nI have not had the burrito yet- although I am a creature of habit- I will try the burrito when someone else gets the nachos so that I can have both.\n\nAvoid the lines go on a weekday lunch...or sit next to your fave drunk stranger on a weekend night.  The picnic tables make for nice socializing while you look across at the drunks scarfing down burritos.", "author": "Rob C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "This local mini-chain serves the best veggie burrito in town.\n\nSince this location is near me, the large breakfast plates are a godsend on Saturdays.\n\nAnother must-try is the ceviche tostadas, they used to be a buck twenty five but have gone up a bit in recent years.", "author": "Scott L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-05-16", "description": "I do not understand what the hype around Cancun is.  If it weren't for people talking about it all the time I would never take particular note of it.  In my opinion there are many taquerias in San Francisco with better food.  As the guy before me mentioned, the chips are always stale, and they're from a bag.  They're not even freshly made.  \n\nThe place is nice and clean.  The employees are nice.  The prices are good.  But the food isn't remarkable at all.", "author": "Reid O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-19", "description": "happy 100th review to you, happy 100th review to you, happy 100th review to youuuuuuuuuuuuuuuuuuuuuuuuuuu taqueria cancuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuun bernal heights location, happy 100th review to you.  LYLAS!!!!!!!!!!!!!!!!!!!!\n\nthree words=super vegetable quesadilla.  ive never been able to order anything else because it's so insanely good.  full of avocado and spices mixed with a TON of cheese and sour cream fatty cooling goodness. let it drip all over your face and save it for later.", "author": "threeholepunch y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "When you're coming from El Rio, or from wherever your favorite watering hole is, Taqueria Cancun is the place to get grub. I have never been let down by their tacos or quesadillas.", "author": "Andy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-13", "description": "funny story. trekked out here to try the super burrito, since foodspotting's scavenger hunt for the 2010 100 things to try before you die (Big eat SF) had it on the map.... happened to just check the list to grab the # for said burrito, and the super burrito they list is for somewhere else. oops.\n\nthat said, good hearty food for like 6 bucks (CASH ONLY). big enough for me to split and keep for another meal, yay cheapness! spicer than expected (had pollo asado) and wayyyy more rice than expected.\n\nrandom note: i asked for a whole wheat tortilla but my friend got it on his burriot instead. oh well.", "author": "S V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-31", "description": "I can't believe all you crybabies whining about the atmosphere or the neighborhood. If you want Tony, stay in Pacific Heights where you belong. \n\nI can only imagine how much you whine about eateries in the Point or the Western Addition.\n\nFolks, don't listen to the youthful morons with the sense of entitlement. This place ROCKS! Second only to Don Chuy's at Naples and Excelsior. The jukebox is GREAT, the chow is great, and if the young toughs keep the other kiddies away (it must be terrible to live in such fear of anyone  brown or black) that means there's more for the folks in the neighborhood. \n\nGet the Al Pastor burrito. Rocks the house. I hear they have carnitas so I'll have to try that, too.", "author": "Pete B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-28", "description": "I've had a few veggie burritos at the Market st. location and always been satisfied - maybe it was the 2:30 am-ness of this outer mission franchise, but I was sorely dissapointed.  Yes cheap, yes big, but NO FLAVOR.  Also, I'm starting to think I need to skip on the cilantro when I get a burrito but thats just me.  Really though, this was just a sub-average burrito, and the guy was a jerk (just like the guy at the Market one - is that a requirement for Taqueria Cancun?)\n\nMy hunt for the best veggie burrito in the Mission continues.....At least this place has a working bathroom though.", "author": "Tmon B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-13", "description": "Cancun is hands down, the best taco in the city. Get the super taco, with chicken or carne asada. the come fully loaded so you'll need to use the free chips to dip some toppings before picking up. with a cold Pacifico, or a mexican bottled coke, you can't go wrong. \n\nalso, I'm lucky enough to live nextdoor!", "author": "Jevir G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-17", "description": "Have only had the (Mexican ceviche), but the deliciousness was consistent with their other locations...still wish they'd expand some more....", "author": "Mark A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "I ordered the veggie burrito and so far its the best veggie burrito I've had. Moderately spicy and a tasty sauce, not to mention that it was a gigantic burrito and I was full and happy. :)", "author": "Rahul P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-14", "description": "So, I am an enormously avid burrito connoisseur, and this specific Taqueria Cancun location is by far the best I have encountered for just such a hobby. \n\nI've tried most of the menu, although I will say that my personal favorites are the veggie burrito (that being that I am in no way a vegetarian), and the super tacos  al pastor. \n\nI used to live two blocks away from this place and due to time and financial restraints could only eat once a day. This taqueria was not only perfectly substantial, but extremely affordable. ($4.88 for the aforementioned veggie burrito.) Also, the portions are so huge that I rarely finished anything in one sitting and could refrigerate and re-heat at my whim.\n\nMy only criticisms of this place are typical of good Mexican establishments: it's a little lacking in the hygene department and the guys who work there really love the ladies, if you know what I mean. I will say, however, that one rather cheery fellow with a mustache and thick-rimmed black glasses is really cordial. Two thumbs up!", "author": "Liz O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-16", "description": "Just discovered another Taqueria today Sept 16th on Mexican Independence day. \n\nJust ordered a Chicken Super Burrito and my carnal ordered a Carne Asada Super Burrito. Pretty good\n\nThe menu looks promising\n\nSo far so good!\n\nUpdate I have tasted the Torta and to be completely honest they are Horrible first they use a small currant bread bun (Torta buns are huge) and second they are not toasted as they should in the end they are soggy, so after eating here a second time the Burritos are still good but the Tortas suck A real Torta is huge well toasted and filling not small and soggy!!!!", "author": "Alberto L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-12", "description": "Absolutely the best burrito in the city that invented the modern burrito.  Pretty sure that makes it the best burrito in the world.", "author": "Tod G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-25", "description": "I generally like Taquerias, I'm a fan of cheap Mexican food that is open late. After six years in Phoenix, I developed quite an appreciation this concept. However, I found the meat to be much fattier than their competitors, Really wasn't super impressed with the chips, salsa or my carne asada. El Farlito is better and cheaper.", "author": "Marissa P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-18", "description": "Pretty good. Didn't have the \"gurgles\" afterwards. If ya kno what I mean.", "author": "Ressard S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "They have the best, THE BEST, al pastor tacos with extra salsa verde, the only thing that I ever want to eat after drinking at the Knockout.", "author": "Y K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-23", "description": "If I was standing outside it, it didn't have a line, and I was craving a burrito right then, I'd eat here (and this has happened multiple times - it's right by my apartment).  That makes this 1-star rating odd, because usually it means \"avoid like the plague\".  However, I can think of a solid half a dozen burrito places I like better nearby, and probably another half a dozen I haven't tried.  The Cancun at around 17th and Mission is dramatically better as well.  This place never has many people in it, which lets you get in and out faster, however means the ingredients just aren't as fresh, yet the staff doesn't seem to make as solid a product as other places.", "author": "Zachary R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-04", "description": "YUMMIE! I've been coming here since it opened, and the Veggie Burrito is super yummie. So are the super nachos. And their green salsa is to die for. \n\nBut alas, I can't bear to eat here anymore. Ever since the Health Dept gave them a 66 on their inspection card, I'm way too creeped out.", "author": "G G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-22", "description": "I stopped by here a few weeks ago after a brief bar hop from Elixir to 3300 Club to recharge and sober up.  I ordered the super taco with al pastor. Umm, umm, yummy. It was so good and quite a meal for about $3, and it comes with chips to boot. I highly recommend Taqueria Cancun al pastor super taco - do it, do it!", "author": "Frigga G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-11", "description": "Added to my list of late-night taquerias, Taqueria Cancun gives really good meat portions especially in their burritos. I find the spot a bit neater than others especially during late hours. The tacos and quesadillas are good, but I'm not a fan of their nachos grande, which require much more nachos, and their tortas are pretty small in size. Every now and then, I'll stop by early morning for one of their hearty breakfast plates- Huevos con Chorizo.", "author": "Leroid D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-03", "description": "sober euge : well mannered, polite, patient\ndrunk euge : loud, loud, loud, \n\nsober euge : may come up with ideas to help fellow man\ndrunk euge : just might break a dol sot bi bim bap bowl over your head\n\nsober euge : can i get an iced tea with that?\ndrunk euge : four grey goose chilled, in one cup\n\nsober euge : meh taqueria cancun... meh. a big fat meh. \ndrunk euge : THIS IS THE BEST FUCKING MESSICAN FOOD EVA  *drops pants*", "author": "Euge L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-22", "description": "I'd probably give it 2.5 stars really, but anyways, here's why: I've wanted to go to this place for a while now. As a vegetarian, I have a hard time shying away from anywhere that boasts it has \"the best vegetarian burrito in san franciscio\" and while out and about in the mission/bernal heights tonight, I was excited to finally try this place out. I wasn't all that hungry nor in a mood to spend money, so although I wanted to try the burrito, I settled for a cheese quesadilla with avocado instead (it came out to $4.07 - not a terrible price). They gave me some chips which were pretty average then, pretty quickly, my quesadilla came out. Up until this point I was a fan. But after I first bit into the quesadilla, I began noticing little bits of beef throughout (and trust me, it was definitely beef), hidden between the tortilla's layers. It probably wasn't intentional, but as a place that claims to have the best vegetarian burrito, I was sorely disappointed. There's a slight chance I might consider going back for the burrito, but after tonight's experience, I wouldn't be surprised if even that isn't truly vegetarian.", "author": "Roxy B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-07", "description": "bomb chorizo con hueeeevos.....\n\nbomb bean dip \n\nreasonable prices", "author": "Dessa R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-03", "description": "Easily the best Taqueria I've eaten at in San Francisco! I have to resist eating there most days. The food is delicious, cheap, and it is quick with take out. Favorites are the Super Nachos and Super burrito. Only potential downside is that it's packed at times and is cash only (not a surprise for most small San Fran restaurants). Highly recommended- midday or for a midnight snack.", "author": "Rachel G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-16", "description": "To the haters:\nmaria & angela - don't eat the hot sauce if you don't enjoy sauces that are hot\ndon - super chicken quesadilla\ncatherine - s.c.q.\nmr g - s.c.q.\nsteve s - no.\njonah - maybe you can't handle it?\nwill - s.c.q.\nejk - no.\nkimberly - blue plate is the obvious culprit here.  oh and s.c.q.\njeremy - bring your own chips.  that and s.c.q.\nscott - no.\nchloe - \"wasn't drunk! Well, I wasn't THAT drunk, anyway.\" yes you were.  also, s.c.q\nvlad - 19th st. cancun is good only if you like to smell pee while you eat.  \ngabriel - i can't help you if you cant taste.  (s.c.q.)", "author": "Jack S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-18", "description": "Blah! Don't confuse it with the other Taqueria further down Mission. This place's idea of vegetarian is just rice and beans with suspicious looking avocado. The colorful atmosphere reminded me of staying in a party after the clowns left.", "author": "Jasmine T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-04", "description": "this is my favorite place for al pastor!  i like how they use real avocado for the veggie burrito. the shrimp ceviche is a good alternative your normal taco or burrito.  busy late night spot.", "author": "Sheri N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-04", "description": "My feelings on Cancun are mixed. On the one hand, they use avocado instead of guac in their burritos, have grilled chicken instead of shredded chicken and grill their tortillas. On the other hand, their chips come from costco,  their salsa is so hot that it's almost unedible and they don't have carnitas, my number one favorite burrito stuffer.  In a pinch, it'll do.", "author": "Maria D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-09", "description": "depite the advert one must unfortunately travel well north to taste fresh racoon meat, canned just isn't the same. ug. \r\n    wholewheat tortillas are good, and the workers genuinely smile and gather round to watch you take your first bite, then laugh uproarously and clap eachother on the back while asking in broken english \"you...(gasp, laugh)like?!\" I feel i've truly befriended these wily hooligans. Again, the foil takes some getting used to but the salsa and guac and convivial goodcheer more than make up for it.", "author": "owl c."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-14", "description": "blah blah blahbity blah... this place is just blah in comparison to the other Mission location. \n\nAt this location I had the al pastor super quesadilla. It was good, but it was not great. \n\nAt the other location I had the al pastor super burrito (thanks to Wakako. Hi Wakako!!) and that thing was mouth watering good. \n\nBut having lunch with Eugy is always a pleasure. Thanks babe!\n\nThis place is CASH ONLY. But there is an ATM right next to the cash register.", "author": "Jen D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-03", "description": "Quite possibly the best burrito I have ever had. It had nothing to do with the fact that I had been drinking at El Rio for 3 hours, or that my friend went and got it so that I could keep drinking. No. It had to do with the perfectly marinaded meat, the spicy yummy salsa and the sour cream that was evenly spread throughout the whole burrito and the fact that I could not finish the whole thing and ended up giving it to the guy sitting next to me and making out with him for 20 minutes. Yes. The burrito was THAT good. I'd totally send someone out to pick another one up for me.", "author": "Brenda K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-04-17", "description": "First I have to admit I ate here after consuming a beer or two or three who knows. They may have gained an extra star because things taste and look better when you've been drinking. But I should add it was easy on the wallet.", "author": "Stacy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-11", "description": "This is the best Burrito Al Pastor I have ever eaten.  I have gone back three times and I still love it.  You can taste the carmelized onions.  It is so rich and filling that I only need the regular size and I am totally filled and extremely happy.  And the cantelope agua fresca adds to a wonderful experience.", "author": "Nikki S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-27", "description": "My favorite of the three Taqueria Cancun locations in SF!  More spacious and less trafficked than the other locations.  A great place to enjoy a cheap and easy vegetarian burrito.  The aquacate salsa isn't fermenting here as it frequently is at the Mission St. location.", "author": "Rajeev S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "few salsas rival cancun's. they both have kick and they're not runny. f'n awesome. i used to live a block away and ate here much more than i'd care to admit. but c'mon, a MEAL for $4.... are you kidding me?! god i love the mission. \n\ni did usually get veggie options there. if i did get a meat, it was steak. they use both white and dark meat chicken (mostly dark) and i loathe dark meat so that's the only drag about the place. but the veggie burrito is just so damn good that i didn't even miss having chicken.\n\nthe horchata is good, especially when it's fresh. and i can't say enough about the salsas.", "author": "Sidney B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-01", "description": "I always order a grilled chicken burrito because you can never go wrong. No sour cream and with black beans. This location is better then the one on Market street because it is kinda scary down there with all of those hobos. The burrito came with free chips and a lot of salsa which I like!  or which I LOVE!! But the burrito came with very little chicken which kinda sucks because in other places they LOAD of the chicken!!! I was kind of disappointed. They have a lot of awards on their wall! Yeah this place do look very clean!! I would come here again if I would venture here.", "author": "Janet Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-05-05", "description": "I felt as though a little piece of me died last night as I ate my burrito\nUnder the fluorescent lighting that cast a yellow aura to the\n already yellow on yellow dining room\nMy husband kept picking crunchy, tough pieces of chicken out of his mouth (he had the chicken tortas)\nAnd the \"chips\" were clearly from a giant bag purchased from Costco\n\nCancun was my very first west coast burrito experience  \n (although for the life of me I don't remember which location it was...oopsie)\nthis was more than a decade ago...\n And I was forever changed\nThe burritos I ate during that summer in San Francisco were a large part of the reason I fell in love with the Bay Area\nI have spoken so fondly of these burritos over the years\nAnd that memory of the perfect burrito has always held an important place in my heart\n So now I am older, and worldlier in the ways of the burrito\nI did notice the last time I ate here (maybe 6 months ago)\nThat it didn't do it for me\nI quickly made excuses... I thought perhaps it was just that I was eating at 2:30 AM after way too many cocktails next door at the knockout\nand quickly pushed the experience from my mind\nrecently upon learning  I would be going to a show at the Knockout \nI was excited at the thought of going to Cancun\nI was ready to rekindle the romance from my early 20's\n However nothing tasted right\n The rice was dull... the beans flavorless, \n  the cheese and sour cream overwhelmed each bite (not in a complimentary way)\n and while the avocado was very visible- the taste of it was nowhere to be found\n I think it's over between us now\nBut I will never forget that day I fell in love", "author": "Maxine M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-23", "description": "not likely to ever come here again.  since there are closer / better burrito places near where i live.\n\nthere is a Cancun on 18th and mission too, had a good wet burrito there once. As well as el faralito on 24th and mission had a really good carne asada quesadilla suiza the other night (then I went home and threw up but i dont think it was cause of the quesadilla)\n\nThe health inspection score (green card) for this particular cancun shows a score of 66. SIXTY SIX!\n\nis this even legal?  shouldnt this place be condemned?\nChaya on 18th and Valencia has a score of 88 and already that sounds low.  Burger Joint has a score of 95, but that place looks antiseptic almost.  I dont even know what the score represents, just that the higher the better.  So i imagine the score is made up something like this : start with 100 points subtract 1 point each for the # of boogers and rat poop found in or around the food prep area.  That's alot of boogers.\n\nyou know what? i hate burritos.   why do i live in the mission?  fock me.\n\n** copied and pasted review  originally posted in the 18th/mission page", "author": "Irvin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "Their $4 vegetarian burritos saved me from going insane from drunken hunger. Who knows, I was so wasted that I may have started to eat the napkins I keep in my purse had it not been for their burritos.", "author": "Courtney S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-02-05", "description": "Just don't get the hype. Yes it's cheap & it fills you up but so do Ramen noodle. Oh and I have had many a vegetarian friend get a littl meat surprise in their burrito.", "author": "Catherine D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-07", "description": "Another taqueria with good food. I'd say the winner of the block is El Zocalo (despite it being a Salvadorean restaurant instead), but if you want quick food, Taqueria Cancun is the place to go. I like how they use fresh avocados in the dishes vs guacamole, but that's personal preference. Way too much competition in the area for me to come here again anytime soon. It was good, but it wasn't enough to make this a favorite.", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "Best taco in the mission!  The burrito, enchiladas, and other dishes are average for San Francisco.  On the plus side its open late.", "author": "BeeryMcGymrat X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-05-30", "description": "The only reason this place gets high marks is because it's open late and it's cheap..the quality of the ingredients are so-so...the salsa is hot (bfd) it doesn't take cooking know how to add more chile into the salsa..and they don't have carnitas....anyway, there's a lot of taquerias out there that are way better.", "author": "Brenda D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-15", "description": "I appreciate the fact that they grill the burritos here.  Last time I ordered horchata it was pretty sweet with no ice, so I had to water it down a bit, but otherwise it's all you could ask for in a taqueria.", "author": "Rick B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-06", "description": "you know, we went to this place one for lunch instead of el farolito, and it was ok.  \n\nbut i don't think i'll be going back anytime soon.", "author": "Steve S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-15", "description": "Besides the fact that I always feel just a little sick after eating  here, it has to be one of my favorite taquerias. When my husband and I used to live south of Market we would frequent the Market location, but we would never actually eat there. I much prefer the bernal heights/mission location. There isn't that fear of a crack addict coughing on your food while you go  to enjoy your first bite or the fear of wearing open toed shoes because of the used needle littered streets just around the corner on 6th street. This is a much calmer environment. I enjoy the whole chunks of avocado in the burritos and the flavors  are just right. \n   The last time I was there the taco jockey went hefty on the cheese and the meat. How can anyone not dig those perks? ( apologies to the vegans of the world, you suffer enough without it being rubbed it your face) On the subject of meat I do find it a bit disappointing that they do not have carnitas. That's like a cat without fur, sure it is still a cat but who wants to cuddle it? It's missing something. The chips are also my other complaint. Invest in a fryer, that's all I have to say. \n     On a good note though, they make tasty horchata and salsa, and the tortas are pretty kick awesome as my brother would say. Overall the people are always friendly, the food is  always tasty, and the price is right!", "author": "Esa Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-11-14", "description": "Once again, good but no La Corneta. Open super late, good salsa bar.", "author": "Catherine K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "This is our local taqueria, within walking distance and all that.  We probably eat here approximately twice a week.  Personally, my very favorite place for carne asada burritos remains La Taqueria.  But that's a 15 minute walk and this is 5 minutes.  And aside from LT's carne asada burrito, this Mission St. location of Taqueria Cancun gets my vote for everything else.  The al pastor burrito or quesadilla is to die for, and I usually do as I end up overeating.  The sauce is just delicious.  My son could literally eat their bean/cheese/avocado burrito three times a day if we would let him.  Hidden gem on the menu - the tostada de ceviche.  Super cheap and tasty.  Close your eyes and you would swear you were at Maya paying like five times as much.", "author": "Valerie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-15", "description": "I like this location a lot more than the other one on Mission. Similar setup and options, but a lot less crowded. Only negative is that it constantly smells like bleach in here. Not very appetizing.", "author": "Rocky K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-29", "description": "My favorite taqueria in SF!  Good cheap veggie burritos with chunks of fresh avocado are a staple for neighbors on a budget.  My favorite is the Al Pastor.  Best marinated pork around!  The Horchata rules, and the agua de melon is awsome as well.  You can also order a fresh carrot orange juice if your into that kind of thing.", "author": "Josiah B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-09", "description": "Not as good as the Cancun at 19th and Mission.  That's really all you need to know.  Not enough cilantro, not enough avocado, the tortilla wasn't grilled the way it's supposed to be, you're not sitting on those awesome long wooden benches... Just go down the street to the other location and eat the best burrito of your life!", "author": "Anna W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-28", "description": "the place san jose will just never compare to........\n\nthe food is absolutely great. and it's fast. and it's cheap. and they give you good chips and salsa while you wait. and they have Mexican music blasting in the background. and they have cool Mexican deco hanging from the ceiling. and they have beer.\n\nthey also carry the ever popular super burrito, which has come to be an integral part of whether or not i like a burrito joint. i think this is the best burrito place in the mission hands down.", "author": "David D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "My go-to spot for a quick and easy veggie burrito (with everything). Cheap, reliable, fast, open late. Not as good as Papalote.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-28", "description": "If there was Nobel prize in the category of chirizo burritos, Taqueria Cancun would win easily. This is the best burrito EVAR. The only thing that comes close is the El Faralito carne asada burrito. Luckily, being comprised of beef puts it out of the running for the chirizo burrito Nobel prize, so we won't have to make that tough call.", "author": "Gabe M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-18", "description": "Best burrito I've had in ages.  And I eat my fair share.  One complaint would be how stingy they are with the salsa.  Their green salsa is very good, but they only give you one ramekin.  There is no salsa bar.  Chips are not homemade, either.", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-11-30", "description": "Really good, unique Al Pastor. Everything else is average. Cheap.", "author": "Don H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-13", "description": "You know what? 5! Well, rounded up from 4.5 because of the obnoxious conversation you sort of listen in or out for in that particular neighborhood. If obsessive hairstylings and bulged pants are what your parents thought were cool, who knows, in the evening this place could be bothersome. If you couldn't care any less about atmosphere or ambiance, like myself for the most part, then go. And it is open nice and late for those of you with sleeping or partying disorders and orders. \n\nThe Veggie Burrito is number one in the hood for a reason. Get it and you'll enjoy it, or I'll buy it. I live up the street and if you time your email right, I'll pick up the tab, my man. Certain stipulations may apply, offer ends pretty soon. \n\nI wish I knew a secret menu for this place. Do you know what I mean? - Freshly squeezed juice upon request, in any case.", "author": "Turkey N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-27", "description": "Be forewarned: the salsa is hot, and anything you order with salsa in it will be hot.  You can request for them to leave out the hotness, though.  I was spared because I ordered the basic quesadilla (carne asada and cheese).  We were going to a house party in the neighborhood and we needed a bite - this turned out to be a good pick.", "author": "Angela W."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2006-07-07", "description": "Completely dissastisfying...even when starving.  My friend almost started crying, her burrito was so awful. But maybe it's because we really wanted to go to Blue Plate, and waited an hour until 6 when it was posted to open, but eventually called to find out they aren't open on Sundays...", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-19", "description": "Solid taqueria with fantastic food. Burrito was fresh and tasty and portions are huge. Truly a good value for the money. The only reason I didn't give it a full 5 stars is because I still have a bit of San Diegan snobbery left in me in terms of authentic and excellent Mexican food. However, for the San Francisco bay area, the food here really almost did remind me of home.", "author": "Stephen C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-12", "description": "Cancun, I don't know what happened to you?????  I go away to Africa to do humanitarian work at a hospital and on the flight back all I could think about was eating one of your delicious awesome burritos.  I used to eat your fantastic food 3-4 times a week.....but now I don't know if I want to go back.  What a big frowny face :-(  Your beans tasted burnt, the meat was very dried out, and the rice.....um just no.  This is coming from someone who has been on rationed crappy food Cancun.    But! The guys behind the counter recognized me, asked where I have been and were very polite as always.  So that is why you don't get the 1 star.  I will be back to try again and hope this was just one of those off cooking days.  Because everyone and everything deserves 2nd chances right??  I think so!!", "author": "Suzanne C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-09", "description": "Decent burritos and the price is right.  The chips and salsa come free too!  The staff is always very friendly as well", "author": "Sarah K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-30", "description": "Some drunk girl at El Rio said these were the best burritos in the city, though she admitted that's a subjective question.  She must prize blandness above all other qualities when it comes to rating burritos.  Further, she must either be a vegetarian or love low-grade meat.  This place is okay, but it's not very good.", "author": "Jes H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-22", "description": "The carnitas quesadilla was pretty good! The only problem was we ordered three suiza and instead they gave us the smaller ones. Next time I'd send them back, however at 2am its kind of hard to be picky...", "author": "Nicolas H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-09", "description": "The quesadilla suiza seems better suited for 2am than breakfast.", "author": "David R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-06-26", "description": "Two stars, giving them the benefit of the doubt, that the guy at the counter was too spaced out, or he was just a jerk at midnight.  The meat here has got a lot of carcass and junk, and the veggie burrito without cheese/dairy, comes with sour cream and chesse, I mean was he \"f-ing\" with me?  Anyways, if I'm hungry enough, sure I'll eat here after the Knockout or El Rio, but Farolito, Castillo, or the Cancun on 19th/Mission are better, if you're still kinda sober and have taste buds.", "author": "EJ K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-01-06", "description": "Great pitstop to El Rio the bar on Mission and Precita.  \n\n(2 stars off for the chips. They are the yellow corn store bought. ) \n\n(1 star off for the \"el crepador\" effect. Sketchy and skivy)", "author": "Juhi D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-03", "description": "The southern-most, being the cleanest, is my favorite, though the one at 19th has the best atmosphere. The food is good at all of them, but everything tastes worse on 6th St. LOVE the pollo asado burrito, and the green salsa too. Tasty breakfasts also. Cheap!", "author": "Jonny A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-19", "description": "Was walking on Mission and trying to decide what to eat for dinner.  The bright yellow-ness of Taqueria Cancun drew me in and despite all the signs blaring about how their veggie burrito is #1, I was feeling the meat.   I asked the nice guy working behind the counter what he recommended:  \"I like the chicken\".  Can't argue with that.  I ordered a super chicken burrito.  I really liked the two salsas that came with it, especially the creamy green one.  The chips WERE stale as many other yelpers have noted.  The burrito was good.  Loved the pieces of avocado, the beans, rice, cilantro parts.  The chicken was just okay.  The flavor was good but some of the pieces were the bad rubbery/chunky parts that shouldn't have made it into the burrito (only a couple).\n\nAll in all, a pretty good burrito.  Next time I'm in the neighborhood and craving a burrito I'd go for the veggie one.", "author": "Raleigh S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-08", "description": "super quesadilla al pastor. I don't need to add anything else....", "author": "stephan c."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-15", "description": "They get 4 Stars for the Chorizo Burrito. I used to live around the corner, and  they'd let me bring my dog in.  I loved everyhting they made!", "author": "Gary B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "this is a reallly good taqueria.\ni live around the block and have been eating there since 6 mos. old.\nmy fave items are the nachos ,the super burritos and the ceviche. \ni don't care what other persons think about this place.\ni'm age 10 and i like it.\n\nwe can smell the cooking beans in the morning when the cooks start to prepare for the day.  no complaints from our street.", "author": "olive l."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-20", "description": "After reading countless glowing reviews from the Guardian each year on this place, I finally tried it. I am now convinced that most people in SF have no clue on what constitutes good Mexican food. How many times have you heard some drunken Marinaite tell you that the restaurant has to be filthy to be good Mexican? Why? So you can get sick? This place is fairly dirty, bad score from Health Dept., but it's really the boring food. Carne asada is dull and rubbery, and the burrito are way too crammed with the overly oniony salsa. A hint to serving chips and salsa: chips from a bag are not authentic, and don't taste good. Keeping the salsa in the fridge where it absorbs all the other stale flavors is not a good idea. Skip this one. Go to La Cumbre, Pancho Villa, or El Toro. La Corneta is awesome as well, and yes my pasty-faced friends, IT'S CLEAN.", "author": "Michael F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "i love them juicy big fat burritos lol, bc that's what they are for me...everything i had eaten from here has been delicious and had made my tummy happy=]. love this place!", "author": "Vale O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-16", "description": "\"This is the ONLY Taqueria Cancun. Most San Franciscans only refer to the first one on \"the mile\" drag of Mission Street. People who think vegetarian burritos are legitimate. ;-)  In my opinion that location has always been a bit overrated, although I do enjoy their Alambres and the classic Ranchera jukebox. Nothing like Lola Beltran belting \"Cuccurrucucu Paloma\" or Vicente Fernandez wailing \"Volver, Volver\" to enhance the ambience of a casual Mexican meal. The Cancun closer to the Bernal Heights side of south Mission is vastly superior in food quality, cleanliness, and general atmosphere. Ideally flavor is the only thing that matters in a taqueria though, and I've never been disappointed by this location's goodies. You can forget about the Cancun on Market Street unless you need to drop in for convenience. Perhaps the issue is size. The less crowded the kitchen, the better the food seems to be in this chain. Let the masses go to the perfectly fine La Taqueria down the street. It has its superb tacos, but if you want a less hectic, less noisy taco/burrito experience, consider walking several blocks up Mission to the Bernal Heights Cancun. It's one of the \"best kept secrets\" of the area.\n\nYes, the chips suck. Oh well. The salsas are very good and the \"entrees\" are tacqueria-perfect.\"", "author": "Dean E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-11", "description": "I got a burrito al pastor here yesterday. Two hours later I had a terrible headache and felt like throwing up. Stayed that way for hours. My stomach hurt and I had a case of Montezuma's Revenge all night and this morning. I'm trying to imagine what they did to the meat that would make me so sick. Disgusting...", "author": "Rich D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "Cancun is great.  Food, space, and prices are good.  Staff could be a little friendly.", "author": "Customer X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-05", "description": "it's shameful that this place shares a name w/ the taqueria cancun that's in the heart of the mission.  the other taqueria cancun is one of the best taquerias in town, while this one is... well... really crappy.  it just doesnt compare.  do yourself a favor and drive the 15 blocks to the other one.", "author": "vlad k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-20", "description": "of all the cancun's. this location is my favorite. its generally the least crowded and hectic and it still comes with the great cancun food. the burritos are pretty hefty and ive never left this place unsatisfied.", "author": "Andrew D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-21", "description": "This place is alright, it has a great decor (gotta love how they pump that Mexican music all night), however the extraordinary really ends there.  The food is truly mediocre when compared to many other taqs in San Francisco.  I will concede that the prices are a little lower than many other Mexican joints, but the food is reduced in quality (by just a little).  Cancun boasts that they have the best vegetarian burrito in the city.  This I will unequivocally refute: While the veggie is well-priced, it is substantially smaller than other burritos around town, and is mostly tortilla wrapped around itself a bunch of times.  It tastes just OK, but Castillito's (in the Loin) veggie is much larger and more delicious.  This place has a lot of hype surrounding it, I guess it is due to its location near a lot of bars.  Drunk people can't tell their ass from their elbow, let alone discern truly quality Taqueria food.  All that being said, Cancun is a fine place to get a quick dinner, but just fine.", "author": "Mr. G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-14", "description": "i don't know how many taquerias i have eaten at in SF.  super carne asada burritos are my thing.  back in the day, Cancun was winning best of the bay so one evening i reluctantly passed up a burrito at el farolito to try it.  i wasn't happy and didn't go back.  years later when i moved to 94110, my wife convinced me to give it another go.  still didn't work for me.  people love, it but for burritos i prefer other places.", "author": "jw b."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-23", "description": "I prefer this to the other location because it doesn't feel as cramped. My friend ordered one of the dinner plates, and while I only took a few bites from it, it looked really hearty and worth ordering. My top recommendation here is the ceviche. Unlike at El Farolito, Cancun's ceviche isn't weirdly juicy. It's spiced just right and perfectly crunchy.", "author": "Joseph R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-30", "description": "I don't like the chairs and decor at this one nearly as much as the one just a few blocks away.  The food is still delicious.", "author": "B B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-21", "description": "since brisas was closed, the next best source of carne asada that the sweetie was having a hankering for was found at Taqueria Cancun. it's true, it's not the same as the one in lower Mission BUT i was happy to find a late-night place where i can get food served promptly and the peeps were super nice. the burrito mojado was scrumptious though the meat was a tad dry. the sauce was mole-esque and not in a bad way.", "author": "ray e."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-09", "description": "at 2pm or 2am their food is pretty good.  a little too spicy for my white girl taste so, if you're like me ask for everything to be mild. and i mean EVERYTHING. the tacos, burritos and nachos are all hella spicy.  and no, i did not eat all of these in one sitting.  extra star for the fabulous beer selection.", "author": "Ms. M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-30", "description": "Love the Chicken taco salad, chicken nachos and burritos. The inside is very cute and lively and the employees are all really friendly. Very inexpensive compared to a lot of places. Very clean too.", "author": "r e."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-13", "description": "everyone has their favorite cancun.  well this one is mine.  not sure why but it just is.  that green salsa kills me but i love it.  i try to get the chorizo and eggs whenever i come here.  the burritos are decent.", "author": "a g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-16", "description": "if you want to try the amazingness that are cancun burritos go to this one, not the one at 19th and mission. this one is relaxed, cleaner and doesn't have bums. plus you can sit at your own table. always quick, always delicious. easily my favorite burrito in the city.", "author": "Dan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-08", "description": "cancun would be mediocre, except that they have legendary al pastor. the horchata is also pretty good.", "author": "Katherine S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-05-04", "description": "quick run before you get the runs......i broke out in a cold sweat and now i have a permanent eye twitch....stay away", "author": "Roger T."}
