{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-22", "description": "Amazing, quick, & friendly service! After a hard day at work I needed some sort of drink and for the train ride home, coffee it was! Decided to try Tazza and I was not dissappointed. I got their monkey mocha and it was so yummy! Definitely made my long commute home just a little bit better. I also loved this sign they had posted at their pick up window. 10/10 totally recommend!!", "author": "Alexandra S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-13", "description": "Right inside the Caltrain station so convenient to grab and go. I got a hot chocolate and a breakfast sandwich which were good. They also serve burritos, wraps and pastries.", "author": "Sunil R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "Great service, great smiles from the staff, latte was creamy, and the Ginger Almond scones rule.\n\nInside the station, this little corner caffeine stop offers everything one could imagine for their early shot of espresso or sweet tooth if it so beckons.\n\nGood selection of baked goods such as scones, muffins and pastries.  In fact, so much so that I bought out their entire selection of Ginger Almond scones (full of slivered almonds throughout the scone, not just on top) to bring to the team  :)\n\nThanks for making my grumpy pants commute better this morning!", "author": "Miika M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-09", "description": "I only come here because options are limited in the station. They constantly up charge, once they were out of an item so they recommended a replacement. I asked if it was a similar price and they said yes, but it was much more. They will offer add ins without telling you it costs more. For example, I ask them to leave room for cream. They offer to add it in for me and charge me without telling me. After coming here every morning, one day I asked for tap water and they said they'd have to charge. I saw them try to charge a homeless woman for asking for tap water. My biggest complaint is from what I consider dishonest or bad business.", "author": "C. L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Great service and friendly people! Better quality food and coffee than any other café in the area.", "author": "Robbert Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "There are some mornings (well actually, most mornings) where human interaction and productivity cannot happen until sufficient caffeine levels have been reached. Throw commuting on Caltrain into the mix... And you have a business! Tazza is one of these businesses that have popped up inside the Caltrain station, and they have kept me alive many a mornings with their simple but quick service.\n\nOf course, it's just a little stand in the middle of the station. No seating like a coffeeshop. The barista at the window will hand you a cup to fill with coffee if that's all you desire. There is also a variety of pastries in the window to provide sweet sustenance, but they're not very good from my experience. The cheese danish has made my stomach churn on Caltrain, which is a terrible feeling.\n\nOverall, Tazza gets the job done. I would only come here if I was taking an early train and didn't have time to make myself coffee at home. Seems like it could be a regular morning ritual for many. They do have a good set of coffee brews, and I like that it's mostly self-serve, so kudos to the existence of this place!", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Not only do I love the fact that this place offers $1 coffee for a quick pick-me-up, but the fact that they provide friendly, genuine customer service. I truly appreciate this coffee shop for the nice management and staff, and I've been a frequent visitor for years. Thank you!", "author": "Stephanie H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "If you need to catch a train but want to grab a quick, but tasty, coffee and breakfast, this is the spot! Really good breakfast pastries and coffee on the quick!", "author": "Andrew M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "I started visiting this cafe inside the Caltrain station for a quick $1 cup of coffee (where else can you find that).\n\nOver the weeks, I discovered that the staff and owners exudes kindness and positivity. That is just what commuters need to start their day, in addition to a delicious sandwich, pastry, yogurt, or iced coffee. (Or if the day is ending you can grab a glass of wine or chocolate around the corner.)\n\nBeyond the nice folks running the place, it feels like a slice of a world-class train stations in Europe, including the tasty croissant.", "author": "Steve P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "Having a super slow start to my morning and being totally grumpy about my internet connection on my phone not working, I jammed to get my caffeine fix at Tazza D'Amore.  I absolutely love the Kona Light Roast as well as the awesome service.  I am even more excited to find out that this place is gay owned..  .. as a very OUT trans-woman, my money is going to this joint.  (Plus, the owners are waaayyy attractive)", "author": "Amanda M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Tazza D'Amore! Definitely a tiny gem at the 4th & King Caltrain station in SF. Since my college days, I've enjoyed stopping here after riding to the city from Palo Alto, and I'm pleased that they are still going strong.\n\nOver the last few years, I've tried many of their pastries, snacks, and a couple of their coffee drinks (I'm picky, what can I say). Among my favorite things to grab here are either the turkey and cheese or spinach croissants. I always look to see what the seasonal lattes are - those are always fun and more unique than what's typically offered at your standard coffee shop.\n\nThe staff at Tazza deserves a special shoutout for their incredible efficiency - I have never waited longer than 60 seconds for a drink to be made or a pastry to be warmed. The quality and the flavors are always great. Wonderful little place!", "author": "Yasmin S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Truly wonderful people work here. Very positive vibes. Great self-serve coffee that starts at $1 per cup. Buy 8 coffees, get one free! Nice way to start the morning.", "author": "Joseph B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-06", "description": "3.5 stars\n\nAs someone who will say \"yes\" to coffee 99.32% of the time, Tazza D'Amore is a welcome addition to the SF Caltrain station. I've gotten both hot and iced coffee and generally been happy. Brew is self-serve, and there is a variety of milks and spices out for you to use.\n\nMy friend got the chai and couldn't finish it. She said the spice was overwhelming, and she usually orders an extra pump of chai anywhere else (here she didn't, and it was too much already).", "author": "Nic Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-26", "description": "Too many raisins. Way too many raisins.Don't say I didn't warn you. The raisin to muffin ratio was way too high.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "I love this place. They have the best pumpkin spice latte in the entire city -- I'm serious. They are always very quick and are extremely friendly. I can't recommend them enough!", "author": "Erica J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-22", "description": "Super convenient for the train, being that it's right there at the station, swing by, grab breakfast and hop a train. Perfect...\n\nOnly the line was long and disorganized. People were ordering and then just standing at the counter waiting for their hot sandwiches. My croissant (my breakfast pastry weakness) was not buttery and flaky and I would expect, instead it was like eating a bread roll. This alone is enough to make me not spend my money there anymore.\n\nI never even tried the coffee but I would recommend spending $1.25 at the newspaper stand next door or bring a to go because waiting in an unorganized line when you have a train to catch is just frustrating, even more so when the product isn't even all that great.", "author": "Sarah S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "Skipped breakfast because you didn't want to miss the Caltrain? Look no further, Tazza D'Amore is there for you! They have a variety of hot breakfast!\n\nI waited in line briefly. I would say about 3-4 minutes. The egg & cheese bagel with bacon appealed to me at that time so I ordered that. The employees here were friendly and efficient, in my opinion. \n\nOf course, having it made hot and fresh, waiting was expected. 5 minutes was acceptable enough for my edacious self to meet and greet my long-awaited bagel. I also bought a Naked smoothie (strawberry) to give my energy a boost. I'm not a morning person so I have to adjust my circadian rhythm to be in favor of my new ventures in the city.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "I love great customer service especially the first time going somewhere & they gave just that. & my food and espresso was bomb.com.", "author": "Jenn J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "I am a big fan of this little coffee shop located within the CalTrain Station in San Francisco.  This is truly a little gem within the station and after a long day walking around the city-you will need a little pick me up before the train ride back.\n\nThe coffee prices are on point with Starbucks and Peet's.  Yes-you kind of hope that a normal cafe latte wouldn't be $3.50 since its really simple to make.  But the barista there was super friendly and had a variety of flavor to add to my coffee and when I said dealers choice-he truly surprised me with a concoction he made.  My parents who tried my coffee LOVED it and changed their orders to the one I had.  The barista was super kind and didnt charge them for the change-which made my dad give him a big tip for the quick and kind service.\n\nNext time I am back in town and needing a quick cup of coffee-I will make sure I stop here!", "author": "Angela W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "I love this place, try to stop by as much as I can on the way to work. Their vegetarian burrito and mocha (which are the ones I've had till now) are amazing. (About me: I'm a picky eater and being vegetarian only narrows eating options outside home.) That bein said, I've spoken more of this place to my friends back home than the rest of San Francisco. I look forward to trying out every item on their menu. Highly recommend this place!", "author": "Jaishree V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "I came to the City from San Jose on a Saturday, to finally see the Chinatown Chinese New Year Parade. Right off the train I had the best latte with amazing, thick foam!! Great service too!", "author": "Rita M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "These guys and gals take pride in the quality of their shop and it shows! Quick moving line, very efficient.  Lots of smiles as they work, and it's contagious. I'm a bit grumpy in the AM but even I can be caught smiling a little at some of the funny signs they put up for various holidays :) I really like the delicious sandwiches they get from a local deli, especially the tuna with sprouts. This place is an asset to all of us rushed coffee drinking commuters. Thanks guys!", "author": "C S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-04", "description": "Daily ritual before boarding a Caltrain. Great team, fantastic service. My coffee is often ready before I order... Astonishing!", "author": "Lukas B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "I'm picky about my coffee. This place is great!  Also Marcus and Alan and the whole staff are always so happy and chat a bit no matter how busy. It's my new habit.", "author": "Allan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-09", "description": "Can't say enough about how great this little cafe is! Yesterday morning, amongst the hustle and bustle of the 630am train, the CC machine went down. After 4 hrs of sleep...that coffee and sandwich was about to give me life. \n\nBy the time I found an ATM and made it back to line, the sweet barista had seen me getting money out and had already made my order so it was shot and ready for me on my return. \n\nIt made my entire day! It's the little things that make a huge difference! Been to this cafe everyday this week, you won't be disappointed :)", "author": "Melina R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "As I look down at my watch with two minutes before my Caltrain's departure I start to have doubts as to whether Tazza D'Amore can once again deliver. They do, as always, and whip up a delicious latte for me as quickly as ever. This coffee shop is my go-to everyday for my morning commute and their service is impeccable. They are super cognizant of the fact that most people are trying to catch their trains and have a very expedited line. My favorites here are the banana bread, which is super soft and flavorful, and their special strawberry cheesecake latte. Other things I've tried, like regular coffees and lattes are also on point. Everything is always delivered with a smile as well, which makes for a great start to the day.", "author": "Heather L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "It's super cute and the non-mainstream option compare to its neighbor, Subway.\n\nUnfortunately, the burrito was tiny in comparison to my hunger and it seemed premade.  I could be wrong but it wasn't super fresh tasting.  The texture was like its been reheated.  You can easily confirm for me since you can look into the kitchen area.  I was sleepy and just ordered and grabbed it when it was ready,\n\nWhen I unwrapped, the size was disappointing and when I bit into it, I was disappointed again.\n\nI will go to Subway next time for food.\n\nService was super friendly though.\n\nSuper convenient location in relation to Caltrain.", "author": "Phillip N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "LOVE it here ! Been there in the morning and afternoon! They have food for all three meals (and snacks in between) throughout the day. SUPER friendly and professional staff. They definitely know how to take care of you. I've never witnessed such QUICK and EFFICIENT service anywhere else. Always greeted with a friendly \"hello, dear! What can I get for ya?\" And given my food with a sweet \"thank you, have a great day!\" Pishhh, I know I don't get that at Starbucks....I definitely recommend this establishment to anyone looking for good food and great service when traveling to SF by Caltrain or etc. \n\nPlus they have a tendency of having good looking people work there ;)", "author": "Amanda N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Friendly staff and great coffee. It's very much different to what I expected from a coffee place in a Caltrain station. \n\nThe (double) espresso always keeps me going.", "author": "Dario S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Cute little easy in-and-out place in the SF Caltrain station. Grab a muffin, grab a coffee, and you're on your way.\n\nI don't know that I'd go so far as to say that the pastries or coffee are exceptional, but they're as good as other places and it's WAY convenient.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-12", "description": "The coffee here is a hit or miss. Once in awhile I get my morning coffee here and if I do, I usually get drip coffee because it's quick and easy so I can jet right off to work.\nI've had coffee from here where I'd drink the whole thing and be SO thankful this place exists. SF does get so stinkin cold especially in the mornings. However, there were times when I took a couple sips and had to throw the thing away because the coffee was so awful. Those times, it was so bad I would rather be completely cold, miserable, and super grumpy. In general, I only come here when I am desperate for a caffeine kick.", "author": "Michelle T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-13", "description": "No frills, quick / efficient but not-unfriendly service - decent coffee / croissants for your train out of the city!", "author": "Michel P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-31", "description": "Tazza D'Amore is everything that a commuter cafe should be - unbelievably speedy, good coffee, and a smile in the morning.  Two stories I tell to friends about what a gem this place is:\n\nWhen I showed up one day with one minute and thirty seconds to catch the train, I still was hoping for a coffee.  I ordered a coffee and was so clearly in a rush - Tazza hurried my order and got it out in time - I got onto the train, coffee in hand!\n\nThen, when I changed jobs and stopped by Tazza D'Amore for the last time on the morning trek, I sadly told them I wouldn't be seeing them again.  Allan came right up and says 'then today's on us.\"  \n\nWhen was the last time Starbucks rushed an order for you, or was sad to see you go?  Long live Tazza, and its cups that say \"it's a medium, not a grande.\"", "author": "Ben K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "This place is a hidden gem in the train station. This is the best coffee in the neighborhood with the best pastry selection! The staff is always on point, efficient, and friendly. Try a refreshing watermelon and lime Italian soda. I love this place!", "author": "Wolf H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-15", "description": "It's food. It's coffee. It's fast. Satisfies your fix. Don't expect much. Have time? Go to Philz.\n\nLow quality ingredients. Not fresh. It's edible. \n\nCoffee is amateur hour (in SF? GTFO!) with what tastes like store bought, off the shelf garbage.\n\nCustomer service is \"hurry up and order and get out of the way\". If busy, cool, if not, no need to be a jerk!\n\nA shame really. Has serious potential. Could be drastically better with a few easy fixes. I'd gladly pay more if they lived up to it. \n\nIf you want to understand how it should be done, check out La Stazione at the 22nd Caltrain station. Among the best coffee in the city, ultra high quality ingredients and actually cheaper than this place.\n\nEdit: In response to management\n\n1) Fair enough. \n2) Sorry man, not happening. This is a very spoiled city in terms of coffee. Yours is what it is, and wins because of convenience. \n3) I'm one of those who's thanked you. I often take a later train (no one else ordering) and still get the same attitude almost every time :(", "author": "M B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-15", "description": "Customer service and the food is terrible.  The cashier had a difficult time trying to figure out how to put egg and cheese on a different type of bread.", "author": "Melissa J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Super fast, super convenient and their coffee is amazing! The only place to grab a cup before you hop on the train.", "author": "Michelle K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-09", "description": "Frankie and the crew here are amazing. I've been starting my work day here for the last 4 years. Despite the craziness that can be Caltrain rush hour, these guys are always smiling and hook me up with my coffee and breakfast just in time. Thanks for all you do, team!", "author": "Trey F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-05", "description": "Great place for some good coffee . Love the Owners here, Awesome customer service , that  keep me coming back for more. STARBUCKS !!! Smh??? You can shove it . Hahahaha", "author": "Braddah Rick M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-25", "description": "Can't touch this.\n\nIt was an impressive feat. She took my order, money and then made my egg beater and chicken apple sausage on a wheat muffin without touching the food. Nice work.\n\nFirst visit featured a Sonoma Muffin Works turkey bagel dog (quite tasty), sugar-free vanilla Americano (enjoyed but could have used a stir) and granola cup.\n\nYogurts are available to make the last one a little more interesting.\n\nMust have a loyal following as they've been in business since 2003. Friendly staff must have something to do with it. \n\nOtherwise the food is good but not too memorable and priced a little steep. Breakfast sandwich was almost $6 and the microwaved bagel dog $5.\n\nCaffè D'A-OK.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "Needed a coffee after they had just closed. They were nice enough to serve me.  This is the kind of service you won't find everyday.  I really appreciate how friendly they were here.  The coffee was great too, just had a simple iced coffee, but I feel that the simple drinks really say more about a cafe than the drinks full of sugar.  Just a note though too, they don't open for the late trains leaving the station so just keep that in mind!", "author": "Bryson L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-17", "description": "Shout out to their great service and efficiency! The woman who usually works on weekday mornings around 7 am is always so happy and pleasant and has a personalized compliment every time I get to the register which makes for a great Monday morning start to the day! :)", "author": "Victoria P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "I usually get one of their unique lattes on my way to the office. Super tasty and the staff is always very friendly. Definitely recommend stopping here before/after a Caltrain ride.", "author": "Christian L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-17", "description": "This place is conveniently located at the Caltrain station, which is no doubt why they have repeat business. They're generally friendly/nice enough to get through a transaction and the food is the typical coffee shop fare with a few hot food items. \n\nThe other day, my last day as one of their customers, the owner(?)/manager(?)/whomever he is felt the need to teach his new trainee to blame a customer for their swiping mechanism being temperamental. Every other transaction on the register has to be double/triple/quadruple swiped and out of frustration dude takes it upon himself to tell me that I need to replace my card in a not so friendly tone. \n\nNow, if my card had issues being swiped at other establishments I would understand his advice and most likely would've already handled up. Like I actually WANT to have a card that has to be manhandled to work. Instead dude has the audacity to suggest to me, a customer, that I need to inconvenience myself and order a replacement bank card because his machine can't swipe it the first time. Poor customer service, period, dot. \n\nThe first line of my review speaks volumes. And if you're hungry, why not?", "author": "G. T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "Perfect place for a morning pick me up after the commute. The people here are so so nice and the service is very prompt. I love that service always comes with a smile and that soy milk is available for your drinks.", "author": "Judy L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-04", "description": "Just stopped in to buy a cup for water on Labor Day. \nDude was alone and not happy. \nI knew I hadta pay for a cup cuz nothin's free in this life. \nHe charged me $1 for a plastic cup!  \nOh well. \nCome prepared I guess.", "author": "Aureliano C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "*chai snob alert* I am sadly super picky about my chai which usually results in me making it at home. I decided to give it a try here, and it is such a great thing to know if I'm running late I can stop by and grab an perfectly spicy/sweet chai tea latte. The service was a perfect blend of fast and friendly. Breakfast burrito is quick serve, fresh and filling. Alan (had to be the manager) was having such a great time and had me smiling even at 8 am. I'll be back for sure.", "author": "Brittany M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "Very good at what it does, which is being incredibly efficient at providing Caltrain commuters with coffee and light menu items (muffins, bagels, and easy to heat items like pre-made breakfast burritos). Though the lines may look long, the wait never is--this is a fast business in a city where I often find service to be infuriatingly slow. \n\nMy only complaint is that the quality of the food varies, a lot. I generally like the muffins; the egg and cheese bagel sandwich is solid. The scones (and sometimes the muffins) are usually too dry and crumbly. I did not like the breakfast burrito at all. Over time I've stopped eating there as much, so usually I just buy coffee unless I'm seriously hungry. \n\nIt's not gourmet; this isn't a place you seek out. You go because it's there, its prices are very reasonable, and you have 10 minutes before your train departs.", "author": "Stuart S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Their coconut mocha lattes are to die for.", "author": "Sophie P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Tazza d'amore...cup of love indeed. This morning, I made my typical order (coffee + egg white sandwich) and happened to notice that the egg sandwich maker was literally poised to pour the egg whites into the baking dish. He remembered my order and was ready! It was amazing. \nThat's why you don't go to Starbucks folks! I see the same smiling faces everyday, and unbeknownst to me...they remembered mine too!", "author": "Megan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "I love starting my morning here.  The Tazza d'Amore crew is always so friendly, and it's awesome to see how well they all work together to get me my delicious latte on time before my train departs.  If there's no time for an espresso drink, I grab a cup of their brewed Kona coffee.  Memories of Hawaii stream through my mind as I commute to work.  Thanks, Tazza d'Amore!", "author": "C C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-29", "description": "This is the place where I start all my week mornings, before hoping in the train. Both, the coffee and the staff, are great. \n\nHighly recommended to all daily commuters or anyone in the area.", "author": "Rodrigo K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Food is good. Better-than-average train station food. These are the nicest people you'll ever find in a train station, though. All of them are exceptionally friendly.", "author": "Dan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-28", "description": "I've been here the past two mornings, having run out of time to make coffee at home (maybe not snoozing my alarm would help, haha). The staff have been friendly and pleasant both times. \n\nYesterday I asked one of the guys (I think he was the owner?) whether their chai mix was from powder or syrup, and he explained that it was actually made using an organic chai concentrate. I was impressed that they cared so much about their drinks that they would use top quality ingredients, even though it must cost them more. The soy chai latte I had was absolutely delicious, by the way. I've also tried the cherry nut latte; the flavoring was well-balanced to compliment the coffee. I am looking forward to trying another of their options today (coconut latte, maybe?).\n\nYou'd think a coffee shop at a train station would not care too much about quality, and just take advantage of often being people's only option. But that does not seem to be the case here. This place has turned out to be a very nice surprise, I would definitely recommend it over the chain stores in the surrounding blocks.", "author": "Dee R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-11", "description": "I love how friendly the folks are here, with the mad morning rush at the Caltrain station. They are super quick and I haven't had a poor experience or mocha in the last three years commuting. \n\nAlso, great breakfast burritos at a reasonable price!", "author": "Deepti A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "It was my first time in years taking CalTrain and I have to admit my recent years in SF have made me a bit intimidated by unfamiliar public transportation, but the delicious zucchini bread at this little coffee hut in the station helped assuage my fears! Thanks for the friendly service, yummy baked goods, and something to keep me occupied when I get to the station early and don't have anything fun to read!", "author": "Christina P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "I pass by this place every morning, and sometimes I need to stop by to get myself a little bit of coffee or something quick to eat. Although the self-serve coffee isn't always the greatest, it helps to get the $1 bullet in the morning for a quick wake-me-up. They also have a very tasty spinach and cheese croissant, which I highly recommend.\n\nThey also have pretty good service, especially when there is a line and it comes close to boarding time for the train. If you have cash, and you're just getting coffee, they don't make you wait!", "author": "Victor R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-23", "description": "This review was for their food specifically. \n\nI already had a coffee and just wanted to grab a quick breakfast. Ordered the turkey and cheese croissant. They warmed it up. The outer cheese seemed so old, it didn't even melt. It just hardened and took solid shape outside of the croissant. The turkey expiry was also very questionable. The edges of the turkey were hardened as well. I took about 3 bites and then threw it away (I hate wasting food, but it was inedible). \n\nTake the effort of crossing the street in almost any direction and opt for something fresh elsewhere.", "author": "Natalie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Hey running this business is no walk in the park, I'd imagine a majority of their customers are in a major hurry, and they do a really good job keeping up. I visit a couple of times a week, and am writing a review because I find that these folks consistently make an effort to meet their busy clienteles needs. Finding a disgruntled customer or two at a bus depot or train station as you can imagine is probably not too hard to find. But my own personal experience points in a very positive direction, so I thought I should take a few minutes to share my opinion.", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Really wonderful service! I can't overstate how much I appreciate how fast and friendly they are when I show up every morning, bleary-eyed, half asleep, and about to miss my train. I love their over-the-top holiday decorations for every holiday (complete with costumes and entertainment!). And their iced coffee and croissants can't be beat. These guys are truly a pillar of the Caltrain community.", "author": "Sophia C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Was in SF for the weekend and came across this unique little gem. The coffee here was fresh and tasty. The staff were so friendly. The owners were there and took the time to answer all my questions about how they started their coffee business. Great guys with a great story. I loved this place and will visit it every time I'm in SF. Wish there was a Tazza D' Amore in orange county.", "author": "Denise M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "Was in San Fran this weekend for a girls weekend stopped by this little coffee shop at the train station, what a great place with great coffee we all tried something different and loved it all. They also have pastries and sandwiches the people working there were so friendly and happy.  Will for sure stop back in next time I'm in town.", "author": "Anne P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "I visited SF this past weekend and stopped by for an iced Americano at this café...the owner/managers were working, ensuring that my coffee was absolutely fresh...super friendly service, great fresh coffee!  My Danish was delicious.  I can tell that they LOVE their customers and their café - what a great example of the many wonderful and unique small businesses that the city of SF supports!", "author": "Chris G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-30", "description": "Nice customer service from the lady making my Bagel today made me feel good in the early morning when people can be moody and nice bagel good quality of breakfast better then Subway next door.", "author": "David R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-17", "description": "I asked for a tea latte and received a plain tea eith water by mistake. But when I asked them to fix it she just dumped soymilk into my tea...\n\nI also received a cold croissant. Know that they like to be fast but it would be nice if you heated the pastries before hand or at least asked me about it. \n\nWith that being said love that they're really fast and usually don't mess up if you ask for something normal like coffee or mocha.", "author": "Vivian J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-06", "description": "Much like David E.'s review, the cashiers who run the register here have attitude problems. They clearly don't like people standing off to the side trying figure out what they want as we decrypt their menu written in both clusterf#%k and chicken scratch. I have also noticed the manager just stand there on many occasions like an overseer and condone the behavior. Then again, when your life choices for employment limits you to a coffee shop frequented by commuters and tourists I would probably be jaded also.\n\nI've had coffee and breakfast sandwiches here and the quality of the food wasn't terrible, so I can't completely one-star these ...charming individuals.", "author": "Terry C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "This coffee shop makes my commute to the South Bay even better. I love the food, the people, and the service. Check it out.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "I've been going to Tazza D'Amore for years and they have the best coffee in town. I absolutely love my regular coffee in the mornings before catching my train. Awesome customer service and they really try to get things out quickly. \n\nThe employees deal with people trying to rush them every morning, and I just want to tell those people to chill out!! \n\nThanks for being my favorite cafe in SF - Cheers to Tazza D Amore", "author": "Alan A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-09", "description": "3/29/11 Update: Queen of the douche bags.  Perhaps not texting while taking orders would help you hear what your customers are ordering.  Seriously - you run a coffee shop - drop the attitude.  Better coffee and nicer customer service at Philz or Creamery folks. I've ordered my last cup lady. \n\n\n\n\nDecent coffee for you morning commute. Efficient? Yes -  great costumer sevice? No. Try being less of a douche  in the morning cashier boy. \nSnapping at your customer saying he should know the type of sandwich he wants before getting to cashier - really? How about wiping off the glass so we can see  inside?\nOr getting irritated because an older guy took the wrong size coffee - um - you put it up there idiot. \nAll this is 3 short minutes. \n\nSeriously - get over yourself and get my coffee!", "author": "David E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-27", "description": "friendly service. great place to grab a coffe when you're getting on or off a train.", "author": "Pani P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "I have been more of a regular here since I am always late for my train.\n\n5 stars for location, and quick service.  But it gets bumped down...cause you get processed like a machine.  And their $1 for a cup of water is annoying. I take bike share to the station.  Sometimes I want a glass of cold water. When I have time I go to Starbucks and get my coffee and water there.  They do it at Starbucks with a smile.\n\nI was going to jump onto Yelp and give a 4 star review.  An improvement over my last one...cause they do quickly take care of my coffee fix in a challenging setting.  Trains to catch, tiny space. Never a smile or friendly comment...but it is a stressful little hot space to work in within the train station.  I get it.  But before I post, there I see a response to someone else's water complaint.  Management responds that there is a water fountain around the corner.\n\nReally?  Is a 10 cent cup worth making customers feel unappreciated?  Cause in general, that is how I feel here. Maybe when you give me change, say thank you and smile.  \n\nAttitude in a work place is contagious.  Based on the response I saw from management....it pretty much verifies why employees dont seem to enjoy working here.  If it wasnt for the location this place would be broke.  I hope that management makes some changes. Stop being outshone by the large chains down the road.  Connect with your customersn. Let them know you care. And stop tripping over dimes and missing the dollars. \n\nManagement - I want to give you all my coffee business.  I dont, cause the Baristas at starbucks call me by name. They smile. They give me water when I ask. In a nice big cup with ice in it.  They connect.  And they give me coffee rewards.  I can live without the rewards. But do the first three,  and as a local business with a great location - you will have all my morning coffee business.  Some $1,000 per year.  Or keep up your current style.  And Starbucks will keep the bulk of it....", "author": "John D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-25", "description": "Coffee - check. Scone or almond crossiant - check. Egg bagel options - check.\n\nNot sure I need anything else before I get on the train in the am. I'm a fan. My only improvement would be the way the creamer/sugar is in the corner and it seems to get a little crowded sometimes. But then again, maybe I just haven't had my coffee yet?", "author": "Michele A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-29", "description": "Got a breakfast sandwich on a wheat bagel with eggs, pepper jack cheese and sausage with a  coffee while waiting for cal train. I would totally get the coffee again (yum!) but not the hugest fan of the bagel sandwich. It would be better on an english muffin or something. Fairly priced though and fast!", "author": "Heidi J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "I find this place pretty convenient. Right inside the caltrain station and I would prefer to go here instead of the nasty subway or cross the street to safeway. The baristas are friendly, they accept creditcards and have some nice pastries. The coffee is so so but they give a pretty good selection for being a small coffee stop. Nothing fancy just simple. The sandwhiches can get a little soggy so I wouldn't recommend them but everything else is pretty good.", "author": "Greg G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-24", "description": "I find the staff very rude and inconsiderate. After being a tipping customer on every purchase for about 6 months I still find them asking and refusing service when I'm short a dime forcing me to pull out my credit card for a $2 purchase.\nThere are other situations that were rude as well and I didn't feel they value the customer.\n\nThere are many other places along my daily commute that will get my business from now on.", "author": "Raymond A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-10", "description": "This coffee kiosk rolls up it's steel door every morning @ 6am to greet eager Caltrain commuters.  If I want a quick and easy cup of coffee I hit this counter, but if I'm wanting good coffee look elsewhere.  I recommend the mint/blueberry scones however!", "author": "H H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "This place was just around the corner from our hotel, and offered up good coffee w/little frills. \n\nThere's not much room inside (2-3 small tables), and the pastry selection lacked - altho they did have a cheese/fruit danish as big as my face on display - but the latte & mocha we ordered were both VERY tasty, and we sat at one of the tiny outdoor tables and people-watched in the rain while we sipped our drinks. \n\nIt's definitely a \"to-go\" coffee place as opposed to a \"sit & sip\" place, but it was good, and I'd go back.", "author": "Amie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-18", "description": "Finally given up on this place. No matter how many times I ask for soy, they always use regular milk and my insides die a little. No more.", "author": "S .."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-06", "description": "One person manning this little shop so it is a bit slow. 3 stars all for the quality of the drinks. I love my caramel macchiato was delicious! Even better than Starbucks. Both hot and cold was great! 50 cents cheaper than starbucks!", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-06", "description": "Like this spot. Efficient and friendly service, even in the busy morning commute rush hours! You must try their Milky Way mocha and chocolate cheesecake muffins!", "author": "Page D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-06", "description": "Frankie is always quick with orders and the coffee is good. Very convenient since I ride Caltrain to and from work.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-06", "description": "coffee was gross....  only go if you need to for the convenience.\n\nphiz coffee is around the corner. just fyi.", "author": "Steven F."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-24", "description": "Just to be clear, I've never bought or tried anything here. But I have dealt with an employee and I think customer service says a lot about a small business, especially in the city.\n\nGiven one star, obviously my experience was a bad one.\n\nSo I take the train quite often and one day after work, I had a salad, but no fork. So I stopped by to find a worker talking to his friend. I made sure to grab his attention and asked if they had a fork I could have. Before he had a chance to answer, I even offered $0.50 for it. The funny thing is, his friend was even looking around repeating to the employee that I needed a fork. Meanwhile, the employee told me that they were closed (not even a sorry). I responded by saying that I know that they are, but if he had one handy it would be cool. He said that he had to clean-up and that I should look somewhere else (pointing at Subway). I understand they are closed and yes he was taking his sweet ol' time chatting it up with his friend and what they talk about is none of my business. I understand this, but why not be a nice guy... reach over and grab one for me. What happened to generosity? It's not even a feeling of entitlement. It's about being a nice guy.\n\nWith many fantastic cafes in the city, why would you want to support a local business that isn't friendly. If you like their coffee or pastries, great, but if service and just being a good person means anything to you, I don't know if you will find it here.", "author": "Chris Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-12", "description": "My friend and I got thoroughly soaked while wandering about the city today, so we were both craving something warm for the Caltrain trip back to San Jose. I had an almond mocha and we shared a lemon scone. My drink was pretty yummy, but it tasted a bit funny to me. I'd blame the almond syrup, though, and not the store. I'm sure I'd find a favorite drink after a few more visits, which I'm sure I'll make if I get up to the city more often.\n\nI dunno if I'd go out of my way for this place, but for a quick, warm drink for the train ride home, this place seems to do the job.", "author": "Chris C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-24", "description": "Decent espresso drinks, but they won't make the top ten list of anybody who knows what they're talking about. No, the real draw at Caffe d'Amore is that they get their pastries from Il Fornaio bakery, and that means BIG FREAKING SCONES the size of a Caltrain ticket-taker.\n\nFor $4.95 you can get the Breakfast Value Meal - double latte and a blueberry scone. Ok, I made this name up, there is no special price for these two items together, but I've gotten it a zillion times and it's comforting know to know a fiver can still buy you 1,500+ calories. And not some bullshit Latte Express calories, like kinda-hazelnut-flavored coffee and sketchy apple fritters or something. We're talking QUALITY espresso and QUALITY carbohydrates, all buttery and crumbly and sugary and blueberry-y-like.\n\nIf you're still hungry on the way home, you can swing back by and check out the other scone, Mister Cranberry Almond. This one is also quite tasty but a bit more subtle, mainly because it doesn't have powdered sugar covering every square centimeter. Pastries are two-for-one in the late afternoon, so there's dessert for you and that special someone! See if you get that at Panera. (Maybe you can, I have no idea.)", "author": "Dave P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "Caffe D'Amore\n\nThis place is in the Caltrain Station where I catch the train on my way to work.  So this is one of my regular early morning stops to get a bite before the train ride.  Usually I get some type of Danish or Breakfast Bagel with Egg and Cheese and Ham along with an Orange Juice or Green Tea.  Staff is friendly and tries to hurry up if they see you are trying to board a train that will be leaving soon.  Very much appreciated, will continue to have my support as a customer.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "As a CalTrain commuter, I've been buying my morning cup of coffee at Caffe D'Amore for several years and am grateful that this convenient little coffee shop has such a friendly staff!  \n\nI've seen them treat even the most indecisive, demanding costumers with kindness while managing to keep the line moving (which is crucial for those of us who need to catch a train!!).  \n\nI've never ordered their food (only because I eat breakfast at home), but their coffee is excellent for its price range.  While there are high-end coffee shops nearby with premium, individually brewed cups of coffee (e.g., Philz), premium products demand premium prices and more time to prepare.  Caffe D'Amore is quick and efficient, perfect for rushing commuters!", "author": "Samantha M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-26", "description": "This place is overpriced for underwhelming products. I have tried the scones, the muffins, and everything tastes like it came out of a box (which I'm pretty sure it did). Not only that, but my scone was overpriced considering it just came out of a box. I used to buy stuff here every so often when I would forget to make yogurt, but a few weeks ago I came to my senses. I DON'T like their scones, or their muffins, and there isn't anything comforting about having to pay more for something I dislike. I don't think I'll be back here.", "author": "Angeline P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "Wow. Tonight's experience was really disappointing. The woman working apparently had an issue with the customer in front of me, who was a CalTrain employee. She was yelling at him, telling him he was being disrespectful, and making a huge scene. She even continued to yell at him as he walked away, and then apologized to me for HIS behavior. Seriously, the only one being disrespectful was her. It was appalling, and quite uncomfortable for me. If she were my employee, she would be fired. Absolutely unacceptable. I will not be back.", "author": "Sandy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-27", "description": "I decided to stop by here this morning as I was lazy to go anywhere else and pressed for time.  :) This will be my new place to stop for a mocha with soy from now on to and fro on the Caltrain.  Yum!  The mocha was chocolate-y just right and sweet to perfection, and plus, the guy at the window was smiling and friendly - nice to start the morning that way!  I'll be back!!", "author": "Maile N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-09", "description": "When I don't have time to run into safeway to buy a breakfast for the train, this is where I come for a bagel and cream cheese, and if I'm lucky orange juice. Is it just me or have they been out of that way too often lately? What they have going for them is location and speed, but, and this is really a personal gripe, that little packet of cream cheese you throw in the bag with my bagel, it is enough cream cheese for maybe half my bagel. \n\nAll in all, I'm thankful this place is here, but I think that they should really be more accountable despite their lack of competition.", "author": "Allyson S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-18", "description": "With just 5 reviews, how did they get the \"Yelp loves us\" decal?\n\nFinally have a few minutes before hopping on the train and decided to grab a drink.  Got a small cafe au lait ($2.05) and was surprised to find a cup given to me with just hot milk and a bit of foam.  I am expected to add my own coffee they have out, which I find a bit tacky.", "author": "Gloria H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-01", "description": "Small coffee and pastry stand inside the caltrain station, next to subway, As I was waiting for Muni to arrive I figured I'd break the rules and get a chai to go while on my journey. We all know how slow it can be sometimes (why am I always stuck in front of that damn tunnel?) so I wanted a beverage to accompany the trip. As I was waiting for my beverage one of the girls asks me if I want a peanut butter cookie. Huh? Turns out if they pastries break in any way (this was literally a small chip) they're not allowed to sell it. So not only did I get a pretty tasty chai, I got a free cookie to boot, making my slow ride on Muni a bit better.", "author": "Kim N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-11", "description": "Five days a week I get a cup of coffee and a danish/muffin/pastry thingy here in the morning before I catch the train for work.  While the coffee is excellent and the Cheese danishes are yummy I just don't get the woman who works the register!  \n\nI know what it's like to work in customer service, especially at a busy coffee shop.  I know you have to deal with rude people who talk on the cell phones, who treat you like a non-human work robot without feelings and who don't tip or say thank you.  That is precicely why every single morning I say \"Hello, how you doing\" or \"Hey, how's it going\" and I always say \"please\" and \"thank you very much\" and I always say \"Have a great day!\"  \n\nNow, this isn't a complaint, more just an observation, but no matter what I say to her she always, every time, ignores me.  Well, not ignore me per say, just doesn't respond with anything more than an annoyed look of impatience.  Again, not a complaint.  In fact, it's become almost a game.  I'm afraid the one day she actually responds back to me, I may just drop my danish.  Which might make me cry.", "author": "Jess R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-09", "description": "Really nice little coffee shop, friendly baristas. I work in the area and was really craving some coffee this afternoon. Now I really dislike Starbucks, and wanted a little more variety than whats offered at The Creamery, so I decided to check this place out. The cashier/barista was really nice, answered all my questions and made me a great drink. The coffee is sufficiently strong and tasty. The drink I got was a bit too sweet for my liking, but that's my fault I ordered something with chocolate and flavored syrup. I'll definitely be back to try something a bit simpler.", "author": "Sarah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "Marcus is H O T!\n\nThere's that.  And there is the yummy asiago bagel with eggs and cheese.  Now that I have to pass here every single day to get to my office I am gonna be a regular.  Everyone who ever goes to Caltrain should spend all their money here.  They are nice people and they have good snacks and coffee.  DO IT.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-09", "description": "This place has my favorite hot chocolate ever- it is sooo good.  I can understand the train vs. hot drink dilemma mentioned by previous reviewers.  I'm not a  fan of Starbucks' hot chocolate- this is much better, but I guess that is a matter of personal choice.\nI personally like their breakfast sandwiches, the bagels aren't too chewy or crunchy as to make it difficult to eat. Yeah the microwaved egg fluff is a weird way of doing things (I was worried the first time that the plastic would melt, but I guess they know what they are doing), but it's not bad.", "author": "Jennifer W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "They're FAST, FRIENDLY, and they focused on their customers. They recognize my time is valuable and get me through quickly and courteously.  Great coffee, great chai and the best bagel sandwiches in SFO. Seriously love these guys...great crew that works there.  I'd much rather support them then a corporate chain.   I've read a couple of the other reviews here and people need to realize that cups aren't free and if you've got time to complain about not getting  a free glass of water, chances are you don't realize how small business works.", "author": "Tony J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "The service was friendly and quick. I ordered a white mocha... It was delicious. Lots of options on the menu, also a few food items... I recommend them.", "author": "Brandon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-23", "description": "A Wednesday morning commute to the Peninsula is typically painful.\nIt's not quite the half way point for the week.\nWork has started to pile up.\nAnd I'm running to the station, usually a couple minutes shy of missing the train.\n\nToday was different.  I showed up a bit earlier than usual.\nCaffe D'Amore -- the little coffee shop at the San Francisco Cal Train station -- had invited an opera singer at the entrance to the station.  This was a pleasant change of pace from the typical train station mad rush.\n\nEntranced by the singling, and with four minutes to spare, I wandered over to Caffe D'Amore for a cup of coffee.  When I reached for cash, the friendly barista told me, \"It's on the house, compliments of the new condominium building across the street,\" as he handed me a flier.  You gotta love the South Beach boom.\n\nFilled my coffee cup with some fresh brew, which I've been grateful to find every time I've stopped there for a quick cup.  Caffe D'Amore also carries a variety of juices, baked pastries, sandwiches, espresso drinks and fruit at very reasonable prices.\n\nI listened to the singer for a couple more moments, gave her a tip, and went about my Wednesday.\nThey say it's not over til the fat lady sings.\nIn this case, the day was just beginning.", "author": "Neha S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-04", "description": "Good coffee in the morning and healthy sandwiches on my way home. \n\nIt's a surprisingly cute little espresso bar right in the train station. I'd go so far as to say that it is the best independent espresso in the area (everything else is Starbucks, SBC, Specialties, etc.).", "author": "Lauren H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-07-16", "description": "I was very loyal to this cafe for about 9 months and then Panera opened up! \n\nI frequented Caffe D'Amore even though there was absolutely nothing remotely special about the food or drinks, simply because the service and friendly smile are TOP NOTCH. There's also a guy that works there who gives me a flirty smile every morning and hey, that's nice too. The two older gay fellows that run the place are fantastic and always in a great mood. AMAZING what good service can do. \n\nThe scones are terrible, someone mentioned that Il Fornaio makes their pastries, but I second another reviewer in that they taste more like Costco pastries. I've gotten better at Safeway, actually. The Scones are baked with too much Baking Soda and so they have a tangy bitter flavor aftertaste. The chocolate cookie was so gross I couldn't eat more than one bite and then I chucked it out. \n\nThe tea brand they use is a pretty poor quality, I think it's stash tea, hey maybe I'm a tea snob, but not the best, the flavor is weak and lacking complexity - my preference for bagged tea is Twinings. Okay so I AM a tea snob! Their Kona coffee blend is decent though, I have no problems with it. Not stupendous, not terrible. Just a good basic cuppa. \n\nSometimes when I'm really pressed and hungry I'll grab one of Sunrise Bakery's sandwiches-of-nastyness (i.e. 1 transparently thin sliver of slimy processed turkey, a baseball-sized wad of sprouts between mealy sprouted wheat slices of gag-bread) but I don't really recommend those unless you like bland health food. \n\nThey do have baskets of fresh fruit so I raid those. \n\nAfter experimenting with Caffe D'Amore, my regular choice is a cup of Kona coffee and a piece of fresh fruit. \n\nBut now that Panera has opened up....I've found my Amore somewhere else....sorry fellas.", "author": "Brianna W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-21", "description": "i love this little stand! i come here when i don't have time to stop by to get coffee before catching the next public transportation. they really do a great job with what they have to offer.", "author": "Marjie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-11", "description": "For a couple of years I was a happy D'amore customer, bemused by their proudly displayed 100 on their health inspection and the fact that the baristas recognized me even though I could never really see them through the reflections in the glass windows (I was a little surprised when one of them grabbed my hand when I was trying to pay and shook it saying \"It's been a pleasure serving you:  today's my last day\").   They make some tasty iced coffees and mochas, and my only real complaint was that they didn't have a quick pay mechanism for people who just wanted coffee.\n\nIf I was so happy with them, what happened?  One word:  Philz.  \n\nI still go back when I'm running late and don't have time to go to Philz, but let's put it this way:  I've been working on my last buy 10 get 1 free card for about 3 months now.", "author": "Bailey S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-04", "description": "The main reason to love Cafee D'Amore is Marcus. I have been a big fan of his since he first started with the cart at Caltrain. I am always impressed with his sunny attitude, especially at 7 AM in the morning! Everyone always remembered my drink and my name. I miss it a lot.\nI frequented a coffee cart in New York for many years and loved having a place where I was a \"regular\". Caffe D'Amore made me feel like a regular after only one week!", "author": "Dena D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-21", "description": "A very nice employee here has restored my faith in humanity. I stopped by one morning since I noticed they had pumpkin spice lattes (woot woot for Starbucks alternatives to things you generally can only get at Starbucks!), but their card reader was down and I had no cash. I thought, oh well, there goes my latte!, but the woman at the register asked if I came through every day, and that I could just stop by next time and they would ring me up then! Didn't ask for a name, didn't hold my license hostage. Frankly, while I might generally trust that a person wouldn't just take advantage of such a situation (karma people, karma!), I'm not sure I trust people's *memories* to remember the favor they owe.\n\nDear reader, so restored was my faith in humanity, I went to the ATM at lunch, and promptly settled my debt on my way home that evening. (Oh yeah, and my pumpkin spice latte was pretty good too).\n\nAlso, they sponsor some pretty good opera singers on Wednesday mornings, which always makes me smile a little when I pass them, and while they don't have a seating area, their kitchen/barista area looks so bright and warm and cozy -- not just a utilitarian coffee stand in a train station.\n---\nUpdate 12/5/07\n\nI swung by the other night for a small hazelnut steamer, which to my great surprise and delight, was only a whopping 85 cents. Sure, it's just milk and syrup, but handing over a dollar and getting change back  for a cozy hot drink just makes me like this place more.", "author": "J C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-24", "description": "I'm shocked at the 4 and 5 stars here. Man, I'm not following those people. Don't get me wrong, the staff is friendly, and they really care about getting you in and out in time to make the train, but the food they have to work with is such a missed opportunity. I only go there for the convenience. Oh how my life could be so much better if only they sourced their food from any number of 4-stars in the city, like Little Skillet, only a few blocks away. What's worse, they hog the space - they, the Subway, and the news stand (all crappy choices) - put a stranglehold on any possible morning joy for the hordes of commuters they could instead delight. Hey, at least there's never a long line!", "author": "Bib G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-25", "description": "Ordered a breakfast bagel and iced tea...\n\nGot the wrong cheese (and pepper jack sucks if you're not expecting it).  No bacon.\nFilled cup to the rim with ice... 12 oz of ice and 4 oz of actual caffeinated iced tea is NOT what I want to pay for.", "author": "M D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-12", "description": "Makes it worth getting to the Caltrain station early, except every else thinks so too, so you have to get there really early to beat the lines.\n\nNot open on weekends :(\n\nBetter syrupy coffee-flavored drinks than actual espresso.", "author": "Maia B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "I always liked this when I was a regular Caltrain commuter.  They were very efficient and usually pretty friendly. I'm sure I wasn't always very chipper at 7 am but they put up with me.\n\nMaybe the coffee wasn't the best, but I can guarantee you that Peet's wouldn't have been able to serve as many harried people before the baby bullet departures as Caffe D'Amore did.\n\nI do think maybe it was a little better when it was just a cart outside and not one of the stands inside the station.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "I have completed more than one loyalty/frequent buyer card at Caffe D' Amore in the Caltrain station, mostly thanks to their addictive Irish cream white mocha.  I actually arrange my arrival at the Caltrain station so that I have enough time to get one before I board my train.  I dread the day that I arrive late and am forced to decide between my intended train and an Irish cream white mocha... you might just win, Caffe D' Amore!", "author": "Ben D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-09", "description": "In and out, that's how I like it\nThis small coffee pastry donut muffin sandwich and croissant shop is smack dab in the crossroads of san francisco caltrain entrance / exit\nI imagine it's hella busy when all of the interloping non residents are plundering our city with their suburbanite ways\nI rolled up on bicycle at 1030am and practically did a track stand whilst waiting for the two croissants that I ordered\n30 seconds later and on a separate receiving window / line / I was outtie\nCroissant looked large enuf, I just brought em home and toasted em.\nI paid $2 per item, prolly a little more than if I crossed the street, locked up my bike, walked around the aisles, found 2 croissants, waited for some soccer mom to take all the groceries out of her cart and checkout (maybe if I am lucky, she'll run me over in a Critical Mass ride), then the little old lady digging pennies and writing checks, then un-lock my bikeand pedal off.\nNo thanks I'll just pay a few % more and jet in a NY minute (which is actually only 10 seconds)", "author": "G K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-31", "description": "I go to cafe d'amore any time i have time left before a train.  Their coffee is good, and their asiago bagel is also great.  \n\nThe line moves quickly as the people there are super efficient.  it runs like a well-oiled machine.  My only complaint: the coffee doctoring area is set up poorly and it is difficult to add cream and sugar when there are multiple people there at once.", "author": "Steve H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-01", "description": "coffee and morning pastries....nothing fancy dancy...just quick and easy point to order menu.....on those days i'm not sprinting to board the train...i'll grab a cranberry scone and coffee to go...", "author": "Hen A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2005-07-14", "description": "The coolest thing about this Cafe by Caltrain, is that sometimes in the mornings, once a week, when the weather's nice... they \"sponsor\" these opera singers who perform on the plaza. What a nice treat for all us commuters!", "author": "Risa F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "I never enjoyed their coffee much, but they're right in the train station and you can't beat the convenience of it. The employees are really friendly though, and that made it worth going back.", "author": "Jacob F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2005-07-07", "description": "This is the coffee cart outside of the 4th & King Caltrain station.  I know I'm a total cornball, but what excited me the most about this place at first was that they have punch cards...order 10 drinks and get your next one free.  Yeah, no big deal but it's what my favorite cafe back home did so I guess I'm just nostalgic.  Anyway, the coffee is a little hit and miss here, sometimes it is really great and other days (like today) it is a little thin.  They have pretty good pastries from some local bakery (cranberry scone is my favorite).  I haven't tried any of the espresso drinks yet.  The employees are all friendly and efficient which is good because there has always been a bit of a line in the morning.  Of course everyone's getting there just before their train leaves so you get the bonding experience of collectively sweating out whether you'll be able to get your caffeine without missing the train.  Great fun.", "author": "Dan G."}
