{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "This is my favorite dimsum to go spot. Everything is fairly priced and the quality is the best I've had compared to other dimsum Togo spots.\n\nThis is a cash only place . So make sure you brought enough! It's easy to get carried away \n\nThe big bun - cheap $2-3(forgot T_T) and super filling but it taste good too! A large sized bao stuffed with chicken, chinese sausage, boiled egg, mushroom and delicious flavors \n\nChinese tamale - it is freakin so tasty and huge !surrounded with sticky rice. The filling contains salted egg yolk, chinese sausage, fatty pork, lean pork, shiitake mushroom, lotus seeds, chestnut .. it is freakin tasty . Yes I said it twice \n\nBlack sesame paste dessert - think of it as a thicken soup instead of a paste. If you never had it before than you would just have to try to see if you like the texture. But I think this is the best black sesame paste you can get around unless you make your own from scratch or go to a very nice chinese restaurant that may serve it which  is rare to none. Taste like black sesame and not watered down glob like most places \n\nWhite sugar cake (bak tong go)- the white sponge looking thing. Slightly sweet classic dimsum dessert. I don't know how I should explain the texture but this place makes it right. Why? Because you know it's good when it doesn't have a sour taste to it. Has to do with the steaming process I've heard. \n\nSteamed pudding ( boot jai go ) I don't know the English name for this but it's just another classic old style dessert that's steamed in bowls with some red beans in it and taken out and cooled before eaten. Rarely any places makes this but I could be wrong \n\nAll the other stuff is decent. I mean it's a to go spot !", "author": "Myron L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Unless you have a nose for dim sum, you will walk past TC Pastry on Irving Street if you don't pay much attention to storefronts.\n\nIf you find this place on accident, like me, you may wonder \"what is this hole in a wall joint that I must try?\"\n\nTry you shall. Because, it is solid. Real solid.\n\nBy solid I don't mean the next Koi Palace or Yank Sing. Don't expect caviar or fancy roe sprinkled on your shumai. However, by solid I will sign off that TC Pastry is one of the better take out dim sum joints in SF. Better than most spots in Chinatown or on Clement St.\n\nTheir Chicken and pork dumplings (shu mai) were excellent. Rice paper skin not too soggy but overall it's also not too dry. I thought it was done right. Oh, and their price - 3 dumplings for $2.25 - I mean, we unwillingly spend way more on SF restaurant's \"health inspection fee\"\n\nAnother winner is the lotus leaf wrapped rice with mince pork. A giant-sized deliciousness cooked to perfection.\n\nPoint of my review is, the next time you're on Irving St., between 20th-22nd, look around; you will find paradise.", "author": "Dave K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "My brother has been to the TC Pastry in Daly City a few times, and he enjoys their dim sum items, so my dad and I decided to give this location a try after spending the day in Golden Gate Park. We went in the late afternoon so many of their more popular items were already sold out. I was lucky enough to snag the last egg tart. They have all kinds of dim sum items, from rice rolls to vegetarian buns to curry pastries. In addition, they have some cooked dishes (e.g., fried rice, chow mein) and some dessert items. Everything is extremely cheap here, and you can get a very filling meal for just a few dollars. \n\nMy dad and I were just looking for a light snack, so we got one egg tart, one mango pudding, and one tofu pudding. The egg tart cost $1.20, and it was pretty solid. The pastry shell was flaky and buttery, and the custard filling was soft and creamy. The mango pudding came in a small container and cost about $2.50. The flavoring tasted very artificial, but it was still tasty. The consistency was smooth and velvety. I didn't try the tofu pudding but my dad complained that it was room temperature even though they advertised it as hot. Worst of all, there were black spots in his tofu pudding. I'm not sure what the spots were but it looked like mold. \n\nFood safety is extremely questionable here. The store was pretty dirty, and the staff didn't pay much attention to proper food handling. I was thinking of buying a box of pastries to take home to my family, but after finding the black spots in my dad's tofu pudding, I decided against that idea. The staff were unfriendly and rushed us when we ordered and snapped at us when we asked for napkins. Also, they charge 25 cents for each to go container.\n\nThere's no doubt that TC has cheap prices and a large selection, but it's not worth getting food poisoning for.", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Authentic, affordable, not the best place for people who aren't already familiar with chinese dim sum. This place only takes cash which could be inconvenient but the food definitely makes up for it.", "author": "Ana F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "$5.05 for SIX pastries? Worth & Yummy!\n\nAfter grabbing iTea, I was just looking for a salty snack to complement the sweetness of my drink, and I happened to stumble upon this humble dim sum express. One word to explain this place would be utility because their interior and presentation did not appear so appealing. But, don't just the book by its cover, the food was awesome and extremely cheap!\n\nWHAT I ORDERED: (3) Sesame Ball & (3) Deep Fried Curry Pastry = $5.05.\n\nWhen I came in during the late afternoon, due to my cynicism, I just assumed what I bought would be somewhat stale or hardened. It didn't look too good through the displays, and I didn't check Yelp prior to see their positive reviews until after I took a bite in my order. \n\nBoy, was I wrong... the quality was good! The Sesame Ball had a nice mochi texture and a sweet yellow lotus filling that was simply delicious. The Deep Fried Curry Pastry was lightly crunchy on the outside and savory on the inside from its curry filling. Plus, both the size and quantity was enough to share with another person---which I gladly did not since it was too delish!\n\nTo add on top of that, for non-Chinese speakers, although workers mainly speak Chinese there, there are English labels on the display to help out, and the workers can get by through simple English. Customer service was good too. I look young, and they treated me fairly so no complaints there. There may be cultural differences, but hey, it's the food that counts.  \n\nOverall, next time I decide to visit the Golden Gate Park, I'm definitely first going to stop by here to satisfy my afternoon munchies, especially when it's low-cost and high-quality.", "author": "Linda X."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "A lot of dim sum choices and most are $.80 each other few dollars for 3 or something. So cheap! I didn't like their porridge though, it's not that good. I would skip. It's cash only!", "author": "Debbie D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Tasty and cheap dim sum in a no frills take out shop setting.", "author": "Justin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I'm shocked that I've never reviewed TC Pastry because I absolutely loved this place when I was in college. \n\nIt was literally one of my staples, although I've always had the hardest time remembering their name. When I was a very broke college student my good friend Geoff and I would split a trip coming here, he would drive and I would buy and we'd get like $20 in dim sum - enough to last us a week!\n\nThe service has always been very quick and prompt, even if the space itself is a bit run of the mill. But the food was and is always incredibly delicious (the honey and I made a recent trip and he loved it) and I myself absolutely adore their taro!\n\n Definitely highly recommended if you're in the area!", "author": "Meg T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "**CASH ONLY**\n\nWhere do I start? I was starved and was craving porridge badly. Thanks to Yelp, I found this place nearby.\n\nPorridge with preserved egg and pork: Not too thick, but not too watery. The amount of preserved egg and pork was reasonable. For the price? You really can't complain. A large was $3.80 or so.\n\nBeef cherng fun: Skin was soft and nice amount of beef.\n\nTurnip cake: Pretty good especially with sriracha.\n\nBaked BBQ pork buns: Not bad. Standard.\n\nEverything is relatively cheap which makes this place so amazing. You can get full with $5 or less. Highly recommend for cheap dim sum.", "author": "Julian Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-31", "description": "Have been stopping at this place for snacks whenever we drive from, or to, SFO (from the North Bay). The dim sums are pretty standards. The conge is okay, so is the creamy black sesame paste. However, recently, they started offering the soya pudding. This is now our favorite. It is so smooth and silky. IMHO, it is better than a lot of the better known dim sum restaurants. \nHope that they continue to come up with new yummy dim sums.", "author": "Andrew L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-04", "description": "Cheap and delicious dim sum.  I love that it has a quick to-go atmosphere so you don't have to sit in fancy restaurants and pay for overpriced dimsum.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-16", "description": "My go to dim sum place to grab and go! Their dim sum is made fresh and it's tasty not to mention economical as well! If you're in the Sunset, grab some boba milk tea from Wonderful foods and some dim sum here and you're all set!", "author": "Colleen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "I like to come here to pick up dim sum and other small Asian eats. This is more of a to go place than a sit down place, but they do have some tables if you want to eat there.\n\nThey have a good variety. My favorites are chives dumplings, the sponge cake (馬來糕), custard buns, black sesame soup, and mango pudding in the fridge! The price is pretty good too, probably around half the price of dim sum in a sit down restaurant. \n\nThey don't speak great English though and mostly Cantonese so they've given me the wrong item before. I still enjoyed it though, so all good.", "author": "Tiffany J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "My go-to dim sum place!\n\nI needed 2 dozen of peach buns (represents longevity in the Chinese culture and is usually displayed at birthday celebrations) and needed them in less than 24 hours. I had remember seeing them at TC Pastry before and when I called them at 6pm to ask if they could have it ready in less than 24 hours, they said no problem. I placed an order with them for 2 dozen and 1 giant peach bun and they told me to pick up at 4pm before before 3pm they are working on dim sum. \n\nThey did tell me ahead of time to bring a tray so they can help me place it as a display. As soon as I got there, they had the peach buns ready and the price for 2 dozen small peach buns and 1 big one was not bad at all, for only $16.50. \n\nI highly recommend them if you need peach buns or even dim sum for your co-workers and family/friends!", "author": "Eva O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "The preserved (black) egg and pork rice porridge (jook) here is excellent! It's $3.50 plus tax for a larger order. I also like their sticky rice dumpling; their shrimp chives/cilantro dumplings are especially good and it's got lots of shrimp inside, not cheap filler.\n\nThe folks at the counter give quick, efficient service. I order take-out only but there are tables inside if you want to sit and eat your order right then.", "author": "Everso T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-30", "description": "T & C Pastry, the only restaurant I would recommend on the whole street, you can get  a small bowl of Jook for a grand total of $2.40, no tax!( fills you up all day, they even throw in thousand-yr. egg & pork bits..  ..Between 23rd & 24th street, try it , you will not regret it..Food items are limited..  ..long fried breakfast  rolls you can try( don't have my wheelbarrow with me..); This & Popeye's chicken & Super burger(all you can drink, all the pickles, too..)is the only 3 restaurants in entire bay area worth spending $..  ..", "author": "Jeffrey W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Wonderful place for cheap takeout dim sum that I like better than any place I've been to in Chinatown. There's also a few tables for seating, which is nice. \n\nThere's a pretty classic assortment of dumplings and you get a slight discount if you buy 3 or more. Cash only. \n\nPersonal favorites are any of the shrimp dumplings, the pot stickers, and egg tart. The BBQ pork buns are just okay.", "author": "Hali M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-02", "description": "This is Jook Time's other store.  Since they closed Jook Time I came here to buy dim sum.  Food prices were on par as JT.  However the bbq pork buns were disgusting.  They had bits of burnt parts and god knows what mixed in.\n\nSo disappointing.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-28", "description": "I used to like the other location better! The prices at this location is all different for every single thing! The other location isn't like this and I think the prices are slightly cheaper. The quality is just ok. The size is TINY! Other location has a lot more better tasting and different food than this one. \n\nThe women are quick at taking orders and handing you your food. The lady that helped me this morning (Jan 5, 2014) was nice and understood my Chinglish quite well. Hahaha!\n\nGood cheap food if you're in the area.\n\nCASH ONLY", "author": "? ?."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Friendly ladies with a solid variety of dim sum. Items are priced per piece, and per order; which is a rare but nice option. TC's was busy when I got there but the line moved quickly. Lots of clean tables and chairs to dine in. Parking isn't too terrible depending on the time of day. If you're apprehensive to try, give it a go. The food was tasty and the prices were decent.", "author": "Rosalyn W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "TC Pastry offers delicious dim sum and entree items at very low prices. \n\nIf you're looking to get dim sum without the whole sit-down experience, this is the place to go. The items and prices are stated clearly on the menu so there's no confusion. This is a cash only place. Many of the items are $1.50 - $3 so you're able to get your fill without feeling like you have to break the bank. There are a few tables available for seating but I've often just purchased a few dim sum items to-go. The porridge is delicious and the portion is quite generous. The buns are very huge and are served warm. \n\nThere is often a long line here but the service is quick so I usually have to wait about 5 minutes. There is street parking available in the neighborhood.", "author": "Katie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-24", "description": "In my opinion as well as friends and family, this place has the best baked Cha siu bao.  The bread is so soft and there is just enough bao to eat with the filling in the middle.  Other places have way too much bun and not enough filling- this place gets it right.  The TC Pastry in Daly City has too much bun.\nThe \"Gee Ma Wu\" - Black sesame soup is so good here- try it!  All he other Dim Sum is good too.  But my main reason to go there is for the Cha siu bao that is baked.", "author": "Laurie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "Decent dim sum but not the fanciest place to dine in. You can drop by here and pick a pretty good spread for a picnic or party.", "author": "W A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Great hidden dim sum spot to go. One of the few spots that actually had fish and peanut porridge. Also, for people who don't speak Chinese, the people hear understand and speak pretty good English!", "author": "Eric C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "This place was a few blocks from our place and holds a special place in my heart and tummy. I'm for more mom and pop shops/restaurants and this place gives you that vibe. They have seriously the best dim sum and has always had my cravings sufficed. I love the steam buns and anything with shrimp in it, oh my! Soooooo good!!! We used to come here at least once a week or once every two weeks and refused to try anywhere else. The prices are unbeatable and the parking is easier to find than on Geary or Clement. Please expect to pay cash unless they upgraded to the card option.", "author": "Ashley P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Fantastic takeout dim sum for excellent prices. The baked and steamed pork buns, and the custard buns, (and everything else) was delicious. I love this place!", "author": "Ed H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "Restaurant Name Dim Sum Specialist. The place looks dirty everywhere. Foods are cold all of them. I bought many foods yesterday, one of them it was Chinese Doughnuts. I can't finished it all I bought, so I put it in fridge for overnight till next day I eat and warm it up, realize there is a strong smell on it like chemicals, smell like formalin. The sameday in the morning after wake up, I went to restroom got Diarrhea. Food taste are bad not good at all. It was my first walk in to that restaurant. I'm not sure if they ever got inspection from San Franciso health department. Anyway just give a heads up for whoever want to buy their foods.", "author": "Zedong M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Love the baked pork buns & taro balls!", "author": "Lexy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-31", "description": "Old food n cold\nMakes me want to gag\nHow can they sell old cold food n microwave\nGross\nI have other joints", "author": "Sarah C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-05", "description": "3.5 STARS\n\nMy parents wanted to have dinner the other night, but I was sick. What do I crave when I'm sick?! Congee, chinese porridge, jook, whatever you wanna call it. And I wanted it with preserved egg (or leather egg, thousand year old egg, it has so many names)! Since my parents were going to be in the Sunset, my mom brought me some jook and dim sum from TC Pastry. It was Saturday, October 3rd around 2:30pm.\n\n*Rice porridge with duck egg\n*Chinese donut\n\nMy mom made me pei dan sau yuk jook (rice porridge with duck egg, it comes with pork too) a lot when I was little, so I crave it often when I'm sick or if I just want something comforting. Their version had a good amount of egg and good flavor. To me, jook is not complete without a yau ja gwai (chinese donut)! Theirs was super oily, so I had to take numerous paper towels to soak up all the oil. It was crispy on the outside and soft inside, so once I soaked up the oil, I had my little bowl of comfort.\n\n*Fresh shrimp crepe roll\n*Shrimp dumpling\n*Pork dumpling\n*Sticky rice ball with Chinese sausage\n*Mini egg custard\n\nSince I've have TC Pastry bookmarked for their dim sum, I asked my mom to grab me some. Their ha gow (shrimp dumpling) and ha cheong (fresh shrimp crepe roll) were both tasty. The shrimp was tender in both and the wrappers soft with a slight chew. The siu mai (pork dumpling) was just okay. I've had better. Sticky rice buns are another item that remind me of being a kid. Unfortunately it got soggy in the bag and could have used a little more sausage, but it fulfilled my sticky rice craving. I'd pass next time on the mini dan tats (egg custard). The crust is the cake kind, not the flaky one and they weren't very good. Kinda wished my mom had bought me a regular big dan tat instead.\n\nWhile their dim sum was okay, their porridge provided me the comfort I needed when I wasn't feeling well. I'd probably pass next time on the dim sum, but if I'm in the area, their jook will do the trick!", "author": "Elena N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "I LOOOOVE tc pastry. \n\nTo be honest it's a bit aggravating that a lot of the negative reviews are towards the \"crap\" customer service. I'm sorry but if you're paying a dollar for three pieces of dimsum, you can't expect great customer service. They make their dimsum fresh everyday and I can't even imagine making hundreds of dimsum and other pastries everyday. Now, if this were a 5 star restaurant and then I'd complain. But cmon people. This is dimsum and savory meat buns. You can walk in here with $5 and feed a group of 3. Who cares if they don't smile at you or not. \n\nPersonally they're always been nice to me. And I don't expect them to greet me with a welcoming \"hello!\" All I care about is that I'm buying delicious dimsum for a very affordable price. Plus as I've mentioned, their food is so good! I'm so obsessed with the shrimp crepe roll and the pork and shrimp dimsum. The sweet soysauce they give is also really good. I wonder how they make it \n\nI gave it 4/5 stars only because I wish they tidied the place up a bit. But again, who cares. Maybe it's just me since I don't care about little things like that. But this is definitely my go-to dimsum place when I'm in the Irving area.", "author": "Alex D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-11", "description": "Just stopped by here for lunch on my day off. Not too shabby, good place to stop by if you're in the neighborhood for a cheap snack or lunch. \n\nRating Breakdown:\n1/2 Stars for Taste --\nI saw the zhaliang on display and I knew I had to try it. For those of you who are unfamiliar, it's basically a fried Chinese donut, wrapped in steamed rice noodles, and topped with sweet soy sauce and peanut sauce. Definitely worth trying, but it's a LOT, so bring a friend or two to share with. Leftover zhaliang are no good = soggy mess. They cut the pieces into these huge chunks. I made the mistake of making eye contact with the lady behind the counter just as I stuffed an entire piece, smothered in peanut sauce, into my mouth. Let's just say this is one eligible med student she will NOT be introducing her son to. \n\nThe dim sum items were pretty disappointing. I got a turnip cake and two shumai (beef and pork) and they were served cold. The beef shumai had tendon chunks in it that kept getting stuck in my teeth. \n\n1/1 Stars for Value --\nAt about 70cents a piece for dim sum ($2.00-$2.10 for 3 pieces), you get what you paid for. Maybe they'll taste better if you take them home and nuke 'em in the microwave first? Also, the heaping portion of zhaliang that you get for less than $3 (I think it was $2.70?) is a great deal!\n\n0.5/1 Stars for Customer Service --\nTypical dim sum place where you have to use a lot of pointing to order if you don't speak some form of Chinese. The ladies behind the counter spoke both Cantonese and Mandarin. My one complaint was that when I asked for extra sweet soy sauce for my zhaliang, the lady said it would cost extra. What. Serious? For soy sauce? C'mon.\n\nCan I give half a bonus star? Well, this is my arbitrary system so I say I can. I would come back for the zhaliang, but probably a hard pass on everything else unless I'm really craving some cold dim sum.", "author": "Abby W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-30", "description": "My friend and I were headed to a meeting one Saturday morning, and he wanted to stop by TC Pastry to pick up a couple dozen BBQ pork buns. I love discovering new places in the Sunset to get BBQ pork buns! We waltzed right in, and it must have been 7:30 in the morning. The place was nearly empty, as expected for that time of day. \n\nMy friend ordered one dozen baked pork buns and one dozen steamed pork buns. They were fresh and ready to go in no time! I will say that these pork buns were quite tasty, but they were the smallest ones I've ever seen from any dim sum place or bakery. I cannot recall what the price difference was, but I would rather go somewhere else that has larger ones. \n\nHowever, I would not be able to resist if I was in the area. And I saw that they have fresh porridge here, which I was craving at the time. I would try this place at least once more before dismissing it as an option. The service is fast, and there is seating here in case you want to hang out.", "author": "Stefanie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "Came across this nice authentic Hong Kong dim sum express. \n\nCurry fish ball- good texture and spice, boncing teeth!\nPorridge - good thickness, tasty ingredient. \nWater chestnut -  rare find\nTurnip Cake - spot on but ask for reheat.", "author": "Cal C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "I come here for one thing only because TC Pastry does it extremely well:\n\nBlack Sesame Paste Dessert\n\nAdmittedly, I know very few people that would voluntarily consume what looks like a thick black paste/soup....but it's smooth, creamy, sweet, and just a tad bit smokey. Really delicious! Value-wise, you can get a quart sized cup for just a few dollars and it's enough to fill 4 bowls for my family.\n\nOver the years, we've definitely tried a few other items varying from dim sum to steamed buns, but none have really dethroned other cafes/bakeries...perhaps because every family has its \"list\" of where to get what items.", "author": "Elaine Y."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-29", "description": "Not quite the place for:\n- Impressing bouge friends\n- Dim sum date\n\nIs definitely the place for:\n- Cheap convenient take-out\n- Bringing your out-of-town friends to, and making you look like a savvy local who knows better places than HK Lounge and Koi Palace\n- Dim sum date if you're cozy and past the phase of courting exclusively in nice places\n\nTC Pastry is a very hole-in-the-wall, down-to-earth little dim sim shop that serves staples including traditional dim sum, pastries, and congee. It's not some hidden gem with magical-secret-family-recipe delicacies, nor is it run-down and dirty (health score is 91). It is simply a standard house-made dim sum, tasting exactly as it should and definitely a notch up from the pre-made frozen dim sum you get at cafeterias. \n\nTheir popular zhaliang (rice-noodle-wrapped-Chinese donut) looks deliicous and is definitely on my list. Otherwise, my biggest complaint is that most of the food is cold. I understand that baking the food all day under heat lamps/steamers may dry it out, but I think they should at least warm it up before serving it; otherwise it feels like eating leftovers that I took out of my fridge and was too lazy to heat it up.\n\nIt's one of the remaining few places in SF where food is affordable--very good value, such as $2 for 3 turnip cakes. TC is perfect for a meal or a snack, since everything comes in small dishes. Of note, it is served in in those paper boats so and looks like bad-ass authentic street food.", "author": "Edna C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-19", "description": "Why do people think this place is the bomb??\n\nThe only thing fantastic here were the cilantro dumplings... Everything else was very standard like something you would get at a ranch 99 deli food area. \n\nThe shrimp dumplings were good but were room temperature which is pretty gross.\n\nAnd stay way from the zhongzhi - rice wrapped in bamboo leaves. Disgusting - rice smushed with salted egg.\n\nThe preserve egg congee was flavorless - needed salt ginger pepper and more favor.  \n\nBrought it all home for the chickens. Not worth the calories and ultimately y satisfying.", "author": "Madison W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "They have the best beef rice rolls that you can get to go. I always get at least two orders when I come here! Great for a quick bite.", "author": "Jessica W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-12", "description": "What a treat!!! This a great place to grab a snack before or after the park. We tried 4 or 5 things and all were excellent. Plus the value cannot be beat.", "author": "Adam B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "Decent dim sum take out style with a good selection. This is where the locals go. Very busy and fresh. The service isn't always all smiles, but they're busy! I like the curry puffs, potstickers, mango pudding, and Chinese tamales (joong).", "author": "Kris F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-11", "description": "2.5 stars!  I hate to be a Debbie-downer, but the dim sum at TC Pastry is not my cup of tea.  I can see how it is popular though.  There's always a line out the door and these are my guesses: a) there is no other dim sum take out place close by b) it's cheap c) the portions are big d) service is quick.  I suppose it can satisfy for a quick dim sum fix or if you're planning on carb loading, but don't get your hopes up too high on the quality.  I don't normally crave dim sum, but that's what I wanted after returning from a trip to Amsterdam.  Being in a hurry, I thought to just get take out on my way to run errands that morning.  \n\nYes, there was quite a line to the counter once inside.  I will comment that the actual space where you can eat is dirty.  There are a few tables if you opt to stay in but the place itself is not too appealing, so your best bet is take out.  That morning, we picked up an assortment of items including the pork/thousand year old egg porridge, custard buns, beef rice roll, chicken/bitter melon rice roll, shrimp rice roll, shrimp dumplings (ha-gow), and beef sui-mai.  Definitely \"American\" sized dim sum.  We spend about $20 and had 2 bags of food.  I will say that the porridge was the best, following the custard buns.  I did not like any of the rice rolls at all.  The rice noodle itself was so thick, greasy and chewy.  None of the fillings were adequate.  The meats were cheap and you mostly just get a bunch of thick plain rice rolls.  I thought the chicken/bitter melon flavor would be like the ones you get at a dim sum restaurant.  Wrong!  There was but one little piece of bitter melon and a few bits of mashed together ground chicken.  Ha-gow didn't seem that fresh as the shrimp was mushy.  The wrapper was also very thick.  I did not try the sui-mai, but the other half said it was filled with fatty meat.  \n\nOverall, probably won't be going back.  I took a swing in the dark, and missed on this one.  Will need to actually go to a dim sum restaurant next time instead.  Parking is tough on Irving, so not really worth it for me to go through the trouble for TCP.", "author": "Liv A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-27", "description": "I do not know a single place in the Bay Area that makes zhaliang (Chinese donut wrapped with rice noodles sprinkled with sesame seeds, dried shrimp, and shallots) as good as TC Pastry. They make them to order and in addition to the sweet soy sauce that I'm accustomed to having with zhaliang, they give you the option of adding peanut butter sauce. Friggin' orgasmic, folks.\n\nThe jumbo zongzi (glutinous rice stuffed with chestnuts, chicken, sausage, salted egg and steamed in a bamboo leaf) is also ridiculous. I was buying the ones from Guangdong BBQ across the street but the ones here are tastier. If you want to be healthier though I do recommend the one from Guangdong BBQ.\n\nThe majority of the other buns and dim sum items range from 2-3 stars for me. An hour before closing you can get 3 items for $1.45 which is a pretty good deal. It's cash only and the ladies are overall pleasant (not as nice as the ones over at Hing Wang, but nicer than at Happy Bakery). Solid option for fast food dim sum if you're in the area but worth a 30 min drive if you're craving authentic zhaliang for breakfast.", "author": "Tiffany H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-03", "description": "Let's hope we came on an off day but we discovered that the food went bad really quickly - perhaps a lack in quality of ingredients? Don't bother ordering the tofu dish under the heat lamp because it smelled funny almost immediately after we bought it. Also, the Cantonese guy helping out in the front almost scammed us (overcharged us $5) for an extra bag of cocktail buns before we checked the receipt and approached him about it. None of the bread in the front is fresh (they keep fresh bread warmed in the back) and the BBQ pork buns are an absolute miss. I'm for sure not coming back for this sub-standard dim sum and \"accidental\" attempt to scam my money.", "author": "Austin L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-09", "description": "Pretty good stuff here.  Came by this weekend and picked up some dim sum and bao's to go.  Large selection and prices are pretty reasonable.  I'm not sure but I think they use MSG because I was so parched and did felt to lethargic after eating their food.\n\nI had some Joong, pot stickers and Jah Luerng.\n\nWill give it one more shot.", "author": "Henry S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Not the cleanest place in the world and if you don't speak Cantonese or Mandarin, not so easy to figure out. But the food is okay and the prices cheap.  So I'm coming back. Not taking any woman here... Not a place to impress... But by myself or with construction worker or taxi driver types... Sure.", "author": "Leung T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-09", "description": "What I ate: Assorted dim sum\nVisit date: March 8, 2015\nFirst time? Yes.\n\nAll kinds of dim sum here! My friend was I charge of getting three of everything for our party. She came back with a tray full of savories. One of my favorite dim sums is the fried taro. Unfortunately, TC's was a little on the greasy side to me. Instead of biting into a crisp shell, I got crunch and oil. Not so appetizing. I think it might have just sat too long by the time we got to it. The other dishes were more inviting. Also, I tried a couple of new items today. There was what I like to call a \"tofu chicken sandwich.\" It was tofu stuffed with a chicken patty of sorts wrapped in tofu skin. There was also a mini omelette type patty with mixed veggies and pork. The salt was well balanced in the various dishes and sauces. I especially liked the dumpling with watercress and dipping it in their chili sauce.\n\nThere are a few tables inside, but most people ordered to-go. I'm curious about their rice porridge (we didn't get it this time because we didn't want to get full off of one dish); someone across the way got it and he made it look good.", "author": "Erin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-18", "description": "TC Pastry is great for some dim sum treats. My review is mostly for the baked BBQ pork buns. These pork buns are some of the best I have EVER had. Most buns are mostly made of bread with little filling. TC Pastry is definitely not that way. The ratio of BBQ pork to bun is 50/50. If you're ever in the mood for the baked BBQ pork buns, I recommend TC Pastry!!", "author": "Monica Bianca B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "I wouldn't say I'm qualified for many things but when it comes to this dim sum shop, I've been eating here since over a decade. Friendly, fast and yummy. Over my last 10 years eating from here, I never got sick, I never left unhappy, they were like family. For fast & to-go dim sum, I give this a 5/5 stars because I know that a lot of new places popped up over the years. This place is one of a kind with a good track record.", "author": "Kay U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Don't sleep on this place. Sound this gem when I was in college & everytime in the area I have to stop by & get me some of the shrimp & chives/ cilantro dim sum & Buns.", "author": "Angie C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Solid dim sum.  I'm a fan of their rice roll with Chinese fried donut inside, reminds me of the Taiwanese version that is kind of hard to find in SF.  All their various dumplings are solid - lights, flavorful, and smell delicious.  Everything is a little bit on the expensive side, compared to Chinatown, but still reasonable.", "author": "Ben W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-14", "description": "When we came in here, I thought it was kind of unsanitary just because there were a lot of things going on in the front of the restaurant. There was one table that just had meat on it. I looked over the menu and was intrigued more towards the fried food area, yum.\n\nEventually, I ordered 5 won tons for $1.55 + tax (because it was a closing special) and they were yummy!\n\nWould love to come back here and try more of their food.", "author": "Aj C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "One of the many cash only dim sum places in Inner Sunset/Richmond. There's a Wellsfargo bank 2 blocks away if you need an ATM.\n\nTheir dumplings and congee (pork and thousand year old egg) are pretty solid. I wasn't a fan of their tofu and pork dish though.\n\nEverything here's pretty cheap so definitely a decent place to go if you're hungry and want to eat something fast.", "author": "Lily L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-06", "description": "Not bad for take out dim sum...\n\nshrimp noodles: too much noodle to shrimp ratio\n\nMini custard tarts (dan tat): not flakey but more like a cookie type crust. I enjoyed it and would order it again\n\nTurnip cake: standard as any other place. It's basically a type of flour mixed and steamed. Can't go wrong.\n\nThe ladies here are nice and smiley", "author": "Liz N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "This is the best dim sum south of golden gate park. Their steamed gai bao, har Gao, Siu Mai are perfection. I also LOVE their turnip cakes. There's nothing here that I've tried that was disappointing. I've been eating here for more than 10 years. Check it out, you'll love it too !", "author": "Jim R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "This is my go-to dim sum place when I'm in San Francisco! I've had other places, but I like this one due to the excellent taste and incredibly cheap prices. I've tried most things on the menu, and my favorites would be the har gow shumai, shrimp with thick rice noodles, and the noodles with fried chinese donut. Everything is so good though!! I like the texture of the noodles, and they are generous with the amount of meat/shrimp in each of the portions. \n\nAlso, this isn't the most sanitary place and the service isn't spectacular (there's a lot of scrambling around while waiting in line) but the food definitely makes up for it. I've never had exceptionally rude business here, and I feel like they are just busy so with all of the customers that the service feels rushed. There's usually a line when I'm here in the mornings, but it moves very quickly due to their efficiency. There are also a few tables so that you can eat there if you wish or take everything to-go. \n\nSide note - I usually eat dim sum here and then go across the street to Happy Bakery to get chicken buns to go. Definitely a great combination!!", "author": "Aye K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-06", "description": "I've been to TC Pastry twice now, and both times I left feeling satisfied. This is your typical dim sum shop located in outer sunset. Most of its items are average, but the one thing I keep coming back for is the BBQ pork turnover which is not something that is very common in your typical dim sum shop. It is so flaky, with just the right amount of char siu filling that is not too gooey and not too chunky. This place is very cheap, and surrounded by boba shops to finish your meal with. \n\nOverall, TC is a decent dim sum shop which has one item that I enjoy greatly and I will continue to stop by when in the area.", "author": "Mark O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-05", "description": "Cheap take out dim sum place. Nothing fancy but not the best quality for dim sum. I'm not sure how good I should expect a take out place to be though.\n\nEgg tart: 1/5 Do not get. The crust was not flaky at all and tasted like one piece of crunchy bread.\n\nBBQ pork bun: 4/5 The only thing that was decent here. Filling was juicy with lots of flavor. Bread was a tad on the dry side.\n\nShrimp and chive dumpling: 3/5 Just okay, kind of on the greasy side\n\nIt's a good place to go if you want something quick and cheap but the only thing I would get here again is the BBQ pork bun.", "author": "Tanya Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "I bought their yellow bean buns and mushroom & vegetable buns. The steamed bun was very soft, fresh, and thick. The yellow bean bun was smaller than the vegetable one. I think 3 of them equaled the size of 2 of the vegetable ones, but overall they were very fresh and delicious. All their assorted steamed buns are $2.30 for 3 or $0.80 each. I would definitely come here again. The workers here are really friendly, even when they are super busy! Service is fast, items are fresh, and food area is clean!", "author": "Celena C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "The tofu pudding is on point. No too sweet. Nice firm texture. Hella fast service. And you can't beat these prices. Be sure to tip!", "author": "Judy L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-08", "description": "Quick Notes:\nGood, but not the best\nDim sum for an affordable price. \nCash Only\n3 for ~$2.00\n\nOrdered:\nShrimp and Chive\nBeef\nCurry Fried Won Tons\n\n+The shrimp and chive dim sum was stuffed to my liking. Most dim sum Bakeries tend to skimp on the filling, but not TC Pastry. \n\n+The beef dim sum was tasty, but nothing out of the ordinary\n\n+Curry fried won tons were delicious! However, the crispy won ton wrappers are ridiculously oily. I had to pat it down with a napkin and break the edges off, because it was definitely too much to swallow.\n\nTC PASTRY, DIM SUM YUM!!!", "author": "Briana H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-28", "description": "Giving this place 2 stars because of poor customer service and cleanliness. The front desk and floor was covered in grease and crumbs. The lady at the front desk spoke little english and was not very friendly. Give the food a 3/5 stars-ordered the shrimp \"crepe roll\" and chicken pie. Ive had better dim sum in San Francisco", "author": "Michelle L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-05", "description": "TC Pastry is a small shop located in the outer sunset district.  Our main goal going here was for the bao.  \n\nOne of the most frustrating thing about these places, or SF itself, is the parking.  Make sure you have plenty of time, and patience about the parking situation.\n\nWe purchased the BBQ buns, rice cakes, coconut covered balls with black beans, and sesame seed balls.\n\nTheir service was quick.  The gentleman that was there answered my questions regarding the regular buns vs the wheat buns.  \n\nOverall, this is a good place to grab a quick bbq bun to eat.  I would return the next time that I go to SF.", "author": "Kevin H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "Horrendous. In every way.  Unless u study iron-stomach Kung fu and are currently in training, avoid this place at all costs.  Super filthy as well.  Rusty fridge, boxes, total mess in the dining area. Proper dirty this place.  \nAnd the new place right next door, just as bad.", "author": "Nick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-12", "description": "Great place to come when you are craving Dim sum food.  I love how they have the black sesame dessert here.  I like coming here to get their congee and their chinese donut.  It's hard to find a place that makes good congee that does not have MSG.   The sesame ball here is good too and i like coming here to get that along with their steamed bbq pork buns.  I only like the white buns. You can usually spend 20 bucks here just on yourself.  I recommend you bring your own bag because you might think you are leaving with 1 or 2 items, but when you look around you want more and more.  I like the red bean pudding they have here, i don't know the English name,but you will always see the Stars eating it in the old TVB dramas.  If you come close to closing the items goes on sale! Bring cash!!", "author": "Belinda C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "The interior is a bit dirty.  Food was good. It was a bit cold even though I ate it in the shop instead of takeout. I ordered shrimp and chive shumai, shrimp and ciliantro shumai, and sesame ball for dessert. They were all good. But the sesame ball was particularly good~ I think about it time to time :) I would Togo next time and reheat it at my house.", "author": "Irene S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "In addition to everything that I mentioned a few years ago, I found they make my favorite dessert: bok tong go here and it's DELICIOUS! It's a sweet white rice cake in a triangle shape that's so light and fluffy and amazing. Other places make it thinner and harder, but this one is perfect and even tastes good a day later. I'm seriously considering ordering these for my wedding later this year if they sell in large quantities. It's that yummy.", "author": "Jenn D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-09", "description": "Cabbage on the floor, unknown liquid on top of the freezer and cardboard boxes as stepping mats. Those were the things you can find at this restaurant. The Chinese doughnut was very dense and oily. These things are are suppose to be light and fluffy! The egg tart were pretty good but oily as expected. My friend said her stomach felt a little queasy after. But the food was cheap! So I guess we don't have an iron stomach. If you do go ahead and take that risk!", "author": "Nika L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "\"Pastry\" is the operative word as many of the items in the display case were either encased in pastry (little chicken pies, hot dogs in a pastry roll, cha siu bao) or deep fried. It was a little disappointing but buy I did after making the trek across the city.\n\nThey had a few pieces of steamed shrimp and cilantro dim sum which were outstanding: perfect wrapper, big chunks of shrimp, just the right balance of cilantro and garlic. I would go back for those in a New York minute. \n\n(They bumped up this review's star rating from 2.5 to 3 stars.)\n\nBut no beef balls, XLB, shiu Mai, ha gao. It seemed every time I asked for something I got a \"no\". Not, \"we are out of this but try.,\" or \"We have x but it's pork, not shrimp.\" Customer service was definitely lacking. \n\nFor the items I left with, the cha siu bao were far too sweet. The bun was overly sugared and the BBQ pork inside, also sweet with no complement of savory flavor. I tossed half of it. The chicken potstickers, while over-sized, were simply \"meh.\" \n\nThe dan tat were just ok and seemed a day old or at least baked hours before and left at room temperature where they dried out in the display case.\n\nSo I'm still searching for my place where I can get cha siu bao and dan tat as good as Lung Fung bakery AND excellent steamed dim sum all in one place.\n\nThe pilgrimage continues..", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "best place for takeout dim sum!!!! no place compares. very fast and cheap. my favorite is the fun gwoa. definitely one of my comfort foods", "author": "Erica F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "They dont have names of the food next to its tray, language barrier, and since its so busy there isn't much time to think. Speaking the language might be helpful. I got an assortment  of potstickers, i liked the shrimp and chives ones, rest was mediocre and creasy. Also, they only take cash.", "author": "Tri S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "Writing a review for this spot has totally slipped my mind. This little dim sum spot has been my go to spot lately. Especially since most spots close early or if you don't go early enough they run out of items. Also the prices are great here. \n\nI usually come here with my little sister. It's our usual Sunday date spot. She loves the mini egg tarts. I love the dry rice cake noodle thing (white thing with green onion you pour soy sauce over) and their shumai is so tasty! For less than ten bucks, we pick up lunch and have our little dim sum date. \n\nOne last important thing: the people are very friendly. Service is always great. I always have lots of questions and they don't get annoyed of answering them. That's a plus in my book!", "author": "Dara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-04", "description": "The thought of dim sum to go is pretty intriguing, and that alone is a reason to show up. They are quick and there are tons of options.  \n\nThe place is very no frills and unassuming.  The dim sum itself ranges from just okay to pretty good. My favorite is the char siu bao (steamed pork buns).  Prices are so cheap you can load up on a ton of stuff, and try everything out. Virtually no dipping sauces though, just hot sauce and soy sauce.", "author": "Jeanne M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-18", "description": "Food Taste terrible ,i don't come back this restraurant  anymore,and place so dirty!!!", "author": "Wen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-24", "description": "Haven't tried all the little dim sum joints out here yet, but TC Pastry is in the lead as my favorite one so far. I usually stop by after a weekend run to treat myself to a few pieces of somethin'. \n\nThey have this TC Pastry-exclusive Chinese sausage bun (rice with sausage bits wrapped in a thin wonton skin) that I don't know the official name of and that I haven't found anywhere else. \n\nSo cheap, so good. Alas, they don't take card. Sad times.", "author": "An Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-28", "description": "Great place to grab an assortment of dim sum, including porridge, and they even have sweet tofu!", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "When I want to enjoy dim sum on the go, I normally hit up Mongkok on Noriega.  However, I recently discovered that there are several dim sum takeout places on Irving, which is much closer.  I found the best rated one, and decided to give it a try.\n\nI ordered the BBQ pork buns, shrimp crepe noodles, pot stickers, and pork and chive dumplings.  I really enjoyed the pork and chive dumplings and the BBQ pork buns.  The noodles needed more soy sauce, and the pot stickers were way too big for my tastes.  Prices are awesome and everything is pretty much under $2, and the entire meal only cost $7.50.  For what it was, it was pretty good.\n\nService was pretty good and got us going pretty quickly.  I wish the food was actually served hotter despite coming out of the steamer or microwave.  There's lots of options for dim sum in the neighborhood so I'd probably check those out first before coming back here.  In a pinch though, totally decent for a fix.\n\nFood: 6/10\n\nService: 5/10\n\nPrice: $\n\nAtmosphere: 5/10", "author": "Joe M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-01", "description": "Super cheap dim sum in St Francis square. I think this is the only dim sum place in the immediate area. Good if you just need a snack!\n\nNot a sit down type place (though they do have seats and tables), more meant for takeout. Some items are better than others.\n\n========\nWe got:\nWon ton soup: Meh. Had much better but to be fair this one had more won tons in it than anticipated.\nHar gow: Meh, have had better again.\n9-vegetable dumpling (uhh not sure what to call it exactly in English but it's the chives dumpling I think): It was REALLY good! Except super super oily, of course.", "author": "Emily C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-21", "description": "I've been traveling for the past year, and had a craving for some TC Pastry! I decided to pop in a few days ago (as they were closed for two weeks or so). I had regretted it pretty quickly. I ordered some chow mein and wontons, and some shrimp-cilantro dumplings. I'm almost 100% sure that there's MSG or lots of salt in the chow mein and wontons because I was feeling pretty sick afterwards. i will say that the price is downright awesome, but I'll stick to the dumplings and bao instead of anything that may potentially have lots of salt or MSG.", "author": "Evan K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-14", "description": "Not my favorite go-to spot for dim-sum takeout, but it's pretty decent. \n\nTheir shrimp dumplings are good, but Good Luck Dim Sum's are way better! I also had their crispy taro and they were ok.\n\nOverall, 3.5 stars. The lady who helped me was actually really nice. I would come back!", "author": "Fallon P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "i remember my eldest sister taking me here years ago when we shopped on Irving St.  I thought it was kind of odd that my sister would pass by so many dim sum places on irving just to get here to this obscure dim sum place which was so far away from most of the shops nearer 19th Ave.  Then i noticed why when I saw how UNIQUE a dim sum place this is.  Yes, other cheap dim sum places have the usual chinese donut, custard tarts, shrimp dumplings, sesame balls, etc., but TC has SO MANY OTHER dim sum that are tasty that I've never seen before.  For example, they serve very tasty savory curried pastry puffs with chicken or beef or bbq pork in a golden baked just right pastry.  They have dim sum with taro, etc. I and my sister like their food so much there that we can spend over $30 easily in one trip just to take home for later.\n\nIf it's behind the counter for a while, it may not be as fresh as it COULD be.  It's still ok to eat, but if you want REALLY FRESH, ask them you want it right out of the kitchen fresh.  I was surprised when I ate their shrimp/cilantro dumplings which were cold but ok tasting, but which were waaaay not as fresh than their long shrimp noodles which were so tender and hot straight from their steamers.  \n\nThere are only a few large tables and it's not really clean and scenic and it gets full in their shop quickly so I wouldn't spend that much time there to hang out like a starbucks.  There is no bathroom readily available.  Its definitely NOT a place for a date.  Most people take their food and then leave.  Some people stay to eat their dim sum for a few minutes before they leave.", "author": "Frugal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-14", "description": "I don't know what to say, this place is the ultimate. It's like any bakery, Chinese or not, with a glass display - but this one is full of DUMPLINGS. Delicious dumplings. And baked/steamed buns and pastries filled with both savory and sweet deliciousness. And for cheap - most things are like, 3 for $1.90.\n\nI also like that this is NOT in Chinatown, so it's not crazy crowded and \"touristy.\"\n\nFavorites - shrimp + cilantro dumpling, potstickers, steamed egg custard bun.\n\nThat cilantro tho. It was bright and crunchy and perfect with the shrimp.\n\nThe potstickers, and the har gow pork dumpling, were Godzilla-sized. I'm used to those small bite-sized ones from the cart at dim sum restaurants - these were like three times the size and generous with the meat. UGH SO GOOD.\n\nThe egg custard bun I just ordered on a whim - I like egg tarts but was like hmm maybe? And it was hmm YES. The best way I can describe them is a steamed not-so-sweet donut with a sweet creamy egg custard filling. I dunno if that makes sense.\n\nI did not much like the sesame balls, bc they were so damn greasy. Like, they oozed. The Chinese donut, which was seriously as big as a tyrannosaurus rex femur, was also a \"can do without\" - not too much flavor, a bit greasy, and not worth the stomach space. I'd rather eat a few more potstickers.", "author": "Jessie I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "Tasty, tasty business. \n\nBeen here a handful of times, and they never have flouted my personal pot-sticker standards. I am not Chinese, nor do I have any skills in cooking, but man, there's just something about their potstickers that makes me say \"Wow. Now that's a potsticker.\" If you feel similarly, I highly recommend these glorious pouches of pork. The outside is soft where you want it soft, and browned and crispy where you want it browned and crispy. They seem to fall apart just at the right time, not when you bite into it and the other half sort of dangles indifferently from your gob. No! It breaks open seductively on your little dumpling plate and shows you its lovely juices and soft meaty interior.....Ahem, I digress. The potstickers are good. \n\nI always enjoy their shrimp dumplings, fried wontons, and pork dumplings. Next time I go I'll branch out and try some new things; last time I was enticed by their wonton soup but the will to consume a series of dumplings overpowered me. \n\nMinus a star for the slightly slovenly environment. It could use a bit of a refurbish. That said, Golden Gate Park is just a hop away, get in it and enjoy your dim sum picnic-like!", "author": "Chelsea B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-27", "description": "Good, fast and cheap way to get your dim sum fix. If you want you tiao (Chinese donuts) don't wait until the afternoon - they often run out.", "author": "Tina W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "Egg custard buns (lai wong bao) for only 75 cents each ! Cant beat that! Dim sum is not as authentic as restaurants but good enough for a quick dim sum to-go place! Service is decent too.", "author": "Victoria T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "This is my favorite place for dim sum. I love the deep fried curry puffs! I think about TC pastry way more often than I should. At least 3 times a week. They are closed on Tuesdays! So don't get your heart set on it on Tuesday like I always do. They are extremely inexpensive and also just the best food. I also live dangerously close to them, so I might be biased.", "author": "Anna M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "Who love dim sum look no further, everything is label. The food is so good here. I love it when I bring my own containers and they fill them up. I have a few other friends say this is a good place to teach you names, and what each item is.", "author": "Seaera T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-23", "description": "Only four days after returning from my trip to China, I found myself driving slightly out of the way to pick up some cheap take-out dim sum for lunch. I just love dumplings and buns so much. CAN'T STOP WON'T STOP. \n\nI chose three things: shrimp, chive water chestnut dumplings (3 for $1.85), beef rice roll ($2.10), and pork buns (3 for $2).  I chose the dumplings based on the old Chinese lady ahead of me buying a ton. I figured she knew what to get here, even though instincts told me not to buy dumplings that were just sitting on a tray and not in a steamer.  The filling was good, but the skin of one dumpling was dry and hard. I guess I got stuck with an old one.  The rice roll was pretty thick. I like it. The best thing was definitely the steamed pork bun. The filling was delicious! While eating them, I thought about how happy and rich I'd be if I only ate those pork buns for breakfast lunch and dinner.  It's a shame they're not better for you. \n\nI wouldn't consider this place a destination by any means, but if you're in the neighborhood and want some cheap Chinese food, here's your place.", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-28", "description": "The lady at the front, SUPER RUDE. Treats customers like shit. Place is run down. ONLY good thing, dim sum is dirt cheap.", "author": "Tiffany W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "Generally good quality dim sum for the low price, great tasting congee/porridge.  Taking it to-go is a better option than trying to eat at the store with limited utensils available and a constant draft blowing in.", "author": "Robert L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "this is only for the sweet rice cake and the service. This has got to be one of the nicest asian bakeries I have been to. The lady that helped me out was the complete opposite of rude and was so friendly. I got my hubs a order of sweet rice cake which was 3 slabs for $2.00. This is kinda pricy but the hubs loved it. He was like its just the right consistency and super soft because sometimes it tends to be dry on the end. He also got a fried dough stick which was hella oily per the usual but was a good crunch flavor.", "author": "Tao Tao W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "Tasty, affordable and quick dim sum. Perfect for a lazy weekend morning or afternoon. It can be hard to find a parking spot, but you don't need to put much time on the meter because getting in and out of TC Pastry is easy. We love to add their fried wontons and curry puffs to our order.", "author": "Annaliese D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "This review is solely based on the customer service of the owner. \n\nI have been coming here for ages. I remember back in the days there was an old guy (I believed it's owner's father) sitting at the corner watching the operation of the store. The last two times I visited was a bit disturbance.\n\nIncident 1: It was at the end of the day. They were selling dim sum at a discounted price. The old lady in front of me asked the owner (the bald guy) to microwave her food. The bald guy yelled at her \"Go. Go. Go. Go away.\" Well, the owner could be a bit nicer. He could just tell the old lady microwave service was not available for discounted dim sum, but he chose to yell at her in front of others. Perhaps, next time I should shot a cell phone video.\n\nIncident 2: It was the closing time again. The bald guy was cursing loudly at his kitchen staff in front of customers. This disturbed my nerve a bit. I just felt like I was shopping at a sweat shop.", "author": "J L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-27", "description": "10/10 location, 10/10 food, 10/10 price 10/10 convenient location near boba and GG park. You know it's good when even white people come to this hole-in-the-wall. Also cool because the ladies won't make fun of you when you order in shitty Toisanese.", "author": "Cailin H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-07", "description": "I've been visiting this place since the late 1990s.\nI have had dim sum at some pretty fancy places, and some pretty divey places, but hands down, without a single doubt in my mind, this place has the best beef dumplings I have EVER HAD. \nThe consistency. The bits of water chestnut. The seasoning. Even the bit of greasiness. It is all AMAZING. I would eat it every single day if I could. Every single day. \nI don't make it into the city often, but I did today, and I bought them out. The orders are, I dunno, like $1.70 for three. I got 7 orders of it. It won't last through tomorrow. \nI will weep bitter tears of paradise lost when I run out. Which will probably happen first thing in the morning.", "author": "Ev L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-14", "description": "Been going here on and off since 2005.  This place is a small store, nothing fancy for sure.  If you want dim sum with a fair price, then drop by.", "author": "Guest U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "I really love coming to this Dim Sum joint, because I'm not treated like a second-class citizen! Everything here I've eaten has been fresh and delicious. My favorites include the Hargao (sweet shrimps and chives inside a rice wrapper with water chestnuts), Chicken or BBQ pork buns (delicious, hot, and filled with lots of fatless meaty goodness), Chinese donuts, chicken and veggie dumplings, and fried shrimp cakes. My boyfriend really likes their hot dog buns and combo buns here as well. \n\nIf I was a super fatty (and I have been MANY times), I'll order three or four boxes to go that'll feed my family and friends. I really love that the ladies make everything here, and give you suggestions on things that they like to eat. I always tip these girls, because they are so fast and efficient when it comes to packing things up.  \n\nI'll take chop sticks, thanks!! I'm happy you didn't just assume I wanted a fork! MORE PORRIDGE PLEASE!", "author": "Charlene S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-24", "description": "Stopped by for a mid-afternoon snack - this place is simple and fast, with a pretty extensive menu (printed in English and Chinese). The prices are pretty much unbeatable (3 for $2.50 for dumplings, or $0.80 each plus tax). I ordered the shrimp and chive dumpling (made from glutinous rice flour), and the taste was fine but it's evident that the taste is from use of MSG and a fair share of oil. The dumpling was quite cold and the glutinous rice was a little too thick for my liking. Overall, though, this is a pretty good place to grab some dim sum. Would be much better if the food were served warm though.", "author": "Michelle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-22", "description": "After a few meat-filled days, I was in the mood to go meatless. Their mushroom & veggie steamed bun hit the spot. It was delicious!\n\nI also enjoyed their shrimp-chive-water chestnut dumpling and sesame ball. Their sesame ball was a bit greasy, yet had a nice sweetness to balance the savory in my meal.\n\nIn a recent visit, I tried their cocktail bun. Be sure to eat it while it's still warm. I made the mistake of letting it sit while I took care of errands and it tasted pasty cold.\n\nCash only.", "author": "Cathy K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-21", "description": "My best friend and I used to come here all the time when we lived in California for college. We LOVED  coming to get food here! We'd always leave with boxes full of goodies. Now whenever I'm visiting and near the Zoo or Ocean Beach, I always make a stop here. My faves are the shrimp & cilantro dumplings, the shrimp cake, the coconut balls, the spicy won tons, the shrimp or pork dim sum, etc...ugh so much to rave about. The place isn't fancy but we all know how little hole in the wall places sometimes produce great food. This holds true for TC Pastry. The prices are GREAT, the food is yummy, so if you're in the neighborhood stop in. ;)", "author": "Kanani K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-22", "description": "Cheap Asian dim sum to go. They have a lot to choose from and 90% of the stuff is good. Pork buns are small but they come in 3 and its around $2. Parents always gets the Chinese donut wrapped w/ rice noodles for my nephews. They only like this joint for that one particular item and know the difference if you get it somewhere else. Can't pull a fast one on them cuz they won't eat it.", "author": "Julie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-20", "description": "This was always my place to visit when I go to SF. I ordered several different dim sums ($53)and it may be the last time I will come here. They have changed chefs or they are using inferior ingredients, but it is likely that the chef has changed. The Siu Mai was awful because it was not moist and little flavor, the har gow (shrimp dumplings) was not fresh and had more bamboo shoots than shrimp (very little shrimp), the chew Jhow dumplings had an unusual amount of preserved vegetables than pork, beef wrap rice sheet tenure changed and had little taste, the BBQ pork buns had less BBQ pork filling than normal, the deep fried rice balls with pork filling had unusual thick skin. I cannot recommend this place for dim sum.", "author": "K Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-19", "description": "TC Pastry has the absolute best sesame seed balls I have ever eaten, and I try out such pastry wherever I go.  This place is the place to go in San Francisco for Dim Sum!", "author": "Bob P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-23", "description": "It's my go-to place to get some inexpensive dim-sum whenever I come into town. My usual take is about 1 doz. steamed pork buns, 1 doz. custard buns, about 6 pcs each of various dim sum pastries and whatever my kids and I have a mood for. I take them home to freeze and pull them out whenever we have a craving. I'd re-steam them since microwaving would mess up the pastries. Sure, the front/dining room area may not look sparkling clean but this place is not a 5-star restaurant. I've been to some nice dim sum restaurants and you're paying for the privilege to be served. There was one dim sum restaurant that I thought was nice that I took my kids to for some dim sum, saw there was some black flakes in one of the dim sum bamboo steamers.. I looked closely and it had tiny legs. It was steamed ants in the dim sim. Told the head waiter. Head waiter looked at the dim sim, picked up the bits that had the ants, smooshed it onto my daughter's plate and comped only that particular dim sim plate and ordered a new one for us. Gross. A few minutes later, there was a distinct odor of Black Flag coming from the kitchen area. We haven't gone back there and that restaurant is no longer there. So you really can't tell a book from its cover. Dim sum making is becoming a lost skill since not many people wants to do something so tedious. It takes a lot of patience to make those things.", "author": "Cynthia W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-29", "description": "Great place to go for a quick take out.\n\nI love their noodle wrapped Chinese donut \n\nChicken turnovers are so good too\n\nEverything else is pretty good too", "author": "Carol Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "It's super cheap. It's tasty. The bbq pork buns are legit. The shrimp dumplings are respectable. You can fill up on a few bucks. No reason not to go here.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "I had been wanting to try this place for a very long time. Finally walked over last week and got all types of shrimp dumplings, steamed pork buns and sesame balls. I may be spoiled since I've lived in SF my whole life and have had the chance to try dim sum from all over the city but unfortunately this place wasn't as great as I had expected based on the Yelp reviews. My favorite dim sum place which has the best shrimp dumplings I've ever had are at a hole in the wall place on Noriega. Sesame balls were pretty good though.", "author": "Sosse M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "During the last hour of opening each day, they sell most items at 3 for $1.30, or at a discounted price!\n\nSpicy wontons (WINNER!!), sesame balls filled with red bean or mung bean, pork buns.. you can mix & match and easily try tons of different options and get full for less than $5. This will for sure be one of my go-to places for lazy nights that I don't feel like making dinner, especially since it's literally around the corner! That being said, I wouldn't consider it a place you'd travel to, but it's great if you're already in the Sunset area and are looking for cheap goods.\n\nIt definitely does not have the most aesthetically pleasing interior, but still.. what a hidden gem this place is!", "author": "Andrew T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-17", "description": "What?! 3 pieces of delicious Dim Sum for under $2?!  That's what I'm talkin' about!\n\nThough, I didn't really care too much for the potstickers.\n\nThis place is pretty small, not really the dine-in type - more like a grab & go.  They have a pretty good variety of dim sum, and because the price is so cheap, you can really afford to try a few different ones. My faves were the steamed dumplings with shrimp or chicken.", "author": "Shamina K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-06", "description": "Why drive all the way to Chinatown for take out quality dim sum when you live in the Sunset?  T C Pastry is good enough.  The price is right.  Food is tasty.  Service is polite and efficient.  I haven't found a better place this side of Golden Gate Park.\n\nI buy enough steamed items for 3 meals.  They freeze very well.  The fried curry bun is my favorite.\n\nThe sticky rice cake (nien gau) is delicious.  It is only available at Chinese New Year.", "author": "Debbie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "Let me say that I've had a lot of dim sum in my lifetime... \n\nAnd this is a place you want to go! Cheap and good!\n\nI always buy to go, and take it to the beach or golden gate park. It's not the nicest place to eat but they do have tables if you want to stay. \n\nEverything here has been pretty well made. I don't think I disliked anything. And I love the fact that $14 of dim sum will stuff my boyfriend and I, where as if you go to an actualy restaurant, it will cost around 30 for the same amount of food\n\nFavorite items:\n-Siu mai = pork dumpling\n-Deep fried won ton (curry flavored, so good! but a lil greasy)\n-Bbq pork buns - or any steamed buns. \n\n\nJust remembered... I would skip on the steamed rice noodle rolls, its a lot of dough.. \n\nAnyways, I am so glad they have a 2nd location in daly city! and it is just as good. :D", "author": "Erica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "This place is what it is. For what it is, it gets 5 stars. I downgrade to 4 so that there is at least some semblance of continuity across the review spectrum. But the bottom line is - if you're looking for hong kong flower lounge, don't come here. This place gets 1 star on the flower lounge scale. \n\nBut this gets 5 stars on the \"I just want some take-out dim sum without the hassle of long lines/mobs, fancy dim sum experience\" scale. \n\nI like to come in here on a Sunday and just chow down. I don't order all at one time (b/c they have a problem here keeping food warm, no question), I order a little of this, a little of that...they have great diversity of menu choices and great prices, so you get to try a lot of stuff.\n\nMy #1 favorite here is the duck egg porridge. Man that is good. I get a large every time. \n\ntheir dumplings are excellent. I particularly like the 'Fun Gor\" I think it's called (meat, chives and peanuts) and the mixed veggie/shrimp dumpling. \n\nTheir buns are ok. Too doughy for my taste, but the fillings are good. I like their Chinese sausage bun, not too often that I can get some straight-up, whole Chinese sausage. \n\nThe curry dim sum is fine, the spicy wontons being the best of that bunch. I don't get out of there without chowing at least a few of those down.\n\nAs reported elsewhere, their potstickers are solid. their rice noodle rolls are not that great. The noodle is just too bland and does not get sufficiently compensated for with sauce and filling.\n\ntheir lotus leaf sticky rice is not the best I've had, but not terrible. In fact I somewhat prefer their fried rice ball instead, that's pretty good.\n\nBiggest complaint about this place - lack of sufficient beverage choices. It's disappointing when I go to a Chinese take-out kind of place and they got a bunch of soda bottles in the refrigerator but no plain iced green tea. No worries though, in this neighborhood a tea joint is never far away and in fact there is one on the same block. So I stop by there to pick up an XL green tea before I go into TC Pastry", "author": "Ravi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "While on Irving Street, this is definitely my go-to dim sum place!  Overall, I thought the consistency of this restaurant is pretty good and I love their selection.  This place definitely gets the job done whenever I am craving dim sum.  Keep in mind that I am very picky with my dim sum, so this place is proved to be very good!  What I also love about this place is that I can stop by and get my favorite pork and preserved egg porridge.  I love how this pace has plenty of the egg and pork in there (some places are actually pretty stingy with this).  I've had other porridge that taste completely of MSG (YUCK!).  But thankfully, this place isn't one of them!", "author": "Teresa W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "Best value on the boulevard (i.e., Irving Street).  Friendly staff.  Had the hai gow, thought at end of the day the skins were thick and hardened.  Also, bbg baked bun--and that was good.", "author": "Thom S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-31", "description": "Came here on a gloomy day with the SO because we weren't trying to find a real dim sum restaurant but more of a cafe-style type of dimsum so that we could relax a little (do we sound like an old couple? It could definitely get worse.)\n\nEverything we ordered, ranging from the steamed items (shu mai, har gow, lotus leaf wrapped rice) to the fried items (dumplings, fried breads etc.), I don't really have anything for. I would say price point is cheaper than a dim sum restaurant but not particularly that cheap in general (I know, it's hard to please an Oakland native with SF prices).\n\nParking is also not the best of the best in this area (yep. Can't stop making the comparison to Oakland's parking to SF's) but you can always pay for metered parking (even on Sundays).\n\nThe place is pretty laid-back and nothing too special. I would say, order some food, relax and chill but this is definitely nowhere close to the best dim sum I've ever had...", "author": "Winè C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-15", "description": "As much as I love this place since it's opening, I have to think twice about its cleanliness.\nIt happened twice with this female employee constantly scratching her head and wipe her nose with her hand. She was handling the take out dim sum with her bare hands no gloves.\nI would give the dim sum 4 stars but the sanitary condition 1 star.\nI wish the owner give some in-house staff food handling safety lessons before someone get food poisoning.", "author": "Cocoa W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "A small dim sum shop with just about any dim sum/Chinese snacks you could want.  They have a case to the left, a case in front and several yellow printed signs all over to give you the prices.  Some of the things I tried:\n\nMini egg tarts (4 for $1.50): these don't really have much filling because they're so small; but they are a nice little sweet treat.\nEgg rolls (3 for $2): these are fried to a little bit darker than golden brown.  They are crispy and pretty big.  They definitely have a good amount of grease to them; but if you don't mind that, then they are pretty decent.\nSteamed buns (3 for $2): I like that you can mix and match.  Options include bbq pork, egg custard, chinese sausage, veggie, etc.  They are kind of skimpy with the fillings, but the flavor is okay.  The bun itself is nice because it is not overcooked nor dry.\n\nThey have a couple small tables, but I think most people take it to-go.", "author": "Samantha L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "Cheap! Get there during the last hour and everything is half off, extra cheap.\n\nSpicy wontons and sticky rice balls are my goto.", "author": "Matt K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "Good food. \nFantastic prices.\nCash only.\n\nWe recommend the BBQ pork buns, shrimp + cilantro dumplings, and egg custard. Ate at one of the four, four-person tables. Soy sauce, chili sauce, and plastic forks available. Everything was sticky. We loved it.", "author": "Marbu J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-02", "description": "Definitely one of my favorite spots on Irving! \n\nI love their jook ($1.50 for a small?!!), their custard buns, fried curry wontons, pot stickers (though I do recommend you to bring it home to microwave them bc they're not hot.. ever), curry puffs.... basically everything with the exception of the har gows. The har gow skin is just too chewy and thick for me! \n\nKeep in mind, this is primarily a take out dim sum spot, so nothing is really going to be as hot as a sit down restaurant!\n\nIf you go early enough in the day, you might be able to catch their ja lern (chinese donut wrapped with rice roll skin). It sooo yummy, but make sure you get both sauces!", "author": "Tiffany U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-05", "description": "The best shrimp dumplings here. I also tried the BBQ pork bun which was good but a bit too fatty for me. The sesame balls were yummy too. BBQ pork buns run out fast so earlier in the day is best. \nAll orders come with 3 pieces and under $2. You can get your Buddha belly full of good food and still have dessert. It's very filling.", "author": "San C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "A solid 4.\n\nLimited selection, but relatively fresh, and cheap to boot.\n\nNo place really to sit unless you want to hide in back.", "author": "Rafael S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "Yay cheap, one block from my office, and ready to address my hangovers with lots of shrimp and water chestnuts.\n\nNot huge on thier zhong ze (delighfully labeled as rice pork tamale!) thought it was a little too mushy.", "author": "Misha T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-06", "description": "TC Pastry is a no frills place to get cheap dim sum. All you have to do is order at the counter, pay and then take a seat at one of there few tables. The people working there don't know English too well, but there is a menu and you can point to what you want. I really enjoyed the sticky rice w/ meat wrapped in banana leaf, beef noodles, shrimp dumplings and pork bun. You can easily get dim sum for two for under $15. Great place for an easy, quick and cheap dim sum experience.", "author": "Hanhie D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "Our order: baked pork buns, shrimp dumplings, beef dumplings, egg custards, sesame balls, steamed buns (chinese sausage and chicken & veggie).\n\nMy recommendation: go for the dumplings and shu mai, but everything else is not worth it.  The bonus is that we had so much food for a ridiculously cheap price.", "author": "J J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-15", "description": "I bought their egg tart, wife cake, little chicken cookies, etc. They came warm and look very good, they have a lot of traditional HK dim sum that i can't find elsewhere, such as the sticky rice bun, i haven't tried them yet but I feel happy looking at them:)\n\nAnother I came to buy their Chinese donut. My god. It's the best one I've had since 14 years ago back in Canton! I am so happy to find such a good one here!!!i also bought radish cake, water chestnut cake, rice noodle with bitter melon and chicken, coconut bun.", "author": "Ashley C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "I think it's the best dim sum place in the mid-Sunset area. The baked BBQ pork buns, egg tarts, HK milk tea and stuffed tofu are my favorites. \n\nStill haven't figured out what TC means, except that it might allude to \"Tuesday Closed\".", "author": "Kevin N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-20", "description": "For the price, this was great, but there are better dim sums in Chinatown at the same price. The chicken pot pie was too sweet for me, the Shrimp crepe roll was not that good.\n\nOther than those, the Wonton soup was really good! I bet there are other really good things on their menu and I will go back and try some of them.", "author": "Charles Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-15", "description": "I got the steamed mushroom bun and shrimp & cilantro dumplings. Both were great although the bun had a little less filling than expected and the shrimp dumplings were a little greasy on the outside.\n\nBest part was the service: I let them know about my nut allergy and the woman told me what I could and could not get. After she started to pull out the steamed dumplings I asked for she turned around and told me that she wanted to be careful because everything was prepared separately but steamed together. She helped me choose another option based on how things were prepared and stored.\n\nAlthough it's not quite as good as Sunset Bakery, I was incredibly appreciative of the extra mile they went to ensure my food was nut-free.", "author": "Amanda B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-10", "description": "Yummy Yummy!\nFried Curry Wontons: So good! It's actually really filling, so one order (1 order = 5 wontons) is just right for one person. Too much fried stuff is not good for you anyways.\nCurry Fish Balls: I just wish they add more curry sauce.\nEgg Custards: It's good, but personally I like the mini ones more.\nVeggie and mushroom bun (?): The flavor of the mushroom. LOL but l wish that the filling is mixed better. One bit is of mushrooms and the other is of radish, so inconsistent. but I like that they slice the mushroom, other places they just put the whole mushroom in the bun. \n\nThe last time I went they had rice dumplings (zong zi), I had the meat one. I normally dont like eating them, but since I haven't had any for a while, I thought I'll try theirs. I like it. But it may be a tiny bit too salty for some people.", "author": "Chelsea C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "I had been coming here ever since I can remember. Once cannot tell by looking at the building, but this was the best place to get dim sum. I would be still coming here if it wasn't for the parking issue.\n\nBut the owners did open another shop in the Richmond near Washington  H.S. When I walked into Jook Time, it was just the few staff I knew from TC Pastry.", "author": "M C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Good dim sum!  The ladies were friendly.  The shrimp dumplings, shrimp and chive were delicious.  Will come again.", "author": "M S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-13", "description": "The cocktail and hot dog buns were not very good. The cocktail buns seemed on the burnt side and the hot dog in their hot dog bun was the worst hot dog I've ever eaten. \nWe did order other items like their spicy won ton which was tasty and the mini custard tart. \nWould I go back ? NO.  There are better places in San Francisco.", "author": "Bush L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "Yummy dim sum. My new favorite take out dim sum place. The \"spicy won tons\" are delicious. Bits of meat, curry flavor, deep fried in a wonton skin. Yum! Chicken turnovers were kinda like a mochi skin filled with meat and sauce and then deep fried. Trust me. It is better than it sounds! This was my first time, but will definitely be back.", "author": "Sharon T."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-13", "description": "Good dim sum,, but nothing out of the ordinary.\n\nOrdered: Pork, shrimp and fried post stickers\nTaste: smooth and with no chunks of gristle or fat\nFlavor: minimal, but none of the greasy film you get with sub-par dim sum\nAmount: 3 per order\nCost: $0.50 - $1.20 per order.\nAfter effects: no tummy or bathroom spashbacks ;0)\n\nDessert: egg tarts (mini) \nTaste: sweet, smooth and with flaky crusts\nFlavor: good taste and liked the little bite sized cups\nAmount: 3 per order\nCost: $1.20 per order.\nAfter effects: wanted more =0)", "author": "Jai D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "They have everything. I've tried so many different things here, and it's all pretty good --har gow (shrimp dumpling), siu mai, turnip cake, sticky rice, sesame balls, etc. They have a lot of other things like soup, pork buns, etc, etc, but I haven't tried those. \n\nStaff seem friendly. Everytime I've come here, the crowd is different... sometimes I'm the only customer, sometimes there are a few in front of me, and once around Chinese New Year there was quite a line. Either way, they get through everyone's orders pretty quickly and efficiently. Prices are decent!", "author": "Lani S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-07", "description": "Although the prices were cheap (togo-type-of restaurant), I must've came on an off day b/c I thought the dim sum was fair.\n\nOrdered:\n1) Shu mai: 2/5--had better (tasted like pot sticker meat)\n2) pot sticker: 2/5 okay too...\n3) Egg tart: 3.5/5: surprisingly good!\n4) Chive and shrimp dumpling: 2/5\n\nProbably won't be back. We decided to sit down and eat there, but the place was freezing. Our dim sum was cold after 1 minute of opening the container. I was a little disappointed after reading all the raves from yelp. =(", "author": "Jen H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "3.5 Stars. I'm not quite a fan but I would go here if in the area.\nThey offer very cheap Take Out \"Jook\" AKA Congee and Wonton soup.\nTheir baked Cha Siu Baos were alittle odd cuz they minis.( not full size ).\nI think they were 3 for $1.80. Seems like everything was 3 for $1.80.\n\nAll I know is I bought more than enough food for 3 adults for around $18.", "author": "Winston W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "I live close by and whenever I crave for dim sum, I come here!\nReasonably priced and taste great! Portions are good and fast customer service.\nParking is a pain on Irving so try to drop someone off to order for you. Closest thing to Chinatown quality but not in Chinatown haha.", "author": "John Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "Preface: I'm white so bear with me.\n\nTC pastry, on the surface, is your normal rundown/dirty dim sum joint offering fresh and juicy (see: greasy) dim sum at minimal cost with a side of judgmental stares for your white ass. \nTo be honest, you really can't go wrong with anything. What is that dumpling contraption with shrimp? Who knows, go for it. Is that a shard of glass in my pot sticker? Yolo. \n\nThe review is solely based on two things: the baked pork bun and the chicken pie.\n\nThe baked pork bun gives victors a solid run for its money. Victors is better size wise but is a little pricier whereas TC's baked pork buns are a solid mix of sweet and salty; the bun is in a sweet bun with perfectly seasoned bbq pork tickling all taste buds leaving your mind blown (and pocket happy @ 3 for $1.70? wuttttt?!). don't want 3 pork buns? Suck it up and bask in the carb-y salty/sweet goodness my friends. It's been a rough week in the office and your significant other is cheating on you, you deserve it.\n\nChicken pie: have you woken up in the middle of the night, sweating your ass off begging for a chicken pot pie? ME TOO! If you say no, you're un-American and a liar. Every time I hear someone say \"chicken pot pie\" I get happy three times and so should you. So you rush on over to your nearest safeway, tear open the freezer doors and you stare Marie calendar dead in the eyes as she is about to feel defeat as your craving will be satisfied. And then it happens: half way through your indulgence you're just tired of the chicken/pea/carrot/bread combo and toss the rest and do the walk of shame back to bed. Here is the beautiful balance TC pastry offers:  A CHICKEN POT PIE THAT FITS IN THE PALM OF YOUR HAND. Boom, that just happened. After one orgasmic bite, you feel the love that chicken pot pies give you, the consistency you deserve and a serving size that tickles every craving your belly can work up. best part, SWEET BREAD. TC pastry has mastered the sweet/salty and for this I am grateful, and so should you.\n\nSide notes: all of the other dim sum is good. Standard, but nothing to write home about.\n\nBut for god sake, do yourself a favor and scrounge up $3 and step into pastry heaven. Or step across the street to happy bakery and have explosive diarrhea, the choice is yours. this is your dynasty.", "author": "Ryan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-02", "description": "I'm guessing this is the same TC Pastry as the one in Daly City.  This is a \"take-out\" type of dim sum joint. It's small inside but comfortable - there are a few tables, if you decide to eat here.  \n\nTheir dim sum is pretty darn good - plenty to choose from and prices are great!!  On this visit we got shrimp rice rolls, beef rice rolls, shrimp/cilantro dumpling, BBQ buns.  Everything was around $1.90 for 3 pieces.\n\nMy favorite of 'em all is the Sticky Rice Ball w/ Chinese Sausage. Holy Moly that was good!! I usually see sticky rice wrapped in banana leaf but this yummy rice was wrapped as a dumpling...say what!? I am now a fan of this unique creation!!", "author": "jesiree b."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "Best sweet fresh Asian rice cakes! Also water chestnut cakes are amazing!! I always go by for those two staples", "author": "Jocy V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-14", "description": "Of all the cheap dim sums I've been to in the Sunset and the Richmond this is the second best, next to Good Luck Dim Sum.\n\nOther cheap dim sums die out by 1pm. The dumplings become greasy, the pastries harden, it's a fat Asian kid'ss nightmare. TC Pastry's dim sum tastes somewhat fresh any time I go. Even at 4pm, the meat dim sums are still good.\n\nIt's $1.60 for 3 of their main meat dim sum which includes various dumplings and shumais. It's similarly cheap for any of their pastries. I've had nearly everything they sell and never had a problem.\n\nHere's a menu I found with a quick google search: http://dineries.com/ca/sanfrancisco/tcpastry/2222irvingst .\n\nThat doesn't include everything though! They also have larger items, refrigerated items, and some in a buffet style steel pan. I've had their wonton soup; It was simple, yet good. Chicken broth, scallions, and 4-5 sizable wontons. I've also had their mango pudding. This was a first for me and it tastes exactly as it sounds, which is good a thing. I look forward in trying their Durian pudding next. I haven't had anything from the buffet pan but I once saw tofu with chicken inside of it. Suck it vegetarians!\n\nMy favorite items are the fun guo dumpling, barbecue pork turnover (the filling of barbecue pork bun in puff pastry) , chicken pie, and shrimp rice noodle.\n\nThis is the kind of place which I wish I lived near my entire life. A place where I can go at any time of day and get my fill of dumplings, fresh pastries, fruit pudding, and hot soup. All under $3.", "author": "Rahil P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-21", "description": "BEST DIM SUM IN ALL OF SAN FRANCISCO I CAN ONLY SAY THIS IN ALL CAPS APPARENTLY ITS THAT GOOD.\n\nThere I was, another obnoxious New York transplant in San Francisco, crying every night over the lack of cheap and fantastic dim sum on the west coast... yeah sure, San Francisco has the biggest chinatown around, but their restaurants had become touristy, and the food just \"OK.\" And then, like a vision on a flaming pie, it came to me through the prophetic mouth of my roommate- \"T C Pastry... go there my sonimeandaughter\" \nAnd I did.\nAnd it was good.\n\nHuge range of fantastic tasting dim sum for no more than $1.25, including my all time favorite dim sum ever- rice balls! RICE BALLS THE SIZE OF MY FIST. Oh, it was good. And now that I am back in New York, I find myself pining away for the wonders that was T C Pastry... alas, alack, such is the roller coaster of pain we call life.", "author": "Jenna I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "Good Dim Sum. The insides tastes and  feels fresh. It's not all mushy on the inside like many and the dough is thin enough, not to think. \n\nI like the insidse better then Good Luck dim sum on Clement. But the dough is a little thinner at Good Luck.\n\nI'll be back.", "author": "Anthony M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-27", "description": "We stumbled upon this place while on a quest to find one of my fondest childhood comfort foods, Bak Tong Gou (White Sugar Sponge Cake). We drove down Irving, confident that we would find at least one dim sum restaurant serving it, and sure enough, we found TC Pastry. This place is the proverbial hole-in-the-wall Chinese takeout joint. We had no idea whether the food here was good or even safe to eat, but they had Bak Tong Gou, and that was reason enough for us to pick some up. We bought 2 orders of it, 3 pieces each, for less than $2 an order. What a deal! Better yet, it was every bit as good as the ones in Shanghai. They were moist, soft, chewy, and mildly sweet. Craving satisfied. I did not have a chance to try the other dim sum, but all of it looked fresh and appetizing. \n\nRecommended: \n\nBak Tong Gou", "author": "Jenny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-20", "description": "Not the best dim sum for being in sf but it wasn't horrible.\n\nPrices are relatively cheap.  The mini egg custards are alright, leave you thirsty.  The deep fried curry bun didn't taste like what I was expecting (I've had it elsewhere before).  The traditional hot dog buns were good, and I also enjoyed the sticky rice balls with chinese sausage in them.  \n\nI spent less than $5 and had enough for left overs.  If in the area it wouldn't hurt to stop by.", "author": "Belinda T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-25", "description": "Went there hoping to get their cha leong but was sold out. Sigh. Got their fish and peanuts congee, and it was good with big pieces of fish. Got a fried doughnut to go with the congee and it was yummy. Got some dumplings too. Would go again but distance is bit of a problem for me!", "author": "Ris N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-11", "description": "Cheap Dim Sum anyone? \n\nI would have never found this gem if I didn't wander the teeny-bopper walking,  Asian gangster car leaning, and old man spitting streets of Irving. This place is no BS. Order in the front, get your food and stuff your face within minutes.\n\nThank you, my boy Stanley for visiting. Good Friends. Good Food. Good Times.\n\nEverything is under $2 - Holler!", "author": "Dorian T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "Price is great, service is good however I have had better fried Taro dumpling, Shrimp dumpling and siumai.  They also serve hot entrees and congee as well but I didn't try them. Its also CASH only. I would definitely try the other good dimsum place with 4 starts just around the corner:)", "author": "Claudine V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Very good, and I would recommend it if you are in the area, but not quite up to Good Mong Kok Bakery.  I had a variety of dumplings and buns and enjoyed them all - their chicken, pork, and beef dumplings were all very well done and flavorful, but I thought the shrimp dumplings were a little too cheuy and the bun was a little doughy.  There are about 4 or 5 tables though to be able to sit with friends, and they are also very cheap - 2 people can easily get out of there for $10.", "author": "Jesse F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "I've been to Yank Sing and other Chinatown Dim Sum places and I always think, \"This is good but why am I paying over 4 times more for 3 pieces when I can get just as good at T&C?\"\n\nAnyway, T&C is great because you go up tot he counter, point at things and pack it all up for you. They ask for $9 and you think, 'Wow, that's cheap!\" Then they hand you a bag overflowing with dim sum that could feed a small country. Also, as its namesake states, this place truly is a dim sum \"specialist\". \n\nI'm glad I live a few blocks away because I love grabbing lunch that only costs me $4.", "author": "Rylan C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "While on Irving the other day, my friend decided to take me to TC to stop by and grab some snacks before heading back to his house. When we first got there and saw the prices, I was surprised at how inexpensive it was. We went pretty late in the afternoon, so most of the items were gone, but we did get some Rice Noodle Roll w/Shrimp, Turnip Cake, and Egg Custard Tarts. I believe everything was around 3 for $1.50. Then what surprised me again was that the dim sum was pretty good - even considering it was probably not so fresh, and we didn't eat it until an hour later back at home.\n\nI kinda wanna come back and try everything while fresh. Seeing a small place like this to grab good tasting and cheap dim sum is kind of all new to me - growing up in the 'burbs, I'm used to going to the all out restaurants, so this was pretty cool.", "author": "Tiffany K."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-14", "description": "I kept hearing about this place. I finally came by after being in the area. Since the other dim sum place up the street yelp reviews said they had steamed roach with their food. I stopped going there. Anyways back to TC Pastry,  I ordered pork and shrimp dumpling, potstickers and a chicken pot pie.  It was cold, dry, and did not have any flavor.  Definitely not coming back!  Two stars for cheap prices and cleaner bakery than most downtown area bakeries.", "author": "Diana L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-24", "description": "This place is as bare-bones as it gets. Great food purchased at a counter with short wait times. Don't expect anything but huge volumes of cheap dumplings that are among the best you've ever had at five times the price.", "author": "Michael K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "I love their jook! It's pretty cheap, $2 for small, $3 for large. I rather have the large portion than small, its only a dollar difference! I love coming here for that only and their egg tarts!", "author": "Sandy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "I'm generally not that picky when it comes to dumplings, so naturally, I like this place. It's tasty, cheap and parking isn't too difficult.\n\nIf you have a mix of sweet and savory, make sure to ask for them to be packed separately, or else your hargao and siumai will be rubbing all up against your sesame balls.", "author": "Amy D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-19", "description": "My parents brought over a batch of dim sum.  TC Pastry still strikes me as cheap and average but one item was very good (it's my mum's favorite): steamed mushroom buns.  They're small and the dough part is just okay but the filling is excellent with juicy, large slices of more than one kind of mushroom, celery and carrots.   \n\nThe steamed chicken buns continue to be just okay.  The steamed cake was too dense and tough.  You can tell just by looking at it that the texture is wrong.  The sheng jiao bao isn't filled with juicy pork but it has this mixture of ground meat, water chestnuts and things you'd normally find in the hom suey gok (deep fried savory cousins to the sesame balls). The curried beef turnover didn't have a flaky crust/shell.  You could tell that it was wrong just by looking at it.  \n\nGet the mushroom buns and the red bean mochi (if you don't mind the coconut).", "author": "Lolia S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-21", "description": "When out in the avenues, sometimes we get hungry, this place will do just fine. \n\nWe usually get baked pork buns, hot dog buns, and sometimes siu mai.  The buns are not too large, maybe about the size of a baseball and filled nearly all the way with meat goodness.  Two will do more than satisfy for a snack.  The hot dog buns are always a hit.  18 of them, a few hot dog buns and a few pieces of shrimp dumplings ran less than $18.\nThe siu mai was just OK and I have had a lot better, but 3 of them for just few dollars is a good deal.\n\nNot much on atmosphere, most things are to-go.  Bring cash.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-14", "description": "way better service than Good Luck dim sum on clement!!  I wished TC pastry was on clement.  But I have to admit, not everything here is good. I like the chicken su mai, shrimp & chives dumpling and that chicken with egg thing. I forgot the exact name of it. The pot stickers were nasty. Other than that, everything else was decent. Great service too!", "author": "Alyce l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "What's not to like about quick, cheap dim sum? Super quick service on a Federal Holiday.", "author": "Anne T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-30", "description": "Crap.\nIt all tastes like well-seasoned fecal matter.  The to-go box was literally a little kiddie pool of grease.  Like, don't get me wrong, some extra greasy dim sum isn't necessarily a bad thing, unless you're at this place.\n\nThe luke-warm siu mai can easily slide down your throat with all the lubricant on it, the har gow is in the same throat/boat, deep fried taro root wasn't that bad, and the cha siu bow was pretty sub-standard--small+mediocre, shit filling.\nCrap.\n\nPricing was actually all kinds of cheap.\n\nStory time:\nSo, some friends and I each got a bunch of random stuff (see above) to share and try the variety of dim sum they got.  After about 5 dumplings and a jigger of minutes, the lethargy set in, eyes got weighed down with grease, mind activity came to a screeching halt, and the need for someone to invent a bed-toilet were all present.  Then ''the rumble.''  The horrid, horrid rumble down below.  Who knew har gow could be so explosive?iCrap", "author": "Gar Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "I've been coming here for over 15 years and this dim sum joint still hits the spot.  Although I speak the language, this place derves 5 starts because they speak the best English and they also have signs in English.  The owner and staff are always very friendly (not rude) and to top off it off, she said \"take care\" on my recent visit!   That alone deserves 10 stars!", "author": "MeLuvCookie M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Love the dim sum here! Been coming here for a few years. The noodle rolls with beef or shrimp are really good. The noodle is a bit thicker than other places, but I like it! One order is usually pretty filling if you end up getting other stuff. The bbq pork bun is good, egg yolk bun... bomb... the siu mai and hai gao is good here too. The porridge here is piping hot, it's not like other places that sit around and look disgusting. I think it's cause a lot of people order from here so they are constantly making new batches of it. Like I said though, everything here is tasty and definitely worth trying if you're in the area or if you don't feel like having your traditional dim sum at a dim sum house with tea.", "author": "Johnson S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "I went there twice, i think it is worth to try! They provide a lot of Dim Sum, it tastes really good.", "author": "Yuerong G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "If you're in the mood to pig out and have a few bucks, why not go here? Sure, it's not the prettiest of all places, but hay the food is good. Actually, from the outside it looks a little sketchy, as in super dark, half covered up with papers posters cardboards etc, and you cant really tell wether or not it's open.\n\nSo in conclusion,\nYay for food\nNay for environment (but who the hell cares about environment when all you want to do is pig out?)", "author": "Jessie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "This place is a low-budget wonder. I'm obsessed with their curry puffs and spicy wontons. If you're in the area and are looking for something quick and togo, this is the place you need to go for cheap dim sum. I usually stop by here before heading to a park to hang out just because the food is so easy to take along and it's SO good.", "author": "Jasmine P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-19", "description": "i'm LIKING the new remodel here. Looks nicer than how it looked before.\n\nThe service is slower though than before and they keep running out of har gows when i come here...\n\nalso their prices slightly went up!", "author": "Kenny L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-05", "description": "Is the place dirty? Yes\nIs it cheap? Yes\nDoes it look like a dump? Yes\nIs the dim sum good? Oh Yeah!\n\nIf you are one of those judgmental types that can't stand things old cardboard boxes as the rain mat and beat up tables and chairs just keep walking. But it you like good dim sum and have ever seen how similar restaurants in Asia look, then this place is for you.  \n\nMy latest discovery here is the chicken turnover.  Give it a try and you won't be disappointed.  The heart attack inducing Chinese donut is pretty darn good too but make sure you hit the gym later to burn off that grease.\n\nMost of the menu is prices for 3 items but they will let you get individual pieces if you ask.", "author": "amul s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Hands down best dim sum in SF. Hai gow with water chestnuts ftw", "author": "Tim O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-04", "description": "This is the way dim sum should be:  delicious, cheap, and easy to get in and out quickly to pick it up!!  \n\nTC Pastry has all of the usual dim sum suspects, and do them well:  their egg custards are the most flavorful I've had in San Francisco, and their shrimp cilantro dumplings are divine!  The pork buns are perfect in meat-to-bun proportion, and the chicken pot pies combine veggies with a strange-yet-delicious sweetness!\n\nYou can easily get enough to feed a family of four for under $10, which is remarkable in this day and age, and everything I've tried here is delicious!  If I had to count a downside to this place, I'd say it's that it is tiny, lacks any real ambiance, and the linoleum floors are a little depressing, but it's a bakery, not a four-star bistro, so you come here to pick up items for take out, not really to eat in (although they do have a few tables should you care to).\n\nIn a neighborhood where there are lots of places to pick up dim sum, this place is by far the tastiest, least expensive, and best culinary option!", "author": "Amy L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "This is like the dunkin donuts of dim sum. Super fast and actually pretty tasty. \n\nNow the quality of the building is horrendous and the workers want you in and out fast in what seems to be a recurring theme here on Irving. The dumplings were great but in my opinion a bit oily. \n\nI liked the cilantro shrimp dumplings!", "author": "Jess E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-15", "description": "I am a white guy married to a Chinese woman.  I know Asian food.  This place has amazing snacks!  If you are lucky enough to be there when a fresh batch of curried wontons comes out of the cooker, you are in for a treat.  The food is great and the people are nice as well.", "author": "Tom B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "WOAH. I never thought dim sum from to-go places could be so good! Dim sum was my favorite cuisine growing up and I only ever went to restaurants. I tried to-go dim once before but made the mistake of taking it home and microwaving it for dinner. This time I ordered 3 dumplings, sat down, and ate it right there. YES! I'VE FOUND GOOD DIM SUM! I got a ha gow, deep fried taro dumpling, and a pan fried chive and shrimp dumpling. The ha gow was amazing (and way better that yank sing!). It had big pieces of whole shrimp and water chestnuts. So. Amazing. The taro was delicious and was one of my favorites before I became vegetarian. Unlike yank sing, the chicken is in the middle of the dumpling and not mixed into the taro and could be easily avoided. I still love the taro dumpling and it was delicious here. The fried chive and shrimp had a thick skin which i wasn't terribly found of (think a steamed bun with 1/2 the thickness, then pan fried), but the shrimp and chives had a very nice flavor.  \nI chose 3 different items and it came to $2.10 although 3 pieces of ha gow or shrimp and chive are $1.60 and the taro was something like $1. 80. I'm not sure how she calculated it, but its a better deal to get 3 of the same", "author": "Alice R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "This is truly a bomb dim sum place, it is a typical hole in the wall that can easily be passed up, but it is hands-down a hotspot for authentic dim sum! I have come here for years and will keep coming back!\n\nWhy does TC deserve 5 stars? (my first 5 star review by the way)\n\n-Quality, authentic, tasty, freshly made dim sum..in summary\n\n-Fairly wide selection...most of it is displayed at the counter so even if you do not know how to order in chinese, you can pretty much point to it\n      ---a few items that I like and recommend:\n                 --the fried, curry flavored wontons are one of my favorite  \n                 items there....they are quite popular...may be a bit on     \n                  the oily side, but a must try :P\n\n                  -curry fish balls\n        \n                  -sesame dessert soup\n\n                  -chicken 'siu mai' (I know most of you traditionally eat the  \n                   pork or even beef siu mai...but this is definitely a nice  \n                   alternative for those who prefer chicken meat like me!)\n\n                   -rice crepes (shrimp, beef, chicken/bitter melon, and\n                    vegetable/mushroom stuffed are available....even though\n                    I am not a fan of beef, it tastes the best here)\n\n-And it's CHEAP!! You can squeeze in like 3 different dim items for about $5...definitely a deal you don't find in many places! And don't forget, the dim sum is GOOOOD! \n\n-The staff is pretty friendly and quick...beware the line can be long during lunch hour, but it moves smoothly\n\nA few things to keep in mind:\n\n-Parking is street metered and since this place is located centrally in the \"chinatown area\" of the SF Sunset district, you may have to make several rounds before finding a spot\n\n-This place is best for to-go orders/quick snack because there are a limited number of seats and the tables are not always clean\n\n--Stop by here and you won't regret it! 5 stars all the way!!", "author": "Wendy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "fast service, cheap and good dimsum! On the go food, and they open early at 7am, if you come right before they close at 7pm, the dimsum is discounted\n\nUsually 3 pieces for 1.50! Better than eating at restaurants", "author": "Quyen T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "Lately I've been getting into the habit of taking long walks.  Well, semi-long walks.  And this little dim sum place that could is maybe about a mile or so from where I live.  Thus how I justify my consumption of little dumplings of goodness.  And don't get me started on their sticky rice in lotus leaf.  No, really, don't get me started because I won't stop ooh-aah-ing.\n\nHands down the best chinese donut I've ever had in my entire life.", "author": "Yohanna B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-11", "description": "Visiting San Francisco with my kids and wanted to have some dim sum without actually going to Chinatown. Relying on Yelp for most dining options available, we decided to come here after visiting the Golden Gate park. We were pleasantly surprised to see all the offerings on this strip, but stuck to getting our dim sum fix at TCP. The staff were very nice and patient while we tried to make good decisions that would not render our kids thinking we were nuts and going overboard trying to satisfy our cravings. Try to understand- we live in Kingsland, Georgia....we have no access to good Chinese food nearby....not good when you grow up eating excellent food from all different cuisines. We were quite pleased after we filled five hungry tummies for $20!! I don't remember  the names of what we ate, but they were All good! We will be coming here again when we visit the city in the future!", "author": "Eleanor C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-15", "description": "3.5 stars.  This is a bit of a dive with very bare bones tables, so it's better for take out.  But it was super cheap and quick to order a bunch of dim sum to go, including rice noodles with shrimp, vegetable dumplings, turnip cake, and especially the yummy chiu chow fun guo (chiu chow style dumplings with peanuts).  Altogether it was $11.  Wish I had this close to work - I'd be a regular.", "author": "Vivian W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "Whenever I'm in Sunset, I come here for a quick snack. They have dim sum - the usual dumplings. They offer chow mein, porridge, and some buns on the side.  But I come here for the black sesame soup. I always pick up a large since I eat half now and save half for later. I like how they make the black sesame soup, they grind sesame very fine and they put just the right amount of sugar. \n\nThere are a few chairs and tables for folks to sit down. But most of the time I just do take out.", "author": "Candace F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "Probably the best dim sum in the sunset.\nI always order the pork dumplings and the won ton soup, you can't go wrong.\nFor the price and service go here instead of going to happy bakery.", "author": "Corey W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-02", "description": "It was getting to be afternoon & so the boy & I had to go around trying to find breakfast food @ different places.  We tried to go to Sun Maxim because of all the good reviews but it was under construction.  We finally ended up here & were glad to find the abundance of food choices available.\n\nIn total, we got 4 Cocktail buns, 3 Lotus seed paste buns, 3 BBQ pork buns with oyster sauce, 2 Put chai ko (bowl-sized sticky rice pudding), & 1 portion of steamed Sponge cake.  The cocktail buns had really good egg flavor & the filling was not too sweet.  The put chai kos' were too tough & they had a strong coconut flavor which I was not used to.  The BBQ pork buns were mediocre & the incorporation of oyster sauce was not as weird as we thought.  The sponge cake was my favorite; it was nice & spongy but not too sweet.  It was oily for some reason though.\n\nOverall, the items were pretty good & for very reasonable prices too.  I am not sure about other places on Irving that sell baos, but unless otherwise convinced, this is going to be my go-to place for now.", "author": "Karen S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-12", "description": "After devouring these coconut mochi balls with red bean filling every time they show up at my friend's house, I decided to find the place that makes them.  Therefore, my review is only based off these mochi balls! \n\nI haven't these from anywhere else.  The sticky mochi part is moist, soft and flavorful. Kinda like an egg-custardy taste to it.  I can't quite tell.  The red bean filling isn't smooth, but a little chunky.  Believe me, I don't like coconut shavings or chunky red bean paste, and these mochi balls rock my socks (when I'm not wearing Tom's).  I will definitely try out their other dim sum offerings next time.  There isn't any seating, so I guess you'll have to nom your food at home.  \n\nLike I say to my best friend, \"Yum yum in the yum\"", "author": "Lisa X."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-13", "description": "With all the rave reviews about this place and being convenient to boot, my brother and I decided to give it a try.  We got there about 1130 and is wasn't too busy.  It is true the servers seemed bored, but they were efficient.  There was a strange looking guy in the back drinking some tea and later a can of Coke staring out at the customers.  Maybe he was making sure that the servers were giving out any freebies.\n\nWe ordered our standard of a couple of steam pork buns, hom fun (sort of a rice roll), chive dumplings, pork siu mai, har gow, and something that I can't remember.  The price per three items was about $1.75 - no super bargain since Happy Bakery across the street charges about $1.50 for similar.  We were going to eat our lunch there so they gave us a plastic tray and the dim sum was in a flop top plastic container (like a sandwich container).  We got our own plastic forks and started to chow down.\n\nThe food was cold!. I don't mean luke warm, it was cold. Even though we told them that we were eating in, they didn't bother heating it up for us.  Soon the line got a little longer and we didn't feel like asking them to warm it up for us.  If we did, we probably would have received the evil eye.  It was tasty, except the pork buns were not too good.  They charge extra for tea.  Additionally, they charge sales tax when most dim sum places like this already include the tax with the price.\n\nThe interior is typical of Chinese to go places - a little dirty and greasy.  If it weren't for the cold food, I might give it 3 stars, but their cavalier attitude deserves 2 stars.", "author": "Robert J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "They have simple, cheap, delicious dim sum options.  Whenever I'm in the area, I make sure I grab the cilantro shrimp dumplings and mushroom and vegetable steamed buns.  A yummy snack quick snack!  I docked a star because they do microwave your dim sum when you eat there.", "author": "Coffiend K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "One of the better dim sum bakeries in the sunset. My mom who is a expert in shopping for the best quality dim sum gives this place her recommendation. The prices are good and the food though a bit too oily for my taste is still delicious. \n\nMy favorite foods here is the turnip cake, har gow(shrimp dumplings), siu mai( pork dumplings), and the Nigh won bao (custard bun).", "author": "Jude N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-04", "description": "Been coming here for years. Fav things to get is the baked bbq pork buns, the best. Such tiny little guys are packed with so much pork and flavor, and at 3 for $1.60 that's a steal :) I also love the \"ja lerng\" or the rice noodle with chinese donut, sooo good. Good place to grab some food on the go and for cheap! They always get mad at my uncle when he visits SF, because he wants over 100 bbq pork buns, and they scramble to make them asap.", "author": "Vanessa K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-08", "description": "TC is now on our chicken (gai) bun rotation since my daughter is addicted to them.  Very inexpensive.  Two dozen of them plus six of the curry beef buns (the chinese piroshkis) came out to around $21.00!  This is one of the cheapest places around with the best variety.", "author": "Glenn L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-04", "description": "Seriously, I'm not exactly sure what the hype about this place is.  I guess if you're stuck in Outer Sunset and can't get to Chinatown, then maybe, maybe this place will satisfy your craving.  But really, I would encourage anyone with a true craving to spend the time and effort to go out to Chinatown where you can find really 5 star places like Good Mong Kok Bakery and Golden Gate Bakery. \n\nI've eaten at a lot of Dim Sum places, and I have to say TC Pastry was only a \"Meh\" in my opinion.\n\nBottomline - if you have a craving and are at UCSF or Golden Gate Park, then this is your place.  But I can't say it was \"mind blowing.\"", "author": "E C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-05", "description": "I'm pretty sure the food is good here. But I came in, and the lady is nice. We ordered some pastry and I guess she didn't here us correctly and got something else. When we told her that's not what we said. She got all butt hurt and said softly in Chinese that we don't know how to order and other stuff. Which was totally unnecessary. Then grabbed the money out of my hand and that's it.", "author": "M L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-17", "description": "Simple, unpretentious place with yummy dim sum, the taro dumplings and chicken cilantro dumplings are great. Be forewarned - cash only.", "author": "M S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-19", "description": "OMG *angels singing* because the best dim sum shop in SF (yeah, it's not in chinatown. actually, there is NO good dim sum in chinatown... how disappointing. I have searched high and low and TC is TB - THE BEST!)\n\nAfter 6pm, end of day sale - items on top of the counter behind a sign that says \"3 for $1.20\"! \n\nwhatever they didn't sell that they are willing to sell for a cheaper price - today's TC pastry haul consisted of 3 sesame balls, 3 turnip cakes, 6 potstickers, 3 fried taro puffs, 4 fried won tons = $7! what? it'd usually be about... $11-$12? \n\nBut it doesn't matter what you get - everything is delicious and fresh! Wish the guy in front of me hadn't snagged the last of their drool-worthy shrimp and chive dumplings... =*( AND he got them at a discount... damn, that doubly hurts!\n\nyayerrrr!! I'm gonna be there every night at 6 and be the first! - except Tuesdays because they're closed.\n\nAnd I'm only sharing this with you because I'm a nice person..hmph!", "author": "Christine C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-24", "description": "Every time I'm around lower Irving I have to stop by and get some of their deep fried spicy wontons. They're like my favorite medium for curry flavor-to-mouth delivery *w* Sometimes I buy some and intend to take some home to my family but end up eating them all by myself...Eh heh...\nOther notable things are their preserved egg and pork porridge, the turnip cakes, the sticky rice balls, the buckwheat raisin mantao, the black sesame woo, and the boot jaih goh. Cheap and delicious :3", "author": "Skye L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-10", "description": "can't believe i still haven't  reviewed this place after multiple trips of gluttony on many a ravenous weekend morn. i feel like a failure.\n\neh no. no, it's more than that.\n\ni feel like a....bsian. fo' shame.\n\ncome here and take your pick of various types of bite-sized deliciousness! deep-fried, pan-fried, steamed, curried...try everything and all, get your go-to favorites and try that dumpling or dessert you haven't yet already. for such an incredibly affordable price, you will be feastin' beast-status.\n\nsure, the har gau (har gow, ha gao, badass shrimp dumplings, morsels of yum? whatever you call them) sometimes have their skins too thick and chewy, the deep fried wonton skin things (5 pieces for a $1 or some spectacular deal of the sort) sometimes a little too oily, the chicken shu mai sometimes too gamey-tasting not in the best of ways\n\nBUT\n\nfor the so-low, you-be-in-minor-shellshock-for-a-wee-bit-as-you-hand-over-only-half-the-amount-you-were-initially-expecting-to-fork-out, got-damn-that-be-a-sign-to-get-three-more-orders-of-that-BOMB-DIGGITY-CURRY-PUFF-WITH-THE-SWEETISH-FRIED-DOUGH-THAT-COMPLEMENTS-PERFECTLY-THE-SAVORINESS-OF-THE-POTATO-FILLING-MMMMMMMM-SO-BOSS, kind of price you're paying for the amount of food you're getting, there really shouldn't be too much complaining about the little flaws hurr and thurr.\n\nand get here in the AM/AM-ish when things are freshly made, if you get dim sum cravings at 4.30pm and come here expecting the freshest of dumplings with perfectly translucent skin...come on, now.\n\nPS: MANGO PUDDING AND/OR DURIAN PUDDING IN THEIR FRIDGE FOR DESSERT. HOLY MOLY IN THE NAME OF ALL THINGS PERFECT AND COLD AND FRESH AND WOBBLY AND HIGHLY AROMATIC!!11111!!!!!!!!!!!!!11 MEGA DESSERT WIN. real mango pieces and real durian flesh pulp. whoaaaaaa! the mango pudding perfumes your entire mouth, and the durian pudding stinks up your entire soul, and in both cases, your taste buds and tummy rejoice with passion.\n\ncash only. wear eating pants during consumption. eat with love. knock the fuck out after. sunday made perfect.", "author": "Eliza D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "Love this place. When I think of grabbing something quick to eat, I think of this place. Their wonton soup (without noodle) is my fav. Pork turnover, Curry fried wonton, Egg rolls, Cocktail buns, etc etc. And usually towards closing time, they would put their pastry/dim sum on sale (3 for $1.20). Note: They closed on Tuesdays.", "author": "Lovetoeat A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-25", "description": "t.c. seems to have been around awhile. the paint doesn't seem that shiny.  almost all the items are labeled in english with the prices attached. they even have chinese tamales (2.10) and congee (2ish)\n\nsamplings:\n-chicken bun (.65) white meat mixed with a little veggie good sized texture not juicy. bun not fluffy  but not too doughy.\n-siu mai:(3/1,60) tender, chewy pork, not juicy.\n-har gow(3/1,60) whole and partial shrimp with crunchiness provided by bits of waterchestnuts and the shrimps themselves. \n\nleftovers\n-tax charged\n-lots of msg used\n-not soo busy.\n-some seats availble for sitdown.\n-friendly service", "author": "Victor G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-12", "description": "Oh the choices of Dim Sum! Jook, buns and anything deep-fried! This is way better than Happy Bakery across the street for it's quality! My new found discovery is the Milk Tea here. Small cup of really strong tea that makes my large coffee want to spill itself over! Plus, the tea is cheaper! \n\nI don't know where to start with the food since just about all of them are tasty! I've tried their baked char siew paus, steamed char siew paus, deep fried taro balls and curry buns. It's definitely worth a try or two!\n\nThe thing to know about TC is that they are closed on Tuesdays. As a matter of fact, don't be surprised if you find them closed on other days.", "author": "Jeremy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "You can get full off of $1.90. \n\nBe ready to order because the ladies behind the counter don't like to dilly dally. \n\nSticky rice \"bun\"\nCustard bun\nCocktail bun\nChicken bun", "author": "Jacquee P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-09", "description": "The sesame balls are the only thing I get from here, because it is so delishous! Therefor, My rating is only for the fried sweet sesame balls. The sesame balls are always fesh and right out of the fryer! When I hold the sesame ball in my hand, it is perfectly round and when I bite into it -the good layer of the wrapping crunches a little but is also chewy and mixes with right amount of sweet mung bean ( I think it's mung bean, I am not sure) paste - for the best sesame ball ever! Yum!", "author": "Shirley M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-30", "description": "Delicious take out dim sum!  Even good cold the morning after.  \n\nI'd recommend nearly everything.  Here's what I Like in order of preference and may this help you pick out your pieces if you aren't sure what to get! \n- shrimp w/ cilantro \n- chiang fun (rice noodle): either plain w/ dried shrimp. with shrimp, or with beef\n- sesame balls \n- wo tip (potstickers): these have a nice ginger taste in them\n- \"chicken turnover\": best when eaten right away bc it's still crispy!  \n- curry wontons\n- cha siu bao/bbq pork bun\n- chicken/pork ( i forget which) bao/bun.  it's white.  You can stick this in the oven if you have leftovers at home and the oven will warm it up as well as give it a nice crispy outside.  \n\nMmmm.  I've never had a problem finding parking on this block but it probably varies by time of day.  \n\nThere are a few tables inside if you care to eat there.  \n\nIf you're going to take out an order of like 25 buns, call ahead... a woman before me took all the buns in the morning before I could get any :( \n\nAnd I think this place is cash only. \n\nOh and these people work hard...I see them early in the morning and in the evenings working together.  Pretty awesome.", "author": "Alias A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-16", "description": "I decided to come back here after reading some reviews about how good their steamed mushroom buns are. ($0.70 each or 3/$1.80)  Few years back, I used to come here for the 4-pack wheat buns ($1.80) cause it was filling and I felt like I was eating something healthy for breakfast although it was purely flour/carbohydrates.\n\nSo... a couple days ago, I went with my friend to grab something light to eat here cause I had a craving for a Chinese bow. My friend was probably annoyed with me cause I kept on saying \"DUDE. What should I get?\" I kept looking at the faded yellow menu above me, scanning back up and down trying to figure out what to order. Everything sounded so good and all the little delicacies behind the glass windows looked so tempting as well.\n\nAfter a few minutes (but felt like half a hour), I told myself I had to try a mushroom bun. I paid my seventy cents and couldn't wait to eat it. However, I was a little bit disappointed. I guess I had my hopes up too high about how delicious it would be. Instead, it was just average. The mushrooms were mushrooms and the bow was just a bow.\n\nAfter finishing it, I started to crave for a BBQ pork bun. And my breath stank of mushrooms. Thank god my friend had a pack of tic-tacs in her purse.", "author": "Annie S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-21", "description": "Dim sum from TC Pastry is never so good as on a Monday night (the day before they are closed for 24 long, long hours).\n\nHome of the best sesame ball in San Francisco! \n\nWe've been going here since I was a kid -my family goes here regularly for the pork buns (steamed & baked), curry puffs, coconut balls, hot dog buns, siu mai, shrimp noodles and oh; don't forget the little spicy puff thingies. I usually pass on the pot stickers, but the rest of the family loves them.\n\nMmm... time for a trip to Irving Street.", "author": "Wendy M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-13", "description": "Really tasty, fresh, cheap dim sum in the Sunset. You can stuff a family of four for less than $40, and still have leftovers. I only wish it were closer to my house, as we tend to do take-out. The ambience is a little...spartan.\n\nRemember, it's cash only.", "author": "T H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "Yumyumyum. \n\nCheap, fast and GOOD! \nI order the dried shrimp roll (65 cents), and the turnip cake (3 for 1.60) My husband loves the other dim sum specialties here, but I'm a plain jane with simple pleasures.", "author": "Alice E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-11", "description": "This is some of the best take-out dim sum we've had in SF-- better than the much-touted Good Luck on Clement.  And it's so cheap!  We had three kinds of steamed buns, pork, mushroom and vegetable, and chicken.  They were all good.  The pork filling is kind of cinnamon-y, which is interesting.  The shrimp and cilantro dumplings were super-good, very fresh tasting and with the perfect amount of cilantro.  The egg custards were also great.  This is definitely our new favorite place to grab dim sum and picnic in the park.  Highly-recommended.", "author": "Heather G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "I've been coming to this dim sum pastry shop for a very long time now and it's one of the better dim sum bakeries in San Francisco.  For a to-go and hole-in-the wall, they have real good har gow (shrimp dumplings) and also their steam pork buns are good sized and have more meat in them than other bakeries.  Most of their steam dumplings have pretty good flavor.  It's been one of my all-time favorite places to buy some dim sum snacks especially here in the Sunset district.", "author": "Arlene Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "TC Pastry, another no non-sense hole in the wall. Indication? 4 Yelps in a year and a half. This is no. 5. To a certain extent, TC Pastry is such a well kept secret, I don't want to be one to blow it up. \n\nPres. Obama has asked us to serve our community, so on this historic day in American history, this is my message...\n\nLike others have mentioned, yes, the dim sum is very good at TC Pastry. Leek and shrimp dumplings are hot, egg rolls are light & crispy, noodles are fresh, and a perfectly fried chicken stuffed tofu. \n\nWhere TC Pastry separates itself from Mongkok Dim Sum or Happy Bakery is the HK style street style items...curry fish ball on a stick (in the morning!), Chinese donut wrapped with noodles with peanut sauce,  hot sesame dessert, and boot jai go (in Cantonese) just to name a few items to look forward to.  \n\nThe service will never blow you away, neither will the unkept tables and chairs, paper signs, and hand drawn pictures. This is simply a place that focuses on what matters, consistently quality food at the best kept dim sum & more in SF.", "author": "simon l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-09", "description": "This place is a bit in the boonies, but it's hands down my favorite place for take out dim sum. They have every type of bun imaginable, and it''s super cheap - I don't even think a normal person would be able to eat more than $5 worth of food there in one sitting! \n\nAlso, in the late afternoon, they discount their dim sum selections even further, for super penny pinchers. \n\nI love their yellow bean buns, steamed pork buns, bbq pork buns, sesame buns...mmm probably going there for lunch today so I can try different ones too :)\n\nNote: they only have 2 or 3 tables - it's really set up as a take-out place.", "author": "Amy S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-01", "description": "TC is my go-to dim sum craving soother. We've gotten into a habit of stopping by to pick up lunch after my daughter's swim class. Solid dim sum, maybe not the best of the best, but a fine option.\n\nThe variety is not as robust as, say, Yank Sing, but the standards are there: steamed bbq pork buns, shrimp dumplings, siew mai, the rice noodles with various fillings that come with the tricked out soy sauce that you drizzle on top, egg custard tarts, and sticky rice wrapped in the lotus leaves - my favorite. The kidlet likes the hot dog bun. And an assortment of Vitasoy brand drinks in the fridge? check.\n\nInexpensive and filling, and you're able to bring it home and kick it without having to deal with the insanity of the weekend dim sum excursion. We dig.", "author": "amy p."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "Their dim sum is so tasty and cheap that it is mind-blowing.  My mind literally explodes everytime I eat there.  I'm not exaggerating. \n\nI can attest to the other reviews of this restaurant that their dim sum is cheap.  I'm talking $1.50 for jook.  That's insane! (insanely good) My favorite item is 3 deep fried taro pork  for $1.69!  \n\nIf you get there past noon or near closing, don't expect the dimsum to be super fresh.  But it'll still taste great.  The best time to go here (as w/ all dim sum restaurants) is in the morning...get it freshly made.  \n\nTheir staff is very friendly.\n\nFYI while this is a restaurant, it is more of a \"take-out\" restaurant that happens to have a few tables w/ seats.  They have Vitasoy and all that good stuff (drinks) that makes the dim sum eating experience amazing.  \n\nI wouldn't go anywhere else for Dim Sum. Period.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-12", "description": "Whenever I make it up to SF, a stop at this place is a must! Everything I've ever had here is so good, don't let the microwaves fool you! Not to mention their cheap cheap prices. I've yet to find somewhere in LA that rivals this place for Dim Sum takeout.", "author": "Elisa P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "The steamed pork buns are pretty good. We buy a dozen and then freeze them and when we want a bun, just pop it in the microwave to defrost and then steam it and voila, a fresh pork bun!\n\nThe size of the bun is average and the bun itself is light, fluffy and squishy. There's a good amount of meat and sauce inside and the pork is in small pieces and soft. The sauce is thick and rich with flavor. There's a good ratio between bun and meat/sauce.\n\nService is quick and efficient with some pushing in line. All standards in Chinese take out places. It's a quick stop for some Chinese pastries without venturing all the way to Chinatown.", "author": "Janel Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "if you like the pork dumplings...this place is by far the best in the bay in my opinion.  Even better than good luck dimsum in the richmond area.. also they have the egg cakes filled with bamboo shoots and water chestnuts that i love sooo much.  their other location in daly city is just as good....they also serve taho with boba! yumm..Their noodle dishes are ok at best but you come here for the hot fresh from the steamer dumplings! 4/5 judochops...do i have pork between my teeth?", "author": "Dustin G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-29", "description": "Curry puff, chicken & bitter melon, siu mai, pork turnovers, shrimp & chive dumplings, turnip cake, curry wontons, shrimp cakes, and other assorted delights. Tie off and shoot it because this fix is cheap.", "author": "Corinna K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-31", "description": "Pretty good dim sum, super cheap.  I am, unfortunately, on an endless search for the perfect BBQ pork bun, and after being here, my search continues.  They were fine, but it was a kind of thin and gummy filling and too sweet.  The shrimp and chive dumplings were very big, but mostly filled with chives and less shrimp.  \nThey do, however, have a huge selection and you can fill up for around $5.", "author": "Jessica L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-02", "description": "There are just so many dim sum places on this stretch of Irving, you kinda get lost.\n\nLuckily, we've found T&C - really, really, really good dim sum - I'd almost bring visitors here instead of Yank Sing.\n\nPrices are low, which is even better. \n\nI have yet to try the soups or the jook (brings back awful childhood memories) - but they look good. The lo mein is good - you can taste that the noodles are freshly made.\n\nI'm kinda glad we don't live nearby, as we'd be here all the time. (Especially with TuttiMelon a few doors down.)", "author": "Kelly R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-13", "description": "Ahhhhh, TC Pastry! I've been going here for the past 3 years almost! One thing that I really like about TC Pastry that it (most of the time) remains consistent when it comes to food and prices! Some of my favorite to get are the spicy won tons, shrimp chives dumplings, and the BBQ pork buns! I love it when I get lucky and the pastries are still hot. I happily recommend this place to any friend in the area.", "author": "Angelo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "I loveee this dim sum place. When I lived in the city, I would come here every week or so to buy lunch. The food is insanely cheap and I can buy everything I need to keep me full for under $5. It definitely doesn't have the nicest atmosphere but honestly who cares? The best time to come is right when they open because the food is very fresh and the potstickers taste way better than normally.", "author": "Clara D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-25", "description": "Well since Happy Dim Sum was out of custard tarts, I went here. I asked for it and they said, \"You want small dan tat?\" (custard) So I looked at it.. It was sooooooo tiny lol! You can get 4 tiny custard tarts for $1.15. So I got one and supplemented it with a coconut (COCONUT!!!!!!!) red bean ball. Yummy. Both were delicious. And the total price was $.85, less than the price of one regular custard tart at many other bakeries.", "author": "O K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-01", "description": "Awesome place to go for a quick bite.\n\nThings I love at this place: fried BBQ pork buns, friend curry buns and hot dog rolls. \n\nPrices are cheap and the food great.  Can't go wrong with that combination.", "author": "Serge S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-22", "description": "Subpar dimsum, expensive prices (compared to Richmond dim sum and chinatown dim sum), basically only come here if you dont have the 5 minutes to drive over to inner richmond. The har gow has really thick skin. The siu mai wasnt too bad. The buns were just awful. Definitely would not recommend this place to anyone.", "author": "Kevin L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-19", "description": "We were tired of the Dim Sum take out places on Clement Street and decided to head over to Irving Street instead.  We found TC Pastry on Yelp and decided to try them out.  TC Pastry is great!  The place is small, a little older, but very clean and accommodating.  Their baked pork buns taste fantastic.  They are smaller sized too (and so is the price) which is perfect for us.  My daughter loved their hot dog buns and pot stickers.  Their custard tarts and fried spicy won tons were also excellent.  We had 4 small plastic bags of assorted dim sum for under $9.00.  Everything tasted great!", "author": "Chris F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-21", "description": "This place is all kinds of awesome. It is, hands down, the best cheap Dim Sum I've ever had . . . it's better than anywhere that's cheaper, and cheaper than anywhere that's better.\n\nWe can feed 5 people here for under $40 easily, and have plenty of leftovers. I especially recommend their beef dumplings with ginger. Yum!\n\nPLUS, hey, the close proximity to Golden Gate Park is pretty much custom designed for a picnic! Every year we hit this place before the the SF Comedy Day, and load up on munchies. We've not been disappointed yet!", "author": "Joshua C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "My favorite \"no frills\", \"take out\" dim sum.\nTheir curry won tons and \"puffs\" are out of control.\nEngorge yourself for 5 bucks.\nFeed you and 9 of your friends for 20 bucks.\nHonorable mention for their baked cha siu bau and their chicken siu mai.", "author": "Barry A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-31", "description": "For: A Pork Bun by Any Other Name\n\nOn my quest to explore every pork bun, I decided to start my investigation in my own back yard.  TCP, which is just down the street from me, offers some tasty-looking treats that loc's seem to love.  As much as I wanted to try everything, I was just there for one thing: a baked pork bun.\n\nUpon seeing them, I was astounded at how small they were; about 3 - 3.5 inches in diameter which is tiny compared to other take-out buns.  It was only 60 cents, though, so I really can't complain. \n\nIt was heavily dusted in flour, something strange and new in my world of glazed-over bbq buns.  I took a bite and immediately noticed the sandpapery texture of the outside, not unlike that of a cat's tongue.  Fortunately for me, it was not filled with cat tongue (something that I had grown accustomed to living in Hawaii (all people from Hilo are in on this old manapua joke)) but rather it was filled with a moderately tasty, not-so-syrupy filling.  It had cubes of pork that were all a uniform in size, and were quite delicious, with a great sauce-to-meat ratio.  That aftertaste of red char siu was pleasantly moderate.\n\nThis bun would be a solid four-stars if were not for the offensive texture of the bun so I give it a \"3\", but I'll rate my experience at TCP as a \"4\".", "author": "Thomas M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-15", "description": "The food is good and super cheap. Need I say more?  We spent about $10 for 2 people for lunch and grabbed another $10 worth of food to go.  That is HELLA cheap! And mind you, this was after a tiring 20 mile bike ride.  My body just lapped up all that carbs without care.\n\nTried the crab cake, shrimp shumai, egg tart etc.  There was a bunch of other stuff but I can't think of it all right now.\n\nSince it was quite empty when we got there, the owners let us bring our bikes into the store rather than locking it outside. I thought that was cool. Not many SF establishments lets you bring your bike into the store.\n\nI didn't get to try all the stuff there, especially the desserts.  I think I shall tackle that the next time.", "author": "Acamar A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "My favorite dim sum to go I'm Sunset.  This place has been at the same location for many years.  Dim sum freshly made daily.", "author": "Chris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "gets five stars cause it has better service than the one in daly city. this is the real t.c. pastry! affordable and delicious", "author": "Anne Jolene C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-20", "description": "Fish balls on a stick are my favorite, whenever and wherever. Their curry sauce was delicious! Drizzled all over the stick, it was not too spicy but just enough. \n\nWe went to get some coffee, buns, and dessert for the road. The buns - which I ate about 8 hours later while waiting for a connecting flight back to New York - was obviously a bit stale but still tasty. I'm sure it would have been great if I had eaten them fresh.\n\nThe black sesame dessert soup we bought was REALLY delicious - not too sickeningly sweet, just the perfect texture. \n\nMy friend the Vegan said his mushroom and veggie buns were great. The buns were really cheap - 3 for $1.90!", "author": "Melissa L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-05", "description": "This place is a little better than Happy Bakery which is across the street from them. I have been coming here since I was little and it's way better than  Happy Bakery.\n\nThe Shrimp Rice noodles are really good and if you go there at night, there is a special going on which is like 3 items for $1.15. I think that's a pretty good deal but you have to heat it up but if you don't mind cold food, well there you go.", "author": "Maile W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-31", "description": "For a take-out dim sum place, this has got be one of the dirtiest shitholes I've ever seen. Sticky floors and boxes stacked up everywhere, it's pretty putrid. Sometimes there will be flies flying around the establishment. \n\nHowever, unnecessary details aside, of all the little carryout dim sum places on Irving, this place is the best. That's saying a lot considering almost every block on lower Irving has a dim sum place. \n\nWhere else can you get a container of porridge for less than $3? Or a bowl of wonton noodle soup to go for $3.50? They also have \"Chee Fanh\" or \"Fanh Tuan\" which is glutinous rice, dried shredded pork, and a yao tieu or Chinese donut inside. It's nearly impossible to find a place that has this now! \n\nDim sum is pretty satisfactory, and for the prices you pay for, you get a lot of quality. A lot of places mix their shrimp with fatty pork and other unappetizing and unhealthy fillers. This place gives you all shrimp in the shrimp orders. \n\nThere just has to be a certain time to go, such as right before lunch or early in the morning. If you go in the afternoon, majority of the dim sum that you see in the glass counter are cold and the skins have become unchewable, plasticky, and seriously not good eats.", "author": "Derrick L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-02", "description": "We stop here for the Baked BBQ pork buns which we buy a dozen at a time and then keep in the freezer for those times when we want a quick snack (just pop it in the microwave to defrost and then pop into the oven to restore the baked crust).  Other items which are good include the dim sum items, but come early cause they sell out fast.", "author": "Justin Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "updated review - CONSISTENCY!  been coming here since moving to the city 2 yrs ago.  first went on yelp recs and never disapointed since.  pastry is really good whether curry puff (everyone likes these, just the right meat-sweet-curry mix) pork turnover (makes me think of a savory filo dessert) or spicy fried wonton (addictive flavor crunch).  the pork dumplings are porky goodness and the shrimp cilantro dumplings are well balanced.  fried shrimp cakes perfectly match egg and shrimp, very satisfying.  the prices are super reasonable.  rarely a wait.  take out and have a great meal - breakfast, lunch or dinner.", "author": "Bob K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "Really cheap good dim sum. Really greasy, but thats expected. Just be patient if you don't know chinese, all the people there are chinese speakers.", "author": "Kristin S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "Good simply dim sum in an unpretentious setting. The chicken, beef and shark fin dim sum are excellent, my favorite being the shark fin dim sum. Hey, don't judge until you've tried it! Their steamed pork bums don't impress me though. In fact, I found the filling a little hard to down. But then again I'm not the biggest pork fan in the world anyways.", "author": "David D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-17", "description": "The food here is actually not bad other than oily and fatty.  \n\nThe place is dirty.\n\nThe service is as BAD as it can get!\n\nAnd manner?  Dont think this word exists in their dictionary.\n\nI used to blame the people working there but it all started from above, the owner/management (the short hair older lady), who are mean, rude, nasty.  The words that came out of her mouth is unbelievable.  They treat their employees with no respect.  It is really hard for the employees to smile and serve people right when the owner/mgmt are bitchy 500% of the time.", "author": "SF F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-24", "description": "I used to live in the neighborhood and this has to be my fave dim sum place. Yes, it's not a nice sit down nor it looks like they care about hygiene, but their dim sum is awesome. I tend to over order everytime I go there. Sorry, can't help myself.\n\nNow I live in Lower Haight, so it's a bit of a travel just to get dim sum as I don't see any other purpose for going to the neighborhood. Though realistically, where exactly can you find dim sum place in Lower Haight?\n\nAnyway, about 5 or 6 months ago I bought their dim sum for me and my husband's lunch. Unfortunately, my husband got a very bad food poisoning. He's positive it's the pork shumai as he said it was rather pink. He got really sick, let me just spare you the gory details, I had to take him to the emergency room that night and he was released at 7am!  It was quite an adventure.\n\nWeirdly, we consumed pretty much the same thing and I was totally fine. It could be just one bad pork shumai among the rest, or his white stomach just can't tolerate a little bit of dirt. Therefore, I'm still going to TC Pastry every once in a while though now I inspect every pork shumai I have. Of course, I have to go there by myself cause my husband is pretty much traumatized.", "author": "Perry S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "There was decidedly no vegetarian options when I stopped by the other day. Although from other yelp reviews, I could have gone with the steamed veggie rolls. Oh well, I got steamed pork buns and pot stickers for folks to share and they loved it. 3 ginormous pot stickers for $1.50 - pretty good deal. Now, if they would have more things for me, I'd be happy :)", "author": "Tiffany L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-25", "description": "If this was anywhere besides the Bay Area, this place would be alright.\n\nI came here for a brunch/lunch on Chinese New Year Eve and brought my goodies back home.\n\nI heated up turnip cakes, chive/shrimp dumplings, and deep fried savory dumplings on a pan so they were crispy and hot.\n\nThe food, unfortunately, was still CRAP.\n\nIt's oily, funky tasting, CRAP. It might be good if you cover the taste with soy sauce or mustard or something, but I like my dim sum plain so I can taste the typically wonderful flavors.\n\nNeedless to say, I'm desperately looking forward to dinner since lunch was such an utter disappointment. The only redeeming part of my trip was getting an all-day MUNI pass.\n\nI better choose my next meal more carefully. \n\n====\n\nRubric: 5 = Mindblowing 4 = Excellent 3 = I see the charm 2 = Disappointing 1 = Never again", "author": "Eric K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-27", "description": "Went there solely for the sesame balls.  Price is right, 3 for 1.70, and they're very good but a little too greasy for me.", "author": "Pat P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-22", "description": "So thanks to some fellow yelpers I went to this place with my friend. We went there kind of skeptical though because I was thinking it was going to be a dim sum place where you sit and waiters bring trays of food and you pick and enjoy, etc. But no, you order the food from a cafeteria style layout. Then we weren't about to go because we couldn't locate it because of the hole in the wall sort of placement in Irving. But let me tell you, the food is delicious and cheap. I think it cost less than $2 for 3 shrimp dumplings and they were so good I had to order an order to go. The only thing I think that might be caution for people with high expectations is the way the food looks to be sitting out, but trust me it is worth it.", "author": "Desiree C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-11", "description": "Best snack ever:   Hot & Spicy Fried Won Tons.\n\nWho would have thought a dim sum place would make curry filled wontons that are deep fried?  The curry puffs and egg rolls are also tasty,  but definitely can't compare to king egg roll from the south bay.  The regular dim sum stuff is pretty good, but not great.  So why five stars?  Read the first sentence.  Oh did I mention it's super cheap?", "author": "Simon Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-05", "description": "Surprisingly, I only paid $15 and it bought me enough dim sum to fill 4 hungry bellies desiring a quick and greasy snack!\n\nWe all really enjoyed the shrimp and cilantro dumplings, steamed rice noodle roll with (not dried) shrimp and steamed rice noodle roll with cilantro and veggies.  Potstickers were beast-sized, but not my fave.\n\nAs for the cha siu bau, I'll pass, thanks.  (I know, I'm a bad Asian.)\n\nAll in all, it was quick, cheap and tasty (plus the lady tolerated my ABCness and let me order in English/broken Chinese)!", "author": "Krystle S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-17", "description": "Been coming here for quite sometime now.  Always seem to go here early in the morning when I want some dim sum, Chinese donut, and jook for breakfast.  Can't go wrong if you are in the area and need a good & cheap Chinese breakfast...", "author": "Patrick C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-22", "description": "It would be fantastic if there were a better bulk deal, but at least everything was bloody tasty! Chicken bao, pot stickers, siu mai, ha gow, some other shrimp dumpling situation and a veggie situation.\n\nThey were super friendly and accommodating, it was just a bummer to essentially pay retail when I was buying what would have been a wholesale ticket (a few hundred dumplings).\n\nPopular in that neighborhood of the Sunset, which is always a good sign too!", "author": "D. R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-15", "description": "The mushroom buns are the best veggie steamed buns anywhere. All of the steamed dumplings are good as well.. But the place could use a little scrubbing.", "author": "Mosey S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-25", "description": "This is my favorite dim sum joint on Irving! Best baked pork bun in town, the steamed ones are good too.  The sticky rice ball with chinese sausage is another item you HAVE to try there!  A little more expensive than some of their competitors, but worth it!!!", "author": "Bobby P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-23", "description": "This is for those days when you just can't deal with going to some jam packed tea house and waiting for the cart carrying what you want to FINALLY float by.  \n\nThis is for those days you need to grab something quick on Irving while doing your grocery shopping and sugary donuts just aren't going to do it.\n\nThis is for the those days you want a simple brunch of congee or some pot stickers.  \n\nThis is the one.  The only place to get your take out dim sum on Irving.  The rest just aren't as a good.", "author": "K W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-17", "description": "SF Food Inspection Score: 90\n\nHELL YA!\n\nThis place is awesome. \n\nThe dim sum is fresh, cheap, and very good.\n\nI got a small chow mien, shrimp and chive dumplings, and a pan fried pork bun for $4. \n\nSo bomb. And it is so fresh and clean, not heavy and greasy. \n\nI think I'm gonna have to come here every morning before work.", "author": "Kristina C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-31", "description": "Living in SF has shifted the usual meals with the dad from I-hop to Asian food. Last time the search was for Dim Sum, and somehow it led us here. While dad may be disappointed that the food isn't served on little plates carried to your table, I was delighted by the size (or lack there of) of the place and the prices which for the amount of food you get totally k.o. every dollar menu around (included: the caramel apple empenadas at KFC/Taco Bell).\n\nYes, it should be noted I'm no Dim Sum expert, but I've been here several times now and the food has always been excellent if a little greasy. Add to it a large selection of chicken filled things, and sweet tasting things, and a solid mushroom dumpling stocked with all kinds of like minded veggies, and you've got (probably) the best meal around for under five dollars. Which of course can easily get you about half the store in any given visit.", "author": "Stephen M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-17", "description": "Disappointed and will definitely not going back.  The shrimp dumplings were semi-cold and the outer layer was hard. Shouldn't they be kept in a steamer?  Also, the woman who handled my food...didn't wash her hands before handling other's money and after scratching the inside of her ear. This brought it from a 3 to a 2 rating.", "author": "Ria V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-29", "description": "The women that work here are bitchy.  Expect to be yelled at.  :(", "author": "Fatty A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-17", "description": "I love this litlle shack! Very inexpensive and very tasty Dim Sum! I love the taro and rice noodles! Great stuff!\n\nParking is horrible...as usual.", "author": "Marc E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "I really wish to give this place 3 1/2 stars!  As today was my first time there, I moved to the side to take in the massive menu; which is always a good idea, although there weren't too many people there.  A pork bun lover, I had to have some!  The nice lady said it was fine if I had two baked and one steamed.  I also ordered the shrimp and cilantro dumplings, crab cake (crab enveloped in a mini egg omelette thing and a chinese doughnut.  Everything tasted good; average.  The baked pork buns were smaller than usual, but I didn't mind, as they had a lot of meat.  Yet the outside bread was different from every other baked bun I have had, 1/2 as thick, and not light and airy.  The bread was thin and dense.  Also, there was some sort of gel texture in with whatever sauce they use with the pork, which was also in the steamed bun.  The other items were good, but unfortunately, nothing to draw me back.  Make sure you have a defibrillator if you eat the very generous (about the size of half my arm) chinese doughnut.  I was lucky enough to get it straight from the fryer!  Yowch!  The lady who helped me was super nice!", "author": "Delicious B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-22", "description": "fast, simple, to the point dimsum. you can't do any wrong, you cannot!! prices were unbeatable too :P", "author": "Karen H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-04", "description": "This place is my favorite place to get Pork Buns, Hot Dog Buns and Curry Puffs. I would buy and stock up for 3 days worth of goodness for my lunch break at work. The best are the mini pork buns. You gotta try these little bastards. The bread is baked just right and the sauce in the pork bun is awesome. I use the hot dog buns just like any other hot dogs, cut a slice open, pour in some relish and mustard and that's a meal with a bag of popchips. The curry puffs and the egg custard tarts are awesome. If you want to switch up the style of pork filled goodness try the pork turnover shaped like triangles. I also like the spicy fried wonton and lastly the coconut balls are great. The only thing they don't do well are the cocktail buns. Very plain and mundane go elsewhere for that. All in all 4 days worth of lunch runs me about 10 bucks give or take a buck or two. Not bad for you money savers out there that want to cut down on spending  that much for one day of lunch, give these economically friendly meals a chance.", "author": "graham c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-03", "description": "This place has really great, fresh dim sum to go. I recommend the curry puffs. Even though I don't eat meat, I remember many items from this place as being fantastic, and still get a few veg things there whenever I can.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "Probably the only place i go to if i wanted dimsum. I always order my usual, beef rice noodle, wheat bun?(not sure what its called in english), and porridge.  I love how they use water chestnut in some of their dishes. \n\nGenerally everything is good in their menu, although i thought the wonton noodle soup was pretty bland but its cheap and fills you up, i recommend to get the fried wontons and curry fishballs and dump them inside your wonton soup. Warning fried wontons make your breath stink. Their mini eggtarts are really good.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-03", "description": "I like the pork buns here.  Its 3 for 1.63  maybe cost more now.  It cheap and near my house.", "author": "John F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-13", "description": "This is a cool little place.  It has no ambiance.  It is pretty much to go dim sum, although they have a few tables. However, the shrimp and cilantro dumplings are great.  They also have good pork buns.  The service is efficient and friendly.  Also, the prices are crazy cheap.", "author": "Kate B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-04", "description": "I just tried the chicken and bitter melon rice noodle roll and it was really good. I'm not a fan of bitter melon, it's alright I just can't eat a whole dish of it, too strong of a taste. But in this rice noodle roll it's perfect! The bitter melon is sliced very thinly and the chicken is seasoned nicely so that it's not overwhelmed by the bitter melon. If you're not afraid of strong flavors then give this dish a try. It's a nice change from shrimp or beef, the usual suspects in rice noodle rolls. In fact, I've never come upon this flavor choice. I think I'll be ordering this over the other two for a while.", "author": "cyndi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-01", "description": "This is a great place if your on the go, or looking for great cheap eats. If you go in the morning they have the Chinese donuts wrapped in a rice noodle roll which is excellent with the peanut sauce.. etc. I love the har gow, and shu mai here. The jook could do some work on, but i've been coming here for over 10-15 years, i can't complain.", "author": "Brian P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-12", "description": "for the Sunset district, the Dim Sum's pretty good.  They now have four...count it...one, two, three, four...little tables to sit down and gulp down these little delights.  It's great for a quick bite and easy on your wallet.  I particularly like their dried shrimp crepes (har cheung fun) with chili paste.  Mmmmm mmmmm good.  The shrimp dumplings (har gow) are also excellent.  Good chicken buns too!", "author": "JeFF T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "Good taste, high cholesterol. But hey, its delicious....and cheap too.", "author": "Colleen W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-12", "description": "Definitely the best cheapie dim sum spot in SF so far...", "author": "Rich B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-26", "description": "Another plus in the Sunset district. This place is nothing fancy, but good dim sum at inexpensive prices. A good take-out place. Have to come back and try some more stuff here.", "author": "Leon C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-29", "description": "I live in the Sunset and there is no shortage of Dim Sum here. So why TC and not some other shop? Flavor, price, portion size and variety of options. Seriously, they have so much to choose from and it is all good. I love their pork buns and their wheat buns w/ raisins. I stop in here with $2 in my pocket and leave with everything I want.", "author": "Stephanie W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-03", "description": "The storefront doesn't reflect how good the food is!  Definitely one of the better take out dim sum places in SF. \n\nThings I've tried:\n- mushroom/vegetable steamed bun: 5 stars - delicious.  Just the right balance of veggies.\n- curry puff: 5 stars - the dough is fairly sweet, which balances well with the curry filling, that is just a little bit spicy.\n- shrimp and chive dumplings: 5 stars - just enough texture and flavor in a thin translucent skin.\n- steamed rice noodle with shrimp: 5 stars - big pieces of shrimp in a tender rice noodle -- three big pieces for $2!\n- steamed rice noodle with vegetable: 5 stars - it's the same filling as the mushroom/veggie bun - mushrooms, black fungus, carrot\n- potsticker: 4 stars - the filling was not heavy at all.  I think there was shrimp and pork in it. \n- steamed rice noodle with bitter melon a\nnd chicken: 4 stars - I liked the bitter melon, but wasn't that crazy about the chicken filling.", "author": "lovetoeat p."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-28", "description": "Cheap, tasty, close to home, easy to swing by and pick up goodies.  It might move up to 4 stars someday, but for now, only 3.", "author": "Curtis H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-15", "description": "This is my favorite take-out dim sum place on the strip....  Food is fairly well labeled in English for those who are Chinese-language challenged like myself.  The ingredients and skin of the dim sum seems of higher quality compared with those of other take-out joints.  Big variety.  Huge bargain compared with restaurant dim sum (though of course there are compromises).  My favorite, if I can make it there by noon-ish, is the fried donut wrapped with rice noodle.  Egg rolls, sesame balls, and coconut red bean balls are also a hit. The staff are bilingual; I wouldn't say customer service is their strong suit, however, at least they smile at you most of the time.  Four tables available...but don't expect them to be super clean....", "author": "Kim T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-28", "description": "I like the nice selection available at this place, and their presentation of different items on the counter helps when ordering.  The shrimp and cilantro dumplings were wonderful!  There was a little something extra to them, water chestnuts I think, that made them nice and crunchy to bite into.  The steamed buns, as mentioned in other reviews are pretty packed with filling.  The veggie mushroom and the pork buns were both winners.", "author": "Lauren M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "Love this place for having a good variety of poultry dim sum since I don't eat pork or beef. They even have chicken fried dumplings (hom sui gok) which is rare because it's always made of pork. It's very crispy too! I also like their rice noodle rolls. You can have a full lunch here for $3.", "author": "Al T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-13", "description": "I'm not a huge dim sum fan, and yes, it does seem like there's really nothing different about the dim sum staples here versus any other dim sum place, but this place stands out more to me because they have a lot of different things you don't normally come across. Some things I've tried:\n\n- curry puff: the crust was good. It was on the sweet side, which was interesting. The curry inside was pretty satisfying!\n- chicken pot pie: the crust was the same as the curry puff! I didn't really enjoy this as much, probably because of the filling. Meh, I'm not too big of a fan of pot pies either..\n- hot n spicy wonton: THIS WAS GOOD! I think it may have been because of the fried wonton wrappers, but the curry inside reminds me of my grandma's. i'm not really sure what was in this (I gobbled it up so quickly) but I think it was just cabbage or something? Not sure.. They're small, but you can get 5 for like 1.25. \n- soy milk: This is pretty good! It's different, because it's homemade. I think it's less than a dollar a cup too. Goes well with the dim sum!\n- Curry Fish balls: Mmm. They're not that spicy (which I wanted) but still good.\n- Fried Dough wrapped in Rice Noodle Roll: For some reason, the name made it sound better than it was. It does come with soy sauce, and peanut sauce (which I like) but I wasn't that wowed by it\n- Coconut Balls: SO GOOD!! I like it when they're slightly cold (but not hard)\n\nThey also have some other things I want to try in the future, like the taro puff, and the black sesame soupy thing.  I will definitely return in the future!", "author": "Bub B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-31", "description": "I used to pop in here to get my quick dim sum fix...that is until I discovered Happy Bakery across the street and a block down.", "author": "Scott M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-23", "description": "one dirty looking restaurant that most people won't bother walking into. but this place is different.  if you ever had anything here, whether it's quick snack of dim sum or some otther special stuff like egg tart or steam buns you will eventually forgive them on the dirtiness or sticky floor. \n\nthis place is a treasure for hong kongers in the sunset district. many people come here in the morning to pick up early dim sum breakfast to go. they also have a large group of people who visit on regular basis. \n\nThis place is definitely a place to look out for if your ever in a crave for some dim sum orders togo.", "author": "Eric Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-23", "description": "two words, crispy wonton. anyways I always go here for those things. Theyre crispy and the inside is a yellow curry filling, sooo good! Theyre very cheap too, I think its 5 for $1.20. I've also ordered their beef rice noodle which is quite filling and the chicken suimai. this place is closed on tuesday?, i think.", "author": "Miss H K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-20", "description": "When we don't want to go to a Tea House and just want quick good dim sum, we head out to TC Pastry.  The place also has porridge and wonton noodles to go for a cheap price.  My favs are the custard buns, noodles with dried shrimp and the haw gows (shrimp dumplings).  \n\nI was taken a back when they put some of the dim sum in plastic bags, but got over it quick because of their cheap prices and that I was going to gobble the food up within the next 20 minutes anyways.", "author": "c v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-08", "description": "Decided to try this place for an unorthodox outing with a friend: pick up dim sum, head to the beach, enjoy a bit of wine. Uncertain whether the \"kitchen\" at TC Pastry would be closed by the time I arrived, I called in my order. I don't know much about dim sum, and certainly don't know the names of dishes. I asked for recommendations over the phone, and everything sounded good. I figured we could take care of $20 worth of food, no problem. To my surprise, I arrived at the restaurant and found three massive plastic containers filled with food, and more in a bag, all coming out to about $18.50. We got rid of half of it, and it was still $10.83 for so much food. The spicy deep fried pork rolls were my favorite. Everything else was so-so. We only managed to eat 2/3 of it. Overall, the place was pretty good. The quality was sub-par, and most dishes tasted identical. I won't go back, but wish the best to the friendly folks who run it.", "author": "Kevin A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "From the outside TC Pastry doesn't look like much, actually the inside doesn't look like much either, but when you see a line of people at the counter on weekend mornings, that's gotta tell you something!  TC is pretty much a take-out Dim Sum place with 4 tables if you want to get a quick bite, but what a gem of a place!  The Won Tons in the Won Ton Noodle soup are  meaty with a good sized piece shrimp (if not the whole shrimp) in each dumpling, the noodles are simple but just the right texture and the soup is light and simple.  All this for about 4 bucks!  Other favorites here are the 1000 year old egg & pork jook and the fish & peanut jook.  TC also offers a nice variety of Rice Rolls (Cheung Fun) the usual beef, shrimp or pork, but the Bitter Melon w/ Chicken and the Vegetable Rice Rolls are very nice if you want to try something different.\nThey also have Spicy (Curry ) Fried Won Tons are a nice twist to the Fried Won Ton enthusiast.  The Black Sesame pudding, paste or soup or whatever they call it offers a nice light and healthy dessert!", "author": "Doug L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-07-29", "description": "Of all the dim sum places in SF, I always come back to this one. A hole in the wall place with two little tables and no atmosphere, TC is the perfect take out dim sum shop. Having never left me heartbroken, and never leaving me with an empty stomach, TC Pastry has been my favorite sunset dim sum place since I was 13 years old. Is the best? I don't give a shite! All I know is that it has never let me down. Try anything and everything... all hail cheap, great dim sum! Oh, and a few doors down is a good Bubble tea place... yummm!", "author": "Mitchell W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-05-28", "description": "well my family & i have been coming here for years, the food is still good & very modestly priced.  \n\nwhen we get our dim sum craving & not wanting to drive to chinatown for a sit down we come here & take it home.  there are plenty of choices here, they are all pretty fresh & tasty.  we typically will order the dry shrimp rice noodle (cheng fun), 2 orders of fried wonton (jow wonton), 2 orders of the custard tarts (dan tat), turnip cake (lo bak go), sticky rice dumpling (lo mi bow), pork & shrimp dumplings(shew mai), chinese sausage bun (lap chang bow) & what ever else looks good.  typically, we leave with a large bag of dim sum for about 15.00\n\nthe decor in the place is is pretty stark & plain.  they do offer eat in or take out.  they do not accept credit cards or checks, its cash only here.  street parking around the area can be a mess.", "author": "larry s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-21", "description": "I used to work in this neighborhood, and I adore dim sum.  Needless to say, I've tried all the places the neighborhood has to offer, and they're by far the best.  My favorites:  Shrimp with cilantro, baked pork buns, crispy wontons, wonton soup, curry puffs, beef rice noodle, aw hell, it's all tasty.", "author": "Risa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2006-09-08", "description": "I used to live in this hood and went there from time to time. It's not the best but there are somethings that are good--like their cheung fun (long, rolled noodle with dried shrimp).  I think their stuff tends to be on the greasy side.", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-25", "description": "Cheap prices.  Variable quality.  I can't give more than 2 stars to a place that puts dumplings in the microwave.  Yikes.  Spicy wontons were definitely the highlight.  Chicken pie, pork buns, pork dumplings all left something to be desired.  Next time I'll spend the money and go to Ton Kiang.", "author": "Cliff M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "All these reviews are lovely, but they neglect the main reason I come here: they're open at 7:30AM.  You can have wonton soup (careful: sometimes not ready until 8:00), fresh mushroom noodle (more expensive than shrimp noodle,  that's how good), and fried curry puffs (fat, fried in fat, some fat with that?).  When even pho places aren't open yet, we come here, the manic early risers, starving hysterical naked etc.  Tea is $0.20.  And I never reviewed this place (how to say \"subrosa\" in Cantonese?) but now they have a Yelp sticker on their door, so no more cloak and dagger.", "author": "Non P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "yummy! best dimsum take out place i have been to in the sunset area. i love their chun fun, hao gao, and the sticky rice in the lotus leaves. The sui mai is ok, but i've definitely had better at other places. I also tried the custard egg tarts and they weren't as great as I expected them to be... maybe because it was toward the end of the day. Next time I want to try their juk and pork dumplings! Although I wish parking wasn't so hard on irving =(", "author": "leanna w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-22", "description": "the buns are just alright. I'm not a big fan of chinese buns in general though. I like the white sugar things, they're called bak tong gou in chinese.. The porridge with the black eggs is the best thing here though. They give you so much black eggs and the meat is good. It's the best thing to eat when you have a cold. I've been coming to this place my whole life and it's comfort food to me.", "author": "Ale x."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-08", "description": "great prices. good pork buns, shrimp cilantro dumplings, and egg custard buns.", "author": "Kan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-11", "description": "this is the best dim sum place i have been to yet. they have amazing pork buns. they are also cheaper than the rest ive been to. and i am a really big pork bun fan. you can just taste a higher quality in this bun.", "author": "Alissa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-21", "description": "Well, it's definitely cheap but not worth it if you are really craving a good meal.  I left disappointed.  The best thing was probably the fried daikon cakes because they were fresh. Potstickers were also not bad. Everything else was mediocre:  pork siu mai, bbq pork bun (baked), mushroom roll.  Wonton soup was cheap but also small portion.  Decent but I wouldn't go back for it.", "author": "Le L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-21", "description": "So cheap, and so good.  Best sesame balls ever!  So crispy on the outside, soft on the inside.  Gyoza is EXCELLENT.  Great place to order out for parties, they make great finger foods.", "author": "zzzulu l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "Was walking down Irving looking for a quick bite before an appointment at UCSF. Saw a sign for \"Dim Sum Specialists\" and couldn't resist. I've heard of dim sum chefs, but specialists? I must investigate. Upon walking in I thought they'd oversold themselves - the place is quite drab and the food presentation designed by a firm believer in pragmatism. But upon viewing and later tasting the food I had been way too quick to judge. 3 shrimp and cilantro balls for under 2 bucks?!? SIGN ME UP. The skin was surprisingly well made and there was a good amount of shrimp. My only complaint is that they were cold.  I also tried their coconut buns (they come in threes, shaped lik hot-dog rolls. Very handsome portion). These were warm and SO SOFT and delicious with the perfect amount of coconut filling. Delicious, filling snack for under 5 bucks. Twas my first and very satisfactory take-out dim sum experience. Specialists indeed. Will stop by next time I'm in the set for some of that deep fried curry puff action.", "author": "Polly F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-24", "description": "we got a variety of dumplings and the shrimp and chive was definately the star. also yummy is the chicken and mushroom dumpling. and great pork buns. didn't love the chicken turnover but everything else was spot on.", "author": "Tara M."}
