{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Was looking to get a smoothie early in the morning, but the nearby juice shop was not open despite their posted business hours. I stepped into this coffee shop instead to get my smoothie. The barista lady greeted me and took my order while multitasking. She created a friendly atmosphere and I instantly loved this place.\n\nTemo Cafe is all about value. You won't have to spend SF kind of money to buy anything here, but don't expect gourmet quality. Comfortable seats inside, but some kind of shabby.\n\nThey have a lot of interesting offerings on their menu - a sign they're trying to cater to a community accustomed to variety. A great little business for the community!", "author": "Rina W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "My new favorite spot when I stroll my native mission. It's not only locally owned but they have a large menu for drinks and a pretty nice staff that is prompt. \nI've seen businesses come and go but this one seems like a staple that could last! \nI just went for the first time this weekend since I sadly no longer live in the city due to unfair housing prices but luckily I have good peeps to visit so when I'm in town, this could definitely be a \"spot\" \nJust this last weekend they had the most cutest and colorful altar for the dias de Los muertos tradition and celebration. \nThey even encouraged community folk to write down names of passed loved ones. \nI love this kind of community base and it makes me believe in SF just an inch more.", "author": "Hannah M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "Good  coffee and delicious bagels. The bathroom is also really clean and the customer service incredibly friendly and patient. \n\nLots of seating and outlets too if you want to study or do work.", "author": "Gabriela E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "It is possible to find a more homespun vibe in the Mission rather than subject yourself to the constant hipsterati. You just have to know which businesses to enter and start hanging out at them. This is one of them, and it's on the popular corner of 24th and Harrison right where people have frequently rounded the corner to get the Secret Breakfast ice cream at Humphry Slocombe. OK, maybe I was talking about me, but when I feel calorifically guilty, I come here and nurse a $3.75 large cup of their Drip Coffee (photo: http://bit.ly/2qY383K). There are plenty of other items to consider like big bagels, salads, and paninis. I'm fine with my coffee and not having to hear the inane conversations saturating many of the other Mission cafes.\n\nCOFFEE - 4 stars...obviously good enough for me to keep coming back\nAMBIANCE - 3.5 stars...relaxing spot even if the little tables are awfully close together\nSERVICE - 3.5 stars...certainly nice enough, just not that talkative until you become more of a regular\nTOTAL - 4 stars...you should skip the Secret Breakfast sometime and give your waistline a break...OK, I'm talking to me again", "author": "Ed U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-03", "description": "Temo is a bright little spot in the Mission and I enjoyed the ambiance greatly. \n\n- Pretty small cafe (but that's what to expect here?)\n- Food is great, ordered the chicken panini, picture attached\n- Enjoyed the horchata latte a lot!\n- Read a lot of reviews about nice staff, but didn't really see that (not a negative thing, just wanted to share my experience!)\n- Free wifi\n- The ambiance was awesome. It's pretty quiet and everyone in was pretty chill\n\nOverall had a great time. Rating it 4 because of the prices but that's my personal opinion. Other than that I don't have many complaints!", "author": "Waleed S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-12", "description": "Nice business to attract customers on the corner a busy intersection.Ordered a roast panini, with a chicken Cesar salad; just a tip they do charge $3 extra if you want chicken or any other kind of meat in your salad. Last, a warm pumpkin spice latte. They do not place on the lids for you or anything extra you have to do it yourself at the bar. \n\nI love that they have a charging station for most phones whether Samsung or iPhone so if you running low on juice plug it in. There cord is a little a short, but still free charging can't beat that.", "author": "Elijajuan F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-19", "description": "I hate to disparage the reputation of what appears to be a locally owned neighborhood cafe, but I think Temo Cafe needs a wake-up call.\n\nI ve been here a few times and the counter help has always been distinctly uninterested in anything more than the basics of taking your order and cashiering your payment. Zero friendliness or chit-chat so you feel like you're welcome here; it feels like you're interrupting them instead.\n\nRecently I ordered a sandwich and coffee and paid with my debit card. The cashier twisted the screen around so that I could choose among 3 suggested tips that started at 18% and went up from there. I chose 18% even though in no way did I think the service merited that. I feel for retail workers trying to eke out a living in insanely expensive San Francisco so I was ok with it.\n\nBut then I waited a looong time for my sandwich while I could hear the help gossiping about stuff non-stop from my seat. After a while I approached them to ask if my food was going to take much longer and I was told, totally unapologetically, that it was sitting on their counter. If they announced it was ready, I didn't hear it. \n\nSo they let my warm sandwich sit around and get cold rather than say something again or just walk the 15 feet to bring it to me. They weren't busy, so that's not an excuse for their indifference. These are people who just don't care about doing their jobs well, and I felt coerced by their flip screen to tip them a couple of dollars for this 'service.'\n\nI don't think I'll be back to Temo any more. There are good alternatives to them all around this neighborhood so why spend my money at a poorly run cafe?\n\nI hope the owner of this place reads this and fixes what's an easily fixed problem so they don't lose more business like mine.", "author": "Hugh G. R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-01", "description": "I love Temo Cafe. It's super close to my apartment so I usually stop by before work for my caffeine fix. It's right next to Humphrey Slocombe also! The cafe is pretty small but there's ample seating and plenty of natural light for working! There's also a decent amount of outlets.\n\nThe staff are all very friendly -- seems like it's a family owned business since it's very homey feeling. There's plenty of coffee and food options. The coffee is pretty good and not OVERLY overpriced (this is SF so idk every coffee shop is expensive). They have homemade hummus which I usually get on a plain bagel cuz I'm basic and i ain't about the fancy bagel life. They also have tons of vegetarian options. I like their vegetarian panini sandwiches also. There's some interesting flavors and combinations. The only downside is I wish they had breakfast burritos. LOL. Honestly I wish that on every breakfast/cafe/coffee spot, but you can't always get what you wish for. Overall, this is a solid place to grab a quick bite to eat and some good coffee.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Just let this cafe with the feeling that this world still have good people. \n\nApparently that one of the newhired employee is going through though times. The owner not only offered him a job at the café but actually offered the couch of her home for him until he can find a place that he can afford. \n\nEmployees here are honest. One customer was asking for an espresso drink but the employee was honest enough to share with the customer that he didn't know how to make it instead of faking it. \n\nI enjoyed my reading time here with the F&B. Again, I left the café with hope and gratefulness.", "author": "Lianna D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "This review is for their \"horchata latte\" only - it tasted just like a regular iced latte with cinnamon flavor. The regular-sized drink came out to be $5.50, which I thought was so overpriced. Once I got to the bottom of the cup, the drink was extremely chalky and powdery like they hadn't mixed it beforehand. \n\nI'm sure their other drink options may be better, but I was pretty disappointed with the horchata latte here.", "author": "Victoria L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-16", "description": "The service at this place and the ambiance is great and I can't account for other things in this cafe besides their horchata late, which was average at best. \n\nThe late is $5.50 and tastes more like a cinnamon sugar coffee rather than an horchata late. \n\nI'd suggest trying different things on the menu here and going for horchata at another place in the mission.", "author": "John A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "The first time I had coffee on the 24th, there are so many but I choose this one, I think it is because the store are homey but not cliché like Philz on the corner, and it is very hospitality and quiet for work. I saw people who sit here in a work mode, but the environment is not that intense. A little pricy but not too high, by the way it has WiFi with good connection.", "author": "Ting Yu H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Coffee is great, I loved my horchata latte. Just the right amount of cinnamon, but still taste the coffee. Sandwiches are ginormous! Smoked salmon is so good.", "author": "Tim B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "Service is kind. Salmon and cream cheese is delicious. Good prices and good quality. The owner is very nice", "author": "Dulce V."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-10", "description": "Sad to say Temo's espresso is horrible and undrinkable. The barista made my whole milk latte excessively hot, and the beans are bitter and taste burned.  Foam thin and watery.  \n\nLiterally dumping it out and walking down the street to Dynamo to get another one.  \n\nStaff are nice enough, but not so nice to justify a poor product.", "author": "Shannon S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "I was looking for a caffeine fix and stumbled on this cafe. Should've kept walking. Really bland iced lattes and the barista tried to charge me .75 for simple syrup which was free at the bar. Definitely up selling because it's carnival in the city.", "author": "Mercy N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-14", "description": "Went in there at 6 and the ladies in there refused to serve me food. They said they closed the grill... if the owner was there, this wouldn't have happened.", "author": "M. S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "I looove this place! It's a small unpretentious coffee shop on a great location, with bagels, pastries, smoothies and stuff. They have some nice options (nutella and banana bagel! ), a few outside tables, and the people working there are very nice and friendly.", "author": "Marta F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-21", "description": "This cafe has a very quiet and peaceful atmosphere. I'm a big fan of both the soy pumpkin spice latte and the greek salad. The latte has lots of flavor and foam. On their website is an interview with the manager of the Mission location, which describes how they pride themselves on having David Rio's Tiger Spice Chai (a local business founded in SF), so I want to try that next time. The interview says that customers enjoy the well-balanced spices that they can taste more individually and the level of sweetness. Apparently another review says they have macademia milk?!\n\nThe salad comes in a nice wooden bowl and is quite large and a reasonable price. There are lots of greek olives in it (one time they were pitted and not the other time) and lots of feta. The tomatoes were better the first time and also the homemade dressing was more flavorful the first time. However, both times they were delicious! The food doesn't come out immediately as they thoughtfully prepare it, but it doesn't take too long either.\n\nThe interview online says they roast their own beans in-house and source the beans from 5 different origins including Brazil, Columbia, Indonesia, Ethiopia, and Sumatra. One of the employees is from Palestine and they now have homemade hummus and falafel now on the menu. In the three times I've been there during lunch, I've seen 3 people order falafel, so it must be good! I would also like to try a bagel sandwich, which the manager says are also popular.", "author": "Sara M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Other than the super friendly service (5 stars!), I don't understand how this place gets 4.5 stars. The drinks were super sweet. Sadly, the cafe itself is a bit dirty and smells a bit.", "author": "e c."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "This is my favorite coffee shop in all of SF! The owner is simply incredible and caring. She takes the time to get to know her customers and it keeps us coming back. She also employees exceptional people and they make the best breakfast bagels with forest ham!", "author": "Maya A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "Great coffee shop in the heart of the mission . I really like being greated by the barista's big smile ( I dont know her name ) but shes always very . nice and fast with the orders .. good coffee and snacks too !", "author": "Micah W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Sweet locally run cafe with great selections and places to set up shop and get to work or catch up with friends.", "author": "Dani B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "I took my sister there yesterday and we had a great time.  Being a native San Franciscan finding a place where you can seat down and have great food in a great space is a winner for me.  Level of noise was only the street  I didn't have to listen to someone else conversation it took me back when people could speak without telling the world what they were speaking about.  Takes a plus in my book. Now to the food OMG I had a chicken sandwich there before and it was so wonderful and I had to take half of it home because it was so large. My sister had a Salad of which she said she would take to here meeting need less to say it didn't leave the cafe she couldn't stop eating it. It was fresh and the  dress was so good. The staff was warm and lovely to speak with both young man and young lady.  Stop by you will find a great spot with super food.  With easy music and really nice people.", "author": "viva H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-17", "description": "Friendly neighborhood coffee shop with all the essentials - coffee, tea, pastries, sandwiches. Great place to get some work done on the weekend (and avoid the crowd at Haus). Yelp check-in gives you free cup of coffee with a purchase!", "author": "Will Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Their Mexican mocha was great. Service was prompt and polite. My wife had the caramel mocha which was pretty good as well.", "author": "Mithun J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "Before I met Luna, Temo was my one true love. I would skip the shuttle and walk the mile to work, just so I can stop at Temo's or a delicious cup of chai latte with soy. However, after I met Luna ( who was right across the street from my work), I stopped coming here for the chai.\n\nHowever, I do still drop by for their sandwiches!\n\nTheir sandwiches are HUGE for the price, and a few of their pastries are decent! Their raisin bagel with cream cheese was delicious!\n\nBest part of this coffee shop is the location, which is right next to Humphrey! Thus, you can eat a sammy and eat ice cream!!", "author": "Josie H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "FOOD: Excellent value for price. Healthy options plus some delicious baked goods and the occasional more exotic option (fetira, baklava)). The bagels + anything options are solid. \n\nCoffee is excellent. The espresso I take issue with--the last (and first) latte I ordered had an incredibly bitter/sour taste, meaning that the espresso was ground too finely. I would expect more of a cafe that so emphasizes its latte offerings out front. \n\nAMBIANCE: Neighborhood spot. Hipsters hang here, programmers hang here, Jehovah's Witness proselytizers (so friendly) hang here. Very cozy and welcoming. A good place to work or read for a while. Never too crowded thankfully :). Inner spaces a little dark. Window seats quite bright. Sidewalk seats are nice and sunny in the afternoon.\n\nSERVICE: Always incredibly friendly. I feel welcome and happy inside :).", "author": "Helen W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-10", "description": "Nice folks. I didn't try the food, but their espresso is terrible. I only got through a few sips of my $4 cappuccino :-(", "author": "alex j."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-16", "description": "I've been here a handful of times and for the most part I've have good experiences. However, depending on which barista is there, it's a hit or miss. Today was a definite miss. I ordered a chai latte and it was SOUR. The barista used spoiled milk to make my latte. On another occasion, the same barista steamed my drink twice, and the milk curdled. I dismissed it as a one off, but spoiled milk.. seriously? Absolutely disgusting. \n\nThe only person that consistently makes good drinks is the lady with the dark-rimmed glasses. She knows what she's doing. \n\nPhilz makes excellent chai lattes, and it's consistently good. Do yourself a favor and walk the two extra blocks.", "author": "Cass Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Cozy, quiet coffee shop tucked away in the Mission. I was originally going to Philz to get coffee, but the line there was ridiculous and there wasn't enough seating, so I ventured down the block and came across Temo instead.\n\nThere's free WiFi, outlets and good coffee, and since it's much quieter here, it's a great spot for getting work done.", "author": "Jessie L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "I am appalled to read the below comment. I've been to Temos MANY times and not only know the family that own it but have been treated as family each time I am there. One of the owners (a female) is the nicest women and is always so happy to see her customers. Ever since I first went in there she has treated me so kindly and they always make sure my experience is exceptional. I do not believe that what happened below is in anyway a representation of their customer service. They will always go above and beyond for you. I've never had a negative experience and would recommend stopping by if you're ever in the Mission District.", "author": "Lena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Fantastic and friendly in a vibrant part of town. We got a falafel sandwich and coffees.  I tried the Turkish coffee and it's an experience you'll want if you are a coffee lover.  Was family owned and operated, as far as we could tell, and the mom was so informative about the Turkish coffee.  It really made the experience.", "author": "Cassidy F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "I'm a long-time lover of breakfast sandwiches, but I only recently hopped on the bagel train. Temo's Cafe deals primarily in bagel breakfast options (at a super affordable $2-7), so I decided to try the veggie bagel on wheat...a great decision. The flavors were so fresh, especially the avocado (included in price!), and the bagel itself was all crispy exterior and soft warmth inside. Add to that the fast, friendly service, spacious seating and cozy vibes (cue soft R&B and quiet, book-reading patrons) that complete this space, and you'd be hard-pressed to find a similar bang for your buck nearby. Don't forget to use the Yelp check-in offer for delicious coffee on the house!", "author": "Jeanine C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Very comfortable and cozy cafe on busy street but away from the madness that is Valencia and Mission. Great tasty food, delicious coffee. Enough space to feel okay. Will come sometimes.", "author": "Byron P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Very pleasant staff, lovely sandwiches, bagels, fatira. Became a regular very quickly!", "author": "Tanay P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "Nice neighborhood cafe with a heartfelt service and a good selection of Mediterranean salads and pastry", "author": "Zhenya M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "I wish this neighborhood had more quick and easy places like this. Friendly service, delicious bagels, fair price. Came here for the first time today and will definitely be back.", "author": "Sabrina M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "We were walking down the street just looking for a place to get coffee when we saw a sign for a Nutella latte. We were intrigued and went in and ordered. It's freaking delicious. If you're ever in the Mission and in the mood for a latte, the Nutella one at Temo's is hands down one of the best lattes I've ever had. And I'm from Seattle.", "author": "Serena M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "If you are like me and find it off-putting when a coffee shop is perpetually swarmed by a cloud of homogeneous bourgeoisie, this is a good coffee shop.", "author": "Kyle W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-31", "description": "Great, friendly service with lots of veggie food options and decent coffee at a reasonable price. Good place to get some work done while people watching along Calle 24.", "author": "Owen P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "This place is small and cute and has some outside seating. It's casual and a good place to go do a little work. There are lots of people on the free wifi in there. The employees are REALLY friendly. The white mocha I got was huge even though it was \"medium\" and the almond croissant I got was also gigantic. Mainly it's the super friendly, happy employees that make this place a great choice in the area. The woman at the counter was so smiley and nice!", "author": "Sherrod D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Super nice staff and reasonable prices! Very quick service and not super busy, a great place if you want to avoid the techies!", "author": "Mandy B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "My second go-to caffeine spot in the neighborhood. I generally don't eat much here, but the few times I've had a panini (turkey once, chicken another) I was pleasantly surprised. The staff are gracious and warm, and service is quick. The only thing resembling a complaint is that it's always a sauna in there, even on the consistently warm days the Mission gets pretty frequently.", "author": "Tessa M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-10", "description": "I've had bad experiences there because the staff and owner get the order wrong consistently.  One example of this is grinding the coffee to go, which I always wanted to have coarse for an auto drip maker but have always been given very fine powdery ground coffee like for espresso, which in an auto drip coffee maker at home makes the coffee taste muddy.  It's taken a lot of work for them to get this right, which they finally did.  Unfortunately they messed up the other part of my order (I ordered 3 poppy bagels and 2 garlic bagels but they only gave me the former).  When I called to complain, since after all communication is a consistent problem there and I'd never complained before, they unfortunately argued with me, said they have footage of me walking out with the bagels and, after promising to deliver the two missing garlic bagels to me (I live 10 minutes away), called twice to argue that they didn't mess up anything.  It was bad customer service desert, to their inability to listen to orders entree.  It's a nice vibe in there, and the lighting is good - but the people who work there really need to improve their performance and listening skills.", "author": "Evan K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-09", "description": "I ordered the Horchata latte with macadamia milk and 1/2 the normal sugar. The foam and drink were very fragrant and tasty, thought still a little too sweet for my personal tastes.\n\nI also ordered the breakfast bagel on garlic bagel, which was delicious. The bagel was nicely toasted, slightly crispy on the outside and chewy on the inside. They put egg and a slice of American cheese inside, melted to gooey goodness. \n\nWiFi is free, nice big sunny windows, and plenty of outlets, although the tables are a little small. When I went Thursday morning, there was an incredibly personable, warm woman behind the counter who urged me to get my horchata latte with macadamia milk. She offered me a little sample of the milk in a cute espresso cup! The only detractor here is the interior decor, which important to me when it comes to cafes, but everything else is wonderful! If you don't care about interior decor then consider this place 5/5 stars.\n\nAll in all, come here for good food, good espresso, and good company.", "author": "Vivian L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "AWESOME PEOPLE AWESOME FOOD AWESOME COFFEE. It's clean and people, not only staff but also customers are polite here, making this a quiet, comfortable, and cozy cafe.", "author": "Donna Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Just had one of the best chai lattes! \n\nTemo's is the the quintessential neighborhood cafe - great service, tasty food (coffee, bagels, sandwiches, salads, oh and you have to try their baklava; they hand make it from scratch!), free wifi, great atmosphere and location, and Doblets! :)  \n\nI'll be back!", "author": "Corrina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "Great little place that served very nice and large sandwiches! Went here as a last hurrah before leaving SF; having a nice pot of tea really sets the tone of the rest of the day!  Definitely recommend as a place to sit for a bit; but be kind enough to spend money on them and don't just occupy a seat cause its a wonderful place!", "author": "Howard Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Great family owned coffee shop on a beautiful, sunny corner. Awesome place to post up with a book and have a delicious selection of coffee and sandwiches. \n\nHuge selection of pastries, sandwiches, salads, and teas in a fun neighborhood!\n\nCheck out the crazy big daily roaster machine btw", "author": "Roy C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "I stumbled into this coffee shop after taking a yoga class down the street.  It's totally out of the way for me, but worth the extra drive time.\n\nTemos has the warmest, most personable people I have ever met in a coffee shop.  They have great food too.  It really feels like they make everything with love.  Hands down best latte in SF.", "author": "Jackie C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-15", "description": "Temo took over Bello recently, furnished similarly with many small tables inside and a few outside. They offer a handful of very standard pastries and bagel sandwiches, and free wifi. The staff are really nice, and I love that it is a mom and pop shop, but I wasn't really impressed by the food or the coffee.\n\n* ALMOND MILK CAPPUCCINO ($3.60) - 2.5 STARS:\nStrong but served with Pacific almond milk, not very rich or creamy. Yet I felt there was too much milk inside. Overall, I liked that it packed a punch but it wasn't my favorite. From a SF standpoint, this is on the cheaper side for a cappuccino but I still prefer Grand, Four Barrel and Ritual for lattes and cappuccinos.\n\n* VEGGIE BAGEL add egg ($5+) - 3.5 STARS:\nDecent sized veggie bagel packed with cream cheese, cucumbers, tomatoes, and I added an egg. It was pretty good but I've been spoiled by so many delicious breakfast burritos, bagels and sandwiches. This was just ok.\n\nYelp Check-In Offer: Free 8 oz coffee with purchase. \nPro-Tip: They accept credit!", "author": "Jess C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-14", "description": "Temo's is that local coffee shop that everyone talks about as their \"...little secret spot in SF\". Great service, coffee, snacks and staff. Yes recommend!", "author": "Pstephan A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "This is my first time visiting San Francisco so I am exploring! Temo Cafe was a perfect little oasis situated within the Mission District neighborhood. The staff was very sweet and welcoming, the coffee hot, and the blueberry coffee cake delicious!!! If you are in town stop by for a cup, or if you live here and want to have a coffee date, or some me-time reading a book and relaxing, this is your spot!", "author": "Carlie C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "Sometimes, when you've just moved somewhere, you find that cozy little coffee shop with the right art on the wall, the perfect windows to enjoy the good weather, free wifi, and more than enough outlets (thank god!). You grab a brew, open up the gadgets, and settle into your seat like a bird making his nest. You don't plan to move for hours, this spot is perfect.\n\nWelcome to Temo Cafe.\n\nThis is the first time I've sat at the cafe, but the place is filled with the kind of warmth the lights your soul. For the barista & coffee elite, they roast their own beans. For the coffee shop worker, they provide delicious food, including homemade hummus. Most importantly, for everyone they provide a sense of community.\n\nThis is the perfect spot to work through the day or recharge your weary batteries. I highly recommend it!", "author": "Michael M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-03", "description": "This location has been a coffee shop/cafe for as long as I can remember. Going back over 7 years I've walked past it nearly every weekday. I've seen it change from Sundance http://www.yelp.com/biz/sundance-coffee-san-francisco-2 to Bello http://www.yelp.com/biz/bello-coffee-and-tea-san-francisco-2 and now it is Temo Cafe. \n\nNormally when places change hands so often something is wrong with it. Seeing as just the name changes for the most part, the new ownership has left pretty much everything intact. Just a name change, a few new employees and a fresh coat of paint.\n\nThey also still roast their own coffee on site using some gigantic automated contraption that I've never seen at any other cafe. That alone goes a long way towards freshness.\n\nLately I've been getting their Americanos and taking advantage of their current check in offer of a free 8oz coffee. The Americano when brewed by either the owner, or the short gal barista, has been excellent. The others are kinda as sketchy. \n\nAt $4 for a large, it's a nice change of pace from getting Philz down the street. Although it's actually pricey for an Americano. This ain't Ritual quality but it seems to be Ritual prices. I'd rather go to L's Caffe down the street.\n\nThey gouge you $0.95 for freaking soymilk. After the price increases, this place has lost my business.\n\nThe seating is comfortable and free wi-fi is available should you choose to hang out here for a bit. As I just grab and go, this doesn't factor into my morning routine, but I'm jealous of those that are able to do as such.", "author": "John B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-17", "description": "Ummmm new favorite coffee shop! \n\nToday, as I ride the struggle bus following last night's epic defeat of the Cardinals, and after I cleaned up all the broken succulents and jasmine in my front garden that someone so rudely destroyed (out of happiness?? Since when is desctruction OF A GARDEN a form of celebration?), I decided that I deserved a coffee and a bagel from Temo on my walk to Bart. \n\nThey're offering a free 8oz coffee (iced or hot) with a purchase and a check in on Yelp, so it felt right to go there. And now I'm in love with the place. When it was Bello, I was not a fan. The former owner was abrassive and rude, but the new owners are a nice Greek couple who employ the sweetest girls!\n\nI got a Garlic bagel with cream cheese ($3) and an iced coffee (free!) an chatted with everyone working there and played with a little girl running around the cafe. It was a great morning. They also have Kombucha and other juices, along with hummus and eggs etc. for topping the bagels. Good stuff, I will surely be back with friends to show them how awesome a mom-and-pop coffee shop can be when run well.", "author": "Crystal C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "I just spent four+ hours here, without even realizing. \nStarted with a thick and well-made Turkish coffee over conversation with the owner (who is helping me refresh my Arabic and has named me Yasmeen), and ended with a down-to-earth chat at closing time with the awesome and super-friendly William. I absolutely enjoyed every second of occupying my computer corner, overhearing the chatter of the neighborhood in multiple languages, surrounded by waves of sweet coffee concoctions and whatever top-40 radio station happened to be on. \nAs a new resident of the area, I'm so pleased to be located near Temo's. New coffee-shop workspace for life.", "author": "Liz R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-20", "description": "For the coffee alone, I sadly would have to rate this 3 stars, but the friendly, courteous atmosphere makes up a little for it.\n\nWe were on our way to Haus just a short distance away, but I guess we got a little tired of walking and decided to stop into this place.  It was unusually quiet for a weekday afternoon; only one other person was in the shop when we came by.  They had a number of different beans on display around the wall of the store, but unfortunately, we couldn't specify which beans to use in our coffee.  As is the case with many coffee places, it appeared that many of the beans had been over-roasted.  I'm not sure what was used for our drinks.\n\nI'm generally not a frou-frou coffee drinker - just give me a light roast and I'm happy, but I decided to try their eggnog latte.  Poor choice, sadly.  The drink was cloyingly sweet and I couldn't get a great sense of the coffee itself.  My friend ordered a cappucino, which he said was a little disappointing as well.\n\nThis place has been open for only a short period of time, so perhaps with time they'll be able to refine their coffee-brewing skills.", "author": "Lee L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-24", "description": "Great breakfast bagel. I recommend sesame seed!\nBreakfast bagel so good I finished it before I took pix", "author": "David M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-18", "description": "Went out of my way to come here on Monday because I was set on their rose latte and I also wanted a quiet place to read. The service, cleanliness, and space was great. Although I did wish that if the barista did not bring my coffee, he could have shouted out that it was done, as I was the only customer waiting and I was tucked away out of sight. Pretty empty, free wifi, quiet. But I was really disappointed in the most important thing which was the coffee. The milk wasn't rich, no foam, no art, weak coffee flavor, and not even a hint of the rose. Sad because they boast this flavor board but it just tasted like regular coffee. Many better options in the area.", "author": "Jackie T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "This is one of my favorite cafes I've been in anywhere. Chiefly because of the kindness of the people who work there. Often, restaurants and cafes take on the frustration and neuroticism of their owners, with staff treating you fine, or ok, or downright poorly. But when a place is wonderful, it is often taking on the kindness and excellence of the owners as well. And the staff at Temo seem like real people who truly care. I chalk that up to them being sincerely kind and because Lamea cares for her staff in a way that is genuine and special. I was there one day and it was her birthday and her staff made her a cake and were excited to share with her and surprise her. And I understand why. She cares for others (particularly those in the community) and always seems joyful. I loved chatting with her.\n\nAs for the food and drink: the tea I had here on numerous occasions was delightful and they were happy to try different creations of tea lattes that I suggested, even trying them themselves to see how they tasted. And the sandwiches tasted great. \n\nWhen I got to cafes, I don't want to be a burden, I want to pay for good fare, and I want to slip into the culture seamlessly so I can take in what's around me and either chat with a friend or get work done. Such is the aura of Temo Cafe--with the kind staff, the big beautiful corner windows, the laid-back feel, and the enjoyable food/tea. \n\nI tell any of my friends who live in SF (or the Valley, or Oakland, or who are visiting SF) to go to the Mission and stop by Temo to say \"hello\" to Lamea and to connect to the community there in the best way.", "author": "Richard G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-19", "description": "Run by the most wonderful lady. So friendly and neighborly. Get a bagel with cream cheese and lox, then add whatever else you want! (Onions, capers, tomatoes, etc.) Wifi's good and it feels cozy on a foggy day :)", "author": "Tara S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "The espresso was not good and tasted more like low quality drip coffee.", "author": "Maureen L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-17", "description": "Nice and peaceful local cafe, great for an afternoon with a novel and some coffee. The atmosphere is calm and the staff very friendly.", "author": "Bai L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "The vibe is very chill in this cafe and the food is decent. I like the different flavors of lattes and mochas! The workers there are so hilarious and I had a great time conversing with them .", "author": "Kayla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-11", "description": "Happy I finally went. It's a small cafe, not for people in a rush, but if you want a quiet place to do work it's great!\nDidn't notice how many outlets it has though.\n\nTheir coffee is delicious! Macadamia milk. Just do eeeeet. Never had it before there but I'm a fan.", "author": "Ellie M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-22", "description": "I came here specifically for the Prana chai which I drank all the time when I visited Australia. I was really disappointed. They may have the exact chai from Melbourne but they really don't know how to correctly make it. It was really watery & didn't have that full chai aroma. They should really be steaming the milk with the chai and then straining it to get the perfect taste. I did buy the bag of chai so I can make it the proper way at home.", "author": "Ree M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "Cafe Temo has an excellent atmosphere!  On warm weekend mornings and afternoons they have their doors open and sun streaming in.  The service staff are friendly and the seating is comfortable.  All in all, Temo is an excellent place to spend a lazy weekend morning.", "author": "Stephen B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "My favorite cafe in SF! Rarely crowded, friendly staff, good prices, delicious food and drinks :]", "author": "Amy S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-19", "description": "Coffee beans are roasted in house everyday! Breakfast eats are very good and the lunch selection is fantastic. Not to mention free wifi.\n\nBest of all is the atmosphere, everyone is warm and welcoming. This place doesn't look like much but the service is always on-point, the coffee is great, and the food is surprisingly good. Great place to catch up on some work, or just a nice place to start your day", "author": "Joe N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "I went into Temo cafe last week, expecting it to be Cafe Bello, and I was in for quite a surprise.. I was met with some really nice coffee baristas and it's owner, who all made me feel quite welcome.  He really took the time to explain his views on what makes great customer service, and then proceeded to give it. Which, obviously, the baristas fallowed as well. They really seemed to enjoy their work, and want my business, and the coffee was quite tasty too. To top it off, he owner gave me a free piece of Baclava to go along with my Espresso Macciato.", "author": "Paul M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-10", "description": "I stopped into this cafe on a whim on a Saturday mid-morning. As an out-of-towner, I was enjoying simply wandering around and exploring the mission when my need for coffee grew too strong to ignore. I saw a sign out front of Temo advertising a Yelp check-in offer, so I decided to pop in. It's a really cute, quaint little place in a great corner location. There are lots of tables to sit at and plenty of sunshine. The staff was friendly and really quick.\n\nI ordered a bagel with cream cheese and a coffee. The bagel was pretty standard, no complaints here, but the coffee was excellent. There were a lot more food options than I expect from the typical coffee shop. This seems like an excellent place to grab a quick, inexpensive lunch. I sat and enjoyed my bagel and coffee at a sunny table while I read my book and had a lovely time.", "author": "Rachel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-17", "description": "I live close to this little coffee shop but never bothered to explore it till now. It was ... Eh... Walked in here to grab a bagel with cream cheese and to check in on yelp for a free cup of coffee. The bagel was alright, something you can get at Safeway. It was overpriced in my opinion at 3.25. I was hoping the coffee would make up for it, but since the coffee was free, the owner didn't give us the full cup and I saw that she had watered it down. \nThis was disappointing-- if you're going to give a free cup of coffee, give a full cup. It just made the business seem cheap. \n\nI'd come here again if I was in a time crunch and needed something quick and close.", "author": "Nancy W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "I was really impressed with the service & the quality of the baked goods, & tea selection. This place has been a rotating door for almost 20 years and I really like the new owners too. I wish them the best. This city is not only harsh for the workers trying to still live here, but the small business owner is messed with relentlessly by the turds that make the deals in this town. Let us continue support businesses and people like these please so the bad feelings don't take over!", "author": "Dionne S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Great service and the baristas here are nice! It may not be the quickest but the environment here is relaxing. I would love to come back!", "author": "Karen J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-20", "description": "Oh My God. No, seriously. This place has the creamiest, frothiest, lightest, mouth watering Horchata Latte with Macademia milk! I love La Misión, the sabor is just so lovingly BAM! And this Horchata Latte with Macademia tastes like I'm drinking it all in. This place, THAT taste and gorgeous murals... Gua!! It puts that ritmo in your step. I tried the Horchata Latte with Macademia milk last Thursday and it lingered on my mind all week. A heady flirtation that had me breaking out in song and smiling with ease for no reason, save the memory of this taste on my tongue. So if you saw me on BArt that way smiling bright & wondered, hmm, what's she got that I don't? The answer my babies is an Horchata Latte w/ Macademia milk from Temo's in La Misión. No small addition, the people who work here are SO sweet! Most days from random employees I hope for professional and sometimes get it, but sweet?? Yes. Here you get that.", "author": "Berta J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "New ownership is great. Best breakfast bagels in the entire mission. Coffee is great as well!", "author": "Rob A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "I spent the day with friends who were constructing a video review for Temo's Cafe. Everyone was so friendly! They let us sample different beverage concoctions. I am normally not a coffee fan, but I loved the Mexican Mocha! I ordered the Falafel Sandwich and my friend ordered the Chicken Panini. Both were fantastic! You can just tell the owners are passionate about their business. The owner even bought us flowers from the vendor across the street. So sweet! It was a great day at Temo's Cafe!", "author": "Tal M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-17", "description": "Love this place, the folks who work there are solid good people. Plus they have this awesome device that makes their Ice Coffee. It looks like a mix between an hour-glass and something you would find in a 1920's lab, pretty sweet. Oh and yes the Ice Coffee is fabulous, like pretty much everything there.\n\nIt's open earlier the most Mission area coffee shops on 24th and Harrison. \n\nGo, chill and get caffeinated, then wake up and do your dishes!!!", "author": "Karole L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "We had lunch catered from here at the office. The sandwiches were amazing........ We had 6-8 different sandwiches to choose from all were delicious \n\nI am definitely ordering from here more often", "author": "Mike S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Temo's is a family run business. I experienced it before I overheard it. What I mean by that is that the employees do not seem like unhappy minimum wage workers. My coffee was pretty good, and I can see myself coming back here again.\n\nThey do have wifi, power outlets, and pretty comfortable seating. Oh and one last thing that I noticed was that they do not dilly-dally, and make every effort to get you on your way ASAP.\n\nNicely done Temo's team!", "author": "Vivek N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "You know when a place changes ownership and you get worried that your favorite coffee shop is going to change for the worse?\n\nNot here! The new owner is very sweet. The baristas are always charming and conversational and the lattes hit the spot. Good ambience for work too if you need a quiet place.", "author": "Garrett S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "The coffee is great, the veggie panini tastes extremely fresh and is delicious, and the owner/employees are super nice. On top of all that the prices are very reasonable. Can't go wrong here.", "author": "Neraj B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "As a local I have been going to this cafe for a long time even before it changed owners. \nPrevious owners were great and new owners continue the same. \n\nThe previous cafe reminded me of a very business type cafe like Peet's coffee but with the new owners it has a more \"family\" feel. \n\nIt has a very mom and pop feel to it and the owner is very nice, it's one of those cafes that are family owned, not pretentious in any way, very honest with their pricing, and it's run by a very hard working family.\n\nI have paid attention to their customer treatment and they are very nice with absolutely \"everyone\". \n\nFOOD: they added food (sandwiches, etc)\nI have been very pleased with it, delicious.\n\nCoffee: lots of options and flavors to add, unique and delicious!\n\nSo many options on the menu, it makes me feel happy knowing I have so many Delicious options.\n\nI'm also happy to see diversity in the Mission continue and this family adds to it. Thank you!", "author": "Sara J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Best decaf latte in town. Super friendly staff and a great collection of food and drinks.", "author": "Claire R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "SUPER yummy coffee. and the knish. oh yum I could eat multiples. If you're going to spend on coffee and treats skip Phil's and come here.", "author": "Zara S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "I hate giving poor reviews but wow. The only good thing about this cafe is that Humphry Slocombe is next door... I really don't understand the good reviews. I had the worst coffee in SF here: it had the horrible quality of being both watery and burnt. The kind of coffee you'd expect at a low rent motel not a highly rated cafe. Maybe the barista was still in training? But with pigeons walking around and a homeless guy coming into yell at the tenants... what??? Also the wifi was unusably slow. There are so many good cafes in this city and I would advise against anyone coming here.", "author": "Anna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-15", "description": "It might be a little expensive but it's worth it and for example  the chicken sandwich is really big so I give it 5 star's", "author": "Dana R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "This place is really cute and friendly in a sunny spot. The coffee is very good and the staff are very friendly. We stayed for hours using their free wifi and the place was comfortable and welcoming.", "author": "Lauren T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Great little cafe run by a very warm and welcoming group. Small, cozy, with just enough seating to qualify as a good study space. Diverse options of food and drink. Will happily return", "author": "Sergey P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-18", "description": "Temos is the definition of a comforting neighborhood cafe. Their service is outstanding, and every employee working always makes you feel part of the family, whether it be by making a happy face in your latte or giving you free samples of knitches, baklava, or smoothies. A wide variety of menu offerings has something for everyone, and makes you want to come back each day of the week to try something new! My favorite so far is a soy vanilla rose latte and the veggie bagel with cream cheese, tomato, avocado, onion and cucumber. The possibilities are endless! This cafe still manages to be family owned and operated in today's corporate world of standard impersonal service. Having temos in the neighborhood keeps an authentic feeling in the area!", "author": "Alisa W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "I drink A LOT of coffee in the mission area, and Temo's Cafe is the most frequently hit location on my many busy days. \nLamea, is one of the sweetest people I have ever met, and her staff are all just as friendly. \nThe location is perfect for when you're running to the bus or bart; the coffee is made quickly, but never tastes bitter or burnt. It's extremely tasty coffee. And I eat three of their pecan bars a week at least. \nThere is a lot of competition in the mission for good (or \"artisanal\") coffee, but in my opinion, nothing compares to service.\nI keep going back to Temos daily because I feel not only acknowledged, but also appreciated, and I leave with higher spirits and a lasting caffeine rush.", "author": "Orchid T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-29", "description": "I come here every day to get my breakfast and my morning coffee. Nothing better than their ice drip coffee. It's so amazing!! So many sandwiches and breakfast options. \n\nThe staff here is so friendly and you'll feel at home. I highly recommend this place.", "author": "Ahmed E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "Yummy cappuccino. They roast their own beans and while, I can not imagine being anywhere near this place ever again, I will be back if I happen to be.", "author": "Joe R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "I love Temos the Owner/workers are so friendy and they make excellent coffee but another plus their fallafels are delicious as well as the best tahini and hummous in the City\n\nCindy", "author": "Cindy D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Double shot latte + gluten free brownie = perfect way to revitalize your afternoon. Nice cozy cafe with friendly owner and staff. Good place to work (solid wifi with several outlets) or to have a cozy chat with friends.", "author": "Alan L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Just switched owners.  Like before they have great breakfast bagels. Plus they have free coffee for checking in right now.  They also have homemade falafels and I am definitely coming back for one.  A nice family owned place that I am glad to support.", "author": "claudia g."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Had a great sandwich from Temo's today.  Friendly staff as well.", "author": "V A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "The best coffee shop In the heart of the Mission District.. The owner is nice and so sweet she gives me cavities. I asked what are they known for here and they said everything lol. The coffee is great the lattes are amazing, I love this place and definitely will be back to visit. Great customer service and great drinks.", "author": "Jake E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "Awesome service, great coffee (very fresh and tasty), and excellent food. Highly recommend the white mocha.", "author": "A. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Temo's is our favorite 24th st coffee shop! Super delicious coffee (roasted there!) that fuels our workday! Everyone who works there is happy, works fast, and takes care of all the details. The food is also delicious, fresh, and wholesome. \nYou feel welcome and cozy from the second you come in the door!\n\nThanks everyone at Temo :D", "author": "Mary H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "lattes are good, food takes awhile to come out but there's plenty of seating and the wifi is strong.", "author": "Sonya Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "Comfortable chairs, lots of outlets and wifi. Yummy cheep food (great falafel). They make tea very well, which is unusual for a coffee shop, and they have a huge variety of tea which they are happy to make iced, my favorite it Rose Back tea.", "author": "H B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-22", "description": "Food/drinks are good here. Service is fantastic - they are super friendly. Way better service than the frigid/condescending staff at Sugar 'Dumps' (Sugar Lumps) down the street. Just saw staff personally bring an elderly local his drink and chat him up. Also way better ambiance, lighting, and cleanliness than at Lumps. Wish they had a rewards program but will still keep coming here to study.", "author": "m s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "This is probably one of my favorite coffee shops in the area! When I'm biking early morning in the city, this would be my first choice to grab a nice hot cup of coffee or mocha. The place is very cozy and spacious. The people who run the place know what they are doing, and treat you like family, so your always getting the best quality drinks and food! This place deserves 10 stars, not 5!", "author": "Usama S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "This is what a call a good renovation.\nThe new owners took over and their focus was customer service and making everyone feel special. \n\nUnlike other places that have taken over previous owners but made things more \"hipster\" by their lack of friendliness, pale and opaque decor and ambiance, painting over the \"bright\" colors of the Mission, Temo's did it right and I'm glad they are keeping the \"Mission\" feel alive.\n\nI mean \"Calle 24\" the new name and streets that are now protected by law. \n\nI've been going here ever since \"Bello Coffee and Tea\" owned it and one of the pluses now is that they sell food. I'll note that past owners were also great. \n\nQuality is great, the coffees are delicious and they offer a wide variety of flavors, sometimes I feel like having a coffee like in Starbucks (with flavors and whipped cream) and not many cafes in the Mission sell them. \n\nIt is more \"cozy\", less \"business\" like and it has a family feel to it. \nYou feel \"happy\" being here.\n\nThe owners are usually there and they work very hard. \nThe employees look happy and I've noticed she treats all customers the same. \n\nI am glad that a new family owned business joins the \"Calle 24\".", "author": "Amb V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "I enjoy coming to this coffee spot on 24 st. The staff is friendly and courteous. The food and drinks are reasonably priced. The seats are so comfy I read, charge my phone and when my friends come, we can talk and its not super loud. Also they have tv on and they show news not stupid programs! 5 stars derserved!", "author": "Adriana M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Great Cafe with some of the most friendly staff I have met in the city. The coffee and breakfast options are fantastic and they will always make you feel right at home. I go every morning before work and it's a great way to start the day. If you are looking for a comfortable cafe with amazing treats and service, Temo is the place for you!", "author": "Owen F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-27", "description": "More than just a coffee shop, Best local coffee shop in mission ,Solid selection of specialty coffee drinks if you're into that and the food options rock.", "author": "Wasan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "For the last two years, I've visited Temo's nearly every morning. I've watched the business go from struggling to vibrant. Much of this has to do with the hardworking and determined owner but she also brought on two wonderful Latina women Maria and Katie. Together, the three of them have created a cafe that reflects a very diverse neighborhood where all feel welcome and are represented  to order their favorite coffee, pastry, and excellent selection of Palestinian pastries and delicacies. During a period of intense change in the Mission, I'm glad that Temo's is thriving!", "author": "Daryl C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "Every morning I get my coffee and hot  croissant always on point and services is always 100%  thank you", "author": "Khaled M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "Temo is a great cafe with a relaxing atmosphere.  They also have a great tea selection which you don't always find everywhere.", "author": "Michael E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "The nicest people run this place, they roast their own beans and it's so perfect! Not too bitter, just right, and they're getting good at their latte art. What I like about this place is that, unlike many new establishments in the mission, they actually want to be part of the existing mission community, they are great neighbors!", "author": "Mabel J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-09", "description": "we love lamea, her beautiful family & the staff of temo cafe. their coffee fuels our days. they're the sweetest & we're so happy to have them on our block.", "author": "aerin w."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "I love this café! I keep making a beeline for it to get work done. Wifi, plenty of outlets, big windows and great natural light. All the employees are so friendly. Great coffee and tea, plus they also have pastries and full sandwiches. It is a great neighborhood spot.", "author": "Tara B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "Exceptionally awesome staff, amazing coffee and I really like the cakes and cupcakes.", "author": "Marvin P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-25", "description": "Visiting San Francisco and found this great coffee shop. Loved their latte. Coffee is roasted in the store. Love finding great local coffee shops like Temo, will be stopping by again for another Latte.", "author": "Ashraf S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-29", "description": "I was looking for a small non annoying cafe with free wifi and snacks. I love it! and the ice tea is delicious. Not empty, but not to crowded. Clean and friendly, not a ton of hipsters either.", "author": "Lisa M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-09", "description": "its a nice small place. ordered a white mocha to go and it was pretty good. service was very good. I will defintely be back.", "author": "Mohammad A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-17", "description": "I think this place is a lot better now that it is Temo Cafe. The ladies that work here are extremely nice and they remember you if you come in on a regular basis (or even just a few times). They have excellent baked goods and I like that they have a choice of different roasts even for basic brewed coffee. The quality of the beans is great for the price and I can usually be in and out within a few minutes (very important if you're running to work).", "author": "Elias M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "I try to go here everyday and when i don't i really feel like my day is not complete.  I used to be Starbucks number 1 customer but now all i drink is Temo's cafe Vanilla Lattes are incredible!!! Breakfast Sandwiches with Ham are great get it with a bagel or croissant.", "author": "Edna T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Temo is great because their coffee is strong and the iced coffee is perfect for walking through the mission on weekends. The owner makes homemade hummos and has bagels as well. I love going here, and Its perfect for mornings and weekends.", "author": "George Q."}
