{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Food: Really good vegan options, but not 100% vegan like I had thought. Sizeable menu. It wasn't the among the best Chinese food I've eaten, but it was still great.\nService: the place was quiet when we went, and we were well attended to.\nLogistics: it took us half an hour to find parking... \nAtmosphere: cute, quiet, Chinese place.", "author": "Elizabeth G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "I'm Chinese and therefore so are my parents.\n\nI wanted to visit Tenglong years ago while I was looking for a good Chinese restaurant in the Richmond for my parents. They chose a different place, and so it went. Fast forward two years and we finally came here, tired and hungry from walking, for lunch.\n\nAnd I'm glad we did. This is now one of my favorite Chinese restaurants in the city.\n\nI've had Chinese food around the world over an entire lifetime (which is longer than you might assume), and I can conclude that Tenglong serves good Chinese food. The woman who serves here is really friendly, and the chef has won an award in China for cooking.\n\nFor the best deal, stop in for lunch and get one of their specials. Really, everything we got was delicious, so order away.", "author": "Keane L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-15", "description": "So disappointed in this place. The Ma po tofu with veggies was basically a ma po packet, tofu cubes, and a quarter size chopped green onions on top. No other veggies. And that was a $11 or $12 dish. The black bean sauce chicken was ok, 3 stars at best.  Definitely not a 4 star place as rated by Yelpers. Clement street was supposed to be Chinatown west so I was expecting good food for a good price. I got average to below average food for a high price.  Stay away from Ma po tofu with veggies, maybe something else is 4 star but not that.", "author": "E H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-17", "description": "This little restaurant has heart- and great chicken wings!\n\nParking was at a super premium on a blustery, cold Friday night; the scarcity made Saturday Market day on Clement look like a snap.\n\nSo I was really touched watching our server dash out the door to deliver an order to someone waiting  in his car, flashers on. Then she rushed back in, ran his credit card and jogged back out for him to sign the receipt. \n\nWho does that? \n\nWell, apparently this lovely mom 'n' pop restaurant Tenglong does.\n\nAnd the food? Delicious. \n\nWe came for for the wings and weren't disappointed. One Yelper wrote how the crispy coating \"shatters\" in your mouth on the first bite and that perfectly describes how deliciously crunchy these wings are.\n\nYou can order them spicy-  or sweet (choose spicy!)\n\nMy little boy and I ordered nothin' but fried things which was my mistake (I was tired and wasn't thinking) so of course dinner was too heavy. I should've ordered some savory beef dish or basil chicken, next time..\n\nTenglong does deliver though I'm not sure of their delivery radius and they're one of the few Chinese restaurants that doesn't use MSG.\n\nGo there for the wings (or order delivery), try some of their saucy, savory dishes and support this high quality Chinese restaurant that has so much heart & soul you want them to become a legacy business.", "author": "Jennifer O."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-03", "description": "Clean no msg place I really wanted to love.\nBut dry fried chicken is no where close to San Tung.  Missing the depth, garlic and the kick.\n\nMongolian beef was also good, full of onion and thinly sliced beef. Not bad.", "author": "David H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-08", "description": "I came here for dinner on a weekday and the place was empty. Only one other customer showed up while we were there, so service was prompt. I ordered the vegan sweet and sour \"chicken.\" The waitress asked if I wanted fried rice or chow mein with that, which I thought was part of the meal, like adding rice or something. In hindsight, chow mein seemed like a weird thing to include with sweet and sour chicken, but I was exhausted from travelling and new to the city, so I didn't question it and opted for the chow mein.\n\nThe sweet and sour chicken was delicious and, in the end, it was really good with the blander chow mein, so the flavors weren't so overpowering. The dish had pineapple pieces in it for the sweet kick and some onions and bell peppers as well. The chow mein was standard veggies with noodles, nothing special. \n\nThen the bill came out, and I realized that the chow mein was a separate dish entirely. I thankfully got two meals out of the deal so the amortized cost was standard for a relatively cheap meal, but I think it is incredibly bizarre that the waitress would ask me if I wanted an entirely different entree in addition to my first entree. Given the context of her asking, the chow mein definitely seemed like a side dish, not a new entree. The waitress was nice, friendly, and packaged up my leftovers really well, but who asks someone who has already ordered an entree if they want a second entree?", "author": "Elyse M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "Tried dried shrimps here. Shirimps sauteed in butter that is my kind of dish, executed really well. The quantity was goof as well. The staff was really friendly which i really liked. Would definitely come here again.", "author": "Sharad B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-02", "description": "I ordered take out here on eat24. \n\nPortion sizes are large, prices are very reasonable and food tasted great. I ordered the curry chicken rice plate during lunch and I liked it so much i ate all of it (despite the quantity). I'll be back! :)", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "Soooo good! Really delicious Chinese food in the heart of Inner Richmond. Highly recommend their salt and pepper wings! We ordered delivery and there was no additional charges, the driver was on time, and easily found our apartment. Fully satisfied!", "author": "Sabrina P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "Ordered Kung Pao Chicken which is usually a spicy and tasty dish. This was neither. I was the only person in the restaurant which should have been my clue. Food looks good and took long to make. \n\nI don't understand all the great reviews this place has.", "author": "Allan M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-19", "description": "3.5 Fortune cookies.\n\nClement street has a plethora of Chinese restaurants ( most in my opinion are pretty mediocre). Tenglong really is quite different....\n\nFirst of all the restaurant is clean inside. I don't know about you but a filthy restaurant just screams....food poisoning (silly me).\n\nSecondly the service is super friendly and fast ( no New May Wah surliness)\n\nIs the food amazing...NO...but it is good. Plus there is no MSG. \n\nSure the food is a tad salty but you can always ask for less.\n\nPrices are pretty reasonable ( much less than Ton Kiang ).\n\nFree delivery within the neighborhood.\n\nCheck it out!", "author": "David G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "I live in walking distance and this is my go to place for lunch on the weekend due to their lunch special!", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Very delicious food. Friendly staff. We ordered the soy chow mein and vegetable fried rice! It taste so yummy and healthy. I will defiantly be coming back here.", "author": "Kimberly E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "It's such a cute family owned(?) restaurant. The woman working that day was so sweet. The interior was clean and the menu had a good selection and reasonable prices. They accept card over the $10 minimum (otherwise there's a small fee) which is great. I got the chicken fried rice which was such a good comfort food.", "author": "Kelly T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Everything cooked to perfection and it was right there waiting for me on time! \n\nI had lemon chicken (yes!!), steamed brown rice (lovely!) and egg rolls (ka-pow!!). All three were so good! This place is definitely going to be revisited and maybe I'll even eat it with a fork this time for faster shoveling purposes.", "author": "Rick T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "First time coming to this restaurant and it was so good!! The service was amazing and the restaurant is very small with hardly any people when we came in. The service was fast and the place is very clean. If I could give this place more stars I would. I am very very impressed from the food to the service. \n\nWe ordered sizzling rice soup, vegetable chowmein and veggie egg rolls. We fell in love with the sizzling rice soup. The large bowl is perfect for two people. \n\nWe love the soups so much that we ordered a second round.", "author": "Aimee H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Fresh and fast. Delivered in less time than estimated. The order was correct and fresh. Delicious food was still piping hot, veggies were crisp, and noodles were perfect.", "author": "Michael M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "Revised down to a 1 star. Recent got FOOD POISONING from this place.", "author": "C J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "Me and my two co-workers came in on a Friday night for a quick dinner. I ordered the sweet and sour pork, Kung pow chicken, and green beans. The service was very good. The waitress made sure we had everything we needed and made the dinner enjoyable.", "author": "Andy H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-21", "description": "All the food we ordered was quite boring. Could use a little spice! The people were really nice, though.", "author": "Sharanya N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "My favorite Chinese take out/delivery in the Richmond. Also like going here for sit down.  The staff is nice and the food is good. Everything I've tried has been good flavor and cooked well.", "author": "Kaitlin S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "We ordered take out and it was a huge mistake. We ordered two Diet Cokes. We got two regular Cokes. We asked for two sets of utensils. We got ONE spoon. We ordered Hot and Sour and Wonton Soups. We got soups so bland that we had to add a ton of salt. We ordered Mongolian Beef. We got Mongolian Onion. Seriously, \"Where's the Beef?\" We ordered Kung Pao Chicken. We got Kung Pao so bland that you'd think it was for people in an assisted living facility. Lastly, it took over an hour and 20 minutes to get our order. You can do a lot better than delivery from Tenglong.", "author": "Robert U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-07", "description": "They do have Vegan options and the spring rolls were pretty good. However, the meatless chicken wasn't good at all. Also, if you do not like a dish, the manager will not exchange it for you.", "author": "Rita G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "Best Chinese food ever!!!! Went 3 days in a row. Can't wait to go again I'm obsessed!!", "author": "Karla J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "I though this restaurant was good, but I couldn't even try the food because they took over an hour to let us know that the food wasn't ready. We ended leaving the restaurant because the food never was ready. Very concern about the costumer service! Instead of apologize, the employee yelled us and charged asking for the payment of the tea and appetizer. I had a little kid waiting for the food, she was very hungry and we asked them politely to hurry for the food. They weren't concern for us and another consumers. Not even offer appetizer for the kid to eat while the food was ready. They were more worried about the deliver. THE WORST RESTAURANT!!!!! Don't go!!!!!", "author": "Johanna A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "I have been a regular at Teng Long's and Cristina is always attentive and smiling, very nice person.\nThe food is great, the Mongolian beef is superb. As a regular customer,  I can say this place is always a good option for a good Chinese meal.\nAlways clean and tidy, well run.", "author": "Enrique A."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Great easy and convenient Chinese food. Salt and pepper fried fish and combo fried rice is the best. A little inconsistent on quality and serving size that's why not 5 stars otherwise great place for quick and good food.", "author": "Angel C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "This is our familys fave resto in Clement st. Place is really clean. Tables amd chairs are clean and new. Staff were very friendly. We always feel at homewhen were here. Whether its dine in or to go, we love this place.  And of course the food. My kids really love their Fried rice. My son loves pork and beef fried rice and my daughter loves the shrimp fried rice. It was never salty. No MSG. Good food. Nice place. Nice staff. Will keep coming back. And we will recommnend this place to our friends. Tenglong we love it!!!!", "author": "Donna S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-27", "description": "Tenglong is good. It's not the most authentic Chinese food you'll ever find in the area, but their chow mein isn't greasy, and their kung pao is great on weeknights or weekends! Solid go to neighborhood spot for takeout!", "author": "Brianna S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-26", "description": "With so many great Asian restaurants on Clement Street surely this one is just as good as all the other ones right? WRONG! \n\nAs someone who lives just a stone's throw away from this establishment, I have to say that I was excited when I first moved to the neighborhood. They even deliver, perfect for those rainy Sundays when I don't want to leave the house. Too bad the food is subpar. I am by no means a Chinese food snob, but when they forget the soy sauce on my fried rice I do take issue. In general, my other dishes were good, service is ok, my girlfriend's food was good, but any self-respecting Chinese place should be able to make fried rice, instead I received white rice with veggies ... and when I called to complain, they refused to refund me.\n\nWith so many other spectacular Asian restaurants on Clement Street save yourself the time and energy and go somewhere else.", "author": "Brett L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-21", "description": "Wow - purely dog shit. This food sucks dick and smells bad. I only am writing this because I'm about to throw up and I hate this place so much. Fuck this shitty Chinese food.", "author": "Ryan C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "The wings are awesome and I love how they always are fast and easy to order from over the phone !!!!", "author": "Azikiwee A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "I can confirm that the dry fried chicken wings are just as good (if not better) than San Tung, but without the long wait time.   My new place to get chicken wings in San Francisco.\n\nAlso very good was the Dry cooked Spicy Chicken!  But the star is the chicken wings.  Best in SF!", "author": "Super T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-19", "description": "Awesome wings. Got the Salt and Pepper and Dry Fried Chicken wings and they were both awesome. Will definitely order those again.", "author": "Joel D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "I work near by and I love the lunch specials.  Some of my favorites are basil eggplant with chicken, salt and pepper fish filet, and the mushu pork dishes!  If you get the lunch special, it always comes with soup too.\n\nThe food is on point and never tastes too greasy. Just greasy enough for it to taste good. They always have brown rice, if you feel like eating a little healthier that day!  Can't go wrong with any of the dishes here. Good quality Chinese food.", "author": "Cindy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "Godzilla vs King Kong.\nGiants vs Dodgers.\nTenglong vs San Tung.\nWho has the best wings?\nI think we have a rivalry here.\nAfter reading Cherylynn N.'s (http://www.yelp.com/user_details?userid=eKUGKQRE-Ywi5dY55_zChg) and a few other reviews, I was less than enthusiastic about dining here.  During the course of a random conversation, the wings debate prompted me to Yelp search for this Richmond District spot.  Curiosity motivated us to meet here for a weeknight dinner which became two a few weeks later.  Here's what we ordered:\n\n1) Dry fried chicken wings (2 orders) (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=TbX0QsmvKaBFm66cG-8uTg) - piping hot, the skin was still crispy with a more sweet than spicy honey based sauce.\n\n2) Green onion pancake - not bad but nothing memorable.\n\n3) Mu Shu pork - nontraditional version that was heavy on cabbage.\n\n4) Green beans and fried tofu - again, different twist but this worked well.\n\n5) Dan Dan noodles - more westernized style with conservative spiciness, yet we killed this bowl.\n\n6) Mapo tofu (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=5IEshbX0F7j6WPtw_YhvhA) - can be done vegetarian style, we opted for the pork version.  Great gravy for your rice.\n\n7) Eggplant with basil (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=K-6-tkkM6lnve5xgTC23Lw) - cooked to a perfect temperature, not overly mushy.\n\n8) Ja Jiang mein (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=AuET4E4JzlTRPdomf1JUTw) - using thicker noodles, this bowl was hearty with a good mix of ground pork and zucchini in a mild sauce.\n\n9) Hot braised flounder filet (http://www.yelp.com/user_local_photos?userid=saJuyv784apZzH--psHZ3Q&select=PRnaYXurqdgHd28QinqXrA) - interesting presentation for filet.  Tasty sauce with a nice outer crunch.\n\nOn both visits, we were fortune in finding street parking within a half block around 6 pm.  There were only two or three other in-dining customers but they were doing a brisk amount of takeout and deliveries.  The hostess/waitress was attentive to our needs (filling water glasses, clearing empty plates) and friendly in recommending menu choices.  \nOh, by the way, who wins the chicken wings battle?  My personal alltime favorite was Yunan about six blocks up between 9th and 10th Ave. for those familiar with the Richmond District.\nHere, flavoring edge goes to San Tung, texture and temperature (hot) goes to Tenglong.  The scale tipper may be the long wait at the other establishment.  Food rates 3.5 plus 0.5 star for relaxed atmosphere and service; no signing in on the chalkboard here.", "author": "Mike C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-28", "description": "The roommate was craving black bean sauce noodles and I wanted chicken wings. We decided to try Tenglong. Ordered delivery through Eat24.\n\nDecember 2013\n*Noodles with black bean sauce ($8.95) http://www.yelp.com/biz_photos/tenglong-chinese-restaurant-san-francisco#8y8WXRv-UbkWQFqRMyxZiw\n*Dry sauteed string beans ($8.50) http://www.yelp.com/biz_photos/tenglong-chinese-restaurant-san-francisco#zLwp7oZ2DBAU_-MnVqt2YA\n*Original dry fried chicken wings ($9.50) http://www.yelp.com/biz_photos/tenglong-chinese-restaurant-san-francisco#7yTpK6tfj5Z0JkXh1ZPnYA\n\nThe black bean sauce noodles weren't very saucy. The roommate likes the thick black sauce. It's more brown and runny here. The wings were good for delivery. Crunchy, sweet and garlicky. I also liked the green beans. They still retained a nice crunch.\n\nGood option for delivery when I'm craving wings and green beans. But skip the black bean sauce noodles. They just don't have that saucy comfort.", "author": "Elena N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "This place is great. they have tasty food that is fresh and quick to pick up. A standard for us and kids.", "author": "Ron H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "3.5 STARS\n\nSome people dream of winning the lottery. Some dream of falling in love. While others err... just have wet dreams.\n\nMe? \n\nI dream of chicken wings (Yes, I love me some good wings!) and it reminded me that I never wrote a review for Tenglong. Open for nearly a year, Tenglong took over the Minh's Garden Vietnamese Restaurant. The menu looked more Americanized (Mongolian, Mu Shu, Kung Pao type items) with a handful of vegetarian options. No foblicious items like offal but they've received some hype over the dry fried chicken wings which many have compared to San Tung's. The prices are $1-2 higher than your typical Chinese restaurant but they do NOT use MSG which is a huge plus. They also service brown rice. \n\nThese days, I only go to Asian restaurants that don't use MSG and I find that most places are still able to create flavorful dishes with the use of herbs and spices. Unfortunately, this wasn't the case at Tenglong as I found the menu items we sampled to be pretty bland. \n\nWe started with the Sizzling Rice Soup ($6.50): http://bit.ly/1azLfWG which tasted like water. The veggies were nicely crisp as was the sizzling rice though. \n\nThe Basil Spicy Eggplant w/ Pork - $8.95 came next: http://bit.ly/1eEajQO. It fared better in the flavor department with chunks of perfectly cooked eggplant and pork bits.  It was more mild in heat than \"spicy\" but nothing that a little chili sauce couldn't solve. \n\nMy friends who went to Tenglong before were keen on their Dry Fried Chicken Wings ($9.50): http://bit.ly/1bPl00W so we just had to get an order of these. While many have made the comparison to San Tung's infamous wings, I didn't see the comparison. Perhaps we got a bad batch but the chicken was overcooked, dry, and didn't have an encapsulated crunchy exterior (soggy). Flavor wise, the sauce lacked a garlicky, gingery sweet heat and I didn't get that finger licking stickiness as I usually get with these type of wings. Crazy Pepper in Outer Mission does a much better rendition IMO and they also don't use MSG either: http://www.yelp.com/biz/crazy-pepper-san-francisco/ \n\nWhat Tenglong excels in is their customer service. The staff is incredibly friendly and all smiles here. A rarity. Food service was a bit slow for Chinese restaurant standards (15-20 mins wait for our dishes) but the owner apologized because they were busy with to-go orders. \n\nIt's also very clean at Tenglong which is another rarity in Chinese restaurant (*ahem Dim Sum King*). Parking is horrendous so Tenglong isn't quite a destination spot but a good choice if you live in the neighborhood and have MSG aversions. \n\nUmm, that is all. Excuse me, while I dream that I'm in bed right now waking up to Friday.", "author": "Cherylynn N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-26", "description": "Pretty solid Chinese spot. Nothing too special about it. Felt bad because we were the only ones in the restaurant on a Friday night but oh wells.\n\nChicken wings were my favorite, and it looks like Yelp agrees with me. They were pretty big and fat and they could have been my whole meal just on it's own. Flavor was all there too. Kinda sticky to eat, but taste it what matters most.\n\nOtherwise, it really is just a typical Chinese place and it's a dime a dozen on the street it's on. Solid spot for a quick meal, but nothing to write home about.", "author": "Sean H."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-24", "description": "Was looking for Chinese food in the Inner Richmond which is looking for hay in a haystack.  Found a parking space (score!) and wandered over to one of my favorite Chinese restaurants.  Unfortunately, it was closed.  So onto Yelp, what's close by because I'm too lazy to move my car.  Tenglong popped up so wandered over.\n\nThe menu had most of the staples of a Chinese (Cantonese) restaurant and had orders to bring chow mein home.  Not many people at 6pm on a Weds night, so plenty of tables, but I was ordering to go.  1 order of chicken chow mein and 1 order of beef chow fun to go.\n\nWorkers were nice, pleasant change from the bruskness of most Chinese places.  Food came in about 5 mins really quick in 2 boxes.\n\nThe food was pretty tasty, plenty of meat in both dishes.  So, what's not to like?  The prices are a little higher than local competition and the portions a little skimpy.  We finished both dishes completely.  Usually there's leftovers.\n\nFor my $, will probably go elsewhere in the haystack..", "author": "Steve G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "Our waitress smiled at us more than once.  It's a small thing perhaps, but yelpers often refer to \"typical Chinese service\" for places and it seems to involve no smiling, let alone a genuine welcoming vibe.  Here, the service is atypical, meaning very good.    \n\nEgg rolls (vegetarian) were very perfect. Freshly fried and served steaming and hot.  \n\nMongolian Beef was super.  Lots of brown onions, several green onions, and some perfectly cooked non-fatty beef again, served piping hot.\n\nEggplant with Basil, a vegetarian dish which is usually my favorite was less successful.  It was wickedly hot (temperature wise), but the taste seemed to largely consist of eggplant and the garlic and basil were unidentifiable.  This dish wasn't bad; it just needed something more going on.  Perhaps try it with the addition of protein (an existing menu offering).  \n\nIn addition to the smiles, one way I know that the service was great was the temperature of the food.  This was the hottest fresh-out-of-the-pan restaurant food I've ever had.  No waiting around under heat lamps here.  \n\nNow that I've read other reviews, I see that a don't miss item here is the chicken wings.  I can't vouch for those but it appears many others can.   \n \nTenglong is clean and simple and there's no wait.  There's a million places to choose from in this block and surrounding blocks.  Most people are crowded around waiting at Burma Superstar, B Star, or Q.  Be the crowd smarty: head directly to Tenglong and let your evening begin.", "author": "Tracey A."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-23", "description": "I guess if you haven't had much experience with dry fried chicken wings then you might think Tenglong's was good/great... but unfortunately we're in SF and here everyone tries to improve or at least copy the best. And if you ask anyone off the street who's dry fried chicken wings are the \"best\" or \"best known\" you'd get the same answer indefinitely: San Tung. \n\nOn a casual Friday night, wife and I went on an eating spree. We hit six spots and ordered two items from each. Tenglong was our 3rd stop. We ordered the chicken wings and green onion pancake. \n\nTenglong's chicken wings fell short in a couple ways: (1) too much white pepper and (2) the sauce was too watery, doesn't caramelize to give it that sticky candy crunch. The pancake was ok but what wasn't ok was the sauce it came with. It tasted (for a lack of a better word) \"chemical-ly\". Almost as if it was cleaning solution. I've never gone anywhere that served \"sauce\" with green onion pancake and it really shouldn't need any... if you want, add a dash of soy sauce but even then it's too much. But please don't add soy sauce for the sake of bad habit!!! Yes I'm pointing at most of you inexperienced \"white\" folks!", "author": "Stephen Y."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "It has been a while since I ate at this restaurant with a date.  I don't even remember my date's name.  It must be not that important. (hahaha).   A week ago, I happened to be in the area and decided to have some lunch at my favorite restaurant.  I had my favorite green bean veggie with toufo and soup.  The food is very good here. Service is excellent.  I just don't understand why they are not busy while all other restaurants are super busy with people willing to wait in line.  Honestly, I don't know the people works at the restaurant except to eat here.  So my review has nothing to do with them.  I just want to let everyone know that their food is good and you should give them a try.  I always like to support small business and hard-working people.  Highly recommend this place.", "author": "Butterfly S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-19", "description": "On a weekday in the late afternoon, I placed an order for pick-up to try their original dry fried chicken wings as well as their dan dan noodles. I was told that the food would be ready 20 minutes after calling. 20 minutes passed and upon walking into the restaurant, we were greeted by a nice lady. There were no customers dining and only one other person had a pick-up order but we had to wait an extra five minutes for our food. I'm not sure what the delay was but the sauce for the dan dan noodle was the last thing we waited for. The sauce was packed separately from the noodles so we tossed them together when we got home. Definitely a smart idea to prevent mushy noodles.  \n\nThe wings were meaty and flavorful but I felt that the sauce could have been a bit denser to really coat the wings. For wings like these, I like my sauce with the viscosity of molasses. The dan dan noodles were thick and the sauce was very flavorful but I was a bit disappointed in the few pieces of shrimps in the sauce. Both dishes definitely carried some heat because I felt like my mouth was tingling with spice while eating both items. If I was in the area, I wouldn't mind returning to have a sit down meal.", "author": "Maya S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-28", "description": "This is one of my favorite places to come for dinner or lunch. It always seems to be so busy when I'm coming here. I remember coming here when it first opened and now it's transformed. Although the space is pretty small but you know great things come in small packages.\n\nI used to always get their eggplant and pork/chicken, but I wanted to change things up and I got the wonton soup, dry fried diced chicken and Mongolian beef with brown rice. Christina (the owner's wife) is extremely friendly and helpful. The price for everything is quite reasonable and affordable. Food and tables is clean and well kept. Some people might say that they're \"slow\", just remember amazing food takes time and love to make. The delivery was never a problem for me it usually comes to my house pretty fast.\n\nI really enjoy how they have brown rice as an option; a lot of Chinese restaurants don't have it. My husband and I really enjoyed the diced chicken, super crunchy. Perfect for watching Netflix and munching on them like popcorn! Wontons tasted like the ones my grandpa used to make when I was young. The Mongolian beef was juicy and tender and smelled beautifully.", "author": "Kathy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "MSG free Chinese food with brown rice option on Clement that accepts credit cards?\n\nYES!\n\nAhhhh what a rare gem Tenglong is. I'm a huge fan of their dry fried chicken wings. A few Yelpers have compared them to San Tung's wings. Dare I say it? I actually like Tenglong's better. No MSG so I'm not crazy thirsty afterwards with a pounding headache, that's the key factor for me. The wings are crispy, just the right amount of sauce, and not too sweet, not too spicy from white pepper. \n\nThe lady who runs the front of the house is very sweet. She even changed out the plate for our chicken bones.", "author": "Susy C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "Not happy with the service. Food was cold when served. Server did not follow instructions given to her and quantity of food is small compared to other Chinese restaurants.", "author": "Anare K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "The delivery is pretty fast! When I get the food it was still hot even I can see the steam from the boxes. I ordered the dry cook spicy chicken and dry sauteed string bean. They were all delicious. I will recommend this restaurant.", "author": "Annie Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "this review is mostly for the chicken wings, which are sooo delicious. fresh and crispy!", "author": "Vanessa S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-12", "description": "My boyfriend and I were walking around this area, and we wanted to try something new. To be safe, we looked on Yelp to see their rating, and a lot of yelpers gave this place a 4 star rating, so I guess it must be good.  \n\nWe came here around 12:20pm, and the place was empty. We sat down and we both got their lunch specials. I got the beef onion rice plate and my boyfriend got the fried chicken rice plate, both were $9 each. The place is pretty nice, looks renovated compared to the other asian places we've been to in this area.\n\nOur food took forever to get to our table, I think it was about 20 minutes or more because I remember looking at my phone the entire time. When our food arrived, our food was nicely plated. But looks may be deceiving, when I took a bite of the beef it was super salty drenched with soy sauce. It did not taste like traditional Chinese food, more Americanized. I thought the rice would be better, but nope it was worst. The rice was so dry that I almost choked on it. I may be exaggerating but it was really dry. How can you mess up on rice?? I had to drink a lot of water to get the food down my throat. Compared to my boyfriend's plate, it was pretty much the same. Even though I was super hungry, I was not able to finish my plate. The food just didn't taste good.\n\nOverall, I would not come back to this place to eat since there are better things to try in this area. I'll rather spend my money that serves traditional food.", "author": "Noel K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "This's my first time to write a review.  I give them five stars because they are so nice and the environment is very comfortable. I went there with my friends.\nWe ordered chicken wings, Mongolian beef, ma po tofu, sweet&sour pork and string bean with tofu. It tasted delicious. Also I ordered one more chicken wings for go because I loved chicken wings sososososososo much. And one of my friends told me, she will come next time with her family because her family love Chinese food. And she said the environment and food are much better than other restaurants she had been to.  I think they deserve five stars.", "author": "Kenzi L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Tenglong is my go to place for delicious Chinese food in San Francisco - nice variety of sauces  with the different dishes. I especially like the cashew chicken, broccoli beef, and their prawns are always cooked perfectly!", "author": "J R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "There are a lot of Asian food places in inner Richmond, but teng long's food is truly something. It has became a default among our roommates - especially the DRY COOKED SPICY CHICKEN, so good that I refrain from having it everyday so it's  novelty still stays.", "author": "Rafsun F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-10", "description": "I'm glad I listened to everybody's recommendation! This place is simply amazing. From the food, to the decor, to the wait staff, everything created for the perfect ambiance. Would I come back to this place again? I definitely would. \n\nMy number one recommendation would be the chicken wings. Sweet, spicy, delicious, are the best words to describe them. Every bite is covered in sauce. \n\nIf you go to TL you won't regret it.", "author": "Trevor C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-27", "description": "I don't like to start reviews this way. But this was the worst Chinese food I have ever had. It felt like Chinese food that had been made with no understanding of what Chinese food is. \n\nIt was pretty nasty, I tossed my sesame chicken out because there was absolutely no flavor. It was just fried matter. No sides to improve this dish. The fried rice was not fried at all which meant that it was just white rice, egg, and a little meat. This made for the worst fried rice ever. \n\nThey were also slow which is really impressive considering how little work this must have taken. \n\nIn a city where you can get so much good Chinese food, find somewhere else.", "author": "John M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-21", "description": "The boyfriend & I ordered cashew chicken & green beans to-go. We only live a few blocks away & ate it almost immediately at home. Overall, I would say not bad. The flavors are there but seriously, TOO oily. I know it's typical of Chinese food but still, my stomach started hurting a little afterwards. \n\nPrices are just average. \nProbably would go get my Chinese fix elsewhere... \nBut I'd likely be back to try their wings.", "author": "Sylvia N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "When my laziness gets the best of me and I can't bear the thought of cooking, I like to order in some food from Tenglong.\nThey are FAST when it comes to delivery and the food is good. I've gotten lemon chicken, veggie egg rolls and a couple of noodle dishes. Good, solid American Chinese food.\nThey once called me back to confirm part of the order and make sure I was okay with the delivery time, and I really appreciated that.", "author": "Rachel M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-27", "description": "Very good chicken, large portions that are worth the price. Decent chow mein. The fried rice is not that great, so don't try it. Everything else is delicious. Not only that, but they deliver quickly, in less than an hour. I've eaten at the restaurant many times, and now order food via Yelp.\n\nIt is delicious, and my favorite restaurant in SF.", "author": "Christopher V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "This place had great food! Some people might say is pricy but so is any restaurant that offers amazing and fresh food. \n\nGreat menu and great environment. \n\nI've been to shitty Chinese restaurant and this is not one of them.", "author": "Carlos T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "Dry fried chicken wings have been compared to San Tung's.\nMy verdict: not comparable. \n\nThe sauce was quite similar, I'll give them that, but the chicken pieces were much larger, and the meat just wasn't very well marinated, resulting in a lot of bland meat in the center. I had to re-dip the wings in the sauce, which I never had to do at San Tung. \n\nHowever, if you're not a big fan waiting an hour at San Tung, then Tenglong does the job. We were the only table there at 6pm on a Saturday!\n\nBonus: They deliver within a two mile radius in case you're feeling lazy but craving some dry fried chicken wings. They also cook big batches for the next potluck you need to bring a dish for.\n\nThe dan dan mian is quite different here as it's a red-colored peanut sauce with peas and shrimp mixed in. Quite good, although a bit dry at the end.\n\nAnother good dish was the dry fried string beans with fried tofu! The tofu was salt & peppered and very crispy on the outside -- mmm, fried deliciousness.", "author": "Audrey L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "I'm usually not a big fan of Chinese delivery. I find it too greasy and not flavorful enough. But Tenglong ABSOLUTELY the exception. Ever since my friends and I started ordering from Tenglong, we haven't even considered other Chinese restaurants. \n\nMy favorite dish is their green beans with tofu. I'm usually not a big fan of tofu, but Tenglong cooks theirs to perfection. It's crispy and flavorful. I can't get enough. The green beans are great too. \n\nWe also enjoy the dry fried chicken. The pieces are small, but the serving size is huge and the sauce is to die for. \n\nI can't speak for their restaurant service, but they are super speedy with all delivery orders. They're somehow even faster than the restaurant that's less than two blocks from me.", "author": "Jackie S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-17", "description": "Come here on a Sunday night and the place was quite empty. We got seated quickly and ordered our food right away which were the dry fried dice chicken and tomato beef stir fried noodle.\n\nAfter 30 min, there was no trace of our food. The sever explained that they got too many take out orders so the kitchen was overwhelmed. After another 10 min, both our dishes came out.\n\nFor the fried dice chicken, literally 10% was chicken. The rest was just fried batter. They also fried the batter so big so that you would think that's chicken but it was not. Eating this dish was like going for a chicken hunt in the woods of batter. \n\nThe tomato beef noodle was also just average. I will never come back, not even for take out cuz apparently that has priority over sit down.", "author": "Ruxin H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-20", "description": "Run if the mill Chinese delivery. My chicken lo mein had only a couple of pieces of actual chicken.", "author": "Natascha G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-03", "description": "I live very close to Tenglong and get take-out food there pretty regularly. The lady that works the front desk is very sweet and always smiling. I'm a vegetarian so it is very convenient and they have a lot of options for me, the walnut broccoli tofu and spicy eggplant with tofu are some of my favorites. The food is always very satisfying and I've never had a bad experience.", "author": "Matthew C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "My husband and I have only been here once and we only had the wings (as so many people were comparing them to San Tungs.) I must admit, the wings were absolutely delicious and although, not quite the same exact flavor of San Tungs they were just as good in my opion and had an extra mildly spicy kick to them. \n\nBest part of all? NO long waits! But seriously...hoping it STAYS this way so please don't try to come here..unless of course you can keep a secret!!", "author": "Petra S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-13", "description": "Not good. Just okay. \n\nWe ordered delivery online, which is nice for the introverted, but it took 55 minutes to arrive. The three-item meal came with two fortune cookies and two packets of soy sauce. No napkins, no utensils.\n\nOriginal Dry Fried Chicken Wings ($10): Good sauce and crispiness, but once you get past that, the chicken was a bit overcooked, unmarinated, and did not taste fresh. Overpriced in terms of Chinese takeout.\n\nCombination Fried Rice ($9): Now, I typically don't order fried rice as I can easily make it, but I had a craving, I was lazy, and how could anyone mess up fried rice? Well... It was under seasoned and did not have a lot of meat. The shrimp was deveined and looked great, but tasted VERY dirty (read: tasted like dirt). Sriracha couldn't even scrub put the taste. I ended up just eating the rice to compliment the wings.\n\nTomato Beef Chow Mein: Bland. Bland. BLAND. Noodles were overcooked, sauce was watery, under salted, under sugared. Our quest for good tomato beef chow mein continues. \n\nOverall, we probably would not go back unless desperate. Given where is located, we'd be hard pressed to become desperate for Chinese food.", "author": "Linda H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "Probably the only other restaurant that can rival San Tung's dry fried chicken wings. I haven't been here since around the time they've opened. Hopefully the wait isn't as crazy by now.\n\nJONASAPPROVED!", "author": "Jonas T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Excellent new (I think) Chinese restaurant on Clement Street. The honey walnut prawns were great, and there were a lot of them on the plate! We also enjoyed the eggplant/tofu lunch special, which started off with a delicious bowl of hot/sour soup. Service was excellent, and our order arrived quickly. Eager to go back...", "author": "James P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-25", "description": "It has been a very long time, and never in San Francisco, since I have witnessed such an egregious failure of basic restaurant management.\n\nWhen we first arrived, there were a few people ahead of us. We advised the hostess that we had arrived, and of the size of our party, which was 2.\n\nWe then proceeded to watch tables being filled with parties matching the table size that had become available, but had ARRIVED AFTER WE DID!\n\nYes, they were actually seating their 2-top and 4-top tables in a manner which best suited the table size, NOT THE ARRIVAL TIME!\n\nEventually, we were seated, after even yet another couple, who arrived after us, was seated BEFORE US.\n\nAfter we were seated, it took almost 30-minutes before someone came to take our order.\n\nAll the while, to-go orders were steadily moving out the door. It appeared that these were being given priority over orders actually within the restaurant.\n\nIt took almost 45-minutes for our appetizer to arrive.\n\nBy this time, almost everyone who had been seated before us had ordered, been served, eaten, and had left the restaurant.\n\nTwo parties who had been seated AFTER us had ordered, been served, and were waiting for their check, when I decided to tell them to cancel our order (ONE HOUR and 15 minutes of waiting at that point! ), and that we were leaving.\n\nEven after all this, the hostess expected us to pay for the whole meal, even things which were NEVER SERVED.\n\nMy husband firmly told the hostess that we would be paying for nothing more that what was served, and what we consumed, and then we were leaving.\n\nThe hostess looked astonished. My husband is immensely persuasive.\n\nShe attempted to apologize, and told him \"don't worry about it\".\n\nWe left, hungry and angry, after paying for just the appetizer.\n\nWe will never return to this place.", "author": "Anat K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "Tenglong is standard mandarin/szechwan fare. a casual perusal shows entrees to be in the 9's. fresh beige decor with chandeliers and small art pics on walls.\n\neats: curry chicken, lunch special (6.95) 4 stars for lunch value only. roundup from 3.5 stars.\n-semimushy rice, not firm\n-hot & sour soup more sour than hot, not balanced.\n-curry taste muddles, not distinct,\n-veggies of onions, bell peppers, carrots ok.\n\nleftovers:\n-waitress/owner recommended dry fried wings. passed. concerned about fat content\n-food slightly better than average, not outstanding 3.5 stars.\n-lunch specials (6.95+) good value, 4 stars., quality 3ish  stars.\n-waitress cheerful, helpful food suggestions.", "author": "Victor G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "ENVIROMENT = B\nSERVICE = A\nFOOD = B+\n$ WORTH = B+\n\nMy friends and I stumbled on this tiny quaint little Chinese restaurant.  Atmosphere wise, the place feels very comfortable but needs a bit more color. It's very clean, just a little plain.  High ceilings, light wooden floors and white painted walls is the overall feel.  The square tables and the wooden chairs are solid and comfy. Nothing really fancy about the ambiance, nothing screaming for my attention.  However, there are a few unique artworks that were hung up. One piece of art that I found intriguing was a set of mahjong tiles lined up and framed like a picture.  Kinda of cool.  \n\nThe service here is impeccable. 3 different servers came by frequently to refill our water, added more warm rice in our container bowl once it started getting low (without us asking) and they checked on our table occasionally to see if we needed anything else. \n\nBeing the only vegetarian of my group, I was relieved they had several options for me to choose from. I selected the vegetable deluxe, which was delicious. The dish was made up of perfectly cooked zucchini, lettuce, broccoli, baby corn, bamboo shoots, carrots, onions, and green bell peppers sautéed in a savory sauce with spot on consistency. The sauce was extremely flavorful, which brought out the life of every vegetable. Another dish I had was the spicy string beans with tofu. A little on the dry side, but the dish still satisfied the taste buds and brought on some welcome heat. The portions were above average and reasonably well priced.\n\nAfter the meal, the servers brought out some smooth vanilla ice-cream in a frosted glass. If that was not enough, they also handed a small mountain of fortune cookies for our table. What a fantastic ending to the dinner. Boy, I'm stuffed now, but really happy. I'll be back!", "author": "Eric M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-02", "description": "Man all the high reviews had me real excited.   I loved the Vietnamese place that was there before and was hoping Tenglong could fill its shoes.   \nOrdered take out\n\nDry wings-barley any meat, and way too oily, the next day and still having gross burps\nSesame chicken- soggy and bland, we just threw it away\nVeggie Fried rice- bland and only had a few tiny pieces of cut broccoli stalks and tiny carrots\nShrimp Mu Shu- this was the only saving grace, pretty good Mu Shu\n\nI feel bad writing this review because the woman who worked there was VERY nice. \n\nBut I would not return.", "author": "Chelsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "This totally hits the spot for a vegetarian/vegan person craving Chinese food! Their whole meatless menu is great, tastes just like regular meat stuff. They also have meat options so it's great for groups that have mixed dietary needs. Food is not too greasy or oily. Veggies are fresh and hearty never soggy... The staff is really nice. Service is fast. I can't say enough good things.", "author": "AA B."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-20", "description": "First time to here, it is excellent, I love the food ,and the waitress is so nice, definitely 5star,", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "We never ventured that far down Clement so we didn't know this place existed until we did a search on Yelp. Restaurant is super clean - for a Chinese place. Even the bathroom was immaculate. \n\nWe ordered tofu and string bean rice plate, seafood chow mein and tomato beef rice.  Meal came with hot and sour soup. It's not my thing but it was done right according to my companions. \n\nFood was good. You can actually taste the sweetness in the shrimp. Portions were on the small side considering everything was about $7+.  It was enough for lunch but don't expect a doggy bag. \n\nService was friendly and excellent. The owner was super nice.", "author": "Wendy H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "I have been a fan for a long time of this mom and pop restaurant, as it is the best Chinese food in the Inner Richmond (my neck of the woods). I will start with a review of my favorites, that are always the basics, come on? how can you mess the basics up? The Wonton soup with housemade wontons is a must have. The best dry chicken wings I had in the neighborhood, and believe me, I have tried them all around. Very friendly staff, always nice and accommodating. I will always keep coming.", "author": "Paul S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Decent dry fried chicken wings (flavor is most excellent, the wings are large, but the texture of the meat isn't as juicy as another place's similar dry fried wings... wink wink). No other complaints really. The dry fried string beans and the eggplant w/ pork were perfection. The portions are good, the people are nice. It's never super crowded. Sometimes I just want chinese restaurant chinese food immediately.. Tenglong's is a great option, and super close to the lj's house so that we can walk over to pick it up. Win win.", "author": "Donna H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "I'm from the UK which is home to substandard Chinese food but I have to say that Tenglong was the best Chinese food that I have ever eaten. \n\nI came here for a \"Jewish\" Christmas meal on Christmas Eve and between us we ordered a good cross section of the menu. I whole heartily recommend the crispy wings which the waitress told us was the specialty. The other food we had included chicken curry, chow mein, fried rice and noodles which was also good. I really want to come back on my next trip to SF.", "author": "Matt B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-19", "description": "It was an okay place after trying there food delivery system. BUT  I DO NOT RECOMMEND ORDERING HERE AT ALL. \n\nI ordered the pork friend rice and the honey walnut shrimp. Both were cold when I got them AND it took over an hour to receive my items, when i live less then 15 minutes away!\n\nThe rice was OKAY, there are definitely better places then this place. And the honey walnut shrimp had TOO much mayonnaise on it. Hardly could even taste the shrimp cause of the cold dripping mayo. EW!\n\nI spent over 24 bucks for this and was throughly disappointed. PLUS after waiting over an hour, when i was promised 45 minutes, the driver dared to stop me for a bigger tip! It was ridiculous! I felt insulted.\n\nDefinitely telling others not to make the same mistake I did ordering here. Especially anyone from the university. \n\nSave your money for better places to eat! thats my recommendation!", "author": "Jennifer M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-15", "description": "I was hungering for some Singapore noodles and found this place on Yelp.  Two stars was the conveinence of ordering online, but the low stars was for the actual food.  \n\nThe noodles came in a very tiny, flat, wax coated paper box.  I was extremely suprised at how small the box was.  When I looked inside, there was hardly anything there!  There was probably enough noodles to fit onto the palm of ONE hand!  No bell peppers. No green or white onins that I could find.  Bland, bland, bland, bland, BLAND!  The shrimp was nice, but not for the $9 I paid. \n\nShould have been worried when the place was totally empty at 6:00 PM when I walked in to pick up my order.  Since I had paid online already, I couldn't back out\n\nCome on YELPERS!  I was trusting you here, but NOT this time.", "author": "Lynne L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "I'll start by saying the food is pretty good. I enjoyed it and I'd go back.\n\nThe rating is because of two things:\n1) I ordered pickup through Yelp and ordered their Original Dry Fried Diced Chicken. Instead, I received their Dry Fried Chicken Wings - I didn't realize till I got home, unfortunately. I mean, the wings were great - very crisp, good flavor, but NOT what I ordered.\n\n2) I also ordered their Dan Dan Noodles, which was interesting. It's not what you typically see in Dan Dan noodles - very peanuty, which to be fair, they list in the description. The sauce was tasty and the noodles were plentiful and had good texture. However, there was very little meat to be found.", "author": "Eric H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-12", "description": "I've ordered twice from here and will be ordering more and more. Free delivery at 20 bucks minimum price before tax. You can order online, so you don't have to call. Even better!\n\nAnyways, the food!\nSo far, I've had their Sweet and Sour Pork, Sweet and Sour Chicken, Sesame Chicken, and steamed rice, all which were great. Their beef/pork chowmein (don't remember which) was alright. Get it if you want chowmein but it didn't really have a lot of meat along with it. It was still pretty good regardless though. \n\nAs for delivery, they are timely - hell, even early, and the food is still more than warm when it arrives. Portions are good as well. Getting two separate items, plus steamed rice is enough for 2 meals and slightly over 20 bucks. Oh, and did I mention free delivery?\n\nThis place is definitely worth it.", "author": "Cristian R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-16", "description": "I went to Tenglong Chinese for the first time a couple of weeks ago and fell in love with their hot & sour soup. I thought it was great! So I went back again 3 days later. and then again a week later. It was then that things went south very quickly.\n\nI ordered chicken fried rice. Pretty standard order. Nothing too difficult. I also ordered broccoli beef and green beans and the soup. I received all of my food but the chicken fried rice about 20 minutes later. After the food got to my table 10 minutes passed and still no rice. I called the server over and asked if it was on it's way. She brought the rice over. Verdict? It was absolutely awful. \n\nNow now, I am too a server and know what it is like to have difficult customers, so I always try my absolute best to be pleasant and easygoing. However, I had to make a comment about the rice because it was extremely bland, the chicken had the strangest texture; like a mix between tofu and string cheese, and was disgustingly greasy. \n\nThis is where things went south. The owner or asian person in charge refused to take the fried rice off my bill even though I didn't even have a serving. I had a bite to try it because I was turned off by the smell. Not only did she refuse, but was the rudest person I have ever come in contact with in a restaurant setting. She said to me, \"It is chinese food. It is a different culture.\" I explained that although I realize it is a different culture it was my 3rd time at the same restaurant and my second time having the chicken fried rice. She then had a cook try it and proceeded to tell me, \"Even though it is our fault you have to pay for the rice. What kind of restaurant would this be if we gave everyone who complained a free meal?\"\n\nTHIS IS WHERE I GOT VERY ANGRY. \n1) I was not asking for a free meal, I was more than willing to pay for food that I ate, but I didn't eat the rice and I wanted it taken off my bill. \n2) IF THAT many people are complaining about your restaurant, THEN YOU SHOULDN'T BE AN OPEN FACILITY. \n\nI explained to her that I work in a restaurant and that the customer should always be right. She very bluntly told me that I didn't know what I was talking about. I tried my very best to remain calm and rational EVEN THOUGH SHE WAS RAISING HER VOICE AT ME, and when I felt like I couldn't remain calm any longer I left cash on the counter and left. \n\n\nLONG STORY SHORT, DON'T GO HERE. I DON'T SEE THE POINT IN GIVING BUSINESS TO PEOPLE WHO DON'T CARE TO TREAT/FEED YOU RIGHT.", "author": "Liz C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-14", "description": "One of the worst places I've ever eaten in. Got the noodles with black bean sauce, noodles in spicy seafood broth, scallion pancake, and the dried fried chicken wings. \n\nNoodles - terrible. Not handmade. Stale. \n\nBlack bean sauce - bland and doesn't taste like usual noodle with black bean sauce. \n\nSpicy seafood soup - barely had any seafood. Lacked depth, one dimensional broth. \n\nPancakes - mostly flour. Little to no scallions.\n\nChicken wings - I couldn't even finish one. So sweet but tasted more like sugar rather than honey based. Also one note. Really really terrible. Really. \n\nI wouldn't recommend this place for my life. Not even to my enemies. Gives the inner Richmond a bad rep. We're better than this place. \n\nI'm rarely this upset (if you see my other reviews, they're pretty generous and positive). But this place is just this bad.", "author": "Nami S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Great healthy neighborhood Chinese place. Lots of vegetarian options, and no MSG! I highly recommend sautéed green beans with tofu, and the hot and sour soup. Green beans cooked to perfection, with delicious fried tofu and bits of jalapeño, caramelized onion, and garlic. Friendly industrious service, all for a decent price.", "author": "Molly S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "Mapo tofu was okay. I could make it better at home.\nEggplant with basil - This was tasty.  \nMongolian beef - small plate. \nHoney Walnut Shrimp - small plate.\n\nI'm Chinese. I think this restaurant, although, clean and modern in the interior, caters to Caucasian eaters.\n\nWe were walking along the Clement street stripe and couldn't really spot a decent authentic Chinese restaurant so we stumbled upon here.\n\nService is friendly but for the price of the food you pay, expect small portions.", "author": "Jboogie L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-05", "description": "Terrible delivery service all of a sudden!  We've ordered from Tenglong before and had timely service with food that was still hot.  However, yesterday our order arrived more than 30 minutes later than promised and the cost jumped over $10 when the delivery guy asked for payment.  The restaurant person claimed the $10 was needed to cover the sales tax - WRONG - the total cost of the meal was a bit over $50 so there is no way the tax could be $10 (nearly 20% of the bill).  In addition, the food was cool, not warm and not hot, so the delivery was obviously delayed (we live only about 6 blocks from the restaurant).  The restaurant did not apologize for the delay, claimed there was a lot of traffic (I could have walked there and back in less than 30 minutes), tried to justify the increased bill and the food was just not good enough.  So, we will no longer order from this restaurant.", "author": "Bonnie L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-05", "description": "We were doing some shopping in the area and I had a craving for some Chinese. With the help of Yelp, we ended up here. It's a little shop on the north side of Clement between 3rd and 4th. Not much to look at, but not in disrepair either. The menu, however, looks great. Every item looks delicious (it features pictures) and it does wonders for making you hungry. I went for the 72. Singapore Style Noodles which I had been craving for a while, and my wife went for the 69. Combination Seafood Spicy Soup Noodles. \n\nMine was quite good, and what I would expect Singapore noodles to be: tasty, a little bit of a dryness to them, and packing a strong curry flavor. The shrimp and smoked pork were good. The spicy seafood noodles were less so. There was only a spattering of seafood on top, which was mostly squid, and some cabbage. That was ok, but the rest was some relatively thick noodles which were somewhat bland. Overall ok, but not great.\n\nOverall, this place was pretty good but not great. This may be somewhat due to our choice of items, so I would give it another shot. Maybe try the wings or more traditional items.", "author": "Brent W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "I love the chicken wings from them, best of the best. Also, they deliver orders faster than most of the delivery out there. I'm so confuse why they don't have a lot of customers eat there though. The place is clean and tidy. Very confusing. Hope they have better business in the future.", "author": "Danny C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "I ordered 4 dishes for delivery at 5:40 PM on a Sunday. The food arrived at 6:05 PM. Speedy fast! \n\nThe food was tasty, flavorful, and hit the spot. I liked that they didn't over-douse everything in sauce & soy sauce. They had an extensive menu with lots of vegetarian options to choose from. Looks like I found my new go-to Chinese restaurant!", "author": "K K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "This place was amazing! \n\nGreat food, service and very clean and pretty bathroom! I felt very comfortable and relax to eat here!\n\nMe and my partner got the sweet and sour chicken and diced fried chicken which had so much flavors in them!\n\nYou do get a lot of portion so make sure you don't order too much unless you want to take some left overs :)\n\nDefinitely coming back here again!", "author": "Hikaru I."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "Wings. Get them.\n\nOne of the friendliest restaurants I've been to on Clement. On a somewhat cold, foggy Richmond night I ordered take out and was waiting in the restaurant. I was offered some wings and tea while I was waiting. While I've only always gotten taken out, the wings are amazing here! I also like the seafood fried rice as it's not extremely greasy.", "author": "Timur A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-28", "description": "My new go-to for delivery. Nom.\n\nTL;DR - Tasty dishes, well made, quickly delivered, excellent portions.\n\nCan't get enough of\n(1) the chow mein (veggie is a nice option if you want more greens on your plate),\n(2) the dry-fried chicken wings are deeeelish and the texture is perfectly crispy-chewy on the outside (the chopped-chicken version is also good, but just a lot more of the coating on each piece), and\n(3) the dry-friend string beans are very well made.\n\nI need to try more things, but when I get a hankerin', I can't just go order the whole menu. :P\n\nPortion size is fantastic, especially for the quality of the food--delicious and generous--and if you hit the delivery minimum, you'll probably have about 2-3 meals out of it. In my case, almost 2, haha. Because snacks.\n\nMy only sadface is that I love me some hot-and-sour soup, and this place doesn't quite put enough vinegar or something, can't put my finger on it. It's not bad, but only about a 2-3 star. The consistency and ingredients are there, but there's just one detail in the flavor that's missing. That said, definitely plenty of other amazing dishes to make up for that. I'll survive.\n\nAnd, the delivery is mad quick, especially since I'm just a couple neighborhoods over (hey, I've seen places way closer be way later). Says an hour, but it's usually 30-45, and piping hot. Plus, the delivery drivers are the nicest people ever. Tip yer drivers, people!\n\n*drool* Okay, off to order from this place. For like the umpteenth time. :)", "author": "Julie E."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-26", "description": "I had the salt and pepper tofu for delivery. It was chewy, dried out, and not spicy at all like it was supposed to be. Also, I didn't get white rice with my order. I don't know if this is a Bay area thing or what, but a dish that is served with white rice in the restaurant needs to be delivered with white rice, which has not been my experience here.\n\nBlergh. My quest for halfway decent salt and pepper tofu continues.", "author": "Sarah L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Small cozy restaurant, friendly service, good for take out and delivery. Came here on a Friday night with my family and were the only ones in the restaurant. We ordered the black beans noodles, basil eggplant with pork, chicken wings, and dry fried string beans with tofu.  The black bean noodles were a little bland my mom had to add more salt and pepper to it. The eggplant was really good as well as the string beans with tofu! The string beans were truly \"dry fried\" and didn't have any sauce or gravy but was still flavorful and the fried tofu pieces in the dish were delicious.  I would compare their chicken wings to san tungs, same flavor except the sauce isn't as thick/boogery as san tung. I thought their chicken wings were a lot bigger and meatier, however the flavor was only on the crispy skin and the meat tasted kind of plain. If I were craving chicken wings I wouldn't mind coming here to avoid the crowd at san tung.  Over all all enjoyed our meal and finished everything! My only criticism is that their portions aren't that generous. Would definitely come back again.", "author": "Linz C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-29", "description": "I was driving by and saw a sign for lunches from $7.95 and up. As luck would have it there was parking right in front which is not something that happens often in San Francisco. I figured that was a good sign and that this would be the place for lunch today.\n\nThe waitress was very friendly and quickly brought me a menu and after a quick scan I decided on the dry fried diced chicken lunch special. She did make sure to warn me that the dish was sweet and spicy. While I was waiting for the main course they brought out hot and sour soup it was quite flavorful and had just the right amount of spice to it. The chicken arrived and as promised it was spicy, but definitely not overly so.\n\nAll in all a solid lunch for a good price. I'll be back.", "author": "Gerry M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-03", "description": "As my parents called it...a Chinese place for the non-Chinese. It's definitely a whole lot better than Panda Express, but it's not on par with other Chinese places on Clement. \n\nOddly enough, service was efficient with all the non-Asian American customers but not so with us. Um, okay? \n\nBut the key reason we'll never be back is because there was a hair in our soup. Ew.", "author": "Rowena L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "Definitely coming back! The service is great and welcoming. I ordered the dry fried chicken wings,wonton soup,and the chicken chow mien. \n  \nThe wings had the best flavor! The sauce was spicy and sweet. The wonton soup was homemade and really fresh. When I finished the wontons I had to take the soup with me. The chicken chow mien was just perfect. It had the right amount of chicken and wasn't  dry even thought there wasn't sauce. Which often time happens when there's no sauce.\n\nI'll come back soon.", "author": "Rachel L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "I give this place two thumbs up. I am a big fan of Chinese and like to try different restaurants around the city and this one is definitely in my Top 3. \n\nWe ordered the Sweet and Sour Pork, Broccoli with Beef, and Chicken Fried Rice. They were all seriously delicious. The Sweet and Sour Pork had a delicious crunch with an extremely tasty sauce. The breading was also light resulting in a great portion of meat. The Broccoli with Beef was also amazing, perfectly cooked and semi-healthy. The sauce was bold, yet light - not too watery, not too thick. The Chicken Fried Rice was not greasy and still managed to pack a lot of flavor. \n\nOverall, the service was good and the food was exceptional. Definitely recommend.", "author": "Jacob D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "A nice neighborhood Chinese restaurant. The food was fine (nothing great), the restaurant was clean, and the service was good.", "author": "Jethro B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-28", "description": "Magnificent chicken wings, crispy, fatty chicken flavor that shatters between your front teeth. Dry fried green beans fresh as if i had just picked them. Prawns big and juicy. I liked the eggplant but wanted more heat. Does anyone make hsu shang eggplant with peanuts and black boot peppers, the ones that make you cry? \n\nClean and newly remodeled, even the bathroom was pristine. Owner served us and chatted about her move to sf from china. Friendly and informative.\n\nPrices are cheap for fresh quality. Will return, less oily than most chinese, and way, way better service and atmosphere.", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-03", "description": "* When the food came out, the dishes were all very colorful and surprisingly not too greasy.  The portions were decent too. I appreciated the veggie fried rice, braised green beans w/tofu , eggplant dish and onion pancake the most.  Veggie fried rice was awesome because it wasn't crazy greasy like many other Chinese restaurants tend to produce.  It was light, colorful and had a fresh assortment of vegetables.  The braised green beans w/tofu was just really good (the tofu was salty enough).  Eggplant dishes tend to be very greasy, but again, it was tasty but not too oily.  Finally, I was skeptical about the owner's recommendation of the onion pancake, but the most pleasing feature of this appetizer was the dipping sauce.  We scarfed down the entire plate.  The hot & sour soup was average.  \n*   \n*   The food is good, price is fair for the quality, service is courteous and honest and lastly, it is modestly decorated and clean (tasteful, minimalist, and not tacky).", "author": "Jocey L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-06", "description": "Driving home from the South Bay we were tired and hungry.  I was craving Chinese (why are there no truly good Chinese restaurants in Marin?) and was planning on stopping at San Tung, on my list of places to try.  Unfortunately it was closed, fortunately Tenglong was open.  Found a parking space a couple of blocks away and made our way to the restaurant.  \n\nThanks to fellow Yelpers we ordered the potstickers (which came out really quickly), dry fried chicken wings, salt & pepper shrimp, rice, and dry sautéed green beans.  Add a couple of beers and we were so happy.  Ended up taking home some of the wings  to enjoy the next day.  \n\nWhile we eating there was a steady stream of people picking up take out.  Now we're trying to figure out how to politely say goodbye to the in-laws in time to stop here for dinner on the way home.", "author": "Joli W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "New favorite for Chinese!  \n\nCome to Tenglong for friendly service, a beautiful room (even a nice bathroom), super-fresh and well-seasoned food in generous portions.  Great menu for people who like spicy food and also vegetarians.  \n\nWe tried their signature dry fried chicken wings - the all-smiles FOH co-owner told us a customer had told her they were Chinese KFC - maybe because they're addictive?  KFC could only wish to serve up such mouth-watering sweet and savory treats - the honey glaze, the perfectly fried chicken and the kiss of chili heat really make these stand out.  I'd put these wings up against any in the city.\n\nAlso tried salt and pepper prawns - excellent.  Had to restrain myself from eating way too much.  Add a really nice basil eggplant and dry sauteed green beans and you have a fresh feast full of flavor.   You can have either white or brown rice, a nice touch.\n\nI'm really looking forward to going back and checking out more of Tenglong's menu.  Their inner Richmond location makes them pretty easy to get to from much of the city.  Do yourself a favor and GO!", "author": "Bob K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "I have found my replacement for \"SAN TUNG\" and \"SO\". I visited Tenglong on three different occasions.  Every dish was dead on delicious without the MSG.  \n\nThe restaurant was small with no fancy decor. The staff were super nice and explained the dishing in a professional manner. \n\nI ordered their Hot and sour soup, dry fried chicken wings, string beans w/pork & sweet and sour pork. The wings were crispy and perfectly dressed with their tangy spicy sauce. The dried fried beans was seasoned and cooked to perfection. I'm a big fan of Sweet and sour anything and their pork Hit a \"Grand Slam.\". The bonus is that they serve brown rice. \n\nAfter the meal, I was pleasantly surprised to see the owner/Chef(Jeff) making his rounds to each table. His quiet demeanor and humble smile, greeted us at the table.  I commended Jeff on his culinary skills as a chef. Jeff said he was pleased by the Yelp reviews, but also happy to see everyone enjoying their meal. He recommend us try the Salt/Pepper shrimp and specials that are not on the menu. \n\nI look forward to my next visit to Tenglong.\n\nFYI: Try their Lunch Menu which has all the above mentioned dishes and then some\n\nAnother piece of advice: Eat in and not take out. The food changes its texture and dynamic's when boxed up too long. \n\nBon Appetit !!!!", "author": "Joe L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "This restraint is really small but it's really clean and quiet. I ordered a chicken wing and it was really good. I would recommend someone else to eat here too.", "author": "Dennis L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "This place is great and should get more business than they do. They are great for me as a vegan and are a favorite of my omnivorous Chinese girl friend. Saying they have a little something for everyone would be an understatement. I recommend the green onion pancake and dry fried diced meatless chicken (so good!).", "author": "Jason C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-24", "description": "Kudos for a convenient ordering process via the web page. But...the fried rice and mushu chicken were tasteless. The dan dan noodles were good.", "author": "Morris R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "Love the Mongolian beef, not too spicy and yummm:P, they have pretty good wonton soup too, the service are also great!!", "author": "Jalen H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-07", "description": "Never going back. I ordered Dry Spice \"diced chicken\". Flavor was amazing, but half of my \"chicken\" was tiny pieces trapped in chunks of batter. I then started to cut open each peice of chicken to see how much chicken was actually there. I left more than half of my plate behind; cut open pieces of deep fried batter. When confronted about it, i was told, \"its to make it more crunchy\". Then was charged an extra 1.50.", "author": "Anthony B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Dry fried chicken wings like that OTHER restaurant without the wait? Where do I sign up??\n\nThe hype is all true, the wings here rocked my socks off. I ate them, uber crispy, juicy skin and all, and I normally don't eat skin of any type. We also had the Spicy Pork Strips and Tomato Beef Chow Mein. The pork was vinegary just like I like it and the chow mein could have used one less scoop of sugar, but was otherwise great. \n\nWe were the only table at 5pm, we walked there from my dental office, but they seem to do a pretty swift take-out business. Our dishes were burn-the-roof-of-your-tongue piping hot and came out in less than 8 minutes. I did, I clocked them. \n\nThe chef is incredibly skilled, everything was deliciously authentic and cooked with lots of \"wok fire\" which is very important in my book. \nThe waitress, whom I'm guessing is the chef's wife, is very sweet, kept our water glasses filled and changed our chicken bones filled plates without prompting. \n\nI HATE MSG and experienced none of the possible negative side effects that I normally get from places that use MSG. \n\nI'll be back time and time again for those incredible wings!", "author": "Veronica C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-04", "description": "After years of having the awesome Minhs Vietnamese Restaurant in the location, there was a changeover to this new establishment. I liked the old place, so, I was initially reluctant to venture in, especially since most of the other Chinese places along this corridor are pretty much sub-par..\n\nStill, I was curious...and a few random whiffs of the cuisine as I passed by were awfully enticing.\n\nSo, I  finally caved in.\n\nGood thing, too, because my tastebuds were rewarded with some yummy deliciousness when I snagged the basil eggplant chicken. I like my stuff spicy, and so it was, but not blazing, sear off the tongue spicy--just very tasty. \n\nGood so far...\n\nI visited again and was rewarded with shrimp with chili sauce, which was divine.\n\nMy tiny complaint is it's kinda pricey, but otherwise, the food is really good, and is served up in a timely fashion.\n\nWelcome to my neighborhood!", "author": "ACE A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-30", "description": "After reading reviews about a substitute for the long lines of San Tung, I took the bait and tried this place out.\n\nUnfortunately, it is not.  It is just a poor man's version of the real thing.\n\nDon't get me wrong, it is not bad, but it is not comparable to San Tung.\n\n1. The chicken: the pieces were bigger, thus not as crispy and soft on the meat.  Some may like it better, I did not.  The portion was also a bit smaller (fewer pieces).\n\n2. The string bean.  Not as crispy.\n\n\nOverall, I don't think I will be coming back.  The prices are the same, but portion was a bit smaller and not as good as the original.\n\nThe restaurant is extremely small, like less than 10 tables.  So if it is on a weekend, you may have to wait here as well.", "author": "Jason L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "I have been here several times and am finally getting around to this review. I've done delivery, takeout and eaten at the restaurant, and find it consistent with fresh tasting ingredients and quick, friendly service. My faves: sauteed dry string beans with tofu, original dry fried chicken wings and the vegetarian mu shu. I've even had their meatless chicken and found it to be quite tasty. Overall, a nice, clean neighborhood Chinese restaurant that I keep going back to over and over again.", "author": "Jules M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Great chinese fast food. good fried rice, good, spicy, mixed veg n pork. \n\neat24 is good too", "author": "Jesse J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "THIS PLACE IS SO CLEAN. WOW...\n\nOrdered takeout Sunday afternoon. The lady running the show was cool, friendly, and chatty. The dried fried chicken wings were on par with San Tung wings. I wouldn't say better nor worse, but the same. Only difference is San Tung wings seems to have more \"sugar\" crystals crunching with every bite. Not a bad thing, but just something I noticed. Again, essentially as good, as flavorful, and delicious. Beef noodles in tomato sauce was solid. A wholesome taste, fresh, not too salty. BIG PORTION. This was a good call by the lady. Third dish was the green beans with shredded pork. Pretty good.\n\nI'll be a regular now.", "author": "Ethan L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-27", "description": "I'll preface this review with: I'm pretty tough on Chinese restaurants bc I have high expectations when the place claims to be \"authentic\".  Tenglong was better than the fully Americanized Chinese restaurants, ie Panda Express or PF Changs.  That said, I can't write a glowing review.\n\nWe ordered the dry-fried green beans (gan bian si ji dou), dry-fried spicy chicken, and mapo tofu.  The green beans were pretty good and got my highest marks. The mapo tofu, which is what I had been craving, looked very unusual in color and texture. The flavor was surprisingly much better than the look and Tenglong obviously used some authentic spices, but still mixed marks on the texture (with the sauce being way too watery). The dry-fried spicy chicken was nothing special. \n\nStill in search of a Chinese restaurant with 5 stars...", "author": "Amy L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "Great Chinese Restaurant! Wonderful Service from all the people there -- hostess, waiters, waitresses.\n\nReally good selection of all kinds of Chinese dishes. Plus a Very Clean place (5 Stars just for that -- clean tables, clean entrance, clean windows/store front! All Great Signs of a good place to eat.\n\nWe even made sure to order more dishes so that we would have food to box up for lunch at work the next day.\n\nNext time we'll try more dishes!\n\nSuper nice service, Great Food! All good.", "author": "John G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-02", "description": "Brand new to the city and still no food in the fridge. Walked past this place said why not. No one was in there...so we were a little skeptical. Ordered wonton soup...it was good! It came out hot and fresh. The same was for the sweet and sour pork and chicken fried rice. We're surrounded by restaurants but will likely be back.", "author": "Jacob H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-17", "description": "Went here with a friend the day after Chinese's New Years for some food. We had noticed this place had replaced an old Vietnamese restaurant and had been interested in trying it out.  Inside seated about 20-30 people. The place is always busy whenever I walked by before. \n\nWe ordered the cod filet, the chicken wings, some soup, and greens. For 2 people I think we over did the ordering. The portions were very generous. The chicken wings were very good, tender, moist and sweet. I do recommend trying the cod filet. It was one of the best Chinese dishes I've had in a while and my friend and I would've been happy just to eat that dish alone.  4 dishes cost us around 40 bucks which we were more than happy with. \n\nYou can tell the service is new but they made a real effort to treat us like good guests. Inside the place is quiet but the tables were full, which is unusual for a Chinese place, but I guess that means people are busy eating the good food here cause I stopped talking once the food came. I highly recommend you give this place a try and help support the new business!", "author": "Nam L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-25", "description": "I've dined in here, picked up and have gotten delivery. Solid food, great service. Delivery in 30 minutes. No complaints.", "author": "Jacqueline T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "I never really review about things but Teng Long's chicken is a must try! I love anything that's fried and crunchy. One time my friend and I were going on an adventure for fried foods. Teng Long is all we needed. We ordered the eggrolls, dry fried chicken wings, salt n pepper shrimp, and some beef chow mein because why not? The waitress said the eggrolls are homemade, I love long time. The dry fried chicken wings are very big and juicy. I see there's a lot of controversy about the chicken wings but I really have to say that they're my personal favorite. The salt n pepper shrimp was delicious. And the beef chow mein smelled so good; brings me back memories just thinking of it.", "author": "Jasmin O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "Absolutely authentic homestyle cooking! The best in San Francisco! I spent my entire childhood in Beijing and have very high standards for homestyle Chinese cuisine. This is one of the very very few places in the US that prepares northern/central Chinese dishes the way you would find them in Beijing.", "author": "Metodi Z."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "The freshest food - great veges and meat and spices - an incredible touch.  Every time.  They sweat the details!", "author": "Jim H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "I love this place. Been going ever since I lived in the neighborhood. The lemon chicken is delicious, the won ton soup is killer (nice and peppery). Good fried rice.\n\nYou will NOT enjoy this place if you like super greasy chinese. The food here is not very greasy at all, which I quite enjoy !", "author": "Arturo L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-26", "description": "Hooray! Good Chinese food in the Richmond!\n\nI really liked this place. Clean, cute, family-run (the two kids were there to greet me when I came to pick up my order), and the food was very good. Yes, the Dry Fried Chicken Wings are on par with San Tung's, and you don't have to wait 45 minutes outside in the cold for a table. We also got the Prawns with Honey Walnuts (tasty) and the Beef and Tomato Chow Mein, which was also solid, but I might try something else next time.\n\nAnyway, you should probably go now before word gets out and the place gets too crowded.", "author": "Todd K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-31", "description": "New lovely neighborhood Chinese restaurant. \nThe family that owns this place makes you feel like you are eating at a family member's house. We have an eight month old and they are always so accommodating. \nThe food is delicious! Every dish we've ordered has been wonderfully fresh and tasty.  The dishes are never oily and never too salty. These are my favorite dishes.\n\nDry Fried Chicken Wings- We have ordered this dish every time we've come here and always a hit. Crispy wings with a sweet and spicy sauce. \n\nBasil Eggplant with Pork- My favorite dish so far. Its just a perfect combination of flavors. The basil is not over powering and the eggplant is cooked perfectly. \n\nThe Dry Fried String Beans with Tofu -  The tofu are fried crispy pieces and a perfect compliment to the string beans. \n\nSizzling Rice Soup- delicious savory broth with shrimp, chicken and spinach. They bring the bowl of soup and sizzling rice to the table and combine them right before serving so you actually hear the sizzle. \n\nWe will definitely be repeat customers.", "author": "Maria B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "We bicycled over to this restaurant the other night based on the good Yelp reviews.  It is a very pleasant and clean little restaurant.  We had a nice chat with the owner, Christina (she is from China, presumably that is her Americanized name).  Her husband is the chef in the kitchen, and she seems to do most everything else, with some help from her two kids and another employee.  Christina said that she and her family operated two different Chinese restaurants in China, but that this is their first restaurant since coming to the US about 7 years ago.\n\nAnyway, we tried two dishes, the Veggie Delight and the Singapore Noodles, and we enjoyed both dishes.  We also had a side of brown rice, which was unusually good.  Two dishes was more than we could eat, so Rita had the rest of the Veggie Delight the next day, and it re-heated well.  The dishes tasted very fresh and not greasy.  The owner Christina says that they will be expanding the menu shortly, and adding more vegetarian dishes, including a vegetarian version of their chicken wings!", "author": "Matt and Rita C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-04", "description": "The service was what did it for me. All smiles and friendly demeanors. The food was also tasty, but not because it was filled with sodium and spice. It was tasty because of the quality of the ingredients. \n\nFor $5.42 I got some awesome soup and naan. Great little spot to have lunch.", "author": "Carlos C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "Great for catered delivery! We had a lot of food delivered to our home for a Chinese New Year party. Food was a big hit!\n\nGreat wings, egg rolls, veggie fried rice, and dumplings! Food came in tins, ready to be placed on our serving tray burners. \n\nChristina was great, and helped us make the right good choices.", "author": "Brent T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "Tough parking between 5-6pm on Sunday evening. Finally parked on 7th Ave and walk 5 blocks to 3rd Ave. Spinach tofu soup good and light. Fried dry chicken wings would be bland without their sauce. Salt and pepper fried fish good. Egg plant tofu just okay. Green beans and tofu good. Seems like they deep fried everything and bring to table very hot. Overall, okay place to eat although they have maybe only 10 small tables in restaurant.", "author": "Clifford W."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "Another Chinese restaurant on Clement st?  Normally I would just walk by, which I have done multiple times until one day we got an office lunch catered there and OMG THEY HAVE THE BEST CHICKEN WINGS, EVER!\n\nWe ordered over $200 worth of food and everything was great but the highlight for me was their honey walnut prawns and their chicken wings!!  Other reviewers have compared them to San Tung's but it's been a while since I've been there.  All I know is that these are great and I work only blocks away.  Yes, I will be back for more!", "author": "Rosalind S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "I came to Tenglong with my parents, friend, and her parents. We were looking for a Chinese restaurant that wasn't too classy but was great quality.  Unfortunately, Tenglong Chinese Restaurant isn't that kind of place. \n\nThe atmosphere of the restaurant is very casual and local. I do not live in San Francisco, and it felt as though it was more of a small take-out joint for the locals around Clement Street. All the dishes we sampled at Tenglong were bland and mediocre. I was very disappointed. The food took a while to come out of the kitchen (15-30 minutes). However, Tenglong excels in one thing, even if it is not their food. It is their customer service. The staff is incredibly friendly and kind. \n\nTenglong is also very clean, which is a rarity in a Chinese restaurant.  Finding parking is extremely hard too. This is why I assume Tenglong is for residents of the area/locals. I don't think I will come back here.", "author": "Emmanuella Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-04", "description": "1. Dry Fried Flounder Filet - 4/5\nThe fish was sooo tender inside, and the sauce is slightly sweet and thick, and tasted SO good with white rice!\n\n2. Basil Spicy Eggplant - 4/5\nA little heavy on the sauce, but great flavor!\n\n3. Tomato Beef Chow Mein - 4/5\nFirst time having tomato beef chow mein, and it was really good! It was like...Chinese Spaghetti haha, but better!\n\n4. Original Dry Fried Chicken Wings - 5/5\nBETTER THAN SAN TUNG AND SHANGHAI HOUSE AND MARNEE THAI!!! I swear these wings are SO delicious!!!!!", "author": "Liz W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "Black bean sauce noodles are nothing like they should be. The sauce is brown instead of black, and thin instead of thick. Had to eat it still unfortunately, since I'm running Bay to Breakers tomorrow. Oh well. Wings are still good though.", "author": "Derrick V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "Oooh, it's dangerous that I live right around the corner...\n\nMy husband and I ordered take out last night. It was our first time trying it.\nThe food was AWESOME.\n\nWe ordered Spring Rolls (they were out of green onion cakes, that's the ONLY reason I gave 4 stars and not 5)\nPork with Hot Peppers-NOT for the faint of heart. I'm not sure if my husband enjoyed sweating that much over dinner.\nDry Fried Wings-Heaven\nVeggie Fried Rice-tasty and not greasy\n\nIt was ready in 15 min and the price is right!\n\nCan't wait to try other dishes-although I'm going to have to limit myself to once a week or I'm not going to start off my year the way I planned!  ;)", "author": "Jaque H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "Excellent service, cleanliness and quality of food! Amazing lunch specials and speedy delivery service! I ordered the veggie delight and indeed it was delightful. I've had the crispy chicken, amazing. The owner won awards for his sweet and sour sauce in China, I cannot wait to come back and try that.\n\n This is my only go to Chinese spot in the neighborhood. It was long overdue!", "author": "Jenise C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-20", "description": "This newly opened establishment is off to a solid start.  I had the wonton soup which had savory, not too salty broth.  The veggies were simple, and the stars of the show were the dumplings.  Bulbous, with perfectly cooked ground meat, they didn't taste frozen - I'm willing to bet they fill them before cooking, which may change later for expediting reasons.\n\nAfter debating between the pot stickers and the green onion pancake, the veggie option won (although I am of the opinion that when it comes to Chinese you can never have enough dumpling related dishes), and while most restaurants over-oil this entree, at Teng Long, it was good.  The curry sauce was just the right amount of spicy, enhancing the oft \"just okay\" dish.\n\nAmbiance was that of a typically modern Chinese restaurant.  Minimal yet practical decor, attentive service that embodies a more American mentality, yet some things never change - the family business vibe, traditional colors and plants.  These are the things I hope will always stay the same in these places.\n\nSome suggestions for the fledgling business - veggie options that include faux meat, perhaps a house made iced tea, and one unique dessert.  You don't see the last two in many Chinese restaurants and I really think it will give them an edge over other restaurants on Geary, for example.\n\nBut other than that...great first impression, Teng Long!", "author": "Lily E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-28", "description": "The food was good and the service was o.k. soft drinks are not refillable...  Considering the prices they are charging for the food this costed them a star...", "author": "Jerry L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "Like Al Pacino in Scarface always says, \"Issss Okay.\"\n\nThe best part of this restaurant is the friendly staff.  The food was decent but nothing special.  If I was in the neighborhood and needed to eat I would come back but I would never go out of my way to come eat here.  I feel kind of bad saying that because they are so nice but it is the truth.", "author": "Brian S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "went for lunch and ordered the tofu, eggplant, and dry sauteed green beans, which proved to be mildly flavorful at best. my mistake may have been my attempt to go veggie for this meal, as the guy to my right ordered a massive meat platter, and looked pleased about it. either way, it's quick and inexpensive Chinese food but nothing worth raving about.", "author": "Ronny K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Good service.  Best place to eat in the area. This is one of my favorite places to come for dinner or lunch. Their eggplant and chicken, wonton soup, dry fried diced chicken and Mongolian beef are taste very good.  The price for everything is quite reasonable and affordable.", "author": "Yan Y."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "Definitely a 5 again. I have eaten here several times and it is heavenly. Last time we had the vegetarian sweet & sour chicken which was amazing, I love their sauce, the pineapple, peppers & onions were fresh and the \"chicken\" was some sort of balls (I'd swear Ive seen them in the frozen section of lien hing market up the street) and they were excellent.\n\nAlso had the vegetarian chow mein which was amazingly good, fresh noodles, good flavored sauce, lots of cabbage & carrots and other veggies but not too much. \n\nThe egg rolls are perfectly done. The female owner is the sweetest person you could imagine! 5 stars all the way. I'm so glad there is finally a chinese restaurant on Clement that I can relate to as a vegetarian.", "author": "Venus S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "Hmm. Maybe Tenglong was a fluke? Tried it for takeout again and I tried the Cashew Nut Chicken. I'm pretty convinced that they instead gave me the tofu \"chicken\" because it really tasted like other vegan meat i've had before. The fried rice was nothing special and I would have liked more vegetables and beef in it. I think i'm going back to my old faithful - Nan King Road Bistro.", "author": "Dana J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-26", "description": "Solid food!  The dry fried chicken wings are indeed just like San Tung's.  My husband even thought their's is better than San Tung's, but I thought it was at least on par.  Their eggplant was good, Dan Dan noodles were pretty good, and the salt and pepper shrimp definitely had the right flavor although they do it without shell here.\n\nI got carry out and my food took forever (they said 20 min on the phone and I got there and waited another 20).  But to their credit, the lady in front (the owner and chef's wife) apologized and explained they had a mishap with the kitchen staff that morning.  Not awesome to have to wait that long, but I give credit to places that will acknowledge that they screwed up (we all do sometimes).  And she was super friendly and made sure I had water and tea while I waited.  Definitely not your standard 'Chinese service'!", "author": "j k."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "Chinese food is tasty!  They're always friendly and super attentive!  The shrimp glazed walnut is delicious.  Nice and quiet clean atmosphere too.  I recommend if your In the area and looking for Chinese food.", "author": "Jennifer V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-02", "description": "I'm not a big fan of this \"genre\" of food but this place is nice. Clean. Owner/server is friendly and helpful. The food needs a kick to it , but the ambience is very soothing. I stick to -no land animals dishes- but I can see their dry fried wings must be amazing for chicken lovers. Ask the server/owner what she recommends because she is very accommodating. I would go here again and again when someone wants shrimp chow mein.", "author": "Me M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "This place is the worst tasting Chinese food I've yet to eat in the city. The fried rice was poor quality and the meat was disgusting. I don't even want to know where the shrimp came from, because it tasted like dirt. The only good thing about this place was the service.", "author": "Marco L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "We were in search for a place to eat yesterday and we saw this on yelp. We are so happy that we have picked this place. The place is clean and the person who helped us was very friendly. As far as the food, we loved what we ordered. My favorite was the spicy ma po tofu w/ minced pork. Everything (all 4 dishes) we ordered was good. My family enjoyed everything. We will be back. ... The basil spicy eggplant chicken was sooooo good too", "author": "Larry M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "My roommate and I ordered food from here on a random night through Eat24...and let me tell ya, we were very pleasantly surprised. The food was really good and the price was even better!! Highly recommend this place, although I haven't been to their actual location, the food made a name for itself!", "author": "George M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-09", "description": "Good service, okay food, and a clean restaurant, the only thing i do not like about this place is that the people who work there constantly stared at my friend and i and then would turn around and talk, i am not sure if it was about us, but it was enough to make us feel very uncomfortable by the end of our dinner.", "author": "Zo M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "this place is excellent     really clean food   great service   good atmosphere", "author": "Robert E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-18", "description": "Very friendly.  Food bland and overly salted.  Shanghai noodles almost inedible due to salt.  Meatless sesame chicken gooey and not very flavorful, no veggies at all.  Scallion pancake was good.  Spinach with garlic delicious.  Green beans with tofu good texture wise, but too salty also.  2 1/2stars.", "author": "Kj S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-05", "description": "Super yummy..Yeah it is no Sing Tang..however they deliver and the food was food.", "author": "Rayannah S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-19", "description": "Ordered delivery on a Sunday evening and got $30 of bland slop for dinner. If a restaurant has Szichuan items on its menu, specifically calls them out as spicy, and the customer still specifies \"very very spicy\", they should at least have a little kick to them. The lack of any flavor or spice in the \"SPICY\" mapo tofu and dry cook \"SPICY\" chicken was a huge letdown. The Singapore noodles were also just incredibly bland, and I wasn't expecting much with them to begin with. \n\nI never throw away leftovers, but I had a few bites of each of these and tossed them. No amount of soy sauce, Sriracha, chili paste, chili oil and/or Mae Ploy could undo the terrible injustice done to these dishes.", "author": "Jeremy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "Nice place. Very clean, not crowdy. Portions are not huge, but the food is tasty.", "author": "Pavel S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-29", "description": "This is our absolute favorite spot for calling in delivery. Besides their food being soooo yummy, their delivery time is super quick!  Their sweet and sour chicken is finger lickin good. We love the potstickers too!", "author": "Jacqueline Z."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-28", "description": "The dried fried chicken wings had a FUUUNKY smell.  They were spicy (me like), too sweet (ehhh) & were NOT good tasty (me NO happy)  Chow mein was kinda hard and it barely had any veggies!   Big fat BOOOOOO! :-/", "author": "Lissette T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-08", "description": "We ordered the dry fried shrimp, a pricier item, and the sweet sour pork...both failed...\n\nFirst, the sweet sour pork was suppose to have carrots, red peppers, and onions in it...it only came with a ton of white onions while the other veggies listed for this dish were missing...hmmm, doesn't the cook know what items go into each dish?--it's listed  on the menu...also, the sweet sour sauce was something you'd get at a grocery store and the pork was old tasting. I have had fresher better tasting sweet sour pork at dive chinese places, where expectations are low.\n\nNow to the dry fried shrimp...a pricier dish on their menu at $13. The shrimp tasted like iodine, horrible, and the garlic sauce did not taste of any garlic, but just of white pepper. The dish was missing the bamboo, carrots, mushrooms, which were listed as a part of this dish.\n\nThe sauces for both dishes were rather bland, one dimensional...and I am not talking about the heat index, just the flavor index. Heat doesn't make up for lack of flavor.\n\nBottom line is--there are so many tastier places to have Chinese in SF---\nMind that I am not saying \"great\" places, just better places.\nWe were looking for better quality Chinese food, and this place was disappointing.\n\nIt seems like they are cutting corners.\nShame on you Tenglong, because Clement street is full of vegetable and asian food stores, so that there is no excuse for missing ingredients in a dish...it just feels lazy to me...\n\nWe will not be returning...very disappointing.", "author": "Elektra T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-23", "description": "eh, I've had better... but their delivery is super fast! they are always quicker than they say they will be.\n\nsweet and sour pork is good, but they go a little heavy on the sauce. wish they offered sweet and sour chicken!\n\ntheir chicken chow mein was kind of bland and the noodles were a weird texture. probably healthier than most places, but kind of a disappointment :(", "author": "Sam D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "After a long day at the a California Academy of Sciences the family was super hungry. Found this gem on Yelp and decided to give it a go. So glad we did.  We has 4 adults and 4 kids (ages 8-16). The hostesses was very friendly and sat us all together. We proceeded to order a variety of food including green onion pancake, spring rolls, chicken wings, combo chow mein, garlic chicken, sesame chicken, broccoli shrimp, tofu with green beans, and steamed rice. All the food was super delicious and full of flavor. My favorite items were the green onion pancake, sesame chicken, and tofu with green beans. We are everything and there were no left overs. Honestly it's the best Chinese food I've ever had. I can't wait to go back!", "author": "Raudel W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "I love this place. Service is always friendly and efficient. Clean interior too. My faves are the stringbeans with tofu, beef in oyster sauce, shrimp fried rice and mushu pork. Easily my favorite Chinese restaurant for dinner.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-30", "description": "We ordered \"vegetables deluxe\" for takeout and we got a boxful of cabbage. Seriously (see photos.) When I called to enquire about the dish, the hostess knew EXACTLY why I was calling, apologized, and offered a refund. There are too many restaurants in the neighborhood for you to settle for this BAD quality.  (We also got another dish that was cooked erroneously and very sub-par, but wasn't as egregiously made.)", "author": "H N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-03", "description": "Pro: good food, friendly staffs\n\nCon: Hot & sour came out 40 min after the order and the place is empty. First dish came out 20 min after the soup and it was fried chicken wings.  Each dish came out 20 min apart.  That is not how successful chinese restaurant operate. Two chefs in the kitchen.", "author": "Jeff O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "wonderful place, nice people. i love their chicken wing, sweet and sour pork. hope next time i can go with my friends. thanks for their sever.", "author": "Jin L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-05", "description": "Got the dry chicken, dan dan noodles and fried ice cream.  All great, first time costumer, hope this quality continues...", "author": "josh d."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "This place serves good, fresh Chinese fare. Friendly staff, very clean environment. I would give it at least 4 stars if not for the skimpy portions. The Mu Shu, for example, is mostly cabbage (cheap) and if you add a protein you have to sift through the veggies to find the few bits. Why then is it $9+? It's super yummy though. I respect quality food over quantity, and am not someone who typically eats HUGE portions but believe in getting what you pay for and some consistency. Step it up Tenglong and your business will go a \"long\" way!", "author": "Cara G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-19", "description": "Tenglong is a small restaurant with good tasting food and great customer service. Portions were a bit small for the prices a bit high. We had the hot and sour soup, dry fried chicken wings and chicken with garlic string beans.", "author": "Bruce J."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-28", "description": "Great Chinese food and good service.", "author": "George Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-26", "description": "Friend lives around the corner, it was win thin walking distance. Potstickers are amazing and the chow mein is good! :)", "author": "Kayla R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "I have been several more times and while I still like Tenglong, I am not convinced they are MSG free, as I inquired and received the \"we use it only when we need to\" answer, which does not inspire faith.  I've also now had some meh dish execution especially under duress.  Luckily the restaurant is quiet so the chances of major duress under heavy cover fire remains only for the rare occasion there is a customer onslaught, or someone in the kitchen calls out sick.  Its a small operation, ultimately with a good heart and a great wing which is what still brings me in on a \"wing and a prayer\".  Downgrade one star.  Steady as she goes.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-21", "description": "This place is great. Love the Singapore noodles, the wings, and the Mongolian beef. pancake was meh. Definitely will be coming back. Cheap, clean (really nice bathroom and orchids at every table!) and friendly service too. Mmm mmm.", "author": "Natasha F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-20", "description": "Home-style authentic Chinese food prepared simply.  The kitchen and premises (even the bathroom) are incredibly clean.  The food did was not incredible -- e.g., the house-made wontons were tasty, but one-dimensional (essentially pork meatballs wrapped in wonton skins) -- but did I mention how clean this place is?  Service is friendly though slow.", "author": "Chris T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "I'm a regular here. I like this place. The food is good quality and well prepared.\nThey make an effort with presentation.\n\nThe lemon chicken is killer and so are the sautéed green beans.\n\nThe waitress and the owner are very friendly.", "author": "arthur l."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-30", "description": "They just opened a week ago but the food tasted lile they've been opened for a long time....granted im only 24 ...im a native and so far this is the best chinese food ive ever had...and the service was unbelivable!...my mom mentioned it was her b-day and they surprused all four of us with ice cream and whip cream!!!!! Dude seriously this place is amazing..the food tasted authentic it wasnt super greasy like most places..thank you soooo much teng long i wish you lots of business and prosperity!!!", "author": "David G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "Walked into this restaurant after taking a look at their menu.\nIt looked exactly like San Tung's--had the exact same signature dishes, with the same names.\nFigured it was a possible second location or started by an old chef.\nUltimately, I decided to order the Dry Fried Chicken--it was bomb dot com and might I dare say, I liked it better than San Tung's. \nFirst, the sauce was on point, perhaps a little more pepper than San Tung's but I def enjoyed the extra kick. And second, the chicken drumsticks and wings were much meatier than San Tung's.\nAs I departed, I spoke to the owners about the obvious similarity with San Tung, and they claimed there wasn't any connection. \nDon't believe that at all, but why does that matter? They make awesome wings.", "author": "R C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "This place is very solid. The dry fried chicken is better than san tung in my opinion. It is spicier and has better flavor, not to mention no wait. As of today, it is my best kept secret in the inner richmond!", "author": "Sam L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-26", "description": "Small restaurant, neat & shinny.\nThey apparently are not trying to be \"cheap Chinese food\", but the food is delicious.\nThey apparently do \"crispy fried\" very well.  Their fried flounder was absolutely outstanding, as was Honey Walnut Prawns.  Chow mein is tasty.  Everything is fresh-tasting and judiciously cooked (w/o msg & not greasy).  Really nice.\nService was friendly.\nWe will be back to try many other enticing things on the menu.", "author": "Vera P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-24", "description": "Who are people kidding? Pot Stickers? Must be the ones from Costco...tiny no-filling things. Should be called gyozas. Went twice after folks said this was the new San Tung. Aint nowhere close!\nOver priced to boot! Now, I will admit the owner was friendly, but I aint going there to crack a smile.\nAnd for you folks, they're from Dongguan...not particularly known as a haven for. gourmet food in China. If I want those prices, Im going elsewhere for much better food or value. Another hipster (today's yuppy) joint.", "author": "Art Y."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "Two stars for cleanliness. The rest? I've definitely had better. Service was horribly slow, to the point where I thought they had just forgotten about our order.\n\nI've never had the San Tung wings so I don't have those to compare the wings here to, but I thought they were really nothing special. Not super crispy and meat was kind of stringy. I actually thought they smelled like stinky tofu, which was weird. What are all the rave reviews about??\n\nDan dan noodles were the strangest version of that dish I've seen. Since when did shrimp and calamari belong in a dish like that? The noodles were not cooked very well and the sauce was bright orange.\n\nThe rest was just mediocre and not really worth mentioning. All in all a somewhat unsatisfying dinner. I had to apologize to my dining partner for choosing this place.", "author": "deb s."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-02", "description": "My family and I had dinner here last night.  It's a great place for a family gathering.  The food was very tasty.  We ordered a wonton soup, fried beancurd with stringbeans, shrimp with caramelized walnuts, chow mein, chow fun, chicken wings (both non-spicy and spicy), sweet and sour pork, cashew chicken, and mongolian beef.  My favorite dishes were the cashew chicken, shrimp with caramelized walnuts and non-spicy chicken wings.  There was a generous amount of cashews in the cashew chicken.  The shrimp with caramelized walnuts was nice because the shrimp wasn't heavily battered and the sauce was light and tasty.  But, the BEST part of the dinner was the CHICKEN WINGS.  Because I can't eat spicy foods, I tried the non-spicy wings.  The chicken was nice and tender and the outside was crispy and covered with a delicious sauce.  They are on the same tier as the delicious wings at Hot Sauce & Panko and San Tung.  \n\nThe service was excellent.  It's a family business.  The wife was very attentive and friendly.  Our teapot was always full.  The food was bought out quickly and efficiently.  All dishes were freshly prepared and piping hot.  The fortune cookies were fresh and crunchy.\n\nHowever, the wontons in the wonton soup need improvement.  The wonton wrapper was a bit too thick and chewy for me.  The filling was a bit sparse.  I prefer thin and silky wonton wrapper.  However, the wonton broth was clear and tasty.  The veggies were fresh and crisp.\n\nbtw, this is one of the cleanest Chinese restaurant I have eaten in in a long time.", "author": "Sherry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-25", "description": "New restaurant on Clement at 3rd avenue.  Everything we ordered was delicious.  The Spinach and Bean Curd Soup had a clean, peppery flavor.  The egg roll appetizer was good but a little on the small side. The Mongolian Beef was tender, and cooked at a hot wok temperature so the meat was flavorful.  The Chicken Chow Mein and Sweet and Sour Pork were a couple of notches above most Chinese restaurants.  And the Original Dry Fried Chicken Wings was the Bomb. The wings and drumsticks were big and they gave nine pieces on a plate. It was so addictive, I could have eaten that single dish by myself. I would say the same and maybe even better than San Tung.  \n\nThe folks running the restaurant are very nice.  She refilled my water without prompting.  Very relaxed environment, plain but tasteful decor.  High ceiling made it nice.  The only thing I would change is the pop music in the background.  They should put on some vintage chinese music instead.", "author": "D L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-05", "description": "I hate to be that one person who gives a bad review, but I feel like it's my duty to because the only reason my family and I came here was because of the high rating on yelp. \n\nThe only good thing about this restaurant is the cleanliness. I went here with my parents, brother and sister last Saturday, 3/30/13 and the entire experience was terrible. First, they were severely understaffed - they had one server doing to-go orders, and one server serving the ENTIRE restaurant...which was completely full. Our waters were empty for most of the meal. Second, the food came out SO slowly... the dishes literally came out one at a time. After we finished a dish, we had to wait another 5 minutes before the next dish came out. We were planning to share everything family style anyways.. but it was frustrating to have ONE dish to choose from and then wait for the next dish to come out. The food was good enough - but anyone who's actually eaten at an authentic Chinese restaurant in SF can tell you that it's overpriced for the portion size, and too way salty. We saw the same menu items at China First for $3 less (I've never been there, just saying).\nWe ordered\n1) Eggplant Chicken - too salty\n2) Mushu pork - alright\n3) Wonton soup - alright\n4) Pepper beef - way salty\nand something else. Whatever it was, it wasn't memorable because I can't remember what it was.", "author": "Sarah H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "Tried this place on spec from Yelp for lunch today.  Was initially put off by the fact that there were no other diners (this changed) and the blandness of the decor. \nFor $42 we shared shredded pork with Garlic sauce,  sautéed string beans with tofu (delicious),  chicken with basil and enormous amounts of eggplant, brown rice and potstickers.   All good.  Especially the string beans.  We'll be back.", "author": "Tarbh G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "Great food. Wide ranging menu with all of the standards.", "author": "Tomas F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "Have only done takeout and it was fast. Food flavorful and not too salty and oily, and very good. The whole family devoured everything. They're on the go-to list!", "author": "Emily K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "We ordered delivery from Tenglong and were excited based on some of the reviews.  We had a pretty average to bad experience unfortunately.  They estimated 60 minutes for delivery and it actually came out to 1.5 hours.  We order cashew chicken (chicken was dark meat with fat still on it), chili shrimp (very good except swimming in sauce), Wonton Soup (some bones in the wontons) and steamed broccoli which is tough to get wrong.  I don't think we will be ordering again, although they were very friendly and apologetic about the long wait.  Would rather go to Eliza's and pick up the food myself.", "author": "J F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "This is seriously very good. The hot-braised flounder filet is probably the best I have ever had. Very tasty, and doesn't feel much oily even it's deep fried.\nThe Original chicken wings is great too!", "author": "Jacky L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "it's worth it just for the wings Crispy, sweet and spicy. Adjust as you like but great wings and not over packed like San tung in sunset. Nice friendly service.", "author": "Silver C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-19", "description": "What a sweet little place. Great vibe, excellent service. and piping hot food that comes out fast. And no msg! \n\nLoved the vegetarian sesame chicken, veggie chow fun and basil eggplant. And the brown rice was exceptionally tasty.\n\nWe wandered in off the street for a late lunch and it was perfect. They are open all afternoon. Am very happy to support this family-run local business. They take pride in what they serve and we left feeling nourished.", "author": "D. D."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "Yum yum yum! The Vegetarian Sweet and a sour chicken is so delicious. You gotta try it! The Vegetarian fried rice is also very good and healthy. They care about quality not quantity. The owner is very personable and I wish her all the best of luck!  The decor is also vey tastefully done. Good quality food you woun't be dissapointed!", "author": "Christina S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "This place is soooo delicious! Everything I've eaten here tastes really fresh and well seasoned,also the portions are very generous. My favorite thing on the menu is the lemon chicken...order it and you will not be disappointed! Also,really fast delivery..like,I've literally placed an order and had it delivered to my house within 25 minutes. Also when I call in an order and pick it up,its always ready in 15 minutes,which is wonderful. Only reason I'm not giving 5 stars is because I've had a couple of awkward experiences with the delivery guys regarding tipping. I paid and tipped on my card once and when delivery dude showed up,he acted kind of weird when I didn't give him a cash tip. I explained that I'd included his tip on my card and seemed annoyed and I found that off putting. Other time,I wanted to give 3.50 tip and the guy got pissed that I wasn't giving him $5. My order total was only $20 so I really didn't think it was such an insult to tip $3.50. But yeah..the food is top notch!", "author": "Pasha S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-21", "description": "Ordered online, waited an hour. Called and they said it was on the way. Twenty minutes passed. Turns out, it wasn't on the way. Called again, someone else answered and said it was on the way. It wasn't. Called again and apparently, my order never left the restaurant. They said they didn't know when it would be delivered so they would cancel it. No apology provided. A real, honest, accurate review of what happened. Don't know if the food is any good, but good operational processes and customer service are lacking to say the least.", "author": "Rocky B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-13", "description": "This is our go-to place for Chinese delivery. And the fact that it has stayed on our go-to list for almost two years is a credit to the consistent quality of the food they put out ... especially since we've tried a ton of other places in the area that have just not kept up their standards. Tenglong's menu is pretty standard fare and while there aren't any notable \"best we've ever had\" dishes, we've always been happy with the typical Chinese dishes we ordered. Also, we've actually been into the restaurant itself on Clement and were happy to see it was clean and neat (i.e., not one of those places you order delivery from until you happen to see the actual restaurant and say \"we're never ordering from there again\").", "author": "Dave E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-04", "description": "After reading all the reviews, I thought this would be a great place but there is nothing special about this restaurant besides the friendly waitress who is also the owner.\n\nOf course we had to try the dry fry chicken when we were here, nothing special really.  It is NOT as good as San Tung's version.   The chicken isn't bad here but it's nothing to write home about.  We also had the tomato beef noodle, boy this was gross.  The beef on the noddle had this hard chewy texture and the noodle lacked any tomato flavor to it.  It had a orange color to it no flavor at all.  Last, we also had the wonton soup based on the waitress's suggestion.  All I can say is water, msg, and  chilli powder dump together and boil.", "author": "Guess G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Wonderful Chinese food, from a couple who have had restaurants before and know how to take care of you.\nDon't miss it!", "author": "Kathy C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-10", "description": "Overrated. Bland fried rice. Soup was not good, no flavor. Vegetable fried rice and seafood soup was $20. Wouldn't mind paying this ridiculous high price if it was good. The waitress was nice.", "author": "John C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "Its certainly not gourmet food, but this place is clean and tasty with a friendly staff that puts it far above other Chinese take-out places. The food is tasty and inexpensive, but most importantly its not as heavy and greasy as most Chinese places. If you're looking for take-out or some Chinese comfort food in the inner Richmod there is absolutely nowhere better!", "author": "Double T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-25", "description": "The beef chow fun was pretty good. The dry chicken wings were pretty good too, but there was a little too much white pepper. I might eat here again, but I wouldn't go out of my way to come here again, since there are so many other places to explore. Maybe I would I rated this place higher, if the service were better. Overall, my experience was okay.", "author": "Chris N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-01", "description": "Awesome staff who are super friendly!  Good sweet and sour pork and ma po tofu", "author": "Lisa B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-25", "description": "We saw that one of the things this restaurant does well is quick delivery, but on a Sunday night, we had to wait almost 2hours for our food. We called after an hour and were told our order was on its way. After 1 hour and 40 minutes, we called again and were told that our order was *just* put in and that it would be to us shortly. They apologized, asked if we wanted free appetizers which we declined. They asked what they could do, I said a discount, they said fine, and then hung up!! We ordered through their website, so maybe that was our mistake. But don't have online ordering if you don't know how to use it.", "author": "sfmarzan o."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-28", "description": "Dry fried chicken wings are out of this world. I crave them once every couple of months and have to go back. That's about it though... The rest of the food is average at best. Clean nice place with friendly people.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "Less than 10% of Chinese restaurants in SF is good, this is one of them. they use high quality laminated paper for their takeouts, not the cheap transparent plastic most uses. They don't use starch as their sauces, they uses white chicken meat. Everything taste good and only $1 more for each menu item when compared to other Chinese restaurants.", "author": "Robert S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-20", "description": "Best Chinese in the inner richmond. Dry Fried Diced Chicken is very good, as is Sweet and Sour Pork.", "author": "Ben P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "Great to have a new Chinese restaurant in the Inner Richmond district.  Their dried fried chicken is as good as anywhere in San Francisco, including San Tung.  Actually, I prefer the drier texture over the way it's served at most Chinese/Korean restaurants.  The restaurant is clean and the owner's put some effort into the decor.  The environment is not too loud and service is excellent.  The food overall was very good.", "author": "Robert C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-30", "description": "I have eaten there a  few times.  The first time I had a lunch on my own - veggies with tofu strips.  There were 4 tiny tofu strips -- I asked why there were so few and was told that was because it was a luncheon plate, which is half of the dinner plate.  I asked if that mean only 8 tiny tofu strips with the dinner - and was told it did!  Not adequate.\nA friend and I returned to try some other dishes.  Both were unsatisfactory.  The fried rice plate didn't have enough rice, but it did have large chunks of broccoli and cabbage.  Lacking were any other vegetable, and it was very bland.  In addition, we ordered the tofu, nuts and broccoli.  It did not look like the photo on the menu - it had  more large chunks of broccoli, not enough fried tofu or nuts.  The waitress did not warn us when we ordered that that fried rice was also heavy on the broccoli -  we really had more of a broccoli meal with little variety.  The waitress seemed not to care that we were unsatisfied with our meal.\nI recommend going to other places that give better value with more flavor and a more responsive serving staff.", "author": "Greg M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "After my last experience with this place I've decided I can't ever order from here again.     I live close, so I order pretty regularly, and I like the food, I'd give them a solid 4 stars just for that.  But today I had to order delivery since my car decided to take a dump on me.  I ordered the kung pao chicken and the beef with oyster sauce.  They brought me kung pao chicken and some other sort of chicken something i have no idea.  Okay, mistakes happen, so I called back.  They then brought me some sort of beef dish i don't even see on the menu.  Damnit.  Minus two stars.", "author": "Mari V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "The staff was really nice, the tables & bathroom were clean, and the food was good. The chicken wings were crispy + had yummy sauce, and the tofu with veggies had a spicy and slightly sour sauce. For dinner, most dishes were about $9-$10, and it came out to $14 per person with tip.", "author": "Annie O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "WONDERFUL!! We were at the DeYoung museum for the Dutch Master's exhibit and wanted to have a nice lunch before heading back to Half Moon Bay. This restaurant was not far and we managed to find a parking spot within a block (wow! on a Sunday afternoon)... The food was very tasty, sauces were delicate, and dishes were piping hot when delivered! Nothing we got was overly oily, in fact quite the opposite, the cooking oil was almost undetectable. We had pot stickers-great taste and texture, the prawns in lobster sauce was loaded with prawns and the sauce was delicate and delicious, the jasmine rice was cooked just right, and I had the vegetable dish [they even adjusted the dish to exclude one vegetable I really don't like] and the vegetables were so good I manage to clean the plate. We will be going back again anytime we are in the city because it was that good. My only negative would be the temperature- it was a little on the chilly side so take a sweater as a precaution.... The staff was delightful...Christina is very engaging and our overall experience was memorable.... thank you", "author": "Nancy H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-22", "description": "My friend told me about this restraunt and he was telling me how great it was so i went in and tried it. It was my first time trying this place and im usually picky about my food, but this place was pretty bomb! It didnt take that long to make the food and the people there were very kind.", "author": "natasha l."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "Go try the wings! I also tried their chicken with basil and eggplant and that was really tasty, too. They are adding more items to their menu, like Dan Dan Mein and Ja Jiang Mein, so I can't wait to try them. The place is super clean. The owners are really nice and efficient. Definitely a nice new addition to the Inner Richmond.", "author": "A L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-06", "description": "Delicious friendly clean new chinese option on clement! Dry fried chicken was at least comparable to San Tung ( I liked it a little better, a little more pepper!). Beef Tomato chow mein was kind of like noodles + sweet and sour sauce. I liked it, but a little sweet. Hope these guys do well here, we could use more quality chinese options", "author": "Chris C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "There are tons of Chinese Restaurants on clement but if you are looking for one that is clean this is the place. The customer service here is great! It's a family owned business so everyone is super nice. Also, the place looks recently renovated and looks very clean. Usually, I don't use the soy sauce plates Usually, I don't prefer Chinese food but this place changed my mind. There dumplings are to die for. Its not too salty nor tasteless. They have the right about of meat and vegetables. It's just right. Also, if you come here the Chicken Wings and string beans with tofu are great too. At the end, they gave us a big plate of fortune cookies. Usually, Chinese restaurant's don't give these away. The food came extremely quick.", "author": "Henry C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "We, too, felt like were in the owners' own home. We brought our kids, and yes, it is family friendly.  Decor was clean and bright.  The food was really good. We can recommend the hot & sour soup, chow mein and fried rice. Onion pancake was good too.   The green beans were cooked perfectly, but a little spicy for some in our group. The garlic pork was delicious.  The consensus around the table was that the quality of the ingredients was better than other Chinese places we go to regularly. It is a bit more expensive too, but well worth it.  This one is entering the rotation.", "author": "Erin N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "Today I was happy to discover this restaurant named Teng Long. I had observed lately there was renovation going on inside this location, which was previously a Vietnamese restaurant. I was surprised to find it reopened so soon by a new owner/chef.  For lunch I ordered their Beef with Green Onions, with a big scoop of steamed rice. The order also came with a cup of very tasty hot & sour soup, and a complimentary egg roll. The large portion of beef was very tender and juicy, stir fried with green onion, white onion and minced garlic, with just the right amount of delicious sauce. I could tell right away that it was good quality beef. I think Teng Long's Lunch Specials are amazing. I could see 20 different lunch plates, each comes with soup and rice like the one I ordered, all ranging from $8.50 to $9. Their style of cooking is quite diversed, both Mandarin, Cantonese and some Sichuan flavors, all great for meat lovers and vegetarians alike. Their new decor is tastefully done and clean. The waitststaff is attentive and courteous. This was only my first dining experience at Teng Long and I found it very satisfying!", "author": "J L."}
