{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "The very good Thai restaurant in Castro area. The girl who took order for us was very friendly. I love their curry in the real bumpkin bowl, it' taste is awesome.", "author": "Nguyen S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "Decent Thai restaurant in Castro.\n\nMy company had the Monday off for California Admissions Day.\nSince I was very behind on homework, I decided to spend a study day in the City.\nWanting Thai food, but not knowing where to go, I stumbled across Thailand Restaurant's sign that said they offered lunch specials, Monday through Friday's from noon to 3PM.\n\nAfter looking through their menu, I decided to get a 2 entrée lunch special, with (Chicken) Pad Kra Pow and (Chicken) Panang Curry, that came with a side of rice and a salad. The combination was $12.95 before tax and tip, which I felt was fair for San Francisco/Castro prices.\n\nThe food was alright; it seemed like the red peppers in the Pad Kra Pow were more for appearances rather than heat. The Panang Curry was good but wasn't as full-bodied as I would like for a curry.\n\nOverall, it was a good spot to satisfy my thai-cravings and hunger.", "author": "Kevin W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "This is my favorite Thai restaurant in the Castro ( I've been to three) lovely service and very authentic flavors. I lived in Thailand for 18 months and this takes me back! Fresh and complex. Great for vegetarians.", "author": "Nils H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Thai food done right. Green curry with shrimp was just incredible. Nicely hot (spicewise) and so much prawn. \n\nPad See Ew my husband had was similarly delicious, just so damn heart warming. Rice was even perfect. \n\nService was awesome, the ambiance was nice (except for a self-absorbed man that talked non-stop at his companion for an hour straight after they'd finished their meal, which of course wasn't Thailand's fault!!) and they even had beautiful Christmas decorations up, which we loved. \n\nI am hardly ever in the Castro but I'm planning my next trip there just so I can happen to mention 'why don't we slide on up to Thailand restaurant'. Oh yes, this restaurant has no shop front and is up a flight of stairs so many sure you don't miss it! \n\nThank you Thailand! Your food was so, so, so good!", "author": "Zoe L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-30", "description": "Came here for a quick bite after workout. We came at 8 PM on Saturday so beat the rush and were able to get seated by the window. I didn't mind the ambiance, you walk up a flight of stairs and are seated quickly. I wasn't that turned off by the decor and layout - there's a random fireplace in the middle of the restaurant like it was someone's living room. Food is your run of the mill Thai, mild, inoffensive, albeit a little bland and too sweet. The spicy level was still subdued.\n\nAngel Wings - breaded and sliced, stuffed with glass noodle. Tender enough meat, though breading was grainy resembled that of frozen chicken nuggets.\nTasty Eggplant - Texture was between mushy and firm, it didn't turn into a puree but not bad.\nCashew Nut Chicken - A little on the sweet side but nicely seasoned, meat was a little rubbery.\n\nIt wouldn't be my first choice for Thai food in the area with other places nearby but not half bad.", "author": "Truc N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Quick, efficient, and affordable. I normally place my order over the telephone for pick up. They're always on time and I definitely recommend this place for a quick casual meal. :)", "author": "Wesley F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-29", "description": "On the expensive side for what you get.\n\nDelivery took over an hour and the food was cold. It may be a better experience in the restaurant but I was not happy with the delivery, also I ordered a $2 vegetable upgrade on the shrimp dish and they sent me a bit of steamed carrot. I was completely unsatisfied.", "author": "Manny F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-16", "description": "It had been years since I'd popped in here... I have a friend who is friendly with the servers at both of the other nearby Thai restaurants (Thai House Express and Thai Chef), so he always chooses our location... but last night I was solo and nearby and hungry, so why not...\n\nGreeted promptly, seated by the window with a really cute view of the street, passersby. The panang curry and the papaya salad I ordered were quite good, maybe not exceptional in a way that blows away all others, but certainly hit the spot, and the prices were reasonable/standard.\n\nCertainly a good option, worthy of rotating into the mix of places to grab Thai food in the Castro.", "author": "Sean B."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-02", "description": "I've been here in the past and it's been better. \nWe ordered Chicken Praram and Pad Thai dishes. Both arrived very quickly, which was nice. But they both seemed kind of bland and lacked flavor. \n\nTwo different servers waited on us.  The first person was a guy who just walked up and stood by the table. We assumed he was there like he was ready to take our order... but he didn't say hello, or smile or anything.  He just stood there.  It was odd.  We said \"hello\", but he didn't really respond.  So we eventually assumed he just wanted us to order and so we did.\n\nBeing a polite, well mannered person myself, I always wonder what is going on.  Are they having a terrible day?  Do they hate their job?  Do they hate customers?  Do they have a migraine? One will never know. \n\nThe second person who served us was very friendly, polite and upbeat.  That was nice and helped to make up for the first person who was just kind of flat. \n\nAll in all, it was a middle of the road restaurant experience.", "author": "Rob O."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Good food but it can be a bit slow on the service but with good food and I think it expected when going to a Thai restaurant. Always try the appetizers course it's one way to sample a bit of what they have to offer.", "author": "RICHARD J."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-30", "description": "I really wanted to like this place, but everything about it was subpar.\n\nLet's begin with the setup of the restaurant. You walk up the staircase which the restaurant doors leads you to. Once at the top of the staircase, it's as if you've entered someone's living room. Huge bay windows, a fireplace, odd wall decor that doesn't match with the cloth napkin decorated tables. An unusual vibe for a restaurant, and a Thai restaurant at that. \n\nOnce seated, I decided to go with the Raad Na Pak (Pan fried flat noodles with tofu, broccoli and a light gravy sauce). I love them wide flat noodles and broccoli-- what could go wrong? A lot, friends, a lot. Notice they say \"light gravy sauce\"-- this sauce was anything but light. When I received my dish, it was as if I ordered a noodle soup. My noodles, broccoli, and tofu were swimming in this thin gravy. Being open minded, I decided to go ahead and taste what I was served. Unfortunately, the story doesn't get any better, friends. My dish lacked any type of flavor; it was the plainest noodle dish you could imagine. I doused my dish with chili so I could taste something. I left feeling sad, guys, sad because the Thai food I received at this restaurant did not remotely accurately represent what real Thai food is: bursts of flavor, spices, and color. \n\nI will say the service wasn't terrible. The servers were polite, and that is Thailand Restaurant's saving grace.\n\nIf you're in the Castro, seek elsewhere for food, friends.", "author": "Nicole A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "Finally I decided to try this place ever since walking pass their door every week for the past 3 years. We tried their Tom Yum Goong, Spicy Seafood and Roasted Duck dish. Unfortunately this place is not the place to go for those looking for Authentic Thai. All the dishes are not spicy at all and taste like sautéed meat with sweet and sour sauce. Service is minimal. Price is astronomically high whereas you can get much better Thai elsewhere in nearby area.", "author": "Richard W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "Very Good restaurant  Thailand restaurant  best of the best if you want to looking restaurant  you can go this Thailand restaurant", "author": "Tony T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-02", "description": "Awesome place! My to go spot for Thai food. Prices are reasonable. Tasty food! $12  for a chicken noodle curry.", "author": "Ibelig V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "It was one of those nights where festivities is during the day and your all just exhausted for food and more drinks. \n.\nThis is where we ended up at. So we got sat down and just ordered away. \n.\nBtw there is a stair case to go up to the restaurant. So might be tricky or hidden. But big sign to not mislead where your going upstairs. \n.\nThai coconut seafood soup -this was yummy. Soothing for the throat. The fresh ingredients inside was nummy. Love the fresh shrimp and mushrooms! Very good to start with. \n.\nPapaya salad - thai style. It was sweet and spicy. Looked refreshing. This wasn't as spicy as i thought it would be. But it was good because i was craving this. Beautifully presented with lots of color. Light and refreshing, and opens the palette for a more appetizing meal. \n.\nBbq beef - savory. Sweet. Full of flavors. Tender beef. Juicy but yet satisfying. Pairs well with rice for sure. \n.\nCashew chicken - lots of chicken with scattered cashew on random bites. Juicy saucy and unique flavor from this dish. Easily one of my to go to dish on any day. \n. \nStir fry pineapple duck - smokey roasted duck in full flavor. Love the pineapple sweet sauce to compliment it. As well goes good with some carb white rice. Just love how the duck has its own flavor even when smuttered with their signature sauce. \n. \nStir fry thai basil seafood - basically the basil in the sauce is what compliments this dish. Love the fresh seafood used in this dish. Love the big size shrimps! Nice and light dish. \n.\nBottle of merlot - compliments the seafood and bbq beef for sure. As well calms the spiciness down too. \n.\nBrown rice - filler food but just goes so damn good with all the dishes named above. At least they offer brown rice okayyyy.\n.\nOverall chat about the festivities. Eat a little bit, drink some more. Calling it a night in Castro is what's up. Thanks for reading and stay classy. With a little bit of sassss. Lol have a yelptastic day! \n.", "author": "Alex T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-03", "description": "Good restaurant. The red curry with duck was good. It's above some 440 club, so you can hear the music from the club vibrating through the room.", "author": "Lyndsey G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "A Castro must stop.  The spring rolls (non fried) are wonderful.  The green curry is delicious.  I have also enjoyed the red curry with pumpkin.  You can order on eat24 to have it delivered.  It's almost enough to share 1 dish.", "author": "Joe Q."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Great food.  Perfect location.\nAsk for a table by the window overlooking the Castro theater.", "author": "Michael S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-01", "description": "I don't know what took Jamie W. and me so long to try this place. After all, we like Thai food, and we pass by it every time we're on Castro, or at least we pass by the sign since you can't really see the restaurant from street level. It's upstairs on the second floor of a Victorian where the windows face the neon marquee of the Castro Theater (photo: http://bit.ly/1bQis8o). There are also two other so-so Thai places in the Castro where you don't have to climb stairs to get to them. Maybe we've concluded so-so Thai is better than a potential groin injury on those stairs. Now I'm just making up excuses, but we finally made it.\n\nYes, we tried Thailand, and I have to say that satisfying Thai food continues to be an elusive search in the Castro. We started on a misstep because we didn't read the descriptions carefully enough. We thought we ordered true Spring Rolls when we asked for the $6.95 Thailand Rolls, but it turned out to be fried ones, and it turned out to be two dollars extra for \"Fresh\" Spring Rolls. Even though they were decent enough, it was a bummer since I didn't want to have an oily crunch in my mouth when I wasn't prepared for it (photo: http://bit.ly/1yDshLN).  Jamie was more forgiving, and he segued into the $8.95 Chicken Noodles.\n\nIt was a rather bland plate of pan-fried noodles sauteed with chicken, egg, bean sprouts, onions and ground peanuts (photo: http://bit.ly/1GNZHOX). I decided to get into a more vegetarian mode with the $8.50 Pad Ma Keau, a full plate of sauteed eggplant mixed in black bean sauce, garlic and basil (photo: http://bit.ly/1CzIaXI). It was tasty enough for me but still lacked a certain oomph to make it completely winning. Weak menu choices? Perhaps but even a base hit among the three dishes would have been nice. Couple that with the rather passive service, and it made for an evening infused with a pervasive mehness despite the passing quality of the food that was served. So down the stairs we go.\n\nFOOD - 3 stars...middling Thai dishes make the journey to the top of the stairs a fitful one\nAMBIANCE - 3 stars...a bit like someone's living room converted to a restaurant, for better or worse\nSERVICE - 2.5 stars...not sure if they were trying to be unobtrusive but it came across as a bit passive\nTOTAL - 3 stars...don't expect a stairway to heaven", "author": "Ed U."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-29", "description": "The service was excellent, but not enough to pull in the ratings for quality of the food. \nThe duck curry was soupy not creamy and lacked flavor.\nThe stuffed chicken wings had same foamy texture as chicken nuggets.\nCute place to convert a residential flat into a restaurant, but I would not come back.", "author": "Dee G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "I'm not sure why Thailand Restaurant doesn't have higher ratings! It has a nice atmosphere, sweet and attentive staff, and, most importantly, fantastic food. I ordered the poh taag, which I absolutely loved and definitely recommend.", "author": "Katherine N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "Came here for an early dinner on a Sunday night.  Street parking is basically impossible.  The restaurant is up a stairwell in what used to be a residence.  Not a large restaurant.  Service was fine.  \n\nWe had five dishes.  I especially enjoyed the pad thai and the roast duck.  The fresh spring rolls were good too.  The mango dessert was just OK.  \n\nI'd eat here again.  Just watch out for the single step up to the restroom and another step up to the toilet itself.  Gets tricky when you are leaving the restroom!", "author": "Doctor G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-29", "description": "Nice, casual restaurant with super friendly service.  I was there just last week with a friend and we both enjoyed our meal.  I wasn't that hungry and was going to order an appetizer, and the waitress talked me into another; the angel wings.  They were stuffed with noodles and other things and had a nice presentation and were nice and crispy as well as flavorful.  I'm glad she recommended them.  Super friendly service.  I actually give this place 3 1/2 stars.", "author": "Delicious B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "We were driving near the Castro looking for a quick bite and randomly found this Thai restaurant tucked between a bar and a store.   What a great discovery, the place provides a great view of Castro street (choose a window side table) and a great lunch special. \n\nThe restaurant is located upstairs, which adds this feeling that you are stepping into someone's home.  The decor is nice and clean.  We ordered off the lunch special menu, that includes a list of one item combinations or pick two combinations.  The two item plates include salad, but all lunch specials include soup.\n\nThe soup was sour deliciousness in a small bowl that left me very happy. The green curry was also very good, but surprisingly did not have eggplant.  This was the first time ever having green curry w/o eggplant, but it was good nonetheless.  \n\nIts hard for me not give this place 4 stars for the value and the view of the Castro alone.  Tasty food w a view always makes my day, maybe you should try the curry w a view ^_^", "author": "Marlon T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Authentic Thai food? Here is it is!! I am in love!! Thai papaya salad, BBQ pork, mango salad, phat Thai, pat seeyew(flat tummy noodles), silver noodles!!", "author": "Serenade K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-04", "description": "Giving this place a 3 cause the Bbq pork was good . It's just crazy that it didn't come with rice . The plate was already 11.99 plus $2 for rice and on top of all that our waitress was rude! Won't be returning . Lucky Thai house in Berkeley is way better plus hella cheaper. Your welcome .", "author": "Chazmin F."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-31", "description": "Excellent. Generous portions, great flavor, nice presentation. I highly recommend. And they have fish sauce with Thai chiles as a condiment. Yum! Waitstaff is super as well.", "author": "Paul P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-20", "description": "We had 5 in our party. Food was ok, smaller servings. We ordered two types of soft shell crab for three of us, the other two ordered chicken and pork dishes, because they don't eat fish.  They delivered the softshell crab, and then over 20 minutes later deliver the rest of the food.  Three we're done eating before the other food was delivered. Of course the three that had eaten were bored so they snacked on our dishes, we didn't get much food.  \n\nThe bill came to about $110, on top of that, they automatically added a 20% tip. If it's mandatory it's not a tip, it's part of the cost of the food. We were not a party of 12, we were only a party of five, and the service was bad. We will not return to this restaurant.", "author": "Mike K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-27", "description": "In terms of things on the menu, it's your typical Thai restaurant, nothing too amazing. Reasonably priced lunch specials.\nCame in for dinner once and the waitress didn't let us know that rice costs extra on my yellow curry dish when asking if I wanted rice with it. Not impressed.", "author": "Elisa L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-29", "description": "I am going to keep it simple; DISGUSTING!\n\nNo wonder this place was half empty when I came in.", "author": "Allan S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-23", "description": "Employees were nice, but food was salty to the point that I couldn't eat it. It also gets so noisy that you can't hear anything people are saying. Take a critical look at your food quality and you can boost your score.", "author": "Dan D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-24", "description": "Flavor: 3.5 Panang Curry with Shrimp. Ordered Egg Fried Rice as a side. You can choose between brown rice, jasmine rice and egg fried rice. 132 Linda vista dr", "author": "Alex Z."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-07", "description": "Location, location, location .....that's all the reason I feel this restaurant is surviving with its below average food, terrible server and slow unfriendly service in a city that's famous for it's great restaurants all around. It's located right across Castro Theater, so out of convenience we walked into it on Halloween night. The Hostess was nice and got us a table by the window in no time. The place wasn't busy at all at 9 pm. Then comes the disappointment.....took forever to show up to take order in non-peak hour. We ordered Pad Prik w beef and Pad Khing with chicken. Despite asking to make it highest level of hot flavor, dishes were extremely sweet, almost inedible. Whenever we asked for something, like chopsticks and hot sauce, the server looked extremely surprised and had a very unwilling to serve attitude. To top it off, half way through my dinner, he took the hot sauce caddie and gave it to the people at the next table. Terrible ending of a fun Halloween night at Castro. Definitely won't be back.", "author": "Ash A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Really exceptional chicken satay and drunk noodles. Owner was extremely friendly and the restaurant and bathrooms were clean. Will definitely be back if ever in the area again.", "author": "Dustin S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-27", "description": "A few of my friends from HS were visiting from Vegas the other day, and we were walking around the Castro and happened to stumble upon this place. It was easy, looked decent, and we decided \"what the hell\" and went for it. \n\nThe place very visibly a converted apartment turned into a restaurant. Narrow stairs up to the restaurant, small, low ceilings, looks like you're sitting in someones living room. I thought it was adorable, but my friends from Vegas (used to wide sprawling spaces) were so confused. \n\nEven though the restaurant wasn't necessarily busy, it took them a while to send a server our way. I noticed after about 10 minutes without water or a hello something was up, so I waved one down. No one wants to wave down a server.. \n\nAll of us got the pad thai (so safe, I know). I got a glass of red wine, and they stuck with waters. The Pad Thai was.. fine. Just fine. Not great, not bad, we ate it because we were hungry, but I probably wouldn't order again. My wine was mediocre as well -- I'm not expecting a groundbreaking glass of wine from this Castro thai restaurant, though. \n\nAll in all, pretty okay experience. Probably won't be coming back since I've had much better Thai in the city.", "author": "Alex G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-10", "description": "I ordered egg noodles with chicken. It was disgusting. Chicken was raw. You better do your work better guys.", "author": "Vladimir E."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "the Good: the Gaw Praw Duck was amazing: perfect char, but still super moist. Very flavorful.\n\nthe Bad: They charge an extra $2 for rice & $2.50 for brown rice. the service was not that great (they tried, but they weren't very good), and there was a really weird smell when you first walk in that is pretty unappetizing.\n\nFive star for the food, minus two for the Bad.", "author": "Sam J."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-31", "description": "The food is absolutely amazing, some of the best Thai food I've had. The waiter was rude to us the whole time and then charged us all for a 20% tip!! When we tried adding to our order he snapped \"Hold on\" and said he had to come back because our table was difficult for him to handle. Lol, awesome food and I'll gladly come back, but hopefully without that waiter (man with tattoo under his left ear)\n\nUPDATE: the waiter came up to us as we were leaving and yelled at us when he heard us talking about how the 20% tip was unfair trying to start something!!", "author": "Grady C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-09", "description": "Bottom Line: Very rude service with a lot of attitude and highly unprofessional staff. This review is written by a former restaurant server and host.\n\nI was a server and a host for a year at a restaurant and I know really bad service when I see it. I stopped here with my friend after a yoga class. It was about 9:40 and they close at 10. It was her birthday and I was really excited to take her out. As soon as we got there, the host said abruptly we could only order take out and we couldn't eat there since the restaurant is closing.\n\nFrom experience, usually you do allow guests to still seat 20 minutes before closing and if you can't, then you usually say something like, \"Hi guys, we're really sorry but the best we can do is provide take out because the restaurant is closing soon. Is this okay with you?\" We decided to do takeout anyway. Strike 1.\n\nFive minutes into looking at the menu, the host then says, \"I don't want to be rude but the kitchen is closing soon so you need to order!\" Again, a better approach might be, \"Hi guys, our kitchen is closing soon and I want to get your order in before it does. I have some great recommendations if you are having trouble deciding. Is there anything I can help with?\" Strike 2.\n\nWe rush our order and I hand the host my American Express. He glances at it haughtily, hands it back and says, we don't take American Express. Do you have something else. Exasperated by my whole experience in the course of 5 minutes, I replied this is kind of ridiculous. He looked up, glared at me said you have a bad attitude. He cancels our order and then kicks us out of the restaurant making snide remarks as we leave.\n\nLook, I know the restaurant industry is stressful - I've lived it. But there's something really wrong when a restaurant allows its host to be that rude and give that much attitude. This is restaurant earns a well-deserved 1 star.", "author": "Eric N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "My favorite Thai restaurant in the Castro. Good food and good service. Great view of Castro Theater from the window seats.", "author": "Martin N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "About the place: upstairs in an old house. No bar and not a lot of room to wait for a table BUT staff is super nice and you can order drinks in line. \n\nAbout the food: good but not amazing. Spring rolls, yellow curry chicken, and pad Thai. We asked for extra peanut sauce and they gave us a ton. YUM. Plates are good for sharing :) Standard Thai with lots of variety. Again review is not negative I will definitely go back, but it is sort of standard. We went Halloween night and didn't have to wait too long. \n\nAbout the staff: super nice...great customer service!!", "author": "Neal B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "We started with the chicken satay and both thought that their peanut sauce was one of the better ones that we've had,  The accompanying cucumber salad was nicely seasoned too and did not overwhelm the dish with too much vinegar.  Rather, it brightened and separated the two different flavors presented on this appetizer.\n\nThe Chicken Noodles were pan fried flat noodles with chicken, egg, bean sprouts, onions, and ground peanuts.  This is not a spicy dish but again, the flavors were totally present and unique.  \n\nWe also shared the most popular Goong Pea Seau (Butterfly Prawns).  They are prawns, stuffed with crab meat, marinated in garlic and pepper, rolled in batter; served on a bed of cabbage and served with sweet and sour and spicy sauce.\nI asked for brown rice with this dish.  There were 5 pieces of battered shrimp to share.  The sweet and sour sauce and the spicy sauce were nice choices to add on top of each piece.  The prawns themselves were moist and delicious.\n\nYou're going here for the food--not the ambiance or decor.  It's kind of a funky place with steep steps that you must ascend before entering the dining room.  Some walls are painted a deep red and other walls are white with small, halved, ping-pong looking things sticking out and adding texture.  Again, you're going here for the food...", "author": "Thomas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Whenever I think of Thai I realy think of 4 places and this is one of them.  \n\nThis is my go to if I want some Chicken Pra Ram (Chicken & Spinich with Peanut Sauce).  The peanut sauce is what makes the dish and this is probably one of the better ones I've had in the city because it's very peanut buttery.", "author": "Spencer Q."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-28", "description": "Tried the crab pad Thai-- three pieces of crab meat.. Nothing zomg crazy delish but fair to what I ordered. Partner tried the pumpkin seafood curry, which looked quite ornate. The food is pretty decent-okay-- I like going here for the relatively calm atmosphere though. I could either look out into the Castro streets, or into my partners eyes as romancy koit-Esque songs play.", "author": "Alexander T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-23", "description": "Best pad thai I've had in the Bay Area!!!! Reminds me of the way they make it in Southern California! Divine!", "author": "Christine S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-24", "description": "Thailand Restaurant is good in a pinch - if that pinch is \"Hey, I'm down on Castro for a film and I want a bite to eat - quick!\"\n\nAs other reviewers have mentioned, despite the sign declaiming vegetarian cuisine, they aren't more veg-friendly here than any other thai restaurant at the Bay Area.  In fact, I might caution you:  they are not entirely vegetarian aware, so be absolutely sure to ask the server if there is fish sauce (Nam Pla) in the vegetable/vegetarian dish you are about to order.  If the server seems hesitant, smile gently and ask them to go confirm it with the chef... \n\nThat said, it's your basic Bay Area thai food, pretty solid with all the usual sorts of things - and a pretty good value for your buck.  The dining room is pretty nice - on a second floor so you get a good view of people watching down on the street.\n\nIf you are vegetarian - just be sure to ask about the menu.  And remember - lots of people in other countries consider fish a vegetable (in Mexico, they think vegetarians eat chicken and only \"strict\" vegetarians do not).", "author": "Jenn C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-12", "description": "The food really was inedible; I'm sorry to say! I was the only one in the restaurant at lunch time in a busy part of the Castro--which should have been a strong indicator not to eat here--but we all make mistakes. I left more than half my food on my plate-- the vegetables in the curry were literally frozen cubes of carrots and frozen peas.", "author": "Reena R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-27", "description": "Every time I go here, I am never disappointed.  I've been coming here for over a decade, because I Live in the neighborhood.  I have multiple options for different Thai places, but this spot is always my go-to! \n\nThey deliver, they're fast and the price is right for the portions. \n\nMy favorites:\nTom Ka tofu and vegetables \nPad see iew with beef\nChicken noodles\nYellow curry chicken and potatoes\n\nIf you need a place to eat good food with great service, here ya go!!", "author": "Amie B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-29", "description": "I ordered Pad Kee Mao and Tod Man(fried fish cake) for dinner as take out. The Pad Kee Mao was bland. The pork was overcooked and chewy and no color. The noodles were soggy. It had onions and iceberg lettuce and tomatoes and serano chiles. This was NOT Pad Kee Mao. The Tod Man was meh. Again the seasoning was bland and not good.", "author": "Yoon P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-02", "description": "We had a party of 3 and were seated right when we walked in. It took the server 15 mins to give us our menu, and ordering took another 15 mins. It wasn't busy but it took a long time to get our waiter to come by our table.\nWe ordered the shrimp fried rice, and pad thai. Probably the worst Thai food I ever had. It was mediocre didn't have much flavor to it. Kind of bland and dry. We never got our glass of water refilled not even at the end of our meal. Our waiter took so long to take our orders and was never attentive to our table. \n\nWont be coming back again unless they fix their service. Only time they'd see me again is if i was drunk coming in here to eat, and  to wake up next day not remembering.", "author": "Cheryl Ann B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "The pad thai was great! I really liked the pad thai woon sen also. \n\nMy problem lies in the soups. They tasted really generic and in no way close to authentic. As I am from Thailand I really do like the strong flavors of Kha and ganglal in my soup but man the Tom Yum tasted like it came from a can. The soups were all terrible.\n\nSoups are very important in a Thai restaurant so please fix this.", "author": "Nicolas S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "Not guest friendly. My group of four went for dinner tonight as food is usually ok. Upon arrival at 7 pm. We were the only ones in he restaurant. We asked if we could have a four top table at the window so we could look out on he street below. Remember we were the ONLY ONES THERE.  I felt this was a simple request but they were not accommodating. It would have been a simple move to put two tables together. \nThis happens to be the second bad experience here. The staff is not customer friendly or accommodating. Sad. This place used to be ok. As for  service, food is ok. Not the best but ok. Service is poor. It took a while to place or order but it came in a timely fashion. But no customer service as one would expect in a restaurant. Maybe leaving us alone was a good thing.", "author": "Chris W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-19", "description": "We site has a light dinner here, the food was bland and didn't feel nutritious . My gf and I got s headache 30 minutes after in the same spot of our head thinking maybe the put msg of something not good in the soup.", "author": "Aaron E."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "I honestly love this place. The younger staff seems shy, but one of the ladies there is super sweet and talkative. It's always hard for me to find a place that makes Rad Nah, but this place makes it like my favorite Thai restaurant does when I growing up. Great view of the Castro and very quaint. If you're looking for good food and nice views, check them out!", "author": "Joey A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-26", "description": "Coming back after a long hiatus, I was pleased with my visit this time around. Weekends around lunch time are usually crazy here but for some reason I was able to get a table by the window for my very green cousin to see all the Castro happenings.\n\nThe food was fresh, right temp and delicious. While my cousin, being the picky eater that she is wasn't as enamored she did find some pleasure in the chicken satay at least.\n\nI need to come back more!", "author": "Steven G."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-21", "description": "Argh!  This used to be my go-to place for Thai food.  It's not wheelchair friendly as it's on the 2nd floor up a flight of stairs with no elevator, but it's delicious and conveniently close to home.  But I just came home with my pumpkin curry and found that they reduced their size to 30% less!  Here's a pic (drink is not included, I just put it there so you can see how SMALL the food size was for more than $14).\nhttp://www.yelp.com/biz_photos/yWja5zGBY3GSn_dtEXd7UA?select=UaY9Pwh34DT7NEW7BNg3Ig\n\nSure, maybe I need to excercise portion control but it's not the restaurant's place to force that on their customers.  PLUS, it was still $14+ dollars for this mini-curry size.  At least reduce your price to less than outrageous if you're going to reduce the food portion!  No utensils, no napkins, no rice, $14+!!!  No more TR!  No more... (I am angrily eating the curry while typing this :P ...or should I say hangrily eating...I just hate feeling ripped off)\n\np.s. they also scored a relatively low 85/100 on the Dec 2011 Health Inspection report.  Ick.", "author": "kiwi l."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-22", "description": "Rather entertaining to sit by the window. The chicken with baby corn vegetables is good.  My friend ordered curry salmon. Not sure why fish should drown in an otherwise good sweet sauce. Put it this way, I ended up sticking to my own dish. No family-style this time. Lol\nBy the way, it's so much better when the food server actually serves the Tom Yum soup. I had to volunteer to do the pouring and the soup was warm, not hot. \nNot throwing this place out the window. Will be back for another try.", "author": "David R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "Met some friends here for dinner last night.  It was delicious and I'll definitely be back!\n\nThe restaurant is on the second level of a building on Castro St.  It's a smallish place, with the dining room overlooking the street and the big theatre across the way.  It's dimly lit with a neat red glow on white textured walls.  Pretty cool.\n\nService took a little while to get us started, but once the ball was rolling, they were very fast.  For a party of 5, we received our entrees promptly and all at the same time (I hate it when there's just one person still waiting to get their food and everyone else sits around awkwardly not eating theirs).  I had the spicy seafood in a clay pot and it was fricking awesome.  Tons of flavor and just enough spice to make my nose run but not burn my tastebuds off.  The only thing I didn't like about it was the taste of the mussels -- they are obviously frozen, not fresh.  Oh well.  My husband had the basil duck and inhaled it so I suppose it was edible at the very least.  O_o  My BFF had a crab pad Thai which looked awesome and is on my list to try next time.\n\nPrices are actually very very reasonable, especially considering the location.  I'm always surprised when stuff in the heart of the City isn't set to break your bank account.  $12.95 for the clay pot entree.  Nice!  \n\nThe only bad thing is the parking in this neighborhood.  We were late for our reservation because it literally took us like 30 minutes to find a spot way out in the middle of fucking nowhere....we had to hire a midget Sherpa guide and a donkey named Bobo to guide us back.  So if you're driving in, plan ahead accordingly.", "author": "Heather K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-20", "description": "Delicious food. Pumpkin curry and green curry are favorites. The spicy fried fish looked amazing, but I didn't get to try it.", "author": "Benjamin L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-01", "description": "Sorry but this isn't good Thai food at all. The quality of the food is poor. Vegetables are not fresh and low quality. Few if any spices are used. I dont know if they use MSG but we both felt afterwards like they did use a lot of it. The service is very slow and not so friendly. \nI wouldn't recommend coming to this place.", "author": "Ddc C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-11", "description": "I've eaten here before and I just recently came back for more. Located next to a bar (you can hear the thumping music from below), this place does not disappoint. Try the Thailand Ruam Mit (Appetizer Combo) for starters which include: Fried spring rolls, fish cakes, shrimp in a blanket, tofu and curry puffs served with several sauces, and tell me that's not good. For those that can't push through the sarcasm, it's delicious. \n\nOrder yourself the Soft Shell Crab fried rice and Duck Curry, and you're good to go after your food coma nap. Order the spicy but lightly sauteed green beans too, it's a great combo of food.\n\nThe few drawbacks that I'd have to say was that they don't take American Express and the roar of music from below. Otherwise a pleasant meal is to be had, along with a usually attentive staff.", "author": "Johnas D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "Great tasting Thai food  (very consistent) with much need of improvement with serving staff. \n\nI love coming to this place year after year. The food is top notch and very authentic. \n\nYou can't go wrong with food. It really is a 5 start quality food but too bad the service is less than perfect by far.   The staffs are friendly but not very attentive at all. This has been the pattern since my first visit 10 some years but will not stop me from going there to eat. Food is that good!!", "author": "B K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "I was hesitant to come here because of the mixed reviews, but I was pleasantly surprised. The place itself is cold and not terribly inviting on a chilly day, but the food made up for it. We ordered the green curry and the sweet basil with chili (both with chicken). The green curry had a subtle but very nice flavor. The basil chicken was more flavorful and the portion size was much more generous. The food is mild here so if you want it spicy you have to ask for it. Most of the bad reviews are for service. The place was nearly empty today, so the service was fine, but when the food is this good, I'll take food over service anyway.", "author": "Jon G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-26", "description": "I have been coming to this restaurant for years...and loving those veggie spring rolls for years.  And in fact, I wouldn't mind eating *nothing but* those veggie spring rolls for years...  :)\n\nI have seen a couple of owners change over, but the place is always clean and the servers always friendly and helpful. \n\nGreat for vegetarians and vegans.", "author": "Quality T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-19", "description": "It was my second time eating here.  It's a hidden gem on Castro Street and if you are walking too fast, you might miss it!  I enjoyed the view - the Castro Theater and the bustle of Castro street with flashes of nude men.  Gotta love the Saturday lunches.  Because of the View, I was able to confirm Labor Day plans...watch Vertigo at the movies!  2 for 1.\n\nWhat I did enjoy was the quick service.  There were a few customers, but they treated us quite attentively and even had two waiters approach us for drinks.  Appetizers came quickly as well as the food.\n\nI've had better Thai food, but the food was good.  We had the red duck curry, it was delicious.  We also had the peanut prawns and the service size was good with surprise bed of steamed spinach underneath.  The appetizer combo dish with fried rolls, tofu, etc was also great.  When I stated mild, it really was mild (no spice actually), so I think it will be safe to say Medium spicy next.  I'll be back!", "author": "Neville B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-30", "description": "Trust Yelp! We saw mixed reviews and hesitated, but let me be clear: Avoid this place if you can. \n\nNeither of our orders was what we expected, thanks partly to unclear menu writing and partly to a waiter accompanied by a \"translator\" who didn't seem to understand much English. \n\nThe food itself was ok - Golden Calamari turns out to be deep-fried, which was not at all what the menu implied. The Calamari itself was good, but we didn't want big slabs of deep-fried breaded tourist food (?). \n\nWe also tried the Pad Thai Woon Sen, which was not terrible, but not great. \n\nFor most of the time we were there, the place was empty and the music sounded like bad karoake covers of songs I never liked in the first place. \n\nI am mystified as to why people would go here, when there are so many better options.", "author": "Sam Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-30", "description": "The service was great. The restaurant was newly remodeled.  It was a little drafty. I had the cashew chicken, and my boyfriend had the duck. The food was great. If you are going there during the recommended a sweater.", "author": "Sarah B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-17", "description": "This place used to be good.  Unfortunately, the restaurant is no longer delivering great food. \n\nPlaced an order for take out tonight.  What we received was bland, unappetizing, and quite gross.  We asked for our dishes to come spicy, but I have to say I've made more authentic Thai food in my own kitchen for a whole lot less money.\n\nMy opinion:  If you're looking for decent Thai food, go anywhere but here.  If you're looking for great Thai food, you will definitely want to avoid eating here.", "author": "Brian F."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "Ok writing this review as I'm eating. Walked in for a quick lunch order to go. The gentleman was friendly. I ordered the Pad Ga Paw with beef.  Don't forget my Thai ice tea.\n\nGot back to work with my food and realized it was mainly just onions & peppers. Once I pulled it all out there was pretty much nothing left. I dont like onions at all. I like the flavor it adds to food but dont want it in my mouth. Weird, right??\n\nThe flavor was quite tasty but you don't actually get a lot of meat. But if you like onions then go for it.", "author": "Ayana K."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-16", "description": "This is my favorite Thai place in San Francisco. Everything I've tried on the menu has been great, the staff is very nice and helpful, and the decor is fun (the walls looks like Legos). If you sit by the window you can people-watch on Castro St., which is always fun.\n\nI took my brother who had never had Thai here a couple years ago and he still mentions it.", "author": "Bren C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-06", "description": "Love everything here. \n\nThink the food, location, service, atmosphere is all wonderful.\n\nDefinitely recommend to anyone looking for Thai food in the City.", "author": "Niran L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-19", "description": "I remember coming here a long time ago. I'm glad this place is still here. I recently revisited this place with a friend and my partner. They had quite an extensive menu but not being adventurous we stuck with what we knew. Papaya salad, pad thai, red curry with pork, fried eggplant, baby corn with mushrooms and beef. Everything tasted yummy especially for me since that was my first meal of the day. All washed down with a cold Singha beer. Tummy happy!", "author": "Kenson K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "Downgrading a star for delivery.\n\nI ordered delivery from Thailand on Sunday night. They told me they were busy and it could be up to an hour. An hour went by, still no food. An hour an fifteen minutes, still no food. An hour and a half, still no food. So I called and the guy put me on hold. While I was on hold for 7 minutes, my food arrived. Which was hilarious, because when the guy got back on the line, he told me my food had just left and would arrive within the next 10 minutes, so clearly they have no idea what's going on with the delivery.\n\nMy green curry with chicken was extremely good (4 stars), but I thought both the string beans with tofu and the pad thai could use improvement.\n\nDisappointed, as my experience with the food here before had been excellent.", "author": "Rachel E."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-23", "description": "Thailand Restaurant markets its vegetarian dishes on its outside sign, but it's no more vegetarian or vegan friendly than any other generic Thai restaurant.\n\nI started off with the \"gari paab\" curry puff appetizer ($7). It was similar to mini samosas, basically. Not terribly interesting or flavorful.\n\nFor my main course I had the \"gluten pad khing\" ($8) which is the only dish on the menu using wheat gluten (tofu is an option for every other dish).\n\nIt was a basic soy sauce stir-fry. Nothing special and nothing I couldn't have made at home in 20 minutes or so. I asked them to make it spicy and all they did was dump some Sriracha sauce, which in the end just made it tongue-numbingly spicy. Not quite what I hoped for (I thought they would add some fresh green chilis to the dish).\n\nLike many Bay Area Asian joints, they charged me $2 for rice, which is a horrible crime every time (in the Midwest where I'm from, or the East coast where I currently live, rice is always free). At least they had brown rice.\n\nThe service was mixed; one server was friendly while the other was curt, slow and inattentive.\n\nI would not come back here.", "author": "Kedar D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-05", "description": "29-November, Thursday \nDining here oddly felt like I was embalmed in one particular episode of Seinfeld where there was the bright sleep-depriving neon sign from a Kenny Rogers' Rotisserie across that way that comically illuminated Kramer's apartment making him prone to insanity.  \n\nDon't get me wrong, there was nothing wrong with my butterfly shrimp but the interior lights were so faintly dimmed (no bulbs in the place were above 15 watts), atmospheric lighting is one thing but dining in the dark is just uncomfortable. Especially with the aforementioned, it's a tad bit hysterical that the textured bulbous shapes lining one of the accent walls looks like enlarged Braille for a giant.", "author": "Ty T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-06", "description": "After our last order in September, we decided to give it a second chance.  To our surprise, we got the same delivery guy with the most unprofessional attitude.  After he gave us the food, we asked if we need to sign anything.  He said no, but he reminded us that we \"didn't pay for tip online\".  We were going to give him cash anyway, but were shocked that tip became a mandatory thing.  Then, he went on with how it was too far so we should not order for delivery again after he took the money.  We tried to call the restaurant and it went to their voicemail.  It is totally confirmed our decision not to ever order or eat at this restaurant again.", "author": "Casey N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "I have been eating here (well, most often take-out, so maybe \"eating from here\"?) since the 1980's. The food is reliably good, delivery usually quick, though they have sometimes gotten the order wrong in the past this (has not happened since online ordering became available.) They make a delicious \"fresh spring roll\" and also yummy papaya salad. Papaya salad can be very spicy at some places, sometimes too hot for me to enjoy, for me the  Thailand restaurant salad is just right.", "author": "Tom M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-06", "description": "Service took forever. Food was poor quality. What happened? Am I missing something or did this restaurant take a turn for the worst? Hoping this was a one off experience.", "author": "A. J. Dex C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-13", "description": "I have a good time when I eat here.  I tell them to make my dish(s) super spicy and they never do, so I end up emptying the assorted peppers/chili paste they bring out and I just pour those onto my plate.  I love sweating over spicy food!  hahaha!  The restaurant was remodeled a few years ago and for the better!  The place can get loud if it gets busy, so keep that in mind if you're seeking a place to chat or have a romantic dinner.  I think their prices are a smidgen high for the amount of food you receive and it's quality.", "author": "Shaun W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Good food and nice view of the Castro theatre. The service was also good. The kitchen made me something that was not on the menu and the waiter checked on our party making sure everything was okay.", "author": "Joy H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "Average\n\nOrder by the number, don't expect dishes to be ready at the same time, food is luke warm, as well.\n\nSpicy sea fish curry, wasn't spicy at all, So nice place upstairs but not really worth going there again...", "author": "Ben B."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-24", "description": "One piece of beef in the pad see ew one piece of chicken in the pad thai. Appetizers were soggy. Other than that every thing else wasnt that good.", "author": "Buck T."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-15", "description": "Was wondering, why they are not busy as before?! Now, I know, very poor customer service, oh my God to say very poor its big deal, they are way more down under poor service. Try to contact restaurant , and ask to speak with manager....he's not here, not coming in today , maybe hell be in next year, its ridiculous...Went over Sat night, stuff was busy watching TV, I guess was theirs favorite show on, not caring about guests, we couldn't get next round of drinks, every time different person will take an order.....etc\n\n\nI WILL NEVER COME BACK, AND WILL ADVISE TO ALL MY FRIENDS TO PASS THIS RESTAURANT FROM NOW ON!!!!!!!", "author": "Emir L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-04", "description": "Good food, public $2 parking lot hidden across street. Food was all great Thai food, no complaints on serving size or quality.", "author": "Amanda P."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "I ate here about 6 months ago. I had the pad see yew! It was good, portion size was big, and I loved the ambiance- nice decor and candle lit tables :) The location is really centralized in the neighborhood and very reasonably priced for the quality of the food and the restaurant's appearance. I will gladly come here again if I'm in the area and hungry!", "author": "Shav S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "Very tasty Tum Yum kai and the  Thai waitress girls were friendly! You should give it a try and see...", "author": "Seth U."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-07", "description": "This place is so cute & the service is excellent. The food matches the service, it is fantastic. My favorites are the pineapple fried rice & the pad Thai. They even let me charge my phone.", "author": "Laura A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-16", "description": "4 years since I first came to Thailand Restaurant and it is still the best Thai food I have had. The food is beyond amazing, I've tried so many different things and have never been disappointed! This place beats every Thai place in the City by far. \n\nThe service is great, everyone is so nice and the food always gets out in a reasonable time. \n\nThe ambiance and location of this restaurant (and it's sister restaurant) are perfect, it's in a fun part of the city with so much going on. \n\nI take all my friends and visiting family here and everyone always has the best time and loves the food. Seriously, you cannot go wrong here.", "author": "Cara S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "I can't help but give this place five stars. \n\nSurprisingly good food? Check. \n\nAmazing window seat with a view of the Castro? Check\n\nAttentive service? Check\n\nTable of five hilarious bears comparing stories of sexual midadventures? Check. \n\nFucking perfect.", "author": "Mel H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-12", "description": "I LOVE this restaurant. I first came here because my friends recommended it and Thai food is our favorite girls night out meal. Thailand restaurant is a small restaurant with very friendly staff. \n\nMy favorite dishes include pinapple fried rice (comes in a pineapple!) and pad Thai or pad see yew(both good) and of course the fried bananas. \n\nIf I didn't live so far away I would eat here all the time. YUM!", "author": "Alyssa B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-24", "description": "I have had two varying experiences here.  One time I got a curry and pad thai and enjoyed it.  The other time I got a peanut sauce dish with chicken and spinach and was deeply underwhelmed by the runny quality of the sauce.  The prices are fine, but I don't know which direction my third direction will go - fine or mediocre.", "author": "Jeremy G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "Small & cute, pretty good menu , th bathroom is nice so is the staff and the interior design is lovely !", "author": "Ashana D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-19", "description": "Oh ill make you feel REAL GOOD baby..... That's what the stripper said before taking your money. Then you go \"that's it?\"\n\nI usually like this place for lunch, but what the heck happened today? I ordered the prik khing with pork and eggplant with chicken. I was imagining this would be so good, then when I opened the box, not bad. First bite. What is this? Cream of sum yung guy? It had enough oil and grease in both dishes to out do BP in the gulf. Thank god I have a box of cereal and milk in the fridge at work. Imma stick with my cornflakes like how I stick with my gfs. No more strip clubs for me I'm going to stay home from now on. Wait is this review for centerfolds?", "author": "Q L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-18", "description": "I ordered take-out from Thailand Restaurant via EAT 24. The food arrived and I gave the driver a cash tip. The next day, I was checking my bank account and discovered an additional $3 charge which I had not authorized. I called EAT 24 and they told me that the driver had called the restaurant and told them that \"the customer said to add a $3 tip to the bill\". Apparently, Thailand Restaurant uses a company called Sidecar to do its food deliveries. EAT 24 apologized and reimbursed me immediately. Thailand Restaurant has lost my business.", "author": "Cheryl L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-07", "description": "We went here for lunch... the food was cheap and was a good deal... but i felt like the dishes we ordered was kind of on the sweet side... not our taste... but i do like there pad thai tho!", "author": "Peter C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-10", "description": "As ambiguous as the name is, so is the food. I ordered the pad thai woon sen with chicken but about half of the protein was tofu. As a whole, I found the dish to flavorless and boring, very unlike other Thai I've experience. It also wasn't very filling, and I found myself hungry shortly after.", "author": "Andrew H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "Still Faboo! Our elderly friend Inge wanted to return here for those lamb chops. It was a special before. No longer anywhere on the menu. They still fixed it for us. \n\nThe neua yang came with a great dipping sauce. They actually had larb ped which was great and their pad kee mao which we got with chopped chicken tasted just right.\n\nService was great as always. Really great!", "author": "Nobbi L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-04", "description": "Was it something I said Thailand Restaurant? I thought we were doing so well... like really clicking, I mean I was going to take you to meet my parents, I just bought you that bracelet you'd been eyeing up. That hot night in Vegas. Did you think I was looking at other Thai food? Because if that's it baby it's just not true. Or is this like that chick movie and you're just not that into me?\n\nIf you aren't breaking up with me then why the hell did your delivery guy just tell me I live \"too far\" away and he couldn't come anymore? You didn't have a problem delivering all those other times. No no, I get it, it's just \"too hard\" now that we're not at that new 'butterflies' stage in the relationship. Jesus TR, did you think relationships weren't going to be a little work? My god, the googles says I'm only 2 miles away! You didn't think that a little effort would be required to keep things so exciting?\n\nSo all those other times you delivered were just flings I suppose and now you're done with me. Fine. Yes I feel used, and don't look at me that way. Did you really have to make my mango sticky rice all hard and gross too? I can take a hint OK, you don't have to give me shittier quality food to scare me off.\n\nI thought I loved you TR. I really did. But saying you won't come visit any more? How do you think that makes me feel? And giving me a crap dessert? I mean, can I even come visit you anymore? Or is that weird now?\n\nHow could you.. I still love you, but I think we should take some time apart.", "author": "Justin N."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-24", "description": "The food is decent, but the service is terrible and in our case was embarrassing since we brought friends. Had to flag them down to order then half the food came out half an hour after the rest then had to flag again to get the check. (Seriously a half hour went by before we had to resort to waving them down...)", "author": "Heather R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-21", "description": "Ordered the pad Thai, one of the most basic dishes on any Thai restaurant's menu. They wouldn't add spice to it, and the flavour was lack luster at best. I won't be coming back here.", "author": "Chris S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-30", "description": "I read the reviews for this place and was extremely skeptical but I really wanted Thai food and the pricing seemed decent so we gave it a try. The decor of this place is really strange, its obviously converted from an old apartment, because it looks like they just knocked down the walls, put in a bunch of tables and made it a restaurant. I ordered the yellow curry with chicken and the flavor was pretty good. However, the curry was extremely watery (which i dislike) but the portions are really big. My friend ordered the duck fried rice which was extremely flavorful and tasty but really oily at the same time.", "author": "Isabella L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "After seeing Al Pacino's documentary \"Wilde Salome\" at the Castro Theater, we were hungry!  I spotted this Thai restaurant before the show, so we headed over after.  We ordered our standard pad see ew (yumm! great taste, mmm!) and egg rolls (cut into bite-sized pieces, piping hot and tasty), plus a healthy glass of red wine.  Perfect!  Great location right across the street from the Theater, near Castro Muni.  We'll be back when we're in the area, and especially when we're catching a show.", "author": "Maile N."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-10", "description": "The worst Red curry I've ever had, very watery and without much taste, not spicy at all. Ordered red curry with duck and they were out of duck. Ordered some veggies with chicken and there was no chicken at all. Never will order from this place again!", "author": "Natalia M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-24", "description": "Holy Shit !!! After a long day of lols hanging at the Wharf and watching all the tourists walk into each other or ride their bikes into each other, I decided to hit up the Castro district for some noms. I walked around for a while as I was a bit unsure of what I really wanted to eat. One of those days you just say...fuck it...whatever sounds good.\n I walked by this place and noticed it looked a little sketch, since you have to walk up stairs like going into a rub n tug massage parlor. Not that I would know ha. I get up there and it's a quaint little room with great natural light coming through the bay windows. I was seated right next to the window and got to people watch everyone enjoying this hella nice day. I ordered the bbq chicken lunch special with soup combo. HOLY effin donkey balls batman...the sweet and sour soup was soo on point. I'll probably go back tonight just for that. Then out came the bbq chicken. I scarffed that down in about 5 mins...would have been shorter but I was trying to write a yelp review from my phone while eating it. The service was great, the atmosphere a plus...and my neighbors at the other tables convos were hilarious. I tried not to eaves drop but when people are talking about sparkle ponies and what their gay uncle is doing with his mistress...how can you not?! I will be hitting this place up as my go to for Thai from now on. Whoever didn't give this place a good rating...you're just being a staunch kunt.", "author": "Mr. Potato G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-07", "description": "Thai coconut Delicious \nService sometimes are great and not. \nIt's clean the bathroom and I like that , and fast service too. \nthe sometimes pretending don't know English ....(don't get fooled by that)", "author": "B H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Stumbled upon this little Thai restaurant yesterday with my boyfriend. We ordered from the lunch special, it was a little slow, lacked some ambiance, but our waitress was very nice. We are both vegan, which wasn't a problem at all, our waitress even had the kitchen whip up some vegetable soup the accompany our lunch. We had two of the curries, fried tofu, and a veggie version of the baby corn and mushrooms. Everything was very tasty! The tofu was fried to perfection. I will be hitting this place up again soon.", "author": "Sarah D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "The food from here is generally good, no disappointments after 6 or so deliveries, and I'm a finicky vegan.  They have a good Pad Thai, a basic item that every Thai Restaurant needs to get off the ground.  Their fried spring rolls are also better than most; they give seven little ones rather than three medium, which ends up being a better value per inch of spring roll.  (But they could be a little less stingy with the sauce.)  Other favorites of mine are the Gluten Pad Khing (seitan to you and me), Pad Ma Keau (eggplant) and the vegetarian Tom Yum soup.  \n\nI will be happy to give this place a better rating if they address certain menu deficiencies, to wit:  They have NO vegetarian yellow curry listed!  This is an outrage for a fan of Thai food.  They also have  pumpkin curry, recently added, but it does not provide a vegetarian option.  What are they thinking???  Part of the problem is that they have \"vegetarian\" sections to the menu, which is really unnecessary.  A vegetable entrees or ala carte  section sure, from which anyone can choose.  But vegetarian options ought to be offered on every appropriate item - where one also chooses beef or chicken, spicy or not, etc.  (And the vegetarian options should be \"tofu\" or \"vegetables only\", not just one or the other.)  \n\nYes, I could call and make the special request for these items - and forgo the convenience of the online ordering.  Or I could make the request in the notes section, but I've had less-than-stellar results with this restaurant and them not reading these notes.\n\nSome attention to those details would go a long way.  They might even find those items in the menu with different names and the exact same description.  It's the attention to detail that matters.", "author": "Ken R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-27", "description": "It was a really rainy day and my friends and I were really hungry and we happened to be in the area. My friend suggested this place so we went in.\n\nThe place has a very cozy feel to it, it looks like they converted a San Francisco skinny apartment into restaurant. They had music playing and a fish tank and all that jazz.\n\nThe food was once again, not so bad, and not so great, just kind of average. I ordered the pad-thai, which is what I ALWAYS end up getting because I usually don't order Thai food very often so don't know what else to get. and what's the most popular dish, pad-thai, so there you go, that's what I got.\n\nThe portions aren't so big for how much I paid. If anything, you're paying more for the atmosphere, which isn't so great either. There were a lot of people there for a weekday, which must mean something, but from what I tasted, I'm still searching for that \"something.\"", "author": "Aurora P."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-22", "description": "I had the most awful lunch here. I had to go down the street and buy myself another lunch, it was that bad.\n\nI ordered the Gai Ka Prow for lunch and it had the most funky ass smell. Not like the chicken had gone off - I wasn't worried about getting food poisoning but it was still nasty. I was like: what is that smell? Is it the fish sauce? Do they buy nasty fish sauce? Is it the bamboo shoot? They aren't supposed to be funky, are they? Etc. Finally after eating about a quarter of it, I left $10 on the table and ran out. \n\nI guess I could have sent it back, but really I just wanted to get out of there. There's something off about the whole room - parts of it are *beautiful* - there's all this gorgeous Victorian molding and a mantle, etc. But the walls are dark red with blue-white trim in a way that just doesn't go together. Likewise the modernist furniture clashes with the traditional setting. I don't know what's wrong here, but the energy is way off.\n\nThis restaurant has been around for a long time and I remember it being good but that was many years ago. It's all very sad.", "author": "Amy T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-08", "description": "The food here at Thailand Restaurant was fairly typical Thai fare, though the staff and service wasn't the best. Great for a quick bite at lunch, but probably not for a nice dinner. The food was excellent tasting however, and I would definitely go back if I lived in the area.\n\nNot the best Thai food I've had, but not the worst by far. Check it out if you're in the area for a quick lunch.", "author": "Ian M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-06", "description": "this was my first meal at Thailand Restaurant, but it won't be the last.  i was in the castro and starved at lunch time and really craved thai food.  i went upstairs toward the restaurant not really knowing what to expect, but i was very pleasantly surprised.  the place itself seemed very clean and nice.  not upscale, just really nice.  \n\ni had the 2 item lunch combo of green curry tofu and mixed veggies.  the presentation was unique and a bit fun.  the food was really delicious.  i should have specified that i wanted it really spicy because when it was served, it was only mildly spicy.  otherwise, it was just perfect.  \n\naside from the food, being able to look out the window beside my table and see the castro theatre and people bustling along castro street is something you really can't complain about :-)", "author": "Anjanette M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-18", "description": "Let me start by saying there is a woman there (the owner perhaps) that is probably the most RUDEST person I have ever had to deal with at a restaurant. \n\nI was there with a group of about 16 friends and we gave them pretty good business, one of us asked her for utensils since there was not enough for everybody, she said \"okay\". We order and the food came out and still no utensils, when I brought it to her attention she raised her voice at me and said \" You did not ask me for anything\" as she rolled her eyes. I can understand if she was really busy, but our party was their only customers at the time.\n\nThe food was generic, their curry most likely comes from canned curry paste. \n\nTHE BEST PART!\n\nTowards the end of our dinner, the same rude woman walks up to our table of 16 and raised her voice saying \" OKAY TIME TO COLLECT ALL THE MONEY\". . . . Keep in mind some of us are still eating desert. Is she for real ? ! \n\nShe waits for everybody to pay their share as she taps her feet and puts her hand out, I don't expect 5 star service, as long as there is some level of courtesy towards paying customers, this service is why none of us have any intentions on coming back.\n\nIn short, if you don't mind spending your money on horrible service and bad attitudes while you eat out then by all means, come here and get disrespected.", "author": "Hao N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Spent the day yesterday attending the centennial celebration of Charlie Chaplin's character, The Little Tramp, at the Castro Theater, across the street from Thailand Restaurant. After the second of three sections of the film program, we were starving, and ran across the street to have some Thai food. We didn't have much time and when we let our server know that, she was very accommodating. I had the Pad Thai (online the menu description is rice noodles with egg, bean sprouts, onions and ground peanuts on the top) and I added chicken. There were also crisp shredded carrots in my dish; it was a good- sized portion and tasted very fresh.  My friend ordered the Pad See Ew -- pan fried flat noodles with broccoli and egg in light black soy sauce. I tried a bite of hers and it was delicious too. We both had the Thai iced tea to drink, and we were also given ice water without having to ask. Our food was brought out very promptly. Our table had a great view of the street below and the beautiful Castro Theater across the street. One can tell that the restaurant was converted from an apartment, but I don't see that as a negative at all! It's a great space that gives a warm feeling. The restaurant got very busy after we arrived but our service didn't suffer. I'd eat here again without a second thought. Yummy food, great location, wonderful atmosphere, good service. Hard to beat that.", "author": "Kimberly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "Pad Thai, chicken yellow curry, eggplant... very decent. Fast service, good prices (especially the $5 cocktails). Almost walked into the bar below by mistake...", "author": "Maximillian M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-08", "description": "The food has been consistently fresh, flavorful and of the highest quality.  Having eaten at several Thai restaurants in SF, I can honestly say, that Thailand is my definite favorite.", "author": "DeeDee A."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-04", "description": "This is only for the service. I hate giving 1 star but come on.... if i have to get up and my friends have to get up to get our own water...and spices and bill...and boxes...and entreee.....and coke... dang.... food was yum but service needs work. the layout of the place hinders the staffs view of their clientele.... they are literally hidden away blocked by pillars and shieet... pardon me language. christmas dinner fail! and please don't come up to us for a 15% tip during our appetizer.... that's automatic! i have many friends in the service industry and know how it works.", "author": "Shenni C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "This Thai Restaurant is definitely great place to eat and catch up with friends.  I first went to this restaurant in the early 2000s and love it ever since.  The place is cozy and the waitresses are friendly. \n  \nEventhough it has changed ownership a couple years ago, I still love the place.  I come here whenver I can and I hope that you do too.\n\nIf you get the seatings next to the window on the left side, you can catch the historic Castro Theatre signage.  What more can one ask for on a cold foggy night in the Catro?  Great food and a glimpse history glowing across the street.\n\nhappy eating.", "author": "Truong P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "Came here yesterday for some spring rolls and duck curry. Everything was just average fare, although it's nice to look out your window and see the bustling Castro street. Service was decent, but the portions were way too small: the curry came in this shallow little bowl. If they bumped up the portions, I may return.\n\nIf you're looking for thai, I prefer the one on Castro and 19th (fair warning, it can be really busy).", "author": "Sylvia L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-20", "description": "This used to be my go-to place for thai food in the Castro but the quality has really gone down over the last 2 years.\n\nThe food used to be really good and the location can't be beat. Located right across from the Castro theater in surreal modern decorated former victorian flat it has a large menu with two pages of vegetarian options all at very reasonable prices. The most expensive dishes are around 12 dollars and most are under 10. \n\nThe sad thing is that quality of the food has really gone downhill. The last two time we went the food was lukewarm and the seafood and the tofu was rubbery. Both the stuffed shrimp and the tofu for the tofu satay tasted like it has been cooked and frozen and then just heated up again. Dishes that used to be really good were just average and some were down right not tasty at all.\n\nThe service has also gone downhill. There doesn't seem to be a lot of communication between the staff about who has just arrived, who is waiting to order and if people are still waiting for dishes.", "author": "DeathandFood H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "Some of the best Thai food I have had, delivered to the table fast. Service was great, too.", "author": "Olga K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-25", "description": "Food = great.  Good portions.  Great flavors.  Perfectly spicy.  The quality is very good on vegetables and seafood and meat.  The range of choices on the menu was great, for meat lovers, seafood lovers and vegetarians!  Yum.  \n\nI had their spicy flat noodles with shrimps.  My friend had the chicken curry.  We also tried their curry puff, which was delightfully crispy on the outside, and perfectly soft and delicious on the inside with great peanut sauce.  I had a veggie soup, which was perfectly sour with lemongrass.  \n\nService = great.  Very attentive.  Friendly.  Efficient.  \n\nPrices = very good for the great value of quality.  \n\nMinus is that parking in the Castro is non-existent.", "author": "Fannie S."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-29", "description": "I am a big fan of Thai food and this place was pretty lame :-(\n\nThe wait staff was not very attentive. No one came to greet us or take a drink order until we had been sitting down browsing the menu for almost 10 minutes. Then at the end of the meal, we had to ask for the bill after our finished plates sat stacked on our table for a while. Maybe it was because they were close to closing, but I was a server for a long time, and managed to give my last tables at closing good service while completing my sidework. \n\nThe decor and ambience was a bit strange as well. The lighting was turned down way too low...low enough that I was having trouble reading the menu and actually got up to turn the dimmer up myself. The walls are deep red and white and covered in over-sized dots, that looked like giant braille. It just seemed strange for a Thai restaurant. I could see how it would be a lot more appealing during the day.\n\nWe ordered the Tom Ka Goong (Shrimp Coconut Soup), Basil Shrimp, and Spicy Tofu Noodles. \n\nThe soup tasted pretty watered down and there was no kaffir lime leaf, galangal, ginger, cilantro or lemongrass...all traditional thai spices one would expect to flavor any decent Tom Ka soup! The rest of the dishes also lacked the traditional palate of Thai spices, making them mediocre at best. \n\nThe spicy dishes were only hot from the sliced raw jalapenos that were added. They did not even use Thai peppers/chilis. The shrimp tasted like pre-cooked frozen shrimp that had just been thawed and tossed into the wok last minute making them very bland. No searing of any kind could be seen on the shrimp or veggies. I have definitely made much more flavorful and authentic tasting Thai food at home just by using Thai curry paste and coconut milk!\n\nAnother disappointment was the lack of rice options.  Brown or Jasmine only, no sticky or coconut rice. \n\nIf I were only reviewing the food I would give Thailand Restaurant 2 stars since the food didn't necessarily taste horrible, but it paled in comparison to other Thai food I have had. The dissapointing food combined with the off-putting ambience and inattentive wait staff brings my rating down to one star.", "author": "Shannon P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-04", "description": "Just OK.  Nothing extravagant or super fancy (although they do have burgundy cloth napkins!).  Food is decent.  I like the soju drinks, although I've had better.  A solid choice for consistently decent food, drinks, and satisfactory service.  My recommendation: The Pad Thai (although note that even if you up-order the chicken, it will still come with tofu (for all of you out there with soy allergies).  Felt a little \"rushed\" by the staff who never asked us if we wanted dessert and never came to check on us after the bill was delivered.", "author": "R. Karl H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-05", "description": "Warning!!\n\nThis restaurant is DESPICABLE. I placed my order on their website at 8:15 and received a confirmation email.  After waiting an hour I called to check on the status of my order, however, the phone kept going to voice mail (which was full).  After calling over ten times (I wasn't sure at this point if I had been coned or what) I was fed up.  \n\nAfter gathering more patience, I called once more at 10 (the time they supposedly close) to see if they would finally pick up their phone so I could at least get a refund (yes they charged my card).   They finally picked up.  I spoke to a man who said I never placed an order.  I told him the email confirmation number (I think he wanted me to let it drop).  I persisted until he finally said they did get the order but not until just now (almost 2 hours later, I don't think so).  He said he would try to figure out how to refund my card and would call me back when he did.  I did not receive any call.  In fact, after finally getting a hold of the manger several days and calls later I was reassured by card would be credited (but it would take one week).  After several weeks of this game, seriously, I walked into the restaurant and demanded my money back.  They tried to insist that I wait one more week for the transaction to go through; I told them no.  I had waited weeks (5) at this point.  I told them I would be standing there until I got my money back for the food I never received! I walked out with my money and will never, ever be ordering from this place again.  \n\nBonus bad points for calling me a liar after not delivering my food.  I always enjoy being yelled at on an empty stomach.", "author": "Elizabeth R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "I haven't been to this restaurant since the 80's and it was fantastic back then.  Well, I'm happy to report that it's still fantastic!\n\nThe Chicken Satay was incredible!  It was perfectly bbq'd and had a fantastic peanut sauce.  However, I've always loved their cucumber side.   I only wish that it was a bigger portion because it's that good!\n\nThe Penang Curry with shrimp was incredible.  The sauce included peas, carrots and was perfect.  Not spicy and definitely not bland.  A necessary dish for any Thai food excursion.\n\nThe most surprising dish was the Spinach and Tofu in Peanut Sauce and it was the bomb!   The spinach was cooked to green perfection and is the perfect compliment to the peanut sauce.  However, the tofu takes the cake here.  In virtually every other Thai restaurant, they use smooth tofu.  However, here, they use a very thin deep friend tofu and is coated with peanuts.  Wow!  The tofu was not greasy at all and provided that contrasting texture to the peanut sauce and spinach that makes this a signature dish for the Thailand Restaurant.\n\nLastly, who can resist a fine glass of Thai Iced Tea!  \n\nThe ambiance is excellent.  It looks like they added an interesting brail wall paper that gives the restaurant a very modern feeling.  The modern furniture and lighting are a nice contrast to the formality of the Victorian wood work.  Anways, it's very romantic and you can see the Castro Theater just outside the window.  \n\nI have to say that I find this to be the best Thai restaurant in the Castro after all.  Like most Thai restaurants, it's not the cheapest food option, but it's completely worth the price.  The service was fast, friendly and excellent too.", "author": "Dougg K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-11", "description": "The food was alright, but nothing notable.  The service was pretty bad though.  The waiter had no personality, and he never came by to fill our water glasses or to ask how the food was.  A side of peanut sauce cost $3 and it was only enough to dip 2-3 pieces of tofu in.  If you're going to give so little of something that costs you nothing, then at least charge $1-1.50, not $3.  Rip-off.  Oh, and the music was terrible.  They literally played music you'd find on a Disney soundtrack...", "author": "Jacob A."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-25", "description": "3.5 stars since the dinner was... \n1. Fast\n2. well portioned \n3. reasonably priced\n\nThe restaurant is clean ane the service is ok. It is a very tiny former apartment turned into a restaurant type of setting!  The window seats are good for looking at the Castro's traffic and activity and the goldfish aquarium and the waterfall are also eye pleasing. The water just keeps on coming with ice cubes with lemon slices and this place has much more ambiance than other places! The interior decoration and setting are wonderful like the square places, drinking glasses, burgundy cloth napkins and even the silverware.", "author": "R C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-20", "description": "BEWARE!!! This place will seriously rip you off!! They are clearly DESPERATE in an attempt to salvage a failing business. Seven friends and I went for dinner..:the check arrived and the total was $366.00. Upon further review and analysis we realized that they attempted to scam us; for in actuality the bill should have only been $210.00. All the staff could do was say sorry. Clearly they were trying to pull a fast one! Very sad for the food is good BUT we will not return!!! This WAS NOT an honest mistake!!", "author": "Todd J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "This review is only for delivery, so for the food itself and the delivery.  I'd put this at 3.5 stars, but the delivery was extremely fast (about 20 min even though website said 45-60) so thanks for that.\n\nTom Yum Goong - different than most I've had in the states, but one of the best ones I'd say.  It's extremely rich/deep for a tom yum, so maybe they'd been steeping this batch of broth longer or with more shrimp heads/shells in it.  Could have used a few more shrimp in the actual dish, but there were tons of mushrooms.  We ordered it \"Spicy\" and it was extremely spicy - of which we are huge fans.  From the other yelp reviews (and perhaps obviously) it would seem that the level of spice you get is based on who's cooking that dish, so I guess we lucked out.  Will definitely be getting this again.\n\nPapaya salad - also spicy, but not very memorable on the whole.  There was nothing particularly wrong with it, I suppose the papaya was a little flavorless, but all in all nothing great.  I'd probably get it again to give it another try (or to fill out the minimum order if we get delivery) but I wouldn't go out of my way for it.\n\nBeef salad - unfortunately a big strike on the evening.  The meat tasted a bit... leathery, so perhaps it was just on the older side.  Which is not how I prefer my perishables.  Very gritty, and not flavorful (other than the leather, as above).  Also, while normally I'd be thrilled to get such a high meat-to-greenery ratio, with this meat I kinda wanted some more vegetables in the dish just to have something else.\n\nSo again, 3.5 for the food, + 0.5 for prompt delivery - get the soup, avoid the beef salad.", "author": "Jake D."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "An hour and 50 minutes for delivery? You have to be kidding me? When I called they didn't even care.", "author": "Brad W."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-03", "description": "I think this is one of the best Thai restaurants in SF. The food is consistently well prepared, tasty, and attractive. The staff is sincere and friendly.", "author": "Daniel K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-12", "description": "After spending time shopping with girls gang today, we decided to go to this restaurant  to get some appetizers. First, I would say I normally don't go out for Thai food, cuz I am Thai and I love to cook my own Thai food at home when i have time. However, i was glad that i went to this one.\n\nWe ordered such as\nTod Mun : fish cakes, were really good.\nSom Tum: Papaya salad: hell yeahhh I totally would come back for this dish! \nSea food salad: as good as it get! \nand Thai iced tea with boba( tapioca balls) Yum!\n\nThe service was great too.", "author": "Sasitorn O."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-23", "description": "Came here prior to catching a flick at the Castro Theater for the SFIAAFF, which is right across the street.\n\nThis place is pretty yum and is a prime spot for a date if you are going to watch a movie across the street at the Castro theater.  How do I know this?...because I went on a bromance date with one of my cohortian colleagues from school to watch a movie during the Asian American film fest.\n\nWe caught a 4pm show of the movie The Message, which was a very dope mystery movie that we caught at the Castro Theater.  Before that we grabbed lunch at this spot and ordered some tasty tom yum soup.  We sat next to the window, which had a dope view of the street.  The interior decor is pretty cool too.  So if you wanna kill two birds with one stone do the thai restaurant and movie at the castro combo and you can't go wrong.", "author": "Mark L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "My favorite everyday style restaurant in SF. Really delicious, flavory, big portions and good prices (for SF). Service is also good what is unbelievable for SF middle rated eatery, all other restaurants around are really rude here", "author": "Iv S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "$10 will get you a good amount of food for lunch.  They have special lunch deals.  I believe for under $9 you can get 2 items with rice and tom yum soup.  How cheap can this place be?  The service is great, the food is good.  What more do you want?  I came here a few times for lunch.  The place is quite small, atmosphere is nice and bright.  They also serve tapioca if you are interested.  Make sure you request for tapioca in your thai ice tea if you prefer to chew and drink at the same time :)", "author": "Mimi S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-07", "description": "There is an abundance of Thai restaurants around the Bay Area , same goes for San Francisco. In the Castro alone i believe there are three. But i found this quaint little restaurant very inviting because of its location just across from the historic Castro Theater. The place has been remodelled about 3 times since i first dined here. The place is very clean and casual ( i always get a window seat whenever i come here for lunch so i get a view of the bustling castro crowd. A very wide selection of familiar Thai cuisine served in generous portions. Very presentable plating presentations, the staff are very friendly and attentive. One of my favorites is the crispy shrimp roll with a sweet and sour dipping sauce( you can choose a different type of sauce if you so wish). Curry for which thailand is famous for are scrumptious and creamy, available in white, red or green curry sauce. Reminded me of the time i went to Phuket Thailand to receive my award as a presidents club awardee for Fuji Xerox. The taste is very authentically Thai!\n\nStreet parking, the place was never crowded everytime i come here(but will probably depend if there is an event close  by).", "author": "lenra a."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "There's not that many Thai restaurants in the area (or in the Mission district) so I decided to try this spot.  Parking could be tough but I know public transportation is just a hop, skip, and jump away.\nAnyhow, the food wan't anything to brag about.  It's decent and priced okay.", "author": "Ricky M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-04", "description": "Ok, so this review is more about nostalgia than about anything current: food, atmosphere, service.\n\nI am giving Thailand Restaurant 5 stars solely because it was the restaurant my husband took me to on our first date. He'd never had Thai food before but on the recommendation of a sibling and from seeing it while sightseeing in SF he decided to bring me here. \n\nHe now loves Thai food, and well, me!\n\nI can't remember what we ate or how the service was, but I do remember falling in love.\n\nThanks, Thailand Restaurant!", "author": "Mary P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "One of my favorite Thai places in SF! There are a couple of things that I love about this place. For instance, the decor is a fusion of art deco with a Thai twist to it. Also, it's right on Castro street and has a great view of the district. Their lunch special is reasonable for San Francisco prices. This is a place where the locals go and grab a quick bite and unwind. I recommend going for their lunch-combo special, you can't beat all that food for ten bucks.", "author": "Joseph P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "Delicious. Convenient location. The decor is very clean and modern. My only gripe is that I wished they were more generous with the ingredients. The chicken in the yellow curry was a bit skimpy. Overall it was good and I'd go back. \n\nShot out to Justin N. Your review is probably one of my favorite reviews on yelp.", "author": "Kelly M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-29", "description": "First place we ate at as we settled into San Fran.  Delicious basil fried rice and the pumpkin chicken curry was beyond delicious!  The spicy green beans with tofu was also very flavorful.  Would definitely eat there again.", "author": "Kameron H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-13", "description": "I'm reviewing the delivery here...which may be different from the restaurant menu.  Good standby delivery place - they're usually quick. \n\nThe food is ok. It's nothing spectacular, but it does the trick for thai delivery. My main complaint about the food is that it's usually soooooooo salty, like make sure you have lots of water salty...or feel dehydrated after you eat it salty.  \n\nMy fav dish is the pineapple fried rice - it has chicken and shrimp, and a great flavor. It's goes really well with curry too. \n\nIf you live in the Castro/Twin Peaks area- this place is pretty solid delivery.", "author": "Lauren F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "I know I give a lot of good ratings, but I think I have been lucky with the establishments I have visited.\n\nI came here with a friend on a whim, and I'll be honest, pleasantly shocked. At first, we didn't know what we were getting ourselves into, but once we got upstairs and got a table at the window (looking down on Castro) and got to eat some tasty food. They have a vegetarian section too (great for me!). My friend got the pumpkin curry and it looked and smelled delicious. I got this soup, it was good, but I think I tasted soap on the spoon - which kind of bothered me, but not a showstopper.\n\nEither way, have plans on going back", "author": "Leslie T."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-04", "description": "This place is pretty good. I ordered the Panang Curry lunch special. It came with rice and salad....only 7 bucks! \n\nI will be coming here more often :)", "author": "Nene D."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "I have always loved this place since the first time that I went like I think almost ten years ago !   My last bf and I use to come to SF from OC since 1998 until 2007 when he moved to England, and I remember coming here at least once every visit. \nThen I moved here in 2007 and have been going religiously !   \nI did love it more when it was all comfy and homelike until 2009 when they changed it to modern whatev with bumpy walls...  but oh well - the Staff has always been super nice to me and always remembers me ! and tries to give me the best spot =   which of course is by the window. But the main things are that the food is good and the prices are reasonable !!!\n\nAnd you can't forget that the bars are just below you cause it's on the second floor !", "author": "Robert F."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "Very tasty pumpkin curry with duck, the BBQ pork was also delicious, combined with a side order of excellent brown rice. The service was attentive and everyone was welcoming. If you are looking for Thai food in the Castro you will definitely want to come here.", "author": "Bill B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-25", "description": "I've been eating here, in house and delivery for years. The food is very good, but from now on I'll seek my Thai food elsewhere. I ordered food at 7:30pm, and live four blocks from the restaurant. After an hour, I called and was told my food was on the way. Half an hour later, I called to cancel the order and was told that they refused to do it because the food (which I am sure is cold) had already left. It's now been over an hour and a half and there is no sign of thus food.", "author": "Trixie R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "I would not have known that this place with upstairs, if I had not be really hyper vigilante as I looked for a restaurant to eat at.\n\nThe only thing that I did not like when I went was they waitstaff did not tell that loud women to get off her cell phone.  It was disturbing to try to eat a nice meal that was so delicious w/o someone yelling into their cell phone.\n\nIn any case, I love this place.   For an appetizer I had  the delicious and crunchy  Thailand Rolls (Spring Rolls).  Most are to greasy, but these were just right.  For a main dish I had the  Pad Thai.  I know it is a basic and standard dish, but I love Pad Thai.  For desert I had the \nFried Banana with Honey.  Yummy and I was in heaven.\n\nI love this place and they have take out as well.", "author": "Vanilla C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-06", "description": "I've been here many times over the years and the food has been consistently pretty good.  It's a nice place for a casual Thai dinner and reasonable prices. The portions are not huge but neither are the prices. The staff are quite friendly and attentive and keep the restaurant pretty clean. They also offer take out food that is prepared quickly after phoning in your order and ready for pick up (believe they offer delivery but it's quicker for me to walk over and get it myself).", "author": "Kent W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-18", "description": "Decent food with a great view at fair prices...\n\nThe service can be a little lackluster...", "author": "Nathan W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-25", "description": "Normally the food is pretty good and of consistent quality, which is why we decided to have dinner here after catching \"Nine\" at the Castro Theatre on Christmas Day. But unfortunately the food was even more mediocre than the film. Half way through the meal I asked my husband if he thought the food was as bad as I thought it was and he nodded his head.\n\nThe Pla Saam Ros (Three Taste Fish), was more like One Taste Fish, so downed in sweet sauce as to hide the fact it was way overcooked and  rubbery. The Pad Ga Praw (Spicy Basil) with pork instead of chicken seemed stale to the taste, reminding me of week-old left overs. The disappointing meal was made complete with dried out brown rice and watered down Thai Ice Teas. \n\nWe frequent many Thai restaurants here and on the peninsula and this is the worst we've had in some time. Perhaps they had a substitute chef that night... or they served us microwaved leftovers from the previous night. Whatever the case we won't be back at least for a while.", "author": "Elvis M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-20", "description": "I recently discovered this place a few months ago and have been here several times since then. It has good food, it is reasonably priced, and not usually crowded. You might miss it if you are walking along Castro as it is above a bar or a store or something. It is definitely worth a try. The only reason it did not get a better mark from me is that the service is sometimes spotty.", "author": "Chris D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-24", "description": "What? No Sticky Rice? Any Thai restaurant that doesn't serve sticky rice will automatically get 3 stars from me. \n\nOther than that, the food was fine. The red curry was good (served tongue scoldingly hot) and only $6.95 with jasmine rice and a very non-Thai iceberg salad. It was a decent cheap lunch and I'd be willing to go back to try some other entrees. \n\nThe upstairs location is cute and it's cool if you can get one of the two tables with a view over Castro St. The server was very nice with a flirtatious smile.", "author": "Rex D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-01", "description": "I like the food but this restaurant had two problems that will keep me from coming back again.  1st problem, the wait staff barely understands English and trying to order can be difficult.  Plus, for the second time eating there, we were brought food we did not order.  The first time, I asked for a cup of soup, the waitress kept saying bowl, I kept saying \"CUP\" (no I didn't yell but wanted to).  Anyway, they brought me a cup but later in the meal they brought a bowl.  I explained to the person bringing the bowl that I ordered a cup and had already ate it but (as I said earlier) he didn't understand my English and looked confused.  He did take away the bowl.  Then the bill came (PROBLEM NUMBER 2) which is written in Thai (I'm guessing it was Thai since I don't speak or read Thai) and they charged me for a bowl (I only knew this when I asked them to interpret the bill for me).\nSo to make this short, same thing happened yesterday only this time my partner ordered a salmon item but then the server explained the \"specials\" and my partner changed his order, and made sure the waiter understood (at least we thought he did).  Guess what?  Both the special and the salmon dish was ordered and when we asked why the waiter pointed at me and said I wanted it!!!! I ordered a soft shell crab dish and pointed out what I wanted to him on the menu so I have NO idea how I became the guilty party. \nAny way even though I like the food, NEVER AGAIN.  They need to give me a bill in English so I know I am paying for what I ordered and they need to get the waiters into ESL so that they can take orders in English and understand what the customers are saying.  Too bad, as I said I like the food.  The soft shell crab was delicious!", "author": "Gary C."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-22", "description": "Great Tom Kah soup! LOVE their brown rice...I mean LOVE! I had the cashew nut chicken and my friend had the beef. They were both good...I think I prefer the beef. The hot tea was so good and the people are nice.", "author": "Kellie N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-14", "description": "OK,\nSo, I had to get a quick bite with my daughter before a school assembly-no time to go home. The food was light and delicious! I am a huge fan of cold rolls and these were quite unique-stuffed with shrimp, Chinese sausage,bean sprouts,bits of fried tofu all wrapped in wide rice noodles. We shared a plate of pad Thai that was killer-extremely intense flavor, yet not overloaded.\nI ordered the sirloin BBQ beef with a spicy lime sauce for my famished husband to quaff before the assembly-which exuded a smoky, grilled flavor and jived very well with the piquant dip.\nGreat service, yet not hovering. This would make a great date restaurant-especially if one stops here before a movie across the street...\nAll in all, an elegant respite (crimson walls ,serene decor) with great views of the grand Castro Theater and the throng of passersby.", "author": "Antoinette S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-06", "description": "Really yummy and consistently good food! Got the fried tofu and fresh spring rolls appetizers...SO good! The tamarind and sweet & sour sauces are to die for.\n\nI've had the Pad See Ew and pineapple fried rice...both super delicious and fresh. Not oily, greasy, or too salty like other places.\n\nAn awesome spot to go before hitting the bar!", "author": "Alan H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-20", "description": "They get points for not screwing around with the name, calling it like it is. Why call a restaurant by anything other than what it really is?  Plus, they have a cool neon sign, of which we need to see more use of outside the Castro because neon anything rocks. Though the awesome sign is what attracted me to it, you can't judge a book by it's cover, so we strolled through the door, up the stairs, and into what looked like someone's livingroom.\n\nThe Pad Thai was pretty flavorful and sweet, not dry at all, served with prawns and tofu. I really like my Pad Thai wet, versus the dry-style you sometimes get, and they served it right in between. The chicken was served in three thin cutlets, cooked well with the oh-so-crucial grill marks and served with a sweet & spicy sauce that was very good. The chicken itself was okay, but the accompanying sauce made it better. So much so, that we asked for an extra side of the sauce and really laid it on thick.\n\nCheck out my in-depth feature with photos on my blog, link on profile.", "author": "Gene M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-12", "description": "Thailand Restaurant foregoes a clever moniker to deliver delicious versions of your favorite Thai dishes, inexpensively. Literally, they deliver the goods to our door, faster than I can pronounce the exotic / geographic names of other places.\n\nMy first visit here was quite by accident. Due to my logistical errors, a number of Zukos and Pink Ladies were no-show for Sing-A-Long Grease at the Castro. The one Pink Lady who did make it walked all the way from his home. Lacking our chorus, we aborted the mission (Rizzo!) and headed across the street for Thai.\n\nWe had a delightful dinner upstairs in the cozy, verdant dining room. This meatatarian (tm Kevin S.) opted for some vegan tofu dishes on recommendation from my dining companion. Both were fantastic, with the tofu cooked perfectly - slightly crispy on the outside, soft and melty on the inside. Delicious with the brown rice they offer. We dined and gossiped about fashion, relationships, Yelp drama and Bravo TV.\n\nSo I had a first date with a man...and it was way less gay than my initial plans.", "author": "Andy R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-16", "description": "I've been to many Thai restaurants, and this one has a great clean place. I had high expectations since the ambiance of the place is nice and quaint. The dishes and glasses are very Crate and Barrel. There's candles and low light lamps. Pretty romantic. The food has great presentation, however there was two of us-the portions are like maybe a small child. I'm telling you the portions are SMALL! I felt like the meal we ordered was a appetizer! The bill was high, and 2 cokes was $6.00! I'd advise you to only come here if you have a meeting and need light snacks. T", "author": "Marie P."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "Had a very pleasant meal here. Crisp tasty angel wings. Papaya salad for my wife which she ordered not spicy and it was still really full of flavor. I had the tom ka gai and it was just what my upset stomach craved. Then back across to the Castro for more of the Jewish Film Festival.", "author": "Marco M."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-24", "description": "I reviewed this restaurant under a duplicate entry with only two reviews. Oops, but there's no real way to alert Yelp to get the duplicate out of here. I was just about to say... everyone and their mother seems to have eaten here, but... only one review?\n\nIt's Thai food, typical yet iconic. The basil-infused dishes just keep making me return for more, and the clay pot specials are great comfort food any month of the year. Of the Castro Thai restaurants, this is the one I have frequented the most.\n\nThis restaurant certainly is not handicap accessible, occupying the second floor of the building, so just keep that in mind in the uncommon case that your dinner mates cannot climb stairs (which included me for a few months in 2004!). The restaurant is NOT good for kids, unless your kids are ok with gay guys talking about how big their dicks are while your family munches on satay.", "author": "Daniel C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "An upstairs spot with a view of the Castro theater and a lovely thumping feeling that is the bar on the ground floor. Food was good, not great. Service was acceptable, not exceptional. Vibe was right.", "author": "Will R."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "This is my favorite Thai restaurant.  I first discovered this gem while visiting sf for a friend art showing in the neighborhood winter '08.  It was love at first bite.  I've yet to find a better Pad See Eiw. \n\nJust about every visit to the city since then has included a stop at Thailand Restaurant.\n\nI moved to bay area this summer and have shared my love for this place with all of my friends.  \n\nGreat food.  Warm atmosphere.  Good prices.", "author": "Nicole T."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "My favorite Thai restaurant in San Francisco, which was a surprise given the unoriginal name.  For whatever it's worth, I've traveled extensively throughout Thailand, and I feel I have a good understanding of what makes a good Thai dish.  Luckily, so do they.", "author": "Ryan S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-19", "description": "This is the only Thai restaurant in the US I can go to right after coming home from Thailand with no complaints!  The food is great, authentic and fresh.  If you want Thai-hot, you can get it here.\n\nPeople watching on Castro is a bonus.  Get a window seat if you can.", "author": "Nadine J."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-09", "description": "Walked in looking for fast take out.  Didn't have very high expectations, but was pleasantly surprised.   It's basically your average hole in the wall (it's in the Castro, but that's not literal) Thai restaurant.  Worn out, but kind of cozy.  I can't comment on the dining room service, but whenever we go in to order take out everyone is extremely friendly and they always bring us hot tea or glasses or iced lemon water while we look at the menu.  How nice is that??  \n\nThe Gai Him Ma Pan (cashew chicken) was our \"safe\" order and was really good.  The captain says that the Pad Talay (spicy seafood) is possibly better than what he gets at Pad Thai in the mission.   The Pa Nang curry is also great.", "author": "P J."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-09-19", "description": "Awful. Ruined my romantic date. So you advertise as vegetarian on your sign, and you have a large vegetarian section in your menu; why the hell do you put fish sauce in my god damn vegetarian soup. \nI will never ever go back to this place. Nor should you.\nAwful.\n\nP.S. The rest of the food sucked too. Barf.", "author": "Rory V."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "This place is totally solid.\nThe decor is nicely modern, with braille-inspired wall treatment (nipples with your food, anyone?) and water features near the restrooms (mmm who doesn't love water sports over rice?).\nThe food is fantastic, perhaps the best Thai in the Central flatlands. I haven't had one of the appetizers that is anything but fried perfection; as usual, they are not the healthiest part of the meal but are worth the calories every now and then (try the curry puffs, they are delectable). Curries are medium-spicy and rich, but strongly curried and bound to impress. Noodles a little greasy but bursting with flavor --- their Pad See Eew is fabulous as a main dish. The pineapple fried rice is served in a hollowed out pineapple half, great if you want the coolest dish at the table. Two thumbs up!", "author": "Jay A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-08", "description": "I'm behind on my reviews.  \n\nI've been bookmarking and then forgetting about them.\n\nThe dr. and I found ourselves on his couch one Sunday evening lamenting our angry empty bellies.\n\n\"We haven't eaten since 10:30AM!!\"\n\n\"I know!  Wtf?!\"\n\n\"So hungry.\"\n\n\"Totally.\"\n\n\"Totally.\"\n\nI think we talked about how hungry we were for an hour before it dawned on us that food was not going to magically appear so we put on shoes and made our way to Thailand Restaurant, mainly because it was across the street from  naia and we both anticipated gelato in our future.\n\nBut the minute we sat down and the ordering began, it didn't stop.  Thai Veggie Samosas.  Veggie Thom Kha soup.  Tofu Praram. Pad Kee Mao.\n\nAnd tea.  For me.  (it was cold)\n\nWe sat as our blood sugar dropped well below normal.  I stuffed a samosa into my mouth the moment they landed on the table.\n\nMmmmmmmm.\n\nThe soup was excellent (again, i was cold) and I've always had a special place in my heart for thom kha in all its coconutty glory.\n\nThe tofu praram was good, but the peanut sauce seemed a bit sweet and  could be overwhleming if not combated with a gigantic forkful of rice.  The pad kee mao was a reliable standby.  Give me a plate of fat noodles anyday and I will lick it clean.\n\nExcept after a day of shrunken stomaches and a 3 course meal, there was no way I could lick anything clean after dinner.\n\nSo we left the Castro sans naia gelato.\n\nSo Thailand Restaurant?  I'd hit it.  Again.", "author": "Jen I."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-05", "description": "Upstairs Thai.  For the longest time that is what I thought the name of the restaurant was.  Ooops.  Oh well.  I still refer it as such, and probably will continue to do so forever.  \n\nWe had dinner here last night, and I have to say the food was great.  Three of us were meat eaters, and one vegetarian.  I've been here for both lunch and dinner, and this last visit has by far been the best.  Before last night, I would have considered \"Upstairs Thai\" average at best.  Perhaps they've changed cooks?  \n\nLast night we had the Beef Salad, Tofu Satay, Vegetarian Green Curry, Red Curry Chicken, Spicy Eggplant, and Pad See You with Beef.  All very delicious.  Pad See You with Beef has to be one of my favorite Thai dishes anywhere, this one did not fail in comparison.  It was surprisingly good.  With the addition of some crushed peanuts and dried chili flakes it was ON HIT!  \n\nFor right now, \"Upstairs Thai\" gets three stars, per my previous experiences here.  However, we will return, and hopefully the improvement stays consistent, therefore deserving of four.  MMMmmm, Pad See You, I'm coming for YOU!", "author": "Kelly K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-20", "description": "Here I am, stuck at a crossroads. I've only been to this restaurant twice. The first time was a great experience, a small,  upstairs Thai restaurant with a decent look-down view on Castro, with the theatre's red neon glowing in your face if you're lucky enough to be seated at the window. (But only if you're in a party of two, it's all that fits in the window nook) The food was great.\n\nFast-forward to visit number 2. Same nook. Same table. Same neon. Same service. Different results. I had a stomach-ache that caused me to pray to the porcelain toilet god, ass-down. \n\nSo, what is one to do? Can I blame the restaurant for my body malfunction? Was my sickness a fluke? Or, perhaps, my body's positive reaction on visit #1 was just a fluke? \n\nEither way, with an over-abundance of Thai places in the city, I don't think I'll be going back to see which one was a fluke. But I'll give the place credit for its view, service and visit #1.", "author": "Bryan B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-25", "description": "Curry puffs were fun and flavorful. Shrimp wantons were uninspiring but fine. Chix Praw was also good enough...I enjoyed it, but it didn't elicit any exclamations. Not speedy delivery. Full restaurant size servings. I'd eat/ order from here again.", "author": "Mathew S."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-09", "description": "Blecko.\n\nMonday lunch, red curry.\n\nI knew I was in trouble when the server said, \"Jose, I need a #3...\"", "author": "Peter A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-10", "description": "This is probably my favorite Thai restaurant in the Bay Area.\n\nIn fact, yesterday I went there for lunch (their lunch specials, $6-8, are a good deal and it's not crowded during the weekdays) and got red curry tofu and Thai coffee, which was good. But today for dinner, I was with a friend and somehow I found myself saying \"I ate at Thailand Restaurant yesterday, _but I'll go there again_\" (see what I mean?), to which he said something to the effect of \"Yeah, that place is really good.\" So I found myself eating there for the second day in a row. We both got pad see ew. I got the vegetarian version, and the tofu was perfectly pan-fried: crispy yet soft on the inside. Amazing. (I just bumped up my rating to a full 5-stars, which I don't do often.)\n\nI remember that their pineapple fried rice is great, too. I'm looking forward to getting that next time. Perhaps it'll be tomorrow.", "author": "John C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "great hours.  good food.  good service.  good prices.\n\nthe seasoning here is subtle and complete.  \n\nstrange thing to say, but too many thai places beat you over the head with some sweat curry flavor and you miss out on the complex and rich tones of the fish, the duck, or basil, or sprouts, or onion, or cucumber.  these things have their own flavors.  it's not all about the sauce.\n\nthe view from the window is really enjoyable, too.  :)", "author": "Peter K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-25", "description": "Tasty, affordable and friendly Thai service. I like coming here, especially if I've been drinking all day, and need something to suck up all the liquor in me. The other night our group of 6 stumbled in, and got a table in 3 minutes. I love how they are specific on the wait time. We ordered family style, and shared green/yellow curry, pork/broccoli, pad see eww, and a seafood/rice noodle dish. Everything was tasty. The service they give is also top notch, they are attentive, friendly, and apologetic, even for a slight delay in dishes coming out. Prices are VERY affordable, so you can give them extra tip for giving you great service. Keep it up..", "author": "Thomas L."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-18", "description": "The sloooooooooowest service with mediocre food.  So mediocre I don't even remember what I ordered.", "author": "Michelle C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-29", "description": "Yet another purple walled Thai restaurant, it's located up a flight of stairs with the dining area above Castro Street.  The food is very good.  (Try the curry puffs as an appetizer.)  The dishes are well-presented, yet the food manages to fill the plate.  Service was delightful and attentive.  They offer free delivery with a $16 minimum (such an odd number for delivery).  \r\n\r\nIf you're looking for Thai food in the Castro with less of a fast-food atmosphere, skip Thai House Express down the street and come here.", "author": "Marsha Z."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-15", "description": "Service is fast and friendly, green papaya salad and soups are good, but don't get the crab-stuffed butterfly shrimp.  Tasteless.\n\nNot the best Thai restaurant in the city but it'll do when you're in the Castro and need food fast.", "author": "Asteridae A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "I love the coconut chicken soup.. and pretty much everything else I've ever had. Service is great and I love the atmosphere", "author": "Ryan G."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-06", "description": "I love this place. The owner is super nice and have been good friends of a couple of my friends and we're always treated with such great service, respect, and warmth. I love the decor, the location, and the food. It's a great place to eat before a night on the town. Just be wary of your surroundings of the Castro isn't your scene.", "author": "Rosavida C."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-23", "description": "yuck!  The tofu satay was so weird, the texture of the tofu was doughy, chewy and marshmellow like. It was a texture I never knew possible.  I also had the fresh spring rolls which had a fake meat that had a flavor unlike anything I've ever had before and would like never to have again.  And lastly the pad thai was all stuck together, also strangely flavored and all in all, one of the worst pad thai's i've ever had.  SO sad to have been so grossed out by my meal.  Just wanted to write this as a heads up for the vegetarians out there, if you eat here, steer clear of these items.  Yuck!", "author": "Priscilla L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-28", "description": "My husband and I are huge fans of the fried rice.  Something about it is very addictive.  Lots of vegetables, lots of meat/tofu, they don't skimp on anything!  Worth it just to get the rice on a lunch break.  The curries are always good, especially the vegetable ones (again, they don't skimp! You get what you pay for), and the soups are wonderful!  Especially the tom yum - perfect sour savoriness.  Also, when it's available, the pumpkin curry is amazing!  And of course the iced tea.  It's a very mellow environment inside the restaurant within the bustling Castro... it's upstairs, so it's quiet, and the mood and the people are nice.  They were thoughtful to me when I came in to get takeout while carrying a baby - one of the chefs or waiters came from the back to help me get the food safely in my backpack since I was struggling with balancing my sleeping baby.  VERY thoughtful (I left a big tip!).  They sometimes decorate for holidays (I saw cool spiderwebs and fake spiders for Halloween, and I think lights during Christmas), which is fun.\n\nThe food is expensive, but what do you expect?  It's the Castro, and it's awesome Thai food, and it's totally worth it!", "author": "Yvea E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "After an evening out in Castro my wife and I ended up here. It's been a while since our visit, but from what I can remember the food was good and cheap and the service was quick (no wait on a weekend night). Plus they were open late - another big plus.\n\nThe only downside that I can remember was that they didn't have a full liquor license: We were in the mood for cocktails but they could only serve  beer or wine. :(", "author": "Antti K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "REMODELING DISASTER!!!!!\n\nI've gone to this restaurant 4-5 times and I recently went for lunch.  I had a hard time concentrating on the food because of the interior of the restaurant.\n\nThe restaurant has been changed from a cozy, softly lit place great for a little intimate dinner into a sort of retro-70s futuristic cafeteria-in-the-asylum-for-the-criminally-insane look.  It's HORRIBLE.\n\nEverything is white white white bright white -- the walls, the chairs, etc.  I've never been in a restaurant where the interior distracted me so from the dining experience.\n\nIf you like eating and feeling like you're sitting under klieg lights, go here.\n\nUPDATE: I also went here for dinner.  For dinner the restaurant actually looks pretty cool.  DO NOT go here in the daytime unless you want go insane.  Maybe the restaurant was taken over by a vampire?\n\nUPDATE2: The awful sheer whiteness has been softened by some purple, no longer burning out your retina while you dine there, I'm adding one star.", "author": "Eric v."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-19", "description": "Alright Thai food and an easy-to-spot location on Castro.  The two-person tables against the window are lovely if you can snag them; if not, erm, you can sit in the middle of things and listen to your neighbors' conversations--the tables are ridiculously close together.  I agree with the Amy E. who said the dining area is \"dark but not romantically so\"; much more \"dark so watch out so as not to trip over a chair.\"  (No, I didn't trip; just stumbled. Oof.)\n\nI tried a bit of my partner's pad thai and found it too sweet.  My pad see ewe was less sweet, but still less spicy than I would have preferred.  Most of the appetizers weren't available (on a Friday night?  Really?  We don't ask for incredibly bizarre things, I promise ...) but the fried spring rolls were alright.  Meh.  Pretty lukewarm experience overall.", "author": "Christina C."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-28", "description": "Meager. Timid. Overpriced. \n\nI figured Thai food wouldn't be hard to mess up...until I visited Thailand Restaurant in the Castro (2nd floor).Don't get me wrong- cool spot, great people, but they just don't know how to make Thai food. \n\nI took my parents to Muir woods for a walk in the rain. They got soaked. I figured they could use some hot and spicy soup to warm up their sensitive souls. Thai food should be the perfect remedy for a cold wintry SF day right? Not at this place. \n\nTom Yum soup was lukewarm. Their ultra spicy was a mild tingling on my tongue. Instead of the pleasant lemongrass flavor, my stomach was upset from cheap vinegary sauce. All the veges in the soup is from canned goods. \n\nThe Good:\n* Good location\n* Lunch menu\n\nThe Bad:\n* Jasmine rice was not well cooked. \n* Pad Thai was too sweet...did I taste some ketchup. \n* Expensive relative to other Thai places. \n\nThe Ugly:\n* lack of authenticity\n* lack of flavor\n* overcharge on everything\n\nBottom line is: save your money, if you're vegetarian, this place only has so so tofu, no organic fresh veges. Try another place.", "author": "Jack C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "There are many thai restaurants in the city, most  of them are fancier than this one. But I really like this one because it offers a good mix of pretty good food, reasonable prices, and very friendly staff.  The location is great, yet it's less busy than other places in the castro, maybe because it's on the second floor? The lunch combo is a really good deal.", "author": "G Y."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-11-26", "description": "I'm updating a previous post - I've downgraded from three to one star  The place is dirty - we were grossed out after reviewing the results of their health inspection.  We hope they clean up.  If so, we'll return to the Spicy Tofu Fried Rice that we miss so much.\n\n----------\nMy previous post from Nov '07:\n\nOne of my favorite Thai places in SF.  It's not the best Thai in SF, but the dishes that we favor are reliable and tasty.  \n\nTheir Spicy Tofu Fried Rice is a favorite, as is the Peanut Sauce Chicken.  The curries are acceptable.  The vegetable curry puffs are nice.  Some dishes haven't scored so high - we had a fried fish dish last night which wasn't so good.  The Tom Yum soup is good and the Pad Thai is as good as any.\n\nThe setting itself is not anything to write home about.  They have a lovely little Thai hut where the cash register is, but the rest of the place is painted in a not so appetizing purple with some beautiful accessories and some hideous.\n\nThe service has always been fine for us.  Once we were there and saw a couple walk out - we were wondering if there was some bug or roach near them, since they were looking around on the floor and on the wall - like they were looking to see where it went.  But we didn't see anything ourselves.\n\nAll in all, I can't give it higher than three stars, but we like the Tofu Fried Rice and the Peanut Sauce chicken well enough to keep coming back again and again, either for take out or sit down.", "author": "Bill V."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "Not bad but lack of spices like a real Thai restaurant, it made for white people.", "author": "Cyprus N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "At lunch today, Pad Thai with fresh crab OMG! Really well!", "author": "Lee S."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "My boyfriend love to drive across the bay to this place. It is one of our favorites. The food is good and the service is great. All that work there are efficient and remember us from our last visit. We have even told them it was our Anniversary and they bring something out for us free of charge. How often does that happen in a Restaurant anymore?\nThey even have a big back room for parties. We have had parties there and they always turn out wonderful.", "author": "Mikey M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-18", "description": "They remodeled. It looks FABULOUS. The food is good as always. Lots of great vegi choices. \n\nNow cuter on the inside that Thai Express Castro!", "author": "n s."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "Nothing in the Castro could be described as subtle, but even so I felt gratified indulging in this quiet symphony of flavor. \n\nI was very impressed with this place, mainly because of the value of it. \n\nThe place is decorated in a sort of modern style with some unusual textures on the plates and walls. Derek Zoolander would be a regular here. \n\nThe duck was well prepared and I was not let down by the ever impressive Thai curry. \n\nThe service is prompt, however very aloof and mechanical. This is not a powerful negative, but it is something to take into account before setting an atmosphere. \n\nVerdict: Excellent value, good food, interesting atmosphere and lighting.", "author": "Jay C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-12", "description": "This is a really great lunch spot.  The food is great, lunch special is cheap and good.  I really enjoy the potato curry puffs, the eggrolls and panang curry with tofu.  For $7 you get a ton of food.  The location is perfect.  2nd floor and look out over Castro street with a great view of the theater.  So far I have not found better Thai food in the castro.", "author": "Jonathan U."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-29", "description": "I usually have gone to Thai House Express for thai in the castro but my friend introduced me to Thailand Restaurant yesterday. We ate lunch there. We both had the pad see ew. It was very tasty and well priced - $6.95. The portion wasn't as huge as some, but I could still barely finish it. I liked the upstairs feel too. I will definitely come here again. The only thing that put me off was the sign outside - it looked kind of dated - but the inside is actually very nice and modern looking. Another good discovery.", "author": "Shannon R."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-14", "description": "I used to go here all the time.....until I went to cleanscores.com\n\nEEK.\n\nhttp://cleanscores.com/1699/", "author": "Jesse M."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-24", "description": "picture perfect pretty presentation...pricing per petite plated portions par...tasting of high sweet and high salty...strong overpowering of saucing and seasoning....begging for more thai spice heat....sure...pad thai standard and acceptable...sauteed meats slighty overseasoned masked in saucing...roast duck to red, yellow and green curries...typical standard americanized sweet and saucy \"authentic\" thai...spicy non-spicy...dishes and tastes un-memorable...but, plenty of empty seating for last minute dinners for small or large....", "author": "Hen A."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "Just concluded a lunch at this unpretentious Thai restaurant located on Casto Street in San Francisco. The meal was delicious and it was a great deal, especially considering the neighborhood. I highly recommend it (especially the green curry) to anyone.", "author": "Zachary L."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "We are weekly customer at this restaurant. I have not yet experienced better or more fresh Thai food. Every dish is artful in presentation and delicious - hot and tasty. The pumpkin curry comes served inside its gourd bowl and the Coconut soups are to DIE for.", "author": "Melody M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "The food here is solid yummy.  The wait staff are awesome friendly and attentive.  I liked the decor better before they remodeled a few years ago.  It's a little cold now.  They could warm it back up by adding a bunch of plants.  That would push it back to five stars.", "author": "Napoleon R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-30", "description": "I forget the exact name of what I ordered, but it was a spicy seafood (shrimp, scallops, squid) dish with wide noodles, basil leaves, and vegetables. The dish would have been better without the iceberg lettuce and under-ripe tomatoes. The staff was friendly and the menu was reasonably priced, but I am confident there are much better Thai restaurants in the area, and I will keep looking. \n\nIn a word Thailand Restaurant was unimpressive.", "author": "Megan M."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-04", "description": "My favorite Thai resutrant of all time.  Been giong here since 1992 when we referred to it as The King and have never had a bad experience.  Maybe I'm missing something, but why hasn't anyone yelped this place? hmmmm\n\nThis is the place that made me fall in love with Thai Food and my appreciation of Elephants.\n\nPad Thai Talay, to die for.", "author": "Moira K."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-21", "description": "All right, I was really hoping that this place would be better. I was honestly a bit disappointed as I got lured into the place by newspaper articles gracing the side of the entrance to the restaurant (one needs to walk up the stairs to 2nd floor to reach it). The newspaper articles showcased Leon Lai (Lai Ming) and Maggie (both are Hong Kong famous movie stars/singers) dining at the place while visiting SF. Upon reaching the 2nd floor, there was a host that greeted me and seated me to a table with a view of the Castro Theater.\n\nCustomer Service: I sat down by myself and received the menu fairly quickly. I would say the customer service here was 3.5 stars. It wasn't great, but at least they were timely and came to refill my water once. They also got my bill/check out fairly quickly after I asked for it and were attentive enough to recognize that I was ready to order. However, the waiters were not necessarily extra nice by any means.\n\nFood: I am a big fan of duck and ordered the roasted duck in red curry ($9.95). Rice (white) was ordered separately for an extra dollar. When I got both items, i was a bit shocked that the portions were a bit small (even for Castro standards cmon!!!). The scoop of rice was less than the size of my palm (very small indeed) and came in a little soap dish holder size rice plate. The duck curry came in a long dish, but very few pieces of duck and 4 pieces of pineapple. I have to give credit to the place for their saucing as it was pretty good- not too salty or spicy. It suited my taste buds well, but I was very VERY disappointed in the duck. I probably got a total of 5 actual pieces of duck and even within those pieces (about 2 inches long and 1/2 inch wide), half of it was seriously fat. Cmon now! I've never had duck in the bay area with that much fat. The duck wasn't very lean. True, sauce was great, but fatty duck doesn't make a girl happy. Then came the dessert I ordered because I wasn't full off the 5 pieces of duck and 4 pineapple slices. I ordered the roti (think Southeast Asian style \"bread\"/fried with condensed milk) for $3.00. I got it with the condensed milk on top of the \"bread\". I thought it was okay though it's hard to go wrong by pouring condense milk onto something like fried \"bread\". All together, my meal totaled $18.00 including a 15% ish tip. \n\nAmbiance: Credit for the restaurant for keeping part of the Victorian style facade and for not over decorating. During half way through my dinner, the waiter came by and placed a light candle on my table. I guess that was the centerpiece for later dinner times (I ate around 7:15pm) or so.  \n\nParking: Good luck. Street meters only. paid parking on weekdays and before 6pm. Weekends after 6pm and Sunday (all day) are free. I would suggest using public transit.\n\nTransit: Take BART and get off at any stop in downtown SF (my suggestion would be embaracaero bart station. Then ride/board a MUNI lightrail and get off at \n\nPayment: Takes VISA and Mastercard, but with min. 10 dollar purchase. Cash only otherwise.", "author": "Tina C."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "i have lived in san francisco for 13 and have been soming to Thailand Restaurant ever since i moved here.   i just read a terrible review of the place and am appalled.   i have never had a bad experience here, have always been greeted well, treated well, and never demanded of anything.  The food is great and i keep coming back.   And i don't even live in the neighborhood.", "author": "Mike F."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-20", "description": "I've been coming to this restaurant for years and have always enjoyed the homey decor, large servings of decent food and good service.  \nWell, times have changed the old place.\nThe new decor is a disaster.  Welcome to the '80s.  The uncomfortable, charmless part of the '80s.  The food on my last visit was not very good.\nChewy pad thai and a bland fish curry.  The servings of rice are quite small (what ever happened to the traditional decorative aluminum serving bowl?).  The prices have gone up and our usual $24 dinner for two now rang in at $40!  Finally, what have they done with the portraits of the King and Queen? (A requisite fixture in ALL Thai restaurants)\nToo bad, this used to be one of the Castro's little gems.", "author": "Colin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "We only went here because Thai House Express was closed last Sunday night (due to no hot water or something).  I was pleasantly surprised.  The prices are good and the food very tasty.  A little smaller portions than some Thai places, but that isn't really a bad thing.  I think this is our new \"go to\" Thai place in the Castro.", "author": "Bob C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "My husband & I love the food in the Castro District (and here is another one!) \nWe were promptly seated in a nice section by a window overlooking the street below. We placed our order I got the lunch combo of chicken satay along with mixed veggies. We ordered a sampler appetizer dish. I liked them all but really didn't care for the fish patty thing. My husband got the green curry and some beef dish. The dishes they bring the food out to you are huge and they serve it with a side of peanut sauce and a cucumber/onion mix and a big pile of jasmine rice. All real good. \nThey do keep an eye on your water levels, they must have refilled my water at least 4 times! I never had to ask for a refill (that's a plus) \nMaybe they should use bigger glasses - lol \nThis place has some good food (only wished it was closer to home) its gotta be authentic, if you take a look at your bill you'll notice its written in Thai.", "author": "Sandy N."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-06", "description": "My boss at my previous job took all his employees to dinner here on a regular basis.  Service is always friendly and pretty quick even during their busiest hours.  Favorite items here are the tom kha kai (chicken coconut soup) and pad se ew.", "author": "Michelle N."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "I've been back once since they're done the remodel. Looks like my theory runs true.  No longer purple, no longer as good and the prices have increased.", "author": "Yan E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "I love this restaurant and come here often.  Delivery is also very fast and always accurate.  I get their Pad See Ew and it's amazing.  Their prawn and vegetable tempura is also great.  This is by far the best Thai restaurant I have found in the Castro, Duboce Triangle and Lower Haight area.", "author": "M H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-20", "description": "This place has consistently been one of my favorite restaurants for over 10 years! It is sooo good! Love the gai ga praw, pra ram, tom ka gai, the list goes on & on! Also, they have gotten well informed about gluten here lately, and you can order many things without gluten or soy sauce... Yay!", "author": "laura g."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "good food, good service, good price, fun location. good view.\n\nlast time i was there, i had:\nduck curry\nchicken satay", "author": "Greg D."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-27", "description": "There are Thai restaurants a-plenty in San Francisco and the Castro has more than its fair share. Given the price point and generally decent service the mediocre food becomes bearable. Take away one of those items and honestly, why bother going. So is the case with Thailand Restaurant. There is nothing wrong with the food, for the most part it tastes like the food from the other two Thai restaurants located a block away. The service however is maddening. After getting seated it took about 10 minutes for someone to approach us about drinks and food. We ordered everything at once and everything came piece meal (if at all). Some people got all their food at once. Others got an appetizer and then nothing. One person ordered a salad, got their food 10 minutes after the last hot dish was brought to the table - but only after hounding the entire staff multiple times about the missing dish. Needless to say we ate our food cold. We were ready to pay and be gone before we were even done eating. Only the bill never came. We had to run after a server for the bill. Then we had to bring it to the cashier ourselves. Then we had to do the math for them. We noticed 2-3 other tables around us experienced the same issues. I think i did potential patrons a favor by turning their Open sign to Closed.", "author": "Ray C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "Don't understand why there are only three stars. Food is really good and authentic here. I highly recommend Thai omelet with minced chicken or pork (btw, it is not on the menu). Thai BBQ beef, yellow curry with chicken, eggplant with basil are really tasty. Sometimes, it can be kinda noisy. In general, staffs are nice and service is quick. High recommended.", "author": "Alex L."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-08", "description": "I have a love for Thai food, and this place was decent.  It wasn't excellent, but it had pretty good tasty classic dishes.  The price was very reasonable for the portions served, and the service wasn't too bad.  The ambiance of the restaurant was nice for the dinner I was there for.", "author": "Nancy C."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-23", "description": "I came here on Saturday night before catching a movie at the Castro Theater, and the second I opened the front door it dawned on me that this is the first place I've ever eaten Thai food! I came to SF on a trip in high school in 2001 and our chaperone brought us here. I remember thinking the pad thai was delicious, and I wish I'd ordered it this weekend because the green curry was pretty much what you might expect at a Thai restaurant. Green curry is green curry, right? I'm glad I found this place. I'll definitely be going back soon to check up on the pad thai and I'll update then.", "author": "Amy Z."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "Had lunch there today. The food was very impressive! Some of the best Pad Thai I've had. The lunch special was an amazing deal and the atmosphere was really nice. Definitely great quality...maybe even deserves 5 stars, but I usually save that for my top very very favorite restaurants. Highly recommend it and will be back!", "author": "Jason G."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-23", "description": "Conveniently located in the Castro but inside it's eclectic -- which is code for tacky decor. The bright neon lights from outside illuminate the main dining room giving a feel of vegas strip or a eating in cheap motel. But don't let that discourage you for the very safe and ordinary Thai food you can find here. Many dishes are around $9 for dinner....", "author": "Eric M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-03", "description": "This used to be our favorite place for Thai, both dine-in or delivery.  Last Saturday (02/27/10), three of us had dinner, ordering family-style.  However, only I ate some of one dish (Seafood Clay Pot).   As we paid the bill, I began to feel a bit unwell.  Arriving home (Noe Valley) I felt increasing nauseous .   Within 5 minutes I was violently ill.  Immediately I felt fine.  \n\nThe next evening I returned, with the leftovers.  I related the events to the hostess and 2 male staff (owners, perhaps).  Far from being apologetic, they were clearly skeptical and even hostile.   Caveat emptor.", "author": "duke k."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2007-02-02", "description": "Worst Thai place I have been to in the city so far.  The food was watered down and me and my bf sat their and looked at each other and laughed when the power wen off!! LOL....this was suppose to be our anniversary dinner but turned out to me an adventure.   That's all I can say about that lol", "author": "Rob P."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-22", "description": "Ordered delivery from here on a rainy Sunday, a shrimp dish and Tom Kah Gai - both were terrible. The Tom Kah Gai was coconut milk with button mushrooms and too-chewy chicken, barely any spice. Throwing out this delivery menu immediately.", "author": "Casey W."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-03", "description": "gross. I've only been here once and was only impressed by the decor - i wish i could say the same about the food. Thankfully I ate before or I would have starved! i ordered the lunch combo soup+ 2 entrees + salad for 9 bucks.  That should have sent red flags like crazy so i blame myself.  First the soup was watered down and with a funky super sweet taste? like they were making up the flavor with some sugar and chili pepper. I have had this type of tofu soup before so I knew the taste was very off. then the lunch combo came i had the chicken satay and a veggies w tofu.  The \"salad\" was 4 pieces of iceberg lettuce with hidden ranch.  f. my life. the veggies and tofu was actually quite good but it was about 1 cup worth of food.  the satay chicken was dry and not marinated nor thick  to the standards of other places. ugh.  I wanted to like this place because the location and decor are great but it comes down to the food for me. i would rather eat in a basement in Soma and  have good food than here.\n\nor walk down to the mission and get a taco", "author": "Paola L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-13", "description": "rumor has it many kung fu flicks were filmed here.\nhave I seen one? no...\nwhy they would film in a Thai restaurant I dunno...\nmaybe it's the food?\nor the service?\nit's all pretty good here.", "author": "Matt V."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-28", "description": "A hidden gem really. I always walk past the sign to this place and have always been intrigued. After a great show of The sound of music sing-a-long at Castro theater, we were hungry and decided to try this place. As we go up the stairs, the place is nice and clean. We are seated immediately and get a view of the castro sitting near the window! Sweet! The food was good, too! Spicy and flavorful. We had noodle dishes with shrimp...yum! The service is prompt and the staff are courteous! I will definitely come back to this place!!!!", "author": "Mel P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-23", "description": "I wish they would un-remodel the place back to way it was. I would give it five stars back then. The food is still good and the views are great. If you get a window seat it has a beautiful view of the Castro Theatre!! Be sure to have the tufo and spinach dish.", "author": "David P."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-08-07", "description": "Good ole reliable standby in fun second-floor street-gazing location (ask for a window table).  Pad kee mao goong -- chili-basil noodles with shrimp is quite good as are the fish cakes appetizer and the typical yellow curry with chicken and potatoes.  Nothing amazing here but have not had anything terrible either.  Good deal for lunch specials -- my friend Alberto and I used to eat here a lot for Saturday or Sunday lunch while out shopping and running errands.  The service is pretty good and the place is fairly quiet and above the fray that is Castro Street on the weekends.  If you use the loo, mind the gap or rather mind the step -- both when entering and exiting.  Almost took an embarrassing pratfall last night.", "author": "Xander S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-16", "description": "Ended up eating here because we were too lazy to wait 45 minutes for a table at Thai House Express (especially when their same menu is available at the Tenderloin Thai House with never a wait). Our window seat gave us a view over Castro, which was fun. My green bean tofu dish (I forget the name, you know the one every place serves) tasted good but left a thick coating of bright orange oil all over my plate. I didn't much like the pink walls and heard too many details of our neighbors' conversation, plus it was kind of dark and not romantically so.", "author": "Amy E."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-19", "description": "My friend and I went there early for dinner, so we got prime people-watching seating by the windows. Later another party was seated at the table next to us and it was a little awkward because we were quite close to each other. The food was good-great, very reasonable prices. I loved my friend's food better than mine though-she got the chicken dish with the rice noodles. It was perfect. I always try pad thai at thai restaurants to see how they prepare the most common standard thai dish. While it was good, I think they added too much of the sweet sauce and noodles. Lots of noodles, a little clumped together and more than the chicken with the noodles. Hmmm, I don't remember tasting the peanut sauce. It was decent, but  at this price, it was something I could swallow for sure.", "author": "Jenny W."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-04", "description": "Perfectly tasty Thai food with festive (read: colorful) decor and lots of vegetarian options. They'd get an extra star if rice was included with the entrees and if they delivered to my 'hood. HAYES VALLEY HATERS!", "author": "Elizabeth H."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-13", "description": "this used to be my favorite favorite go-to thai restaurant. i've just become a lot lazier since moving further away from here, but this place is definitely one of my top 3 fav thai restaurants in SF. \n\nthe service is amazing. the waiter tries to remember my and my friend's names bc we came here so often (i think he only remembers my friend's ---darn you generic vietnamese name, feels like high school).\n\nthe food is above average. always fresh, warm, and nicely presented. i love love love the the tom yum soup here. \n\nanother great plus is the ambiance. i love entering through the steps from below and getting a seat near the window to see the bustling streets of castro -- so aim for one of those if you can!", "author": "Amanda N."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "the service here is impecible!!!  They sat us quickly, served us quick, asked if i needed more, a refill, if we liked the food... I was very impressed!!  The vegetarian green curry with tofu is fantastic!!!!  I am usually very hard to please because I want spicy.. BUT I am so white people think I can't take it.  Well, I can take it.  If you read my other reviews you will note that I need snot running out of my nose and lots o water.. this place gave me what I was looking for!  woohoo for sniffles galore!!!  They also had a vege tom kha soup!!!  THE BEST I HAVE EVER HAD!!  to die for!!!!  affordable, clean, quick, great view upstairs looking down on the castro... can't wait to go back!!", "author": "blair k."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-16", "description": "really good, though not the greatest thai food around.  \n\nthailand restaurant gets four stars because:\n* they don't skimp on tofu (sooo many thai places do)\n* the food is pretty damn good.  i love the vegetarian spring rolls.\n* THEY DELIVER!  (seriously, a huge plus for a really good restaurant).\n\nplacing an order over the phone can be tough.  just be patient and make sure they repeat the order back to you.  they always get my order right in the end.", "author": "Karen R."}
{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-25", "description": "My partner and I went Saturday night about 7pm, it was deserted but soon got busy cause I think the movie let out next door.  We had 2 appitizers that were only OK, then the entrees came and he was about to send it back because he ordered the duck and all that came for him was an oval bowl of vegetables.  We poked the veggies aside and viola! a few chuncks of dark meat which was the duck.  It was like the old story of the fancy restaurant and the guy orders a steak and his plate comes but there is no steak so he moves a few peas and there is the steak.  Seriously.   My beef entree was good and served with a scoop of rice. Also a 7-up=$47.  Too much for too little and the food was mediocre.  Nice view window table tho.  Won't be back, too many other better places.", "author": "William G."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-10", "description": "I had a bad experience here. The atmosphere (looking over castro street) is nice, but the food wasn't very good. The pad see ew was slimy and lacked flavor. The yellow curry wasn't yellow, (red/brown) and didn't taste like curry. It wasn't cheap, though not expensive either, and left me wondering why the lack of quality? It confounded me given the other quality thai places in the city. I'm not going back.", "author": "Micah R."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-15", "description": "I used to come here every so often to have a scrumptious yet inexpensive meal with some friends and I would've given it 5 stars. But, I've returned twice ever since they remodeled and I would have to dock 2 stars out for the decor. Food and service were still awesome but the new look just didn't do it for me. It definitely lost much of it's old charm.", "author": "Charles U."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-16", "description": "I had dinner in that restaurant 3 nights in a row and had the yellow curry and each time it appears to become less appetizing.\n\nI honestly started my yelp account because i was so upset at the poor level of service i got. The curry was swimming in oil, like a lost tanker. I politely explain to the young lady who was acting as host who then, told me \"that how it was it made and i had it last time\". I ask her to take it way and she asks if i want it boxed to go. Seriously~\n\nI even had to write it on the back of my card receipt how annoyed i was. That's the last time my and my folks will venture to that place.\n\nP.S food at any restaurant can be bad, it the service and how mistakes are taken care of that really keeps me going to some restaurants.", "author": "dolce c."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-15", "description": "It's a shame they deserve only one star. I admit, the food is pretty good there, but it's the service that upset me. I found a long piece of hair in my water. It was disgusting. I was speechless, how could the waitress miss that (And I'm pretty sure it was her hair) ? I brought back the glass to her, told her what I found, and she just said \"I'll get you another one\". Not a single word of apology. On top of that, during the service, she slammed down the dishes, and drinks down on my table. No respect for the customer at all.", "author": "Jelly G."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-30", "description": "my friends and i are obsessed with this place. back in the spring (around the time they remodeled), it broke our hearts that they were closed for a couple of weeks. i get cravings for the food here.\n\ni love the cashew nut chicken. but like any thai place, avoid those dark, mysterious peppers - they are extremely spicy. the panang curry is also delicious. the ambience has changed since the remodeling, but the food is still just as tasty. \nonce while my friends and i were there late one evening, the waiter kindly asked if we'd be able to switch tables to make space for a larger party. we were completely fine moving, but they still gave us thai iced tea on the house. yum! the wait staff is very friendly as well.", "author": "Dina S."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-08", "description": "wow. we ordered delivery of a bunch of vegetarian dishes including the eggplant, spinach, tofu salad, and pad thai. sides of peanut sauce, cucumber salad, and brown rice. very clean tasting food - really not too greasy at all. food arrived in good time and was hot. reasonably priced - $68 incl. tip fed 4 of us very well with leftovers. will definitely order from here again.", "author": "Rossa S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-12", "description": "We ordered mango salad (day's special), pad thai and yellow chicken curry.  They all had good flavor, but noodle lumped together and potato in curry was undercooked.  \n\nAmbiance was good, but it was a little too dark to appreciate colors of our food.  It got a little noisy when more people arrived, as sound echoed well within the large room.\n\nPrice was very reasonable.", "author": "April H."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-19", "description": "My Partner and I stopped by after a movie on Saturday night. We have seen this place for years and decided to try it. What a mistake! There food is a poor excuse for Thai food and it is very overpriced. We ordered two appetizers; the Thai rolls and chicken satay before our entree. The Thai rolls were so hard and overcooked as to be unpleasant and we never received the satay. Our entrees were equally unimpressive and the pad Thai actually was bad. The wait staff was equally unimpressive, poor communication skills, brought the wrong wine twice, forgot our appetizers, and it took sooo long to get our food. \n\nWhen we asked for the check they asked about our food and we were very pleasant, but honest. She looked at us, said nothing and walked away. OK, so the check comes and the satay we never received is on the bill. So we explained we never received the satay and they immediately said OK and took the check back. When the check came back to the table the satay and price were whited out, but she did not change the total bill...HELLO. After discussing it with two other waiters and asking for a calculator, they adjusted our bill correctly. Never again, it is amazing such a restaurant can stay in business. Pass this one by and find one of the other good Thai places in the Castro.", "author": "Jeff H."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-19", "description": "Last Friday evening I had the pleasure of meeting up with a friend and dining at this establishment. Since my last visit quite a number of years ago, there has been some really eye-popping remodeling to the space, bringing it up to a more mod look. My friend ordered a cup of the tom ka gai soup (chicken coconut soup) and basil chicken, while I had the yum pla muk (calamari salad) and veggie raad na pak (flat noodles with tofu, broccoli, and a light gravy). My friend was in heaven with his selections. I have always enjoyed the piquant flavor combos in Thai salads, and this calamari dish was no exception--I love all the basic flavors of sweet, spicy, and sour coming through in that salad, as well as the perfectly blanched calamari. The raad na, however, had a disappointingly simple flavor profile and a bit off-putting texture in the gravy. Not sure what happened with the starches or other components in that dish. Other than that, I enjoyed the meal with a Singha(tm) beer and the company. And yes, I probably will return to try other dishes here.", "author": "Ryan T."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-23", "description": "Average thai experience. The menu was exhaustive, and the prices very reasonable. This could have been four stars, but felt that my chicken/eggplant dish was lacking in chicken, and the bean sauce seemed really, really oily. I did appreciate that there to go container was microwavable, and recyclable.", "author": "Jason B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-25", "description": "My favorite thai- decor went from one extreme( dark, purple, tacky) to another  ( sleek, hi-tech ) but the food is well priced and fabulous. The hostess /manager /Mum, holds it together with great style, humor and a winning smile. We love this place!", "author": "Philip R."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-22", "description": "I just spent three months traveling in Thailand, and the food here was great!  I especially loved the Panang curry with vegetables.  The servers were all very friendly and helpful, and accommodated us by bringing us something different when we misordered.  The vegetables were fresh and cooked well; the flavors went together perfectly; they have brown rice; and the presentation was great.  I would definitely go back!  Go for the nice table by the windows for a nice view of Castro.", "author": "Melissa M."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-30", "description": "I've enjoyed eating at Thailand Restaurant for over 15 years now.  However, while the food is still good, tonight I went there for the first time in quite a while and was terribly disappointed to discover that their recent attempt at \"remodeling\" has created a place where you have to scream and yell to be heard by the waiter and dinner companions.  This place used to have good sound-deadening, but no more.  Now it's an extremely loud place and I won't be going there again.  They lost a long-time, loyal customer.", "author": "Tony D."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-11", "description": "i end up here every couple of months, when my boyfriend decides he doesn't want to tip out to Clement Street and go to King of Thai.  you gotta love the lilac walls and the cobwebs trailing from the feet of the carved wood celestial orchestra figures. you gotta really love the chips atop the salad kak. you gotta really really love the requisite portraits of the ruling couple of Thailand and join me, won't you, in wondering why there are lame old jalapeno peppers in one of the condiment containers ... condiments, mind you, that one has to request and condiments, mind you again, that do not include ground peanuts or sugar.  but they do have that soft shell crab in peanut curry sauce thing that delights me every time i eat it ... and it has the word poo in its name so i have to point at it instead of saying it out loud.", "author": "Kevin M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-13", "description": "My boyfriend remembered this place from visiting San Francisco about 6 years ago and was frothing at the bit to go there for dinner.  It was my first experience with Thai food beyond the usual Satay and Pad Thai.  I'd have to say that it was pretty excellent, the portions were huge and the food was flavorful.  The deep fried tofu was pretty awesome and a magnificent chicken curry dish served out of a pineapple.  This one isn't on the menu, so ask for it.", "author": "H. H."}
{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "I love this place.  The food is good and staff is wonderful.  For a Castro location, they are great with kids even though we seldomly see children here.    It's our son favorite restaurant.   We always end up ordering Fish cake, Basil chicken, Tom yum gai, and Pad thai.  But the comfort Thai dishes here hit the spot.", "author": "David B."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-05", "description": "I had dinner last night with a friend at Thailand Restaurant.  I had not been in a few years, but it still continues to be a solid choice for Thai.  We ordered to share which included chicken satay, basil shrimp and green curry chicken over rice.  Everything had really even, nice flavors.  I certainly wasn't blown away, but I enjoyed the food, service and calming atmosphere.  I also like the fact that you are on the second floor with a direct view of the Castro theater.  I recommend for solid, reasonably priced Thai food in the Castro.", "author": "Erin K."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "J had been here before, and he did not like it. Since we have almost the same tastes, I never went there. Basically, of one of us tries something, we can tell if the other will like it. Then, recently, he had to go there for some reason, and he liked what he got. So we all ended up going, and I got to try it. The advice I was given was to try something that is NOT a curry. The first time, I tried some basil seafood thing. It was ok, nothing special. There is no sticky rice, just regular rice. The thai iced tea wasn't too good. we had some spring rolls which were tasty enough. Overall, it was ok, nothing great. Before I had a chance to yelp it, I went here again. the first time was a Saturday evening and we were seated right away. This time was after 9pm on a Thursday nite. They close at 10 but still seated us. This time I ordered what j always orders.  Just told the waitress, I'll have what he's having. It was a seafood thing with a red chile sauce... it was good. I liked it! The iced tea was better too. And, even though it was late, we weren't rushed out. b liked his soup too. My other roomie n likes this place too, so now that I know what I should order when I come here, its good, and I would come back again. so the moral of this story is, if you don't like this place the first time, give it a 2nd try. If you still don't like it, maybe you just don't like it.", "author": "Merredith L."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-19", "description": "First let me start by saying that both my husband and I have lived in San Francisco for over 25 years but neither of us had ever been in this restaurant.  The evening with my visiting two nieces started pleasantly enough.  We got a table right away and our drink order came quickly.  Things went downhill rather rapidly after that.  The appetizer that came out of the kitchen was the wrong item.  When I told the waiter it was the wrong thing, he insisted that what I ordered was correct.  I told him no that was not what I ordered.  He took it back and he was clearly pissed at us.  The first entree arrived before the correct appetizer did.  The girls and I all ordered three different types of pad thai (one with chicken, one vegetarian, and one with shrimp) -- okay so we weren't creative that evening -- and my husband ordered his usual yellow curry.  Things did not arrive at the table consistently and while husband was waiting for his rice, the waiter came out to tell us there was no white rice available.  He could have brown rice at the same price of white rice.  The pad thai was &quot;okay&quot; but it was a gelatinous mess that the minute it hit the plate started to congeal. The yellow curry was not very tasty and was made mostly from the cheaper dark meat.  But in addition to the rude service -- I gave the waiter a 15% tip which I probably shouldn't have -- the revenge was in their favor.  I had terrible diarrhea last night as soon as we got home.  I would love to see what previous reviewers were referring to about the CleanScores.com reviews, but they all show 100.  Something must be off on this one.  Next time, we'll skip this tomain house and go to Thai House Express at 599 Castro.", "author": "Jeff S."}
{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-29", "description": "i remember having a nice early evening dinner here by the picture window, and had fun viewing all the people moving to & fro Castro Street.   i also enjoyed the interiors!", "author": "Jerome Espinosa B."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "I've been coming here for fifteen years.\nAtmosphere:\nI personally love atmosphere including new touches like the new transparent waterfall over the glass window (used to be a fishtank), and I enjoy the modern textured white tiles on the dining room wall.\nThe gem studded dragons and shrine to Thai leaders as you know are a bit irrelevant now that Thailand has undergone a sea change of civil unrest. I miss the quaintness, but appreciate the modern Gay Redo. It looks like it got hit by the Fab Five and  - hello - its in the Castro after all.\nFinding the Yummy\n I notice one timers order lots and lots of the fried dishes. These diners leave with a lukewarm impression. Underneath the obligingly familiar \"American Eggroll\" taste for those \"who get the same thing every time\", are a selection of more Thati tasting more authentic dishes. Here are some suggestions:\nTry the appetiser called \"fresh rolls\", similar to summer rolls in a Vietnamese or Cambodian restaurant-soft, unfried and yummy sauce to go with---these are new; or the fish cake appetizers. Very nicely seasoned. Yes, pan fried is not the same as deep fried in pastry - is it? If you must, order the chicken satay.\nFor a beverage I highly reccommend the cold Young Coconut or HOT Thai tea. Try it. \nOrder a soup. Any soup. The coconut milk and lemongrass will make the entrees taste even better and get your digestive juices flowing. Just do it.\nFor an entree, I reccommend the clay pot entrees, or the lighter red, green or red curries. Any of the curry sauces are a delight. For much lighter fare, try the silver noodle (glass noodle) dishes. If you want to be adventurous, order Pad Thai and ask them to put extra shrimp paste in it!!!!!\nTry these tips and you will uncover a lovely Thai restaurant in the gayest neighborhood in America and the best view of a great American moviehouse, the Castro Theatre.", "author": "Nan L."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "I've come here for many years and I've had three meals here recently. The food was great each time, and the servers were very friendly. The prawn won ton appetizer (don't remember exactly what it was called) was delicious, as was the Tom Kha Gai on my last visit. I agree with those who don't like the \"updated\" decor. It's cold and not very charming. However, the food is still great and the prices are reasonable.", "author": "Nat M."}
{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-05", "description": "Their Pad Kee Mao (spicy noodle with chicken or pork), Gang Ped Yang (Roast Duck Red Curry), and Tom Yum Gai (Chicken spicy and sour soup are great!  Not too greasy.  Service is pretty fast and attentive.  A good place to go before heading to the movies across the street at the Castro Theatre.", "author": "Ellie K."}
{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-02", "description": "Barely edible.  Couldn't finish. Raisins in my pineapple fried rice.  Should have charged 1/2 of what they did (no kidding). Delivery driver tried to add 18% onto the delivery tab.  Avoid.", "author": "Gwen S."}
